{
  "metadata": {
    "case_name": "Co-operative Credit Society v. Raja Nandlal",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "MAHAJAN J."
    ],
    "case_number": "Appeal under Article 374(4) of the Constitution",
    "date_of_judgment": "1950-10-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Raja Nandlal was a member of the decree-holder society and was also its debtor. A dispute arose between him and the society and under the rules governing such societies the matter was referred to arbitration.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The arbitrator on the 19th Meher 1352 F., passed a decree against him in the sum of Rs. 8,100 payable in equal six monthly instalments with six per cent. interest, the first instalment being payable at the end of Azur 1353 F.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On the 2nd Dai 1353 F., under the provisions of section 42, clause d, of the Co-operative Societies Act the decree was sent for execution to the civil court on a certificate issued under the signature of one Moulvi Mohammed Hasan, Madadgar Nazim. The amount recoverable was stated as Rs. 8,100 principal and Rs. 666-0 interest.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On the same day the decree-holder presented an application for execution of the decree to the Civil Court, Balda, claiming recovery of Rs. 10,339-14-9. It was alleged that as default had been committed in the payment of the first instalment due in the month of Azur 1353 F, the whole decretal amount had become recoverable. It was prayed that the property detailed in the application be attached.",
      "type": "procedural",
      "date": null,
      "source": "decree-holder"
    },
    {
      "id": "f5",
      "text": "On 3rd Dai 1353 F., i.e., a day after the presentation of the application for execution, the judgment debtor deposited a sum of Rs. 1,000 towards the first instalment in the Office of the Registrar of Co-operative Societies and expressed his willingness to deposit any further amount that may be due towards that instalment.",
      "type": "procedural",
      "date": null,
      "source": "judgment_debtor"
    },
    {
      "id": "f6",
      "text": "The Nazims office stated in reply that as he had committed default in the payment of the first instalment the whole decree had become due and the amount of Rs. 1,000 would not be accepted.",
      "type": "procedural",
      "date": null,
      "source": "nazim_office"
    },
    {
      "id": "f7",
      "text": "Subsequently, however, on the 5th Dai 1353 F, a letter was issued by one Mohammed Aihsan, Assistant Madadgar Nazim, to the Civil Court, Balda, saying that Rs. 1,034 had been deposited in the Office of the Nizamat Co operative Credit Societies and therefore the proceedings in execution should be stayed or adjourned.",
      "type": "procedural",
      "date": null,
      "source": "assistant_madadgar_nazim"
    },
    {
      "id": "f8",
      "text": "On receipt of the letter in the civil court, the decree-holder raised an objection that the Registrar had no jurisdiction to stay execution of the decree as he was not an executing court. This objection was overruled by the court and it was held that under the provisions of section 42 of the Co-operative Credit Societies Act the Registrar retained the power of staying execution of the award decree even after the issue of a certificate by him. In the result the execution proceedings were stayed.",
      "type": "procedural",
      "date": null,
      "source": "civil_court"
    },
    {
      "id": "f9",
      "text": "Against this order an appeal was taken to the Sadar Adalat. The Sadar Adalat allowed the appeal partially and held that to the extent of the payment made the decree could not be executed but it could be executed with respect to future instalments as and when they would fall due. It further found that the default clause in the decree must be taken to have been condoned by the deposit of the first instalment in the office of the Registrar.",
      "type": "procedural",
      "date": null,
      "source": "sadar_adalat"
    },
    {
      "id": "f10",
      "text": "The decree-holder preferred a second appeal to the High Court but without any material success. The High Court held that there had been a default in the payment of the first instalment and the decree-holder had thus a right to execute the whole decree and that neither the Registrar nor the executing court could deprive the decree-holder of that right. In spite of this finding it took the view that the Registrar still retained jurisdiction to adjourn execution proceedings. The contention of the judgment-debtor that the certificate was bad as having been issued by a Madadgar Nazim was negatived. It was held that the Madadgar Nazim had delegated powers in this respect and that the defect, if any, stood cured by a fresh certificate signed by the Nazim himself. The result was that with these findings the decision of the executing court adjourning the execution proceedings was maintained.",
      "type": "procedural",
      "date": "24th Aban 1356 F.",
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Jurisdiction of the Registrar functioning under the Co-operative Credit Societies Act in respect to execution of decrees, particularly whether the Registrar can intervene during execution proceedings pending in a civil court on the basis of the certificate granted by him, accept payments, or stay execution.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there was a default in payment of the first instalment such that the whole decree became due, and whether such default was condoned by the deposit.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Validity of the certificate issued by Madadgar Nazim.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Registrar had no jurisdiction to stay execution of the decree as he was not an executing court.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 42, clause d, of the Co-operative Societies Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The certificate was bad as having been issued by a Madadgar Nazim.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Default clause condoned by deposit of first instalment.",
      "supporting_facts": [
        "f5",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The language employed in section 42, clause d, of the Cooperative Credit Societies Act, 1340 F., as amended: If an award given by the Registrar or by a person nominated by him, or by a committee of arbitrators is not acted upon, then the Registrar can have it enforced - a through a civil court on a certificate issued by him. The civil court will treat the award in the same way as its own decree b through a Revenue Court or officer by issuing a certificate to that court or officer.",
      "addresses_issue": "i1",
      "key_observation": "The language employed in this section does not place the Registrar on the same pedestal as a court passing the decree under the Civil Procedure Code. Under the Code a civil court passing a decree is also the court executing the decree. It has a dual capacity. The Registrar has the first capacity of a civil court but he has not been placed in the matter of execution in the same capacity as a civil court passing a decree."
    },
    {
      "id": "cr2",
      "text": "The only jurisdiction conferred on the Registrar is that he can issue a certificate and on that certificate he can send a decree either to the civil court or to a revenue officer. It may be that after issuing a certificate he may be entitled to cancel the certificate or issue another, or he may by withdrawing the certificate withdraw execution from a civil court and send it to a revenue court and vice versa. On the plain words of the section it cannot be held that the Registrar has been constituted an executing court or that any powers in the matter of the execution of the award decree have been conferred upon him.",
      "addresses_issue": "i1",
      "key_observation": "The act of the Registrar in accepting the first instalment was a clear trespass on the duties of the executing court. It is only in the executing court where payment towards satisfaction of the decree, the execution of which had been taken out, could be made."
    },
    {
      "id": "cr3",
      "text": "The Registrar could not alter or amend the decree passed by the Arbitrator at this stage.",
      "addresses_issue": "i1",
      "key_observation": "All the courts below have interpreted the section to mean that the Registrar as the court passing the decree has the same power as the court executing it. We are unable to agree in this view in view of the clear language employed in the section."
    },
    {
      "id": "cr4",
      "text": "The High Court held that there had been a default and the decree-holder was entitled to execute the whole decree, but still maintained the adjournment by Registrar.",
      "addresses_issue": "i2",
      "key_observation": "The High Court has given a decision contradictory to its own findings."
    },
    {
      "id": "cr5",
      "text": "As a fresh certificate was issued by the Nazim in order to cure a defect that might be said to exist in the original certificate because of its having been sent by the Madadgar Nazim, it is unnecessary to consider the contention that there was no proper certificate.",
      "addresses_issue": "i3",
      "key_observation": "The defect, if any, stood cured."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Registrar has no jurisdiction as executing court; cannot accept payments, stay execution, or intervene in pending execution proceedings in civil court.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Default occurred; whole decree due; deposit did not condone default as Registrar had no power to accept it.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Original certificate defect cured by fresh certificate from Nazim.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Co-operative Credit Societies Act, 1340 F.",
      "sections": [
        "Section 42 clause d"
      ],
      "relevance": "Governs enforcement of awards by Registrar via certificate to civil or revenue court; Registrar not executing court and lacks powers to stay, accept payment, or intervene in execution."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [],
      "relevance": "Analogy distinguished: court passing decree retains execution jurisdiction even if transferred; Registrar lacks such dual capacity."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 374(4)"
      ],
      "relevance": "Basis for appeal from High Court of Hyderabad."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; decisions of High Court, Sadar Adalat, and executing court set aside; executing court directed to proceed with execution from stage interfered by Registrar's letter.",
    "relief_granted": "Execution of full decree proceeds in Civil Court Balda.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The only jurisdiction conferred on the Registrar is that he can issue a certificate and on that certificate he can send a decree either to the civil court or to a revenue officer.",
      "speaker": "court",
      "significance": "Defines limits of Registrar's powers under s.42(d)."
    },
    {
      "text": "The act of the Registrar in accepting the first instalment was a clear trespass on the duties of the executing court.",
      "speaker": "court",
      "significance": "Explains why Registrar's intervention was invalid."
    },
    {
      "text": "The High Court has, in our opinion given a decision contradictory to its own findings.",
      "speaker": "court",
      "significance": "Critiques High Court's inconsistent holding on default and stay."
    }
  ],
  "_case_id": "1950_32",
  "_label": 1,
  "_text_length": 11427,
  "_extracted_at": "2026-02-10T19:15:32.613727"
}