{
  "metadata": {
    "case_name": "Criminal Miscellaneous Petitions Nos. 71 to 73 of 1950",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "Kania C.J."
    ],
    "case_number": "Criminal Miscellaneous Petitions Nos. 71 to 73 of 1950",
    "date_of_judgment": "1950-12-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "All the accused were charged with being members of the Communist Party wedded to the policy of overthrowing the existing Government at Hyderabad by violence and establishing in its place a communist regime.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "They demanded subscriptions towards their communist organization and some of the villagers who did not meet their demands were abducted on the 21st of September, 1948, and murdered.",
      "type": "material",
      "date": "1948-09-21",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "They were charged with various offences including murder before a special tribunal established under the regulations promulgated by the Military Governor under the authority of H.E.H. the Nizam.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Convicted and sentenced to death on the 9th, 13th and 14th of August, 1949, by separate judgments of the Special Tribunal.",
      "type": "procedural",
      "date": "1949-08-09",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Petitioners appealed from those judgments to the Hyderabad High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "High Court dismissed the appeals by its judgments dated the 12th, 13th and 14th December, 1949.",
      "type": "procedural",
      "date": "1949-12-12",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Petitioners applied to the High Court for a certificate to appeal to the Judicial Committee of the Hyderabad State on the 21st of January, 1950.",
      "type": "procedural",
      "date": "1950-01-21",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "H.E.H. the Nizam issued a firman on the 23rd of November, 1949, stating that the proposed Constitution of India was suitable for the government of Hyderabad and he accepted it as the Constitution of the Hyderabad State as one of the States of Part B in the First Schedule.",
      "type": "background",
      "date": "1949-11-23",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On the 26th of January, 1950, the Constitution of India became applicable to the Union of India and the Part B States.",
      "type": "background",
      "date": "1950-01-26",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Petitions originally filed for a certificate for leave to appeal to the Judicial Committee of the Privy Council of the Hyderabad State were amended to petitions under article 134 of the Constitution of India.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "A Division Bench of the High Court at Hyderabad considered the petitions and dismissed them on the ground that no such petitions lay under article 134 and on merits no case was made out.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Hyderabad courts were not courts within the territory of India when they pronounced their judgments on the 12th, 13th and 14th of December, 1949.",
      "type": "background",
      "date": "1949-12-12",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether any application under article 136 can be made to the Supreme Court under the circumstances of the case.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether on a consideration of the facts, if it has jurisdiction, the Court should grant special leave.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "On the 25th January, 1950, they had a right to move the High Court at Hyderabad for a certificate granting them leave to appeal to the Privy Council of the Hyderabad State, and such petitions were pending on that day. A right to appeal which existed cannot be impliedly taken away by the Constitution.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "Article 136"
    },
    {
      "id": "pa2",
      "text": "Persons who had rights of appeal, or time to file applications for certificate, or pending petitions would lose their right if article 136 is not construed to give a right of appeal to the Supreme Court.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Articles of the Constitution have to be construed according to their plain natural meaning and cases of hardship should not be brought to bear on the natural construction. Hard cases should not be permitted to make bad law.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Narrow construction will take away valuable rights of appeal which existed; words of article 136 wide enough to give such right.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Article 136"
    },
    {
      "id": "pa5",
      "text": "Interpretation sought by State on article 136 will require insertion of the word 'hereafter', for which there is no justification.",
      "supporting_facts": [],
      "legal_basis": "Article 136"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "If wide construction given to article 136 it will permit applications without limitation as to period, old judgments called into question, and judgments final in states without Privy Council-like courts subject to appeal though no such appeal lay before.",
      "supporting_facts": [],
      "legal_basis": "Article 136"
    },
    {
      "id": "ra2",
      "text": "Every legislation is primarily prospective and not retrospective. A right of appeal has to be given specifically by a statute and it is not merely a procedural right.",
      "supporting_facts": [
        "f9",
        "f12"
      ],
      "legal_basis": "Delhi Cloth and General Mills Ltd. v. Income Tax Commissioner, Delhi (54 I.A. 421); The Colonial Sugar Refining Co. Ltd. v. Irving (1905 A.C. 369)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under article 374(4), jurisdiction of Privy Council in Part B States ceased on commencement of Constitution, and pending proceedings transferred to Supreme Court, but no proceeding or appeal pending before Hyderabad Privy Council, so nothing transferred.",
      "addresses_issue": "i1",
      "key_observation": "No jurisdiction transferred as nothing pending."
    },
    {
      "id": "cr2",
      "text": "Question of hardship cannot affect true meaning of words in Constitution; approach articles irrespective of considerations of hardship.",
      "addresses_issue": "i1",
      "key_observation": "Hard cases should not make bad law."
    },
    {
      "id": "cr3",
      "text": "Article 136: Supreme Court may grant special leave from any judgment etc. by any court or tribunal in the territory of India. Hyderabad High Court not in territory of India when judgments passed on 12-14 Dec 1949.",
      "addresses_issue": "i1",
      "key_observation": "Territory of India defined in Art 1; Hyderabad not part before 26 Jan 1950."
    },
    {
      "id": "cr4",
      "text": "Legislation prospective only; no reason to depart from normal mode. No express or implied provision giving jurisdiction over pre-Constitution Hyderabad judgments.",
      "addresses_issue": "i1",
      "key_observation": "Right of appeal must be specific."
    },
    {
      "id": "cr5",
      "text": "Rights from Bombay High Court etc. preserved via existing laws transferred to Federal Court then Supreme Court via Art 135.",
      "addresses_issue": "i1",
      "key_observation": "No anomaly as prior rights preserved."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Supreme Court has no jurisdiction under Article 136 to grant special leave to appeal from judgments of Hyderabad High Court dated 12th, 13th and 14th December 1949, as those courts were not in the territory of India at the time.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Delhi Cloth and General Mills Ltd. v. Income Tax Commissioner, Delhi Another",
      "citation": "54 I.A. 421",
      "treatment": "followed",
      "relevance": "Right of appeal must be specifically given; legislation prospective."
    },
    {
      "case_name": "The Colonial Sugar Refining Co. Ltd. v. Irving",
      "citation": "1905 A.C. 369",
      "treatment": "followed",
      "relevance": "Right of appeal must be specifically given; legislation prospective."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 136",
        "Article 374(4)",
        "Article 133",
        "Article 134",
        "Article 135",
        "Article 1"
      ],
      "relevance": "Defines jurisdiction of Supreme Court for appeals; territory of India; abolition of Privy Council jurisdiction; special leave limited to courts in territory of India."
    },
    {
      "name": "Abolition of Privy Council Jurisdiction Act, 1949",
      "sections": [],
      "relevance": "Transferred Privy Council jurisdiction (except pending) to Federal Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Petitions under Article 136 dismissed for lack of jurisdiction as Hyderabad High Court judgments predated Constitution's applicability and were not from courts in territory of India.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Hard cases should not be permitted to make bad law.\"",
      "speaker": "court",
      "significance": "Rejects hardship argument in constitutional interpretation."
    },
    {
      "text": "\"The territory of the Government of H.E.H. the Nizam was never the territory of India before the 26th of January, 1950.\"",
      "speaker": "court",
      "significance": "Core reason for lack of jurisdiction under Art 136."
    },
    {
      "id": "kq3",
      "text": "\"Prima facie, every legislation is prospective and even without the use of the word hereafter the language of article 136 conveys the same meaning.\"",
      "speaker": "court",
      "significance": "Confirms prospective application of Art 136."
    }
  ],
  "_case_id": "1950_56",
  "_label": 0,
  "_text_length": 15563,
  "_extracted_at": "2026-02-10T19:15:24.566477"
}