{
  "metadata": {
    "case_name": "Brij Bhushan and another v. Chief Commissioner of Delhi",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "Kania C.J.",
      "Patanjali Sastri J.",
      "Mehr Chand Mahajan J.",
      "Mukherjea J.",
      "Das J.",
      "Fazl Ali J. (dissenting)"
    ],
    "case_number": "Petition No. XXIX of 1950",
    "date_of_judgment": "1950-05-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Application under article 32 of the Constitution praying for writs of certiorari and prohibition to the Chief Commissioner of Delhi.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "First applicant is printer and publisher of English weekly 'Organizer' of Delhi, second applicant is the editor.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 2nd March 1950, Chief Commissioner of Delhi, in exercise of powers under section 7(1)(c) of East Punjab Public Safety Act, 1949 (extended to Delhi Province), issued order requiring submission for scrutiny before publication of all communal matter and news and views about Pakistan including photographs and cartoons other than those from official sources or specified news agencies.",
      "type": "material",
      "date": "1950-03-02",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Order recites that Chief Commissioner is satisfied that Organizer has been publishing highly objectionable matter constituting a threat to public law and order and that action is necessary for preventing or combating activities prejudicial to public safety or maintenance of public order.",
      "type": "material",
      "date": "1950-03-02",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "East Punjab Public Safety Act, 1949 passed to provide special measures to ensure public safety and maintenance of public order; extended to Delhi Province.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Section 20 of the Act allows Provincial Government to declare area as dangerously disturbed; Delhi Province notified as such.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether section 7(1)(c) of East Punjab Public Safety Act, 1949 infringes fundamental right to freedom of speech and expression under article 19(1)(a) and is not justified under clause (2) of article 19.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether imposition of pre-censorship authorised by section 7(1)(c) falls within the reservation of clause (2) of article 19.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Section 7(1)(c) authorises imposition of restriction on publication not justified under article 19(2) as it does not relate to matter which undermines security of or tends to overthrow the State.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Article 19(1)(a) and 19(2)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Section 7(1)(c) is for preventing or combating activity prejudicial to public safety or maintenance of public order; confined to particular subject connected with public safety or public order.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "East Punjab Public Safety Act, 1949 section 7(1)(c); Entry 1 List II Government of India Act, 1935"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Imposition of pre-censorship is restriction on liberty of the press, essential part of freedom of speech and expression under article 19(1)(a); liberty of press consists in no previous restraint upon publications.",
      "addresses_issue": "i2",
      "key_observation": "Restriction does not fall within article 19(2); follows Romesh Thappar v. State of Madras."
    },
    {
      "id": "cr2",
      "text": "Dissent: Public safety denotes security of the State; public order includes maintenance of public tranquillity; Act provides special measures for serious disorders affecting security of State; section 7(1)(c) saved by article 19(2) as relates to matters undermining security of State.",
      "addresses_issue": "i2",
      "key_observation": "Public disorder undermines security of State; Act's dominant purpose is public safety in special situations."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 7(1)(c) of East Punjab Public Safety Act, 1949 held unconstitutional as it infringes article 19(1)(a) and not saved by article 19(2).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Romesh Thappar v. The State of Madras",
      "citation": "Petition No. XVI of 1950",
      "treatment": "followed",
      "relevance": "Decision concludes present case; same considerations on article 19(1)(a) and (2)."
    },
    {
      "case_name": "Blackstone's Commentaries",
      "citation": "Vol. IV, pp. 151, 152",
      "treatment": "referred",
      "relevance": "Liberty of press consists in no previous restraints upon publications."
    },
    {
      "case_name": "Niharendu Dutt Majumdar v. The King",
      "citation": "1942 F.C.R. 38",
      "treatment": "referred",
      "relevance": "Sedition gist is public disorder or likelihood thereof."
    },
    {
      "case_name": "King Emperor v. Sadashiv Narayan Bhalerao",
      "citation": "74 IA",
      "treatment": "distinguished",
      "relevance": "Sedition under section 124A IPC not requiring incitement to disorder."
    },
    {
      "case_name": "Rex v. Governor of Wormwood Scrubbs Prison",
      "citation": "1920 2 KB 305",
      "treatment": "followed",
      "relevance": "Public safety includes prevention of internal disorder."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 19(1)(a)",
        "Article 19(2)",
        "Article 12"
      ],
      "relevance": "Basis for petition; freedom of speech; saving clause; definition of State."
    },
    {
      "name": "East Punjab Public Safety Act, 1949",
      "sections": [
        "Section 7(1)(c)",
        "Section 20"
      ],
      "relevance": "Authorises pre-censorship order; declaration of disturbed area."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Section 100",
        "Entry 1 List II"
      ],
      "relevance": "Legislative competence for public order."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Petition allowed; impugned order of Chief Commissioner dated 2nd March 1950 quashed for reasons in Romesh Thappar v. State of Madras.",
    "relief_granted": "Writs of certiorari and prohibition issued; order quashed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the liberty of the press consists in laying no previous restraints upon publications, and not in freedom from censure for criminal matter when published.",
      "speaker": "court",
      "significance": "Defines liberty of press under article 19(1)(a)."
    },
    {
      "text": "As this question turns on considerations which are essentially the same as those on which our decision in Petition No. XVI of 1950 was based, our judgment in that case concludes the present case also.",
      "speaker": "court",
      "significance": "Majority relies on Romesh Thappar to strike down provision."
    },
    {
      "text": "public safety may be taken to denote safety or security of the State.",
      "speaker": "court",
      "significance": "Dissent interprets key term to uphold Act under article 19(2)."
    }
  ],
  "_case_id": "1950_13",
  "_label": 1,
  "_text_length": 26413,
  "_extracted_at": "2026-02-08T22:11:56.499982"
}