{
  "metadata": {
    "case_name": "Appellant (Decree-holder) v. Respondent (Judgment-debtor)",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "FAZL ALI J."
    ],
    "case_number": "Civil Appeal No. LI of 1949",
    "date_of_judgment": "1950-03-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On the 21st August, 1940, a preliminary mortgage decree was passed ex parte in a suit instituted by the appellant to enforce a mortgage.",
      "type": "procedural",
      "date": "1940-08-21",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On the 19th September, 1940, the judgment-debtor made an application under Order IX, rule 13, of the Civil Procedure Code for setting aside the ex parte decree, but this application was rejected on the 7th June, 1941.",
      "type": "procedural",
      "date": "1940-09-19",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On the 11th July, 1941, the judgment-debtor filed an application under Section 36 of the Bengal Money Lenders Act, for reopening the preliminary decree, but this application was dismissed for default of appearance on the 20th December, 1941.",
      "type": "procedural",
      "date": "1941-07-11",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Thereafter, a final mortgage decree was passed in favour of the appellant, on the 22nd December.",
      "type": "procedural",
      "date": "1941-12-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The judgment-debtor then made an application under Order IX, rule 9, of the Civil Procedure Code for the restoration of the proceedings under Section 36 of the Money Lenders Act. The application was however dismissed on the 1st June, 1942, both on the ground that no sufficient cause for the non-appearance of the applicant and his failure to take steps in the proceedings was shown and on the ground that no purpose would be served by reopening the preliminary decree after the final decree had been passed.",
      "type": "procedural",
      "date": "1942-06-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The judgment-debtor thereafter preferred an appeal to the High Court at Calcutta from the decision dismissing his application under Order IX, rule 9, but the appeal was dismissed for non-prosecution, on the 3rd July, 1944.",
      "type": "procedural",
      "date": "1944-07-03",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On the 9th April, 1945, the appellant filed an application for executing the decree against the original judgment-debtor, though he had died previously, and this application was dismissed for default on the 11th May, 1945.",
      "type": "procedural",
      "date": "1945-04-09",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On the 2nd June, 1945, the present application for execution was filed.",
      "type": "procedural",
      "date": "1945-06-02",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The first court held that the decree was time barred, but the High Court has come to the opposite conclusion.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether the decree under execution is barred by limitation",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "the case falls under either clause 2 or clause 3 of article 182 of the Indian Limitation Act, specifically clause 3, as the application made by the judgment-debtor for reopening the preliminary mortgage decree under Section 36 of the Money-lenders Act must be regarded as an application for review and time should be held to run from the date of the final order passed in the proceedings connected with that application",
      "supporting_facts": [
        "f3",
        "f5",
        "f6"
      ],
      "legal_basis": "Article 182 clauses 2 and 3, Indian Limitation Act; Section 36, Bengal Money Lenders Act"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is quite clear that the application for execution having been made more than three years after the date of the final decree, it must be held to be time-barred, unless the case falls under either clause 2 or clause 3 of article 182 of the Indian Limitation Act.",
      "addresses_issue": "i1",
      "key_observation": "Time-barred unless covered by specified clauses."
    },
    {
      "id": "cr2",
      "text": "The important words in clause 3 of article 182 are 'where there has been a review' and 'the decision passed on the review'. These words show that before a case can be brought under article 182, clause 3, it must be shown firstly that the court had undertaken to review the relevant decree or order and secondly, that there has been a decision on the review.",
      "addresses_issue": "i1",
      "key_observation": "Requirements for 'review' under clause 3."
    },
    {
      "id": "cr3",
      "text": "Even if it be assumed that the word 'review' has been used in article 182 in a large sense and that the application for reopening the decree under Section 36 of the Bengal Money Lenders Act was an application for review, the appellant cannot succeed, because the court never undertook or purported to review the decree in question. What actually happened was that the application under Section 36 for reopening the preliminary decree (not the final decree which is the decree sought to be executed) was dismissed for default and the application under Order IX, rule 9, of the Civil Procedure Code for the restoration of the proceedings under Section 36 of the Money Lenders Act was also dismissed.",
      "addresses_issue": "i1",
      "key_observation": "No review undertaken; application was for preliminary decree, dismissed for default."
    },
    {
      "id": "cr4",
      "text": "In our opinion, there is no substance in this contention.",
      "addresses_issue": "i1",
      "key_observation": "Appellant's contention rejected."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The application under Section 36 of the Bengal Money Lenders Act does not constitute a review under clause 3 of Article 182 of the Indian Limitation Act, as the court never undertook to review the relevant decree (final decree) and the application targeted the preliminary decree.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order IX rule 13",
        "Order IX rule 9",
        "Section 110"
      ],
      "relevance": "Applications to set aside ex parte decree, restoration of proceedings dismissed for default, certificate for appeal to Supreme Court"
    },
    {
      "name": "Bengal Money Lenders Act",
      "sections": [
        "Section 36"
      ],
      "relevance": "Application for reopening the preliminary decree"
    },
    {
      "name": "Indian Limitation Act",
      "sections": [
        "Article 182 clauses 2 and 3"
      ],
      "relevance": "Limitation period for execution application starts from date of final decree or order unless extended by appeal/review"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, holding that the execution application filed on 2nd June 1945 is time-barred as it was made more than three years after the final decree of 22nd December 1941 and does not fall under clause 2 or 3 of Article 182 of the Limitation Act, reversing the High Court's conclusion.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The only question to be decided in this appeal... is whether the decree under execution is barred by limitation.",
      "speaker": "court",
      "significance": "Frames the sole issue before the court"
    },
    {
      "text": "In our opinion, there is no substance in this contention.",
      "speaker": "court",
      "significance": "Rejects appellant's key argument on limitation"
    },
    {
      "text": "These words show that before a case can be brought under article 182, clause 3, it must be shown firstly that the court had undertaken to review the relevant decree or order and secondly, that there has been a decision on the review.",
      "speaker": "court",
      "significance": "Defines requirements for 'review' under Limitation Act"
    }
  ],
  "_case_id": "1950_4",
  "_label": 0,
  "_text_length": 4709,
  "_extracted_at": "2026-02-08T22:12:08.273346"
}