{
  "metadata": {
    "case_name": "Karta of Hindu Undivided Family v. Income Tax Authorities",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "Fazl Ali J."
    ],
    "case_number": "Civil Appeal No. XXXVIII of 1949",
    "date_of_judgment": "1950-12-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is the karta of a joint Hindu family living in Ceylon with his wife, son and three daughters, domiciled in Ceylon.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant carries on business in Colombo under the name General Trading Corporation.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant owns a house, immovable property, investments and shares in two firms at Vijayapuram and Nagapatnam in British India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In the year of account 1941-42 (basis for 1942-43 assessment), appellant visited British India on seven occasions, total stay 101 days.",
      "type": "material",
      "date": "1941-42",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "During stays in British India, appellant attended litigation relating to family lands in trial court and court of appeal.",
      "type": "material",
      "date": "1941-42",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "During stays, appellant attended income-tax proceedings for family income assessment at Karaikudi and Madras.",
      "type": "material",
      "date": "1941-42",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On one occasion, appellant obtained extension of time for payment of tax after interviewing authority.",
      "type": "material",
      "date": "1941-42",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant did not produce file of correspondence with Colombo business to show management and control situated in Colombo.",
      "type": "material",
      "date": "1941-42",
      "source": "income-tax authorities"
    },
    {
      "id": "f9",
      "text": "Appellant started two partnership businesses in India on 25th February 1942 and remained in India for some time after commencement.",
      "type": "material",
      "date": "1942-02-25",
      "source": "income-tax authorities"
    },
    {
      "id": "f10",
      "text": "Appellant has a house at Kanadukathan where his mother lives.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Income-tax Officer and Assistant Commissioner held appellant resident under section 4A(b), liable for foreign income.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Income-tax Appellate Tribunal held no act of management or control exercised in British India, not liable for foreign income.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Madras High Court (Gentle C.J. and Patanjali Sastri J.) on reference under section 66(1), dated August 22, 1947, held family resident under section 4A(b).",
      "type": "procedural",
      "date": "1947-08-22",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appellant called upon to adduce evidence that control and management wholly outside British India, but correspondence and material evidence not produced.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "During major portion of accounting period (year ending 12th April 1942), appellant controlling businesses in Burma and Saigon, no evidence control only from Colombo.",
      "type": "disputed",
      "date": "1941-04-13 to 1942-04-12",
      "source": "appellate_assistant_commissioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in the circumstances of the case, the assessee a Hindu undivided family is resident in British India under section 4A(b) of the Income-tax Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No act of management or control exercised by appellant during stay in British India; control and management wholly situated outside British India.",
      "supporting_facts": [
        "f1",
        "f2",
        "f4"
      ],
      "legal_basis": "Section 4A(b) of Income-tax Act"
    },
    {
      "id": "pa2",
      "text": "Mere activity in British India does not create residence; visits for litigation and tax proceedings do not shift seat of control.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Principles from English cases on central management and control"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant's stays and activities (litigation, tax proceedings, starting businesses) show control and management not wholly outside British India.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": "Section 4A(b) of Income-tax Act"
    },
    {
      "id": "ra2",
      "text": "No correspondence produced to show control from Colombo; presumption that control exercised during visits to India.",
      "supporting_facts": [
        "f8",
        "f14",
        "f15"
      ],
      "legal_basis": "Onus on assessee to prove exception under section 4A(b)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 4A(b) presumes HUF resident unless control and management of its affairs situated wholly without British India; 'affairs' relevant to income.",
      "addresses_issue": "i1",
      "key_observation": "Control and management means controlling and directive power, head and brain, functioning with permanence; may be divided."
    },
    {
      "id": "cr2",
      "text": "Mere fact of house in Kanadukathan or 101 days stay, attending litigation/tax matters does not shift seat of control or create second centre.",
      "addresses_issue": "i1",
      "key_observation": "Mere activity does not create residence; test is central management and control."
    },
    {
      "id": "cr3",
      "text": "High Court took narrow view by assuming attendance to affairs brings within rule; correct approach considers overall control from Colombo but onus on assessee.",
      "addresses_issue": "i1",
      "key_observation": "Assessee failed to produce evidence (correspondence) showing control of Indian affairs from Colombo."
    },
    {
      "id": "cr4",
      "text": "Principles from English cases: residence where central management and control abides; possible dual residence if vital functions in both places.",
      "addresses_issue": "i1",
      "key_observation": "Not established that control wholly outside."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Hindu undivided family is resident in British India under section 4A(b) as control and management of affairs not shown to be situated wholly without British India.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "De Beers Consolidated Mines Ltd. v. Howe",
      "citation": "5 Tax Cas. 198",
      "treatment": "followed",
      "relevance": "Company resides where central management and control actually abides; real business carried on."
    },
    {
      "case_name": "Calcutta Jute Mills v. Nicholson",
      "citation": "1876 1 Ex. D. 428",
      "treatment": "followed",
      "relevance": "Company resides where real business carried on, central management and control."
    },
    {
      "case_name": "Cessna Sulphur Company v. Nicholson",
      "citation": "1876 1 Ex. D. 428",
      "treatment": "followed",
      "relevance": "Company resides where real business carried on."
    },
    {
      "case_name": "Swedish Central Railway Company Limited v. Thompson",
      "citation": "9 Tax Cas 373",
      "treatment": "followed",
      "relevance": "Locality of residence determined by head, seat and directing power; principles of control and management."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "Section 66(1)",
        "Section 4A(b)"
      ],
      "relevance": "Reference to High Court; definition of residence for HUF unless control and management wholly outside British India."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; High Court judgment upheld holding the assessee Hindu undivided family resident in British India under section 4A(b) liable to assessment on foreign income as control and management not proved wholly outside.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A company resides for purposes of income-tax where its real business is carried on... the real business is carried on where the central management and control actually abides.\"",
      "speaker": "court",
      "significance": "Adopts English test for residence applicable to section 4A(b)"
    },
    {
      "text": "\"Control and management signifies... the controlling and directive power, the head and brain... situated implies functioning... with some degree of permanence.\"",
      "speaker": "court",
      "significance": "Clarifies meaning of 'control and management' in section 4A(b)"
    },
    {
      "text": "\"Mere activity by the company in a place does not create residence... central management and control... may be divided.\"",
      "speaker": "court",
      "significance": "Distinguishes activity from control; allows for dual residence"
    }
  ],
  "_case_id": "1950_53",
  "_label": 0,
  "_text_length": 12033,
  "_extracted_at": "2026-02-10T19:15:30.371130"
}