{
  "metadata": {
    "case_name": "Appellant (Karta of Hindu Undivided Family) v. Respondent (Income-tax Authorities)",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "Fazl Ali J."
    ],
    "case_number": "Civil Appeal No. XXXVIII of 1949",
    "date_of_judgment": "1950-12-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is the karta of a joint Hindu family and has been living in Ceylon with his wife, son and three daughters, and they are stated to be domiciled in that country.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "He carries on business in Colombo under the name and style of the General Trading Corporation.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "He owns a house, some immovable property and investments in British India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "He has shares in two firms situated at Vijayapuram and Nagapatnam in British India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In the year of account, 1941-42 (basis of assessment for 1942-43), the appellant visited British India on seven occasions and the total period of his stay in British India was 101 days.",
      "type": "material",
      "date": "1941-42",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "During such stays, he personally attended to a litigation relating to the family lands both in the trial Court and in the Court of appeal.",
      "type": "material",
      "date": "1941-42",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "He was attending the income-tax proceedings relating to the assessment of the family income, appearing before the income-tax authorities at Karaikudi and Madras.",
      "type": "material",
      "date": "1941-42",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "On one occasion, he obtained an extension of time for payment of the tax after interviewing the authority concerned.",
      "type": "material",
      "date": "1941-42",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "He did not produce the file of correspondence with the business in Colombo so as to help in determining whether the management and control of the business was situated in Colombo.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "He had started two partnership businesses in India on 25th February, 1942, and remained in India for some time after the commencement of those businesses.",
      "type": "material",
      "date": "1942-02-25",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "The assessee has a house at Kanadukathan, where his mother lives.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "During a major portion of the accounting period (year ending 12th April, 1942) the appellant was controlling the businesses in Burma and Saigon and there is no evidence that such control was exercised only from Colombo.",
      "type": "disputed",
      "date": "1941-04-13 to 1942-04-12",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "No correspondence or other evidence was produced which would show that any instructions were issued from Colombo as regards the management of the affairs in British India especially as it was an unauthorized clerk who was looking after such affairs.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Income-tax Officer and Assistant Commissioner of Income-tax held that the appellant was a resident within the meaning of section 4A(b) and liable to be assessed in respect of his foreign income.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Income-tax Appellate Tribunal held that no act of management or control was exercised by the appellant during his stay in British India and therefore not liable to assessment in respect of income outside British India.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Madras High Court (Gentle C.J. and Patanjali Sastri J., dated August 22, 1947) held that the Tribunal misdirected itself, control and management not wholly outside British India, family resident under section 4A(b).",
      "type": "procedural",
      "date": "1947-08-22",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in the circumstances of the case, the assessee a Hindu undivided family is resident in British India under section 4A(b) of the Income-tax Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No act of management or control was exercised by the appellant during his stay in British India; control and management situated wholly in Colombo; family domiciled in Ceylon.",
      "supporting_facts": [
        "f1",
        "f2",
        "f5",
        "f11"
      ],
      "legal_basis": "Section 4A(b) of the Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant exercised acts of management and control during 101 days stay in British India (litigation, tax proceedings, starting businesses); did not produce evidence of control from Colombo; control not wholly outside British India.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7",
        "f8",
        "f9",
        "f10",
        "f12",
        "f13"
      ],
      "legal_basis": "Section 4A(b) of the Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 4A(b) presumes HUF resident unless control and management of its affairs situated wholly without British India; 'control and management' means central management and control, head and brain, where directing power functions with permanence.",
      "addresses_issue": "i1",
      "key_observation": "Mere activity in a place does not create residence; possible dual residence if vital functions in both places."
    },
    {
      "id": "cr2",
      "text": "Affairs mean those relevant to Income-tax Act relating to income; onus on assessee to prove control wholly outside; appellant failed to produce correspondence showing control of Indian affairs from Colombo.",
      "addresses_issue": "i1",
      "key_observation": "Visits for litigation, tax proceedings, starting businesses do not shift seat of control; mere activity not test."
    },
    {
      "id": "cr3",
      "text": "High Court took narrow view by assuming attendance to affairs during visits brought case within rule; more correct approach considers whether control of Indian affairs exercised from Colombo, which not established.",
      "addresses_issue": "i1",
      "key_observation": "Karta permanently lives in Colombo, family domiciled there, but evidence lacking for wholly outside control."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Hindu undivided family is resident in British India unless control and management of its affairs is situated wholly without British India; onus on assessee to prove exception.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "De Beers Consolidated Mines Ltd. v. Howe",
      "citation": "5 Tax Cas. 198",
      "treatment": "followed",
      "relevance": "Central management and control determines residence of corporation: where it really keeps house and does business."
    },
    {
      "case_name": "Calcutta Jute Mills v. Nicholson",
      "citation": "1876 1 Ex. D. 428",
      "treatment": "followed",
      "relevance": "Company resides where its real business is carried on, i.e., where central management and control abides."
    },
    {
      "case_name": "Cessna Sulphur Company v. Nicholson",
      "citation": "1876 1 Ex. D. 428",
      "treatment": "followed",
      "relevance": "Company resides where its real business is carried on."
    },
    {
      "case_name": "Swedish Central Railway Company Limited v. Thompson",
      "citation": "9 Tax Cas 373",
      "treatment": "followed",
      "relevance": "Locality of residence of company determined by where head, seat and directing power of affairs is; possible dual residence."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "Section 66(1)",
        "Section 4A(b)"
      ],
      "relevance": "Reference to High Court under s.66(1); residence of HUF determined under s.4A(b) unless control and management wholly outside British India."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court analyzed the facts and principles of residence under section 4A(b), noting failure to prove control wholly outside British India due to lack of evidence, upholding the High Court's view that the family is resident (judgment text cuts off before explicit final order).",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"For the purposes of this Act-- (b) A Hindu undivided family, firm or other association of persons is resident in British India unless the control and management of its affairs is situated wholly without British India.\"",
      "speaker": "court",
      "significance": "Exact text of section 4A(b) central to the issue."
    },
    {
      "text": "\"Control and management signifies, in the present context, the controlling and directive power, the head and brain as it is sometimes called, and situated implies the functioning of such power at a particular place with some degree of permanence.\"",
      "speaker": "court",
      "significance": "Patanjali Sastri J.'s explanation of 'control and management' adopted by Supreme Court."
    },
    {
      "text": "\"Mere activity by the company in a place does not create residence, with the result that a company may be residing in one place and doing a great deal business in another.\"",
      "speaker": "court",
      "significance": "Key principle distinguishing activity from residence."
    }
  ],
  "_case_id": "1950_53",
  "_label": 0,
  "_text_length": 12033,
  "_extracted_at": "2026-02-08T22:12:38.760566"
}