{
  "metadata": {
    "case_name": "Petitioner (Printer, Publisher and Editor of Cross Roads) v. Government of Madras",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "Patanjali Sastri J.",
      "Kania C.J.",
      "Mehr Chand Mahajan J.",
      "Mukherjea J.",
      "Das J.",
      "Fazl Ali J."
    ],
    "case_number": "Petition No. XVI of 1950",
    "date_of_judgment": "1950-05-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The petitioner is the printer, publisher and editor of a recently started weekly journal in English called Cross Roads printed and published in Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Government of Madras issued order No. MS. 1333 dated 1st March, 1950, imposing a ban upon the entry and circulation of the journal Cross Roads in the State of Madras under section 9(1-A) of the Madras Maintenance of Public Order Act, 1949.",
      "type": "material",
      "date": "1950-03-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The order was published in the Fort St. George Gazette and prohibits, with effect on and from the date of publication, the entry into or the circulation, sale or distribution in the State of Madras or any part thereof of the newspaper entitled Cross Roads.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Application under article 32 of the Constitution for a writ of prohibition and certiorari.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The impugned Act was passed by the Provincial Legislature in exercise of the power conferred by section 100 of the Government of India Act 1935, read with Entry 1 of List II of the Seventh Schedule to that Act.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order issued under section 9(1-A) of the Madras Maintenance of Public Order Act, 1949, contravenes the fundamental right to freedom of speech and expression under article 19(1)(a) and whether section 9(1-A) is void under article 13(1) as inconsistent therewith.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the petitioner should first resort to the High Court at Madras under article 226 before approaching this Court under article 32.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether section 9(1-A), which authorises prohibition for securing public safety or maintenance of public order, relates to matters which undermine the security of or tend to overthrow the State so as to be saved by article 19(2).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The said order contravenes the fundamental right of the petitioner to freedom of speech and expression conferred by article 19(1)(a) and section 9(1-A) of the impugned Act is void under article 13(1).",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Article 19(1)(a), Article 13(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Preliminary objection to the jurisdiction of this Court; petitioner should first resort to the High Court at Madras under article 226 as a matter of orderly procedure.",
      "supporting_facts": [],
      "legal_basis": "Article 226, Article 32, cited Emperor Bisheswar Prasad Sinha, Urquhart v. Brown, Mooney v. Kolohan"
    },
    {
      "id": "ra2",
      "text": "The expression 'public safety' in the impugned Act means the security of the Province, and therefore the security of the State within the meaning of article 19(2).",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Article 19(2), Article 12, Rex v. Wormwood Scrubbs Prison"
    },
    {
      "id": "ra3",
      "text": "Section 9(1-A) is not wholly void; valid to the extent it secures security of the State under article 19(2).",
      "supporting_facts": [],
      "legal_basis": "Article 13(1), Article 19(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Article 32 provides a guaranteed remedy for enforcement of fundamental rights, itself a fundamental right; Court cannot refuse to entertain applications seeking protection against infringements. Rejects preliminary objection.",
      "addresses_issue": "i2",
      "key_observation": "American decisions not analogous; article 32 constitutes this Court protector of fundamental rights."
    },
    {
      "id": "cr2",
      "text": "Freedom of speech and expression includes freedom of propagation of ideas ensured by freedom of circulation; liberty of circulation as essential as liberty of publication.",
      "addresses_issue": "i1",
      "key_observation": "Order violates article 19(1)(a) unless saved by article 19(2)."
    },
    {
      "id": "cr3",
      "text": "Public order is wide connotation signifying state of tranquillity; public safety part of public order. Section 9(1-A) wider than 'undermining security of or tending to overthrow the State'; not saved by article 19(2).",
      "addresses_issue": "i3",
      "key_observation": "Law restricting freedom must be directed solely against undermining security of State."
    },
    {
      "id": "cr4",
      "text": "Where law purports to authorise restrictions in language wide enough to cover both permissible and impermissible, not severable; wholly void if possibility of application beyond constitutional limits.",
      "addresses_issue": "i3",
      "key_observation": "Enactment capable of application where no danger to State cannot be constitutional."
    },
    {
      "id": "cr5",
      "text": "Fazl Ali J. (dissenting): Disorders involving menace to peace and tranquillity of Province undermine security of State; impugned law satisfies article 19(2). Relief cannot be granted.",
      "addresses_issue": "i1",
      "key_observation": "Sedition creates disorders against public tranquillity; degrees of gravity do not affect validity of law."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 9(1-A) of Madras Maintenance of Public Order Act, 1949, falls outside scope of authorised restrictions under article 19(2) and is void and unconstitutional.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Direct approach under article 32 permissible without exhausting High Court remedy under article 226.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Emperor Bisheswar Prasad Sinha",
      "citation": "I.L.R. 56 All. 158",
      "treatment": "referred",
      "relevance": "Rule of practice to approach lower court first in concurrent jurisdiction matters."
    },
    {
      "case_name": "Urquhart v. Brown",
      "citation": "205 U.S. 179",
      "treatment": "referred",
      "relevance": "US Supreme Court requires exhaustion of remedies before certiorari."
    },
    {
      "case_name": "Mooney v. Kolohan",
      "citation": "294 U.S. 103",
      "treatment": "referred",
      "relevance": "US Supreme Court requires exhaustion of remedies before habeas corpus or certiorari."
    },
    {
      "case_name": "Ex parte Jackson",
      "citation": "96 U.S. 727",
      "treatment": "followed",
      "relevance": "Without circulation, publication of little value; freedom of circulation essential."
    },
    {
      "case_name": "Lovell v. City of Griffin",
      "citation": "303 U.S. 444",
      "treatment": "followed",
      "relevance": "Freedom of speech includes circulation."
    },
    {
      "case_name": "Rex v. Wormwood Scrubbs Prison",
      "citation": "L.R. 1920 2 K.B. 805",
      "treatment": "distinguished",
      "relevance": "Public safety includes protection against internal disorder, but context differs."
    },
    {
      "case_name": "Niharendu Dutt Majumdar v. The King Emperor",
      "citation": "1942 F.C.R. 38",
      "treatment": "referred",
      "relevance": "Federal Court definition of sedition overruled by Privy Council."
    },
    {
      "case_name": "King Emperor v. Sadashiv Narayan Bhalerao",
      "citation": "Not fully cited",
      "treatment": "referred",
      "relevance": "Privy Council on sedition: exciting bad feelings towards Government, not requiring actual disturbance."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 19(1)(a)",
        "Article 19(2)",
        "Article 32",
        "Article 13(1)",
        "Article 226",
        "Article 12",
        "Article 352"
      ],
      "relevance": "Fundamental right to freedom of speech; guaranteed remedy; restrictions only for security of State."
    },
    {
      "name": "Madras Maintenance of Public Order Act, 1949",
      "sections": [
        "Section 9(1-A)"
      ],
      "relevance": "Authorises ban on entry/circulation for public safety/maintenance of public order; held unconstitutional."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Section 100",
        "Entry 1 List II",
        "Section 57"
      ],
      "relevance": "Power of Provincial Legislature over public order."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 279",
        "Section 280",
        "Section 121",
        "Section 124A",
        "Section 141",
        "Section 146",
        "Section 153A",
        "Section 159"
      ],
      "relevance": "Distinguishes offences against public safety, State, public tranquillity."
    },
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "Section 435"
      ],
      "relevance": "Instances of approaching lower courts first."
    },
    {
      "name": "Civil Procedure Code",
      "sections": [
        "Section 24"
      ],
      "relevance": "Instances of approaching lower courts first."
    },
    {
      "name": "Constitution of India Seventh Schedule",
      "sections": [
        "Entry 3 List III"
      ],
      "relevance": "Security of State and public order as distinct."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The application is allowed and the order of the respondents prohibiting the entry and circulation of the petitioner's journal in the State of Madras is quashed. Section 9(1-A) held void. Fazl Ali J. dissents, would dismiss petition.",
    "relief_granted": "Writ granted; ban order quashed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Article 32 provides a guaranteed remedy for the enforcement of those rights, and this remedial right is itself made a fundamental right by being included in Part III.\"",
      "speaker": "court",
      "significance": "Rejects preliminary objection; affirms SC's role as protector of fundamental rights."
    },
    {
      "text": "\"Liberty of circulation is as essential to that freedom as the liberty of publication. Indeed, without circulation the publication would be of little value.\"",
      "speaker": "court",
      "significance": "Expands scope of freedom of speech under Article 19(1)(a)."
    },
    {
      "text": "\"Unless a law restricting freedom of speech and expression is directed solely against the undermining of the security of the State or the overthrow of it, such law cannot fall within the reservation under clause (2) of article 19.\"",
      "speaker": "court",
      "significance": "Core holding on limits of Article 19(2); section 9(1-A) unconstitutional."
    }
  ],
  "_case_id": "1950_10",
  "_label": 1,
  "_text_length": 21816,
  "_extracted_at": "2026-02-08T22:12:01.661933"
}