{
  "metadata": {
    "case_name": "Appellants v. Respondent",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "DAS J."
    ],
    "case_number": "Civil Appeal No. XXVI of 1949",
    "date_of_judgment": "1950-03-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants were and are members of the East India Cotton Association Ltd. Respondent was and is not a member.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In April 1945, Respondent employed Appellants as agents to effect forward contracts for sale/purchase of cotton according to rules, regulations and bye-laws of the Association.",
      "type": "background",
      "date": "1945-04",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Between 9th April 1945 and 10th August 1945, Appellants put through various contracts for sale/purchase of cotton for July 1945 and September 1945 deliveries and sent contract notes to Respondent. All in printed forms.",
      "type": "material",
      "date": "1945-04-09 to 1945-08-10",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 10th August 1945, purchase of 900 bales of cotton at Rs. 432 per candy for September 1945 delivery remained outstanding.",
      "type": "material",
      "date": "1945-08-10",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "According to Respondent, on 11th August 1945, instructed Appellants to close outstanding purchase by selling 900 bales for September 1945 at not less than Rs. 426 per candy (prevailing market rate).",
      "type": "disputed",
      "date": "1945-08-11",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Respondent did not receive contract note for closing transaction; on 18th August 1945, put instructions on record and asked for contract note.",
      "type": "procedural",
      "date": "1945-08-18",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Appellants deny any instruction on 11th August 1945 or receipt of Respondent's letter.",
      "type": "disputed",
      "date": "1945-08-11",
      "source": "appellants"
    },
    {
      "id": "f8",
      "text": "21st August 1945 was clearing date; Rs. 18,900 due from Respondent to Appellants.",
      "type": "material",
      "date": "1945-08-21",
      "source": "appellants"
    },
    {
      "id": "f9",
      "text": "Appellants' letter 22nd August 1945 repudiated Respondent's allegations, demanded Rs. 18,900, notice to square up if not paid by noon 23rd August 1945.",
      "type": "procedural",
      "date": "1945-08-22",
      "source": "appellants"
    },
    {
      "id": "f10",
      "text": "Respondent on 24th August 1945 denied fabricating story, repudiated liability, returned bill.",
      "type": "procedural",
      "date": "1945-08-24",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Appellants on 27th August 1945 closed outstanding contract by selling 900 bales at Rs. 356 per candy, sent contract note No. 17996.",
      "type": "material",
      "date": "1945-08-27",
      "source": "appellants"
    },
    {
      "id": "f12",
      "text": "Respondent's letter 28th August 1945 reiterated prior instruction, denied new instruction, returned contract note No. 17996.",
      "type": "procedural",
      "date": "1945-08-28",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Appellants' letter 28th August 1945 claimed Rs. 34,313, desired reference to arbitration per contract notes.",
      "type": "procedural",
      "date": "1945-08-28",
      "source": "appellants"
    },
    {
      "id": "f14",
      "text": "Both parties appointed arbitrators; meeting fixed for 24th October 1945.",
      "type": "procedural",
      "date": "1945-10-24",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Respondent received notice on 22nd October 1945, could not attend due to Income Tax Officer appearance; sent agent for adjournment.",
      "type": "procedural",
      "date": "1945-10-22 to 1945-10-24",
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "Arbitrators rejected adjournment, made ex parte award for Rs. 34,313, interest and costs on 24th October 1945.",
      "type": "material",
      "date": "1945-10-24",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Respondent filed appeal to Board of Association on 10th November 1945.",
      "type": "procedural",
      "date": "1945-11-10",
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "Pending appeal, Respondent discovered contract notes not in official form, advised void under Bombay Cotton Contracts Act IV of 1932.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f19",
      "text": "Respondent amended memorandum of appeal and made application to High Court under Indian Arbitration Act 1940 to declare arbitration agreement invalid, set aside award.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f20",
      "text": "Chagla J. dismissed application on 2nd July 1946.",
      "type": "procedural",
      "date": "1946-07-02",
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "Bombay HC appeal No. 42 of 1946 by Stone C.J. and Coyajee J. reversed Chagla J. on 20th March 1947, declared contracts invalid, set aside award.",
      "type": "procedural",
      "date": "1947-03-20",
      "source": "lower_court"
    },
    {
      "id": "f22",
      "text": "Appellants obtained certificate, appealed to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "appellants"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the contract notes rendered by Appellants to Respondent were in accordance with the bye-laws of the East India Cotton Association, and if not, whether the contracts are void under Section 8 of the Bombay Cotton Contracts Act, 1932, rendering the arbitration agreement invalid and the award set aside.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there was a pre-existing oral contract dehors the written contract notes that was subject only to being made subject to bye-laws, without needing prescribed form.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No instruction given by Respondent on 11th August 1945 to close contract; Respondent concocted false story to avoid paying Rs. 18,900 due on clearing.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Bye-law 82 requires contracts between agents and constituents to be subject to bye-laws and contract note in prescribed form rendered, but Section 8 voids only if not made subject to bye-laws, not if form defective (distinction between contract and mere evidence contract note).",
      "supporting_facts": [
        "f3",
        "f19"
      ],
      "legal_basis": "Bye-law 82; Section 8 Bombay Cotton Contracts Act 1932"
    },
    {
      "id": "pa3",
      "text": "Rubber stamp provision for deposit not less than Rs. 25 per bale does not contravene bye-law 51-A (amended to Rs. 12.5), as higher rate permissible under usual terms of business.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Bye-law 51-A"
    },
    {
      "id": "pa4",
      "text": "Contract expressly subject to bye-laws, so bye-law 65-A incorporated by reference even if clauses omitted.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Bye-law 65-A"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Instructed Appellants on 11th August 1945 to close at Rs. 426; no authority to close on 27th August.",
      "supporting_facts": [
        "f5",
        "f6",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Contract notes not in official prescribed form per bye-laws (missing deposit clause update to Rs. 12.5, missing bye-law 65-A clauses, outdated rubber stamp), hence void under Section 8 Bombay Cotton Contracts Act; no valid arbitration agreement.",
      "supporting_facts": [
        "f3",
        "f11",
        "f18",
        "f19"
      ],
      "legal_basis": "Section 8 Bombay Cotton Contracts Act 1932; Bye-laws 80, 82, 51-A, 65-A"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "When contract reduced to writing, writing is repository; if not in accordance with bye-laws, contract void. Even assuming pre-existing oral contract, its terms match defective written notes, so not in accordance with bye-laws.",
      "addresses_issue": "i1",
      "key_observation": "Contract notes defective in form per bye-laws."
    },
    {
      "id": "cr2",
      "text": "Rubber stamp specifies not less than Rs. 25 per bale, but amended bye-law 51-A is Rs. 12.5; higher minimum inconsistent with bye-laws, wrongly summarizes bye-law.",
      "addresses_issue": "i1",
      "key_observation": "Rubber stamp provision not in accordance with bye-law 51-A."
    },
    {
      "id": "cr3",
      "text": "Omission of two clauses for bye-law 65-A not cured by reference to bye-laws; bye-law regulates inter-member relations, meaningless for agent-constituent; option subject to constituent instructions in omitted clause.",
      "addresses_issue": "i1",
      "key_observation": "Bye-law 65-A not properly incorporated."
    },
    {
      "id": "cr4",
      "text": "Agrees with Bombay High Court appellate bench (Stone C.J., Coyajee J.); overrules Chagla J.",
      "addresses_issue": "i2",
      "key_observation": "Defects void contracts under Section 8."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Contract notes not in accordance with bye-laws due to discrepancies in deposit clause and omission of bye-law 65-A clauses; contracts void under Section 8 Bombay Cotton Contracts Act 1932; arbitration agreement invalid; award set aside.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bombay Cotton Contracts Act, 1932",
      "sections": [
        "Section 8"
      ],
      "relevance": "Renders contracts not in accordance with bye-laws of recognised cotton association void."
    },
    {
      "name": "Indian Arbitration Act, 1940",
      "sections": [],
      "relevance": "Basis for Respondent's application to declare arbitration agreement invalid and set aside award."
    },
    {
      "name": "Bombay Options in Cotton Prohibition Act, 1939",
      "sections": [],
      "relevance": "Powers conferred for Government notification amending contract note forms."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upheld Bombay High Court judgment reversing single judge, declared arbitration agreements in contract notes invalid and void, set aside the award made by arbitrators.",
    "relief_granted": "Declaration that arbitration agreements invalid; award set aside.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Ordinarily, when a contract between the parties is reduced to writing, the writing becomes the repository of the contract and that writing only can be looked at to ascertain what the contract between the parties is, and if that writing is not in accordance with the bye-laws, the contract itself must be void.\"",
      "speaker": "court",
      "significance": "Core reasoning on why defective contract notes void the contracts."
    },
    {
      "text": "\"The rubber stamp provision clearly imposes on the respondent as the constituent the liability to deposit a higher amount as the minimum amount to be deposited and is to that extent not in accordance with bye-law 51-A.\"",
      "speaker": "court",
      "significance": "Explains specific defect in deposit clause."
    }
  ],
  "_case_id": "1950_5",
  "_label": 0,
  "_text_length": 20836,
  "_extracted_at": "2026-02-08T22:12:00.998337"
}