{
  "metadata": {
    "case_name": "Petitioner (Printer, Publisher and Editor of Cross Roads) v. Government of Madras",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "Patanjali Sastri J.",
      "Kania C.J.",
      "Mehr Chand Mahajan",
      "Mukherjea J.",
      "Das J.",
      "Fazl Ali J."
    ],
    "case_number": "Petition No. XVI of 1950",
    "date_of_judgment": "1950-05-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner is the printer, publisher and editor of a recently started weekly journal in English called Cross Roads printed and published in Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Government of Madras issued order No. MS. 1333 dated 1st March 1950 under section 9(1-A) of the Madras Maintenance of Public Order Act, 1949, imposing a ban on the entry and circulation of the journal Cross Roads in the State of Madras.",
      "type": "material",
      "date": "1950-03-01",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "The order was published in the Fort St. George Gazette.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Petitioner filed application under Article 32 for writ of prohibition and certiorari claiming the order contravenes fundamental right to freedom of speech and expression under Article 19(1)(a) and challenges validity of section 9(1-A) as void under Article 13(1).",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Advocate-General of Madras raised preliminary objection to jurisdiction of Supreme Court under Article 32, contending petitioner should first approach High Court of Madras under Article 226.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Madras Maintenance of Public Order Act, 1949 passed by Provincial Legislature under section 100 of Government of India Act, 1935 read with Entry 1 of List II of Seventh Schedule (public order).",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether this Court has jurisdiction under Article 32 to entertain the application directly, or should petitioner first approach the High Court under Article 226.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether section 9(1-A) of the Madras Maintenance of Public Order Act, 1949 is void under Article 13(1) as inconsistent with Article 19(1)(a), or saved by Article 19(2) as relating to security of the State or tending to overthrow the State.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether 'public safety and maintenance of public order' in section 9(1-A) falls within 'security of the State or tends to overthrow the State' under Article 19(2).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order contravenes the fundamental right of the petitioner to freedom of speech and expression conferred by Article 19(1)(a).",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": "Article 19(1)(a)"
    },
    {
      "id": "pa2",
      "text": "Section 9(1-A) of the impugned Act is void under Article 13(1) by reason of its being inconsistent with Article 19(1)(a).",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Article 13(1), Article 19(1)(a)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Petitioner should first resort to High Court at Madras under Article 226 as a matter of orderly procedure before approaching Supreme Court under Article 32.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Article 226; cited Emperor Bisheswar Prasad Sinha; American cases Urquhart v. Brown, Mooney v. Kolohan"
    },
    {
      "id": "ra2",
      "text": "Expression 'public safety' in the impugned Act means the security of the Province, and therefore the security of the State within Article 19(2).",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "Article 19(2), Article 12; cited Rex v. Wormwood Scrubbs Prison"
    },
    {
      "id": "ra3",
      "text": "Section 9(1-A) is valid to the extent it relates to security of the State under Article 13(1) and Article 19(2).",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Article 13(1), Article 19(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Article 32 provides a guaranteed remedy for enforcement of fundamental rights, itself a fundamental right; Court cannot refuse to entertain applications seeking protection against infringements.",
      "addresses_issue": "i1",
      "key_observation": "American decisions and cited instances not analogous; Article 32 distinct from Article 226."
    },
    {
      "id": "cr2",
      "text": "Freedom of speech and expression includes freedom of propagation of ideas ensured by freedom of circulation; liberty of circulation as essential as liberty of publication.",
      "addresses_issue": "i2",
      "key_observation": "Order violates Article 19(1)(a) unless saved by Article 19(2)."
    },
    {
      "id": "cr3",
      "text": "'Public order' is wide, includes public safety; but does not necessarily mean security of the State; public safety ordinarily means security of public or freedom from danger, can include preventing dangers to public health, rash driving etc.",
      "addresses_issue": "i3",
      "key_observation": "Distinguished IPC chapters: offences against public safety vs against State vs public tranquillity."
    },
    {
      "id": "cr4",
      "text": "Law purporting to authorize restrictions in language wide enough to cover both permissible and impermissible cannot be upheld even to the extent valid; wholly void if capable of application beyond constitutional limits.",
      "addresses_issue": "i3",
      "key_observation": "Section 9(1-A) falls outside Article 19(2) as wider than security of State."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Supreme Court has jurisdiction under Article 32 to entertain the petition directly.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Section 9(1-A) of Madras Maintenance of Public Order Act, 1949 is void and unconstitutional under Article 13(1) as it authorizes restrictions beyond those permitted by Article 19(2).",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "'Securing public safety or maintenance of public order' does not relate solely to 'undermining security of or tending to overthrow the State'; includes matters beyond Article 19(2).",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Emperor Bisheswar Prasad Sinha",
      "citation": "I.L.R. 56 All. 158",
      "treatment": "referred",
      "relevance": "Rule of practice to approach lower court first in concurrent jurisdiction matters."
    },
    {
      "case_name": "Urquhart v. Brown",
      "citation": "205 U.S. 179",
      "treatment": "referred",
      "relevance": "US Supreme Court requires exhaustion of remedies before certiorari."
    },
    {
      "case_name": "Mooney v. Kolohan",
      "citation": "294 U.S. 103",
      "treatment": "referred",
      "relevance": "US Supreme Court requires exhaustion of remedies before habeas corpus or certiorari."
    },
    {
      "case_name": "Ex parte Jackson",
      "citation": "96 U.S. 727",
      "treatment": "followed",
      "relevance": "Without circulation, publication of little value; essential to freedom of speech."
    },
    {
      "case_name": "Lovell v. City of Griffin",
      "citation": "303 U.S. 444",
      "treatment": "followed",
      "relevance": "Freedom of circulation essential to freedom of speech."
    },
    {
      "case_name": "Rex v. Wormwood Scrubbs Prison",
      "citation": "L.R. 1920 2 K.B. 805",
      "treatment": "distinguished",
      "relevance": "Public safety includes protection against internal disorder, but context differs."
    },
    {
      "case_name": "Niharendu Dutt Majumdar v. The King Emperor",
      "citation": "1942 F.C.R. 38",
      "treatment": "referred",
      "relevance": "Federal Court definition of sedition overruled by Privy Council."
    },
    {
      "case_name": "King Emperor v. Sadashiv Narayan Bhalerao",
      "citation": "Not fully cited; Privy Council overruling Tilak's case reference",
      "treatment": "referred",
      "relevance": "Sedition consists in exciting disaffection towards Government, not necessarily disorder."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 19(1)(a)",
        "Article 19(2)",
        "Article 13(1)",
        "Article 226",
        "Article 12"
      ],
      "relevance": "Guaranteed remedy for fundamental rights; freedom of speech restrictions only for security of State; impugned section inconsistent."
    },
    {
      "name": "Madras Maintenance of Public Order Act, 1949",
      "sections": [
        "Section 9(1-A)"
      ],
      "relevance": "Authorizes ban on entry/circulation for public safety/maintenance of public order; held void."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Section 100",
        "Entry 1 List II Seventh Schedule",
        "Section 57"
      ],
      "relevance": "Provincial power over public order; distinguishes security of State."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 279",
        "Section 280",
        "Section 121",
        "Section 124A",
        "Section 141",
        "Section 146",
        "Section 153A",
        "Section 159"
      ],
      "relevance": "Distinguishes offences against public safety, State, public tranquillity."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Majority allows the application, declares section 9(1-A) void and unconstitutional, quashes the order prohibiting entry and circulation of Cross Roads in Madras. Fazl Ali J. dissents, would dismiss petition.",
    "relief_granted": "Order of respondents quashed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Article 32 provides a guaranteed remedy for the enforcement of those rights, and this remedial right is itself made a fundamental right by being included in Part III.\"",
      "speaker": "court",
      "significance": "Establishes direct access to Supreme Court under Article 32 for fundamental rights enforcement."
    },
    {
      "text": "\"Liberty of circulation is as essential to that freedom as the liberty of publication. Indeed, without circulation the publication would be of little value.\"",
      "speaker": "court",
      "significance": "Defines scope of freedom of speech to include circulation."
    },
    {
      "text": "\"Unless a law restricting freedom of speech and expression is directed solely against the undermining of the security of the State or the overthrow of it, such law cannot fall within the reservation under clause (2) of article 19.\"",
      "speaker": "court",
      "significance": "Narrow interpretation of Article 19(2) limitations."
    },
    {
      "text": "\"Where a law purports to authorise the imposition of restrictions on a fundamental right in language wide enough to cover restrictions both within and without the limits of constitutionally permissible legislative action... it must be held to be wholly unconstitutional and void.\"",
      "speaker": "court",
      "significance": "Doctrine of severability; section wholly void due to overbreadth."
    }
  ],
  "_case_id": "1950_10",
  "_label": 1,
  "_text_length": 21816,
  "_extracted_at": "2026-02-10T19:15:22.951010"
}