{
  "metadata": {
    "case_name": "Mohinder Singh v. State",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "Fazl Ali J."
    ],
    "case_number": "Criminal Appeal No. 10 of 1950",
    "date_of_judgment": "1950-10-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Sometime in January 1949, Bachittar Singh, brother of Dalip Singh, lodged complaint before Naib Tehsildar at Zira that a tree belonging to him had been cut by 7 persons including Mohinder Singh appellant.",
      "type": "background",
      "date": "1949-01",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "28th February 1949 was fixed for hearing of Bachittar Singh's case before Naib Tehsildar.",
      "type": "procedural",
      "date": "1949-02-28",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "On 28th February 1949 at mid-day near Gurdwara, Jita Singh and Dalip Singh brothers of Bachittar Singh attacked by appellant Mohinder Singh and Gurnam Singh while returning from field; Jita carrying fodder, Dalip had sickles.",
      "type": "material",
      "date": "1949-02-28",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Mohinder Singh fired at Jita Singh from behind near tailor's shop hitting neck; Jita fell down.",
      "type": "material",
      "date": "1949-02-28",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Dalip Singh ran backwards chased by Gurnam Singh round tank boundary; Mohinder Singh ran opposite side confronted and shot Dalip on chest.",
      "type": "material",
      "date": "1949-02-28",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Gurnam Singh fired rifle at Dalip Singh from 4-5 feet near ear while lying sideways; Dalip died on spot.",
      "type": "material",
      "date": "1949-02-28",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Dalip Singh had 6 injuries: detailed gun shot wounds on left temporal, right mastoid, left chest, right chest, right arm; two projectiles hit him.",
      "type": "material",
      "date": "1949-02-28",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Jita Singh had 4 slight pellet injuries on back of neck and two abrasions below right elbow and knee.",
      "type": "material",
      "date": "1949-02-28",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Same day 3 p.m., Jita Singh lodged FIR at Dharamkot police station 3 miles from Augar village charging Mohinder with injury to him and murder of Dalip with Gurnam.",
      "type": "procedural",
      "date": "1949-02-28",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Police investigated, sent charge-sheet against Mohinder Singh and Gurnam Singh.",
      "type": "procedural",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Sessions Judge Ferozepore tried under ss.302/307/34 IPC; Mohinder sentenced death under 302, Gurnam transportation for life; both 3 years RI under 307/34.",
      "type": "procedural",
      "date": "1949-07-20",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court of Punjab (Falshaw and Soni JJ) upheld conviction and death sentence on 30th December 1949.",
      "type": "procedural",
      "date": "1949-12-30",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "At scene: empty cartridge where Jita shot, 2 empty cartridges and blood-stained cap near Dalip body.",
      "type": "material",
      "date": "1949-02-28",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Mohinder produced 12 bore gun P-16 for which he had licence.",
      "type": "material",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Dr. Goyle CID lab: gun signs of firing but can't say when; cartridges could have been from gun but can't confirm; no firing test or markings comparison.",
      "type": "material",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Occurrence near Gurdwara and houses but no local witnesses; case rests on Jita Singh, Harnam Singh, Buta Singh.",
      "type": "material",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Harnam Singh lives at considerable distance, coming from another village for medicine; Buta Singh tonga driver from distant village, related to Harnam, came to see him.",
      "type": "material",
      "source": "prosecution"
    },
    {
      "id": "f18",
      "text": "Dispute between Harnam and Mohinder about wall a month prior, settled by panchayat.",
      "type": "background",
      "date": "1949-01",
      "source": "prosecution"
    },
    {
      "id": "f19",
      "text": "Appellant denied firing, claimed not present in Augar but at Zira Naib Tehsildar court.",
      "type": "disputed",
      "source": "petitioner"
    },
    {
      "id": "f20",
      "text": "Defence witnesses: Naib Tehsildar - 6/7 persons appeared 28 Feb, proved taccavi loan app by appellant thumb impression, passed orders that day but didn't know Mohinder.",
      "type": "disputed",
      "date": "1949-02-28",
      "source": "petitioner"
    },
    {
      "id": "f21",
      "text": "Jogindar Singh brother-in-law: wrote taccavi app, Mohinder present in court, signed it, appeared when Bachittar case called.",
      "type": "disputed",
      "date": "1949-02-28",
      "source": "petitioner"
    },
    {
      "id": "f22",
      "text": "Handwriting expert: taccavi app thumb impression of appellant; some handwritings don't tally; original process peon report suppressed, forged substituted.",
      "type": "disputed",
      "source": "petitioner"
    },
    {
      "id": "f23",
      "text": "Lower courts held alibi not proved.",
      "type": "admitted",
      "source": "lower_court"
    },
    {
      "id": "f24",
      "text": "High Court not impressed by Dr Goyle evidence, unsatisfactory; gun identification dubious; injuries puzzling, blackened but no shattering, inconsistent with close range.",
      "type": "material",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether prosecution proved by expert evidence that injuries to Dalip Singh could have been caused by the alleged weapons (gun and rifle) at close range as claimed.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether plea of alibi by appellant proved to reasonable standard.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether conviction sustainable resting wholly on oral testimony of three witnesses without confirmation by expert evidence on crucial points.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Alibi: present at Naib Tehsildar court in Zira on 28 Feb 1949 for hearing and filed taccavi loan application.",
      "supporting_facts": [
        "f2",
        "f19",
        "f20",
        "f21",
        "f22"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Dr Goyle evidence unsatisfactory, no confirmation cartridges from gun P-16.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Nature of injuries inconsistent with close range firing from gun/rifle; quoted Taylor medical jurisprudence and Hatcher ballistics suggesting distance 600-1200 yards for through-and-through without shattering.",
      "supporting_facts": [
        "f7",
        "f24"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Process peon report tampered; Naib Tehsildar won over allegation unsubstantiated.",
      "supporting_facts": [
        "f22"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Prosecution case as per eyewitnesses Jita, Harnam, Buta; identification of gun; recovery of cartridges.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6",
        "f13",
        "f14",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Alibi not proved; summons not served on Mohinder; Naib Tehsildar won over.",
      "supporting_facts": [
        "f20",
        "f23"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Prosecution duty to prove by expert evidence possibility of injuries caused by alleged weapons in manner claimed; gap in evidence on whether gun or rifle caused injuries, close range firing.",
      "addresses_issue": "i1",
      "key_observation": "Evidence falls short of proof on material part; doubtful if gun or rifle, more likely rifle but appellant armed with gun."
    },
    {
      "id": "cr2",
      "text": "Only 2 shots fired by two persons crucial; oral evidence of 2 chance witnesses and 1 partisan unchecked by expert evidence.",
      "addresses_issue": "i3",
      "key_observation": "Courts below ignored gap, rested on oral testimony."
    },
    {
      "id": "cr3",
      "text": "Alibi plea requires same reasonable standard as prosecution evidence; positive evidence of presence in court supported by document and witness; prosecution evidence on summons service suspicious.",
      "addresses_issue": "i2",
      "key_observation": "Lower courts disregarded principle; Naib Tehsildar not cross-examined on won over; process peon evidence suspicious."
    },
    {
      "id": "cr4",
      "text": "High Court noted difficulties with injuries and Dr Goyle but convicted on oral evidence; prosecution case only partly proved.",
      "addresses_issue": "i1",
      "key_observation": "Substantial grave injustice; falls within exception for interference per Pritam Singh."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Prosecution must prove whole positive case including expert evidence on weapon causing injuries in alleged manner.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Standard of proof for alibi same as for prosecution case: reasonable standard.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Supreme Court interferes in criminal appeal where substantial grave injustice done by disregard of legal process.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pritam Singh v. The State",
      "citation": "1950 S.C.R. 463",
      "treatment": "followed",
      "relevance": "Court will not entertain criminal appeal except in special cases of substantial grave injustice"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "307",
        "34"
      ],
      "relevance": "Charges for murder and attempt to murder with common intention"
    },
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "342"
      ],
      "relevance": "Examination of accused"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; conviction set aside due to gaps in prosecution evidence on expert proof of injuries from alleged weapons and failure to apply reasonable standard to alibi, resulting in substantial injustice.",
    "relief_granted": "Conviction and death sentence quashed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "in a case where death is due to injuries or wounds caused by a lethal weapon, it has always been considered to be the duty of the prosecution to prove by expert evidence that it was likely or at least possible for the injuries to have been caused with the weapon",
      "speaker": "court",
      "significance": "Core holding on prosecution burden for weapon-injury link"
    },
    {
      "text": "the standard of proof which is required in regard to that plea must be the same as the standard which is applied to the prosecution evidence and in both cases it should be a reasonable standard",
      "speaker": "court",
      "significance": "Ruling on proof standard for alibi"
    },
    {
      "text": "This Court...will not entertain a criminal appeal except in special and exceptional cases where it is manifest that...substantial and grave injustice has been done",
      "speaker": "court",
      "significance": "Grounds for SC interference in criminal appeals"
    }
  ],
  "_case_id": "1950_28",
  "_label": 1,
  "_text_length": 21341,
  "_extracted_at": "2026-02-10T19:15:37.141708"
}