{
  "metadata": {
    "case_name": "Raju Ayyar v. Gnanambal",
    "case_year": 1945,
    "court": "Supreme Court of India",
    "judges": [
      "Mukherjea, J."
    ],
    "case_number": "Original Suit No. 34 of 1943",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Kothandarama Ayyar, Hindu inhabitant of Tanjore District, owned considerable properties and died on 25th April 1905, leaving adoptive mother Valu Ammal, widow Parbati, daughters Nagammal (widow with infant daughter Alamelu) and Gnanambal.",
      "type": "background",
      "date": "1905-04-25",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Kothandarama executed last will on 13th March 1905, genuineness not disputed; gave widow authority to adopt son of Gnanambal before January 1908 or son of nephews.",
      "type": "material",
      "date": "1905-03-13",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Widow Parbati adopted Raju Ayyar, son of testator's nephew, in terms of the will.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Raju Ayyar filed suit for recovery of possession of Kothangudi properties, alleging they were given to Nagammal for lifetime under will, no disposition of remainder, vested in plaintiff as adopted son and heir upon Nagammal's death on 3rd January 1943.",
      "type": "material",
      "date": "1943-01-03",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Gnanambal (first defendant) resisted claim, alleging no intestacy after Nagammal's life interest; entitled to properties absolutely under will after Nagammal's death, subject to payment of Rs. 5,000 to Alamelu.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Alamelu (second defendant) died during trial court proceedings; her heirs impleaded as defendants 3 to 9.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Subordinate Judge of Mayuram in Original Suit No. 34 of 1943 accepted defendant No.1's contention and dismissed plaintiff's suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Division Bench of Madras High Court by judgment dated November 27, 1945 reversed trial court decision and allowed plaintiff's claim.",
      "type": "procedural",
      "date": "1945-11-27",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Nagammal enjoyed Injigudi house for life as per evidence.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Construction of the will regarding disposition of Kothangudi properties and Injigudi house after Nagammal's life interest: whether paragraph 5 fully applies (Gnanambal and children after Nagammal, subject to Rs. 5,000 to Alamelu) or only paragraph 13 applies leading to intestacy with remainder to adopted son/heir.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Paragraph 5 operative only if Gnanambal's son adopted; since nephew's son adopted, paragraphs 4 to 8 do not apply; paragraph 13 contains entire disposition for Kothangudi (life to Nagammal, no remainder specified, intestacy); paragraph 5 cannot apply as it mentions both Kothangudi and Injigudi but paragraph 13 omits Injigudi.",
      "supporting_facts": [
        "f3",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No intestacy; paragraph 5 entitles Gnanambal and children to Kothangudi and Injigudi after Nagammal's death, subject to Rs. 5,000 payment to Alamelu; provisions for daughters, wife, mother in paragraphs 5,6,7 apply under all contingencies; paragraph 13 affirms paragraph 5.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Will to be construed to ascertain testator's intention from language read as whole, considering surrounding circumstances; no conjecture; court puts itself in testator's armchair.",
      "addresses_issue": "i1",
      "key_observation": "General principles of will construction settled."
    },
    {
      "id": "cr2",
      "text": "No presumption against intestacy unless ambiguity; cannot distort plain words to avoid intestacy.",
      "addresses_issue": "i1",
      "key_observation": "Presumption not based on English necessity for Indian court."
    },
    {
      "id": "cr3",
      "text": "Will carefully prepared for contingencies: adoption of Gnanambal's son (paras 4-8), nephew's son (paras 11-16 modifications), no adoption (para 20). Provisions in paras 5,6,7 for wife, mother, daughters apply to all contingencies; not cancelled by second contingency.",
      "addresses_issue": "i1",
      "key_observation": "Scheme not self-contained exclusive sets; paras 5,6,7 operative regardless."
    },
    {
      "id": "cr4",
      "text": "Paragraph 13 affirms para 5 for Nagammal's enjoyment of Kothangudi; no change to para 5; superfluous affirmation does not exclude remainder to Gnanambal subject to Rs.5000 to Alamelu.",
      "addresses_issue": "i1",
      "key_observation": "Testator meticulous; unlikely to omit remainder provision."
    },
    {
      "id": "cr5",
      "text": "Injigudi house enjoyed by Nagammal for life; no difficulty with Rs.5000 payment.",
      "addresses_issue": "i1",
      "key_observation": "Para 5 fully applies."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Paragraph 5 of will applies fully even when nephew's son adopted: Nagammal life interest in Kothangudi village and Injigudi house, thereafter to Gnanambal and children subject to payment of Rs. 5,000 to Alamelu.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Venkata Narasimha v. Parthasarthy",
      "citation": "42 I.A. 51",
      "treatment": "followed",
      "relevance": "Courts consider surrounding circumstances to construe will; put themselves in testator's armchair; no presumption against intestacy as English necessity."
    },
    {
      "case_name": "Re Edwards; Jones v. Jones",
      "citation": "1906 1 Ch. 570",
      "treatment": "followed",
      "relevance": "Cannot distort plain words to avoid intestacy."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment and decree of Madras High Court dated November 27, 1945 set aside; judgment of Subordinate Judge of Mayuram in Original Suit No. 34 of 1943 restored.",
    "relief_granted": "Plaintiff's suit dismissed; defendant No.1 entitled to Kothangudi properties after Nagammal's death subject to Rs. 5,000 payment to Alamelu.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The cardinal maxim to be observed by courts in construing a will is to endeavour to ascertain the intentions of the testator. This intention has to be gathered primarily from the language of the document which is to be read as a whole...",
      "speaker": "court",
      "significance": "States primary principle of will construction."
    },
    {
      "text": "Paragraph 5, which is material for our present purposes runs as follows - The whole village of Kothangudi and the house at Injigudi... shall enjoy with life interest and after her the said property shall pass to my daughter Gnanambal and her children on payment by the latter of Rs. 5,000 to Alamelu...",
      "speaker": "court",
      "significance": "Key disposition in will at issue."
    },
    {
      "text": "It is not the intention of the testator that on the happening of the second contingency, all the earlier provisions of the will would stand cancelled...",
      "speaker": "court",
      "significance": "Rejects High Court's view; holds paras 5,6,7 apply to all contingencies."
    }
  ],
  "_case_id": "1950_54",
  "_label": 1,
  "_text_length": 21066,
  "_extracted_at": "2026-02-10T19:15:22.599848"
}