{
  "metadata": {
    "case_name": "State of Bombay v. First Respondent",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "Fazl Ali J.",
      "Patanjali Sastri J.",
      "Mahajan J."
    ],
    "case_number": "Civil Appeal No. 10 of 1950",
    "date_of_judgment": "1950-12-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Bombay City Civil Court Act, 1948 (Act XL of 1948) enacted to create additional civil court for Greater Bombay with jurisdiction to try suits and proceedings of civil nature not exceeding certain value, subject to exceptions.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Section 3 of the Act provides initial pecuniary jurisdiction of Rs. 10,000 for City Civil Court, with exceptions for suits cognisable by High Court in admiralty, testamentary, matrimonial, insolvency, etc.",
      "type": "material",
      "date": null,
      "source": "statute"
    },
    {
      "id": "f3",
      "text": "Section 4 of the Act empowers Provincial Government by notification to invest City Civil Court with jurisdiction up to Rs. 25,000.",
      "type": "material",
      "date": null,
      "source": "statute"
    },
    {
      "id": "f4",
      "text": "Section 12 of the Act bars High Court jurisdiction over suits cognisable by City Civil Court, with proviso for removal by High Court for special reasons.",
      "type": "material",
      "date": null,
      "source": "statute"
    },
    {
      "id": "f5",
      "text": "Notification dated 20th January 1950 issued under section 4 enhancing pecuniary limit to Rs. 25,000.",
      "type": "procedural",
      "date": "1950-01-20",
      "source": "state_government"
    },
    {
      "id": "f6",
      "text": "First respondent filed summary suit in Bombay High Court original side on 6th February 1950 against second respondent for recovery of Rs. 11,704-24 on promissory notes, claiming High Court jurisdiction as Act and notification ultra vires.",
      "type": "material",
      "date": "1950-02-06",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "High Court Judge in Chambers on 23rd February 1950 admitted plaint holding section 4 ultra vires.",
      "type": "procedural",
      "date": "1950-02-23",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "State of Bombay impleaded as defendant on application of Advocate General; proceedings transferred to Division Bench.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "High Court (Chagla C.J. and Tendolkar J.) on 29th March 1950 held Act intra vires but section 4 ultra vires as delegation of legislative power; suit properly laid in High Court.",
      "type": "procedural",
      "date": "1950-03-29",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Act received assent of Governor-General.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Bombay City Civil Court Act, 1948 is ultra vires the Legislature of the State of Bombay",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether in any event section 4 of the above Act is ultra vires the State Legislature",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the Bombay High Court has jurisdiction to try the suit",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Act is intra vires under entry 1 List II (administration of justice, constitution and organisation of courts); includes power to confer general jurisdiction; entries 53 List I, 2 List II are for special jurisdiction.",
      "supporting_facts": [
        "f1",
        "f2",
        "f10"
      ],
      "legal_basis": "Government of India Act 1935, Entry 1 List II; Section 9 CPC"
    },
    {
      "id": "pa2",
      "text": "Section 4 is conditional legislation, not delegation; legislature fixed policy and limits (Rs 10,000 initial, up to 25,000); government determines timing.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "Queen v. Burah"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Act ultra vires as confers jurisdiction on matters in List I (e.g. promissory notes, entry 28 List I); only Central Legislature can confer jurisdiction via entry 53 List I; entry 1 List II excludes jurisdiction.",
      "supporting_facts": [
        "f1",
        "f6"
      ],
      "legal_basis": "Government of India Act 1935, Entries 53 List I, 2 List II, 15 List III; Section 100"
    },
    {
      "id": "ra2",
      "text": "Section 4 delegates legislative power to Provincial Government to decide jurisdiction up to Rs 25,000.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "Jitendranath Gupta v. Province of Bihar"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Entry 1 List II 'administration of justice, constitution and organisation of all courts' includes jurisdiction and powers; wide enough to confer general civil jurisdiction; entry 2 List II for special jurisdiction on List II matters.",
      "addresses_issue": "i1",
      "key_observation": "Provincial Legislature can invest courts with power to try every cause irrespective of subject-matter unless barred."
    },
    {
      "id": "cr2",
      "text": "Entries 53 List I, 2 List II allow special/additional jurisdiction or barring in respect of list matters; does not limit general jurisdiction under entry 1 List II.",
      "addresses_issue": "i1",
      "key_observation": "Practice pre-1935 continued; courts had general jurisdiction."
    },
    {
      "id": "cr3",
      "text": "Pith and substance of Act is constitution of court and administration of justice (List II); incidental encroachment on List I immaterial.",
      "addresses_issue": "i1",
      "key_observation": "Act valid even if covers promissory notes suits."
    },
    {
      "id": "cr4",
      "text": "Section 4 is conditional legislation; legislature determined policy (initial Rs 10,000, max 25,000 subject to sec 3 exceptions); government executes by notification on circumstances.",
      "addresses_issue": "i2",
      "key_observation": "Not delegation; akin to Queen v. Burah."
    },
    {
      "id": "cr5",
      "text": "High Court lacks jurisdiction as suit cognisable by City Civil Court under valid Act and notification.",
      "addresses_issue": "i3",
      "key_observation": "Suit value Rs 11,704 within Rs 25,000 limit."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Bombay City Civil Court Act, 1948 is intra vires Provincial Legislature.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Section 4 of the Act is valid conditional legislation, not delegation of legislative power.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Bombay High Court has no jurisdiction to try the suit; City Civil Court has jurisdiction.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Queen v. Burah",
      "citation": "5 I.A. 178",
      "treatment": "followed",
      "relevance": "Conditional legislation valid; extension of jurisdiction not delegation."
    },
    {
      "case_name": "Prafulla Kumar Mukherjee v. Bank of Commerce Ltd., Khulna",
      "citation": "1947 F.C.R. 28",
      "treatment": "followed",
      "relevance": "Pith and substance doctrine; incidental encroachment on federal field allowed."
    },
    {
      "case_name": "Jitendranath Gupta v. Province of Bihar",
      "citation": "1949-50 F.C.R. 595",
      "treatment": "distinguished",
      "relevance": "Distinguished as involving modification/re-enactment, unlike conditional legislation here."
    },
    {
      "case_name": "Mulchand Kundanmal Jagtiani v. Raman Hiralal Shah",
      "citation": "51 Bom. L.R. 86",
      "treatment": "followed",
      "relevance": "Act intra vires under entry 1 List II."
    },
    {
      "case_name": "Field v. Clark",
      "citation": "143 U.S. 649",
      "treatment": "referred",
      "relevance": "Legislature can make law conditional on future determination."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay City Civil Court Act, 1948",
      "sections": [
        "3",
        "4",
        "12"
      ],
      "relevance": "Establishes City Civil Court, confers jurisdiction, bars High Court; sec 4 conditional."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "100",
        "109"
      ],
      "relevance": "Legislative lists: Entry 1,2 List II; 53 List I; 4,15 List III; demarcates powers."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "9"
      ],
      "relevance": "Courts have jurisdiction over all civil suits unless barred."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court judgment set aside; held Act and sec 4 valid; suit not maintainable in High Court but in City Civil Court; proceedings returned accordingly.",
    "relief_granted": "Declaration that City Civil Court has jurisdiction; High Court lacks jurisdiction.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"administration of justice has a wide meaning, and includes administration of civil as well as criminal justice... wide enough to include the power and jurisdiction of courts\"",
      "speaker": "court",
      "significance": "Interprets entry 1 List II to include general jurisdiction."
    },
    {
      "text": "\"The proper Legislature has exercised its judgment as to place, person, laws, powers... legislate conditionally as to all these things.\"",
      "speaker": "court",
      "significance": "From Queen v. Burah; justifies sec 4 as conditional legislation."
    },
    {
      "text": "\"Once it is determined that the pith and substance is money-lending, is the extent to which the federal field is invaded a material matter? ... No\"",
      "speaker": "court",
      "significance": "Pith and substance test allows incidental encroachment."
    }
  ],
  "_case_id": "1950_37",
  "_label": 1,
  "_text_length": 156840,
  "_extracted_at": "2026-02-10T19:15:25.992781"
}