{
  "metadata": {
    "case_name": "Co-operative Credit Society (Decree-holder) v. Raja Nandlal (Judgment-debtor)",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "Mahajan J."
    ],
    "case_number": "Appeal under Article 374(4) of the Constitution",
    "date_of_judgment": "1950-10-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Raja Nandial was a member of the decree-holder society and was also its debtor.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "A dispute arose between Raja Nandial and the society and under the rules governing such societies the matter was referred to arbitration.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The arbitrator passed a decree against Raja Nandial on 19th Meher 1352 F., in the sum of Rs. 8,100 payable in equal six monthly instalments with six per cent. interest, the first instalment being payable at the end of Azur 1353 F.",
      "type": "material",
      "date": "1352-Meher-19 F.",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 2nd Dai 1353 F., under section 42, clause d, of the Co-operative Societies Act, the decree was sent for execution to the Civil Court, Balda, on a certificate issued by Moulvi Mohammed Hasan, Madadgar Nazim. Amount recoverable stated as Rs. 8,100 principal and Rs. 666-9-0 interest.",
      "type": "procedural",
      "date": "1353-Dai-02 F.",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On the same day (2nd Dai 1353 F.), the decree-holder presented an application for execution claiming Rs. 10,339-14-9, alleging default in first instalment due in Azur 1353 F., making whole amount recoverable, praying for attachment of property.",
      "type": "procedural",
      "date": "1353-Dai-02 F.",
      "source": "decree-holder"
    },
    {
      "id": "f6",
      "text": "On 3rd Dai 1353 F., judgment debtor deposited Rs. 1,000 towards first instalment in Office of Registrar of Co-operative Societies, expressing willingness to deposit further amount due.",
      "type": "procedural",
      "date": "1353-Dai-03 F.",
      "source": "judgment-debtor"
    },
    {
      "id": "f7",
      "text": "Nazim's office replied that due to default in first instalment, whole decree due, Rs. 1,000 not accepted.",
      "type": "procedural",
      "date": "1353-Dai-03 F.",
      "source": "registrar"
    },
    {
      "id": "f8",
      "text": "On 5th Dai 1353 F., letter issued by Mohammed Aihsan, Assistant Madadgar Nazim, to Civil Court, Balda, stating Rs. 1,034 deposited in Nizamat Co-operative Credit Societies Office, requesting stay or adjournment of execution proceedings.",
      "type": "procedural",
      "date": "1353-Dai-05 F.",
      "source": "registrar"
    },
    {
      "id": "f9",
      "text": "Decree-holder objected that Registrar had no jurisdiction to stay execution as not executing court.",
      "type": "procedural",
      "date": null,
      "source": "decree-holder"
    },
    {
      "id": "f10",
      "text": "Executing court overruled objection, held under s.42 Registrar retains power to stay execution even after certificate, stayed proceedings.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appeal to Sadar Adalat: Allowed partially, execution not for amount paid but for future instalments as due; default clause condoned by deposit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Decree-holder's second appeal to High Court of Hyderabad (Civil Appeal No. 374/4 of 1356 F., dated 24th Aban 1356 F.): Held default occurred, whole decree executable; certificate valid (defect cured by fresh certificate by Nazim); but Registrar retains jurisdiction to adjourn; maintained stay.",
      "type": "procedural",
      "date": "1356-Aban-24 F.",
      "source": "high_court"
    },
    {
      "id": "f13",
      "text": "Fresh certificate issued by Nazim to cure defect in original by Madadgar Nazim.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Jurisdiction of the Registrar under section 42, clause d, of the Co-operative Credit Societies Act in respect of execution of decrees, including power to stay execution or accept payments after issuing certificate to civil court.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Registrar can intervene in execution proceedings pending in civil court by accepting instalment payment and directing stay.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Validity of certificate issued by Madadgar Nazim.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Registrar has no jurisdiction to stay execution of the decree as he is not an executing court; only power to issue certificate.",
      "supporting_facts": [
        "f4",
        "f8",
        "f10"
      ],
      "legal_basis": "Section 42, clause d, Co-operative Societies Act"
    },
    {
      "id": "pa2",
      "text": "Default in first instalment made whole decretal amount recoverable.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6"
      ],
      "legal_basis": "Default clause in arbitrator's decree"
    },
    {
      "id": "pa3",
      "text": "Registrar's acceptance of instalment was trespass on executing court's duties.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Section 42, clause d, Co-operative Societies Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Certificate invalid as issued by Madadgar Nazim without delegated powers.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Deposit of first instalment condoned default; Registrar has power to stay or adjourn execution.",
      "supporting_facts": [
        "f6",
        "f8",
        "f11"
      ],
      "legal_basis": "Section 42, Co-operative Societies Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 42(d) does not place Registrar on same pedestal as court passing decree under CPC; Registrar has capacity only to issue certificate, not to execute; no power to stay execution or accept payments during civil court execution.",
      "addresses_issue": "i1",
      "key_observation": "Registrar not executing court; civil court treats award as its own decree."
    },
    {
      "id": "cr2",
      "text": "Registrar's acceptance of first instalment and direction to stay was excess of jurisdiction; executing court to ignore such requisition.",
      "addresses_issue": "i2",
      "key_observation": "Only executing court receives payments towards satisfaction."
    },
    {
      "id": "cr3",
      "text": "High Court contradictory: found default, whole amount due, but maintained stay by Registrar.",
      "addresses_issue": "i1",
      "key_observation": "Logical result is execution should proceed."
    },
    {
      "id": "cr4",
      "text": "Fresh certificate by Nazim cures any defect; no need to consider invalidity.",
      "addresses_issue": "i3",
      "key_observation": "Proceedings have jurisdiction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Registrar under s.42(d) has no jurisdiction as executing court; cannot stay execution or accept payments after certificate to civil court.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Executing court to proceed despite Registrar's intervention.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Default not condoned; whole decree executable.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Co-operative Credit Societies Act, 1340 F.",
      "sections": [
        "Section 42, clause d"
      ],
      "relevance": "Governs enforcement of arbitrator's award by certificate to civil or revenue court; Registrar lacks execution powers."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [],
      "relevance": "Analogy distinguished: court passing decree retains execution jurisdiction unlike Registrar."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 374(4)"
      ],
      "relevance": "Basis for appeal from High Court of Hyderabad."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgments of High Court, Sadar Adalat, and executing court set aside; executing court directed to proceed with execution from stage of Registrar's interference.",
    "relief_granted": "Execution of full decree proceeds in Civil Court, Balda.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The language employed in this section does not place the Registrar on the same pedestal as a court passing the decree under the Civil Procedure Code.\"",
      "speaker": "court",
      "significance": "Core interpretation limiting Registrar's role."
    },
    {
      "text": "\"The act of the Registrar in accepting the first instalment was a clear trespass on the duties of the executing court.\"",
      "speaker": "court",
      "significance": "Explains invalidity of Registrar's intervention."
    },
    {
      "text": "\"The requisition of the Registrar to the executing court to stop execution proceedings ... were in excess of the jurisdiction conferred on him and the executing court was entitled to ignore it.\"",
      "speaker": "court",
      "significance": "Directs courts to disregard Registrar's stay orders."
    }
  ],
  "_case_id": "1950_32",
  "_label": 1,
  "_text_length": 11427,
  "_extracted_at": "2026-02-08T22:12:04.126995"
}