{
  "metadata": {
    "case_name": "Kapurchand v. Mst. Kaderunnissa",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "KHALILUZZAMAN J."
    ],
    "case_number": "Civil Appeal No. 189 of 1950",
    "date_of_judgment": "1950-10-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant, Kapurchand, had a money decree against one Mir Hamid Ali Khan, husband of the respondent Mst. Kaderunnissa.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In execution of the decree the house in dispute belonging to the deceased judgment-debtor was attached.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The widow of the deceased raised an objection to the attachment on the ground that she was in possession of it in lieu of her outstanding dower and could not be dispossessed till her claim was satisfied.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "The objection was allowed by the executing court and it was ordered that the house be sold subject to the respondent's claim, the decree-holder being entitled to the surplus, if any, out of the sale proceeds.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "The executing court took the view that the widow's claim for dower had priority over the debts due to other unsecured creditors and her position was analogous to that of a secured creditor.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "There was not much possibility of the house fetching more in the execution sale than the amount due on account of dower.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The decree holder made an application in revision to the High Court but without any success.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "He then preferred an appeal to the Judicial Committee of the State and it is now before us under article 374(4) of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "It is conceded that the husband died leaving the house in dispute and leaving outstanding a number of debts including the one due to the decree-holder. The house was not charged or mortgaged by him either in favour of his wife or in favour of any of the creditors.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether a widow in possession of her husbands estate in lieu of her claim for dower with the consent of the other heirs or otherwise is entitled to priority as against his other unsecured creditors.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "a widows claim for outstanding dower even when she is in possession of her husbands estate in lieu of her claim with the consent of other heirs of the deceased stands on no better footing than that of unsecured creditors, though in their absence she is entitled to be paid in full before the estate is distributed among the heirs.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Quranic texts in Surai-Nissa; writings of jurists; no specific Quranic text or original authority gives priority over unsecured creditors"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "a widow has a lien on her husbands estate for her outstanding dower and when she has entered into possession of his house after his death she cannot be dispossessed till her claim is satisfied either by the heirs or by the unsecured creditors.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Decision of the Hyderabad High Court and some other High Courts in India"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Unless the husband by his own act has placed the widow in a better position than his other creditors, her claim for dower is in the nature of an unsecured debt and she has no priority of any kind against the other unsecured creditors of her husband.",
      "addresses_issue": "i1",
      "key_observation": "A widow by her lien does not have any priority over other creditors. Mehr as a debt has priority over other heirs claim to have the estate distributed among themselves. These two considerations are not affected by the fact of her being in or out of possession of the estate."
    },
    {
      "id": "cr2",
      "text": "The Quranic text in Surai-Nissa, Ruku 4, enjoins the payment of dower in preference to bequests and inheritance but it is silent on the question of priority of dower debt in relation to other creditors.",
      "addresses_issue": "i1",
      "key_observation": "No distinction is made between an injunction relating to the payment of dower on the one hand and the payment of the other debts on the other."
    },
    {
      "id": "cr3",
      "text": "In the administration of the estate of a deceased Muslim the rule laid down by early text writers and Fatwas, such as Fatwa-e-Alamgiri, is that in the first instance the funeral expenses of the deceased should be paid out of the estate and that having been done, the estate should be divided between the legatees and the heirs after payment of the debts due from him. No priority has been indicated in respect of a dower debt of a widow over other unsecured creditors even if she has taken possession of her husbands estate after his death.",
      "addresses_issue": "i1",
      "key_observation": "Payment of debts has priority over bequests and wills."
    },
    {
      "id": "cr4",
      "text": "Dower is purely in the nature of a marriage settlement and is for consideration. It is a claim arising out of contract by the husband and as such has preference to bequests and inheritance, but on no principle of Muhammadan Law it can have priority over other contractual debts.",
      "addresses_issue": "i1",
      "key_observation": "a dower debt cannot be given any priority over other debts on any equitable consideration or on the ground that there is something inherent in its very nature which entitles it to priority."
    },
    {
      "id": "cr5",
      "text": "The result of the authorities is that excepting the two Allahabad decisions mentioned above and a decision of the Hyderabad High Court, the consensus of authority is against the proposition that a widow as an unsecured creditor has any priority over the other unsecured creditors of her husband.",
      "addresses_issue": "i1",
      "key_observation": "the above mentioned two Allahabad decisions do not lay down the law correctly on this point and the rule has been correctly laid down in Ameer Ammal v. Sankaranarayanan Chetty."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "the objection raised by the widow had no substance in it and the executing court should have directed the property to be sold and the sale proceeds distributed rateably amongst the decree-holders and the widow.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ameer Ammal v. Sankaranarayanan Chetty",
      "citation": "I.L.R. 25 Mad. 658",
      "treatment": "followed",
      "relevance": "claim for unpaid dower constitutes a debt payable pari passu with the demands of other creditors and is not a preferential charge on the estate"
    },
    {
      "case_name": "Maina Bibi v. Chaudhri Vakil Ahmad",
      "citation": "52 I.A. 145",
      "treatment": "referred",
      "relevance": "where the widow is not in the position of a secured creditor and is otherwise in possession of the husbands estate with the consent of the heirs, she is entitled to retain possession of it until her dower debt is satisfied; does not place the widow on a higher footing than any other creditor"
    },
    {
      "case_name": "Meer Meher Ally v. Mst. Amanee",
      "citation": "11 W.R. 212",
      "treatment": "referred",
      "relevance": "lien of the widow over the property in her possession is not a lien in the ordinary legal sense; claim for dower ranks pari passu with other creditors"
    },
    {
      "case_name": "Maina Bibi v. Wasi Ahmad",
      "citation": "I.L.R. 41 All 538",
      "treatment": "referred",
      "relevance": "widow has no right of possession against the creditors, not being a secured creditor herself; her claim ranks equally with other creditors"
    },
    {
      "case_name": "Hamira Bibi v. Zubaida Bibi",
      "citation": "A.I.R. 1916 P.C. 46",
      "treatment": "referred",
      "relevance": "dower ranks as a debt and the wife is entitled along with the other creditors to have it satisfied; her right is not greater than that of any other unsecured creditor"
    },
    {
      "case_name": "Imtiaz Begum v. Abdul Karim Khan",
      "citation": null,
      "treatment": "referred",
      "relevance": "same view expressed that widow's right is not greater than other creditors"
    },
    {
      "case_name": "Kulsum Bibi v. Shiam Sunder Lal",
      "citation": "A.I.R. 1930 All 881",
      "treatment": "distinguished",
      "relevance": "held widow in possession entitled as against heirs and creditors to retain possession until dower satisfied; against consensus"
    },
    {
      "case_name": "Mst. Ghafooran v. Ram Chandra Das",
      "citation": "A.I.R. 1934 All. 168",
      "treatment": "distinguished",
      "relevance": "her possession could not be disturbed till dower debt satisfied; against consensus"
    },
    {
      "case_name": "Mohamed Turabuddin v. Yasin Begum",
      "citation": "17 D.L.R. 224",
      "treatment": "distinguished",
      "relevance": "claim of widow for dower in nature of secured debt; no other creditor involved"
    },
    {
      "case_name": "Wahidunnissa Begum v. Yasin Begum",
      "citation": "32 D.L.R. 421",
      "treatment": "referred",
      "relevance": "claim of widow for dower does not create any interest or charge on the property; position of creditor and heir"
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 374(4)"
      ],
      "relevance": "Appeal before the court under this article from judgment of High Court of Hyderabad"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, set aside the judgments of the two courts below and direct the executing court to proceed with the execution in accordance with the observations made herein, by selling the property and distributing sale proceeds rateably amongst the decree-holders and the widow.",
    "relief_granted": "Executing court to sell the house free of widow's claim and distribute proceeds rateably.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A widow by her lien does not have any priority over other creditors. Mehr as a debt has priority over other heirs claim to have the estate distributed among themselves.",
      "speaker": "court",
      "significance": "Core legal proposition from Tyabji's Muhammadan Law adopted by court"
    },
    {
      "text": "dower debt cannot be given any priority over other debts on any equitable consideration or on the ground that there is something inherent in its very nature which entitles it to priority.",
      "speaker": "court",
      "significance": "Rejects priority for dower over unsecured debts"
    },
    {
      "text": "the consensus of authority is against the proposition that a widow as an unsecured creditor has any priority over the other unsecured creditors of her husband.",
      "speaker": "court",
      "significance": "Summarizes weight of precedents"
    }
  ],
  "_case_id": "1950_30",
  "_label": 1,
  "_text_length": 13215,
  "_extracted_at": "2026-02-10T19:15:19.549470"
}