{
  "metadata": {
    "case_name": "State of Bombay v. First Respondent",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "Fazl Ali J.",
      "Mahajan J.",
      "Patanjali Sastri J."
    ],
    "case_number": "Appeal from High Court Suit No. 240 of 1950",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "First respondent presented plaint on 6th February 1950 to Prothonotary of Bombay High Court for summary suit against second respondent to recover Rs. 11,704-2-4 on promissory notes.",
      "type": "procedural",
      "date": "1950-02-06",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Suit instituted in High Court contravening notification dated 20th January 1950 under Section 4 of Bombay City Civil Court Act, raising pecuniary limit to Rs. 25,000, barring High Court jurisdiction under Section 12.",
      "type": "procedural",
      "date": "1950-01-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Plaint stated High Court had jurisdiction as Act and notification ultra vires.",
      "type": "disputed",
      "date": null,
      "source": "first_respondent"
    },
    {
      "id": "f4",
      "text": "On 23rd February 1950, Judge in Chambers admitted plaint holding Section 4 ultra vires.",
      "type": "procedural",
      "date": "1950-02-23",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "State of Bombay impleaded as defendant on application of Advocate-General; proceedings transferred to Division Bench.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "High Court (Chagla C.J. and Tendolkar J.) on 29th March 1950 held Act intra vires but Section 4 void as delegation; suit properly in High Court.",
      "type": "procedural",
      "date": "1950-03-29",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Bombay City Civil Court Act, 1948 (Act XL of 1948) established additional civil court for Greater Bombay with jurisdiction over suits not exceeding Rs.10,000 (extendable to Rs.25,000 under Sec 4), barring High Court jurisdiction under Sec 12 except for special reasons.",
      "type": "background",
      "date": "1948-05-10",
      "source": "statute"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Bombay City Civil Court Act, 1948 (Act XL of 1948), is ultra vires the Legislature of the State of Bombay.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether in any event Section 4 of the above Act is ultra vires the State Legislature.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the Bombay High Court has jurisdiction to try the suit.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Act intra vires under Entry 1 List II (administration of justice, constitution and organisation of courts); includes power to confer general jurisdiction; Entries 53 List I, 2 List II are for special jurisdiction on matters in respective lists.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Government of India Act, 1935, Seventh Schedule Lists I, II; Entry 1 List II"
    },
    {
      "id": "pa2",
      "text": "Section 4 is conditional legislation, not delegation; Legislature fixed policy (initial Rs.10,000, max Rs.25,000); Government determines timing.",
      "supporting_facts": [
        "f2",
        "f7"
      ],
      "legal_basis": "Queen v. Burah; Sections 3,4 Bombay City Civil Court Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Act ultra vires as confers jurisdiction on City Court over matters in List I (e.g. promissory notes Entry 28 List I); only Federal Legislature can confer jurisdiction via Entry 53 List I.",
      "supporting_facts": [
        "f1",
        "f7"
      ],
      "legal_basis": "Government of India Act, 1935, Section 100, Lists I,II,III Entries 53,2,15,28"
    },
    {
      "id": "ra2",
      "text": "Entry 1 List II excludes jurisdiction; limited to constitution/organisation; Entry 2 List II for jurisdiction only on List II matters.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Government of India Act, 1935, List II Entries 1,2"
    },
    {
      "id": "ra3",
      "text": "Section 4 delegates legislative power to Provincial Government to confer/enhance jurisdiction.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "Jitendranath Gupta v. Province of Bihar; Section 4 Bombay City Civil Court Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Entry 1 List II 'administration of justice, constitution and organisation of all courts' includes general jurisdiction/power; cannot administer justice without jurisdiction; Entries 2 List II, 53 List I for special jurisdiction/powers on list matters.",
      "addresses_issue": "i1",
      "key_observation": "Provincial Legislature can invest courts with general civil jurisdiction; special barring/conferring by appropriate legislature."
    },
    {
      "id": "cr2",
      "text": "Act in pith and substance under List II; incidental encroachment on List I immaterial per doctrine.",
      "addresses_issue": "i1",
      "key_observation": "Legislative practice pre-1935 supports general jurisdiction courts."
    },
    {
      "id": "cr3",
      "text": "Section 4 conditional legislation; Legislature fixed limits/policy (Rs.10k initial, max 25k); Government executes by notification when circumstances arise.",
      "addresses_issue": "i2",
      "key_observation": "Distinguished from delegation; akin to Queen v. Burah territorial extension."
    },
    {
      "id": "cr4",
      "text": "High Court jurisdiction barred; suit cognizable by City Civil Court.",
      "addresses_issue": "i3",
      "key_observation": "Notification valid; suit value within limit."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Bombay City Civil Court Act, 1948 intra vires Provincial Legislature under Entry 1 List II.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Section 4 intra vires; conditional legislation, not invalid delegation.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Bombay High Court lacks jurisdiction; City Civil Court has jurisdiction.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Queen v. Burah",
      "citation": "3 A.C. 889 or 5 I.A. 178",
      "treatment": "followed",
      "relevance": "Conditional legislation valid; extension of territorial/pecuniary jurisdiction not delegation."
    },
    {
      "case_name": "Prafulla Kumar Mukherjee v. Bank of Commerce Ltd., Khulna",
      "citation": "1947 F.C.R. 28",
      "treatment": "followed",
      "relevance": "Pith and substance money-lending; incidental effect on promissory notes (List I) does not invalidate."
    },
    {
      "case_name": "Jitendranath Gupta v. Province of Bihar",
      "citation": "1949 F.C.R. 595",
      "treatment": "distinguished",
      "relevance": "True delegation (modification/re-enactment) invalid; unlike fixed-limit conditional here."
    },
    {
      "case_name": "Mulchand Kundanmal Jagtiani v. Raman Hiralal Shah",
      "citation": "51 Bom. L.R. 86",
      "treatment": "followed",
      "relevance": "Act intra vires under Entry 1 List II."
    },
    {
      "case_name": "Field v. Clark",
      "citation": "143 U.S. 649",
      "treatment": "referred",
      "relevance": "Legislature can make law conditional on future executive determination."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay City Civil Court Act, 1948 (Act XL of 1948)",
      "sections": [
        "Section 3",
        "Section 4",
        "Section 12"
      ],
      "relevance": "Establishes City Civil Court with general civil jurisdiction up to Rs.10,000 (extendable to 25,000); bars High Court jurisdiction."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Section 100",
        "Seventh Schedule List I Entries 28,53",
        "List II Entries 1,2",
        "List III Entries 4,15"
      ],
      "relevance": "Distributes legislative powers; Provincial competence for administration of justice/courts includes general jurisdiction."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 9"
      ],
      "relevance": "Courts have jurisdiction over all civil suits except barred; supports general jurisdiction."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; Bombay City Civil Court Act and Section 4 held intra vires; High Court lacks jurisdiction over the suit valued at Rs.11,704; suit to be tried by City Civil Court.",
    "relief_granted": "High Court decision on Section 4 reversed; jurisdiction affirmed for City Civil Court.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'administration of justice has a wide meaning, and includes administration of civil as well as criminal justice... are wide enough to include the power and jurisdiction of courts'",
      "speaker": "court",
      "significance": "Fazl Ali J. on scope of Entry 1 List II."
    },
    {
      "text": "The correct view is to hold that it is not necessary to call into aid either entry 4 of List III... the words administration of justice constitution and organization of courts are by themselves sufficient",
      "speaker": "court",
      "significance": "Fazl Ali J. affirming provincial power for general jurisdiction."
    },
    {
      "text": "Legislation, conditional on the use of particular powers, or on the exercise of a limited discretion, entrusted by the Legislature to persons in whom it places confidence, is not uncommon",
      "speaker": "court",
      "significance": "From Queen v. Burah, applied to Section 4."
    }
  ],
  "_case_id": "1950_51",
  "_label": 1,
  "_text_length": 156140,
  "_extracted_at": "2026-02-10T19:15:27.012938"
}