{
  "metadata": {
    "case_name": "Appellants v. Respondent",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "DAS J."
    ],
    "case_number": "Civil Appeal No. XXVI of 1949",
    "date_of_judgment": "1950-03-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are members of the East India Cotton Association Ltd. Respondent is not a member.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In April 1945, Respondent employed Appellants as agents to effect forward contracts for sale/purchase of cotton according to Association rules.",
      "type": "material",
      "date": "1945-04",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Between 9th April 1945 and 10th August 1945, Appellants put through various contracts for July/September 1945 deliveries and sent contract notes to Respondent. All in printed forms.",
      "type": "material",
      "date": "1945-04-09 to 1945-08-10",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 10th August 1945, purchase of 900 bales at Rs. 432 per candy for September 1945 delivery outstanding.",
      "type": "material",
      "date": "1945-08-10",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondent claims instructed Appellants on 11th August 1945 to close outstanding purchase by selling 900 bales at not less than Rs. 426 per candy (prevailing market rate).",
      "type": "disputed",
      "date": "1945-08-11",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Appellants deny any instruction on 11th August 1945 or receipt of Respondent's letter.",
      "type": "disputed",
      "date": "1945-08-11",
      "source": "appellants"
    },
    {
      "id": "f7",
      "text": "On 18th August 1945, Respondent put instructions on record and asked for contract note.",
      "type": "procedural",
      "date": "1945-08-18",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "21st August 1945 was clearing date; Rs. 18,900 due from Respondent to Appellants. Appellants allege Respondent concocted false story instead of paying.",
      "type": "disputed",
      "date": "1945-08-21",
      "source": "appellants"
    },
    {
      "id": "f9",
      "text": "Appellants' letter 22nd August 1945 repudiated allegations, demanded Rs. 18,900, notice to square up by noon 23rd August if not paid.",
      "type": "procedural",
      "date": "1945-08-22",
      "source": "appellants"
    },
    {
      "id": "f10",
      "text": "Respondent on 24th August 1945 denied fabrication, repudiated liability, returned bill.",
      "type": "procedural",
      "date": "1945-08-24",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Appellants on 27th August 1945 closed contract by selling 900 bales at Rs. 356 per candy, sent contract note No. 17996.",
      "type": "material",
      "date": "1945-08-27",
      "source": "appellants"
    },
    {
      "id": "f12",
      "text": "Respondent on 28th August 1945 reiterated prior instructions, denied new instructions, returned contract note No. 17996.",
      "type": "procedural",
      "date": "1945-08-28",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Appellants on 28th August 1945 claimed Rs. 34,313, desired reference to arbitration per contract notes.",
      "type": "procedural",
      "date": "1945-08-28",
      "source": "appellants"
    },
    {
      "id": "f14",
      "text": "Both parties appointed arbitrators; meeting fixed for 24th October 1945.",
      "type": "procedural",
      "date": "1945-10-24",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Respondent received notice on 22nd October 1945, could not attend due to Income Tax appointment, sent agent for adjournment.",
      "type": "procedural",
      "date": "1945-10-22 to 1945-10-24",
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "Arbitrators rejected adjournment, made ex parte award for Rs. 34,313, interest and costs.",
      "type": "procedural",
      "date": "1945-10-24",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Respondent filed appeal to Board of Association on 10th November 1945.",
      "type": "procedural",
      "date": "1945-11-10",
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "Pending appeal, Respondent discovered contract notes not in official form, advised contracts void under Bombay Cotton Contracts Act IV of 1932.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f19",
      "text": "Respondent amended appeal memo and filed application in Bombay High Court under Indian Arbitration Act 1940 to declare arbitration agreement invalid, set aside award.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f20",
      "text": "Chagla J. dismissed application on 2nd July 1946.",
      "type": "procedural",
      "date": "1946-07-02",
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "Respondent appealed (Appeal No. 42 of 1946); Stone C.J. and Coyajee J. allowed appeal on 20th March 1947, declared contracts invalid, set aside award.",
      "type": "procedural",
      "date": "1947-03-20",
      "source": "lower_court"
    },
    {
      "id": "f22",
      "text": "Appellants obtained certificate, appealed to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "appellants"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the contract notes issued by Appellants to Respondent were in accordance with the bye-laws of the East India Cotton Association, and if not, whether the contracts are void under Section 8 of the Bombay Cotton Contracts Act, 1932, rendering the arbitration agreement invalid and the award set aside.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there was a pre-existing oral contract dehors the contract notes that was subject to bye-laws, even if notes defective.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Bye-law 82 does not require contracts between agents and constituents to be in writing or particular form; only that they be subject to bye-laws and notes rendered in prescribed form. Defect in note form does not void pre-existing contract.",
      "supporting_facts": [
        "f3",
        "f20"
      ],
      "legal_basis": "Bye-law 82, Section 8 Bombay Cotton Contracts Act 1932"
    },
    {
      "id": "pa2",
      "text": "Rubber stamp provision for deposit not less than Rs. 25 per bale does not contravene bye-law 51-A (minimum Rs. 12.5), as higher rate permissible under terms of business.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Bye-law 51-A"
    },
    {
      "id": "pa3",
      "text": "Contract expressly subject to bye-laws, so bye-law 65-A incorporated by reference even if clauses omitted.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Bye-law 65-A"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Contract notes not in official form per bye-laws (missing deposit clause update, omitted bye-law 65-A clauses, outdated rubber stamp), hence contracts void under Section 8 Bombay Cotton Contracts Act 1932, arbitration agreement void, award invalid.",
      "supporting_facts": [
        "f3",
        "f11",
        "f18"
      ],
      "legal_basis": "Section 8 Bombay Cotton Contracts Act 1932, Bye-laws 80, 82, 51-A, 65-A"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "When contract reduced to writing, writing is repository; if not per bye-laws, contract void. Even assuming pre-existing oral contract, its terms match defective notes, not per bye-laws.",
      "addresses_issue": "i1",
      "key_observation": "Contract notes defective in deposit clause (outdated Rs.25 vs required Rs.12.5) and omitted bye-law 65-A clauses."
    },
    {
      "id": "cr2",
      "text": "Rubber stamp imposes higher minimum deposit, inconsistent with bye-law 51-A; mis-summarises amended bye-law.",
      "addresses_issue": "i1",
      "key_observation": "Terms of business cannot prevail over inconsistent bye-laws."
    },
    {
      "id": "cr3",
      "text": "Bye-law 65-A regulates inter-member relations; cannot be incorporated by reference into agent-constituent contract meaningfully; omitted clauses protected constituent rights.",
      "addresses_issue": "i1",
      "key_observation": "Express subjection to bye-laws does not incorporate meaningless provisions."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Contract notes not in accordance with bye-laws; contracts void under Section 8 Bombay Cotton Contracts Act 1932; arbitration agreement and award invalid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bombay Cotton Contracts Act, 1932",
      "sections": [
        "Section 8"
      ],
      "relevance": "Renders contracts not in accordance with bye-laws of recognised cotton association void."
    },
    {
      "name": "Indian Arbitration Act, 1940",
      "sections": [],
      "relevance": "Basis for Respondent's application to declare arbitration agreement invalid and set aside award."
    },
    {
      "name": "Bombay Options in Cotton Prohibition Act, 1939",
      "sections": [],
      "relevance": "Empowered Government notification amending contract note forms."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court agrees with Bombay High Court Division Bench, upholds declaration that arbitration agreement in contract notes invalid and void, sets aside award made by arbitrators.",
    "relief_granted": "Declaration of invalidity of arbitration agreement and setting aside of award",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Ordinarily, when a contract between the parties is reduced to writing, the writing becomes the repository of the contract and that writing only can be looked at to ascertain what the contract between the parties is, and if that writing is not in accordance with the bye-laws, the contract itself must be void.\"",
      "speaker": "court",
      "significance": "Core reasoning on why defective contract notes void the contracts."
    },
    {
      "text": "\"The rubber stamp provision clearly imposes on the respondent as the constituent the liability to deposit a higher amount as the minimum amount to be deposited and is to that extent not in accordance with bye-law 51-A.\"",
      "speaker": "court",
      "significance": "Explains specific defect in deposit clause."
    }
  ],
  "_case_id": "1950_5",
  "_label": 0,
  "_text_length": 20836,
  "_extracted_at": "2026-02-10T19:14:34.637785"
}