{
  "metadata": {
    "case_name": "Chief Controlling Revenue Authority v. Respondent Company",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "Kania C.J."
    ],
    "case_number": "Civil Appeal No. XII of 1950",
    "date_of_judgment": "1950-05-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent company borrowed money from the Central Bank of India Ltd. at Bombay. In order to secure the loan a document was executed on the 22nd of March, 1945, with a stamp of Rs. 16-8-0, on the footing that it was a deed of hypothecation without possession of the goods.",
      "type": "material",
      "date": "1945-03-22",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "When the deed was sent to the Sub-Registrar for registration he impounded the same and sent it to the Stamp Office.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Assistant Superintendent of Stamps wrote to the respondent that the document was a mortgage with possession, chargeable with duty under article 40(a) of the Schedule and inquired why it was not duly stamped before execution.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The respondents solicitors in their reply contended that the document was not, and was never intended by the parties to be, a mortgage with possession. They pointed out that no possession of the property had been given or was intended to be given, except in certain contingencies and therefore the document was properly stamped.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "In reply the Assistant Superintendent intimated that the document was chargeable with duty of Rs. 56,250 and a penalty of Rs. 5,000 had been imposed. The respondents were asked to pay the amount forthwith.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "On the 27th July, 1945, the respondent filed a suit against the Central Bank contending that the document was not a mortgage with possession. It was alleged that since a doubt had arisen as to whether the document gave effect to the common intention of the parties the Courts directions were sought for and if the Court found that the document as framed did not give effect to the said common intention of the parties the instrument may be rectified.",
      "type": "procedural",
      "date": "1945-07-27",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "On 9th August, 1945, the respondents solicitors informed the Assistant Superintendent that such a suit had been filed and requested that the demand for payment of stamp duty and penalty may not be pressed under the circumstances.",
      "type": "procedural",
      "date": "1945-08-09",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "In the further correspondence, on behalf of the appellant, the demand was reiterated and resort to the coercive procedure of section 48 of the Stamp Act was threatened.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The Collector thereafter sent a letter to the respondents on the 17th January, 1946, demanding payment.",
      "type": "procedural",
      "date": "1946-01-17",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "On the 25th of January, 1946, the suit filed by the respondent was disposed of by the Court and the rectification as prayed was ordered.",
      "type": "procedural",
      "date": "1946-01-25",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The respondents solicitors immediately intimated the result of the suit to the Assistant Superintendent and sent a copy of the deed showing the rectifications made in the original document. A similar letter was also sent to the Collector of Bombay.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "On the 1st February, 1946, the respondents solicitors enquired of the Assistant Superintendent of Stamps whether he was agreeable to make a reference under section 56(2) to the appellant, as the question of liability to pay the stamp duty and penalty involved important questions of law.",
      "type": "procedural",
      "date": "1946-02-01",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "A petition on behalf of the respondent to the appellant was also filed on the 5th of February in which it was prayed that either the order of the Assistant Superintendent of Stamps be rescinded or in the alternative a case may be referred under section 57 of the Stamp Act for the opinion of the High Court.",
      "type": "procedural",
      "date": "1946-02-05",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "This petition was rejected on the 4th July, 1946.",
      "type": "procedural",
      "date": "1946-07-04",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "The respondent thereupon filed a petition in the High Court on the 19th of July, 1946, praying that a writ of certiorari may be issued against the appellant, or an order may be made against him under section 45 of the Specific Relief Act, to cancel the levy of the stamp duty and penalty as claimed on behalf of the appellant or in the alternative the appellant may be ordered under section 57 of the Stamp Act to refer the matter to the High Court for its opinion.",
      "type": "procedural",
      "date": "1946-07-19",
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "The matter came for hearing before Mr. Justice Blagden who did not grant the first relief but directed the appellant to state a case under section 57 of the Stamp Act to the Court for its opinion.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "The appellant filed an appeal but failed.",
      "type": "procedural",
      "date": "1947-09-02",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Appeal to Supreme Court from judgment and order of the High Court of Bombay (Chagla, Acting C.J. and Bhagwati J.) dated 2nd September, 1947, in Appeal No. 60 of 1946.",
      "type": "background",
      "date": "1947-09-02",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether under section 57 of the Stamp Act there is an obligation on the appellant to state a case, and if not whether the High Court had jurisdiction to give a direction to that effect.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether having regard to the terms of section 226(1) of the Government of India Act, 1935, the High Court had jurisdiction to order the appellant to state the case, it being a matter relating to the revenue.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the matter had proceeded beyond the stage of assessment and had reached the stage of recovery, depriving the High Court of jurisdiction.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under section 57 of the Stamp Act there is no obligation on the appellant to state a case; it is a discretionary power given to the appellant ('may' not 'shall'), for the benefit of the appellant only, not other parties who have no right to insist on a reference.",
      "supporting_facts": [
        "f3",
        "f5",
        "f14"
      ],
      "legal_basis": "Section 57 Stamp Act; contrasted with sections 56(2) and 60 Stamp Act"
    },
    {
      "id": "pa2",
      "text": "The scheme of the Stamp Act is different from the Income Tax Act; e.g., under Stamp Act a Collector could certify proper stamping even if insufficient, and Controlling Authority cannot refer for higher duty.",
      "supporting_facts": [],
      "legal_basis": "Section 32 Stamp Act"
    },
    {
      "id": "pa3",
      "text": "Section 226(1) of the Government of India Act, 1935 excludes High Court original jurisdiction in revenue matters.",
      "supporting_facts": [],
      "legal_basis": "Section 226(1) Government of India Act, 1935"
    },
    {
      "id": "pa4",
      "text": "The matter had reached the stage of recovery, not assessment.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The document was not a mortgage with possession; no possession given or intended except in contingencies; properly stamped.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Suit filed for declaration and rectification as document did not give effect to common intention.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Request for reference under section 57 as question involves important questions of law.",
      "supporting_facts": [
        "f12",
        "f13",
        "f15"
      ],
      "legal_basis": "Section 57 Stamp Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 57 gives power coupled with obligation/duty to state case when important question of law arises, e.g., construction of document or effect of rectification order; parties affected can demand it; not just for appellant's benefit.",
      "addresses_issue": "i1",
      "key_observation": "The appellants contentions are unsound... the power contained in section 57 is in the nature of an obligation or is coupled with an obligation"
    },
    {
      "id": "cr2",
      "text": "Sections 56(2) and 60 support this, as they use 'feels doubt'; absence in s57 shows broader purpose benefiting parties.",
      "addresses_issue": "i1",
      "key_observation": "The absence of the words 'feels doubt' ... supports the view that the reference contemplated under that section is not for the benefit of the appellant only but enures also for the benefit of the party affected"
    },
    {
      "id": "cr3",
      "text": "Follows Alcock Ashdown case: power coupled with duty when serious point of law; Court can direct public authority to exercise it.",
      "addresses_issue": "i1",
      "key_observation": "In their Lordships view... there does lie a duty upon the Chief Revenue Authority to state a case... and if he does not appreciate that there is such a serious point, it is in the power of the Court to control him"
    },
    {
      "id": "cr4",
      "text": "Scheme of Stamp Act: Chapters II-III adjudication; from s33 onwards conflicts resolved, s57 falls there.",
      "addresses_issue": "i1",
      "key_observation": "Section 57(1) falls under this heading"
    },
    {
      "id": "cr5",
      "text": "S226(1) GoI Act does not bar: ordering statutory duty is not original jurisdiction concerning revenue.",
      "addresses_issue": "i2",
      "key_observation": "The order of a High Court to a revenue officer to do his statutory duty would not be the exercise of original jurisdiction in any matter concerning the revenue"
    },
    {
      "id": "cr6",
      "text": "Stage of recovery irrelevant; no obstruction to revenue duties.",
      "addresses_issue": "i3",
      "key_observation": "By the relief granted by the High Court no attempt is made to obstruct the Revenue Authority in the discharge of his duties"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under section 57 Stamp Act, Chief Controlling Revenue Authority has power coupled with duty to state case on important questions of law, enforceable by Court direction.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court has jurisdiction to direct statement of case; not barred by s226(1) GoI Act 1935.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Proceedings stage (assessment vs recovery) does not affect jurisdiction.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Alcock, Ashdown Co. Ltd. v. Chief Revenue Authority, Bombay",
      "citation": "50 I.A. 227",
      "treatment": "followed",
      "relevance": "Power to state case under revenue statute coupled with duty; Court can direct if serious point of law"
    },
    {
      "case_name": "Julius v. Bishop of Oxford",
      "citation": "5 A.C. 214",
      "treatment": "referred",
      "relevance": "Power given to public authority may couple with duty based on nature, object, conditions, title"
    },
    {
      "case_name": "Spooner v. Juddow",
      "citation": "4 Moo. I.A. 353",
      "treatment": "referred",
      "relevance": "Principle excluding revenue from civil courts"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Stamp Act",
      "sections": [
        "Section 57",
        "Section 56(2)",
        "Section 60",
        "Section 48",
        "Section 32",
        "Section 31",
        "Section 33",
        "Article 40(a)"
      ],
      "relevance": "Governs duty to state case, impounding, penalties, adjudication, certification; s57 power coupled with duty"
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Section 226(1)"
      ],
      "relevance": "Does not bar High Court from directing performance of statutory duty"
    },
    {
      "name": "Specific Relief Act",
      "sections": [
        "Section 45"
      ],
      "relevance": "Alternative relief sought to compel reference"
    },
    {
      "name": "Indian Income Tax Act, 1918",
      "sections": [
        "Section 51(1)"
      ],
      "relevance": "Analogous provision; scheme similar for duty to refer"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the High Court order directing the Chief Controlling Revenue Authority to state a case under section 57 of the Stamp Act is dismissed. The Supreme Court upholds the High Court's jurisdiction and the Authority's duty to refer the case involving construction of the document and effect of rectification.",
    "relief_granted": "Direction to state case under s57 Stamp Act upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the power contained in section 57 is in the nature of an obligation or is coupled with an obligation and under the circumstances can be demanded to be used also by the parties affected by the assessment of the stamp duty.\"",
      "speaker": "court",
      "significance": "Core holding on duty under s57"
    },
    {
      "text": "\"if he does not appreciate that there is such a serious point, it is in the power of the Court to control him and to order him to state a case.\"",
      "speaker": "court",
      "significance": "From Alcock case, affirming Court's power to direct"
    },
    {
      "text": "\"The order of a High Court to a revenue officer to do his statutory duty would not be the exercise of original jurisdiction in any matter concerning the revenue.\"",
      "speaker": "court",
      "significance": "Rejects bar under s226 GoI Act"
    }
  ],
  "_case_id": "1950_17",
  "_label": 0,
  "_text_length": 22040,
  "_extracted_at": "2026-02-10T19:15:41.795620"
}