{
  "metadata": {
    "case_name": "Ramdeo Sahu v. Eldest son of Raja Pateshwari Partap Narain Singh",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "M.L. Kherjea J."
    ],
    "case_number": "Civil Appeal No. LXX of 1949",
    "date_of_judgment": "1950-11-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Mortgage deed dated 8th March 1926 executed by Raja Pateshwari Partap Narain Singh, holder of Basti Raj (impartible estate governed by primogeniture), in favour of Bhikhiram Sahu for Rs. 5,500 at 9% interest per annum, repayable within one year, hypothecating immovable properties of the estate.",
      "type": "material",
      "date": "1926-03-08",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Suit instituted by Ramdeo Sahu, son and heir of Bhikhiram Sahu (both mortgagor and mortgagee dead), against principal defendant (eldest son of mortgagor who succeeded to Basti estate) to recover Rs. 11,935 (principal Rs. 5,500 plus interest), alleging no payments made.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Defences: (1) Document not properly attested or validly registered, cannot operate as mortgage; (2) No consideration for Rs. 2,000 (items 3 and 4); (3) Relief under United Provinces Agriculturists Relief Act.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Trial court (Civil Judge of Basti, 6th November 1939): Held in favour of defendant on Agriculturists Relief Act, negatived other pleas; preliminary decree for sale for Rs. 5,500 principal plus interest per Act, payable in instalments.",
      "type": "procedural",
      "date": "1939-11-06",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Allahabad High Court (Verma and Yorke JJ., 22nd April 1943): Reversed trial court, dismissed suit holding bond not attested as required by law, and suit beyond 6 years so no money decree possible.",
      "type": "procedural",
      "date": "1943-04-22",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Harbhajan Lal (attesting witness, turned hostile): Signed as witness at Collectorate Kutchery (Bar Library) after mortgagor's signature already on deed; neither he nor Jawala Prasad Tewari signed in mortgagor's presence nor vice versa; document brought by Bhikhi Ram, Ghur Lal (karinda), Jawala Prasad Patwari (scribe).",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Jawala Prasad Patwari (scribe, defendant witness): Draft prepared at Raja's sherista under instructions from Bhikhi Ram and Ghur Lal; after stamping, taken to Raja's Kot for signature; then to Collectorate Kutchery for Harbhajan Lal and Jawala Prasad Tewari signatures; registered by Jainarayan Sukul (Raja's attorney).",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Plaintiff Ramdeo Sahu: Execution and attestation at one sitting in Raja's Kot on 8th March 1926; terms settled beforehand; accompanied by Harbhajan Lal (deed writer), Buddhu Lal (servant), Jawala Prasad Tewari; Jawala Prasad Patwari already there; draft by Buddhu Lal, scribed by Patwari at Raja's wish; Raja signed in presence of Harbhajan Lal and Tewari, who then signed in Raja's presence.",
      "type": "disputed",
      "date": "1926-03-08",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Buddhu Lal (plaintiff witness): Supported plaintiff's version materially.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Signatures of executant and Harbhajan Lal in same ink.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Harbhajan Lal usually employed by plaintiff's father as scribe or attesting witness.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Buddhu Lal trusted servant, witnessed registered receipt Ex.10 for Rs.500 under mortgage.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the mortgage bond was properly attested in the manner required by law so as to operate as a mortgage instrument.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the High Court was justified in reversing the trial court's finding of fact on attestation.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court approached attestation from wrong standpoint and had no justification to reverse trial court's findings; trial court had advantage of seeing witnesses.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Principles of appellate review of facts; Section 68 Indian Evidence Act"
    },
    {
      "id": "pa2",
      "text": "Plaintiff's version of execution and attestation at Raja's Kot supported by evidence.",
      "supporting_facts": [
        "f8",
        "f9",
        "f10",
        "f11",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Bond not attested; plaintiff's story improbable as Bhikhi Ram (not plaintiff) should have been present; story invented after Harbhajan Lal turned hostile.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Trial court's findings based on improbability of defendant's case, not demeanour; plaintiff's case also improbable.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appellate court must bear in mind trial judge's advantage in observing witnesses; should not interfere unless special features or improbability displaces opinion.",
      "addresses_issue": "i2",
      "key_observation": "Rule from Watt v. Thomas and others: Evidence as whole must reasonably justify trial conclusion."
    },
    {
      "id": "cr2",
      "text": "High Court's approach improper; reversed on inadequate grounds; trial finding consistent with circumstances.",
      "addresses_issue": "i2",
      "key_observation": "No detriment to trial finding if not expressly based on demeanour."
    },
    {
      "id": "cr3",
      "text": "Plaintiff's presence probable as son representing father; prior transactions; Harbhajan Lal and Buddhu Lal natural accompaniments.",
      "addresses_issue": "i1",
      "key_observation": "No improbability in story."
    },
    {
      "id": "cr4",
      "text": "Harbhajan Lal knew attestation requirements; signed at execution; turned hostile but condemned by own statement.",
      "addresses_issue": "i1",
      "key_observation": "Same ink supports; experienced deed writer."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Mortgage bond properly attested; High Court not justified in reversing trial court's finding.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Trial court's finding on attestation fully supported by evidence as whole; High Court reversed on inadequate grounds.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Watt v. Thomas",
      "citation": "1947 A.C. 484 at p. 486",
      "treatment": "followed",
      "relevance": "Gist of appellate review of oral evidence and credibility."
    },
    {
      "case_name": "Saraveeraswami v. Talluri",
      "citation": "A.I.R. 1949 P.C. 32",
      "treatment": "followed",
      "relevance": "Adopted observations on appellate deference to trial judge."
    },
    {
      "case_name": "W.C. Macdonald v. Fred Latimer",
      "citation": "A.I.R. 1929 P.C. 15 at 18",
      "treatment": "referred",
      "relevance": "Trial judge's advantage in observing witnesses."
    },
    {
      "case_name": "Netherlandsche Handel Maatschappij v. R.M.P. Chettiar Firm",
      "citation": "A.I.R. 1929 P.C. 202 at 205",
      "treatment": "referred",
      "relevance": "Trial finding not detracted if not based expressly on demeanour."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Evidence Act",
      "sections": [
        "Section 68"
      ],
      "relevance": "Proof of execution of document by attesting witness."
    },
    {
      "name": "United Provinces Agriculturists Relief Act",
      "sections": [],
      "relevance": "Relief granted by trial court on interest and instalments."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, set aside High Court judgment dismissing suit, upheld trial court's preliminary decree for sale on mortgage, finding proper attestation.",
    "relief_granted": "Restoration of trial court's preliminary decree for Rs. 5,500 principal plus interest per U.P. Agriculturists Relief Act, payable in instalments.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the appellate court will bear in mind that it has not enjoyed this opportunity and that the view of the trial Judge as to where credibility lies is entitled to great weight.\"",
      "speaker": "court",
      "significance": "Core principle from Watt v. Thomas on appellate deference."
    },
    {
      "text": "\"The duty of the appellate court in such cases is to see whether the evidence taken as a whole can reasonably justify the conclusion which the trial court arrived at.\"",
      "speaker": "court",
      "significance": "Standard for reversing trial findings on oral evidence."
    },
    {
      "text": "\"the finding of the trial Judge on the question of attestation is perfectly consistent with the circumstances and probabilities of the case.\"",
      "speaker": "court",
      "significance": "Conclusion upholding attestation."
    }
  ],
  "_case_id": "1950_33",
  "_label": 1,
  "_text_length": 21450,
  "_extracted_at": "2026-02-10T19:15:31.010152"
}