{
  "metadata": {
    "case_name": "Chief Controlling Revenue Authority, Bombay v. Respondent Company",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "Kania C.J."
    ],
    "case_number": "Civil Appeal No. XII of 1950",
    "date_of_judgment": "1950-05-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent company borrowed money from Central Bank of India Ltd. at Bombay for its business.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Document executed on 22nd March 1945 with stamp of Rs. 16-8-0 as deed of hypothecation without possession.",
      "type": "material",
      "date": "1945-03-22",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Sub-Registrar impounded the document and sent it to Stamp Office for registration.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Assistant Superintendent of Stamps held document was mortgage with possession chargeable under Article 40(a) of Schedule, inquired why not duly stamped before execution.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "Respondent's solicitors replied that document was not and never intended to be mortgage with possession, no possession given or intended except in contingencies, properly stamped.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Assistant Superintendent intimated duty of Rs. 56,250 and penalty of Rs. 5,000 imposed, payment demanded forthwith.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f7",
      "text": "On 27th July 1945, respondent filed suit against Central Bank contending document not mortgage with possession, sought court's direction on common intention, and rectification if needed.",
      "type": "procedural",
      "date": "1945-07-27",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "On 9th August 1945, respondent's solicitors informed Assistant Superintendent of suit filed, requested not to press demand.",
      "type": "procedural",
      "date": "1945-08-09",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Appellant reiterated demand, threatened coercive procedure under section 48 of Stamp Act.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f10",
      "text": "Collector sent letter demanding payment on 17th January 1946.",
      "type": "procedural",
      "date": "1946-01-17",
      "source": "appellant"
    },
    {
      "id": "f11",
      "text": "On 25th January 1946, court disposed of suit, ordered rectification as prayed.",
      "type": "procedural",
      "date": "1946-01-25",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Respondent's solicitors intimated suit result to Assistant Superintendent and sent copy of rectified deed; similar to Collector.",
      "type": "procedural",
      "date": "1946-01-25",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "On 1st February 1946, respondent's solicitors enquired if Assistant Superintendent agreeable to reference under section 56(2) to appellant.",
      "type": "procedural",
      "date": "1946-02-01",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Petition filed to appellant on 5th February 1946 praying rescind order or refer case under section 57 to High Court.",
      "type": "procedural",
      "date": "1946-02-05",
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Petition rejected by appellant on 4th July 1946.",
      "type": "procedural",
      "date": "1946-07-04",
      "source": "appellant"
    },
    {
      "id": "f16",
      "text": "Respondent filed petition in High Court on 19th July 1946 for writ of certiorari, or order under section 45 Specific Relief Act to cancel levy, or direct appellant under section 57 to refer to High Court.",
      "type": "procedural",
      "date": "1946-07-19",
      "source": "respondent"
    },
    {
      "id": "f17",
      "text": "Mr. Justice Blagden did not grant first relief but directed appellant to state case under section 57 to Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Appellant filed appeal to Division Bench (Chagla Acting C.J. and Bhagwati J.), which failed; judgment dated 2nd September 1947.",
      "type": "procedural",
      "date": "1947-09-02",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Appeal to Supreme Court filed.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether under section 57 of the Stamp Act there is an obligation on the appellant to state a case, and if not whether the High Court had jurisdiction to give a direction to that effect.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether having regard to section 226(1) of the Government of India Act, 1935, the High Court had jurisdiction to order the appellant to state the case, it being a matter relating to revenue, and whether matter had proceeded beyond assessment to recovery stage.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Section 57 uses 'may', giving only discretionary power to state case, not obligation; for benefit of appellant only, not other parties.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "Stamp Act section 57; contrasted with sections 56(2), 60"
    },
    {
      "id": "pa2",
      "text": "Scheme of Stamp Act different from Income Tax Act; Collector can certify improperly stamped document, no remedy for State.",
      "supporting_facts": [],
      "legal_basis": "Stamp Act section 32"
    },
    {
      "id": "pa3",
      "text": "Section 226(1) GoI Act 1935 excludes High Court original jurisdiction in revenue matters; proceedings reached recovery stage, beyond assessment.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Government of India Act 1935 section 226(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Document was not mortgage with possession, no possession given or intended except contingencies, properly stamped.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Stamp Act Schedule Article 40(a)"
    },
    {
      "id": "ra2",
      "text": "Suit filed for declaration and rectification due to doubt on common intention.",
      "supporting_facts": [
        "f7",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 57 power is coupled with obligation/duty when important question of law arises, e.g., construction of document or effect of rectification; parties affected can demand reference; not just for appellant's benefit.",
      "addresses_issue": "i1",
      "key_observation": "Absence of 'feels doubt' in s57 distinguishes from s56(2), supports benefit to affected party."
    },
    {
      "id": "cr2",
      "text": "Follows Alcock case: 'may' can couple power with duty per Julius v Bishop of Oxford; applicable despite scheme differences between Stamp Act and Income Tax Act.",
      "addresses_issue": "i1",
      "key_observation": "Nature of power to fix duty on document construction compels duty to refer serious legal questions."
    },
    {
      "id": "cr3",
      "text": "Scheme of Stamp Act: Chapters II-III adjudication; from s33 onwards handles conflicts, s57 fits there.",
      "addresses_issue": "i1",
      "key_observation": "No grievance in adjudication chapter, but s57 addresses disputes."
    },
    {
      "id": "cr4",
      "text": "High Court order to perform statutory duty not original jurisdiction concerning revenue under s226(1) GoI Act; follows Alcock on similar s106(2) of 1915 Act.",
      "addresses_issue": "i2",
      "key_observation": "Not obstructing revenue duties, just compelling statutory performance."
    },
    {
      "id": "cr5",
      "text": "Recovery stage irrelevant as relief does not obstruct collection.",
      "addresses_issue": "i2",
      "key_observation": "High Court intervention to enforce duty."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under section 57 Stamp Act, Chief Controlling Revenue Authority has power coupled with duty/obligation to state case on important legal questions, enforceable by court direction.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court has jurisdiction to direct reference despite s226(1) GoI Act 1935; not barred as revenue matter or post-assessment stage.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Alcock, Ashdown & Co. Ltd. v. Chief Revenue Authority, Bombay",
      "citation": "50 I.A. 227",
      "treatment": "followed",
      "relevance": "Duty to state case under revenue acts when serious point of law; 'may' couples with duty; court can compel despite revenue exclusion clauses."
    },
    {
      "case_name": "Spooner v. Juddow",
      "citation": "1850 4 Moo. I.A. 353",
      "treatment": "referred",
      "relevance": "Exemplifies exclusion of revenue from civil courts."
    },
    {
      "case_name": "Julius v. Bishop of Oxford",
      "citation": "5 A.C. 214, 222",
      "treatment": "followed",
      "relevance": "Power given to public authority may couple with duty based on nature, object, conditions."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Stamp Act",
      "sections": [
        "57",
        "56(2)",
        "60",
        "40(a)",
        "48",
        "32",
        "31",
        "33"
      ],
      "relevance": "Governs reference of cases on stamp duty assessment; s57 power to state case to High Court; scheme for adjudication and disputes."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "226(1)"
      ],
      "relevance": "Excludes High Court original jurisdiction in revenue matters; held not to bar direction to perform statutory duty."
    },
    {
      "name": "Specific Relief Act",
      "sections": [
        "45"
      ],
      "relevance": "Alternative relief sought to cancel levy."
    },
    {
      "name": "Indian Income Tax Act, 1918",
      "sections": [
        "51(1)"
      ],
      "relevance": "Analogous provision on stating case; compared to Stamp Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the High Court of Bombay's order directing the Chief Controlling Revenue Authority to state a case under section 57 of the Stamp Act to the High Court for its opinion on the stamp duty liability.",
    "relief_granted": "Direction to appellant to state case under section 57 upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the power contained in section 57 is in the nature of an obligation or is coupled with an obligation and under the circumstances can be demanded to be used also by the parties affected by the assessment of the stamp duty.\"",
      "speaker": "court",
      "significance": "Core holding on duty under s57."
    },
    {
      "text": "\"when a capacity or power is given to a public authority there may be circumstances which couple with the power a duty to exercise it.\" (quoting Julius v. Bishop of Oxford)",
      "speaker": "court",
      "significance": "Explains why 'may' imposes duty."
    },
    {
      "text": "\"the order of a High Court to a revenue officer to do his statutory duty would not be the exercise of original jurisdiction in any matter concerning the revenue.\"",
      "speaker": "court",
      "significance": "Resolves s226(1) bar."
    }
  ],
  "_case_id": "1950_17",
  "_label": 0,
  "_text_length": 22040,
  "_extracted_at": "2026-02-08T22:12:09.129825"
}