{
  "metadata": {
    "case_name": "Defendant (Appellant) v. Plaintiff (Respondent)",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "DAS J."
    ],
    "case_number": "Civil Appeal No. 4 of 1950",
    "date_of_judgment": "1950-12-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Maharaja Sris Chandra Nandy of Cossimbazar is the owner of premises No. 374 Upper Chitpur Road in Calcutta.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By Indenture of lease dated April 27, 1931, Maharaja as manager of Cossimbazar Raj Wards Estate demised the premises to Madan Gopal Daga for 51 years from May 1, 1931, at monthly rent of Rs. 1,083-5-3. Sub-clause 6 of clause 2: lessee covenanted not to assign without lessor's written consent, not to be unreasonably withheld for respectable or responsible person. Proviso for re-entry for non-payment of rent for three months or breach.",
      "type": "background",
      "date": "1931-04-27",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On March 25, 1943, Madan Gopal Daga assigned unexpired residue of lease to defendant with lessor's written consent; defendant accepted as lessee.",
      "type": "material",
      "date": "1943-03-25",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Agreement arrived at by correspondence between plaintiff and defendant and their solicitors from January 27, 1945, to February 2, 1945: defendant agreed to assign lease to plaintiff for unexpired residue from February 1, 1945, at Rs. 1,80,000 upon terms in correspondence.",
      "type": "material",
      "date": "1945-01-27 to 1945-02-02",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On February 21, 1945, defendant wrote to lessor intimating agreement to assign to plaintiff and requesting consent.",
      "type": "procedural",
      "date": "1945-02-21",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On March 5, 1945, lessor replied that he had determined the lease and would not entertain consent to transfer.",
      "type": "material",
      "date": "1945-03-05",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On March 8, 1945, defendant's solicitors informed plaintiff's solicitors that consent not secured, no valid transfer possible, agreement cancelled as subject to consent.",
      "type": "procedural",
      "date": "1945-03-08",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On March 10, 1945, plaintiff's solicitors replied that agreement not subject to condition, lessor could not unreasonably refuse consent to respectable person like plaintiff.",
      "type": "procedural",
      "date": "1945-03-10",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On March 17, 1945, lessor filed Suit No. 425 of 1945 against defendant for recovery of premises on ground lease determined.",
      "type": "procedural",
      "date": "1945-03-17",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On July 4, 1945, plaintiff filed suit for specific performance against defendant (Suit No. 1031 of 1945).",
      "type": "procedural",
      "date": "1945-07-04",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On July 13, 1945, lessor's ejectment suit settled by defendant consenting to decree for Rs. 59,213-11-0 arrears of rent, paid up; forfeiture waived, lease revived.",
      "type": "material",
      "date": "1945-07-13",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On August 6, 1945, defendant applied to lessor for consent to assignment; lessor declined without reason.",
      "type": "material",
      "date": "1945-08-06",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Suit heard before Ormond J. in November 1946, adjourned, further heard January 1947; decree on January 24, 1947, for specific performance; if consent not obtained in fortnight, assignment without consent.",
      "type": "procedural",
      "date": "1947-01-24",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Defendant appealed (Appeal No. 21 of 1947); High Court (Harries C.J. and Mukherjea J.) on May 30, 1948, examined Maharaja as witness, dismissed appeal, confirmed decree without need for consent; later amended to allow set-off of rent etc. from purchase price.",
      "type": "procedural",
      "date": "1948-05-30",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the agreement was contingent on obtaining lessor's consent, or whether obligation to obtain consent was a term of the agreement.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Legal incidents of lessee's covenant not to assign without lessor's consent, not unreasonably withheld for respectable person.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether plaintiff could argue at trial that lessor unreasonably withheld consent, relieving defendant of covenant burden, without surprise to defendant.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether evidence of lessor could be adduced in absence as party, and further evidence in appeal under Order XLI r.27 CPC.",
      "framed_by": "court"
    },
    {
      "id": "i5",
      "text": "Whether term requiring consent was for benefit of plaintiff only, waivable by plaintiff.",
      "framed_by": "court"
    },
    {
      "id": "i6",
      "text": "Whether decreeing specific performance exposes defendant to risk of damages for breach of covenant.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Agreement subject to lessor's consent; no effective agreement as consent not obtained; cannot be specifically performed.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Plaintiff's plaint insisted on obtaining consent; new case of unreasonable withholding not permissible at hearing.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Point of unreasonable withholding not raisable without lessor as party; no evidence admissible.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Appeal court erred in allowing further evidence of Maharaja.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Order XLI rule 27 CPC"
    },
    {
      "id": "pa5",
      "text": "Term to obtain consent not for plaintiff's sole benefit; defendant not bound if not obtained.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa6",
      "text": "Specific performance exposes defendant to damages for breach of covenant.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Agreement not subject to condition of consent; defendant bound to obtain it as term; lessor cannot unreasonably refuse respectable person like plaintiff.",
      "supporting_facts": [
        "f4",
        "f8"
      ],
      "legal_basis": "Lease clause 2(6)"
    },
    {
      "id": "ra2",
      "text": "Pleading in para 11 indicated point; no surprise; facts admitted by defendant.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Analysis of correspondence: no agreement by initial letters (counter-offer); final acceptance Feb 2, 1945, unconditional; obligation to obtain consent a binding term, not contingent.",
      "addresses_issue": "i1",
      "key_observation": "Agreement concluded not contingent on consent."
    },
    {
      "id": "cr2",
      "text": "Covenant words qualify lessee's obligation; unreasonable withholding relieves lessee of burden; plaintiff respectable, lessor withheld unreasonably.",
      "addresses_issue": "i2",
      "key_observation": "Defendant relieved of covenant if unreasonable."
    },
    {
      "id": "cr3",
      "text": "No surprise; point indicated in plaint para 11; facts from defendant.",
      "addresses_issue": "i3",
      "key_observation": "Point open to plaintiff."
    },
    {
      "id": "cr4",
      "text": "Court must decide for specific performance relief; not binding on lessor but necessary between parties; appeal court took evidence to clear matter under O.XLI r.27 CPC.",
      "addresses_issue": "i4",
      "key_observation": "Evidence properly admitted."
    },
    {
      "id": "cr5",
      "text": "Term introduced by plaintiff; for his benefit, waivable; defect in title plaintiff accepts.",
      "addresses_issue": "i5",
      "key_observation": "Defendant cannot plead absence to avoid performance."
    },
    {
      "id": "cr6",
      "text": "Defendant did not condition obligation on obtaining consent; damages speculative as plaintiff responsible.",
      "addresses_issue": "i6",
      "key_observation": "No peril to defendant justifying refusal."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Agreement not contingent on lessor's consent; defendant bound to perform specifically without it as lessor unreasonably withheld.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Lease covenant relieved defendant of burden due to unreasonable withholding.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Courts correctly allowed point and evidence.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": null,
      "citation": null,
      "treatment": "referred",
      "relevance": "Judicial decisions on legal incidents of covenant not to assign without consent, referred in High Court judgment."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order XLI rule 27"
      ],
      "relevance": "Permits appellate court to take evidence to clear matter for proper decision."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed defendant's appeal, confirmed High Court's decree for specific performance of agreement to assign lease without lessor's consent, as agreement not contingent on consent and lessor unreasonably withheld it.",
    "relief_granted": "Specific performance; assignment without consent; set-off of rent etc. from purchase price.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"such consent, however, not to be unreasonably withheld in the case of respectable or responsible person\"",
      "speaker": "court",
      "significance": "Key lease clause qualifying covenant, relieving lessee if unreasonably withheld."
    },
    {
      "text": "\"The obligation to obtain the lessors consent was cast upon the defendant as a term of the agreement.\"",
      "speaker": "court",
      "significance": "Holds agreement not contingent on consent."
    },
    {
      "id": "kq3",
      "text": "\"those words limit or qualify the lessees covenant not to assign the demised premises without the consent in writing of the lessor.\"",
      "speaker": "court",
      "significance": "Interprets effect of lease clause."
    }
  ],
  "_case_id": "1950_41",
  "_label": 0,
  "_text_length": 20465,
  "_extracted_at": "2026-02-08T22:12:41.479225"
}