{
  "metadata": {
    "case_name": "Kapurchand v. Mst. Kaderunnissa",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "Khaliluzzaman J."
    ],
    "case_number": "Civil Appeal No. 189 of 1950",
    "date_of_judgment": "1950-10-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Kapurchand had a money decree against Mir Hamid Ali Khan, husband of respondent Mst. Kaderunnissa.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In execution of the decree, the house belonging to the deceased judgment-debtor was attached.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Widow raised objection to attachment on ground that she was in possession of the house in lieu of her outstanding dower and could not be dispossessed till claim satisfied.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Executing court allowed objection and ordered house to be sold subject to respondent's claim, decree-holder entitled to surplus if any.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Court took view that widow's dower claim had priority over debts due to other unsecured creditors, analogous to secured creditor.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Decree-holder's revision application to High Court of Hyderabad dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appeal preferred to Judicial Committee of the State, now before Supreme Court under Article 374(4) of Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Husband died leaving the house in dispute and outstanding debts including one to decree-holder; house not charged or mortgaged by him in favour of wife or creditors.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Widow in possession of house in lieu of dower claim with consent of other heirs or otherwise.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a widow in possession of her husband's estate in lieu of her claim for dower with the consent of the other heirs or otherwise is entitled to priority as against his other unsecured creditors.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Widow's claim for outstanding dower even when in possession with consent of heirs stands no better than unsecured creditors; entitled to full payment before distribution among heirs but no priority over creditors.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Quranic texts, writings of jurists; no specific Quranic text or authority gives priority over creditors"
    },
    {
      "id": "pa2",
      "text": "Muslim enjoined to discharge liabilities honestly without distinction between dower and other debts.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Surai-Nissa"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Widow has lien on husband's estate for outstanding dower; in possession after death, cannot be dispossessed till claim satisfied by heirs or unsecured creditors.",
      "supporting_facts": [
        "f3",
        "f9"
      ],
      "legal_basis": "Decisions of Hyderabad High Court and other High Courts in India"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No specific Quranic text or authority supports widow's dower having higher footing than unsecured creditor debts; Muslim must discharge all liabilities honestly without distinction.",
      "addresses_issue": "i1",
      "key_observation": "Dower is unsecured debt unless husband created charge."
    },
    {
      "id": "cr2",
      "text": "Tyabji's Muhammadan Law: Widow's lien does not give priority over other creditors; mehr as debt has priority over heirs but not affected by possession.",
      "addresses_issue": "i1",
      "key_observation": "Dower ranks pari passu with other unsecured debts."
    },
    {
      "id": "cr3",
      "text": "Quranic text in Surai-Nissa enjoins payment of dower before bequests/inheritance but silent on priority over other creditors; debts paid before legatees/heirs after funeral expenses.",
      "addresses_issue": "i1",
      "key_observation": "No priority for dower over other contractual debts."
    },
    {
      "id": "cr4",
      "text": "Dower is debt for consideration (submission of person), akin to marriage settlement, obligatory; no inherent priority over other debts.",
      "addresses_issue": "i1",
      "key_observation": "Purely contractual, no equitable priority."
    },
    {
      "id": "cr5",
      "text": "Authorities show consensus: widow's possession does not give priority over creditors; ranks pari passu; exceptions like certain Allahabad/Hyderabad cases incorrect.",
      "addresses_issue": "i1",
      "key_observation": "Correct law in Ameer Ammal v. Sankaranarayanan Chetty."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Widow's claim for dower is unsecured debt with no priority over other unsecured creditors, even if in possession; property to be sold free, proceeds distributed rateably among creditors including widow.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ameer Ammal v. Sankaranarayanan Chetty",
      "citation": "I.L.R. 25 Mad. 658",
      "treatment": "followed",
      "relevance": "Unpaid dower debt payable pari passu with other creditors, not preferential charge."
    },
    {
      "case_name": "Maina Bibi v. Chaudhri Vakil Ahmad",
      "citation": "52 I.A. 145",
      "treatment": "referred",
      "relevance": "Widow in possession entitled to retain till dower satisfied but not higher than other creditors."
    },
    {
      "case_name": "Meer Meher Ally v. Mst. Amanee",
      "citation": "11 W.R. 212",
      "treatment": "followed",
      "relevance": "Widow's lien not ordinary; dower ranks pari passu with other creditors."
    },
    {
      "case_name": "Maina Bibi v. Wasi Ahmad",
      "citation": "I.L.R. 41 All 538",
      "treatment": "followed",
      "relevance": "No right of possession against creditors; ranks equally."
    },
    {
      "case_name": "Hamira Bibi v. Zubaida Bibi",
      "citation": "A.I.R. 1916 P.C. 46",
      "treatment": "followed",
      "relevance": "Dower ranks as debt, no greater right than other unsecured creditors."
    },
    {
      "case_name": "Imtiaz Begum v. Abdul Karim Khan",
      "citation": null,
      "treatment": "followed",
      "relevance": "Same view as above."
    },
    {
      "case_name": "Kulsum Bibi v. Shiam Sunder Lal",
      "citation": "A.I.R. 1934 All. 168",
      "treatment": "distinguished",
      "relevance": "Held widow entitled against creditors; viewed as incorrect."
    },
    {
      "case_name": "Mst. Ghafooran v. Ram Chandra Das",
      "citation": "A.I.R. 1930 All 881",
      "treatment": "distinguished",
      "relevance": "Possession not disturbed till dower paid; incorrect."
    },
    {
      "case_name": "Mohamed Turabuddin v. Yasin Begum",
      "citation": "17 D.L.R. 224",
      "treatment": "distinguished",
      "relevance": "Dower as secured debt; between heirs and widow only."
    },
    {
      "case_name": "Wahidunnissa Begum v. Yasin Begum",
      "citation": "32 D.L.R. 421",
      "treatment": "followed",
      "relevance": "No charge created; widow as creditor and heir."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 374(4)"
      ],
      "relevance": "Appeal from Judicial Committee of the State"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgments of courts below set aside; executing court directed to sell property free of widow's claim and distribute proceeds rateably among decree-holders and widow.",
    "relief_granted": "Execution to proceed with sale and rateable distribution.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A widow by her lien does not have any priority over other creditors.\"",
      "speaker": "court",
      "significance": "From Tyabji's Muhammadan Law, core holding on no priority."
    },
    {
      "text": "Dower debt cannot be given any priority over other debts on any equitable consideration or on the ground that there is something inherent in its very nature which entitles it to priority.",
      "speaker": "court",
      "significance": "Rejects equitable priority for dower."
    },
    {
      "text": "The result of the authorities is that excepting the two Allahabad decisions mentioned above and a decision of the Hyderabad High Court, the consensus of authority is against the proposition that a widow as an unsecured creditor has any priority over the other unsecured creditors of her husband.",
      "speaker": "court",
      "significance": "Summarizes precedents favoring no priority."
    }
  ],
  "_case_id": "1950_30",
  "_label": 1,
  "_text_length": 13215,
  "_extracted_at": "2026-02-08T22:11:58.673824"
}