{
  "metadata": {
    "case_name": "Ramdeo Sahu (successor) v. Eldest son of Raja Pateshwari Partap Narain Singh",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "Mukherjea J."
    ],
    "case_number": "Civil Appeal No. LXX of 1949",
    "date_of_judgment": "1950-11-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Mortgage deed dated 8th March 1926 executed by Raja Pateshwari Partap Narain Singh, holder of Basti Raj (impartible estate governed by primogeniture), in favour of Bhikhiram Sahu for Rs. 5,500 at 9% interest per annum, repayable within one year, hypothecating immovable properties of the estate.",
      "type": "material",
      "date": "1926-03-08",
      "source": "plaintiff"
    },
    {
      "id": "f2",
      "text": "Mortgagor Raja Pateshwari Partap Narain Singh and mortgagee Bhikhiram Sahu both dead by time of suit; plaintiff Ramdeo Sahu (son and heir of Bhikhiram); principal defendant eldest son of mortgagor succeeding under primogeniture.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "No payments made by mortgagor or successor towards mortgage dues.",
      "type": "admitted",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f4",
      "text": "Suit filed by Ramdeo Sahu to recover Rs. 5,500 principal + 9% interest up to suit date.",
      "type": "procedural",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f5",
      "text": "Defendant's pleas: (1) Document not properly attested or validly registered, cannot operate as mortgage; (2) No consideration for Rs. 2,000 (items 3 and 4); (3) Relief under United Provinces Agriculturists Relief Act.",
      "type": "disputed",
      "date": null,
      "source": "defendant"
    },
    {
      "id": "f6",
      "text": "Trial court (Civil Judge of Basti, 6th November 1939): Held in favour of defendant on Agriculturists Relief Act, rejected other pleas; preliminary decree for Rs. 5,500 + interest per Act, payable in instalments.",
      "type": "procedural",
      "date": "1939-11-06",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Allahabad High Court (Verma and Yorke JJ., 22nd April 1943): Reversed trial court, dismissed suit holding bond not attested as required by law, and suit beyond 6 years so no money decree possible.",
      "type": "procedural",
      "date": "1943-04-22",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Harbhajan Lal (attesting witness): Signed as witness but neither he nor Jawala Prasad Tewari signed in presence of mortgagor nor mortgagor in their presence; signed at Collectorate Kutchery (Bar Library) brought by Bhikhi Ram, Ghur Lal, Jawala Prasad Patwari; mortgagor's signature already there.",
      "type": "disputed",
      "date": null,
      "source": "plaintiff_witness (hostile)"
    },
    {
      "id": "f9",
      "text": "Jawala Prasad Patwari (scribe, defendant witness): Draft prepared at Raja's sherista under instructions from Bhikhi Ram and Ghur Lal; after stamping, taken to Raja's Kot for signature; then to Collectorate Kutchery for signatures of Harbhajan Lal and Jawala Prasad Tewari; registered by Jainarayan Sukul (attorney for Raja).",
      "type": "disputed",
      "date": null,
      "source": "defendant"
    },
    {
      "id": "f10",
      "text": "Plaintiff Ramdeo Sahu: Execution and attestation at one sitting in Raja's Kot on 8th March 1926; terms settled beforehand; accompanied by Harbhajan Lal (deed writer), Buddhu Lal (servant), Jawala Prasad Tewari; Jawala Prasad Patwari already there; draft by Buddhu Lal, scribed by Patwari at Raja's wish; Raja signed in presence of Harbhajan Lal and Tewari, who then signed in Raja's presence.",
      "type": "disputed",
      "date": "1926-03-08",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Buddhu Lal (plaintiff witness): Supports plaintiff's version materially.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Signatures of executant and Harbhajan Lal in same ink.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Harbhajan Lal usually employed by plaintiff's father as scribe/witness in prior documents.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Buddhu Lal trusted servant, witness to registered receipt Ex.10 for Rs.500 payment under mortgage.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the mortgage bond was properly attested in the manner required by law.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court approached attestation question from wrong standpoint and had no justification to reverse trial court's finding on oral evidence.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8",
        "f10",
        "f11"
      ],
      "legal_basis": "Appellate court principles on reversing trial court findings of fact based on oral testimony (Watt v. Thomas)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Bond not attested properly as witnesses did not sign in presence of executant or vice versa; executed piecemeal; plaintiff's story improbable as son not father present.",
      "supporting_facts": [
        "f5",
        "f8",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Story invented after Harbhajan Lal turned hostile.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appellate court must consider advantage of trial judge in seeing witnesses; should not reverse unless evidence as whole cannot reasonably justify trial conclusion or improbabilities outweigh.",
      "addresses_issue": "i1",
      "key_observation": "High Court wrongly thought trial judge did not rely on demeanour; rule applies even if not expressly based on demeanour."
    },
    {
      "id": "cr2",
      "text": "Plaintiff's story probable: son could represent father; Harbhajan Lal and Buddhu Lal naturally present; no improbability in scribing by Patwari at Raja's wish; same ink supports signing at execution; Harbhajan Lal knew attestation requirements.",
      "addresses_issue": "i1",
      "key_observation": "High Court's reasons for rejecting plaintiff's evidence unsound; defendant's witnesses unreliable."
    },
    {
      "id": "cr3",
      "text": "Trial judge's finding on attestation consistent with circumstances; High Court reversed on inadequate grounds.",
      "addresses_issue": "i1",
      "key_observation": "Evidence as whole supports trial court's conclusion."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Mortgage bond properly attested; High Court erred in reversing trial court's finding.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Watt v. Thomas",
      "citation": "1947 A.C. 484 at p. 486",
      "treatment": "followed",
      "relevance": "Gist of appellate court approach to trial court's findings on oral evidence credibility."
    },
    {
      "case_name": "Saraveeraswami v. Talluri",
      "citation": "A.I.R. 1949 P.C. 32",
      "treatment": "followed",
      "relevance": "Adopted observations from Watt v. Thomas on appellate review."
    },
    {
      "case_name": "W.C. Macdonald v. Fred Latimer",
      "citation": "A.I.R. 1929 P.C. 15 at 18",
      "treatment": "referred",
      "relevance": "Lord Atkin's observations on trial judge's advantage in assessing verbal testimony."
    },
    {
      "case_name": "Netherlandsche Handel Maatschappij v. R.M.A.P. Chettiar Firm",
      "citation": "A.I.R. 1929 P.C. 202 at 205",
      "treatment": "referred",
      "relevance": "Trial judge's finding value not detracted if not expressly based on demeanour."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Evidence Act",
      "sections": [
        "Section 68"
      ],
      "relevance": "Proof of execution of document required by attesting witness."
    },
    {
      "name": "United Provinces Agriculturists Relief Act",
      "sections": [],
      "relevance": "Trial court granted relief thereunder; not reversed in this appeal."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment of Allahabad High Court reversed; trial court's finding on attestation upheld, implying restoration of preliminary decree.",
    "relief_granted": "Reversal of High Court dismissal on attestation ground.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the appellate court will bear in mind that it has not enjoyed this opportunity and that the view of the trial Judge as to where credibility lies is entitled to great weight.\"",
      "speaker": "court",
      "significance": "Core principle for appellate review of trial findings on oral evidence."
    },
    {
      "text": "\"The duty of the appellate court in such cases is to see whether the evidence taken as a whole can reasonably justify the conclusion which the trial court arrived at.\"",
      "speaker": "court",
      "significance": "Standard applied to uphold trial court's attestation finding."
    }
  ],
  "_case_id": "1950_33",
  "_label": 1,
  "_text_length": 21450,
  "_extracted_at": "2026-02-08T22:12:09.249134"
}