{
  "metadata": {
    "case_name": "Mohinder Singh v. State of Punjab",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "Fazl Ali J."
    ],
    "case_number": "Criminal Appeal No. 10 of 1950",
    "date_of_judgment": "1950-10-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Sometime in January 1949, Bachittar Singh, brother of Dalip Singh, lodged a complaint before the Naib Tehsildar at Zira that a tree belonging to him had been cut by 7 persons including Mohinder Singh, the appellant.",
      "type": "background",
      "date": "1949-01",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "28th February 1949 was fixed for hearing the complaint before Naib Tehsildar.",
      "type": "procedural",
      "date": "1949-02-28",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "On 28th February 1949, at mid-day near a Gurdwara while returning from field, Jita Singh (carrying fodder) and Dalip Singh (with sickles) attacked by appellant Mohinder Singh and Gurnam Singh (17-year-old lad). Mohinder Singh fired at Jita Singh from behind hitting neck, Jita fell. Dalip Singh chased by Gurnam Singh round tank boundary, Mohinder confronted and shot Dalip on chest, Dalip fell. Gurnam fired rifle at Dalip's ear from 4-5 feet while lying sideways. Dalip died on spot.",
      "type": "material",
      "date": "1949-02-28",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Same day at 3 p.m., Jita Singh lodged FIR at Dharamkot police station (3 miles from village Augar), charging Mohinder with injury to him and Mohinder & Gurnam with Dalip's murder.",
      "type": "procedural",
      "date": "1949-02-28",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Police investigated, sent charge-sheet against Mohinder Singh and Gurnam Singh.",
      "type": "procedural",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Sessions Judge Ferozepore tried under ss. 302/307/34 IPC. Appellant sentenced to death under 302, Gurnam to transportation for life (youth), both 3 years RI under 307/34.",
      "type": "procedural",
      "date": "1949-07-20",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Dalip Singh had 6 gunshot injuries detailed by post-mortem doctor: irregularly round gunshot wound left temporal (entrance, blackened 4x4 area), exit right mastoid; chest wounds (left side entrance/exit, right side); arm wounds interconnected. Two projectiles: one through brain/brainstem, one through chest with re-entrance/exit.",
      "type": "material",
      "date": "1949-02-28",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Jita Singh had 4 slight pellet injuries on back of neck, 2 abrasions below right elbow/knee from blunt weapons.",
      "type": "material",
      "date": "1949-02-28",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "At scene: empty cartridge where Jita shot, 2 empty cartridges & blood-stained cap near Dalip's body.",
      "type": "material",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Mohinder produced 12-bore gun P-16 (licensed). Sent to Dr. Goyle CID Lab: gun fired recently? unsure; cartridges P-10/P-15 could be from it/similar, no firing test/markings comparison.",
      "type": "material",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "No local witnesses despite near Gurdwara/houses. Prosecution witnesses: Jita Singh (injured), Harnam Singh (from distance, fetching medicine, prior wall dispute with Mohinder settled by panchayat), Buta Singh (tonga driver, distant relative of Harnam, visited him).",
      "type": "material",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Appellant denied firing, claimed absent from Augar, at Zira Naib Tehsildar court.",
      "type": "disputed",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Defence alibi: Naib Tehsildar - 6/7 persons appeared 28 Feb, proved taccavi loan app thumb-impressed by appellant same day, but didn't know him personally. Jogindar Singh (brother-in-law) - wrote app, appellant present, signed, appeared. Handwriting expert - thumb impression appellant's, some handwriting mismatches re service report suppression.",
      "type": "disputed",
      "date": "1949-02-28",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "High Court (Falshaw & Soni JJ) 30 Dec 1949 upheld conviction, confirmed death sentence (Criminal Appeal 325/1949).",
      "type": "procedural",
      "date": "1949-12-30",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether prosecution proved beyond doubt that injuries to Dalip Singh were caused by gun/rifle fired by appellant and Gurnam at close range as alleged, given nature of wounds and lack of expert ballistic evidence.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether appellant's plea of alibi proved to reasonable standard, given evidence of presence at Naib Tehsildar court on date of incident.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Reliability of eyewitnesses and overall prosecution case without independent witnesses or confirmatory expert evidence.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Alibi established: present at Zira court for Bachittar complaint and filed taccavi loan app on 28 Feb 1949, supported by Naib Tehsildar, brother-in-law, expert.",
      "supporting_facts": [
        "f2",
        "f12",
        "f13"
      ],
      "legal_basis": "Standard of proof same for prosecution and defence alibi (reasonable standard)"
    },
    {
      "id": "pa2",
      "text": "Injuries inconsistent with close-range firing from gun P-16: blackened entry but no shattering (per Taylor/Hatcher ballistics, suggests distant grooved barrel rifle). Dr Goyle evidence unsatisfactory, no tests.",
      "supporting_facts": [
        "f7",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Eyewitnesses partisan/chance, no locals; motive trivial.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Prosecution eyewitnesses (Jita, Harnam, Buta) reliable; identified gun by brass plate; cartridges match possible; prior enmity from tree dispute.",
      "supporting_facts": [
        "f3",
        "f4",
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "ss. 302/307/34 IPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Prosecution must prove by expert evidence possibility of injuries caused by alleged weapon/manner at close range; gap here as wounds puzzling (through-and-through without shattering, gun vs rifle doubt), Dr Goyle unsatisfactory, no tests.",
      "addresses_issue": "i1",
      "key_observation": "Definite case must prove whole case; likely rifle not gun, two shots by two persons unproven."
    },
    {
      "id": "cr2",
      "text": "Oral evidence of 3 witnesses (2 chance, 1 partisan; Jita shot from behind unlikely saw all) unchecked by expert evidence; rests wholly on unreliable testimony.",
      "addresses_issue": "i3",
      "key_observation": "Serious to convict without confirmation on material part."
    },
    {
      "id": "cr3",
      "text": "Alibi not disproved to reasonable standard: summons date, taccavi app thumb-marked/dealt same day, witness testimony probable; prosecution service evidence suspicious (process peon forgetful, possible suppression, won-over allegations unsubstantiated).",
      "addresses_issue": "i2",
      "key_observation": "Standard same as prosecution evidence."
    },
    {
      "id": "cr4",
      "text": "High Court noted difficulties with wounds/gun but ignored gap.",
      "addresses_issue": "i1",
      "key_observation": "Prosecution case only partly proved."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Prosecution evidence falls short of proof on material part (injuries causation by alleged firearms/close range); grave injustice in conviction.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Plea of alibi not rejected properly; substantial injustice done.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pritam Singh v. The State",
      "citation": "1950 S.C.R. 463",
      "treatment": "referred",
      "relevance": "SC entertains criminal appeal only in exceptional cases of substantial grave injustice by disregard of legal process/natural justice."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "307",
        "34"
      ],
      "relevance": "Charges for murder/attempt to murder with common intention; conviction under these upheld below but set aside on appeal."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "342"
      ],
      "relevance": "Appellant examined under s.342; summoning documents/proceedings."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal by special leave allowed; conviction and death sentence set aside due to failure to prove by expert evidence possibility of alleged injuries from firearms at close range, puzzling wound nature, and improper rejection of alibi plea, amounting to substantial grave injustice.",
    "relief_granted": "Acquittal from charges under ss. 302/307/34 IPC",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"in a case where death is due to injuries or wounds caused by a lethal weapon, it has always been considered to be the duty of the prosecution to prove by expert evidence that it was likely or at least possible for the injuries to have been caused with the weapon with which and in the manner in which they are alleged to have been caused.\"",
      "speaker": "court",
      "significance": "Core holding on prosecution duty for expert evidence in firearm injury cases."
    },
    {
      "text": "\"the standard of proof which is required in regard to that plea [alibi] must be the same as the standard which is applied to the prosecution evidence and in both cases it should be a reasonable standard.\"",
      "speaker": "court",
      "significance": "Principle for evaluating alibi evidence."
    },
    {
      "text": "\"This Court...will not entertain a criminal appeal except in special and exceptional cases where it is manifest that...substantial and grave injustice has been done.\"",
      "speaker": "court",
      "significance": "Ground for interfering in appeal, citing Pritam Singh."
    }
  ],
  "_case_id": "1950_28",
  "_label": 1,
  "_text_length": 21341,
  "_extracted_at": "2026-02-08T22:12:06.735863"
}