{
  "metadata": {
    "case_name": "Petitioners v. State",
    "case_year": 1950,
    "court": "Supreme Court of India",
    "judges": [
      "KANIA C.J."
    ],
    "case_number": "Criminal Miscellaneous Petitions Nos. 71 to 73 of 1950",
    "date_of_judgment": "1950-12-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "All the accused were charged with being members of the Communist Party wedded to the policy of overthrowing the existing Government at Hyderabad by violence and establishing in its place a communist regime.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "They demanded subscriptions towards their communist organization and some of the villagers who did not meet their demands were abducted on the 21st of September, 1948, and murdered.",
      "type": "material",
      "date": "1948-09-21",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "They were charged with various offences including murder before a special tribunal established under the regulations promulgated by the Military Governor under the authority of H.E.H. the Nizam.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Convicted and sentenced to death on the 9th, 13th and 14th of August, 1949, by separate judgments of the Special Tribunal.",
      "type": "procedural",
      "date": "1949-08-09",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Petitioners appealed from those judgments to the Hyderabad High Court and the High Court by its judgments dated the 12th, 13th and 14th December, 1949, respectively, dismissed the appeals.",
      "type": "procedural",
      "date": "1949-12-12",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Petitioners applied to the High Court for a certificate to appeal to the Judicial Committee of the Hyderabad State on the 21st of January, 1950.",
      "type": "procedural",
      "date": "1950-01-21",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "H.E.H. the Nizam issued a firman on the 23rd of November, 1949, stating that the proposed Constitution of India was suitable for the government of Hyderabad and he accepted it as the Constitution of the Hyderabad State as one of the States of Part B in the First Schedule.",
      "type": "background",
      "date": "1949-11-23",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On the 26th of January, 1950, the Constitution of India became applicable to the Union of India and the Part B States.",
      "type": "background",
      "date": "1950-01-26",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The petitions originally filed for a certificate for leave to appeal to the Judicial Committee of the Privy Council of the Hyderabad State were, by leave of the Court, amended, and made into petitions under article 134 of the Constitution of India.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "A Division Bench of the High Court at Hyderabad considered the petitions and dismissed them on the ground that no such petitions lay under article 134 and they also declared that on the merits no case was made out for a certificate as asked by the petitioners.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether any application under article 136, under the circumstances of the case, can be made to the Supreme Court",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether on a consideration of the facts, if it has jurisdiction to entertain the petitions, the Court should grant special leave",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "On the 25th January, 1950, they had a right to move the High Court at Hyderabad for a certificate granting them leave to appeal to the Privy Council of the Hyderabad State. In fact such petitions were pending on that day. A right to appeal which existed on the 25th of January, 1950, cannot be impliedly taken away by the Constitution of India being made applicable to the State of Hyderabad.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "Article 136 of the Constitution of India"
    },
    {
      "id": "pa2",
      "text": "In respect of convictions all persons who had rights of appeal, or who had time to file their applications for a certificate, as also persons whose petitions were pending before the Hyderabad High Court asking for such certificates and which had not been disposed of because of the congestion of work in the High Court would lose their right to appeal to the higher court if article 136 is not construed so as to give a right of appeal to the Supreme Court of India.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Articles of the Constitution have to be construed according to their plain natural meaning and cases of hardship should not be brought to bear on the natural construction. Hard cases should not be permitted to make bad law.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "A narrow construction will take away the valuable rights of appeal which had existed in persons in the position of petitioners when the Constitution of India was directed by H.E.H. the Nizam by his firman to be applicable to the Hyderabad State on the 26th of January, 1950, it should be held that as no substantive right was provided in the Constitution separately, the words of article 136 were wide enough to give such right to the petitioners.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Article 136"
    },
    {
      "id": "pa5",
      "text": "The interpretation sought to be put by the State on article 136 will require the insertion of the word 'hereafter' in the clause, for which there was no justification.",
      "supporting_facts": [],
      "legal_basis": "Article 136"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "If a wide construction is given to article 136 it will not only permit persons who are stated to be under such hardship to apply for leave under article 136 but several other rights will be created. Such rights will arise not only in criminal cases but in civil cases also and they can be exercised without any limitation as to the period within which the application has to be made, with the result that old judgments may also be called into question.",
      "supporting_facts": [],
      "legal_basis": "Article 136"
    },
    {
      "id": "ra2",
      "text": "On the wider construction of article 136, judgments which had become final in those States in which there existed no court like the Privy Council to whom appeals could lie from the judgments of their High Courts, will be subject to appeal though no such appeal lay before.",
      "supporting_facts": [],
      "legal_basis": "Article 136"
    },
    {
      "id": "ra3",
      "text": "Every legislation is primarily prospective and not retrospective. A right of appeal has to be given specifically by a statute and it is not merely a procedural right. If therefore there exists no right of appeal under the Constitution such right cannot be inferentially held to come into being on the application of the Constitution to the Hyderabad State.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Delhi Cloth and General Mills Ltd. v. Income Tax Commissioner, Delhi Another (54 I.A. 421); The Colonial Sugar Refining Co. Ltd. v. Irving (1905 A.C. 369)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under article 374(4) on and from the commencement of this Constitution the jurisdiction of the authority functioning as the Privy Council in a State specified in Part B of the First Schedule to entertain and dispose of appeals and petitions from or in respect of any judgment, decree or order of any court within that State ceased, and all appeals and other proceedings pending before the said authority at such commencement stand transferred to and have to be disposed of by the Supreme Court.",
      "addresses_issue": "i1",
      "key_observation": "This sub-clause thus abolishes the jurisdiction of the Privy Council of the Hyderabad State and after the Constitution of India came into force that body and its jurisdiction altogether ceased. On the facts before us, it is clear that as no proceeding or appeal in respect of these judgments of the Hyderabad High Court was pending before the Hyderabad Privy Council before its abolition, nothing got transferred to the Supreme Court by operation of this sub-clause."
    },
    {
      "id": "cr2",
      "text": "The question of hardship cannot be and should not be allowed to affect the true meaning of the words used in the Constitution. It is therefore proper to approach the articles irrespective of considerations of hardship.",
      "addresses_issue": "i1",
      "key_observation": "Articles of the Constitution have to be construed according to their plain natural meaning and cases of hardship should not be brought to bear on the natural construction."
    },
    {
      "id": "cr3",
      "text": "Article 136(1): Notwithstanding anything in this Chapter, the Supreme Court may, in its discretion, grant special leave to appeal from any judgment, decree, determination, sentence or order in any cause or matter passed or made by any Court or tribunal in the territory of India.",
      "addresses_issue": "i1",
      "key_observation": "The important fact to be borne in mind is that the Hyderabad courts were not courts within the territory of India when they pronounced their judgments on the 12th, 13th and 14th of December, 1949."
    },
    {
      "id": "cr4",
      "text": "The territory of India shall comprise (a) the territories of the States meaning the States mentioned in Parts A, B and C of the First Schedule, (b) the territories specified in Part D of the First Schedule, viz., The Andaman and Nicobar Islands and (c) such other territories as may be acquired.",
      "addresses_issue": "i1",
      "key_observation": "The territory of the Government of H.E.H. the Nizam was never the territory of India before the 26th of January, 1950, and therefore the judgment and sentence passed by the High Court of H.E.H. the Nizam on the 12th, 13th and 14th December, 1949, cannot be considered as judgments and sentence passed by a court within the territory of India."
    },
    {
      "id": "cr5",
      "text": "Prima facie, every legislation is prospective and even without the use of the word 'hereafter' the language of article 136 conveys the same meaning.",
      "addresses_issue": "i1",
      "key_observation": "There appears no reason why in the present case the normal mode of interpreting a legislation as prospective only should be departed from."
    },
    {
      "id": "cr6",
      "text": "Before the 26th January, 1950, the Government of H.E.H. the Nizam was an independent State in the sense that no court in India or the Judicial Committee of the Privy Council in London had any jurisdiction over the decisions of the Hyderabad State Courts. To give the Supreme Court of India jurisdiction over the decisions of courts of such a state, one requires specific provisions or provisions which necessarily confer jurisdiction to deal, on appeal, with the decisions of such courts.",
      "addresses_issue": "i1",
      "key_observation": "There is no express provision of that kind. There appear to us also no such necessary circumstances which on reasonable construction should be treated as impliedly giving such right of appeal. Indeed the words 'territory of India' lead to a contrary conclusion."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "As the judgments were pronounced and sentences passed in all these matters before us by the High Court of Hyderabad, which was in the territory of H.E.H. the Nizam and which territory was not the territory of India before the 26th of January, 1950, and as those judgments were passed before the Constitution came into force they do not fall within the class of judgments against which special leave to appeal to the Supreme Court can be asked for under article 136.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Delhi Cloth and General Mills Ltd. v. Income Tax Commissioner, Delhi Another",
      "citation": "54 I.A. 421",
      "treatment": "followed",
      "relevance": "Every legislation is primarily prospective and not retrospective. A right of appeal has to be given specifically by a statute and it is not merely a procedural right."
    },
    {
      "case_name": "The Colonial Sugar Refining Co. Ltd. v. Irving",
      "citation": "1905 A.C. 369",
      "treatment": "followed",
      "relevance": "Every legislation is primarily prospective and not retrospective. A right of appeal has to be given specifically by a statute and it is not merely a procedural right."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 136",
        "Article 374(4)",
        "Article 133",
        "Article 134",
        "Article 135",
        "Article 1"
      ],
      "relevance": "Determines jurisdiction of Supreme Court to grant special leave to appeal from judgments of Hyderabad High Court passed before 26 January 1950; Hyderabad not in territory of India at that time."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The petitions for special leave to appeal under Article 136 were dismissed on the ground that the Supreme Court lacked jurisdiction as the judgments of the Hyderabad High Court were passed by a court not within the territory of India before the Constitution came into force on 26 January 1950.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The territory of the Government of H.E.H. the Nizam was never the territory of India before the 26th of January, 1950, and therefore the judgment and sentence passed by the High Court of H.E.H. the Nizam on the 12th, 13th and 14th December, 1949, cannot be considered as judgments and sentence passed by a court within the territory of India.",
      "speaker": "court",
      "significance": "Core holding on lack of jurisdiction under Article 136."
    },
    {
      "text": "Prima facie, every legislation is prospective and even without the use of the word 'hereafter' the language of article 136 conveys the same meaning.",
      "speaker": "court",
      "significance": "Rejects retrospective application of Article 136."
    },
    {
      "text": "The question of hardship cannot be and should not be allowed to affect the true meaning of the words used in the Constitution.",
      "speaker": "court",
      "significance": "Dismisses arguments based on hardship in constitutional interpretation."
    }
  ],
  "_case_id": "1950_56",
  "_label": 0,
  "_text_length": 15563,
  "_extracted_at": "2026-02-08T22:12:36.855251"
}