{
  "metadata": {
    "case_name": "Logendranath Jha & Ors. v. Polai Lal Biswas",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Patanjali Sastri, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On 29th November 1949 at about 10 a.m., complainant Polai Lal Biswas was harvesting paddy crop on his field when a mob of about fifty persons armed with ballams, lathis and other weapons arrived.",
      "type": "material",
      "date": "1949-11-29",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "First appellant Logendranath Jha led the mob and demanded settlement of all outstanding disputes with complainant, stating he would not allow paddy to be removed unless settled.",
      "type": "material",
      "date": "1949-11-29",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Altercation followed, Logendranath ordered assault; Logendranath and Harihar gave ballam blows to labourer Kangali who fell down and died on the spot.",
      "type": "material",
      "date": "1949-11-29",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Polai Lal Biswas lodged complaint; police investigated and submitted charge-sheet under sections 147, 148, 323, 324, 326, 302 and 302/149 IPC.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Committing Magistrate found prima facie case and committed appellants to Sessions Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellants pleaded not guilty; alleged Mohender and Debender (appellants 2 and 3, brothers of Logendranath) not present in village Dandkhora as lands allotted to Logendranath at previous partition; Logendranath arrived soon after occurrence and was dragged to place by enemies and arrested by ASI.",
      "type": "disputed",
      "date": "1949-11-29",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Two factions in village: one led by Harimohan (relation of complainant), other by Logendranath; long-standing enmity with numerous revenue and criminal proceedings; false case foisted.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Sessions Judge found factions true but alibi not made out; disbelieved prosecution story as Polai (19, unmarried, living with grandmother Parasmani who brought him up) unlikely to take land on batai from grandmother or uncles for cultivation given expenses; disbelieved harvesting story.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Sessions Judge found discrepancies and contradictions in prosecution evidence indicating concealment of real facts; impossible to apportion liability or decide who commenced fight or acted in self-defence; acquitted appellants of all charges.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Complainant Polai filed revision petition under s.439 CrPC to High Court of Patna.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "High Court reviewed evidence, found Sessions Judge's acquittal perverse, lacking true perspective; misdirected on minor discrepancies, no justifiable ground to reject prosecution evidence on cultivation; set aside acquittal and directed retrial with warning not to be influenced by its opinion.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether revision petition under s.439 CrPC against acquittal is maintainable by private party when s.417 provides appeal only by Government.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether High Court in revision under s.439(4) CrPC can re-appraise evidence, reverse findings of fact, characterise trial court judgment as perverse and order retrial against acquittal by private party.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Revision under s.439 CrPC by private party against acquittal incompetent as s.417 allows appeal only by Government.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Sections 417, 439 CrPC"
    },
    {
      "id": "pa2",
      "text": "High Court exceeded powers under s.439(4) CrPC by upsetting findings of fact of trial Judge.",
      "supporting_facts": [
        "f8",
        "f9",
        "f11"
      ],
      "legal_basis": "Section 439(4) CrPC"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Unnecessary to decide first contention; second contention prevails as High Court re-appraised evidence, disagreed with Sessions Judge's findings of fact calling them perverse and lacking perspective, indicated discrepancies afforded no justifiable ground to discredit prosecution.",
      "addresses_issue": "i2",
      "key_observation": "High Court did not properly appreciate scope of inquiry in revision against acquittal."
    },
    {
      "id": "cr2",
      "text": "S.439(1) allows powers of appeal under s.423 but s.439(4) excludes power to convert acquittal into conviction; High Court cannot re-appraise evidence and reverse findings of fact merely by characterising as perverse.",
      "addresses_issue": "i2",
      "key_observation": "High Court loaded dice against appellants by strong views on credibility despite formal retrial order."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In revision by private party against acquittal, High Court cannot reverse pure findings of fact based on trial court's appreciation of evidence by merely calling judgment perverse.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "147",
        "148",
        "323",
        "324",
        "326",
        "302",
        "302/149"
      ],
      "relevance": "Offences charged against appellants"
    },
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "417",
        "439",
        "439(1)",
        "439(4)",
        "423"
      ],
      "relevance": "Governs appeal and revision against acquittal; limits High Court's powers in revision to not convert acquittal to conviction or reverse fact findings"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by special leave, holding that High Court exceeded its revisional powers under s.439(4) CrPC by re-appraising evidence and reversing factual findings in private party's revision against acquittal; set aside High Court's order setting aside acquittal and directing retrial.",
    "relief_granted": "Acquittal by Sessions Judge restored implicitly by setting aside High Court order",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Prosecution must stand on its own legs and must prove the story told by it at the very first stage.",
      "speaker": "court",
      "significance": "Sessions Judge's principle adopted in reasoning"
    },
    {
      "text": "By merely characterising the judgment of the trial Court as perverse and lacking in perspective, the High Court cannot reverse pure findings of fact based on the trial Courts appreciation of the evidence in the case.",
      "speaker": "court",
      "significance": "Core holding on limits of revisional jurisdiction"
    },
    {
      "text": "But there can be little doubt that he loaded the dice against the appellants.",
      "speaker": "court",
      "significance": "Critique of High Court's strong observations prejudicing retrial"
    }
  ],
  "_case_id": "1951_69",
  "_label": 1,
  "_text_length": 9942,
  "_extracted_at": "2026-02-08T22:16:14.478487"
}