{
  "metadata": {
    "case_name": "Angurbala Mullick v. Debabrata Mullick",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "Mukherjea J.",
      "Chandrasekhara Aiyar J."
    ],
    "case_number": "Civil Appeal from Calcutta High Court appellate judgment dated 19th May 1950 in Suit No. 2481 of 1947",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dhananjoy Mullick, adoptive father of Mrityunjoy, died on 28th August 1907, leaving widow Nitto Sundari and minor adopted son Mrityunjoy.",
      "type": "background",
      "date": "1907-08-28",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 11th February 1910, Nitto Sundari obtained letters of administration to Dhananjoy's estate limited during Mrityunjoy's minority.",
      "type": "background",
      "date": "1910-02-11",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 13th June 1920, Nitto Sundari purchased premises No. 14, Syakrapara Lane, Calcutta, from estate funds.",
      "type": "background",
      "date": "1920-06-13",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 10th October 1934, Nitto Sundari conveyed premises No. 14, Syakrapara Lane, to Mrityunjoy who had attained majority.",
      "type": "background",
      "date": "1934-10-10",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On 10th October 1934, Nitto Sundari and Mrityunjoy executed indenture dedicating properties in Schedules A and B, including No. 14 Syakrapara Lane, to deity Nitto Gopal Jew; recited establishment and consecration by Nitto Sundari with Mrityunjoy's consent; detailed rites, ceremonies, festivals, expenses from income; 25% net income remuneration to shebait(s).",
      "type": "material",
      "date": "1934-10-10",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Indenture provided: Nitto Sundari shebait for life; after her, Mrityunjoy; after him, wife Sm. Kiranbala Dassi; after her, heirs of Mrityunjoy as shebaits. Proviso: If Mrityunjoy dies without issue or without authority to wife surviving to adopt, he may appoint shebait by will etc. to act after wife's death; if dies without issue, shebaitship after wife's death devolves on his heirs under Hindu Law.",
      "type": "material",
      "date": "1934-10-10",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Nitto Sundari died in 1938; Mrityunjoy became shebait.",
      "type": "admitted",
      "date": "1938",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Kiranbala, first wife of Mrityunjoy, died on 14th January 1942, leaving infant son Debabrata (defendant).",
      "type": "material",
      "date": "1942-01-14",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Soon after Kiranbala's death, Mrityunjoy married plaintiff Angurbala as second wife.",
      "type": "background",
      "date": "1942-01-14 after",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Mrityunjoy died on 4th July 1942, within five months of marriage to Angurbala.",
      "type": "material",
      "date": "1942-07-04",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Plaintiff Angurbala filed suit on 29th August 1947 in Original Side Calcutta High Court for declaration of sole or joint shebaitship with defendant under indenture or Hindu Women's Rights to Property Act, and right of residence in No. 14 Syakrapara Lane.",
      "type": "procedural",
      "date": "1947-08-29",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Defendant's written statement denied plaintiff's shebait rights solely or jointly, claimed sole shebaitship under deed and law; denied residence right.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "No evidence adduced; case argued on construction of indenture and Hindu Women's Rights to Property Act 1937 as amended 1938.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Trial Judge (single Judge Original Side) on 9th February 1949: Plaintiff not sole or joint shebait; Act inapplicable to shebait rights; not natural guardian so cannot act for minor defendant; residence right granted; other prayers dismissed.",
      "type": "procedural",
      "date": "1949-02-09",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Plaintiff appealed to Division Bench Calcutta High Court (Harries C.J., Sinha J.); only joint shebaitship pressed; rejected relying on Umayal Achi v. Lakshmi Achi 1945 FCR 1; appeal dismissed 19th May 1950.",
      "type": "procedural",
      "date": "1950-05-19",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Certificate under Article 133(1)(c) Constitution obtained; appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether plaintiff entitled to sole or joint shebaitship of Nitto Gopal Jew after Mrityunjoy's death under indenture of 10th October 1934.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Hindu Women's Rights to Property Act 1937 applies to devolution of shebaitship, entitling widow as heir jointly with son.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Construction of indenture clause on devolution of shebaitship: meaning of 'heirs of Mrityunjoy'; effect of proviso; priority of issue over other heirs.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under indenture, after Kiranbala (who predeceased Mrityunjoy), shebaitship vests in heirs of Mrityunjoy; heirs determined by law at succession opening; under Hindu Women's Rights to Property Act 1937, widow ranks as heir with son to same share; shebaitship is property, devolves jointly on widow and son.",
      "supporting_facts": [
        "f6",
        "f8",
        "f10"
      ],
      "legal_basis": "Hindu Women's Rights to Property Act, s.3"
    },
    {
      "id": "pa2",
      "text": "Even if 'property' in Act excludes shebaitship, succession to shebaitship governed by ordinary Hindu inheritance rules, amended by Act to include widow equally with son.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Hindu law succession to shebaitship"
    },
    {
      "id": "pa3",
      "text": "Language of indenture suggests wife of Mrityunjoy has priority over other heirs; 'Kiranbala' descriptive of 'wife'; surviving wife at death succeeds.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": "Construction of indenture"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Hindu Women's Rights to Property Act does not apply to shebaitship; Act's 'property' not wide enough for special anomalous property like shebaitship; ss.3(3),5, preamble indicate ordinary secular property; relies on Umayal Achi v. Lakshmi Achi.",
      "supporting_facts": [],
      "legal_basis": "Hindu Women's Rights to Property Act ss.3,5; Umayal Achi v. Lakshmi Achi 1945 FCR 1"
    },
    {
      "id": "ra2",
      "text": "Indenture intends issue of Mrityunjoy to succeed first; 'heirs' means issue; proviso shows only on failure of issue do other heirs come; words 'heirs' are of direct gift, fixed at deed date, not affected by later law change.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Construction of indenture"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Shebaitship is property blending office and beneficial interest (25% net income); devolves per Hindu inheritance unless founder directs otherwise.",
      "addresses_issue": "i2",
      "key_observation": "Proprietary element in shebaitship admitted in Hindu law."
    },
    {
      "id": "cr2",
      "text": "Hindu Women's Rights to Property Act s.3(1) 'any property' includes shebaitship; preamble, s.3(3), s.5 do not limit to secular property; widow takes limited estate but same applies to shebaitship under ordinary law.",
      "addresses_issue": "i2",
      "key_observation": "Act amends general succession law applicable to shebaitship."
    },
    {
      "id": "cr3",
      "text": "Distinguishes Umayal Achi: trusts there lacked beneficial interest; shebaitship has personal beneficial interest.",
      "addresses_issue": "i2",
      "key_observation": "Act applies where beneficial enjoyment present."
    },
    {
      "id": "cr4",
      "text": "Indenture: main clause - shebaitship to heirs of Mrityunjoy after Kiranbala; 'heirs' means all under law at succession; proviso exceptional power to appoint if no issue and no adoption authority; contingency not arisen as son exists.",
      "addresses_issue": "i3",
      "key_observation": "'Heirs' not limited to issue; not words of gift."
    },
    {
      "id": "cr5",
      "text": "Chandrasekhara Aiyar J.: Agrees with conclusion; s.3(3) 'Hindu woman's estate' arguably inapplicable to shebaitship (no difference male/female); but does not outweigh broad construction; deed: proviso explains 'heirs' as issue first, then appointee, then other heirs - but concurs appeal succeeds.",
      "addresses_issue": "i2",
      "key_observation": "No bar to woman shebait; broad deed construction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Hindu Women's Rights to Property Act 1937 applies to succession to shebaitship as it is heritable property.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Under indenture, after Mrityunjoy (Kiranbala predeceased), shebaitship devolves on his heirs under law at death; plaintiff widow and defendant son are joint shebaits.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "'Heirs' in indenture means all heirs under Hindu law at succession, not limited to issue or fixed at deed date.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Vidya Varuti v. Balusami",
      "citation": "48 I.A. 302",
      "treatment": "followed",
      "relevance": "Shebait not trustee like English law; manager with beneficial interest; shebaitship blends office and property."
    },
    {
      "case_name": "Manohar Mukherji v. Bhupendra Nath Mukherji",
      "citation": "I.L.R. 60 Cal. 452",
      "treatment": "followed",
      "relevance": "Full Bench on proprietary element in shebaitship."
    },
    {
      "case_name": "Ganesh Chunder Dhur v. Lal Behary",
      "citation": "63 I.A. 448",
      "treatment": "followed",
      "relevance": "Approved Calcutta Full Bench; proprietary in shebaiti."
    },
    {
      "case_name": "Bhabatarini v. Ashalata",
      "citation": "70 I.A. 57",
      "treatment": "followed",
      "relevance": "Emphasized proprietary element in shebaiti anomaly accepted in Hindu law."
    },
    {
      "case_name": "Gossamee Sree Greedharreejee v. Rumanlolljee Gossamee",
      "citation": "16 I.A. 137",
      "treatment": "followed",
      "relevance": "Shebaitship vests in founder's heirs unless otherwise disposed."
    },
    {
      "case_name": "Anuragi Kuer v. Paramanand",
      "citation": "A.I.R. 1939 Pat. 1",
      "treatment": "followed",
      "relevance": "Widow succeeding to shebaitship: limited estate, reverts to last male's heirs."
    },
    {
      "case_name": "Umayal Achi v. Lakshmi Achi",
      "citation": "1945 F.C.R. 1",
      "treatment": "distinguished",
      "relevance": "Act not apply to mere trusteeship without beneficial interest; unlike shebaitship."
    },
    {
      "case_name": "P. Suryanarayanacharyulu v. P. Seshamma",
      "citation": null,
      "treatment": "followed",
      "relevance": "Madras HC: Umayal Achi not apply to archakatvam (beneficial religious office)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hindu Women's Rights to Property Act, 1937 (Act XVIII of 1937, amended by Act XI of 1938)",
      "sections": [
        "s.2",
        "s.3(1)",
        "s.3(3)",
        "s.4",
        "s.5"
      ],
      "relevance": "Amends Hindu succession: widow entitled to same share as son in intestate property including shebaitship; limited to Hindu woman's estate; applies where no effective will."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgments of trial court (9 Feb 1949) and High Court (19 May 1950) set aside except declaration of plaintiff's right of residence in No. 14 Syakrapara Lane; declared plaintiff entitled to joint shebaitship with defendant in debuttar of 10 Oct 1934 indenture.",
    "relief_granted": "Declaration of joint shebaitship; right of residence upheld.",
    "costs": "Taxed costs of both parties in all courts paid out of debuttar estate."
  },
  "key_quotes": [
    {
      "text": "It is the presence of this personal or beneficial interest in the endowed property which invests shebaitship with the character of proprietary rights and attaches to it the legal incidents of property.",
      "speaker": "court",
      "significance": "Defines shebaitship as property subject to succession laws."
    },
    {
      "text": "there is nothing in any of the provisions of the Hindu Womens Rights Property Act which excludes from the scope of operation of the Act succession to shebaitship is a recognized form of property in Hindu Law.",
      "speaker": "court",
      "significance": "Holds Act applies to shebaitship."
    },
    {
      "text": "The result, therefore, is that, in our opinion, the appeal succeeds.",
      "speaker": "court",
      "significance": "Final holding in favor of appellant."
    }
  ],
  "_case_id": "1951_65",
  "_label": 1,
  "_text_length": 44465,
  "_extracted_at": "2026-02-10T19:19:52.189169"
}