{
  "metadata": {
    "case_name": "Collector of Bombay v. Municipal Corporation of the City of Bombay",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "Kania CJ.",
      "Das J.",
      "Bose JJ.",
      "Patanjali Sastri J.",
      "Chandrasekhara Aiyar J."
    ],
    "case_number": "Civil Appeal No. 44 of 1950",
    "date_of_judgment": "1951-10-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In 1865, Government of Bombay decided to construct Eastern Boulevard and called upon Corporation of Justices of the Peace for the City of Bombay (predecessor of respondent Corporation) to remove existing fish and vegetable markets from the site.",
      "type": "background",
      "date": "1865",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Municipal Commissioner Arthur Crawford applied for site set aside for exhibition buildings on Esplanades to construct new markets.",
      "type": "background",
      "date": "1865",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On December 5, 1865, Architectural Improvement Committee informed Government no objection to site measuring about 7 acres being rented to Municipal Commissioner at annual charge of one pie per square yard.",
      "type": "material",
      "date": "1865-12-05",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On December 19, 1865, Government passed resolution approving site grant, no rent to be charged as markets for benefit of whole community; possession made over but no formal grant executed as required by Statute 22-23 Vic. C. 41.",
      "type": "material",
      "date": "1865-12-19",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Municipal Commissioner had site filled up and leveled at Corporation's expense; plans approved by Government; market buildings erected by Corporation at considerable expense.",
      "type": "material",
      "date": "1865",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondent Corporation incorporated in 1888 as successor; continued in possession without paying rent per 1865 Resolution.",
      "type": "background",
      "date": "1888",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Corporation and predecessor spent considerable sums, total Rs. 17,65,980-12-1 up to March 31, 1940, in filling, leveling, erecting and maintaining market; besides giving up old market sites.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "In 1911, portion of market site acquired for Palton Road widening; Collector/Superintendent City Survey stated Government had no claim; Corporation received full compensation and continued possession without rent.",
      "type": "material",
      "date": "1911",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On March 18, 1938, appellant Collector informed Municipal Commissioner of proposal to assess Crawford Market land under section 8 Bombay City Land Revenue Act II of 1876.",
      "type": "procedural",
      "date": "1938-03-18",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Municipal Commissioner replied site given as gift, no assessment applicable.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "On March 23, 1939, Mayor wrote to Government: intention permanent grant free from rent and land revenue; word 'rent' referred to land revenue; possession over 70 years without interruption or suggestion of revision.",
      "type": "material",
      "date": "1939-03-23",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Government replied January 1, 1940: right to levy assessment is prerogative, non-user does not destroy it; conditions changed, Municipality recovers rents from stalls.",
      "type": "disputed",
      "date": "1940-01-01",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "On January 31, 1940, Collector assessed land with 50-year guarantee: Rs. 7,500 first 10 years from April 1, 1940; Rs. 15,000 next 10; Rs. 30,000 remaining 30; first payment due April 1, 1941.",
      "type": "procedural",
      "date": "1940-01-31",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Suit filed by respondents (Municipal Corporation and Commissioner) in Revenue Judge Court seeking declaration of right to hold land forever without assessment, assessment ultra vires.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Revenue Judge dismissed suit with costs on October 27, 1942.",
      "type": "procedural",
      "date": "1942-10-27",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "High Court (Sen and Dixit JJ.) allowed appeal on February 21, 1947, declared rights, costs in both courts.",
      "type": "procedural",
      "date": "1947-02-21",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether respondent Corporation established a right in limitation of Government's right to assess under section 8 Bombay City Land Revenue Act II of 1876, in consequence of specific limit to assessment (nil) established and preserved.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether equity from Ramsden v. Dyson applies to limit Government's prerogative right to assess despite invalid grant due to non-compliance with statutory formalities.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether adverse possession for over 70 years perfected title free from rent/assessment for market purpose.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Government Resolution of 1865 invalid as grant or contract due to non-compliance with Statute 22-23 Vic. C. 41; no legal title or enforceable right passed to Corporation.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Statute 22-23 Vic. C. 41; 21-22 Vic. C. 106"
    },
    {
      "id": "pa2",
      "text": "Crown's prerogative right to levy assessment not lost by non-user; ordinary presumption of grant does not apply; conditions changed, Corporation profits from stalls.",
      "supporting_facts": [
        "f7",
        "f12"
      ],
      "legal_basis": "Prerogative right"
    },
    {
      "id": "pa3",
      "text": "No equity under Ramsden v. Dyson or estoppel; part performance doctrine cannot override statutory formalities per Privy Council in Ariff v. Jadunath.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Ramsden v. Dyson distinguished; Ariff v. Jadunath (1931 LR 58 IA 91)"
    },
    {
      "id": "pa4",
      "text": "Adverse possession perfects title to land but not exemption from prerogative right to assess, which is collateral.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Limitation Act s.28; Goswamini Shri Kamalavahooji v. Collector of Bombay"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Government Resolution 1865 created expectation of permanent rent-free grant; Corporation expended considerable sums on faith thereof; equity under Ramsden v. Dyson limits assessment right.",
      "supporting_facts": [
        "f4",
        "f5",
        "f7"
      ],
      "legal_basis": "Ramsden v. Dyson (1866 LR 1 HL 129); Municipal Corporation v. Secretary of State (1905 ILR 29 Bom 580)"
    },
    {
      "id": "ra2",
      "text": "Possession over 70 years under invalid grant perfected title to hold land perpetuity free from rent/assessment for market purpose via adverse possession.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "Adverse possession"
    },
    {
      "id": "ra3",
      "text": "'Rent' in Resolution includes land revenue; specific limit to assessment is nil per s.8 Bombay Act.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Bombay City Land Revenue Act II 1876 s.8; Kamalavahooji Maharaj v. Collector of Bombay (1937 39 Bom LR 1046)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Resolution invalid grant/contract due to statutory non-compliance; but possession under it adverse from inception; over 70 years perfected limited title to hold perpetuity free rent for market, limiting assessment to nil under s.8.",
      "addresses_issue": "i1",
      "key_observation": "Immunity from rent integral to title acquired by adverse possession."
    },
    {
      "id": "cr2",
      "text": "No need to decide equity scope; dispose on adverse possession ground; 'rent' synonymous with land revenue.",
      "addresses_issue": "i3",
      "key_observation": "Point not raised below on rent vs revenue distinction."
    },
    {
      "id": "cr3",
      "text": "No application of Ramsden v. Dyson equity or part performance against statutory formalities per Privy Council; no estoppel; adverse possession does not extinguish prerogative assessment right.",
      "addresses_issue": "i2",
      "key_observation": "Exemption collateral to title; lost grant presumption unavailable for prerogative."
    },
    {
      "id": "cr4",
      "text": "'Rent' means assessment; equity/estoppel prevents Government resiling from representation; title acquired by limitation.",
      "addresses_issue": "i1",
      "key_observation": "Courts promote honesty; Ariff not applicable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Respondent Corporation acquired by adverse possession right to hold land perpetuity free of rent/assessment for market purpose, constituting specific limit (nil) under s.8 Bombay City Land Revenue Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Assessment declared invalid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ramsden v. Dyson",
      "citation": "1866 L.R. 1 H.L. 129",
      "treatment": "followed",
      "relevance": "Equity principle where landlord encourages expenditure on expectation of interest."
    },
    {
      "case_name": "Municipal Corporation of the City of Bombay v. Secretary of State",
      "citation": "1905 I.L.R. 29 Bom. 580",
      "treatment": "referred",
      "relevance": "Equity applicable even without statutory formalities; 'rent' includes revenue."
    },
    {
      "case_name": "Ariff v. Jadunath",
      "citation": "1931 L.R. 58 I.A. 91",
      "treatment": "distinguished",
      "relevance": "Part performance cannot override statutory formalities like TP Act."
    },
    {
      "case_name": "Goswamini Shri Kamalavahooji v. Collector of Bombay",
      "citation": "1937 39 Bom. L.R. 1046 / L.R. 64 I.A. 334",
      "treatment": "followed",
      "relevance": "S.8 covers total exemption (nil limit); no presumption of lost grant for exemption."
    },
    {
      "case_name": "Dadoba Janardhan v. Collector of Bombay",
      "citation": "1901 I.L.R. 25 Bom. 714",
      "treatment": "referred",
      "relevance": "Equity considerations."
    },
    {
      "case_name": "Jethabhoy Ruttonsey v. Collector of Bombay",
      "citation": "1901 I.L.R. 25 Bom. 752",
      "treatment": "referred",
      "relevance": "Related to Government grants."
    },
    {
      "case_name": "Maddison v. Alderson",
      "citation": "1883 L.R. 8 App. Cas. 467",
      "treatment": "distinguished",
      "relevance": "Equity and formalities."
    },
    {
      "case_name": "Walsh v. Lonsdale",
      "citation": "1882 L.R. 21 Ch. D. 9",
      "treatment": "referred",
      "relevance": "Equity as contract."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay City Land Revenue Act",
      "sections": [
        "8"
      ],
      "relevance": "Collector to levy assessment; limited if specific limit established/preserved (includes nil)."
    },
    {
      "name": "Statute 22-23 Vic. C. 41",
      "sections": [],
      "relevance": "Formalities for Crown disposition of property."
    },
    {
      "name": "Statute 21-22 Vic. C. 106",
      "sections": [],
      "relevance": "Vesting of land in Crown."
    },
    {
      "name": "Limitation Act",
      "sections": [
        "28"
      ],
      "relevance": "Extinguishment of right by adverse possession."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "115"
      ],
      "relevance": "Estoppel."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [],
      "relevance": "Formalities for leases (analogous)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed by majority (Das J. and Chandrasekhara Aiyar J.; Patanjali Sastri J. dissented); High Court decree upheld declaring Corporation's right to hold land free from assessment, assessment set aside.",
    "relief_granted": "Declaration of right in limitation of assessment; assessment declared ultra vires and set aside.",
    "costs": "Costs in this Court and High Court to respondents."
  },
  "key_quotes": [
    {
      "text": "Government do not consider any rent should be charged to the Municipality as the markets will be, like other public buildings, for the benefit of the whole community.",
      "speaker": "court",
      "significance": "Key 1865 Resolution term central to dispute."
    },
    {
      "text": "Such possession not being referable to any legal title it was prima facie adverse to the legal title of the Government... has continued openly, as of right and uninterruptedly for over 70 years.",
      "speaker": "court",
      "significance": "Basis for adverse possession holding (Das J.)."
    },
    {
      "text": "The right to levy land revenue was not part of the Government's right to the property. It is a prerogative right of the Crown which... could be exercised in respect of a land only on the footing that it belonged to another.",
      "speaker": "court",
      "significance": "Dissenting view on prerogative (Patanjali Sastri J.)."
    },
    {
      "text": "Courts must do justice by the promotion of honesty and good faith, as far as it lies in their power.",
      "speaker": "court",
      "significance": "Equity rationale (Chandrasekhara Aiyar J.)."
    }
  ],
  "_case_id": "1951_43",
  "_label": 0,
  "_text_length": 40562,
  "_extracted_at": "2026-02-10T19:19:48.009131"
}