{
  "metadata": {
    "case_name": "Petitioner v. Central Bank of India Ltd.",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "Patanjali Sastri C.J."
    ],
    "case_number": "Petition No. 328 of 1951",
    "date_of_judgment": "1951-12-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner held five shares in the share capital of the Central Bank of India Ltd., a company incorporated under the Indian Companies Act, 1882, with registered office at Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Bank sold those shares to a third party in purported exercise of its right of lien for recovery of a debt due to it from the petitioner, and the transfer was registered in the books of the Bank in the year 1937.",
      "type": "material",
      "date": "1937",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Petitioner instituted a series of proceedings in the High Court at Bombay on its original and appellate jurisdiction challenging the validity of the said sale and transfer.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Latest proceeding was a suit filed against the Bank in 1951 wherein the plaint was rejected on 2nd March, 1951, under Order 7, Rule 11(d), of the Code of Civil Procedure as barred by limitation.",
      "type": "procedural",
      "date": "1951-03-02",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Petitioner prays that all adverse orders made in previous proceedings be quashed and the High Court be directed to have the suit set down to be heard as undefended and pronounce judgment against the respondent or make such orders as it thinks fit.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Aforesaid order rejecting plaint was appealable, but petitioner did not prefer an appeal on the ground that all Judges of the High Court were disqualified from hearing such appeal either because of their interest in the Bank or prejudice against him.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Articles 19(1)(f) and 31(1) of the Constitution protect against violation of fundamental rights of property by private conduct of the Central Bank of India Ltd., or are intended only against State action.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Article 31(1) should be construed apart from clause 2 and covers deprivations by private individuals.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Article 19(1)(f) and Article 31(1) were intended to prevent wrongful individual acts or provide protection against private conduct, including sale of shares by the Bank.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Article 19(1)(f), Article 31(1)"
    },
    {
      "id": "pa2",
      "text": "Article 31(1) should be construed apart from clause 2; omission of word 'State' in clause 1 while used in clause 2 and other articles indicates it covers infringements by private individuals.",
      "supporting_facts": [],
      "legal_basis": "Article 31(1), Article 31(2)"
    },
    {
      "id": "pa3",
      "text": "Entries in Seventh Schedule (No. 33 Union List, 36 State List, 42 Concurrent List) empower laws for acquisition/requisitioning but not deprivation by State, so Article 31(1) contemplates deprivation by individuals.",
      "supporting_facts": [],
      "legal_basis": "Seventh Schedule entries, Article 246"
    },
    {
      "id": "pa4",
      "text": "Legislative history: Section 299(1) of Government of India Act, 1935, corresponding to Article 31(1), was omitted in draft Article 19 (later 31) but restored, showing clause 1 operates distinctly from clause 2.",
      "supporting_facts": [],
      "legal_basis": "Section 299(1) Government of India Act 1935"
    },
    {
      "id": "pa5",
      "text": "Reliance on observations in Chiranjit Lal v. Union of India that Article 31(1) enunciates general principle of no deprivation except by authority of law, distinct from clause 2 on acquisition.",
      "supporting_facts": [],
      "legal_basis": "Chiranjit Lal v. Union of India (1950 SCR 860)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Certain other objections to the maintainability of the petition.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Petitioner has misconceived his remedy; neither Article 19(1)(f) nor Article 31(1) on its true construction was intended to prevent wrongful individual acts or provide protection against merely private conduct.",
      "addresses_issue": "i1",
      "key_observation": "Article 19 protects freedoms against State action other than legitimate exercise of power to regulate private rights in public interest; violation by individuals not within purview."
    },
    {
      "id": "cr2",
      "text": "Article 31(1) is declaration of fundamental right of private property in negative form like Article 21; words 'save by authority of law' prohibit unauthorised governmental action, not private individuals.",
      "addresses_issue": "i2",
      "key_observation": "No private individual authorised by law to deprive another of property."
    },
    {
      "id": "cr3",
      "text": "Argument on Seventh Schedule entries fallacious; legislatures competent to enact laws authorising deprivation under other entries (e.g., No.1 List II/III); Article 31(1) itself contemplates such laws.",
      "addresses_issue": "i2",
      "key_observation": "Futile to deny legislative power."
    },
    {
      "id": "cr4",
      "text": "Legislative history does not support; Section 299(1) of 1935 Act never interpreted as prohibiting private deprivations; restoration leads to no inference for petitioner's contention.",
      "addresses_issue": "i2",
      "key_observation": "Articles are safeguards against State aggression, not private infringements; remedies in ordinary law."
    },
    {
      "id": "cr5",
      "text": "Unnecessary to go into Chiranjit Lal observations for present petition; even assuming Article 31(1) read apart from clause 2, it excludes private violations.",
      "addresses_issue": "i2",
      "key_observation": "Petition fails on preliminary ground."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Articles 19(1)(f) and 31(1) protect against State action only, not private conduct; petition under Article 32 not maintainable for alleged violation by private company.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chiranjit Lal v. Union of India",
      "citation": "1950 SCR 860",
      "treatment": "referred",
      "relevance": "Petitioner relied on observations distinguishing clause 1 and 2 of Article 31; court finds unnecessary to examine for this petition."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 19(1)(f)",
        "Article 31(1)",
        "Article 31(2)",
        "Article 21",
        "Article 246"
      ],
      "relevance": "Petition under Article 32 for enforcement of Articles 19(1)(f) and 31(1); court holds they apply only against State, not private acts."
    },
    {
      "name": "Indian Companies Act, 1882",
      "sections": [],
      "relevance": "Bank incorporated under this Act."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order 7 Rule 11(d)"
      ],
      "relevance": "Plaint rejected as barred by limitation."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Section 299(1)"
      ],
      "relevance": "Corresponding provision to Article 31(1); legislative history discussed."
    },
    {
      "name": "Constitution Seventh Schedule",
      "sections": [
        "Entry 33 Union List",
        "Entry 36 State List",
        "Entry 42 Concurrent List",
        "Entry 1 List II",
        "Entry 1 List III"
      ],
      "relevance": "Petitioner's argument on legislative competence rejected."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The petition under Article 32 is dismissed on preliminary ground as Articles 19(1)(f) and 31(1) do not apply to private conduct of the Bank; unnecessary to deal with other objections to maintainability.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Neither article 19(1)(f) nor article 31(1) on its true construction was intended to prevent wrongful individual acts or to provide protection against merely private conduct.",
      "speaker": "court",
      "significance": "Core holding rejecting applicability of fundamental rights to private actions."
    },
    {
      "text": "The words save by authority of law in clause (1) of article 31 show that it is a prohibition of unauthorised governmental action against private property.",
      "speaker": "court",
      "significance": "Explains scope limited to State action, analogizing to Article 21."
    }
  ],
  "_case_id": "1951_56",
  "_label": 0,
  "_text_length": 8271,
  "_extracted_at": "2026-02-10T19:19:36.880564"
}