{
  "metadata": {
    "case_name": "Colonel MacPherson (First Defendant/Appellant) v. Plaintiff (First Respondent) and Second Defendant (Second Respondent)",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "Fazl Ali J."
    ],
    "case_number": "Appeal from Original Suit No. 1 of 1945",
    "date_of_judgment": "1951-02-09"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The first defendant owned a bungalow in Mercara known as Morvern Lodge.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The first defendant owned certain estates in Mercara; Mr. White was an alternate director in one of the estates; Youngman was the manager of another estate and was looking after Morvern Lodge during the first defendant's absence.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "About the middle of 1944, the plaintiff asked White if he would cable to the first defendant his offer of Rs. 4,000 for the bungalow.",
      "type": "background",
      "date": "1944-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 1st June 1944, White sent a cable to the first defendant: 'Have enquiries Mercara bungalow if for sale, wire lowest figure.'",
      "type": "material",
      "date": "1944-06-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On 24th July 1944, the plaintiff wrote to the first defendant that he was prepared to purchase the bungalow for Rs. 5,000 and asked to which bank he should issue a cheque.",
      "type": "material",
      "date": "1944-07-24",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Youngman sent a cable to the first defendant: 'Have had offer Morvern Lodge rupees six thousand for immediate possession.'",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On 5th August 1944, the first defendant sent a cable received by Youngman on 8th August: 'Wont accept less than rupees ten thousand.'",
      "type": "material",
      "date": "1944-08-05",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On 7th August 1944, the plaintiff wrote to Youngman asking whether his offer had been accepted and stating he was prepared to accept any higher price if reasonable.",
      "type": "material",
      "date": "1944-08-07",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On 8th August 1944, the first defendant sent an airgraph to Youngman explaining the cables received about Rs. 6,000 and Rs. 10,000 value, and stating he wired 'Wont accept less than Rs. 10,000.'",
      "type": "material",
      "date": "1944-08-08",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On 9th August 1944, Youngman wrote to the plaintiff relaying the first defendant's cable: 'Wont accept less than rupees ten thousand.' Plaintiff stated in plaint received on 14th August.",
      "type": "material",
      "date": "1944-08-09",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Plaintiff stated in evidence he met Youngman on 11th August 1944 after receiving letter, told him personally he would pay Rs. 10,000, require immediate delivery, and agreed to bear conveyance charges.",
      "type": "disputed",
      "date": "1944-08-11",
      "source": "plaintiff"
    },
    {
      "id": "f12",
      "text": "On 14th August 1944, plaintiff wrote to Youngman confirming oral offer: 'I hereby confirm my oral offer of ten thousand for the bungalow... hurry up with consultation with your lawyers at Madras and make arrangements to receive the money and hand over the bungalow.'",
      "type": "material",
      "date": "1944-08-14",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On 17th August 1944, Subbayya wrote to Youngman confirming his offer of Rs. 10,500 made the previous day for the bungalow, expecting it had been cabled to first defendant.",
      "type": "material",
      "date": "1944-08-17",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Youngman did not communicate Subbayya's offer to the first defendant.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On 26th August 1944, Youngman cabled first defendant: 'Offered ten thousand Morvern Lodge immediate possession. May I sell.'",
      "type": "material",
      "date": "1944-08-26",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "On 26th August 1944, White cabled first defendant: 'Hold offer for Morvern Bungalow rupees eleven thousand cash subject immediately acceptance and occupation. Strongly recommend acceptance.'",
      "type": "material",
      "date": "1944-08-26",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "On 29th August 1944, Youngman sent airgraph to first defendant thanking for airgraph of 8th August, noting cable of Rs. 10,000 from previous Rs. 6,000 offeror, and White's Rs. 11,000 same day, expecting acceptance of White's offer, requesting Power-of-Attorney.",
      "type": "material",
      "date": "1944-08-29",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "First defendant cabled to White: 'Accept rupees eleven thousand Morvern Lodge occupation permitted when full amount deposited my account Mercantile Bank Madras inform Youngman.'",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Second defendant paid Rs. 11,000 and occupied the bungalow.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Plaintiff instituted suit for specific performance of alleged contract of sale of bungalow.",
      "type": "procedural",
      "date": "1945",
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Judicial Commissioner of Coorg held there was a concluded contract but awarded Rs. 3,000 as compensation instead of specific performance.",
      "type": "procedural",
      "date": "1946-04-01",
      "source": "lower_court"
    },
    {
      "id": "f22",
      "text": "First defendant appealed after obtaining certificate under section 109(c) CPC; plaintiff filed no appeal.",
      "type": "procedural",
      "date": "1946-04-01",
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Youngman stated in evidence he felt improper to entertain Subbayya's higher offer and did not communicate it; had leaning in favour of plaintiff.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in view of the correspondence, there was a concluded contract for the sale of Morvern Lodge in favour of the plaintiff on 14th August 1944.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the first defendant's cable of 5th August 1944 ('Wont accept less than rupees ten thousand') was a counter-offer or merely inviting offers.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There was no concluded contract; the cable was merely a statement of lowest price, inviting offers, not a counter-offer.",
      "supporting_facts": [
        "f7",
        "f10",
        "f12",
        "f15"
      ],
      "legal_basis": "Harvey v. Facey"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The cable sent by first defendant on 5th August (received 8th) was a counter-offer made through Youngman to plaintiff, and contract complete on acceptance.",
      "supporting_facts": [
        "f7",
        "f11",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "By 26th August 1944, Youngman was under influence of rival bidder or White, and cable deliberately framed to prejudice plaintiff.",
      "supporting_facts": [
        "f15",
        "f16"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Difficult to hold there was concluded contract on 14th August 1944; supported by Harvey v. Facey where statement of lowest price was not an offer but left everything else open; plaintiff's reply was an offer requiring acceptance.",
      "addresses_issue": "i1",
      "key_observation": "Mere statement of lowest price contains no implied contract to sell at that price."
    },
    {
      "id": "cr2",
      "text": "Plaintiff's letter of 14th August confirmed his own oral offer, did not expressly accept counter-offer; Youngman's cable of 26th August treated it as offer subject to 'May I sell?'; parties proceeded on footing of invitation to offer.",
      "addresses_issue": "i2",
      "key_observation": "Neither party treated first defendant's cable as containing a counter-offer."
    },
    {
      "id": "cr3",
      "text": "No evidence supports contention Youngman influenced by rival; he did not communicate Subbayya's higher offer and leaned towards plaintiff.",
      "addresses_issue": "i2",
      "key_observation": "Youngman's evidence frank and supported by cable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "There was no concluded contract for sale of Morvern Lodge in favour of the plaintiff.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "First defendant's cable was not a counter-offer but merely stating lowest price, inviting offers.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Harvey v. Facey",
      "citation": "1893 A.C. 552",
      "treatment": "followed",
      "relevance": "Similar facts: telegram stating lowest price not an unconditional offer to sell; required acceptance to form contract."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "109(c)"
      ],
      "relevance": "Certificate granted for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal by first defendant allowed; held no concluded contract between first defendant and plaintiff; lower court's decree awarding Rs. 3,000 compensation to plaintiff set aside implicitly by reversing finding of concluded contract.",
    "relief_granted": "Decree of lower court set aside in favour of appellant (first defendant).",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'Wont accept less than rupees ten thousand.'",
      "speaker": "first_defendant",
      "significance": "Cable interpreted as mere statement of lowest price, not counter-offer."
    },
    {
      "text": "The mere statement of the lowest price at which the vendor would sell contains no implied contract to sell at that price to the persons making the inquiry.",
      "speaker": "court",
      "significance": "Key observation from Harvey v. Facey adopted by court."
    },
    {
      "id": "kq3",
      "text": "Neither party thus treated the first defendants cable as containing a counter-offer. On the other hand, they proceeded on the footing that the plaintiff had made an offer of Rs. 10,000 which was subject to acceptance by the first defendant.",
      "speaker": "court",
      "significance": "Highlights parties' conduct confirming no contract."
    }
  ],
  "_case_id": "1951_62",
  "_label": 1,
  "_text_length": 10887,
  "_extracted_at": "2026-02-10T19:19:50.093774"
}