{
  "metadata": {
    "case_name": "Maharaja of Gidhaur v. Defendants 1st Party (Appeal by Defendant No. 1)",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "FAZAL ALI J."
    ],
    "case_number": "Civil Appeal No. 29 of 1950",
    "date_of_judgment": "1951-05-02"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The plaintiff, the Maharaja of Gidhaur, is the proprietor of an impartible estate known as Gidhaur raj in the district of Monghyr.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The ancestors of the defendants 1st party originally held a 4 annas share in a ghatwali tenure known as Mahal Dumri Nisf Katauna T. No. 325, and subsequently by private partition they were allotted mouza Dumri with its 47 tolas which are detailed in schedule I of the plaint.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In execution of a mortgage decree obtained by one Chethru Rai against the ancestors of defendants 1st party, their interest was purchased by the Maharaja of Gidhaur in the name of one of his employees, and the latter took delivery of possession of the property on the 19th April, 1904.",
      "type": "material",
      "date": "1904-04-19",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On the 13th August, 1903, the ancestors of the defendants 1st party filed an application for setting aside the sale which was dismissed by the executing court and the appeal from the order of the executing court was dismissed by the High Court as well as by the Privy Council.",
      "type": "procedural",
      "date": "1903-08-13",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After certain disputes in the criminal courts, the defendants second party alleging themselves to be the lessees of the defendants first party, obtained a mining license in 1937 from the sub-divisional officer of Jamui.",
      "type": "material",
      "date": "1937",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The District Magistrate apprehending a breach of the peace, started proceedings under section 144 of the Criminal Procedure Code, which ended in favour of the defendants first and second parties and against the plaintiff.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Emboldened by the order in the proceedings under section 144, the defendants started working mines in the tolas mentioned in schedule II of the plaint and extracted a considerable quantity of mica.",
      "type": "disputed",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f8",
      "text": "The plaintiff instituted the present suit for a declaration of the subsoil rights with regard to the entire Mahal Dumri and for recovery of possession of the mortgage lands situated in the tolas specified in schedule II of the plaint, mesne profits and a permanent injunction restraining the defendants first and second parties from extracting mica or other underground minerals from the lands mentioned in schedule II of the plaint.",
      "type": "procedural",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f9",
      "text": "The grounds claimed: plaintiff being the 16 annas proprietor of Dumri Nisf Katauna has got an indefeasible right and title to all the underground minerals including mica; all titles and interest in the said 4 annas mokrari shares of the ancestors of defendant 1st party acquired by plaintiff's ancestor by auction purchase in 1903; defendants have no right in mica and underground minerals.",
      "type": "admitted",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f10",
      "text": "The case of defendant No. 1 (real defendant, father of appellant): the four annas interest in village Dumri was a ghatwali tenure granted to ancestors by Muhammadan rulers to guard hill passes, affirmed by Captain Browne; mineral and subsoil rights vested in him as holder of ghatwali tenure; plaintiff acquired no right by auction-purchase in 1903 as property being Government ghatwali tenure was inalienable and auction-purchase invalid; defendant and ancestors exercised rights of possession over mines and minerals for more than 12 years prior to suit in assertion of ghatwali right to knowledge of plaintiff, acquiring adverse possession.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Subordinate Judge decreed the suit: disputed tenure was zamindary ghatwali tenure not inalienable; plaintiff in possession since 1903 until order of District Magistrate in 1938; plaintiff as proprietor entitled to mineral and subsoil rights; under mortgage-sale only surface right passed to plaintiff.",
      "type": "procedural",
      "date": "1942-02-28",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court affirmed substantially: subsoil rights remained with proprietor; even if defendant No. 1 had subsoil rights, they passed at mortgage-sale of 1903; on adverse possession, no clear evidence of mine working, at utmost isolated acts since 1935.",
      "type": "procedural",
      "date": "1945-10-10",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the ghatwali tenure held by defendants first party was a zamindary ghatwali or a Government ghatwali, and consequently whether it was inalienable and no title passed to plaintiff by auction purchase.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the plaintiff's suit was barred by limitation under articles 142 and 144 of the Limitation Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The finding of courts below that the ghatwali tenure was zamindary ghatwali and not Government ghatwali cannot be sustained; it was Government ghatwali, inalienable, no title passed to plaintiff.",
      "supporting_facts": [
        "f2",
        "f10"
      ],
      "legal_basis": "Ghatwali sanad Exhibit C-1 granted in 1776 by Captain Browne; various documents and reports."
    },
    {
      "id": "pa2",
      "text": "Plaintiff's suit barred by limitation under articles 142 and 144; plaintiff failed to prove possession within 12 years; adverse possession established.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Articles 142 and 144 of the Limitation Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Plaintiff as 16 annas proprietor has indefeasible right to underground minerals; full title acquired by auction purchase in 1903; defendants have no rights.",
      "supporting_facts": [
        "f1",
        "f3",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Tenure is zamindary ghatwali, alienable; plaintiff in possession since 1903.",
      "supporting_facts": [
        "f3",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Explained ghatwali tenure: Government ghatwali created by ruling power, inalienable; zamindary ghatwali by zamindar, alienable with consent.",
      "addresses_issue": "i1",
      "key_observation": "Quoted Patna HC in Rani Sonabati Kumari v. Raja Kirtyanand Singh."
    },
    {
      "id": "cr2",
      "text": "Analysed sanad Exhibit C-1: not grant of land but authority to collect ghatwari fees; compared to other sanads; proceedings show held under zamindar of Gidhaur.",
      "addresses_issue": "i1",
      "key_observation": "Tenure pre-existed sanad, under zamindar requiring patta/kabuliyat."
    },
    {
      "id": "cr3",
      "text": "Permanent Settlement included tenure in Gidhaur zamindary; Record of Rights as istemrari mokrari under zamindar; presumption of zamindary ghatwali not rebutted.",
      "addresses_issue": "i1",
      "key_observation": "Appellant failed to prove by clear evidence it was Government ghatwali."
    },
    {
      "id": "cr4",
      "text": "Concurrent findings of lower courts on adverse possession upheld; no reinvestigation.",
      "addresses_issue": "i2",
      "key_observation": "Courts below fully discussed evidence."
    },
    {
      "id": "cr5",
      "text": "Suit not barred under Art 142; plaintiff proved possession.",
      "addresses_issue": "i2",
      "key_observation": "Plea negatived."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The ghatwali tenure is zamindary ghatwali, not Government ghatwali, and alienable; title to subsoil rights passed to plaintiff via 1903 auction purchase.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No adverse possession established; suit not barred by limitation.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rani Sonabati Kumari v. Raja Kirtyanand Singh",
      "citation": "I.L.R. 14 Patna 70",
      "treatment": "followed",
      "relevance": "Elaborate discussion on meaning of ghatwali tenures, distinction between Government and zamindary."
    },
    {
      "case_name": "Kali Prasad v. Ananda Rai",
      "citation": "15 I.A. 18",
      "treatment": "referred",
      "relevance": "Power of alienation in ghatwali tenures once established."
    },
    {
      "case_name": "Fulbati Kumari v. Maheshwari Prasad",
      "citation": "A.I.R. 1923 Patna 453",
      "treatment": "followed",
      "relevance": "Construction of the same sanad Exhibit C-1; not grant of land but authority for fees."
    },
    {
      "case_name": "Narayan Singh v. Niranjan Chakravarti",
      "citation": "51 I.A. 37",
      "treatment": "distinguished",
      "relevance": "Comparison of sanads; extensive land grants indicating Government ghatwali."
    },
    {
      "case_name": "Raja Lelanund Singh Bahadoor v. The Bengal Government",
      "citation": "6 Moores I.A. 101",
      "treatment": "followed",
      "relevance": "Ghatwali lands in zamindary included in Permanent Settlement raise presumption of zamindary connection."
    },
    {
      "case_name": "Raja Nilmoni Singh v. Bakranath Singh",
      "citation": "9 I.A. 104",
      "treatment": "referred",
      "relevance": "Permanent Settlement does not convert public services to private."
    }
  ],
  "statutes_cited": [
    {
      "name": "Limitation Act",
      "sections": [
        "Article 142",
        "Article 144"
      ],
      "relevance": "Plea of bar to suit for possession of immovable property; negatived."
    },
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "Section 144"
      ],
      "relevance": "Proceedings by District Magistrate ended in favour of defendants, emboldening mining."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the concurrent findings of the Subordinate Judge and Patna High Court that the ghatwali tenure was zamindary not Government, alienable, plaintiff entitled to subsoil rights including mica, no adverse possession, suit not barred by limitation.",
    "relief_granted": "Declaration of title to subsoil rights, possession, mesne profits, permanent injunction as decreed below.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Literally a ghatwal means a guard of the passes and the term ghatwali tenure was applied by the Moghuls to lands assigned at a low rent or free of rent for guarding the mountain passes...",
      "speaker": "court",
      "significance": "Defines ghatwali tenure and distinction between Government and zamindary types."
    },
    {
      "text": "A Government ghatwali has been uniformly held to be inalienable. On the other hand, a zamindary ghatwali may be alienated with the consent of the zamindar...",
      "speaker": "court",
      "significance": "Key to alienability issue central to case."
    },
    {
      "text": "The appellant has not been able by clear and conclusive evidence to rebut the presumption arising from the Record of Rights and the record of the Permanent Settlement...",
      "speaker": "court",
      "significance": "Concludes tenure is zamindary ghatwali."
    }
  ],
  "_case_id": "1951_32",
  "_label": 0,
  "_text_length": 26753,
  "_extracted_at": "2026-02-08T22:16:21.680385"
}