{
  "metadata": {
    "case_name": "Decree-holders (original plaintiffs' representatives) v. Defendant No. 1",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "MUKHERJEA J."
    ],
    "case_number": "Civil Appeal No. 32 of 1950",
    "date_of_judgment": "1951-03-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Mortgage bond executed by defendant No. 1 for himself and his minor undivided brother (defendant No. 2), and as authorised agent on behalf of defendants 3 to 7 interested in a joint family business.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Original plaintiffs (mortgagees) instituted O.S. No. 30 of 1934 in District Judge, East Tanjore, against defendant No. 1 and six others for enforcement of mortgage.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Suit contested by all defendants except defendant No. 1 (ex parte against him); preliminary decree passed on May 15, 1937, directing defendant No. 1 and defendants 3 to 7 to pay Rs. 1,08,098, in default sale of mortgaged properties; suit dismissed against defendant No. 2.",
      "type": "procedural",
      "date": "1937-05-15",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Two appeals to Madras High Court: Appeal No. 48 of 1938 by defendants 3 to 7 (mortgage not binding on them or joint family property); Appeal No. 248 of 1938 by plaintiffs (challenging dismissal against defendant No. 2).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Madras Agriculturists Relief Act (Act IV of 1938) came into force during pendency of appeals.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Defendants 2 to 7 applied to High Court for scaling down of decretal debt under the Act; defendant No. 1 did not apply.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "High Court forwarded applications to District Judge for enquiry; finding submitted that applicants were agriculturists, debt scaled to Rs. 49,255 with 6% interest per annum from October 1, 1937, exclusive of costs.",
      "type": "procedural",
      "date": "1937-10-01",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court judgment dated March 23, 1942: accepted scaling down for defendants 2 to 7 (Rs. 49,255 + interest); defendant No. 1 liable for full amount (Rs. 1,05,000 and odd, with modified interest); decree drawn accordingly.",
      "type": "procedural",
      "date": "1942-03-23",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Defendant No. 1 applied to District Judge for relief under Agriculturists Relief Act, alleging he was agriculturist; dismissed on February 25, 1943, as High Court had negatived his claim.",
      "type": "procedural",
      "date": "1943-02-25",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Defendant No. 1 applied to High Court to set aside ex parte decree excluding him from Act benefits; rejected on December 13, 1943.",
      "type": "procedural",
      "date": "1943-12-13",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Final decree passed by District Judge on September 25, 1943, in terms of High Court preliminary decree.",
      "type": "procedural",
      "date": "1943-09-25",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Execution proceedings started on August 16, 1944, in E.P. 2 of 1945, District Judge, East Tanjore.",
      "type": "procedural",
      "date": "1944-08-16",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Two lots of mortgaged properties sold and purchased by decree-holders for Rs. 12,005 on July 15, 1946; confirmed August 17, 1946; part satisfaction entered.",
      "type": "procedural",
      "date": "1946-07-15",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Settlement terms via Receivers (estate of decree-holders): Rs. 24,000 from defendant No. 2 to release him and share; Rs. 48,000 from defendants 3 to 7 to release them; Rs. 37,500 from defendant No. 1 (via Yacob Nadar) with assignment excluding rights against 2-7.",
      "type": "procedural",
      "date": "1947-01-10",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Rs. 24,000 paid on behalf of defendant No. 2 on January 20, 1947; lots 2 and 6 exonerated.",
      "type": "procedural",
      "date": "1947-01-20",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Defendants 3 to 7 paid Rs. 30,000 on January 27, 1947, and Rs. 18,610-12-0 on February 17, 1947; total Rs. 72,610-12-0.",
      "type": "procedural",
      "date": "1947-02-17",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Defendant No. 1 deposited Rs. 3,215 on March 6, 1947, and petitioned under s. 47 and O. XXI r. 2 CPC for full satisfaction, claiming payments by 2-7 plus deposit wipe off scaled amount, exonerating all properties and himself via indivisibility.",
      "type": "procedural",
      "date": "1947-03-06",
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "District Judge negatived contention; High Court on appeal (judgment January 5, 1948) accepted, directed full satisfaction.",
      "type": "procedural",
      "date": "1948-01-05",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether defendant No. 1, denied direct relief under Madras Agriculturists Relief Act, can indirectly obtain benefit of scaling down granted to defendants 2 to 7 via principle of unity and indivisibility of mortgage decree, entitling him to full exoneration of mortgaged properties upon payment of scaled amount by others in execution proceedings.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Executing court must enforce decree terms as passed; cannot interpret or rewrite to give new relief; decree specifies separate liabilities for defendant No. 1 (full amount) and defendants 2-7 (scaled); principle of indivisibility does not apply to override Act's specific relief to agriculturists only.",
      "supporting_facts": [
        "f8",
        "f17",
        "f18"
      ],
      "legal_basis": "Civil Procedure Code s. 47 and O. XXI r. 2; Madras Agriculturists Relief Act as special statute for agriculturists"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Mortgage debt is one and indivisible; satisfaction of scaled decree against defendants 2-7 by their payments frees entire mortgaged property from lien; defendant No. 1 gets incidental benefit without violating decree clause requiring his full payment for redemption.",
      "supporting_facts": [
        "f14",
        "f15",
        "f16",
        "f17"
      ],
      "legal_basis": "Principle of unity and indivisibility of mortgage decree; Madras High Court decisions on indirect benefit to non-agriculturists"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court erred as executing court by going beyond decree terms under guise of interpretation; decree scaled debt only for defendants 2-7 (agriculturists), left intact for defendant No. 1; cannot create new decree.",
      "addresses_issue": "i1",
      "key_observation": "Duty of executing court is to give effect to decree terms without alteration."
    },
    {
      "id": "cr2",
      "text": "Madras Agriculturists Relief Act is special statute trenching on general law, providing scaling only for agriculturists (s. 7); lawful to scale for some debtors, not others; s. 14 contemplates splitting debts in families.",
      "addresses_issue": "i1",
      "key_observation": "No legal bar to differential scaling in joint mortgage debts."
    },
    {
      "id": "cr3",
      "text": "Cited Madras High Court cases (e.g., Rainier v. Srinivasiah) support scaling for some parties; cases on purchasers getting incidental benefit inapplicable as no purchaser here, and parties are original mortgagors.",
      "addresses_issue": "i1",
      "key_observation": "Ratio of purchaser cases not applicable to co-debtors/mortgagors."
    },
    {
      "id": "cr4",
      "text": "Decree should have explicitly stated separate liabilities and consequences, but reading as whole implies defendant No. 1 liable for full amount for full redemption.",
      "addresses_issue": "i1",
      "key_observation": "Indivisibility exceptions exist, but Act permits disruption for agriculturists."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Non-agriculturist co-debtor cannot indirectly get scaling benefit via indivisibility when directly denied under Act; executing court enforces decree as is with separate liabilities.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rainier v. Srinivasiah",
      "citation": "(1940) 2 M. 39",
      "treatment": "followed",
      "relevance": "Supports scaling mortgage decree for some debtors (agriculturists or liable parties) while keeping intact for others."
    },
    {
      "case_name": "Arunachalam Pillai v. Seetharam",
      "citation": "(1941) 1 M.L.J. 561",
      "treatment": "distinguished",
      "relevance": "Purchaser of equity of redemption (non-agriculturist) gets incidental benefit of scaling for original mortgagor; inapplicable as no purchaser here."
    },
    {
      "case_name": "Pachigola v. Karatam",
      "citation": "(1949) 1 M.L.J. 506",
      "treatment": "distinguished",
      "relevance": "Private sale purchaser gets scaling benefit via refund mechanics; inapplicable."
    },
    {
      "case_name": "Subramanian v. Ramachandra",
      "citation": "(1946) 2 M.L.J. 429",
      "treatment": "distinguished",
      "relevance": "Execution stage benefit to purchaser whose own scaling application refused; inapplicable as no purchaser."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Section 47",
        "Order XXI, rule 2"
      ],
      "relevance": "Basis for execution application to record satisfaction."
    },
    {
      "name": "Madras Agriculturists Relief Act, 1938 (Act IV of 1938)",
      "sections": [
        "Section 7",
        "Section 14",
        "Section 19"
      ],
      "relevance": "Scales debts of agriculturists notwithstanding general law; permits splitting family debts; applied to scale for defendants 2-7 only."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [],
      "relevance": "General law on indivisibility of mortgage decrees; trenched upon by special Act for agriculturists."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment and order of Madras High Court dated January 5, 1948, set aside; application of defendant No. 1 under s. 47 and O. XXI r. 2 CPC dismissed; High Court approached case improperly as executing court exceeding decree terms.",
    "relief_granted": "Decree-holders' appeal succeeds; no full satisfaction for defendant No. 1.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It seems to us that the High Courts approach to the case has not been a proper one and the conclusion it has reached cannot be supported in law. The learned Judges appear to have overlooked the fact that they were sitting only as an executing court and their duty was to give effect to the terms of the decree that was already passed and beyond which they could not go.",
      "speaker": "court",
      "significance": "Core holding on limits of executing court's jurisdiction."
    },
    {
      "text": "It is no doubt somewhat odd that when a person is declared liable to pay a larger amount he should on payment or tender of a smaller amount get his property exonerated from liability but this is inherent in and arises out of the proposition established by the decisions already dealt with, namely, that by the application of the principle of unity and indivisibility of a mortgage decree a non-agriculturist can indirectly get relief which he cannot directly get.",
      "speaker": "court",
      "significance": "Quotes High Court's erroneous reasoning rejected by Supreme Court."
    }
  ],
  "_case_id": "1951_17",
  "_label": 1,
  "_text_length": 19062,
  "_extracted_at": "2026-02-08T22:15:46.776655"
}