{
  "metadata": {
    "case_name": "Arjan Singh alias Puran v. Inder Singh and others",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "CHANDRASEKHARA AIYAR J."
    ],
    "case_number": "Civil Appeal No. 31 of 1950",
    "date_of_judgment": "1951-03-02"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plaintiff Arjan Singh alias Puran, born on 22nd July, 1919, and a minor when the will was made, brought suit in court of Subordinate Judge, Jullundur, against Inder Singh (defendant No. 1), Kartar Singh (defendant No. 2) and five others for declaration that will executed by Inder Singh in favour of Kartar Singh about 14 years ago was null and void as against plaintiff, who was first defendant's reversionary heir after his death.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Suit comprised half share of land measuring 395 kanals in village of Kadduwal, another half share of land measuring 837 kanals and 11 marlas in village of Pattar Kalan, and four houses in latter village.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Pedigree: Plaintiff claims Sehja Singh as his 4th ancestor; Jodha Singh and Jai Singh as Sehja Singh's sons; defendant No. 1 Inder Singh is Jodha Singh's grandson. Later mentions third son Pohlo and fourth son Hamira.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Parties are Jat agriculturists governed by customary law in matters of alienation of ancestral property and succession; sonless proprietor under this law is not competent to make a will in respect of his ancestral property when there are collaterals up to the 5th degree; entire property mentioned was ancestral.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Second defendant Kartar Singh set up his adoption by first defendant and pleaded that properties were not at all ancestral as regards plaintiff. Defendants 3 to 7 remained ex parte.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "At trial, admitted that land in Kadduwal was not proved to be ancestral.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Subordinate Judge held land in Pattar Kalan not shown to be ancestral: common ancestor Sehja Singh had not only two sons Jodha Singh and Jai Singh but third son Pohlo; from mere fact two sons enjoyed land in equal shares, no presumption could arise that property was ancestral when nothing known about share of third son.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Subordinate Judge recorded findings in favour of plaintiff on issues as to adoption and limitation, but held plaintiff had no locus standi to contest validity of adoption as period of limitation expired long before he was born; suit dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Plaintiff appealed to District Judge; filed application under Order XLI rule 27 and s.151 CPC for additional evidence: kami beshi statement relating to Mauza Pattar Kalan containing note that third son Pohlo gave up his interest in ancestral property in favour of his brothers.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "District Judge allowed application on 17th March 1942, before hearing appeal on 24th April 1942; referred to entries in naqsha kami beshi (1849-50) and muntakhib asami-war (1852) stating Pohlo relinquished share; permitted parties to call evidence; two witnesses examined: Munshi Pirthi Nath (clerk DC office) brought record of rights Pattar Kalan 1849-50; Munshi Niaz Ahmad (Qanungo) brought muntakhib asami-war.",
      "type": "procedural",
      "date": "1942-03-17",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "District Judge reversed Subordinate Judge: entries genuine not forged; Pohlo relinquished share so land Pattar Kalan ancestral qua plaintiff; suit not barred (art 120 Limitation Act); adoption not true; custom did not permit proprietor to will away any portion ancestral or self-acquired; decreed suit in entirety including Kadduwal (conceded non-ancestral) and 4 bighas 16 biswas Pattar Kalan with third parties.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Second defendant Kartar Singh second appeal to High Court of Lahore (Regular Second Appeal No. 887 of 1942, judgment 28th February 1946): no thing to show land Pattar Kalan ancestral; District Judge not justified admitting additional evidence (naqsha kami beshi, muntakhib asami-war); entries subsequent interpolation (different pen/ink, awkward insertion, illegible, inconsistent across copies/places); entire land Pattar Kalan non-ancestral; under s.7 Act II 1920 no person empowered to contest alienation of non-ancestral immovable property on ground contrary to custom; suit dismissed in toto.",
      "type": "procedural",
      "date": "1946-02-28",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Leave granted to appeal to Privy Council; now before Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the properties were ancestral under customary law, rendering the will by sonless proprietor Inder Singh invalid as against reversionary heir collaterals up to 5th degree.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether District Judge properly exercised discretion under Order XLI rule 27 CPC to admit additional evidence of settlement registers showing Pohlo relinquished share.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether High Court could interfere with District Judge's findings on additional evidence and genuineness of entries in second appeal under s.100 CPC.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether plaintiff had locus to challenge will/adoption and suit within limitation.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court not open to interfere with discretion exercised by District Judge in allowing additional evidence; even assuming erroneous finding of fact, it must stand final as second appeal only on grounds in s.100 CPC.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "Order XLI rule 27 CPC; section 100 CPC"
    },
    {
      "id": "pa2",
      "text": "Entries in naqsha kami beshi (1849-50) and muntakhib asami-war (1852) genuine, showing Pohlo relinquished share, proving Pattar Kalan ancestral qua plaintiff.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Properties not ancestral as regards plaintiff; Kartar Singh adopted by Inder Singh.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Plaintiff had ample opportunity to produce evidence in trial court; additional evidence entry forged.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Order XLI rule 27 CPC"
    },
    {
      "id": "ra3",
      "text": "Under s.7 Act II 1920, no person empowered to contest alienation of non-ancestral immovable property contrary to custom.",
      "supporting_facts": [
        "f7",
        "f12"
      ],
      "legal_basis": "Section 7 Act II 1920"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Discretion to receive additional evidence not arbitrary but judicial, circumscribed by Order XLI rule 27 CPC; appellate court must require evidence to pronounce judgment; no inherent lacuna in evidence as it stood; District Judge admitted before examining record/hearing appeal.",
      "addresses_issue": "i2",
      "key_observation": "High Court right in holding District Judge not justified admitting evidence under Order XLI r.27."
    },
    {
      "id": "cr2",
      "text": "Even if additional evidence proper, District Judge failed to consider inherent infirmities: entries subsequent interpolation (different pen/ink, awkward, illegible, inconsistent); records in custody insufficient to prove genuine.",
      "addresses_issue": "i2",
      "key_observation": "Finding on genuineness not conclusive in second appeal as based on improperly admitted evidence without considering defects."
    },
    {
      "id": "cr3",
      "text": "Without additional evidence, nothing shows common ancestor Sehja Singh possessed Pattar Kalan properties entered in names of two sons equally, nothing about third son Pohlo's share (pedigree shows fourth son Hamira); no presumption of ancestral origin.",
      "addresses_issue": "i1",
      "key_observation": "Plaintiff has no legs to stand on."
    },
    {
      "id": "cr4",
      "text": "Cited Privy Council: legitimate occasion for O XLI r27 when inherent lacuna apparent on examining evidence, not discovery outside court.",
      "addresses_issue": "i2",
      "key_observation": "True test: whether appellate court able to pronounce judgment without additional evidence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "District Judge not justified in admitting additional evidence under Order XLI rule 27 CPC as no lacuna in record and admitted before hearing appeal.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Entries in settlement registers spurious/subsequent interpolation; land in Pattar Kalan not proved ancestral.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "High Court could interfere as improper exercise of discretion in admitting evidence; finding not conclusive.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kessowji Issur v. G.I.P. Railway",
      "citation": "34 I.A. 115",
      "treatment": "followed",
      "relevance": "Legitimate occasion for Order XLI r.27 when inherent lacuna apparent on examining evidence."
    },
    {
      "case_name": "Parsotim v. Lal Mohan",
      "citation": "58 I.A. 254",
      "treatment": "followed",
      "relevance": "Reiterated view on application of Order XLI r.27."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order XLI rule 27",
        "section 100",
        "section 151",
        "Order XLI rule 27 (1)(b)"
      ],
      "relevance": "Governs admission of additional evidence in appeal; limits second appeal to specific grounds; discretion judicial not arbitrary."
    },
    {
      "name": "Punjab Act II of 1920",
      "sections": [
        "section 7"
      ],
      "relevance": "No person empowered to contest alienation of non-ancestral immovable property on ground contrary to custom."
    },
    {
      "name": "Indian Limitation Act",
      "sections": [
        "article 120"
      ],
      "relevance": "Suit within time."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court judgment dismissing suit in toto, holding additional evidence improperly admitted, entries spurious, properties not ancestral, and plaintiff unable to challenge will under custom for non-ancestral property.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The discretion to receive and admit additional evidence is not an arbitrary one, but is a judicial one circumscribed by the limitations specified in Order XLI, rule 27, of the Civil Procedure Code.",
      "speaker": "court",
      "significance": "Defines scope of appellate discretion on additional evidence."
    },
    {
      "text": "The true test, therefore, is whether the appellate court is able to pronounce judgment on the materials before it without taking into consideration the additional evidence sought to be adduced.",
      "speaker": "court",
      "significance": "Test for admitting additional evidence under O XLI r27."
    },
    {
      "text": "Even a superficial observation of the original documents leads one irresistibly to the conclusion that this entry was a subsequent interpolation.",
      "speaker": "court",
      "significance": "High Court observation on forgery, agreed by Supreme Court."
    }
  ],
  "_case_id": "1951_14",
  "_label": 0,
  "_text_length": 13935,
  "_extracted_at": "2026-02-08T22:15:48.366647"
}