{
  "metadata": {
    "case_name": "Legal Representatives of Haji Ali Mohamed Haji Cassum v. State of Bombay",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "MAHAJAN J."
    ],
    "case_number": "Civil Appeal No. 28 of 1950",
    "date_of_judgment": "1951-02-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Village Dahisar originally formed part of the Malad Estate comprising in all eight villages. The said estate was conveyed by the East India Company to two Dady brothers for valuable consideration by a deed of indenture dated the 25th January, 1819. By that conveyance all the lands in the eight villages were conveyed absolutely to the said purchasers and it was covenanted by the Company that the purchasers, their heirs and assigns shall peaceably and quietly enjoy the said villages and receive and take the rents and profits thereof without any hindrance or interruption from the said Company.",
      "type": "background",
      "date": "1819-01-25",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By a sale deed dated the 13th December, 1900, Haji Cassum, father of the plaintiff, purchased the village of Dahisar from its proprietors for a price of Rs. 1,30,000 and after his death the plaintiff became the proprietor thereof and as such received rents and assessment from the tenants and holders of the lands in the village according to the rights prevailing under the survey settlement which had taken place in the village about the year 1864-65.",
      "type": "background",
      "date": "1900-12-13",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "In the year 1879 the Bombay Land Revenue Code was enacted. Section 48 of the Code provides that land revenue shall be assessed with reference to use for agriculture, building, or other purposes, and where land assessed for one purpose is used for another, the assessment shall be liable to be altered.",
      "type": "background",
      "date": "1879",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After the Act came into force, the Government drafted rules under section 214. The inamdars represented that rules should not prejudice their rights under conveyances. Draft rules promulgated by notification on 5th June, 1907, with Government resolution assuring to amend or abrogate if detrimental to inamdars.",
      "type": "background",
      "date": "1907-06-05",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Rule 92: When land assessed for purposes of agriculture only is subsequently used for any purpose unconnected with agriculture the assessment upon the land so used shall, unless otherwise directed by Government, be altered under sub-section (2) of section 48 by the Collector in accordance with rules 81 to 87 inclusive.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On the 25th July, 1923, the plaintiff requested the Commissioner of Bombay Suburban District for a revision of the survey of Dahisar village. He executed an agreement under section 216 of the Bombay Land Revenue Code.",
      "type": "procedural",
      "date": "1923-07-25",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The Commissioner by letter dated 14th March, 1925, authorised extension of chapters 8 and 9 of the Land Revenue Code to the village. Plaintiff deposited necessary expenses.",
      "type": "procedural",
      "date": "1925-03-14",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Revision made by Superintendent of Land Records, report submitted 15th December, 1926, sanctioned by Government. Order communicated to plaintiff on 23rd December, 1927. Assessment increased from Rs. 4,217 to Rs. 6,057-3-2.",
      "type": "material",
      "date": "1927-12-23",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "At revision, nine plots in eleven field numbers formerly agricultural were built upon, formed into separate group as kharaba, no assessment levied.",
      "type": "material",
      "date": "1926",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On 30th April, 1934, plaintiff requested Collector to assess non-agricultural assessment on these nine plots. Refused by Collector on 17th July, 1935, stating request cannot be granted. No direction from Government to contrary existed.",
      "type": "material",
      "date": "1935-07-17",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Plaintiff appealed to Commissioner, pointing additional lands converted post-1926. Commissioner declined to interfere, conveyed 22nd May, 1937.",
      "type": "procedural",
      "date": "1937-05-22",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appeal to Governor in Council. On 20th December, 1937, Government confirmed Collector's action per Resolution No. 5235/3a dated 8th March, 1937.",
      "type": "procedural",
      "date": "1937-12-20",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Between 1927-37, large number of plots in Schedule II put to non-agricultural uses, buildings constructed.",
      "type": "material",
      "date": "1927-1937",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Plaintiff instituted suit after section 80 CPC notice for declaration of entitlement to non-agricultural assessment on all such lands, direction to Collector to assess and levy on Schedules I and II, or commission under s.88; damages Rs.120 for Sch I, Rs.300 for others.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Trial court negatived technical objections, held Collector's refusal wrongful, granted declaration, refused further relief.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "High Court modified: declaration for all lands, levy on Sch I with consequential damages, dismissed for Sch II distinguishing pre/post 1926 conversions.",
      "type": "procedural",
      "date": "1945-03-19",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Plaintiff died, legal representatives impleaded. Leave to Privy Council granted 7th February, 1947.",
      "type": "procedural",
      "date": "1947-02-07",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the plaintiff is entitled to a direction for levy of non-agricultural assessment on lands in Schedule II converted after 1926 survey, given Rule 92's imperative terms and absence of Government direction to the contrary.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Government's confirmation of Collector's refusal constitutes a 'direction' under Rule 92 to not alter assessment.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under 1819 conveyance covenants, Government cannot refuse alteration of assessment; bound as trustee for transferee.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Deed of indenture dated 25th January 1819"
    },
    {
      "id": "pa2",
      "text": "Government Resolution 5th June 1907 assured rules not to adversely affect inamdars; Collector bound to assess.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Government Resolution dated 5th June 1907"
    },
    {
      "id": "pa3",
      "text": "Government never exercised power under Rule 92 to direct contrary; mere affirmation of Collector's erroneous order not a direction.",
      "supporting_facts": [
        "f10",
        "f12"
      ],
      "legal_basis": "Rule 92, Bombay Land Revenue Code"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Action of survey officer and Collector in refusing non-agri assessment lawful; civil court cannot question Government's discretion.",
      "supporting_facts": [
        "f10",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Government confirmation of Collector's action via Resolution 8th March 1937 amounts to direction under Rule 92.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Rule 92; Government Resolution No. 5235/3a dated 8th March 1937"
    },
    {
      "id": "ra3",
      "text": "Section 48(2) and Rule 92 do not obligate Government to levy altered assessment; liability on possessors but discretionary.",
      "supporting_facts": [],
      "legal_basis": "Section 48(2), Rule 92, Bombay Land Revenue Code"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 92 in imperative terms directs Collector to alter assessment unless otherwise directed by Government; Collector contravened by refusing without direction.",
      "addresses_issue": "i1",
      "key_observation": "Collector has no option; must proceed upon application."
    },
    {
      "id": "cr2",
      "text": "No resolution or notification under Rule 92 directing contrary; Commissioner's and Government's actions contravened rule.",
      "addresses_issue": "i2",
      "key_observation": "Confirmation of erroneous order not a clear direction affecting civil rights."
    },
    {
      "id": "cr3",
      "text": "High Court erred in assuming confirmation amounts to direction; power must be exercised in clear terms and notified.",
      "addresses_issue": "i2",
      "key_observation": "Dismissal of appeal not action under Rule 92."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court's refusal of relief for Schedule II lands reversed; plaintiff entitled to direction for altered non-agricultural assessment, levy, and payment.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Government's mere affirmation of Collector's order does not constitute a 'direction' under Rule 92.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bombay Land Revenue Code",
      "sections": [
        "Section 48",
        "Section 216",
        "Section 88",
        "Rule 92",
        "Rules 81 to 87"
      ],
      "relevance": "Imposes duty on Collector to alter assessment for non-agricultural use unless directed otherwise by Government; imperative unless contrary direction given."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 80"
      ],
      "relevance": "Notice served before suit."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court reversed High Court's refusal of relief for Schedule II lands, holding plaintiff entitled to direction for State to assess, levy non-agricultural assessment on those lands and pay to plaintiff. No controversy on reliefs already granted by High Court for Schedule I.",
    "relief_granted": "Direction to State Government to make altered assessment on Schedule II lands, levy and pay to plaintiff.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Rule 92 cited in the earlier part of this judgment is in imperative terms directs the Collector to alter the assessment in case agricultural lands are converted to non-agricultural use. The Collector has no option in the matter\"",
      "speaker": "court",
      "significance": "Core holding on mandatory nature of Rule 92."
    },
    {
      "text": "\"When Government has been given the power to give directions to the Collector not to act in accordance with the imperative provisions of a rule which enjoin upon him to make the altered assessment, that power has to be exercised in clear and unambiguous terms\"",
      "speaker": "court",
      "significance": "Explains why confirmation is not a valid direction."
    }
  ],
  "_case_id": "1951_11",
  "_label": 1,
  "_text_length": 18294,
  "_extracted_at": "2026-02-10T19:18:51.036068"
}