{
  "metadata": {
    "case_name": "Appellants (Defendants 1st Party) v. Maharaja of Gidhaur",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "Fazal Ali J."
    ],
    "case_number": "Civil Appeal No. 29 of 1950",
    "date_of_judgment": "1951-05-02"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plaintiff, the Maharaja of Gidhaur, is the proprietor of an impartible estate known as Gidhaur raj in the district of Monghyr.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Ancestors of the defendants 1st party originally held a 4 annas share in a ghatwali tenure known as Mahal Dumri Nisf Katauna T. No. 325, and subsequently by private partition they were allotted mouza Dumri with its 47 tolas which are detailed in schedule I of the plaint.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In execution of a mortgage decree obtained by one Chethru Rai against the ancestors of defendants 1st party, their interest was purchased by the Maharaja of Gidhaur in the name of one of his employees, and the latter took delivery of possession of the property on the 19th April, 1904.",
      "type": "material",
      "date": "1904-04-19",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On the 13th August, 1903, the ancestors of the defendants 1st party filed an application for setting aside the sale which was dismissed by the executing court and the appeal from the order of the executing court was dismissed by the High Court as well as by the Privy Council.",
      "type": "procedural",
      "date": "1903-08-13",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After certain disputes in the criminal courts, the defendants second party alleging themselves to be the lessees of the defendants first party, obtained a mining license in 1937 from the sub-divisional officer of Jamui.",
      "type": "material",
      "date": "1937",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The District Magistrate apprehending a breach of the peace, started proceedings under section 144 of the Criminal Procedure Code, which ended in favour of the defendants first and second parties and against the plaintiff.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Emboldened by the order in the proceedings under section 144, the defendants started working mines in the tolas mentioned in schedule II of the plaint and extracted a considerable quantity of mica.",
      "type": "disputed",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f8",
      "text": "Plaintiff instituted suit No. 10 of 1941 for declaration of subsoil rights with regard to the entire Mahal Dumri, recovery of possession of the mortgage lands situated in the tolas specified in schedule II of the plaint, mesne profits and permanent injunction restraining defendants first and second parties from extracting mica or other underground minerals from lands in schedule II.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The four annas interest in village Dumri was a ghatwali tenure granted to the ancestors of the defendants first party by Muhammadan rulers to guard the hill passes in the taluka, and the grant under which they held was affirmed subsequently by Captain Browne.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Plaintiff had been in possession of the property since he purchased it in 1903 until the order of the District Magistrate made in 1938.",
      "type": "material",
      "date": "1903 to 1938",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Subordinate Judge of Monghyr decreed the suit on 28th February, 1942, holding disputed tenure was zamindary ghatwali tenure, not inalienable, plaintiff entitled to mineral and subsoil rights.",
      "type": "procedural",
      "date": "1942-02-28",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court of Patna affirmed on 10th October, 1945 in Appeal No. 64 of 1942, with modification that even if defendant No. 1 had subsoil rights, they passed at mortgage-sale of 1903; adverse possession not proved.",
      "type": "procedural",
      "date": "1945-10-10",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the ghatwali tenure held by defendants first party was a zamindary ghatwali or a Government ghatwali, and consequently whether it was inalienable and no title passed to plaintiff by auction purchase in 1903.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the plaintiff's suit was barred by limitation under articles 142 and 144 of the Limitation Act due to adverse possession by defendants.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The ghatwali tenure is a Government ghatwali granted by Muhammadan rulers and affirmed by Captain Browne, hence inalienable, and no title passed to plaintiff by auction-purchase in 1903 as property was Government ghatwali tenure.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": "Ghatwali sanad Exhibit C-1 dated 1776; Captain Browne's India Tracts"
    },
    {
      "id": "pa2",
      "text": "Defendant No. 1 and ancestors exercised rights of possession over mines and minerals for more than 12 years prior to suit in assertion of ghatwali right to knowledge of plaintiff, acquiring indefeasible right by adverse possession.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Articles 142 and 144 of the Limitation Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Plaintiff as 16 annas proprietor of Dumri Nisf Katauna has indefeasible right to all underground minerals including mica; all titles and interest in 4 annas mokrari shares of ancestors of defendant 1st party acquired by plaintiff's ancestor by auction purchase in 1903.",
      "supporting_facts": [
        "f1",
        "f3",
        "f4"
      ],
      "legal_basis": "Paragraph 12 of the plaint"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Ghatwali tenure is zamindary ghatwali, not Government ghatwali, based on construction of sanad Exhibit C-1 (authority to collect ghatwari fees, not grant of land), proceedings before Dewani Adalat of Ramgarh (tenure under zamindar of Gidhaur), judgment of 1799 appellate court, report of Khadim Muhammad Ataullah, Bengal District Gazetteer, inclusion in Permanent Settlement and Record of Rights as istemrari mokrari under zamindar.",
      "addresses_issue": "i1",
      "key_observation": "Appellant failed to rebut presumption by clear evidence; tenure dependent on zamindary."
    },
    {
      "id": "cr2",
      "text": "Concurrent findings of courts below against adverse possession fully discussed with cogent reasons; no exceptional circumstances to re-examine.",
      "addresses_issue": "i2",
      "key_observation": "No clear evidence of mine working; at utmost isolated acts since 1935."
    },
    {
      "id": "cr3",
      "text": "Plaintiff's suit not barred under Article 142 as plaintiff proved possession within 12 years.",
      "addresses_issue": "i2",
      "key_observation": "Plea negatived."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Disputed tenure is zamindary ghatwali, alienable; title to subsoil rights passed to plaintiff via auction purchase in 1903.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No adverse possession established; suit not barred by limitation.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rani Sonabati Kumari v. Raja Kirtyanand Singh",
      "citation": "I.L.R. 14 Patna 70",
      "treatment": "followed",
      "relevance": "Elaborate discussion on meaning of ghatwal and ghatwali tenure, distinguishing Government and zamindary ghatwali."
    },
    {
      "case_name": "Kali Prasad v. Ananda Rai",
      "citation": "15 I.A. 18",
      "treatment": "followed",
      "relevance": "Power of alienation of ghatwali forms integral portion of right, not limited to life."
    },
    {
      "case_name": "Fulbati Kumari v. Maheshwari Prasad",
      "citation": "A.I.R. 1923 Patna 453",
      "treatment": "followed",
      "relevance": "Construes same sanad Exhibit C-1 as authority to collect fees, not grant of land; references to Dewani Adalat proceedings."
    },
    {
      "case_name": "Narayan Singh v. Niranjan Chakravarti",
      "citation": "51 I.A. 37",
      "treatment": "referred",
      "relevance": "Contrasts with other sanads granting extensive land directly to ruling power."
    },
    {
      "case_name": "Raja Lelanund Singh Bahadoor v. The Bengal Government",
      "citation": "6 Moores I.A. 101",
      "treatment": "followed",
      "relevance": "Ghatwali lands included in zamindary Permanent Settlement raise presumption of dependence on zamindary."
    },
    {
      "case_name": "Raja Nilmoni Singh v. Bakranath Singh",
      "citation": "9 I.A. 104",
      "treatment": "distinguished",
      "relevance": "Permanent Settlement does not affect nature of tenancy or convert public services to private."
    }
  ],
  "statutes_cited": [
    {
      "name": "Limitation Act",
      "sections": [
        "Article 142",
        "Article 144"
      ],
      "relevance": "Applied to plea of adverse possession and suit for possession; suit held not barred."
    },
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "Section 144"
      ],
      "relevance": "Proceedings ended in favour of defendants, emboldening them to work mines."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding concurrent findings of courts below that the tenure is zamindary ghatwali tenure, alienable, title passed to plaintiff in 1903 auction purchase, entitled to subsoil rights, no adverse possession proved, suit not barred by limitation.",
    "relief_granted": "Declaration of title and possession to subsoil rights, mesne profits, permanent injunction as decreed by lower courts.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Literally a ghatwal means a guard of the passes and the term ghatwali tenure was applied by the Moghuls to lands assigned at a low rent or free of rent for guarding the mountain passes...\"",
      "speaker": "court",
      "significance": "Defines ghatwali tenure from Rani Sonabati Kumari case."
    },
    {
      "text": "\"A Government ghatwali is thus a tenure created by the ruling power... whereas a zamindary ghatwali is a tenure created by a zamindar for ghatwali services to be rendered to him.\"",
      "speaker": "court",
      "significance": "Distinguishes types of ghatwali, central to issue."
    },
    {
      "text": "\"It is not a grant of land but an authority to the persons named to collect... ghatwali fees or tolls from those using the roads and passes which the ghatwals undertook to protect.\"",
      "speaker": "court",
      "significance": "Construction of sanad Exhibit C-1."
    }
  ],
  "_case_id": "1951_32",
  "_label": 0,
  "_text_length": 26753,
  "_extracted_at": "2026-02-10T19:19:42.858259"
}