{
  "metadata": {
    "case_name": "Appellants (Hiranand Jha's plaintiffs) v. Respondents (Singha defendants)",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "MAHAJAN J."
    ],
    "case_number": "Civil Appeal No. 40 of 1950",
    "date_of_judgment": "1951-02-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Village Darha belonged to a family of Pathaks as their ancestral lakhraj. Over a hundred years ago the Pathaks granted the entire village in mokarrari to the ancestors of the family of Singhas (defendants first and second parties) at an annual jama of Rs. 24.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The mokarrari interest eventually devolved on three branches of the Singha family: Parameshwar Dayal and others (defendants first party) to the extent of six annas; Bisheswar Dayal Singh (defendants second party) to the extent of eight annas; Madho Saran Singh to the extent of two annas.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Subsequently, the two anna share of Madho Saran Singh was purchased by Hiranand Jha, father of the plaintiffs, jointly with Durganand Jha and Dharam Dayal. Dharam Dayal was a mere benamidar for Hiranand Jha.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On the 5th June, 1916, Bisheshwar Dayal Singh purchased six anna share in the lakhraj interest from Deolal Pathak and others.",
      "type": "material",
      "date": "1916-06-05",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On the 9th February, 1917, Bisheshwar Dayal Singh purchased another two anna share in the lakhraj interest from Mandil Pathak. By virtue of these purchases he came to own the lakhraj interest to the extent of eight anna share. He already held the mokarrari interest to the same extent which had devolved on him by inheritance.",
      "type": "material",
      "date": "1917-02-09",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Some time in the year 1917 or 1918 Hiranand Jha and Durganand Jha, who had acquired by purchase two anna mokarrari interest of Madho Saran Singh, purchased in execution of a rent decree the raiyati interest in the whole village and came into possession of it. They thus became mokarraridars of two anna share and raiyats of sixteen annas of the village lands.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In the year 1918, Title Suit No. 59 of 1918 was instituted in the court of the Subordinate Judge of Palamau for partition of the lands situate in several villages and belonging to the family of the defendants first and second parties. The Jhas were impleaded as defendants in the suit, being co-sharers in part of the property in suit. This suit was decreed in the year 1921, and in the final partition an allotment of two annas share in Darha village was made in their favour. The remaining fourteen anna share excluding khatian 1, 3 and 6 was allotted to the defendants first party. These three khatians were allotted to Bisheshwar Dayal Singh and in exchange for the remaining portions of his interest in that village he was given some property in village Holeya.",
      "type": "procedural",
      "date": "1921",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Some time about the year 1926 the lakhraj interest holders, i.e., the Pathaks and Bisheshwar Dayal Singh, were in default in the payment of the cess due to Government. On the 17th August, 1926, proceedings were taken against them for recovery of the cess and their interest was sold in execution of a certificate on the 18th October, 1927, to one Bijainandan Sahay. The sale obviously was of the lakhraj interest. This was confirmed on the 19th December, 1927, and a sale certificate was issued on the 20th March, 1928. This was followed by delivery of possession on 15th July, 1928. Possession was obtained by one Kamta Prasad who had acquired this interest from Bijainandan Sahay on the 20th April, 1928.",
      "type": "material",
      "date": "1927-10-18",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On the 1st May, 1933, Kamta Prasad transferred his interest in the village to the plaintiffs who thus became proprietors of sixteen anna share in the village and mokarraridars as to two anna share and raiyats of the entire sixteen annas in the whole village.",
      "type": "material",
      "date": "1933-05-01",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On the 21st September, 1934, the defendants first party as mokarraridars brought a suit against the plaintiffs for arrears of raiyati rent for the years 1338-39 F. to the extent of six annas share and for the years 1340-41 F. to the extent of fourteen anna share claiming that under the partition decree they got a fourteen anna share in the mokarrari interest in the village. Plaintiffs contested the suit alleging that Bisheshwars mokarrari interest had merged in the lakhraj interest that was purchased by him from the Pathaks in the years 1916-17, and that by the sale under the Governments certificate his whole eight anna interest in the village including both the lakhraj and the mokarrari had passed on to the plaintiffs and that the defendants first party could only claim rent from them to the extent of the six anna share in the mokarrari. This plea was disallowed and the defendants first partys claim for rent was decreed in full. The decree was upheld on appeal and second appeal. The question of title was, however, left open.",
      "type": "procedural",
      "date": "1934-09-21",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "In the year 1938 another suit for rent was filed by the defendants first party as mokarraridars to recover fourteen anna share of the rent for the years subsequent to fasli 1341.",
      "type": "procedural",
      "date": "1938",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Suit No. 9 of 1939 instituted in the Court of the Subordinate Judge of Palamau by the appellants against the respondents for a number of declarations in respect to the title to certain lands and for an injunction restraining the respondents from proceeding with a rent suit. The suit was decreed by the Subordinate Judge but on appeal this decision was reversed by the High Court of Judicature at Patna and the appellants suit was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "In the plaint, it was alleged that there was a private partition between the mokarraridars by virtue of which the lands of village Darha were divided between the three sets of mokarraridars, each set being in separate possession of its own separate and defined shares. It was also pleaded that there was another partition between the proprietors of the lakhraj interest, that is, between Bisheshwar Dayal Singh on the one hand and Deolal Pathak, Neman Pathak and Surajnath Pathak on the other, by virtue of which the lands that were in mokarrari pattis of Parmeshwar Dayal Singh and others and Hiranand Jha and Durganand Jha fell in the patti of Deolal Pathak and others, while, the lands that were in the mokarrari patti of the defendants second party fell in his proprietary lakhraj patti.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "The trial Judge held that both the partitions alleged by the plaintiffs in paragraphs 5 and 8 of their plaint were proved and that the mokarrari interest of Bisheshwar Dayal Singh merged in his lakhraj interest and that at the certificate sale the purchaser acquired his complete interest both lakhraj and mokarrari along with the eight anna lakhraj interest of the Pathaks and that the defendants first party were mokarraridars of six anna interest in the village.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "The High Court in appeal held that neither of the partitions alleged by the plaintiffs were proved and that the mokarrari interest of eight annas could not merge in the lakhraj interest of sixteen annas held jointly by Bisheshwar Dayal Singh with the Pathaks. As a result of this decision the plaintiffs suit was dismissed.",
      "type": "procedural",
      "date": "1946-02-14",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the eight anna mokarrari interest of Bisheshwar Dayal Singh merged in his eight anna lakhraj interest acquired by purchase from Pathaks, such that by the certificate sale of lakhraj interest, his entire interest including mokarrari passed to the purchasers, leaving defendants first party with only six anna mokarrari interest.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the alleged private partitions inter se among mokarraridars and among lakhraj proprietors were proved and affected the merger or integrity of the lease.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court had erroneously held that the two partitions set up by the plaintiffs in paragraphs 5 and 8 had not been proved. The evidence on the record, both documentary and oral, fully established the fact of the two partitions and that in view of these partitions it should have been held that Bisheshwar Dayal Singh became separate owner of eight anna lakhraj interest and in that interest his mokarrari interest of eight annas merged, and that under the certificate sale the whole of this interest passed on to the purchaser.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Doctrine of merger"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Neither of the partitions alleged by the plaintiffs were proved and the mokarrari interest of eight annas could not merge in the lakhraj interest of sixteen annas held jointly by Bisheshwar Dayal Singh with the Pathaks.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "There was no scope for the application of the doctrine of merger to the facts disclosed by the plaintiffs in their plaint. If the lessor purchases the lessees interest, the lease no doubt is extinguished as the same man cannot at the same time be both a landlord and a tenant, but there is no extinction of the lease if one of the several lessees purchases only a part of the lessors interest. In such a case the leasehold and the reversion cannot be said to coincide.",
      "addresses_issue": "i1",
      "key_observation": "Bisheshwar Dayal Singh purchased only a part (eight annas) of the entire lakhraj reversion and never came to own the entire lakhraj interest or the entire mokarrari interest; thus no coalescence."
    },
    {
      "id": "cr2",
      "text": "Mere purchase by Bisheshwar Dayal Singh of portions of the lakhraj interest could not bring about an extinction of the lease or break its integrity as he was only one of the several joint holders of the mokarrari interest. An inter se partition of the mokarrari interest amongst the mokarraridars could not affect their liability qua the lessor for the payment of the whole rent, as several tenants of a tenancy in law constitute but a single tenant.",
      "addresses_issue": "i2",
      "key_observation": "Inter se partitions do not affect the integrity of the lease or tenancy; no severance of tenancy qua landlord alleged."
    },
    {
      "id": "cr3",
      "text": "The allegation of partition inter se among the several owners of the lakhraj holding could not in any way affect the integrity of the lease in the absence of an allegation of a fresh contract between the split up owners of the holding and the different owners in the mokarrari interest. The lakhraj holding in the village still remains a single holding.",
      "addresses_issue": "i2",
      "key_observation": "All owners of lakhraj interest jointly responsible for cess; default led to sale of whole lakhraj."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The mokarrari interest of Bisheshwar Dayal Singh did not merge in his lakhraj interest; there was no coalescence of the interest of the lessor and the lessee in the whole of the estate.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Inter se partitions among mokarraridars or lakhraj owners do not affect the integrity of the mokarrari lease or bring about merger.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "White v. Tyndall",
      "citation": "13 App. Cas. 263",
      "treatment": "referred",
      "relevance": "Several tenants of a tenancy constitute but a single tenant qua the landlord; they hold as tenants in common but covenant to pay one rent."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed on the short point that there was no scope for merger of Bisheshwar Dayal Singh's mokarrari interest in his partial lakhraj interest, as he did not acquire the entire reversion and inter se partitions do not affect lease integrity. The High Court's dismissal of the suit upheld.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "This appeal can be disposed of on a short point without taking into consideration the respective contentions of the parties raised before us or urged in the two courts below. The plaintiffs case rests solely on the allegation of merger of the eight anna lakhraj interest of Bisheshwar Dayal Singh with his mokarrari interest to the same extent.",
      "speaker": "court",
      "significance": "Introduces the decisive short point rejecting merger."
    },
    {
      "text": "If the lessor purchases the lessees interest, the lease no doubt is extinguished as the same man cannot at the same time be both a landlord and a tenant, but there is no extinction of the lease if one of the several lessees purchases only a part of the lessors interest.",
      "speaker": "court",
      "significance": "Core explanation of merger doctrine limits."
    },
    {
      "text": "In the words of Lord Halsbury in White v. Tyndall, the parties to whom a demise is made hold as tenants in common but what they covenant to pay is one rent, not two rents and not each to pay half a rent but one rent.",
      "speaker": "court",
      "significance": "Supports that joint tenants form single tenancy qua landlord."
    }
  ],
  "_case_id": "1951_8",
  "_label": 0,
  "_text_length": 14133,
  "_extracted_at": "2026-02-10T19:19:01.539292"
}