{
  "metadata": {
    "case_name": "Companion appeals from judgments of the High Court of East Punjab (Appellants v. State)",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "Kania, C.J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Jullundur Wholesale Cloth Syndicate was formed by wholesale dealers holding licences to distribute government-controlled cloth to retail holders in the district.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Government allotted quotas to retailers; unlifted bales could be given to other retail dealers per Notification of 4th October 1950 by Government of India, Department of Industries and Supplies.",
      "type": "background",
      "date": "1950-10-04",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Prices for wholesale and retail cloth fixed by government orders.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Syndicate suspected of black-marketing; warned several times by District Magistrate of Jullundur.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Order issued by District Organiser, Civil Supplies and Rationing, Jullundur on 7th June 1951 forbidding disposal of unlifted stock without prior written permission; to be sold only to associations of retailers, not individuals.",
      "type": "procedural",
      "date": "1951-06-07",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Cotton Cloth Control Order in operation prior to 1950; control on distribution lifted temporarily but price control remained; appellants and others alleged to have sold cloth at higher rates.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Manufacturing mills allowed to sell certain percentage of cloth as 'free sale cloth' at fixed prices outside government control; appellants alleged to black-market this.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "District Magistrate passed detention order under section 3(2) of Preventive Detention Act on 19th June 1951 to prevent appellants from acting prejudicial to maintenance of supplies of cloth essential to community.",
      "type": "procedural",
      "date": "1951-06-19",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On 2nd July 1951, District Magistrate directed appellants be committed to District Jail Jullundur from 2nd July until 1st October 1951.",
      "type": "procedural",
      "date": "1951-07-02",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Grounds of detention served to appellants on morning of 6th July 1951; alleged black-marketing from June 1949 to October 1950 when distribution control removed; continued after reimposition including frozen cloth; individual activities in firms disposing stocks in black market (free sale cloth); deprived rightful claimants for black market.",
      "type": "material",
      "date": "1951-07-06",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Petitions under Article 226 filed in East Punjab High Court on 9th July 1951 for habeas corpus alleging illegal detention.",
      "type": "procedural",
      "date": "1951-07-09",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "District Magistrate filed affidavit denying mala fides, detailing activities, asserting satisfaction based on reports.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Early August 1951, executive authorities cancelled licences of appellants as cloth dealers.",
      "type": "procedural",
      "date": "1951-08",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "High Court dismissed petitions; appeals to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Further affidavit of District Magistrate dated 1st August 1951 detailing free sale cloth availability post 9th June 1951, transport without permit, imports, beliefs about appellants' activities in free sale cloth, benami possibilities.",
      "type": "disputed",
      "date": "1951-08-01",
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "Affidavits by relations of appellants (not detainees) alleging no service of 19th June order, no reference to section or satisfaction in 2nd July order; based on belief, no personal knowledge.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "District Magistrate affidavit states terms of 19th June order fully explained to each detenu.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "One appellant is secretary of corporation; another salesman/clerk in firm; alleged to participate actively in black market.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Legality of detention under section 3(2) of Preventive Detention Act for preventing black-marketing in cloth.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether past activities alone can justify subjective satisfaction for detention.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether 7th June 1951 order sealed loopholes preventing further black-marketing.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether cancellation of licences post-detention negates need for detention.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether detention orders properly served and containing required elements.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Grounds refer only to activities prior to June 1951; cannot justify future prevention.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Preventive Detention Act (detention for future acts, not punishment for past)"
    },
    {
      "id": "pa2",
      "text": "Loophole in control sealed by District Organiser's order of 7th June 1951; no black-marketing possible thereafter.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Licences cancelled; cannot deal in cloth; detention punitive, not preventive.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Preventive Detention Act (preventive, not punitive)"
    },
    {
      "id": "pa4",
      "text": "Detention order of 2nd July lacks section reference or satisfaction statement; 19th June order not served.",
      "supporting_facts": [
        "f9",
        "f16"
      ],
      "legal_basis": "Preventive Detention Act s.3(2)"
    },
    {
      "id": "pa5",
      "text": "Secretary and clerk appellants could not indulge in black market.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Past activities relevant to form subjective satisfaction of District Magistrate that detention necessary.",
      "supporting_facts": [
        "f10",
        "f4",
        "f7"
      ],
      "legal_basis": "Preventive Detention Act s.3"
    },
    {
      "id": "ra2",
      "text": "7th June order administrative warning, at variance with 4th Oct 1950 notification; free sale cloth still available for black-marketing.",
      "supporting_facts": [
        "f5",
        "f2",
        "f7",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Licence cancellation does not prevent black-marketing via benami licences, other districts, free sale cloth imports.",
      "supporting_facts": [
        "f13",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "19th June order terms explained to detenus; 2nd July commitment order valid.",
      "supporting_facts": [
        "f8",
        "f9",
        "f17"
      ],
      "legal_basis": "Preventive Detention Act"
    },
    {
      "id": "ra5",
      "text": "Secretary and clerk actively participated in principals' black market and own activities.",
      "supporting_facts": [
        "f18",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court approached correctly; past activities relevant for subjective conviction of likely future objectionable acts; sufficiency of grounds not for court.",
      "addresses_issue": "i2",
      "key_observation": "Legislature made only subjective satisfaction essential; not justiciable even with Advisory Board."
    },
    {
      "id": "cr2",
      "text": "7th June order does not seal loopholes; administrative, conflicts with Oct 1950 clause; free sale cloth still black-marketable.",
      "addresses_issue": "i3",
      "key_observation": "Free sale cloth from mills procurable without restriction, transportable across districts."
    },
    {
      "id": "cr3",
      "text": "Licence cancellation post-detention does not preclude black-marketing via benami, other districts, free sale cloth.",
      "addresses_issue": "i4",
      "key_observation": "Common knowledge licences obtainable in nominees' names."
    },
    {
      "id": "cr4",
      "text": "Affidavits of relations lack personal knowledge; District Magistrate's affidavit states explanation given; no reason to doubt.",
      "addresses_issue": "i5",
      "key_observation": "Petitions filed soon after service."
    },
    {
      "id": "cr5",
      "text": "Secretary/clerk participated actively; truth for Advisory Board, not court.",
      "addresses_issue": "i1",
      "key_observation": "Disputes to be considered by Advisory Board."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Detention under s.3(2) Preventive Detention Act valid based on subjective satisfaction from past activities.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Court cannot examine sufficiency of grounds or truth of facts; jurisdiction of detaining authority.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Preventive Detention Act, 1950",
      "sections": [
        "Section 3(2)"
      ],
      "relevance": "Authorizes District Magistrate to detain if satisfied necessary to prevent prejudicial acts to supplies; requires report and grounds to government."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for High Court petitions for habeas corpus."
    },
    {
      "name": "Essential Supplies (Temporary Powers) Act",
      "sections": [],
      "relevance": "Basis for Punjab Control Cloth Order."
    },
    {
      "name": "Cotton Cloth Control Order",
      "sections": [],
      "relevance": "Controlled distribution and prices of cloth."
    },
    {
      "name": "Government of India Notification dated 4th October 1950",
      "sections": [
        "Clause 5"
      ],
      "relevance": "Allowed wholesale syndicate to sell unlifted cloth to other retailers or associations."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals, upholding the High Court's dismissal of habeas corpus petitions and validating the detentions under the Preventive Detention Act as the subjective satisfaction of the District Magistrate was not justiciable and arguments against ongoing risk failed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Legislature has made only the subjective satisfaction of the authority making the order essential for passing the order.",
      "speaker": "court",
      "significance": "Core holding on non-justiciability of detention grounds."
    },
    {
      "text": "Instances of past activities are relevant to be considered in giving rise to the subjective mental conviction of the District Magistrate that the appellants were likely to indulge in objectionable activities.",
      "speaker": "court",
      "significance": "Justifies use of pre-detention facts for preventive detention."
    },
    {
      "text": "It is common knowledge that licences can be obtained in the name of nominees.",
      "speaker": "court",
      "significance": "Explains why licence cancellation does not end black-marketing risk."
    }
  ],
  "_case_id": "1951_73",
  "_label": 0,
  "_text_length": 16370,
  "_extracted_at": "2026-02-10T19:19:47.196134"
}