{
  "metadata": {
    "case_name": "First Defendant v. First Respondent",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "Fazl Ali J."
    ],
    "case_number": "Appeal from Original Suit No. 1 of 1945",
    "date_of_judgment": "1951-02-09"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The first defendant owned a bungalow in Mercara known as Morvern Lodge.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The first defendant owned certain estates in Mercara; Mr. White was an alternate director in one of the estates; Youngman was the manager of another estate belonging to the first defendant and was looking after Morvern Lodge during his absence.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "About the middle of 1944, the plaintiff asked White if he would cable to the first defendant his offer of Rs. 4,000 for the bungalow.",
      "type": "material",
      "date": "1944-06",
      "source": "plaintiff"
    },
    {
      "id": "f4",
      "text": "On 1st June 1944, White sent a cable to the first defendant: 'Have enquiries Mercara bungalow if for sale, wire lowest figure.'",
      "type": "material",
      "date": "1944-06-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On 24th July 1944, the plaintiff wrote to the first defendant that he was prepared to purchase the bungalow for Rs. 5,000 and if acceptable, inform to which bank to issue cheque.",
      "type": "material",
      "date": "1944-07-24",
      "source": "plaintiff"
    },
    {
      "id": "f6",
      "text": "Youngman sent a cable to the first defendant: 'Have had offer Morvern Lodge rupees six thousand for immediate possession.'",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Cable sent by first defendant on 5th August 1944, received by Youngman on 8th August 1944: 'Wont accept less than rupees ten thousand.'",
      "type": "material",
      "date": "1944-08-05",
      "source": "first defendant"
    },
    {
      "id": "f8",
      "text": "On 7th August 1944, plaintiff wrote to Youngman asking whether his offer had been accepted and saying prepared to accept any higher price if reasonable.",
      "type": "material",
      "date": "1944-08-07",
      "source": "plaintiff"
    },
    {
      "id": "f9",
      "text": "On 8th August 1944, first defendant sent airgraph to Youngman explaining cables received and wired 'Wont accept less than Rs. 10,000.'",
      "type": "material",
      "date": "1944-08-08",
      "source": "first defendant"
    },
    {
      "id": "f10",
      "text": "On 9th August 1944, Youngman wrote to plaintiff: received cable from Col. MacPherson 'Wont accept less than rupees ten thousand MacPherson.'",
      "type": "material",
      "date": "1944-08-09",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Plaintiff stated in plaint that Youngman's letter received on 14th August 1944 and immediately accepted the counter-offer in writing to Youngman.",
      "type": "disputed",
      "date": "1944-08-14",
      "source": "plaintiff"
    },
    {
      "id": "f12",
      "text": "In evidence, plaintiff stated he met Youngman on 11th August 1944 after receiving letter, told him personally would pay Rs. 10,000, require immediate delivery; agreed to bear conveyance charges.",
      "type": "disputed",
      "date": "1944-08-11",
      "source": "plaintiff"
    },
    {
      "id": "f13",
      "text": "On 14th August 1944, plaintiff wrote to Youngman: 'I hereby confirm my oral offer of ten thousand for the bungalow... hurry up with consultation with lawyers at Madras and make arrangements to receive the money and hand over the bungalow.'",
      "type": "material",
      "date": "1944-08-14",
      "source": "plaintiff"
    },
    {
      "id": "f14",
      "text": "On 17th August 1944, Subbayya wrote to Youngman confirming offer of Rs. 10,500 made previous day for bungalow, expected cabled to first defendant.",
      "type": "material",
      "date": "1944-08-17",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On 26th August 1944, Youngman cabled first defendant: 'Offered ten thousand Morvern Lodge immediate possession. May I sell.'",
      "type": "material",
      "date": "1944-08-26",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "On 26th August 1944, White cabled first defendant: 'Hold offer for Morvern Bungalow rupees eleven thousand cash subject immediately acceptance and occupation. Strongly recommend acceptance.'",
      "type": "material",
      "date": "1944-08-26",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "On 29th August 1944, Youngman sent airgraph to first defendant: thanked for airgraph of 8th Aug; cabled Rs. 10,000 from previous Rs. 6,000 offerer; White cabled Rs. 11,000 same day; expect accepted White's; arrange Power-of-Attorney.",
      "type": "material",
      "date": "1944-08-29",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "First defendant cabled White: 'Accept rupees eleven thousand Morvern Lodge occupation permitted when full amount deposited my account Mercantile Bank Madras inform Youngman.'",
      "type": "material",
      "date": null,
      "source": "first defendant"
    },
    {
      "id": "f19",
      "text": "Second defendant paid Rs. 11,000 and occupied the bungalow.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Suit instituted by plaintiff for specific performance of alleged contract of sale of bungalow.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Judicial Commissioner of Coorg held there was concluded contract but awarded Rs. 3,000 as compensation instead of specific performance.",
      "type": "procedural",
      "date": "1946-04-01",
      "source": "lower_court"
    },
    {
      "id": "f22",
      "text": "First defendant appealed after obtaining certificate under section 109(c) of CPC; plaintiff filed no appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Youngman frankly stated in evidence he felt improper to entertain Subbayya's higher offer and did not communicate it; if any leaning, in favour of plaintiff.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in view of the correspondence, it could be held that there was a concluded contract for the sale of Morvern Lodge in favour of the plaintiff on the 14th August 1944.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The first defendant's cable of 5th August 1944 was not a counter-offer but merely stating he would not accept less than Rs. 10,000, inviting offers; no concluded contract.",
      "supporting_facts": [
        "f7",
        "f13",
        "f15"
      ],
      "legal_basis": "Harvey v. Facey"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The cable sent by first defendant on 5th August 1944 was a counter-offer made through Youngman to plaintiff, and contract complete on acceptance.",
      "supporting_facts": [
        "f7",
        "f11",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "By 26th August 1944, Youngman under influence of rival bidder or White; cable deliberately framed to prejudice plaintiff.",
      "supporting_facts": [
        "f15",
        "f16"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Difficult to hold there was concluded contract on 14th August 1944; supported by Harvey v. Facey where similar facts, Privy Council held no contract as mere statement of lowest price not offer to sell.",
      "addresses_issue": "i1",
      "key_observation": "First defendant's cable merely stated lowest price, everything else left open; plaintiff's reply was offer requiring acceptance."
    },
    {
      "id": "cr2",
      "text": "Plaintiff's letter of 14th August confirmed 'my oral offer' not accepted counter-offer; Youngman's cable of 26th August stated 'offered ten thousand... May I sell?'; neither treated as counter-offer.",
      "addresses_issue": "i1",
      "key_observation": "Parties proceeded on footing plaintiff made offer of Rs. 10,000 subject to first defendant's acceptance."
    },
    {
      "id": "cr3",
      "text": "No evidence supports contention Youngman influenced by rival; Youngman did not communicate Subbayya's offer, leaned towards plaintiff.",
      "addresses_issue": "i1",
      "key_observation": "Youngman rightly thought no transaction could be concluded without first defendant's express assent."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "There was no concluded contract for sale of Morvern Lodge in favour of plaintiff on 14th August 1944.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Harvey v. Facey",
      "citation": "1893 A.C. 552",
      "treatment": "followed",
      "relevance": "Facts similar; held mere statement of lowest price not unconditional offer to sell; supports no concluded contract here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 109(c)"
      ],
      "relevance": "Certificate obtained by first defendant for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal by first defendant allowed; held no concluded contract between first defendant and plaintiff; decree of Judicial Commissioner awarding Rs. 3,000 compensation to plaintiff set aside.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'We however find it difficult to hold on the entire facts of the case that there was any concluded contract on the 14th August, 1944...'",
      "speaker": "court",
      "significance": "Core holding rejecting plaintiff's claim of concluded contract."
    },
    {
      "text": "'The mere statement of the lowest price at which the vendor would sell contains no implied contract to sell at that price to the persons making the inquiry.' (Harvey v. Facey)",
      "speaker": "court",
      "significance": "Key principle applied to first defendant's cable as mere price info, not offer."
    },
    {
      "text": "'I hereby confirm my oral offer of ten thousand for the bungalow.' (Plaintiff's letter 14 Aug)",
      "speaker": "petitioner_counsel",
      "significance": "Shows plaintiff treated own communication as offer, not acceptance of counter-offer."
    }
  ],
  "_case_id": "1951_62",
  "_label": 1,
  "_text_length": 10887,
  "_extracted_at": "2026-02-08T22:16:33.941275"
}