{
  "metadata": {
    "case_name": "Regional Deputy Iron and Steel Controller v. State",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "Kania C.J."
    ],
    "case_number": "Criminal Appeal No. 1 of 1950",
    "date_of_judgment": "1951-03-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In 1947 the appellant held the office of Regional Deputy Iron and Steel Controller, Kanpur Circle, U.P., and was a public servant.",
      "type": "background",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The police having suspected the appellant to be guilty of offences under sections 161 and 165 of the Indian Penal Code applied to the Deputy Magistrate, Kanpur, for a warrant of his arrest on the 22nd of October, 1947, and the warrant was issued on the next day.",
      "type": "procedural",
      "date": "1947-10-22",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellant was arrested on the 27th of October, 1947, but was granted bail.",
      "type": "procedural",
      "date": "1947-10-27",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On the 26th of November, 1947, the District Magistrate cancelled his bail as the Magistrate considered that the sureties were not proper.",
      "type": "procedural",
      "date": "1947-11-26",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On the 1st of December, 1947, the Government appointed a Special Magistrate to try offences under the Prevention of Corruption Act II of 1947 and on the 1st December, 1947, the appellant was produced before the Special Magistrate and was granted bail.",
      "type": "procedural",
      "date": "1947-12-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The police continued their investigation.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On the 6th of December, 1948, sanction was granted by the Provincial Government to prosecute the appellant inter alia under sections 161 and 165 of the Indian Penal Code.",
      "type": "procedural",
      "date": "1948-12-06",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On the 31st January, 1949, sanction in the same terms was granted by the Central Government.",
      "type": "procedural",
      "date": "1949-01-31",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "As a result of an appeal made by the appellant to the High Court of Allahabad the amount of his bail was reduced and on the 25th of March, 1949, the appellant was ordered to be put up before the Magistrate to answer the charge-sheet submitted by the prosecution.",
      "type": "procedural",
      "date": "1949-03-25",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On the 25th March, 1949, the Magistrate issued a notice under section 190 of the Criminal Procedure Code against the appellant and made it returnable on the 2nd of May, 1949.",
      "type": "procedural",
      "date": "1949-03-25",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On the returnable date the appellant contended that the sanction of the Central Government was void because it was not given by the Government of the State.",
      "type": "disputed",
      "date": "1949-05-02",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Magistrate took cognizance of the offence on 22nd/23rd October 1947 when issuing the warrant for arrest, rendering the proceedings illegal in the absence of prior sanction under section 107 CrPC and section 6 of Prevention of Corruption Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the initiation of proceedings against the appellant commenced on the date of the arrest warrant without sanction, making continuing proceedings illegal.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "When does a Magistrate take cognizance of an offence under section 190 CrPC in relation to offences under sections 161/165 IPC deemed cognizable by section 3 of Prevention of Corruption Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "When the warrant for his arrest was issued by the Magistrate on the 22nd of October, 1947, the Magistrate took cognizance of the offence and, as no sanction of the Government had been obtained before that day, the initiation of the proceedings against him, which began on that day without the sanction of the Government, was illegal.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Section 190 CrPC; Emperor v. Sourindra Mohan Chuckerbutty"
    },
    {
      "id": "pa2",
      "text": "The same proceedings are continuing against him and therefore the notice to appear before the Magistrate issued on 25th March, 1949, is also illegal.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": "Sections 161, 165 IPC; Section 107 CrPC; Section 6 Prevention of Corruption Act"
    },
    {
      "id": "pa3",
      "text": "Without cognizance under section 190 CrPC the Magistrate had no jurisdiction to issue any process.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Section 190 CrPC"
    },
    {
      "id": "pa4",
      "text": "The sanction of the Central Government was void because it was not given by the Government of the State.",
      "supporting_facts": [
        "f8",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The arrest warrant was issued under the proviso to section 3 of the Prevention of Corruption Act during police investigation of a cognizable offence, before cognizance under section 190 CrPC.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "Section 3 Prevention of Corruption Act; Section 190 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Initiation of proceedings commences on cognizance of the offence by the Magistrate under one of the three contingencies in section 190 CrPC.",
      "addresses_issue": "i3",
      "key_observation": "Police can arrest without Magistrate order for cognizable offences during investigation."
    },
    {
      "id": "cr2",
      "text": "Offences under sections 161/165 IPC are deemed cognizable by section 3 Prevention of Corruption Act notwithstanding CrPC; proviso limits police powers during investigation: investigation by DSP or Magistrate order, arrest only with Magistrate warrant.",
      "addresses_issue": "i3",
      "key_observation": "Magistrate order for arrest under proviso to s.3 is during investigation, before cognizance."
    },
    {
      "id": "cr3",
      "text": "Assumption that Magistrate issues warrant only after cognizance under s.190 is unsound; proviso to s.3 expressly covers Magistrate issuing warrant for arrest during investigation of cognizable offence.",
      "addresses_issue": "i1",
      "key_observation": "Warrant under s.3 proviso does not imply cognizance."
    },
    {
      "id": "cr4",
      "text": "Section 197 CrPC and s.6 Prevention of Corruption Act require sanction before court takes cognizance, which is stage of initiation of proceedings, not during police investigation.",
      "addresses_issue": "i1",
      "key_observation": "Cognizance stage distinct from investigation stage."
    },
    {
      "id": "cr5",
      "text": "In present case, Magistrate took cognizance only on 25th March 1949 when issuing notice under s.190 CrPC.",
      "addresses_issue": "i1",
      "key_observation": "Explicit action under s.190 marks cognizance."
    },
    {
      "id": "cr6",
      "text": "Emperor v. Sourindra Mohan Chuckerbutty distinguished: observations on cognizance read in light of facts where Magistrate expressly recorded cognizance.",
      "addresses_issue": "i1",
      "key_observation": "Does not support appellant."
    },
    {
      "id": "cr7",
      "text": "Cognizance is when Magistrate first takes judicial notice of offence as condition precedent to initiation of proceedings; applying mind for investigation orders (e.g. s.156(3)) is not cognizance.",
      "addresses_issue": "i3",
      "key_observation": "From Gopal Marwari v. Emperor and Abani Kumar Banerjee."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The order of the Magistrate for arrest warrant under proviso to s.3 Prevention of Corruption Act was during police investigation and before cognizance of offence; cognizance taken on 25 March 1949 under s.190 CrPC after sanction obtained.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Proceedings valid as sanction obtained prior to cognizance required under s.6 Prevention of Corruption Act and s.197 CrPC.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Emperor v. Sourindra Mohan Chuckerbutty",
      "citation": "I.L.R. 37 Cal. 412",
      "treatment": "distinguished",
      "relevance": "Observations on when Magistrate takes cognizance; relied on by appellant but distinguished on facts."
    },
    {
      "case_name": "Gopal Marwari v. Emperor",
      "citation": "A.I.R. 1943 Pat. 245",
      "treatment": "followed",
      "relevance": "Cognizance indicates point when Magistrate first takes judicial notice of offence as condition precedent to initiation."
    },
    {
      "case_name": "Superintendent and Remembrancer of Legal Affairs, West Bengal v. Abani Kumar Banerjee",
      "citation": "A.I.R. 1950 Cal. 437",
      "treatment": "followed",
      "relevance": "Taking cognizance under s.190(1)(a) requires applying mind for purpose of proceeding under subsequent sections, not for investigation orders."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "161",
        "165"
      ],
      "relevance": "Offences alleged against public servant; deemed cognizable under s.3 Prevention of Corruption Act."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "190",
        "167",
        "197"
      ],
      "relevance": "S.190: cognizance of offences; s.197: sanction before cognizance for public servants; s.167: remand during investigation."
    },
    {
      "name": "Prevention of Corruption Act, 1947",
      "sections": [
        "3",
        "6"
      ],
      "relevance": "S.3 deems ss.161/165 IPC cognizable with provisos for investigation/arrest; s.6 requires sanction before cognizance."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Allahabad High Court order dismissing revision petition is dismissed. Proceedings valid as Magistrate did not take cognizance on issuance of arrest warrant in 1947 but only on 25 March 1949 after sanction; warrant was under proviso to s.3 PCA during investigation.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is clear from the wording of the section that the initiation of the proceedings against a person commences on the cognizance of the offence by the Magistrate under one of the three contingencies mentioned in the section.\"",
      "speaker": "court",
      "significance": "Defines when proceedings initiate via cognizance under s.190 CrPC."
    },
    {
      "text": "\"The order which may be applied for and made during the police investigation by virtue of section 3 of the Act is therefore before the Magistrate has taken cognizance of the offence under section 6 of the Act or section 190 of the Criminal Procedure Code.\"",
      "speaker": "court",
      "significance": "Clarifies arrest warrant under s.3 proviso precedes cognizance."
    },
    {
      "text": "\"When the magistrate applies his mind not for the purpose of proceeding under the subsequent sections of this Chapter, but for taking action of some other kind, e.g., ordering investigation under section 156(3), or issuing a search warrant for the purpose of the investigation, he cannot be said to have taken cognizance.\"",
      "speaker": "court",
      "significance": "Quotes Abani Kumar Banerjee on scope of cognizance."
    }
  ],
  "_case_id": "1951_15",
  "_label": 0,
  "_text_length": 16722,
  "_extracted_at": "2026-02-10T19:19:48.638571"
}