{
  "metadata": {
    "case_name": "Arjan Singh alias Puran v. Inder Singh & Ors.",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "Chandrasekhara Aiyar J."
    ],
    "case_number": "Civil Appeal No. 31 of 1950",
    "date_of_judgment": "1951-03-02"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plaintiff Arjan Singh alias Puran, born 22nd July 1919, brought suit as reversionary heir of first defendant Inder Singh against Inder Singh, Kartar Singh (second defendant) and five others for declaration that will executed by Inder Singh in favour of Kartar Singh about 14 years ago was null and void.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Suit properties: half share of land measuring 395 kanals in village Kadduwal, half share of 837 kanals 11 marlas in Pattar Kalan, four houses in Pattar Kalan.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Pedigree: Plaintiff claims Sehja Singh as 4th ancestor; Sehja Singh's sons: Jodha Singh, Jai Singh; Inder Singh is Jodha Singh's grandson; later evidence mentions third son Pohlo and fourth son Hamira.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Parties are Jat agriculturists governed by customary law; sonless proprietor incompetent to make will of ancestral property if collaterals up to 5th degree; entire property ancestral.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "At trial, admitted that land in Kadduwal not proved ancestral.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Subordinate Judge, Jullundur: Land in Pattar Kalan not shown ancestral as Sehja Singh had three sons (Jodha, Jai, Pohlo); no presumption of ancestry from equal shares of two sons; findings for plaintiff on adoption and limitation but no locus standi for adoption challenge as limitation expired before birth; suit dismissed.",
      "type": "procedural",
      "date": "1946-02-28",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Plaintiff appealed to District Judge; applied under O XLI r27 and s151 CPC for additional evidence: kami beshi statement Mauza Pattar Kalan showing Pohlo gave up interest to brothers; copy filed with appeal.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "District Judge allowed additional evidence on 17th March 1942 before hearing appeal; entries in naqsha kami beshi (1849-50) and muntakhib asami-war (1852) that Pohlo relinquished share; permitted parties to adduce evidence; witnesses: Munshi Pirthi Nath (brought record 1849-50), Munshi Niaz Ahmad (brought muntakhib Tahsil).",
      "type": "procedural",
      "date": "1942-03-17",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "District Judge reversed Subordinate Judge: entries genuine, not forged; Pohlo relinquished, so Pattar Kalan ancestral qua plaintiff; suit within time Art 120 Limitation Act; adoption not true; custom does not permit will of any property; decreed suit in entirety including Kadduwal (not ancestral) and 4 bighas 16 biswas Pattar Kalan with third parties.",
      "type": "procedural",
      "date": "1942-04-24",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Second defendant Kartar Singh second appeal to High Court Lahore (Regular Second Appeal No. 887 of 1942): High Court held no proof Pattar Kalan ancestral; additional evidence unjustified; entries interpolated (different pen/ink, awkward insertion, absent elsewhere); land non-ancestral; under s7 Act II 1920 no challenge to alienation of non-ancestral property contrary to custom; suit dismissed; leave to appeal to Privy Council granted.",
      "type": "procedural",
      "date": "1946-02-28",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Defendants 3-7 ex parte.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Second defendant set up adoption by first defendant; pleaded properties not ancestral qua plaintiff.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the properties were ancestral under customary law, rendering the will invalid as sonless proprietor cannot will away ancestral property with collaterals up to 5th degree.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether District Judge justified in admitting additional evidence under Order XLI rule 27 CPC.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether adoption by second defendant valid.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether suit barred by limitation.",
      "framed_by": "respondent"
    },
    {
      "id": "i5",
      "text": "Whether plaintiff had locus standi to challenge adoption.",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court not open to interfere with District Judge's discretion in allowing additional evidence under O XLI r27; even erroneous finding of fact final in second appeal under s100 CPC.",
      "supporting_facts": [
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": "Order XLI rule 27 CPC, section 100 CPC"
    },
    {
      "id": "pa2",
      "text": "Entries in kami beshi and muntakhib genuine as in proper custody; prove Pohlo relinquished share, making Pattar Kalan ancestral.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Customary law bars will of ancestral property; suit within time as minor when will made.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": "Customary law of Jat agriculturists"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Plaintiff had ample opportunity to produce evidence at trial; additional evidence forged on face.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Order XLI rule 27 CPC"
    },
    {
      "id": "ra2",
      "text": "Properties not ancestral: Sehja Singh had three sons, equal shares of two no presumption without third son's share info.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Under s7 Act II 1920, no person empowered to contest alienation of non-ancestral immovable property contrary to custom.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Section 7 Act II of 1920"
    },
    {
      "id": "ra4",
      "text": "Adoption valid; plaintiff no locus as limitation expired before birth.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Limitation Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Discretion under O XLI r27 not arbitrary but judicial, circumscribed by rule; proper only if appellate court finds inherent lacuna in evidence to pronounce judgment; here District Judge admitted before examining record, no lacuna shown.",
      "addresses_issue": "i2",
      "key_observation": "Additional evidence improperly admitted; ignore it."
    },
    {
      "id": "cr2",
      "text": "Even if admitted, entries spurious: superficial observation shows interpolation (different pen/ink, awkward, absent elsewhere, out of place); traced suspiciously; custody alone insufficient.",
      "addresses_issue": "i2",
      "key_observation": "Entries not genuine."
    },
    {
      "id": "cr3",
      "text": "Without additional evidence, no proof Pattar Kalan ancestral: no showing Sehja owned land, sons inherited equally; pedigree shows fourth son Hamira; equal shares of two sons with third unaccounted no presumption.",
      "addresses_issue": "i1",
      "key_observation": "Plaintiff has no legs to stand on."
    },
    {
      "id": "cr4",
      "text": "Finding on additional evidence not conclusive in second appeal as improperly admitted and ignored intrinsic defects.",
      "addresses_issue": "i2",
      "key_observation": "High Court right to interfere."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "District Judge not justified in admitting additional evidence under Order XLI rule 27 CPC as no lacuna in record and admitted pre-hearing.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Entries in settlement registers spurious and interpolated.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No proof properties ancestral; under s7 Act II 1920 cannot challenge alienation of non-ancestral property contrary to custom.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kessowji Issur v. G.I.P. Railway",
      "citation": "34 I.A. 115",
      "treatment": "followed",
      "relevance": "Legitimate occasion for O XLI r27 when inherent lacuna apparent on examining evidence, not for fresh discovery outside court."
    },
    {
      "case_name": "Parsotim v. Lal Mohan",
      "citation": "58 I.A. 254",
      "treatment": "followed",
      "relevance": "Reiterated above view in stronger terms; test is whether appellate court can pronounce judgment without additional evidence."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order XLI rule 27",
        "section 100",
        "section 151",
        "Order XLI rule 27 (1)(b)"
      ],
      "relevance": "Governs admission of additional evidence in appeal; limits second appeal to specific grounds; judicial discretion not arbitrary."
    },
    {
      "name": "Indian Limitation Act",
      "sections": [
        "Article 120"
      ],
      "relevance": "Suit within time."
    },
    {
      "name": "Punjab Alienation of Land Act, 1900 (Act II of 1920)",
      "sections": [
        "Section 7"
      ],
      "relevance": "No person empowered to contest alienation of non-ancestral immovable property on ground contrary to custom."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding High Court judgment dismissing the suit; held additional evidence improperly admitted and properties not proved ancestral, so will valid and no right to challenge.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The discretion to receive and admit additional evidence is not an arbitrary one, but is a judicial one circumscribed by the limitations specified in Order XLI, rule 27, of the Civil Procedure Code.",
      "speaker": "court",
      "significance": "Defines scope of appellate discretion for additional evidence."
    },
    {
      "text": "The true test, therefore, is whether the appellate court is able to pronounce judgment on the materials before it without taking into consideration the additional evidence sought to be adduced.",
      "speaker": "court",
      "key_observation": "Test for admitting additional evidence under O XLI r27."
    },
    {
      "text": "Even a superficial observation of the original documents leads one irresistibly to the conclusion that this entry was a subsequent interpolation.",
      "speaker": "court",
      "significance": "High Court's observation on entries' genuineness, endorsed by SC."
    }
  ],
  "_case_id": "1951_14",
  "_label": 0,
  "_text_length": 13935,
  "_extracted_at": "2026-02-10T19:19:46.272704"
}