{
  "metadata": {
    "case_name": "Raghunath Rai Ram Parshad v. Union of India",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "DAS J"
    ],
    "case_number": "Original Jurisdiction Petition No. 135 of 1950",
    "date_of_judgment": "1951-01-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On May 5, 1948, the then Rulers of eight Punjab States including Patiala and Nabha with the concurrence and guarantee of the Government of India entered into a covenant agreeing to unite and integrate their territories in one State with a common executive, legislature and judiciary by the name of Patiala and East Punjab States Union (PEPSU).",
      "type": "background",
      "date": "1948-05-05",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By Article III of the covenant, the then Ruler of Patiala became the first President or Raj Pramukh of the Council of Rulers and he is to hold the office during his lifetime.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Article VI of the covenant: The Ruler of each Covenanting State shall, as soon as may be practicable, and in any event not later than the 20th of August, 1948, make over the administration of his State to the Raj Pramukh, and thereupon, all rights, authority and jurisdiction belonging to the Ruler which appertain, or are incidental to the Government of the Covenanting State shall vest in the Union and shall thereafter be exercisable only as provided by this Covenant or by the Constitution to be framed thereunder; all duties and obligations of the Ruler pertaining or incidental to the Government of the Covenanting State shall devolve on the Union and shall be discharged by it; all the assets and liabilities of the Covenanting State shall be the assets and liabilities of the Union; the military forces, if any, of the Covenanting State shall become the military forces of the Union.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Article X provides for the formation of a Constituent Assembly to frame a constitution of a unitary type for the Union within the framework of the Covenant and the Constitution of India. This Constituent Assembly was also to function as the interim Legislature of the Union until an elected legislature came into being.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Proviso to clause 2 of Article X: Until a Constitution framed by the Constituent Assembly comes into operation after receiving the assent of the Raj Pramukh, the Raj Pramukh shall have power to make and promulgate Ordinances for the peace and good government of the Union or any part thereof, and any Ordinance so made shall, for the space of not more than six months from its promulgation have the like force of law as an Act passed by the Constituent Assembly but any such Ordinance may be controlled or superseded by any such Act.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Union was inaugurated on July 15, 1948, and the Raj Pramukh thereafter took over the administration of the different Covenanting States.",
      "type": "background",
      "date": "1948-07-15",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Administration of Nabha State was taken over by the Raj Pramukh on August 20, 1948.",
      "type": "background",
      "date": "1948-08-20",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On the same day (August 20, 1948), the Raj Pramukh promulgated Ordinance No. 1 of 2005 called the Patiala and East Punjab States Union Administration Ordinance, 2005.",
      "type": "background",
      "date": "1948-08-20",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Section 2 of Ordinance No. 1 of 2005: It shall extend to the territories included in the Covenanting States on and from the date on which the administration of any of the said State or States has been or is made over to the Raj Pramukh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "As soon as the administration of any Covenanting State has been taken over by the Raj Pramukh, all laws, Ordinances, Acts, Rules, Regulations, Notifications, Hidayats and Firman-i-Shahi having force of law in Patiala State on the date of commencement of this Ordinance shall apply mutatis mutandis to the territories of the said State and with effect from that date all laws in force in such Covenanting State immediately before that date shall be repealed. Provided that proceedings of any nature whatsoever pending on such date in the Courts or offices of any such Covenanting State shall, notwithstanding anything contained in this Ordinance or any other Ordinance, be disposed of in accordance with the laws governing such proceedings in force for the time being in any such Covenanting State.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Section 6 of Ordinance No. 1 of 2005 provides for the adaptation of the laws etc. enforced under section 3 and, amongst other things, any reference in these laws etc. to the Patiala State and the like was to be construed as a reference to the State of the Union.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Notification No.35 dated 27-5-05/11-9-1948 was issued over the signature of the Revenue Secretary notifying that the Patiala Income-tax Act of 2001 and the Rules thereunder had come into force in the various Covenanting States from August 20, 1948, thereby repealing the law or laws in force in that behalf in those States before that date, except as to pending proceedings.",
      "type": "background",
      "date": "1948-08-20",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Prior to August 20, 1948, there was no law in the Nabha State imposing income-tax on the subjects of that State.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "On November 14, 1948, the Commissioner of Income-tax issued Notification No. 4, dated 29-7-2005 intimating that persons belonging to the Covenanting States of Nabha and Nalagarh would be assessed to income-tax under the Patiala Income Tax Act, 2001. It was mentioned that persons of those States whose income reached the taxable limit should henceforward keep regular and proper accounts for purposes of audit by the Income Tax Department.",
      "type": "background",
      "date": "1948-11-14",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On February 2, 1949, Ordinance 1 of 2005 was repealed and replaced by Ordinance No. XVI of 2005 promulgated by the Raj Pramukh and called the Patiala and East Punjab States Union General Provisions Administration Ordinance, 2006.",
      "type": "background",
      "date": "1949-02-02",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Section 3(1) of Ordinance No. XVI of 2005: As from the appointed day, all laws and rules, regulations, bye-laws and notifications made thereunder, and all other provisions having the force of law, in Patiala State on the said day shall apply mutatis mutandis to the territories of the Union and all laws in force in the other Covenanting States immediately before that day shall cease to have effect. Provided that all suits, appeals, revisions applications, reviews, executions and other proceedings, or any of them, whether Civil or Criminal or Revenue, pending in the Courts and before authorities of any Covenanting States shall, notwithstanding anything contained in this Ordinance, be disposed of in accordance with the laws governing such proceedings in force in any such Covenanting State immediately before the appointed day.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "By section 2(a) of Ordinance No. XVI of 2005, the appointed day was defined as meaning the 5th day of Bhadon, 2005, corresponding to August 20, 1948.",
      "type": "background",
      "date": "1948-08-20",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "There was a section providing for adaptation similar to section 6 of Ordinance 1 of 2005.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Ordinance No. 1 of 2006 called the Finance Ordinance promulgated on April 13, 1949, which came into force on that very date.",
      "type": "background",
      "date": "1949-04-13",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Section 5 of Finance Ordinance No. 1 of 2006 introduced several amendments to the Patiala Income Tax Act, 2001. It recast sections 3 and 34 of that Act and introduced a new section as section 23B.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Section 6 of Finance Ordinance No. 1 of 2006: For the assessment year beginning on the 1st day of Baisakh, 2006, that is to say, in respect of the accounting the income, profits and gains of the previous year ending on the last day of Chet, 2005,- (a) income-tax shall be charged at the rates specified in Part I of the Second Schedule to this Ordinance, and (b) rates of super tax shall, for the purposes of section 55 of the Patiala Income Tax Act, 2001, be specified in Part II of the Second Schedule to this Ordinance.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "The petitioner is a resident of Ateli in the district of Mohindargarh now in PEPSU but which formerly formed part of the Nabha State. The petitioner has been carrying on his business at Ateli for a number of years under the name and style of Raghunath Rai Ram Parshad.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "He never paid any income-tax as no such tax was imposed by any law in the Nabha State.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f24",
      "text": "On October 20, 1949, the petitioner was served with a notice under sections 22(2) and 88 of the Patiala Income Tax Act, 2001, requiring him to submit a return for the Income Tax year 2006 (13-4-1949 to 12-4-1950) disclosing his income during the previous year (13-4-1948 to 12-4-1949).",
      "type": "procedural",
      "date": "1949-10-20",
      "source": "court"
    },
    {
      "id": "f25",
      "text": "The petitioner, on December 4, 1949, filed his return for the year 2006 and on February 14, 1950, he was assessed to income-tax.",
      "type": "procedural",
      "date": "1949-12-04",
      "source": "court"
    },
    {
      "id": "f26",
      "text": "On May 23, 1950, the petitioner received a notice under section 34 calling upon him to file his return for the year ending the last day of Chet 2005, i.e., for the year 13-4-1948 to 12-4-1949. In this return he had to specify his income of the previous year, namely, 2004 i.e., 13-4-1947 to 12-4-1948.",
      "type": "procedural",
      "date": "1950-05-23",
      "source": "court"
    },
    {
      "id": "f27",
      "text": "The petitioner along with other assessees of Ateli and Kanina submitted a petition before the Income Tax Officer on July 9, 1950, asking him not to proceed with the assessment for the year 2005.",
      "type": "procedural",
      "date": "1950-07-09",
      "source": "court"
    },
    {
      "id": "f28",
      "text": "On July 13, 1950, the Income Tax Officer assessed him to the best of his judgment under section 34(4) read with section 22(4) of the Income Tax Act.",
      "type": "procedural",
      "date": "1950-07-13",
      "source": "court"
    },
    {
      "id": "f29",
      "text": "The petitioner along with other assessees similarly situated moved the Income Tax Commissioner and the Central Board of Revenue, New Delhi, but without any success.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f30",
      "text": "No formal appeal under the Patiala Income Tax Act appears to have been filed by the petitioner against assessments for either of the two years 2005 and 2006.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f31",
      "text": "On August 10, 1950, the petitioner filed his present petition before this Court under article 32 of the Constitution praying that a writ in the nature of a writ of certiorari be issued for quashing the assessments of the petitioners income accrued in the years 2004 and 2005 and other ancillary reliefs.",
      "type": "procedural",
      "date": "1950-08-10",
      "source": "court"
    },
    {
      "id": "f32",
      "text": "During the pendency of this petition the income-tax authorities have issued a notice under section 46 intimating that penalty will be imposed if the tax was not paid up.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f33",
      "text": "Petitioner's contention: While the people of Kapurthala which is included in PEPSU have been asked to pay income-tax for the period prior to August 20, 1948, at the old rate fixed by the Kapurthala Income Tax Act which was lower than the rate fixed by the Patiala Income Tax Act, 2001, the people of Nabha who had no to pay any income-tax prior to August 20, 1948, at all have been made liable to pay at the higher Patiala rate and that such discrimination offends against the provisions of article 14.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f34",
      "text": "Paragraph 10 of the affidavit of Sardar Gurbax Singh, the Additional Director of Inspection (Income Tax), New Delhi, who was formerly the Commissioner of Income Tax, Punjab and PEPSU: For the assessment year 2005, in Kapurthala the assessees whose cases were pending on August 20, 1948, were assessed under the Kapurthala Income Tax Act at rates fixed thereunder but that for the assessment year 2006 the provisions of the Patiala Income Tax Act and the rates prescribed thereunder were uniformly applied in all areas of the PEPSU, including Kapurthala.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f35",
      "text": "This allegation which is not denied in the affidavit filed by the petitioner in reply must be taken as correct.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f36",
      "text": "The assessment of Kapurthala assessees for the year 2005 at the old Kapurthala rate was obviously made under the proviso to section 3 of Ordinance No. 1 of 2005, which was reproduced in the proviso to section 3(1) of the Ordinance No. XVI of 2006 and both of which required all pending proceedings to be completed according to the law applicable to those proceedings when they were initiated.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f37",
      "text": "No case of assessment was pending as against any Nabha assessee on August 20, 1948, for there was no Income Tax Act in Nabha prior to that date and, therefore, there could be no occasion for completing any pending proceedings against any of such assessees.",
      "type": "material",
      "date": "1948-08-20",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the petitioner has been denied the fundamental right of equality before the law and the equal protection of the laws guaranteed by article 14 due to differential treatment in income-tax assessment between Nabha and Kapurthala assessees.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the assessment of tax on the petitioner's income which accrued prior to August 20, 1948, was illegal and unauthorized by the Ordinances, threatening to invade the petitioner's fundamental right to property under article 31(1), and whether protection against taxation comes from article 31(1) or article 265.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "People of Kapurthala assessed at old lower Kapurthala rates for pre-August 20, 1948 period, while Nabha people (who paid no tax before) made liable at higher Patiala rates, violating Article 14.",
      "supporting_facts": [
        "f33"
      ],
      "legal_basis": "Article 14"
    },
    {
      "id": "pa2",
      "text": "Administration of Nabha taken over only on August 20, 1948, Patiala Income Tax Act applied from that date, so assessment for pre-1948 income illegal, depriving property without authority of law under Article 31(1).",
      "supporting_facts": [
        "f7",
        "f12",
        "f23",
        "f24",
        "f25",
        "f26",
        "f28"
      ],
      "legal_basis": "Article 31(1); Patiala Income Tax Act, 2001"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "For assessment year 2005, Kapurthala pending cases assessed under old Kapurthala Act per proviso; for 2006, Patiala Act uniformly applied everywhere including Kapurthala. No pending cases in Nabha as no prior IT Act.",
      "supporting_facts": [
        "f34",
        "f35",
        "f36",
        "f37"
      ],
      "legal_basis": "Proviso to section 3 of Ordinance No. 1 of 2005 and section 3(1) of Ordinance No. XVI of 2006"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No discrimination under Article 14: Difference due to pending proceedings in Kapurthala (assessed under old law per proviso), no such in Nabha (no prior IT law). Provision for pending proceedings is reasonable classification permissible under equal protection clause.",
      "addresses_issue": "i1",
      "key_observation": "Discrimination not by Ordinances but by absence of IT Act in Nabha leading to no pending cases."
    },
    {
      "id": "cr2",
      "text": "Article 31(1) not applicable to taxation; taxation distinct, protected by Article 265 (no tax levied/collected except by authority of law). Article 31(1) concerns deprivation otherwise than by tax. Article 265 not fundamental right enforceable under Article 32.",
      "addresses_issue": "i2",
      "key_observation": "Protection against taxation from Article 265, not Article 31(1); application under Article 32 read with 31(1) misconceived."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Grievance of infringement of Article 14 not well-founded.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Assessment for pre-1948 income authorized; no violation of Article 31(1) as taxation governed by Article 265, not enforceable under Article 32 with 31(1).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14",
        "Article 31(1)",
        "Article 32",
        "Article 265"
      ],
      "relevance": "Article 14 equality challenged and rejected; Article 31(1) distinguished from taxation protected by Article 265; Article 32 invoked but held misconceived for tax matters."
    },
    {
      "name": "Patiala Income Tax Act, 2001",
      "sections": [
        "Section 3",
        "Section 22(2)",
        "Section 22(4)",
        "Section 34",
        "Section 34(4)",
        "Section 46",
        "Section 55",
        "Section 88"
      ],
      "relevance": "Applied mutatis mutandis to Nabha from August 20, 1948; notices and assessments under these sections."
    },
    {
      "name": "Patiala and East Punjab States Union Administration Ordinance, 2005 (Ordinance No. 1 of 2005)",
      "sections": [
        "Section 2",
        "Section 3",
        "Section 6"
      ],
      "relevance": "Extended Patiala laws including IT Act to covenanting states from takeover date, repealed prior laws except pending proceedings."
    },
    {
      "name": "Patiala and East Punjab States Union General Provisions Administration Ordinance, 2006 (Ordinance No. XVI of 2005)",
      "sections": [
        "Section 2(a)",
        "Section 3(1)"
      ],
      "relevance": "Replaced prior ordinance; applied Patiala laws from appointed day (Aug 20, 1948), pending proceedings under old laws."
    },
    {
      "name": "Patiala and East Punjab States Union Finance Ordinance, 2006 (Ordinance No. 1 of 2006)",
      "sections": [
        "Section 5",
        "Section 6",
        "Second Schedule"
      ],
      "relevance": "Amended Patiala IT Act 2001 (sections 3, 34, new 23B); set rates for assessment year 2006."
    },
    {
      "name": "Covenant for PEPSU",
      "sections": [
        "Article III",
        "Article VI",
        "Article X clause 2 proviso"
      ],
      "relevance": "Formation of Union, vesting of administration in Raj Pramukh, power to promulgate ordinances."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The petition under Article 32 seeking writ of certiorari to quash income-tax assessments for years 2005 and 2006, claiming violations of Articles 14 and 31(1), is dismissed as claims under Article 14 unfounded and Article 31(1) inapplicable to taxation which is governed by Article 265 not enforceable under Article 32.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"No tax shall be levied or collected except by authority of law.\"",
      "speaker": "court",
      "significance": "Article 265 quoted to distinguish taxation from Article 31(1) deprivation."
    },
    {
      "text": "\"In our opinion, the protection against imposition and collection of taxes save by authority of law directly comes from article 265, and is not secured by clause (1) of article 31.\"",
      "speaker": "court",
      "significance": "Core holding distinguishing tax protection."
    },
    {
      "text": "\"Article 265, not being in Part III of the Constitution, its protection is not a fundamental right which can be enforced by an application to this Court under article 32.\"",
      "speaker": "court",
      "significance": "Explains why petition under Art 32 with 31(1) fails."
    }
  ],
  "_case_id": "1951_3",
  "_label": 0,
  "_text_length": 16568,
  "_extracted_at": "2026-02-08T22:15:57.495337"
}