{
  "metadata": {
    "case_name": "Decree-holders (Appellants) v. Defendant No. 1 (Respondent)",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "Mukherjea J."
    ],
    "case_number": "Civil Appeal No. 32 of 1950",
    "date_of_judgment": "1951-03-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are representatives of three original plaintiffs who instituted O.S. No. 30 of 1934 in District Judge, East Tanjore, as mortgagees against respondent (defendant No. 1) and six others to enforce mortgage bond executed by defendant No. 1 for himself, minor undivided brother (defendant No. 2), and as agent for defendants 3 to 7 interested in joint family business.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Suit contested by all defendants except defendant No. 1 (ex parte against him); preliminary decree passed on May 15, 1937, directing defendant No. 1 and defendants 3 to 7 to pay Rs. 1,08,098, plaintiffs entitled to final decree for sale in default, suit dismissed against defendant No. 2.",
      "type": "procedural",
      "date": "1937-05-15",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Two appeals to Madras High Court: Appeal No. 48 of 1938 by defendants 3 to 7 contending mortgage not binding on them or joint family property; Appeal No. 248 of 1938 by plaintiffs challenging dismissal against defendant No. 2.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "During pendency of appeals, Madras Agriculturists Relief Act (Act IV of 1938) came into force; applications by defendants 2 to 7 for scaling down decretal debt if decree passed against them; defendant No. 1 did not apply.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "High Court forwarded applications to District Judge for enquiry; finding submitted that applicants (defendants 2 to 7) were agriculturists, debt scaled to Rs. 49,255 with 6% interest per annum from October 1, 1937, exclusive of costs.",
      "type": "procedural",
      "date": "1937-10-01",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "High Court judgment dated March 23, 1942: accepted finding, scaled debt for defendants 2 to 7 to Rs. 49,255 + interest; defendant No. 1 no relief as no application, liable for full amount (Rs. 1,05,000 and odd) with modified interest; decree drawn accordingly.",
      "type": "procedural",
      "date": "1942-03-23",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Defendant No. 1 applied to District Judge for relief under Act alleging agriculturist status; dismissed February 25, 1943, as High Court decree negatived his claim.",
      "type": "procedural",
      "date": "1943-02-25",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Defendant No. 1 applied to High Court to set aside ex parte decree excluding him from Act benefits; rejected December 13, 1943.",
      "type": "procedural",
      "date": "1943-12-13",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Final decree passed by District Judge September 25, 1943, in terms of High Court preliminary decree.",
      "type": "procedural",
      "date": "1943-09-25",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Execution proceedings started August 16, 1944 (E.P. 2 of 1945); two lots sold July 15, 1946, purchased by decree-holders for Rs. 12,005; confirmed August 17, 1946; part satisfaction entered.",
      "type": "procedural",
      "date": "1944-08-16",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Settlement terms via Receivers (decree-holders' estate in Receivers' hands): Rs. 24,000 from defendant No. 2 to release him and share; Rs. 48,000 from defendants 3 to 7 to release them; Rs. 37,500 from defendant No. 1 (to be paid by Yacob Nadar, decree assigned to him excluding rights vs 2-7).",
      "type": "procedural",
      "date": "1947-01-10",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Payments: January 20, 1947, Rs. 24,000 by defendant No. 2, lots 2 and 6 exonerated; January 27, 1947, Rs. 30,000 by defendants 3 to 7; February 17, 1947, further Rs. 18,610-12-0 by them (total Rs. 72,610-12-0). No payment for defendant No. 1's Rs. 37,500.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Defendant No. 1 deposited Rs. 3,215 on March 6, 1947, petition under s. 47 and O. XXI r. 2 CPC for full satisfaction, claiming deposit + payments by 2-7 wipe off scaled amount, exonerate all properties and himself due to indivisibility of mortgage debt.",
      "type": "procedural",
      "date": "1947-03-06",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "District Judge negatived contention; High Court on appeal (January 5, 1948) allowed application, directed full satisfaction.",
      "type": "procedural",
      "date": "1948-01-05",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether defendant No. 1, whose application for scaling down under Madras Agriculturists Relief Act was rejected and held liable for full mortgage debt, can claim full satisfaction of decree and exoneration of mortgaged properties in execution proceedings upon payments made by co-defendants 2 to 7 whose debts were scaled down, on ground of indivisibility of mortgage decree.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court sitting as executing court must give effect to terms of decree and cannot go beyond it or make a new decree under guise of interpretation; decree specifies separate amounts for defendant No. 1 (full) and defendants 2-7 (scaled); defendant No. 1 not entitled to indirect benefit.",
      "supporting_facts": [
        "f6",
        "f14"
      ],
      "legal_basis": "Civil Procedure Code s. 47, O. XXI r. 2; executing court interprets but does not rewrite decree"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Mortgage debt is one and indivisible; payments by defendants 2 to 7 as per scaled decree, plus deposit, wipe off entire amount; decree-holders bound to release entire mortgaged property; non-agriculturist gets incidental benefit via indivisibility principle.",
      "supporting_facts": [
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": "Principle of unity and indivisibility of mortgage decree; Madras High Court decisions"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court's approach improper; as executing court, duty to enforce decree terms without rewriting; decree scaled only for defendants 2-7, defendant No. 1 liable for full Rs. 1,05,000+; on their payment, only their interests releasable, not entire property unless full payment by defendant No. 1.",
      "addresses_issue": "i1",
      "key_observation": "Executing court interprets decree but cannot make new one"
    },
    {
      "id": "cr2",
      "text": "Madras Agriculturists Relief Act special statute trenching on general law; allows scaling for agriculturists only (s.7); no bar to splitting debt where some debtors agriculturists, others not (s.14); precedents on purchasers getting incidental benefit inapplicable as no purchaser here, original mortgagors involved.",
      "addresses_issue": "i1",
      "key_observation": "Act permits differential treatment; indivisibility not absolute against Act"
    },
    {
      "id": "cr3",
      "text": "Decree form imperfect but implies on payment by 2-7, their interest alone not liable to sale; if not paid, whole property sold for entirety due from defendant No. 1; subsequent settlement reinforces separate liabilities.",
      "addresses_issue": "i1",
      "key_observation": "Decree read as whole implies separate enforcement"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Non-agriculturist judgment-debtor (defendant No. 1) not entitled to indirect benefit of scaling down granted to co-debtors via indivisibility in execution; must pay full decreed amount for full redemption; High Court erred in directing full satisfaction.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rainier v. Srinivasiah",
      "citation": "(1940) 2 M.L.J. 39",
      "treatment": "followed",
      "relevance": "Supports scaling mortgage decree for some debtors (agriculturists) while intact for others"
    },
    {
      "case_name": "Arunachalam Pillai v. Seetharam",
      "citation": "(1941) 1 M.L.J. 561",
      "treatment": "distinguished",
      "relevance": "Non-agriculturist purchaser at execution sale gets incidental benefit of mortgagor's scaling down; inapplicable as no purchaser here"
    },
    {
      "case_name": "Pachigola v. Karatam",
      "citation": "(1949) 1 M.L.J. 506",
      "treatment": "distinguished",
      "relevance": "Private sale purchaser gets benefit as must refund purchase money post-scaling; inapplicable"
    },
    {
      "case_name": "Subramanian v. Ramachandra",
      "citation": "(1946) 2 M.L.J. 429",
      "treatment": "distinguished",
      "relevance": "Execution stage, purchaser gets scaled benefit despite own refusal; inapplicable as original mortgagors"
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Section 47",
        "Order XXI, Rule 2"
      ],
      "relevance": "Application in execution for recording satisfaction; executing court jurisdiction limited to decree enforcement"
    },
    {
      "name": "Madras Agriculturists Relief Act, 1938 (Act IV of 1938)",
      "sections": [
        "Section 7",
        "Section 14",
        "Section 19"
      ],
      "relevance": "Scaling debts of agriculturists notwithstanding general law; permits splitting family debts; applied only to applicants who are agriculturists"
    },
    {
      "name": "Transfer of Property Act",
      "sections": [],
      "relevance": "General principle of indivisibility of mortgage decree; exceptions where integrity disrupted or special statutes apply"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court judgment and order dated January 5, 1948, set aside; District Judge's order restored; defendant No. 1 not entitled to full satisfaction on basis of co-defendants' scaled payments.",
    "relief_granted": "Restoration of District Judge's order refusing full satisfaction",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It seems to us that the High Courts approach to the case has not been a proper one and the conclusion it has reached cannot be supported in law.",
      "speaker": "court",
      "significance": "Core rejection of High Court's reasoning"
    },
    {
      "text": "The learned Judges appear to have overlooked the fact that they were sitting only as an executing court and their duty was to give effect to the terms of the decree that was already passed and beyond which they could not go.",
      "speaker": "court",
      "significance": "Defines limits of executing court's power"
    },
    {
      "text": "There is therefore nothing wrong in law in scaling down a mortgage decree in favour of one of the judgment debtors, while as regards others the decree is kept intact.",
      "speaker": "court",
      "significance": "Affirms Act allows differential scaling"
    }
  ],
  "_case_id": "1951_17",
  "_label": 1,
  "_text_length": 19062,
  "_extracted_at": "2026-02-10T19:19:46.154014"
}