{
  "metadata": {
    "case_name": "Logendranath Jha & Ors. v. Polai Lal Biswas",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Patanjali Sastri, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On 29th November 1949 at about 10 a.m., complainant Polai Lal Biswas was harvesting paddy crop on his field.",
      "type": "material",
      "date": "1949-11-29",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "A mob of about fifty persons armed with ballams, lathis and other weapons came to the field led by first appellant Logendranath Jha, who demanded settlement of outstanding disputes and would not allow paddy removal unless settled.",
      "type": "material",
      "date": "1949-11-29",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Altercation followed, Logendranath ordered assault; Logendranath and Harihar gave ballam blows to labourer Kangali, who fell and died on the spot.",
      "type": "material",
      "date": "1949-11-29",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Polai lodged complaint; police investigated, submitted charge-sheet under IPC sections 147, 148, 323, 324, 326, 302, 302/149.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Committing Magistrate found prima facie case, committed appellants to Sessions Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellants pleaded not guilty; alleged Mohender and Debender (appellants 2 and 3, brothers of Logendranath) not present in village Dandkhora as lands allotted to Logendranath at partition; Logendranath not present at occurrence but arrived soon after, dragged by enemies, arrested by ASI.",
      "type": "disputed",
      "date": "1949-11-29",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Two factions in village: one led by Harimohan (relation of complainant), other by Logendranath; long-standing enmity, numerous revenue and criminal proceedings; false case foisted.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Sessions Judge found factions true, alibi not satisfactorily made out, but prosecution must stand on own legs; disbelieved Polai's batai cultivation story as improbable (Polai 19 yo unmarried living with grandmother Parasmani who raised him; unlikely to cultivate mamu/nani land).",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Sessions Judge found discrepancies, contradictions, concealment of real facts by prosecution; impossible to apportion liability or decide who commenced fight/self-defence; acquitted appellants.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Polai filed revision under CrPC s.439 to Patna High Court.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "High Court reviewed evidence, found Sessions Judge's acquittal perverse, lacking perspective; rejected grounds for discrediting prosecution; set aside acquittal, ordered retrial with warning not to be influenced.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether High Court in revision under CrPC s.439 by private party against acquittal can re-appraise evidence, reverse findings of fact as perverse, and order retrial.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Scope of High Court's powers under CrPC s.439(4) in revision against acquittal, vis-a-vis s.417 (appeal only by Government) and s.423.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Revision petition under s.439 CrPC by private party incompetent as s.417 allows appeal against acquittal only by Government.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "CrPC sections 417, 439"
    },
    {
      "id": "pa2",
      "text": "High Court exceeded powers under s.439(4) CrPC by upsetting findings of fact of trial Judge.",
      "supporting_facts": [
        "f8",
        "f9",
        "f11"
      ],
      "legal_basis": "CrPC section 439(4)"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Unnecessary to decide first contention; second prevails. High Court re-appraised evidence, disagreed with fact findings as perverse, indicated discrepancies no ground to discredit prosecution.",
      "addresses_issue": "i1",
      "key_observation": "High Court did not appreciate scope of revision against acquittal."
    },
    {
      "id": "cr2",
      "text": "s.439(1) allows appellate powers per s.423 in discretion, but s.439(4) excludes converting acquittal to conviction. High Court cannot re-appraise evidence/reverse fact findings absent error of law, even if stops short of conviction.",
      "addresses_issue": "i2",
      "key_observation": "Characterising judgment as perverse does not allow reversing pure findings of fact."
    },
    {
      "id": "cr3",
      "text": "High Court formally ordered retrial without conviction and warned against influence, but expressed strong views on credibility, loading dice against appellants.",
      "addresses_issue": "i1",
      "key_observation": "Difficult for trial court to ignore High Court's views."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In revision by private party against acquittal, High Court cannot re-appraise evidence and reverse findings of fact by calling them perverse; exceeds s.439(4) even if orders retrial.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court cannot convert acquittal to conviction per s.439(4); limited to correcting errors of law without reversing fact findings.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "147",
        "148",
        "323",
        "324",
        "326",
        "302",
        "302/149"
      ],
      "relevance": "Offences charged against appellants"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "417",
        "439",
        "439(1)",
        "439(4)",
        "423"
      ],
      "relevance": "Powers of High Court in appeal/revision against acquittal; exclusion of converting acquittal to conviction"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by special leave, holding that the High Court exceeded its jurisdiction in revision under s.439 CrPC by re-appraising evidence and setting aside the acquittal on findings of fact termed perverse, thereby setting aside the High Court's order directing retrial.",
    "relief_granted": "High Court's order set aside; Sessions Judge's acquittal restored implicitly",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Prosecution must stand on its own legs and must prove the story told by it at the very first stage.",
      "speaker": "court",
      "significance": "Sessions Judge's principle adopted; prosecution case failed on own merits"
    },
    {
      "text": "By merely characterising the judgment of the trial Court as perverse and lacking in perspective, the High Court cannot reverse pure findings of fact based on the trial Courts appreciation of the evidence in the case.",
      "speaker": "court",
      "significance": "Core holding limiting High Court's revisional powers"
    },
    {
      "text": "But there can be little doubt that he loaded the dice against the appellants.",
      "speaker": "court",
      "significance": "Critique of High Court's retrial order influencing subordinate court"
    }
  ],
  "_case_id": "1951_69",
  "_label": 1,
  "_text_length": 9942,
  "_extracted_at": "2026-02-10T19:19:40.036318"
}