{
  "metadata": {
    "case_name": "Appellants (Landlords) v. Respondents (Tenants)",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "FAZL ALI J."
    ],
    "case_number": "Appeal from Patna High Court A.S. 2280 of 1948",
    "date_of_judgment": "1951-02-02"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents have been in occupation as a monthly tenant of several blocks of premises belonging to the appellants at a monthly rental of Rs. 112.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Rent for the months of March, April and May, 1942, having fallen into arrears, respondents remitted it along with the rent for June, on 28th June, 1947, by means of two cheques.",
      "type": "material",
      "date": "1947-06-28",
      "source": "respondents"
    },
    {
      "id": "f3",
      "text": "Appellants did not accept the cheques.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 4th August, 1947, the respondents remitted the amount subsequently by postal money order.",
      "type": "material",
      "date": "1947-08-04",
      "source": "respondents"
    },
    {
      "id": "f5",
      "text": "On 12th August, 1947, the appellants applied to the House Controller for the eviction of the respondents from the premises under section 11(1)(a) of the Bihar Buildings (Lease, Rent and Eviction) Control Act, 1947 (Bihar Act III of 1947), maintaining that there was non-payment of rent.",
      "type": "procedural",
      "date": "1947-08-12",
      "source": "appellants"
    },
    {
      "id": "f6",
      "text": "On 30th August, 1947, the respondents deposited the rent up to the month of June in the Office of the House Controller.",
      "type": "material",
      "date": "1947-08-30",
      "source": "respondents"
    },
    {
      "id": "f7",
      "text": "House Controller passed an order on 10th November, 1947, directing the eviction of the respondents by 10th May, 1948, holding that they had made themselves liable to eviction by reason of non-payment of rent.",
      "type": "procedural",
      "date": "1947-11-10",
      "source": "house_controller"
    },
    {
      "id": "f8",
      "text": "Order of the House Controller was upheld by the Commissioner on appeal on 27th April, 1948.",
      "type": "procedural",
      "date": "1948-04-27",
      "source": "commissioner"
    },
    {
      "id": "f9",
      "text": "Respondents filed suit in the Patna Munsif's Court for a declaration that the order of the Controller dated 10th November, 1947, was illegal, ultra vires and without jurisdiction.",
      "type": "procedural",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f10",
      "text": "Suit was dismissed by the Munsif; decree upheld on appeal by Subordinate Judge.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Patna High Court reversed the appellate decree dated 25th March, 1949, in A.S. 2280 of 1948, decreeing the suit holding that the order of the Rent Controller was without jurisdiction.",
      "type": "procedural",
      "date": "1949-03-25",
      "source": "high_court"
    },
    {
      "id": "f12",
      "text": "High Court granted leave to appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f13",
      "text": "At inception of tenancy, respondents paid one month's rent in advance, agreed to be adjusted whenever default in payment of rent for full one month.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was non-payment of rent within the meaning of section 11(1)(a) of the Bihar Act.",
      "framed_by": "appellants"
    },
    {
      "id": "i2",
      "text": "Whether the House Controller was competent to decide the question of non-payment of rent as a condition precedent to eviction, and whether his decision could be questioned in a civil court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There was non-payment of rent within the meaning of that expression as used in the Act, since the rent was not paid as and when it fell due (rent for March due in April, April in May; no step taken until 28th June 1947; three months arrears exceeded one month advance adjustment).",
      "supporting_facts": [
        "f1",
        "f2",
        "f13"
      ],
      "legal_basis": "Section 11(1)(a) Bihar Buildings (Lease, Rent and Eviction) Control Act, 1947"
    },
    {
      "id": "pa2",
      "text": "Having regard to the scheme of the Act, the House Controller was fully competent to decide whether the condition precedent to eviction (non-payment of rent) had been satisfied, and once decided, it could not be questioned in a civil court.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Sections 11, 16, 18 Bihar Act; 12 Patna 117"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "There was no non-payment of rent in fact, as rent was tendered by cheques and money order, and deposited before eviction order.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Expression 'non-payment of rent' in section 11 must be interpreted to protect tenants; tenant protected if brings rent into court before eviction order; Controller's decision on law not final.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Section 11 Bihar Act; Section 111 Transfer of Property Act; Preamble of Bihar Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "View taken by High Court is not correct; Section 11 begins with 'Notwithstanding anything contained in any agreement or law to the contrary'; self-contained, no need to import Transfer of Property Act.",
      "addresses_issue": "i2",
      "key_observation": "Section 11 wholly unnecessary to go outside the Act for determining liability to eviction."
    },
    {
      "id": "cr2",
      "text": "Act sets up complete machinery: Controller decides if bona fide claim (s.11(8)(b)), enquiries (s.16), appeal to Commissioner (s.18), decision final and not question-able in court (s.18(3)).",
      "addresses_issue": "i2",
      "key_observation": "Controller alone empowered to decide non-payment of rent; his decision essential and final subject only to Commissioner."
    },
    {
      "id": "cr3",
      "text": "Cites Queen v. Commissioners: Legislature entrusts tribunal with jurisdiction including to determine preliminary facts; no appeal means cannot question erroneous decision on such facts.",
      "addresses_issue": "i2",
      "key_observation": "Controller has jurisdiction to determine existence of non-payment."
    },
    {
      "id": "cr4",
      "text": "Cites Colonial Bank v. Willan: Adjudication by judge with jurisdiction conclusive on facts if no defect on face.",
      "addresses_issue": "i2",
      "key_observation": "Court will not quash on erroneous finding of essential fact."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "House Controller empowered to decide non-payment of rent; his decision final per s.18(3), cannot be questioned in civil court.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court's view that civil court can question Controller's order on non-payment overruled.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Queen v. Commissioners for Special Purposes of the Income Tax",
      "citation": "21 Q.B.D. 313",
      "treatment": "followed",
      "relevance": "Legislature may entrust tribunal with jurisdiction to determine preliminary facts like non-payment; decision not appealable if no appeal provided."
    },
    {
      "case_name": "Colonial Bank of Australasia v. Willan",
      "citation": null,
      "treatment": "followed",
      "relevance": "Adjudication conclusive on facts; superior court will not quash on erroneous finding of essential fact via certiorari."
    },
    {
      "case_name": "Unnamed (12 Patna 117)",
      "citation": "12 Patna 117",
      "treatment": "referred",
      "relevance": "Controller's decision on jurisdiction depending on fact cannot be collaterally impeached."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bihar Buildings (Lease, Rent and Eviction) Control Act, 1947 (Bihar Act III of 1947)",
      "sections": [
        "11(1)(a)",
        "11(8)(b)",
        "12",
        "16",
        "18(3)"
      ],
      "relevance": "Governs eviction for non-payment; Controller's jurisdiction, enquiries, finality of orders."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "111"
      ],
      "relevance": "High Court referred but Supreme Court rejected as inapplicable due to 'notwithstanding' clause in s.11."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [],
      "relevance": "Controller empowered to make enquiries, summon witnesses as per CPC."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, holding that the House Controller had jurisdiction to decide non-payment of rent and his order was final, not question-able in civil court; reversed High Court decree.",
    "relief_granted": "Appeal allowed; High Court decree set aside; eviction order stands.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Section 11 is a self-contained section, and it is wholly unnecessary to go outside the Act for determining whether a tenant is liable to be evicted or not, and under what conditions he can be evicted.\"",
      "speaker": "court",
      "significance": "Rejects importing ordinary law; affirms Act's complete machinery."
    },
    {
      "text": "\"The Act empowers the Controller alone to decide whether or not there is non-payment of rent, and his decision on that question is essential before an order can be passed by him under section 11.\"",
      "speaker": "court",
      "significance": "Establishes finality of Controller's jurisdictional fact-finding."
    },
    {
      "text": "\"If the question of jurisdiction depends upon the decision of some fact or point of law... then such decision cannot be collaterally impeached vide 12 Patna 117.\"",
      "speaker": "lower_court",
      "significance": "First appellate court's view upheld by Supreme Court."
    }
  ],
  "_case_id": "1951_6",
  "_label": 1,
  "_text_length": 13921,
  "_extracted_at": "2026-02-08T22:15:46.719038"
}