{
  "metadata": {
    "case_name": "State of Madras v. Srimathi Champakam Dorairajan & State of Madras v. C.R. Srinivasan",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "DAS J."
    ],
    "case_number": "Cases Nos. 270 and 271 of 1951",
    "date_of_judgment": "1951-04-09"
  },
  "facts": [
    {
      "id": "f1",
      "text": "State of Madras maintains four Medical Colleges with 330 seats: 17 reserved for students from outside the State, 12 for discretionary allotment by the State, balance apportioned between four distinct groups of districts.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "State of Madras maintains four Engineering Colleges with 395 seats: 21 reserved for students from outside the State, 12 for discretionary allotment by the State, balance apportioned between four distinct groups of districts.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For many years before the commencement of the Constitution, seats in Medical and Engineering Colleges apportioned between four groups of districts were filled according to Communal G.O.: for every 14 seats - Non-Brahmin Hindus 6, Backward Hindus 2, Brahmins 2, Harijans 2, Anglo-Indians and Indian Christians 1, Muslims 1.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Selection from applicants from a particular community from one of the groups of districts made on principles based on academic qualifications and marks obtained by candidates.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In Medical Colleges, not less than 20% of seats available for students of the State filled by women candidates separately for each region.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Proportion fixed in old Communal G.O. adhered to even after commencement of Constitution on January 26, 1950; G.O. No. 2208 dated June 16, 1950, substantially reproduces communal proportion for Medical Colleges.",
      "type": "material",
      "date": "1950-06-16",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Srimathi Champakam Dorairajan (Brahmin) made application to Madras High Court on June 7, 1950, under Art. 226 for writ restraining enforcement of Communal G.O. for Medical College admissions; had not actually applied for admission but feared denial due to community.",
      "type": "procedural",
      "date": "1950-06-07",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "High Court allowed Champakam Dorairajan's application by judgment dated July 27, 1950.",
      "type": "procedural",
      "date": "1950-07-27",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "C.R. Srinivasan applied for admission to Government Engineering College at Guindy; passed Intermediate Examination in March 1950 in first class, secured 369 marks out of 450 in optionals for academic test.",
      "type": "material",
      "date": "1950-03",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Srinivasan filed petition under Art. 226 praying for writ restraining enforcement of Communal G.O. for Engineering College admissions.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "High Court allowed Srinivasan's application by same judgment dated July 27, 1950.",
      "type": "procedural",
      "date": "1950-07-27",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "State of Madras filed appeals to Supreme Court: Case No. 270 of 1951 (Champakam) and Case No. 271 of 1951 (Srinivasan) under Art. 132.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "State conceded that both applicants would have been admitted if selections made on merits alone.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Srinivasan secured more marks than many Non-Brahmin candidates who would be admitted under quota.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Communal G.O. laying down communal proportions for admission to Medical and Engineering Colleges violates fundamental rights under Article 15(1) and Article 29(2) of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether directive principles under Article 46 override fundamental rights under Articles 15(1) and 29(2).",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Provisions of Article 46 charge the State with promoting educational interests of weaker sections, including Scheduled Castes and Tribes; State entitled to maintain Communal G.O. fixing proportionate seats for communities; no infringement of fundamental rights; Article 46 overrides Article 29(2).",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "Article 46, Article 37"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Communal G.O. infringes fundamental rights under Article 15(1) and Article 29(2) by denying admission on grounds only of caste, religion, race.",
      "supporting_facts": [
        "f7",
        "f9",
        "f10",
        "f14"
      ],
      "legal_basis": "Article 15(1), Article 29(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Article 29(2) guarantees individual citizen right to admission into State-maintained educational institutions not to be denied on grounds only of religion, race, caste, language; applies even if candidate has requisite qualifications.",
      "addresses_issue": "i1",
      "key_observation": "Right is individual, not communal."
    },
    {
      "id": "cr2",
      "text": "Directive principles in Part IV (including Article 46) unenforceable by courts and cannot override enforceable fundamental rights in Part III; fundamental rights sacrosanct.",
      "addresses_issue": "i2",
      "key_observation": "Directive principles subsidiary to fundamental rights."
    },
    {
      "id": "cr3",
      "text": "Absence of provision in Article 29 similar to Article 16(4) for reservation of backward classes significant; no communal considerations intended for educational admissions.",
      "addresses_issue": "i1",
      "key_observation": "Omission of clause like Art. 16(4) deliberate."
    },
    {
      "id": "cr4",
      "text": "Denial of admission to Srinivasan despite higher marks than candidates from other communities solely on ground of being Brahmin violates Article 29(2).",
      "addresses_issue": "i1",
      "key_observation": "Classification proceeds on basis of religion, race, caste."
    },
    {
      "id": "cr5",
      "text": "Petition maintainable despite Champakam not applying for admission, as State agreed to reserve seat if successful.",
      "addresses_issue": "i1",
      "key_observation": "No objection taken by State."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Communal G.O. violates Article 29(2) and Article 15(1) as it denies admission on grounds only of caste, religion, race.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Directive principles of State policy cannot override fundamental rights.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 132",
        "Article 226",
        "Article 15(1)",
        "Article 29(1)",
        "Article 29(2)",
        "Article 46",
        "Article 37",
        "Article 32",
        "Article 16(4)"
      ],
      "relevance": "Communal G.O. held violative of Arts. 15(1) and 29(2); Arts. 46 etc. directive principles do not override Part III rights."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court rejects State's contentions completely; upholds High Court judgments allowing writ petitions restraining enforcement of Communal G.O. as violative of fundamental rights.",
    "relief_granted": "Writs restraining State from enforcing Communal G.O.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The directive principles of the State policy, which by article 37 are expressly made unenforceable by a Court, cannot override the provisions found in Part III.",
      "speaker": "court",
      "significance": "Establishes primacy of fundamental rights over directive principles."
    },
    {
      "text": "The chapter of Fundamental Rights is sacrosanct and not liable to be abridged by any Legislative or Executive Act or order.",
      "speaker": "court",
      "significance": "Affirms inviolability of Part III rights."
    },
    {
      "text": "Such denial of admission cannot but be regarded as made on ground only of his caste.",
      "speaker": "court",
      "significance": "Directly applies Art. 29(2) to facts of denial based on community."
    }
  ],
  "_case_id": "1951_22",
  "_label": 0,
  "_text_length": 15301,
  "_extracted_at": "2026-02-10T19:19:42.020799"
}