{
  "metadata": {
    "case_name": "Companion Appeals (Jullundur Wholesale Cloth Syndicate Appellants) v. State",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "Kania, C.J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Jullundur Wholesale Cloth Syndicate was formed to work out the distribution of cloth under the Government of Punjab Control Cloth Order passed under the Essential Supplies Act.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Certain persons who held licences as wholesale dealers in cloth formed themselves into a corporation and all cloth controlled by the Government was distributed in the district to the retail licence holders through them.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Government allotted quotas to the retailers and orders were issued by the Government for giving each retailer certain bales under the distribution control.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Notification of the 4th of October, 1950, issued by the Government of India, Department of Industries and Supplies, provided that the wholesale syndicate may give the bales not so lifted to another retail dealer.",
      "type": "background",
      "date": "1950-10-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "All along the price for the cloth to be sold wholesale and retail has been fixed under Government orders.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Syndicate was suspected to be dealing in black market and had been warned against its activities by the District Magistrate of Jullundur several times.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On the 7th of June, 1951, an order was issued by the District Organiser, Civil Supplies and Rationing, Jullundur, to the managing agents of the wholesale cloth corporation, Jullundur City, intimating that they were strictly forbidden to dispose of any unlifted stock against unexpired terms without his prior permission in writing.",
      "type": "procedural",
      "date": "1951-06-07",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "They were further directed that thenceforth no such stock would be allowed to be sold to an individual retailer, but permission would be granted to sell the same to association of retailers only.",
      "type": "procedural",
      "date": "1951-06-07",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Cotton Cloth Control Order was in operation even prior to 1950. For some time control on the distribution of cloth was lifted but the price remained under the control of the Government.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "During that time it has been alleged that the appellants and several others sold cloth at rates higher than those fixed by the Government.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Even when the distribution and price were both controlled, the manufacturing mills were allowed to sell at prices fixed by the Government a certain percentage of cloth which was not taken by the Government under its control. This was described as free sale cloth.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "It was alleged that the appellants and several others were doing black-marketing in this free sale cloth.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "By an order passed by the District Magistrate on 19th June, 1951, he directed that the appellants be detained under section 3(2) of the Preventive Detention Act to prevent them from acting in a manner prejudicial to the maintenance of supplies of cloths essential to the community.",
      "type": "procedural",
      "date": "1951-06-19",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "On the 2nd July, 1951, the District Magistrate, Jullundur, directed that the appellants be committed to District Jail Jullundur, from the 2nd July until the 1st October, 1951.",
      "type": "procedural",
      "date": "1951-07-02",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The appellants were detained accordingly.",
      "type": "procedural",
      "date": "1951-07-02",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The grounds for their detention were given to them on the morning of the 6th July.",
      "type": "procedural",
      "date": "1951-07-06",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The grounds set out the activities of the appellants as managing agents or partners in different firms or employees of the said firms or corporations.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "They had been disposing of most of the stocks of cloth received for the Jullundur District in the black market at exorbitant rates from June, 1949, to October, 1950, during the period when control on distribution was removed.",
      "type": "disputed",
      "date": "1949-06 to 1950-10",
      "source": "respondent"
    },
    {
      "id": "f19",
      "text": "Even after the re-imposition of that control in October, 1950, they disposed of cloth which has been frozen under the direction of Director of Civil Supplies in the short interval between the passing of the order and its service on them.",
      "type": "disputed",
      "date": "1950-10",
      "source": "respondent"
    },
    {
      "id": "f20",
      "text": "Second ground: their individual activities as members of the firm in which they were partners in disposing of stocks of cloth in black market at rates higher than the controlled ones, to various dealers, through agents. Particulars in Appendix A referring to free sale cloth.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f21",
      "text": "Third ground: by illegal means they deprived the rightful claimants of the various stocks of cloth with a view to pass the same into black market at exorbitant rates.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f22",
      "text": "On the 9th of July, 1951, petitions under article 226 of the Constitution of India were filed in the East Punjab High Court asking for writs of habeas corpus against the State on the ground that the detention was illegal.",
      "type": "procedural",
      "date": "1951-07-09",
      "source": "court"
    },
    {
      "id": "f23",
      "text": "The District Magistrate filed his affidavit in reply challenging the allegation of mala fides and setting out in some detail instances of the activities of the appellants.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f24",
      "text": "Early in August, 1951 the executive authorities cancelled the licence of the appellants as cloth dealers.",
      "type": "procedural",
      "date": "1951-08",
      "source": "court"
    },
    {
      "id": "f25",
      "text": "The High Court dismissed the petitions.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f26",
      "text": "There have been orders for the release of certain stocks of cloth in respect of other mills, as free sale cloth after the 9th June, 1951.",
      "type": "material",
      "date": "1951-06-09",
      "source": "respondent"
    },
    {
      "id": "f27",
      "text": "Any quantity of cloth not paid for and lifted by the owners/nominees will revert to the Mills for free sale vide letter No. CYC-2/SLM, dated the 31st May, 1951, from the Textile Commissioner, Bombay.",
      "type": "background",
      "date": "1951-05-31",
      "source": "respondent"
    },
    {
      "id": "f28",
      "text": "Free sale cloth can be purchased by any wholesale dealer of cloth of India, without any restriction.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f29",
      "text": "Free sale cloth can be transported from one district to another without a permit vide Memo No. 288894-CS C 50/48791, dated 2nd January, 1951.",
      "type": "background",
      "date": "1951-01-02",
      "source": "respondent"
    },
    {
      "id": "f30",
      "text": "The firm Rattam Chand Mathra Dass had been dealing in free sale cloth and had also been importing cloth as Reserve of Kangra and also Provincial Reserve. Most of this quota also found its way into the black market.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f31",
      "text": "The firm Madan Gopal Nand Lal and Company had been dealing in free sale cloth on a large scale.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f32",
      "text": "Santi Sarup, the Secretary of the Corporation, is believed to be a partner in the firm Hari Chand Bindra Ban and this firm also had been dealing in free sale cloth.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f33",
      "text": "The terms of the Order of the 19th of June were fully explained to each of the detenus.",
      "type": "admitted",
      "date": "1951-06-19",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Legality of the detention of the appellants under the Preventive Detention Act on the ground that they are engaged in black-marketing in cotton piecegoods.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether past activities prior to June 1951 can form basis for detention order.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the order of the District Organiser dated 7th June, 1951 sealed the loophole preventing further black-marketing.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether cancellation of licences renders detention unnecessary as punitive rather than preventive.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether the detention order of 2nd July did not refer to any section or suggest satisfaction of the detaining authority, and the order of 19th June was not served.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "In the grounds for their detention reference is made to their activities prior to June, 1951, only.",
      "supporting_facts": [
        "f18",
        "f19"
      ],
      "legal_basis": "Preventive Detention Act requires prevention of future acts"
    },
    {
      "id": "pa2",
      "text": "Such loophole as existed in the total control of distribution and sale and price of piecegoods in the district was sealed by the order of the District Organiser dated the 7th June, 1951. By virtue of that order the syndicate or corporation could not sell any cloth without an express order in writing from the District Organiser, and therefore there could be no black-marketing after that date.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "In any event now as their licences are cancelled they cannot deal in cloth and the order of detention now maintained against them is more in the nature of punishment than prevention.",
      "supporting_facts": [
        "f24"
      ],
      "legal_basis": "Preventive Detention Act, 1950"
    },
    {
      "id": "pa4",
      "text": "The only order of detention made against them was the order of the 2nd July and that did not refer to any section of the Preventive Detention Act and did not suggest that there was any satisfaction of the detaining authority. No order of the 19th of June was ever shown to any of the appellants or served on them.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": "Preventive Detention Act, 1950 section 3(2)"
    },
    {
      "id": "pa5",
      "text": "Secretary and clerk could not indulge in black market activities.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "On the reports received by him he was satisfied that the detention of the appellants was necessary.",
      "supporting_facts": [
        "f17",
        "f18",
        "f19",
        "f20",
        "f21"
      ],
      "legal_basis": "Preventive Detention Act, 1950 section 3(2)"
    },
    {
      "id": "ra2",
      "text": "Instances of past activities are relevant to be considered in giving rise to the subjective mental conviction that the appellants were likely to indulge in objectionable activities.",
      "supporting_facts": [
        "f18",
        "f19"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "The order of 7th June 1951 does not prevent black-marketing as free sale cloth can still be dealt in; licences can be benami or in other districts.",
      "supporting_facts": [
        "f11",
        "f12",
        "f26",
        "f27",
        "f28",
        "f29",
        "f30",
        "f31",
        "f32"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Terms of the Order of the 19th of June were fully explained to each of the detenus.",
      "supporting_facts": [
        "f13",
        "f33"
      ],
      "legal_basis": null
    },
    {
      "id": "ra5",
      "text": "Secretary and clerk were actively participating in black market activities and indulging themselves.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Instances of past activities are relevant to be considered in giving rise to the subjective mental conviction of the District Magistrate that the appellants were likely to indulge in objectionable activities. The grounds which were given for the detention are relevant and the question whether they are sufficient or not is not for the decision of the Court.",
      "addresses_issue": "i2",
      "key_observation": "Legislature has made only the subjective satisfaction of the authority making the order essential."
    },
    {
      "id": "cr2",
      "text": "The order of 7th June appears to be an administrative order and is in the nature of a warning. It is at variance with clause 5 of the Order of 4th October 1950. Moreover this order does not bring about the result claimed; free sale cloth can still be secured and sold at exorbitant rates.",
      "addresses_issue": "i3",
      "key_observation": "A lot of cloth which the manufacturers are permitted to distribute through persons outside the Government agencies can still be secured and sold at exorbitant rates."
    },
    {
      "id": "cr3",
      "text": "Cancellation of licences does not prevent black-marketing as licences can be obtained in the name of nominees; they may have licences in other districts.",
      "addresses_issue": "i4",
      "key_observation": "It is common knowledge that licences can be obtained in the name of nominees."
    },
    {
      "id": "cr4",
      "text": "Affidavits of relations based on belief without disclosed source; against affidavit of DM stating terms explained. Petitions filed within a week, no reason to doubt DM.",
      "addresses_issue": "i5",
      "key_observation": "No substance in this ground."
    },
    {
      "id": "cr5",
      "text": "Secretary and clerk actively participating and indulging themselves; if disputed, Advisory Board to consider.",
      "addresses_issue": "i1",
      "key_observation": "Question of truth not for this Court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Detention under section 3(2) of Preventive Detention Act by District Magistrate to prevent black-marketing is legal; subjective satisfaction sufficient; past conduct relevant for future apprehension.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Preventive Detention Act, 1950",
      "sections": [
        "Section 3(2)"
      ],
      "relevance": "Authorizes District Magistrate to detain if satisfied person acting prejudicial to maintenance of essential supplies; requires report to State Government with grounds."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for petitions for writs of habeas corpus in High Court."
    },
    {
      "name": "Essential Supplies Act",
      "sections": [],
      "relevance": "Basis for Government of Punjab Control Cloth Order."
    },
    {
      "name": "Cotton Cloth Control Order",
      "sections": [],
      "relevance": "Controlled distribution and prices of cloth."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The High Court dismissed the habeas corpus petitions challenging the detention orders. The Supreme Court upheld the High Court's judgment, finding no merit in the appellants' contentions regarding the legality of detention under the Preventive Detention Act, and dismissed the appeals.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Instances of past activities are relevant to be considered in giving rise to the subjective mental conviction of the District Magistrate that the appellants were likely to indulge in objectionable activities.",
      "speaker": "court",
      "significance": "Establishes relevance of past conduct for preventive detention."
    },
    {
      "text": "The Legislature has made only the subjective satisfaction of the authority making the order essential for passing the order.",
      "speaker": "court",
      "significance": "Limits judicial review to procedural compliance, not sufficiency of grounds."
    },
    {
      "text": "It is common knowledge that licences can be obtained in the name of nominees.",
      "speaker": "court",
      "significance": "Rejects argument that licence cancellation prevents future black-marketing."
    }
  ],
  "_case_id": "1951_73",
  "_label": 0,
  "_text_length": 16370,
  "_extracted_at": "2026-02-08T22:16:34.024756"
}