{
  "metadata": {
    "case_name": "Appellants (Landlords) v. Respondents (Tenants)",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "Fazl Ali, J."
    ],
    "case_number": "Appeal from Patna High Court A.S. 2280 of 1948",
    "date_of_judgment": "1951-02-02"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents have been in occupation as a monthly tenant of several blocks of premises belonging to the appellants at a monthly rental of Rs. 112.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Rent for the months of March, April and May 1947 having fallen into arrears.",
      "type": "material",
      "date": "1947-03-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondents remitted arrears along with rent for June on 28th June 1947 by means of two cheques, which appellants did not accept.",
      "type": "material",
      "date": "1947-06-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 4th August 1947, respondents remitted the amount by postal money order.",
      "type": "material",
      "date": "1947-08-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On 12th August 1947, appellants applied to the House Controller for eviction of respondents under section 11(1)(a) of the Bihar Buildings (Lease, Rent and Eviction) Control Act, 1947, maintaining non-payment of rent.",
      "type": "procedural",
      "date": "1947-08-12",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On 30th August 1947, respondents deposited rent up to June in the Office of the House Controller after money order returned by appellants.",
      "type": "material",
      "date": "1947-08-30",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "House Controller passed order on 10th November 1947 directing eviction by 10th May 1948, holding non-payment of rent.",
      "type": "procedural",
      "date": "1947-11-10",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Order upheld by Commissioner on appeal on 27th April 1948.",
      "type": "procedural",
      "date": "1948-04-27",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Respondents filed suit in Patna Munsif's Court for declaration that Controller's order dated 10th November 1947 was illegal, ultra vires and without jurisdiction (Suit No. 62 of 1948).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Suit dismissed by Munsif; decree upheld by Subordinate Judge on appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Patna High Court reversed, decreed suit holding Rent Controller's order without jurisdiction (A.S. 2280 of 1948, judgment 25th March 1949).",
      "type": "procedural",
      "date": "1949-03-25",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "At inception of tenancy, respondents paid one month's rent in advance, agreed to adjust on default for full one month.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was non-payment of rent within the meaning of section 11(1)(a) of the Bihar Act, and whether the House Controller had jurisdiction to order eviction.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the House Controller is competent to decide the condition precedent of non-payment of rent, and if his decision is final and cannot be questioned in a civil court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There was non-payment of rent as it was not paid as and when it fell due; rent for March due in April, April in May, no payment until 28 June 1947; advance only adjustable for one month, but three months due in monthly tenancy.",
      "supporting_facts": [
        "f2",
        "f3",
        "f12"
      ],
      "legal_basis": "Section 11(1)(a) Bihar Buildings (Lease, Rent and Eviction) Control Act, 1947"
    },
    {
      "id": "pa2",
      "text": "House Controller competent to decide whether condition precedent (non-payment) satisfied; once decided, cannot be questioned in civil court due to scheme of the Act.",
      "supporting_facts": [
        "f5",
        "f7",
        "f8"
      ],
      "legal_basis": "Sections 11, 16, 18(3) Bihar Act; 12 Patna 117"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No non-payment of rent in fact; eviction only if non-payment established; Controller lacked jurisdiction.",
      "supporting_facts": [
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": "Section 11(1)(a) Bihar Act; interpreted with Transfer of Property Act s.111; equity against forfeiture"
    },
    {
      "id": "ra2",
      "text": "Act protects tenants; irregular payment not non-payment; Controller's decision on law questionable in court; deposit before order saves tenancy.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Preamble and object of Bihar Act to prevent unreasonable eviction"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Point is simple: respondents attack eviction order claiming no non-payment hence no jurisdiction; appellants contend non-payment as not paid when due.",
      "addresses_issue": "i1",
      "key_observation": "High Court's view incorrect."
    },
    {
      "id": "cr2",
      "text": "Section 11 self-contained, notwithstanding any other law; no need for Transfer of Property Act; Controller decides non-payment, empowered by ss.11,16,18; decision final subject only to Commissioner.",
      "addresses_issue": "i2",
      "key_observation": "Act sets complete machinery; civil court cannot question Controller's decision on jurisdictional fact."
    },
    {
      "id": "cr3",
      "text": "Cites Queen v. Commissioners: legislature entrusts tribunal jurisdiction including to determine preliminary facts; no appeal means final.",
      "addresses_issue": "i2",
      "key_observation": "Controller given jurisdiction to decide non-payment without appeal beyond Commissioner."
    },
    {
      "id": "cr4",
      "text": "Cites Colonial Bank v. Willan: adjudication by judge with jurisdiction conclusive if no defect on face; cannot quash on erroneous fact finding.",
      "addresses_issue": "i2",
      "key_observation": "Controller's decision on non-payment not collaterally impeachable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "House Controller empowered to decide non-payment of rent; his decision final under the Act and not question able in civil court.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court's interpretation enlarging tenant protection beyond ordinary law rejected; s.11 does not import T.P. Act relief against forfeiture.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "The Queen v. Commissioners for Special Purposes of the Income Tax",
      "citation": "21 Q.B.D. 313",
      "treatment": "followed",
      "relevance": "Legislature may entrust tribunal jurisdiction to determine preliminary facts; decision final if no appeal."
    },
    {
      "case_name": "The Colonial Bank of Australasia v. Willan",
      "citation": null,
      "treatment": "followed",
      "relevance": "Adjudication by tribunal with jurisdiction conclusive on facts; not quashable on erroneous findings."
    },
    {
      "case_name": "Unnamed case",
      "citation": "12 Patna 117",
      "treatment": "referred",
      "relevance": "Court decision on jurisdictional fact cannot be collaterally impeached."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bihar Buildings (Lease, Rent and Eviction) Control Act, 1947 (Bihar Act III of 1947)",
      "sections": [
        "11(1)(a)",
        "11(2)(b)",
        "12",
        "16",
        "18(3)"
      ],
      "relevance": "Defines grounds for eviction including non-payment; empowers Controller to enquire, decide bona fides, order eviction; provides appeal to Commissioner, finality of orders."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "111"
      ],
      "relevance": "Mentioned by High Court for relief against forfeiture but rejected as inapplicable due to 'notwithstanding' clause in s.11 Bihar Act."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court held High Court's view incorrect, upheld House Controller's jurisdiction to decide non-payment and finality of order; impliedly allowed appeal reversing High Court decree declaring Controller's order illegal.",
    "relief_granted": "Eviction order of House Controller upheld; civil suit declaration set aside.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Section 11 is a self-contained section, and it is wholly unnecessary to go outside the Act for determining whether a tenant is liable to be evicted or not, and under what conditions he can be evicted.\"",
      "speaker": "court",
      "significance": "Emphasizes Act's exclusivity over other laws like T.P. Act."
    },
    {
      "text": "\"The Act thus sets up a complete machinery for the investigation of those matters upon which the jurisdiction of the Controller to order eviction of a tenant depends, and it expressly makes his order final.\"",
      "speaker": "court",
      "significance": "Core holding on finality and jurisdiction."
    },
    {
      "text": "\"It seems to us that the view taken by the High Court is not correct.\"",
      "speaker": "court",
      "significance": "Direct reversal of High Court."
    }
  ],
  "_case_id": "1951_6",
  "_label": 1,
  "_text_length": 13921,
  "_extracted_at": "2026-02-10T19:18:54.556851"
}