{
  "metadata": {
    "case_name": "Appellant (Regional Deputy Iron and Steel Controller) v. Respondent (State)",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "KANIA C.J."
    ],
    "case_number": "Criminal Appeal No. 1 of 1950",
    "date_of_judgment": "1951-03-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In 1947 the appellant held the office of Regional Deputy Iron and Steel Controller, Kanpur Circle, U.P., and was a public servant.",
      "type": "background",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The police having suspected the appellant to be guilty of the offences under sections 161 and 165 of the Indian Penal Code applied to the Deputy Magistrate, Kanpur, for a warrant of his arrest on the 22nd of October, 1947.",
      "type": "procedural",
      "date": "1947-10-22",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "The warrant was issued on the 23rd of October, 1947.",
      "type": "procedural",
      "date": "1947-10-23",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The appellant was arrested on the 27th of October, 1947, but was granted bail.",
      "type": "procedural",
      "date": "1947-10-27",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "On the 26th of November, 1947, the District Magistrate cancelled his bail as the Magistrate considered that the sureties were not proper.",
      "type": "procedural",
      "date": "1947-11-26",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "On the 1st of December, 1947, the Government appointed a Special Magistrate to try offences under the Act and on the 1st December, 1947, the appellant was produced before the Special Magistrate and was granted bail.",
      "type": "procedural",
      "date": "1947-12-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The police continued their investigation.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "On the 6th of December, 1948, sanction was granted by the Provincial Government to prosecute the appellant inter alia under sections 161 and 165 of the Indian Penal Code.",
      "type": "procedural",
      "date": "1948-12-06",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "On the 31st January, 1949, sanction in the same terms was granted by the Central Government.",
      "type": "procedural",
      "date": "1949-01-31",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "In the meantime as a result of an appeal made by the appellant to the High Court of Allahabad the amount of his bail was reduced.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "On the 25th of March, 1949, the appellant was ordered to be put up before the Magistrate to answer the charge-sheet submitted by the prosecution.",
      "type": "procedural",
      "date": "1949-03-25",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Special Magistrate refused to quash the proceedings on the ground that the prosecution was illegal and without jurisdiction in the absence of sanction.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Allahabad High Court dismissed the revision petition of the appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "On the 25th March, 1949, the Magistrate issued a notice under section 190 of the Criminal Procedure Code against the appellant and made it returnable on the 2nd of May, 1949.",
      "type": "procedural",
      "date": "1949-03-25",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "On the returnable date the appellant contended that the sanction of the Central Government was void because it was not given by the Government of the State. On the decision going against him he appealed to the High Court and to the Privy Council.",
      "type": "procedural",
      "date": "1949-05-02",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Magistrate took cognizance of the offence on 22nd/23rd October 1947 when issuing the warrant for arrest, requiring prior sanction under section 107 CrPC and section 6 PC Act, making the proceedings illegal.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "When does a Magistrate take cognizance of an offence under section 190 CrPC in relation to offences under sections 161/165 IPC deemed cognizable by section 3 PC Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "When the warrant for his arrest was issued by the Magistrate on the 22nd/23rd of October, 1947, the Magistrate took cognizance of the offence and, as no sanction of the Government had been obtained before that day, the initiation of the proceedings against him, which began on that day without the sanction of the Government, was illegal.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Section 190 CrPC; Emperor v. Sourindra Mohan Chuckerbutty"
    },
    {
      "id": "pa2",
      "text": "The same proceedings are continuing against him and therefore the notice to appear before the Magistrate issued on 25th March, 1949, is also illegal.",
      "supporting_facts": [
        "f11",
        "f14"
      ],
      "legal_basis": "Sections 161, 165 IPC; Section 107 CrPC; Section 6 PC Act"
    },
    {
      "id": "pa3",
      "text": "Without such cognizance the Magistrate had no jurisdiction to issue any process as that was the only section which permitted the Magistrate to issue a process against a person suspected of having committed an offence.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 190 CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The warrant was issued under proviso to section 3 PC Act during police investigation of a cognizable offence, before cognizance under section 190 CrPC or section 6 PC Act.",
      "supporting_facts": [
        "f2",
        "f3",
        "f7"
      ],
      "legal_basis": "Section 3 PC Act; Section 190 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Initiation of proceedings commences on cognizance of the offence by the Magistrate under one of the three contingencies in section 190 CrPC. For cognizable offences, police can arrest without Magistrate order during investigation; warrant under proviso to s.3 PC Act is for arrest during investigation, not cognizance.",
      "addresses_issue": "i2",
      "key_observation": "The order of the Magistrate under proviso to s.3 PC Act is during police investigation and not when they have completed investigation and are initiating proceedings under s.190 CrPC."
    },
    {
      "id": "cr2",
      "text": "Offences under ss.161/165 IPC are non-cognizable under CrPC but deemed cognizable by s.3 PC Act; proviso limits police powers but warrant issuance is not cognizance.",
      "addresses_issue": "i1",
      "key_observation": "Assumption that Magistrate can issue warrant only after taking cognizance under s.190 CrPC is unsound; proviso to s.3 expressly covers Magistrate issuing warrant for arrest in course of investigation."
    },
    {
      "id": "cr3",
      "text": "Section 197 CrPC and s.6 PC Act require sanction before court takes cognizance (initiation stage), not during investigation.",
      "addresses_issue": "i1",
      "key_observation": "Stage at which warrant asked under proviso to s.3 PC Act is not cognizance as contemplated by ss.190/197 CrPC and s.6 PC Act."
    },
    {
      "id": "cr4",
      "text": "Distinguishes Emperor v. Sourindra Mohan Chuckerbutty: observations on cognizance must be read in light of facts where Magistrate expressly took cognizance.",
      "addresses_issue": "i1",
      "key_observation": "That decision does not help the appellant."
    },
    {
      "id": "cr5",
      "text": "Cognizance occurs when Magistrate applies mind for purpose of proceeding under subsequent provisions like s.200/202 CrPC, not for ordering investigation or search warrant.",
      "addresses_issue": "i2",
      "key_observation": "In present case, Magistrate took cognizance only on 25th March 1949 when issuing notice under s.190 CrPC."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Issuance of arrest warrant under proviso to s.3 PC Act during police investigation does not constitute taking cognizance under s.190 CrPC; cognizance taken on 25 March 1949 when notice issued.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Proceedings not illegal for lack of prior sanction at arrest warrant stage.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Emperor v. Sourindra Mohan Chuckerbutty",
      "citation": "I.L.R. 37 Cal. 412",
      "treatment": "distinguished",
      "relevance": "Observations on meaning of 'cognizance' relied on by appellant but distinguished based on facts where Magistrate expressly took cognizance."
    },
    {
      "case_name": "Gopal Marwari v. Emperor",
      "citation": "A.I.R. 1943 Pat. 245",
      "treatment": "followed",
      "relevance": "'Cognizance' indicates point when Magistrate first takes judicial notice of offence; condition precedent to initiation of proceedings."
    },
    {
      "case_name": "Superintendent and Remembrancer of Legal Affairs, West Bengal v. Abani Kumar Banerjee",
      "citation": "A.I.R. 1950 Cal. 437",
      "treatment": "followed",
      "relevance": "Cognizance under s.190(1)(a) CrPC requires applying mind for purpose of proceeding under subsequent sections, not for other actions like ordering investigation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "161",
        "165"
      ],
      "relevance": "Offences alleged against public servant; deemed cognizable by PC Act s.3"
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "190",
        "167",
        "197",
        "107"
      ],
      "relevance": "S.190: Taking cognizance; s.197: Sanction for public servants; s.107: Sanction requirement; s.167: Police remand"
    },
    {
      "name": "Prevention of Corruption Act, II of 1947",
      "sections": [
        "3",
        "6"
      ],
      "relevance": "S.3: Deems ss.161/165 IPC cognizable with provisos on investigation/arrest; s.6: Sanction required before cognizance"
    },
    {
      "name": "Criminal Law Amendment Act, XIV of 1908",
      "sections": [
        "2"
      ],
      "relevance": "Mentioned in cited precedent"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave against the Allahabad High Court's order dismissing the revision petition, holding that the arrest warrant was issued during investigation under proviso to s.3 PC Act and not cognizance under s.190 CrPC, so prior sanction not required and proceedings valid.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is clear from the wording of the section that the initiation of the proceedings against a person commences on the cognizance of the offence by the Magistrate under one of the three contingencies mentioned in the section.",
      "speaker": "court",
      "significance": "Defines when proceedings initiate via cognizance under s.190 CrPC"
    },
    {
      "text": "The order which may be applied for and made during the police investigation by virtue of section 3 of the Act is therefore before the Magistrate has taken cognizance of the offence under section 6 of the Act or section 190 of the Criminal Procedure Code.",
      "speaker": "court",
      "significance": "Key holding distinguishing investigation stage from cognizance"
    },
    {
      "text": "When the magistrate applies his mind not for the purpose of proceeding under the subsequent sections of this Chapter, but for taking action of some other kind, e.g., ordering investigation under section 156(3), or issuing a search warrant for the purpose of the investigation, he cannot be said to have taken cognizance of the offence.",
      "speaker": "court",
      "significance": "Quotes Abani Kumar Banerjee on precise meaning of cognizance"
    }
  ],
  "_case_id": "1951_15",
  "_label": 0,
  "_text_length": 16722,
  "_extracted_at": "2026-02-08T22:15:43.671973"
}