{
  "metadata": {
    "case_name": "Bajrang Bahadur Singh v. Bakhtraj Kuer",
    "case_year": 1952,
    "court": "Supreme Court of India",
    "judges": [
      "MUKHERJEE J."
    ],
    "case_number": "Civil Appeal No. 147 of 1951",
    "date_of_judgment": "1952-11-07"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Raja Bisheshwar Bux Singh, father of plaintiff Bajrang Bahadur Singh and husband of defendant Bakhtraj Kuer's late husband Dhuj Singh, was taluqdar of Oudh; succeeded to Gangwat Estate in 1925.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Raja Bisheshwar Bux Singh died on 16th October 1930, leaving two sons: elder Bajrang Bahadur (plaintiff) and younger Dhuj Singh.",
      "type": "material",
      "date": "1930-10-16",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Raja Bisheshwar executed will dated 11th September 1929 bequeathing five properties (lists A and B in plaint) to Dhuj Singh for maintenance of him and his heirs.",
      "type": "material",
      "date": "1929-09-11",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On Raja Bisheshwar's death, estate devolved to plaintiff as eldest son under Oudh Estates Act; Dhuj Singh got only the five properties under the will.",
      "type": "material",
      "date": "1930-10-16",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Dhuj Singh died in 1940 without issue, survived by widow Bakhtraj Kuer (defendant).",
      "type": "material",
      "date": "1940",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Disputes arose over the five properties between plaintiff and defendant after Dhuj Singh's death.",
      "type": "disputed",
      "date": "1940",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Plaintiff initially succeeded in mutation of properties in revenue records in his name, but appellate revenue authority set it aside and directed mutation in defendant's name.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Plaintiff filed Regular Suit No. 1 of 1941 in Court of Civil Judge, Bahraich, for declaration of title to five properties (lists A and B), claiming they vested in him on Dhuj Singh's death.",
      "type": "procedural",
      "date": "1941",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Four properties in list A are taluqdari; fifth in list B is not taluqdari.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Claim to properties in list C (not covered by will) abandoned during trial.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Civil Judge, Bahraich, dismissed suit on 23 October 1941, holding Dhuj Singh got life interest, followed by successive life estates to his personal heirs, with ultimate remainder to estate holder.",
      "type": "procedural",
      "date": "1941-10-23",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Plaintiff appealed to Chief Court of Oudh (First Civil Appeal No. 139 of 1941); affirmed dismissal on 4 September 1946 by Misra and Wallford JJ.",
      "type": "procedural",
      "date": "1946-09-04",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Plaintiff obtained certificate from High Court of Allahabad (after amalgamation) and appealed to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Dhuj Singh got an absolute estate or only a life interest in the properties under his father's will.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If life interest only, whether the will validly created subsequent successive life interests in favour of Dhuj Singh's personal heirs, including the defendant widow.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Applicability of sections 13A, 14, and 22(5) of Oudh Estates Act to succession to taluqdari properties if Dhuj Singh had absolute interest.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Dhuj Singh had only life interest in properties; on his death, they vested in plaintiff as heir of late Raja.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "Construction of will"
    },
    {
      "id": "pa2",
      "text": "Even if absolute interest to Dhuj Singh, plaintiff entitled to taluqdari properties (list A) under section 14(b) read with section 22(5) of Oudh Estates Act, as brother prefers over widow.",
      "supporting_facts": [
        "f9",
        "f2"
      ],
      "legal_basis": "Oudh Estates Act sections 13A(1), 14, 22(5)"
    },
    {
      "id": "pa3",
      "text": "Successive life estates in favour of unborn heirs invalid; cites Tagore v. Tagore.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Tagore v. Tagore; rule against interests to unborn"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Bisheshwar as full owner competent to dispose; will created life estate for Dhuj Singh followed by devise to his widow as personal heir; properties vested in defendant.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "Construction of will"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 14 Oudh Estates Act applies only if Dhuj Singh absolute owner; but taluqdar can create limited interests (ss 11,12 permit, subject to perpetuity).",
      "addresses_issue": "i3",
      "key_observation": "Dhuj Singh within s13A(1), but s14 inapplicable if not absolute owner."
    },
    {
      "id": "cr2",
      "text": "Will inartistic; preamble shows intent to provide for Dhuj Singh and his heirs/successors generation after generation without trouble or quarrel; no power of transfer.",
      "addresses_issue": "i1",
      "key_observation": "Words 'absolute owner' (malik kamil) and 'generation after generation' (naslan bad naslan) indicate heritable but not alienable estate."
    },
    {
      "id": "cr3",
      "text": "Dominant intention: series of life estates to Dhuj Singh and successive personal heirs (per general law, not estate succession), no alienation, revert to estate on failure of line.",
      "addresses_issue": "i1",
      "key_observation": "Dhuj Singh got life interest only; restraint on alienation consistent with limited estate."
    },
    {
      "id": "cr4",
      "text": "Successive life estates valid as gift to class (heirs); valid for existing persons (Dhuj Singh, potential widow/son at testator's death), invalid for unborn.",
      "addresses_issue": "i2",
      "key_observation": "Defendant as widow (personal heir) entitled to life estate."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Dhuj Singh had only life interest under will, not absolute estate.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Will creates valid successive life estates to Dhuj Singh's personal heirs; defendant entitled during her life.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Sections 13A, 14 Oudh Estates Act inapplicable as no absolute ownership to Dhuj Singh.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Tagore v. Tagore",
      "citation": "18 Weekly Report 359",
      "treatment": "followed",
      "relevance": "Gift to class valid for existing persons, invalid for unborn."
    }
  ],
  "statutes_cited": [
    {
      "name": "Oudh Estates Act, 1869",
      "sections": [
        "Section 11",
        "Section 12",
        "Section 13",
        "Section 13A",
        "Section 14",
        "Section 22(5)"
      ],
      "relevance": "Powers of disposition (s11); perpetuity rule (s12); transfers to specified persons (ss13,13A); succession rules if absolute (s14); preference in taluqdari succession (s22(5))."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court affirmed lower courts' dismissal of plaintiff's suit; held Dhuj Singh had life interest under will, followed by valid life estate to defendant as personal heir; properties not vesting in plaintiff.",
    "relief_granted": "None to plaintiff; defendant retains possession during life.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'absolute owner' (Malik kamil) and 'generation after generation' (naslan bad naslan) ... indicate heritable and alienable estate ... unless something in context indicates otherwise.",
      "speaker": "court",
      "significance": "Court's interpretation of key will terms favoring limited estate."
    },
    {
      "id": "kq2",
      "text": "The dominant intention of the testator was to make provision not for Dhuj Singh alone but for the benefit of his heirs and successors, generation after generation.",
      "speaker": "court",
      "significance": "Crux of will construction: successive interests intended."
    },
    {
      "id": "kq3",
      "text": "If God forbid, Dhuj Singh may not be living at the time of my death, his son or whoever may be his male heir or widow may remain in possession ... as an absolute owner.",
      "speaker": "court",
      "significance": "Verbatim from will showing provision for widow."
    }
  ],
  "_case_id": "1952_105",
  "_label": 0,
  "_text_length": 17057,
  "_extracted_at": "2026-02-08T22:12:10.346931"
}