{
  "metadata": {
    "case_name": "Lachhman Singh, Katha Singh, Massa Singh, Charan Singh and Swaran Singh v. State",
    "case_year": 1952,
    "court": "Supreme Court of India",
    "judges": [
      "Fazl Ali J."
    ],
    "case_number": "Criminal Appeal No. 22 of 1950",
    "date_of_judgment": "1952-03-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On the evening of 16th December, 1948, a little before sunset, Achhar Singh went to the house of Inder Singh in village Dalam for getting paddy husked.",
      "type": "material",
      "date": "1948-12-16",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Darshan Singh, brother of Achhar Singh, who was working as a driver at Amritsar, came to Dalam from Amritsar the same evening and went to Inder Singh's house on learning Achhar Singh was there.",
      "type": "material",
      "date": "1948-12-16",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "While the two brothers were returning home, they were attacked by the three appellants and two of their relatives in a lane adjoining Inder Singh's house. The five assailants, armed with deadly weapons, inflicted injuries resulting in death of Darshan Singh and Achhar Singh then and there.",
      "type": "material",
      "date": "1948-12-16",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "After the murder, the appellants and companions tied the dead bodies in two kheses (wrappers) and took them to village Saleempura where Ajaib Singh and Banta Singh joined them, and the bodies were dismembered and thrown into Sakinala stream about five miles from Dalam.",
      "type": "material",
      "date": "1948-12-16",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Bela Singh, father of deceased, witnessed the occurrence but stayed in village at night due to fear, started next morning two hours before sunrise and lodged first information report at 10 A.M. at nearest police station.",
      "type": "procedural",
      "date": "1948-12-17",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Police officer arrived in Dalam shortly after FIR, investigation led to charge-sheet against seven persons including present appellants.",
      "type": "procedural",
      "date": "1948-12-17",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In June 1947, Natha Singh, father of third appellant Swaran Singh, was murdered; Darshan Singh acquitted, Achhar Singh sentenced to 1.5 years R.I., Sulakhan Singh to 7 years R.I. Achhar Singh released on bail by appellate court and at large.",
      "type": "background",
      "date": "1947-06",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Second appellant Massa Singh arrested on 18th December 1948 wearing pyjama stained with human blood.",
      "type": "material",
      "date": "1948-12-18",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Third appellant Swaran Singh arrested on 18th December 1948, on 19th December took police to locked haveli where two blood-stained kheses (wrappers) recovered.",
      "type": "material",
      "date": "1948-12-19",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Swaran Singh pointed out spot on way to Sakinala where bodies placed temporarily, blood-stained earth scrapped; led to bank of Sakinala, pointed out trunk of Darshan Singh's body.",
      "type": "material",
      "date": "1948-12-19",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Lachhman Singh arrested on 28th December 1948, pointed out dilapidated khola near Sakinala where 3 spears, one kirpan and a datar, all stained with human blood, recovered.",
      "type": "material",
      "date": "1948-12-28",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Sessions trial: Five accused charged u/s 302/149 and 201/149 IPC, two u/s 201/149; convicted appellants and two others u/s 302/149 to life transportation, Ajaib Singh u/s 201/149 to 3 years RI, Banta acquitted.",
      "type": "procedural",
      "date": "1949-08-05",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court upheld conviction of three appellants, acquitted remaining three; granted certificate u/art 134(1)(c) Constitution.",
      "type": "procedural",
      "date": "1950-06-29",
      "source": "high_court"
    },
    {
      "id": "f14",
      "text": "Direct evidence: Eye-witnesses Bela Singh (father), Inder Singh and wife Mst. Taro (at husking house), Gurcharan Singh (passing on cycle).",
      "type": "material",
      "date": "1948-12-16",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Doctor found partially digested rice in stomachs of deceased.",
      "type": "material",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "All three accused interrogated morning of 19th December 1948, made statements recorded disclosing bodies thrown in Sakinala; then went to Sakinala, each pointed out places where body parts discovered.",
      "type": "material",
      "date": "1948-12-19",
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether oral evidence of eye-witnesses is reliable without corroboration by circumstantial evidence.",
      "framed_by": "high_court"
    },
    {
      "id": "i2",
      "text": "Admissibility of discoveries under section 27 Evidence Act when multiple accused give information leading to same discoveries.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether circumstantial evidence sufficiently corroborates identification of particular accused.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Motive facts constitute strong motive for murder but equally strong motive for false implication as murderers could not be identified.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Blood-stained pyjama on Massa Singh: extent of stains unclear, improbable to wear after crime.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Recoveries at instance of Lachhman Singh suspicious due to police investigation method creating evidence.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Discoveries at Swaran Singh's instance not admissible u/s 27 Evidence Act as multiple accused gave information, unclear who first; cannot re-discover same fact.",
      "supporting_facts": [
        "f9",
        "f10",
        "f16"
      ],
      "legal_basis": "Section 27 Indian Evidence Act"
    },
    {
      "id": "pa5",
      "text": "Post-mortem shows partially digested rice, indicating occurrence after evening meal at night.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Facts constitute strong motive for murder by appellants.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court did not condemn oral evidence but required corroboration by circumstances as prudence; each appellant's case supported by such evidence.",
      "addresses_issue": "i1",
      "key_observation": "Corroboration not like for accomplice but to assure involvement."
    },
    {
      "id": "cr2",
      "text": "Blood-stained pyjama criticism considered by courts below, does not affect conclusion.",
      "addresses_issue": "i3",
      "key_observation": "Not function of Supreme Court to reassess facts."
    },
    {
      "id": "cr3",
      "text": "Recoveries at Lachhman Singh's instance: argument on facts rejected as not prevailing below.",
      "addresses_issue": "i3",
      "key_observation": "Supreme Court does not reassess evidence."
    },
    {
      "id": "cr4",
      "text": "S.27 Evidence Act: Even if only first information admissible, Swaran Singh's was initial pointing out leading to specific discoveries; multiple info possible but leading to spot crucial.",
      "addresses_issue": "i2",
      "key_observation": "Swaran Singh led to particular spot, blood earth, trunk."
    },
    {
      "id": "cr5",
      "text": "Post-mortem rice digestion: many factors, no data on last meal; does not affect timing.",
      "addresses_issue": "i3",
      "key_observation": "Medical jurisprudence shows variability."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Circumstantial evidence sufficiently corroborates oral evidence against three appellants.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Discoveries at Swaran Singh's instance admissible under S.27 as his specific leading to spots.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": null,
      "citation": null,
      "treatment": "referred",
      "relevance": "Rulings cited by appellants' counsel on S.27 limiting to first information; court inclined some gone too far, may review later."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302 read with 149",
        "201 read with 149"
      ],
      "relevance": "Charges and convictions for murder with common intention and causing disappearance of evidence."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "27"
      ],
      "relevance": "Admissibility of facts discovered in consequence of information from accused."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "134(1)(c)"
      ],
      "relevance": "Certificate for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court judgment convicting three appellants under section 302 read with section 149 IPC and sentencing to transportation for life.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "This evidence was so consistent, so reliable, and of such nature that in my opinion it is definitely established that the five accused... are proved to have actually murdered both Darshan Singh and Achhar Singh.",
      "speaker": "sessions_judge",
      "significance": "Sessions Judge's conclusion on eye-witness evidence."
    },
    {
      "text": "in all the circumstances of the case it would be proper not to rely upon the oral evidence implicating particular accused unless there is some circumstantial evidence to support it.",
      "speaker": "high_court",
      "significance": "High Court's standard for conviction."
    },
    {
      "text": "as at present advised we are inclined to think that some of the cases relied upon by the learned counsel for the appellants have perhaps gone farther than is warranted by the language of section 27.",
      "speaker": "court",
      "significance": "Supreme Court's view on S.27 precedents."
    }
  ],
  "_case_id": "1952_19",
  "_label": 0,
  "_text_length": 16288,
  "_extracted_at": "2026-02-08T22:11:31.646397"
}