{
  "metadata": {
    "case_name": "Seth Sobhagmal Lodha v. Edward Mills Co. Ltd. & Ors.",
    "case_year": 1952,
    "court": "Supreme Court of India",
    "judges": [
      "Mahajan J."
    ],
    "case_number": "Civil Appeal No. 105 of 1950",
    "date_of_judgment": "1952-11-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Edward-Mills Co. Ltd. is a joint stock company situate in Beawar, Ajmer-Merwara.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In accordance with the provisions of the articles of the company one Seth Gadh Mal Lodha and Rai Sahib Moti Lal (respondent No. 2) were its chairman and managing director respectively since 1916. Seth Gadh Mal Lodha represented his family firm of Kanwal Nain Hamir Singh, while Rai Sahib Moti Lal represented the joint family firm of Champa Lal Ram Swaroop.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "1st July, 1938, Rai Sahib Moti Lal and his firm were adjudged insolvents by the Bombay High Court. The result was that respondent No. 2 had to vacate the office of managing director and the members of his firm also became ineligible for it.",
      "type": "material",
      "date": "1938-07-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "By a resolution of the board of directors passed 18th July, 1938, Gadh Mal Lodha was appointed to take the place of Rai Sahib Moti Lal as managing director.",
      "type": "material",
      "date": "1938-07-18",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Gadh Mal Lodha died 11th January, 1942.",
      "type": "material",
      "date": "1942-01-11",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The board of directors then appointed Seth Sobhagmal Lodha to act as chairman as well as managing director till the appointment was made by the company.",
      "type": "material",
      "date": "1942-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "An extraordinary meeting of the company was called for the 8th February, 1942, for the election of the chairman. At this meeting conflict rose between the two groups represented by Sobhagmal Lodha and Moti Lal. The chairman therefore dissolved the meeting but the supporters of Moti Lal continued to hold it and passed a resolution appointing him as the sole agent and chairman for a period of twenty years at a remuneration equal to ten per cent of the profits of the company.",
      "type": "disputed",
      "date": "1942-02-08",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Seth Sobhagmal approached the District Judge of Ajmer with the prayer that a general meeting of the company may be held under the supervision of the court. This request was allowed 11th February, 1942, and the court ordered that the meeting be held 12th February, 1942, under the chairmanship of Seth Sobhagmal.",
      "type": "procedural",
      "date": "1942-02-11",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Respondent No. 2 filed an application in revision in the Court of the Judicial Commissioner impugning the order. The learned Judicial Commissioner allowed the revision and directed that the resolution of the 8th February, 1942, should be acted upon.",
      "type": "procedural",
      "date": "1942",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The appellant filed Civil Suit No. 28 of 1942 for quashing the resolution of the 8th February, 1942. In the plaint he asked for: (1) Declaration that the appointment of defendant No. 2 is illegal, invalid and ultra vires and that he has no right to act as chairman, managing director etc. of defendant No. 1. (2) Appointment of a receiver to take charge of the management of the company, until a properly qualified chairman managing director etc. are duly appointed.",
      "type": "procedural",
      "date": "1942",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "The plaint bore a court-fee stamp of Rs. 10 only, but on objection of the respondents that court-fee was payable on relief No. 2 the appellants paid ad valorem fee Rs. 51,000 which was the valuation of the suit for purposes of jurisdiction.",
      "type": "procedural",
      "date": "1942",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The Additional District Judge dismissed the suit on the preliminary ground that it was not maintainable as it related to the internal management of the company and that the appellants had no right to bring it without impleading the directors who were necessary parties to it.",
      "type": "procedural",
      "date": "1944-03-13",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Aggrieved, the appellants preferred an appeal (Civil First Appeal No. 16 of 1944) to the Court of the Judicial Commissioner, Ajmer-Merwara. The memorandum of appeal was stamped with a court-fee stamp of Rs. 10 and it was expressly stated therein that relief No. 2 of the plaint was given up.",
      "type": "procedural",
      "date": "1944",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Objection raised regarding the amount of court-fee paid on the memorandum of appeal. The Judicial Commissioner ordered that proper court-fees be paid thereon in a month. No reasons were given.",
      "type": "procedural",
      "date": "1945",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Additional fee not paid, Judicial Commissioner dismissed the appeal with costs on 22nd March, 1945.",
      "type": "procedural",
      "date": "1945-03-22",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Application for leave to appeal to the Privy Council refused. In the order refusing leave, reasons stated: Linked to s42 Specific Relief Act, consequential relief not sought independently.",
      "type": "procedural",
      "date": "1945",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Appeal by special leave granted by the Privy Council, limited to the question of court-fee.",
      "type": "procedural",
      "date": "1950",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the memorandum of appeal presented to the High Court court-fee was payable under section 7(iv)(e) or article 17 of Schedule II of the Court-Fees Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the finality under section 12 of the Court-Fees Act applies to decisions on category of relief or only valuation simpliciter, and whether the Judicial Commissioner could demand additional fee by considering merits/maintainability.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The only relief claimed in the memorandum of appeal was the first one mentioned in the plaint, being purely of a declaratory character, properly stamped under article 17 of Schedule II. Appellant relinquished relief No. 2 expressly.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Article 17 Schedule II Court-Fees Act; Brahmnandam v. Secretary of State for India; Ram Prasad v. Bhiman; Karam Chand v. Jullundur Bank Ltd.; Neelachalam v. Narasingha Das; Sah Bamehand v. Pannalal; Chuni Lal v. Sheo Charan"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The first relief claimed included consequential relief (no right to act as chairman etc.) and was not purely declaratory. Section 12 Court-Fees Act makes decision final.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Section 42 Specific Relief Act; Section 12 Court-Fees Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Relief in memo of appeal purely declaratory (negative declaration that defendant No. 2 has no right to act), no consequential relief claimed. Appellant can relinquish part of claim. Judicial Commissioner could not canvass merits (Specific Relief Act s42) for stamping purposes.",
      "addresses_issue": "i1",
      "key_observation": "The relief claimed in the memorandum of appeal determines the value of the appeal for purposes of court-fee."
    },
    {
      "id": "cr2",
      "text": "Section 12 finality limited to valuation/appraisement simpliciter, not category of suit or merits. Reconciles with CPC O VII R11 (appealable decree on rejection). Judicial Commissioner decided maintainability first, beyond s12 ambit.",
      "addresses_issue": "i2",
      "key_observation": "Whether a case falls under one particular section of the Act or another is a pure question of law and does not directly determine the valuation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Memorandum of appeal properly stamped under Article 17 Schedule II as subject-matter purely declaratory.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Section 12 Court-Fees Act finality does not cover decisions on category or merits; Judicial Commissioner had no jurisdiction to demand additional fee on that basis.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Brahmnandam v. Secretary of State for India",
      "citation": null,
      "treatment": "followed",
      "relevance": "Appellant can relinquish part of claim for court-fee purposes"
    },
    {
      "case_name": "Ram Prasad v. Bhiman",
      "citation": "1905 I.L.R. 27 All. 151",
      "treatment": "followed",
      "relevance": "Appellant can give up portion of claim"
    },
    {
      "case_name": "Karam Chand v. Jullundur Bank Ltd.",
      "citation": "A.I.R. 1927 Lah. 543",
      "treatment": "followed",
      "relevance": "Relinquish part unless inseparable"
    },
    {
      "case_name": "Neelachalam v. Narasingha Das",
      "citation": "A.I.R. 1931 Mad 716",
      "treatment": "followed",
      "relevance": "Same"
    },
    {
      "case_name": "Sah Bamehand v. Pannalal",
      "citation": "A.I.R. 1929 All. 308",
      "treatment": "followed",
      "relevance": "Same"
    },
    {
      "case_name": "Chuni Lal v. Sheo Charan",
      "citation": "1925 I.L.R. 47 All. 756",
      "treatment": "followed",
      "relevance": "Same"
    },
    {
      "case_name": "In re Omrao Mirza v. Mary Jones",
      "citation": "1883 12 C.L.R. 148",
      "treatment": "referred",
      "relevance": "Finality under s12 taken away by CPC"
    },
    {
      "case_name": "Tara Prasanna Chongdar v. Nrisingha Moorari Pal",
      "citation": "1924 I.LR. 51 Cal. 216",
      "treatment": "referred",
      "relevance": "Same"
    },
    {
      "case_name": "Tariman Khatun v. Secretary of State for India in Council",
      "citation": "I.L.R. 1940 2 Cal. 166",
      "treatment": "followed",
      "relevance": "s12 finality only valuation pure and simple, not category"
    },
    {
      "case_name": "Muhammad Sadik v. Muhammad Jan",
      "citation": "1889 I.L.R. 11 All. 91, F.B.",
      "treatment": "distinguished",
      "relevance": "Earlier extreme view on finality"
    },
    {
      "case_name": "Mahna Singh v. Bahadur Singh",
      "citation": "1919 Punjab Record 16",
      "treatment": "followed",
      "relevance": "Finality only valuation simpliciter"
    },
    {
      "case_name": "Mst. Parmeshri v. Panna Lal",
      "citation": "A.I.R. 1931 Lah. 378",
      "treatment": "followed",
      "relevance": "Same"
    },
    {
      "case_name": "Lakshmi Amma v. Janamajayam Nambiar",
      "citation": "1894 4 M.L.J. 183, F.B.",
      "treatment": "followed",
      "relevance": "Finality not for category"
    },
    {
      "case_name": "Annamalai Chetty v. Cloete",
      "citation": "1882 I.L.R. 4 Mad. 204",
      "treatment": "followed",
      "relevance": "Same"
    },
    {
      "case_name": "Narasimhalu Chetty v. Ramayya Naidu",
      "citation": "A.I.R. 1942 Mad. 502",
      "treatment": "followed",
      "relevance": "Explains earlier FB decision"
    },
    {
      "case_name": "Madana Mohana Naiko v. Krupasindhu Naiko",
      "citation": "A.I.R. 1937 Mad. 81",
      "treatment": "doubted",
      "relevance": "Obiter on broader finality"
    },
    {
      "case_name": "Dada v. Nagesh",
      "citation": "1899 I.L.R. 23 Bom. 486",
      "treatment": "followed",
      "relevance": "Same view as Lahore/Madras"
    },
    {
      "case_name": "Krishnaji Bari Dhandhere v. Gopal Narain Dhandhere",
      "citation": "A.I.R. 1936 Bom. 166",
      "treatment": "followed",
      "relevance": "Same"
    },
    {
      "case_name": "Vithal Krishna v. Balakrishna Janardan",
      "citation": "1886 I.L.R. 10 Bom. 610",
      "treatment": "distinguished",
      "relevance": "No appeal but revisional correction possible"
    },
    {
      "case_name": "Chandramoni Koer v. Basdeo Narain Singh",
      "citation": "1921 4 P.L.J. 57",
      "treatment": "followed",
      "relevance": "Same as Lahore"
    },
    {
      "case_name": "Gumani v. Banwari",
      "citation": "1920 54 I.C. 733",
      "treatment": "followed",
      "relevance": "Same"
    }
  ],
  "statutes_cited": [
    {
      "name": "Court-Fees Act",
      "sections": [
        "Section 7(iv)(e)",
        "Article 1 Schedule I",
        "Article 17 Schedule II",
        "Section 12",
        "Section 5"
      ],
      "relevance": "Determines stamping of memo of appeal based on relief claimed; s12 finality limited to valuation simpliciter"
    },
    {
      "name": "Specific Relief Act",
      "sections": [
        "Section 42"
      ],
      "relevance": "No declaration if consequential relief omitted; but merits not for court-fee determination"
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order VII Rule 11(b)(d)",
        "Section 2(2)"
      ],
      "relevance": "Rejection of plaint appealable as decree; reconciles with Court-Fees Act"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed. Order of Judicial Commissioner demanding additional court-fee and dismissing appeal held erroneous. Memorandum of appeal properly stamped under Article 17 Schedule II as purely declaratory relief claimed after relinquishing receivership prayer. Section 12 does not bar challenge as it went to merits/category.",
    "relief_granted": "Declaration that memo properly stamped; order set aside",
    "costs": "Not specified"
  },
  "key_quotes": [
    {
      "text": "\"The relief claimed in the memorandum of appeal determines the value of the appeal for purposes of court-fee.\"",
      "speaker": "court",
      "significance": "Core principle for stamping appeals"
    },
    {
      "text": "\"It is always open to the appellant in appeal to give up a portion of his claim and to restrict it.\"",
      "speaker": "court",
      "significance": "Right to relinquish relief for lower fee"
    },
    {
      "text": "\"Whether a case falls under one particular section of the Act or another is a pure question of law and does not directly determine the valuation.\"",
      "speaker": "court",
      "significance": "Limits s12 finality to appraisement, not category"
    }
  ],
  "_case_id": "1952_51",
  "_label": 1,
  "_text_length": 21933,
  "_extracted_at": "2026-02-10T19:14:40.441495"
}