{
  "metadata": {
    "case_name": "Lachhman Singh, Massa Singh and Swaran Singh v. State",
    "case_year": 1952,
    "court": "Supreme Court of India",
    "judges": [
      "Fazl Ali J."
    ],
    "case_number": "Criminal Appeal No. 22 of 1950",
    "date_of_judgment": "1952-03-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On the evening of 16th December, 1948, a little before sunset, Achhar Singh went to the house of Inder Singh in village Dalam for getting paddy husked.",
      "type": "material",
      "date": "1948-12-16",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Darshan Singh, brother of Achhar Singh, came from Amritsar to Dalam the same evening and went to Inder Singh's house upon learning Achhar Singh was there.",
      "type": "material",
      "date": "1948-12-16",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "While the two brothers were returning home, they were attacked by the three appellants (Lachhman Singh, Massa Singh, Swaran Singh) and two relatives in a lane adjoining Inder Singh's house.",
      "type": "material",
      "date": "1948-12-16",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "The five assailants, armed with deadly weapons, inflicted injuries on Darshan Singh and Achhar Singh, resulting in their death on the spot.",
      "type": "material",
      "date": "1948-12-16",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "After the murder, appellants and companions tied the dead bodies in two kheses (wrappers) and took them to village Saleempura where Ajaib Singh and Banta Singh joined; bodies were dismembered and thrown into Sakinala stream about five miles from Dalam.",
      "type": "material",
      "date": "1948-12-16",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Bela Singh, father of deceased, witnessed the occurrence but left village next morning about two hours before sunrise and lodged FIR at 10 A.M. at nearest police station.",
      "type": "procedural",
      "date": "1948-12-17",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Police officer arrived in Dalam shortly after FIR; investigation led to charge-sheet against seven persons including three appellants.",
      "type": "procedural",
      "date": "1948-12-17",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "In June 1947, Natha Singh (father of Swaran Singh) was murdered; Darshan Singh acquitted, Achhar Singh sentenced to 1.5 years RI, Sulakhan Singh to 7 years RI.",
      "type": "background",
      "date": "1947-06",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Achhar Singh released on bail by appellate court and at large at time of occurrence.",
      "type": "background",
      "date": "1948-12-16",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Direct evidence from four eyewitnesses: Bela Singh (father), Inder Singh and wife Mst. Taro, Gurcharan Singh (cyclist from another village).",
      "type": "material",
      "date": "1948-12-16",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Massa Singh arrested 18th December 1948, wearing pyjama stained with human blood.",
      "type": "material",
      "date": "1948-12-18",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Swaran Singh arrested 18th December 1948; on 19th December took police to locked haveli, two kheses (wrappers) stained with human blood recovered.",
      "type": "material",
      "date": "1948-12-19",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Swaran Singh pointed out spot on way to Sakinala where bodies placed temporarily; blood-stained earth scrapped.",
      "type": "material",
      "date": "1948-12-19",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Swaran Singh led police to bank of Sakinala and pointed out trunk of Darshan Singh's body.",
      "type": "material",
      "date": "1948-12-19",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Lachhman Singh arrested 28th December 1948; pointed out dilapidated khola near Sakinala where 3 spears, one kirpan, one datar, all stained with human blood, recovered.",
      "type": "material",
      "date": "1948-12-28",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Sessions trial: five accused charged under section 302/149 and 201/149 IPC, two under 201/149; convicted three appellants and two others under 302/149 to life transportation, Ajaib Singh under 201/149 to 3 years RI, acquitted Banta Singh.",
      "type": "procedural",
      "date": "1949-08-05",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "High Court (Weston J. and Khosla J.) upheld conviction of three appellants, acquitted remaining three; granted certificate under Article 134(1)(c) Constitution.",
      "type": "procedural",
      "date": "1950-06-29",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Doctor found partially digested rice in stomachs of deceased.",
      "type": "disputed",
      "date": "null",
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the oral evidence of eyewitnesses implicating the appellants is reliable and sufficiently corroborated by circumstantial evidence.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Admissibility under section 27 of Indian Evidence Act of discoveries made at instance of multiple accused where sequence of information not clearly established.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether time of occurrence consistent with prosecution case given partially digested rice in stomachs.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Motive facts constitute strong motive for false implication as murderers could not be seen or identified.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Blood-stained pyjama of Massa Singh: extent of stains unknown and improbable to continue wearing after crime.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Recoveries of weapons at instance of Lachhman Singh suspicious; police investigation not straightforward, deliberately creating evidence.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Discoveries at instance of Swaran Singh not admissible under section 27 Evidence Act as only first information admissible; cannot ascertain who gave information first among three accused.",
      "supporting_facts": [
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": "Section 27 Indian Evidence Act"
    },
    {
      "id": "pa5",
      "text": "Partially digested rice indicates occurrence at night after evening meals.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court did not condemn oral evidence but prudently required circumstantial corroboration to assure involvement of particular accused; this standard properly applied.",
      "addresses_issue": "i1",
      "key_observation": "Case of each appellant supported by circumstances."
    },
    {
      "id": "cr2",
      "text": "Blood-stained pyjama criticism considered by courts below; does not affect conclusion.",
      "addresses_issue": "i1",
      "key_observation": "Not reassess facts."
    },
    {
      "id": "cr3",
      "text": "Weapons recovery argument on facts did not prevail below; not for this Court to reassess.",
      "addresses_issue": "i1",
      "key_observation": "Scope of criminal appeal limited after sifting by trial and High Court."
    },
    {
      "id": "cr4",
      "text": "Under section 27, even if only first information admissible, Swaran Singh's was initial pointing out; led specifically to spots and recoveries.",
      "addresses_issue": "i2",
      "key_observation": "Indefinite information insufficient without leading to spot; multiple accused may provide if authentic."
    },
    {
      "id": "cr5",
      "text": "Partially digested rice does not necessarily indicate night time; many factors affect digestion, no data on meal time or food.",
      "addresses_issue": "i3",
      "key_observation": "Medical jurisprudence shows variability."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Oral evidence sufficiently corroborated by circumstantial evidence against each appellant; convictions under section 302/149 IPC sustainable.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Discoveries at instance of Swaran Singh admissible under section 27 Evidence Act.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": null,
      "citation": null,
      "treatment": "referred",
      "relevance": "Rulings cited by appellants' counsel on section 27 limiting to first information; Court inclined some gone too far, may review in future."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302 read with 149",
        "201 read with 149"
      ],
      "relevance": "Charges and convictions for murder with common intention and causing disappearance of evidence."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "27"
      ],
      "relevance": "Admissibility of facts discovered in consequence of information from accused."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "134(1)(c)"
      ],
      "relevance": "Certificate for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The convictions of the three appellants under section 302 read with section 149 IPC and sentences of transportation for life are upheld.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "This evidence was so consistent, so reliable, and of such nature that in my opinion it is definitely established that the five accused... are proved to have actually murdered both Darshan Singh and Achhar Singh.",
      "speaker": "lower_court",
      "significance": "Sessions Judge's conclusion on eyewitness evidence."
    },
    {
      "id": "kq2",
      "text": "in all the circumstances of the case it would be proper not to rely upon the oral evidence implicating particular accused unless there is some circumstantial evidence to support it.",
      "speaker": "lower_court",
      "significance": "High Court's standard for corroboration."
    }
  ],
  "_case_id": "1952_19",
  "_label": 0,
  "_text_length": 16288,
  "_extracted_at": "2026-02-10T19:14:45.800950"
}