{
  "metadata": {
    "case_name": "Gurubachan Singh v. Commissioner of Police, Bombay",
    "case_year": 1952,
    "court": "Supreme Court of India",
    "judges": [
      "MUKHERJEA J."
    ],
    "case_number": "Original Jurisdiction Petition No. 76 of 1952",
    "date_of_judgment": "1952-05-07"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner Gurubachan Singh is an Indian citizen residing with his father at Gogri Niwas, Vincent Road, Dadar; father has business in electrical goods in Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 23rd July 1951, petitioner served with externment order by Commissioner of Police, Bombay, under section 27(1) of City of Bombay Police Act, directing removal from Greater Bombay to native place at Amritsar in East Punjab, to comply within two days by rail.",
      "type": "material",
      "date": "1951-07-23",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 25th July 1951, petitioner applied to Commissioner for extension of time; granted till 30th July 1951.",
      "type": "procedural",
      "date": "1951-07-25",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 30th July 1951, petitioner wrote to Commissioner stating he did not desire to go to Amritsar, prayed to stay at Kalyan (outside Greater Bombay but within State of Bombay) with railway ticket from Dadar.",
      "type": "material",
      "date": "1951-07-30",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Police took petitioner to Kalyan on evening of 30th July 1951 and left him there, acting on his letter with sanction of Commissioner.",
      "type": "material",
      "date": "1951-07-30",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Petitioner commenced proceedings in Bombay High Court: first on original side under Letters Patent, then Appellate Criminal Bench under articles 226 and 228, complaining of externment order, praying for certiorari to quash it; both dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Petitioner approached Supreme Court under article 32 alleging infringement of fundamental rights under clauses (d) and (e) of article 19(1).",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the externment order is void as not in conformity with section 27(1) of City of Bombay Police Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether section 27(1) of City of Bombay Police Act conflicts with fundamental rights under clauses (d) and (e) of article 19(1), void under article 13(1).",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether section 27(1) is discriminatory and offends article 14.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Externment order void as not in conformity with section 27(1): directed removal from Greater Bombay but specified Amritsar (outside State), failing to specify place within State.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Section 27(1), City of Bombay Police Act"
    },
    {
      "id": "pa2",
      "text": "Section 27(1) imposes restrictions on rights under Art 19(1)(d),(e), void under Art 13(1); procedure unreasonable as no cross-examination of witnesses.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Articles 19(1)(d),(e), 13(1); Section 27(4)"
    },
    {
      "id": "pa3",
      "text": "Section 27(1) discriminatory, offends Art 14.",
      "supporting_facts": [],
      "legal_basis": "Article 14"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Not disputed that original order not in strict conformity with s.27(1), but subsequent conduct of petitioner (request to go to Kalyan, accepted by police) rectified defect.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Section 27(1)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Order directed removal from Greater Bombay but specified Amritsar (outside State); s.27(1) requires specification of place within State for Greater Bombay externment, none for State externment. Order as whole indicates intention for State externment; irregularity cured by petitioner's letter choosing Kalyan (within State), accepted and effected by police.",
      "addresses_issue": "i1",
      "key_observation": "Mistake rectified by petitioner's choice of Kalyan and police action; no substance in point."
    },
    {
      "id": "cr2",
      "text": "S.27(1) in interest of general public to protect against dangerous characters; restrictions on Art 19(1)(d) reasonable under Art 19(5). Max 2 years, can be revoked earlier. Procedure under s.27(4): written notice of allegations, opportunity to explain, appear by advocate, file statement, examine witnesses; no cross-examination needed as witnesses fear violence, defeating purpose. Power with high officer expected to act cautiously.",
      "addresses_issue": "i2",
      "key_observation": "Restrictions reasonable considering purpose, duration, revocability, and procedure for exceptional cases."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Externment order valid despite initial irregularity, cured by subsequent events.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Section 27(1) imposes reasonable restrictions under Art 19(5), not void under Art 13(1).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "City of Bombay Police Act, 1902",
      "sections": [
        "27(1)",
        "27(4)"
      ],
      "relevance": "Empowers Commissioner to issue externment orders in specified cases; procedure requires notice and opportunity to be heard; court upheld as reasonable restriction."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "32",
        "19(1)(d)",
        "19(1)(e)",
        "19(5)",
        "13(1)",
        "14",
        "226",
        "228"
      ],
      "relevance": "Art 32 invoked for petition; Arts 19(1)(d),(e) rights claimed infringed, reasonable under 19(5); void if unreasonable per 13(1); discriminatory per 14."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "Chapters XII, XVI, XVII"
      ],
      "relevance": "Offences involving force/violence or punishable thereunder trigger externment."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Court rejected petitioner's contentions, holding externment order valid after rectification and section 27(1) constitutional as imposing reasonable restrictions in public interest.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"We think that, in these circumstances, the order made on the 23rd July, 1951, might be construed to be an order of externment from Greater Bombay and though there was a mistake regarding the place where the externee was to remove himself to, the mistake was rectified by the petitioner choosing Kalyan as the place of residence and that choice being accepted and given effect to by the Police Department.\"",
      "speaker": "court",
      "significance": "Explains how irregularity in order was cured, upholding validity."
    },
    {
      "text": "\"The law is certainly an extraordinary one and has been made only to meet those exceptional cases where no witnesses for fear of violence to their person or property are willing to depose publicly against certain bad characters whose presence in certain areas constitutes a menace to the safety of the public residing therein.\"",
      "speaker": "court",
      "significance": "Justifies lack of cross-examination as reasonable for purpose of law."
    }
  ],
  "_case_id": "1952_33",
  "_label": 0,
  "_text_length": 11874,
  "_extracted_at": "2026-02-10T19:14:39.975216"
}