{
  "metadata": {
    "case_name": "Ajmer Singh v. State",
    "case_year": 1952,
    "court": "Supreme Court of India",
    "judges": [
      "Mahajan J."
    ],
    "case_number": "Criminal Appeal No. 67 of 1952",
    "date_of_judgment": "1952-12-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Nikka Singh had three sons: Bhagwan Singh (died issueless), Lal Singh, and Sunder Singh. Disputes arose between Lal Singh and Sunder Singh over division of Bhagwan Singh's property. Sunder Singh in possession of some properties; Lal Singh obtained decrees but Sunder declined to restore possession.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Relations between Lal Singh and Sunder Singh strained; not even on speaking terms due to litigation.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Lal Singh married to Mst. Dhan Kaur; sons: Bagher Singh (deceased) and Arjan Singh (PW 5). Accused Ajmer Singh son of Sunder Singh; real brother Banta Singh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Ajmer Singh married to Jagir Kaur; Banta Singh to Kartar Kaur.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Evening of 27th January 1948: Jagir Kaur complained to father-in-law (Sunder Singh) that husband Ajmer Singh pawned her ear-rings for gambling debts.",
      "type": "material",
      "date": "1948-01-27",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Morning of 28th January 1948: Banta Singh inquired from Ajmer Singh about ear-rings; Ajmer replied pawned to Banta Singh Mazhbi.",
      "type": "material",
      "date": "1948-01-28",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Ajmer Singh, Banta Singh, and Teja Singh went to Banta Singh Mazhbi demanding ear-rings; Mazhbi denied; offered Rs. 30 if Ajmer took oath. Lal Singh present, supported Mazhbi; exchange of hot words but no blows.",
      "type": "material",
      "date": "1948-01-28",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "At sunset 28th January 1948: Lal Singh and Sunder Singh abused each other from respective houses opening into common courtyard.",
      "type": "material",
      "date": "1948-01-28",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Abuse attracted Arjan Singh, Bagher Singh, Ujagar Singh Mazhbi to Lal Singh's house. Lal Singh challenged Sunder Singh to come out.",
      "type": "material",
      "date": "1948-01-28",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Sunder Singh, sons Banta Singh and Ajmer Singh, and Teja Singh (cousin) accepted challenge, rushed out armed with spears. Teja and Banta attacked Lal Singh and Dhan Kaur with spears. Ajmer Singh plunged spear into chest of Bagher Singh, who collapsed and died almost instantaneously.",
      "type": "material",
      "date": "1948-01-28",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Arjan Singh reported incident at police station (7 miles away) at 11:45 p.m., stating Ajmer Singh dealt barchha blow to Bagher Singh's chest.",
      "type": "material",
      "date": "1948-01-28",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Police arrested Sunder Singh, Teja Singh, Banta Singh; Ajmer Singh absconded, apprehended 4th December 1948.",
      "type": "procedural",
      "date": "1948-12-04",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Sunder, Teja, Banta prosecuted u/s 302/34 IPC, convicted u/s 324 IPC: Banta and Teja 2 years RI each, Sunder 6 months RI. On appeal, Sunder acquitted, sentences on others reduced. Lenient view as sudden fight between near relatives.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Ajmer Singh tried by Sessions Judge Ferozepore (Trial No. 28/1950, Case No. 5/1950), acquitted 13th May 1950.",
      "type": "procedural",
      "date": "1950-05-13",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "State appeal to High Court (Criminal Appeal No. 361/1950); acquittal set aside, convicted u/s 304 IPC, 10 years RI, judgment 14th September 1951.",
      "type": "procedural",
      "date": "1951-09-14",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Eye-witnesses: Lal Singh (PW3, father), Dhan Kaur (mother), Arjan Singh (brother). Ujagar Singh Mazhbi tendered but not questioned on fight. Bishandas (PW7) on morning quarrel.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Sessions Judge: Ajmer not present at morning quarrel (per Bishandas); witnesses suppressed facts, unreliable; acquitted due to enmity, no independent evidence.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "High Court: Minor variations natural after 27 months; Arjan's version consistent with FIR; Lal's omissions due to lapse of memory; sufficient reasons to distrust Sessions view.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Sessions examination of accused defective: Read committing court statement, general questions only; no separate questions on material circumstances.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Injuries on Kartar Kaur and Ujagar Singh not proved at occurrence time.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Ajmer Singh inflicted the fatal spear blow on Bagher Singh's chest, warranting conviction u/s 304 IPC, or whether acquittal by Sessions Judge should stand given credibility issues and lack of independent evidence.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether High Court erred in reversing acquittal without compelling reasons, disregarding presumption of innocence reinforced by acquittal order.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Sessions Judge's examination of accused u/s 342 CrPC was defective, vitiating the trial.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No compelling reasons to set aside acquittal; High Court gave insufficient weight to trial judge's opinion on credibility of witnesses seen by him.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "Presumption of innocence reinforced by acquittal order"
    },
    {
      "id": "pa2",
      "text": "High Court erred in holding accused must explain circumstances; cannot take shelter behind presumption of innocence.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Trial vitiated by defective examination u/s 342 CrPC: Sessions Judge merely read committing court statement and asked general questions.",
      "supporting_facts": [
        "f19"
      ],
      "legal_basis": "Section 342 CrPC; Tara Singh v. The State"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Strong prima facie case; accused duty to explain circumstances.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Reviewed evidence; inclined to agree with High Court: Difficult to believe Arjan Singh falsely implicated Ajmer immediately in FIR; no material discrepancies in identification.",
      "addresses_issue": "i1",
      "key_observation": "Arjan could not mistake identity in small fight (7-8 persons, few blows); corroborated by Lal Singh and Dhan Kaur."
    },
    {
      "id": "cr2",
      "text": "Sessions Judge exaggerated minor discrepancies; hypercritical. Bishandas' cryptic statement insufficient to rule out Ajmer's presence morning; Ujagar not questioned on fight.",
      "addresses_issue": "i1",
      "key_observation": "No withholding of independent witnesses; defence led no evidence."
    },
    {
      "id": "cr3",
      "text": "High Court had full power u/s 417 CrPC to review acquittal evidence; exercised properly.",
      "addresses_issue": "i2",
      "key_observation": "Reversal only for substantial and compelling reasons; here justified."
    },
    {
      "id": "cr4",
      "text": "Examination u/s 342 defective: Must question separately on each material circumstance; not discharged by reading committing court statement or general questions.",
      "addresses_issue": "i3",
      "key_observation": "No prejudice: Simple facts, accused aware via cross-exam and prior denial due to enmity."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Prosecution evidence reliable; Ajmer Singh inflicted fatal barchha blow to Bagher Singh.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Acquittal properly reversed by High Court for substantial reasons.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Defective s342 examination does not vitiate trial absent prejudice.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Tara Singh v. The State",
      "citation": "1951 S.C.R. 729",
      "treatment": "followed",
      "relevance": "Object of s342 CrPC is to afford accused fair opportunity to explain circumstances; questions must be fair and couched for illiterate to understand."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302/34",
        "304",
        "324"
      ],
      "relevance": "Conviction under 304 IPC for culpable homicide not amounting to murder; others under 324 for grievous hurt."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "342",
        "417"
      ],
      "relevance": "Examination of accused; High Court power to appeal against acquittal and review evidence."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave against High Court's reversal of acquittal and conviction u/s 304 IPC dismissed. Supreme Court agreed with High Court on credibility of eyewitnesses and held no prejudice from defective s342 examination.",
    "relief_granted": "None; conviction and 10 years RI upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "After an order of acquittal has been made the presumption of innocence is further reinforced by that order, and that being so, the trial court's decision can be reversed not on the ground that the accused had failed to explain the circumstances appearing against him but only for very substantial and compelling reasons.",
      "speaker": "court",
      "significance": "Clarifies standard for reversing acquittal on appeal."
    },
    {
      "text": "The accused must be questioned separately about each material circumstance which is intended to be used against him.",
      "speaker": "court",
      "significance": "Explains requirements of s342 CrPC examination."
    },
    {
      "text": "It is not sufficient compliance with the section to generally ask the accused that having heard the prosecution evidence, what he has to say about it.",
      "speaker": "court",
      "significance": "Rejects perfunctory examination as valid."
    }
  ],
  "_case_id": "1952_93",
  "_label": 0,
  "_text_length": 17522,
  "_extracted_at": "2026-02-10T19:14:35.709233"
}