{
  "metadata": {
    "case_name": "Ajmer Singh v. State",
    "case_year": 1952,
    "court": "Supreme Court of India",
    "judges": [
      "Mahajan J."
    ],
    "case_number": "Criminal Appeal No. 67 of 1952",
    "date_of_judgment": "1952-12-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Nikka Singh had three sons: Bhagwan Singh (died issueless), Lal Singh, and Sunder Singh. Disputes arose between Lal Singh and Sunder Singh over division of Bhagwan Singh's property. Sunder Singh in possession of some properties; Lal Singh obtained decrees but Sunder Singh declined to restore possession.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Relations between Lal Singh and Sunder Singh strained; not even on speaking terms due to litigation.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Lal Singh married to Mst. Dhan Kaur; two sons: Bagher Singh (deceased) and Arjan Singh (PW 5). Accused Ajmer Singh is son of Sunder Singh; real brother Banta Singh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Ajmer Singh married to Jagir Kaur; Banta Singh to Kartar Kaur.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Evening of 27th January 1948: Jagir Kaur complained to father-in-law (Sunder Singh) that husband Ajmer Singh pawned her ear-rings for gambling debts.",
      "type": "material",
      "date": "1948-01-27",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Morning of 28th January 1948: Banta Singh inquired from Ajmer Singh; he replied pawned to Banta Singh Mazhbi. Ajmer, Banta, Teja Singh went to Banta Mazhbi demanding return; he denied. Lal Singh present, supported Mazhbi, leading to exchange of hot words. Parties dispersed without blows.",
      "type": "material",
      "date": "1948-01-28",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "At sunset 28th January 1948: Lal Singh and Sunder Singh abused each other from houses opening into common courtyard. Attracted Arjan Singh, Bagher Singh, Ujagar Singh Mazhbi to Lal Singh's house.",
      "type": "material",
      "date": "1948-01-28",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Lal Singh challenged Sunder Singh to come out. Sunder Singh, sons Banta and Ajmer, cousin Teja accepted; rushed out. Teja and Banta armed with spears attacked Lal Singh and Dhan Kaur, inflicting injuries. Ajmer armed with spear, plunged into chest of Bagher Singh who collapsed and died almost instantaneously.",
      "type": "material",
      "date": "1948-01-28",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Arjan Singh reported incident at police station (7 miles away) at 11:45 p.m., stating Ajmer Singh dealt barchha blow to Bagher Singh's chest.",
      "type": "material",
      "date": "1948-01-28",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Police arrested Sunder Singh, Teja Singh, Banta Singh; Ajmer absconded, apprehended 4th December 1948.",
      "type": "procedural",
      "date": "1948-12-04",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Sunder, Teja, Banta prosecuted under s302/34 IPC, convicted under s324 IPC: Banta and Teja 2 years RI each, Sunder 6 months RI. On appeal, Sunder acquitted, sentences on Banta/Teja reduced. Lenient view as sudden fight between near relatives.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Ajmer Singh tried by Sessions Judge Ferozepore (Trial No.28/1950, Case No.5/1950), acquitted 13th May 1950.",
      "type": "procedural",
      "date": "1950-05-13",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "State appealed; High Court (Bhandari and Soni JJ) set aside acquittal, convicted under s304 IPC, 10 years RI, 14th September 1951.",
      "type": "procedural",
      "date": "1951-09-14",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Direct evidence by Lal Singh (PW3, father), Dhan Kaur (mother), Arjan Singh (brother). Ujagar Singh Mazhbi tendered, no questions on fight. Bishandas (PW7) deposed on morning quarrel.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Sessions Judge: Ajmer not present at morning quarrel (per Bishandas); witnesses suppressed facts, unreliable; acquitted due to no independent evidence, enmity.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "High Court: Minor variations natural after 27 months; Arjan consistent with FIR; Lal's omissions due to lapse of memory; sufficient reasons to distrust Sessions view.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Sessions examination of accused defective: Read committal statement, general questions only; no separate questions on material circumstances.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Injuries on Kartar Kaur and Ujagar Singh not proved at occurrence time.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether High Court was justified in reversing Sessions Judge's acquittal and convicting appellant under s304 IPC, given credibility of witnesses and weight to trial judge's opinion.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether trial vitiated by defective examination of accused under s342 CrPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No compelling reasons to set aside acquittal; High Court did not give due weight to trial judge's opinion on credibility of witnesses seen by him.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Presumption of innocence reinforced by acquittal; reversal only for very substantial and compelling reasons"
    },
    {
      "id": "pa2",
      "text": "High Court erred in holding accused must explain circumstances; cannot take shelter behind presumption of innocence.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Trial vitiated as examination under s342 CrPC defective.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "Section 342 CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Strong prima facie case; accused duty to explain circumstances.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "After careful review, agree with High Court: Variations minor/trifling, natural after 27 months; Arjan consistent with FIR; no material discrepancies on fatal blow; identity clear as few participants.",
      "addresses_issue": "i1",
      "key_observation": "Difficult to believe Arjan falsely selected Ajmer soon after occurrence; Sessions Judge exaggerated minor discrepancies, hypercritical."
    },
    {
      "id": "cr2",
      "text": "Bishandas cryptic, not definitive on Ajmer's absence morning; Ujagar not questioned on fight; no withholding of independent witnesses; defence led no evidence.",
      "addresses_issue": "i1",
      "key_observation": "Prosecution story reliable."
    },
    {
      "id": "cr3",
      "text": "Defective s342 examination: Must question separately on each material circumstance; not discharged by reading committal statement or general question. Cited Tara Singh v. State.",
      "addresses_issue": "i2",
      "key_observation": "However, no prejudice: Simple facts, accused aware via cross-exam and committal denial due to enmity."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court justified in reviewing evidence under s417 CrPC and reversing acquittal; conviction under s304 IPC proper.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Defective s342 does not vitiate trial if no prejudice; every error/omission not fatal.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Tara Singh v. The State",
      "citation": "1951 S.C.R. 729",
      "treatment": "followed",
      "relevance": "Object of s342 CrPC is to afford accused fair opportunity to explain circumstances; questions must be fair and couched for illiterate to understand."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302/34",
        "304",
        "324"
      ],
      "relevance": "Appellant convicted under s304; others under s324 after s302/34 prosecution."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "342",
        "417"
      ],
      "relevance": "s342: Examination of accused; defective but no prejudice. s417: High Court appeal against acquittal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave against High Court's reversal of acquittal and conviction under s304 IPC with 10 years RI dismissed; Supreme Court agreed with High Court on witness credibility and held no prejudice from defective s342 examination.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "After an order of acquittal has been made the presumption of innocence is further reinforced by that order, and that being so, the trial court's decision can be reversed not on the ground that the accused had failed to explain the circumstances appearing against him but only for very substantial and compelling reasons.",
      "speaker": "court",
      "significance": "Clarifies high threshold for reversing acquittal."
    },
    {
      "text": "The accused must be questioned separately about each material circumstance which is intended to be used against him.",
      "speaker": "court",
      "significance": "Explains requirements of s342 CrPC."
    },
    {
      "text": "It is well settled that every error or omission not in compliance with the provisions of section 342 does not necessarily vitiate a trial.",
      "speaker": "court",
      "significance": "No prejudice rule for procedural defects."
    }
  ],
  "_case_id": "1952_93",
  "_label": 0,
  "_text_length": 17522,
  "_extracted_at": "2026-02-08T22:11:59.465559"
}