{
  "metadata": {
    "case_name": "Kshetra Mohan Sadhukhan and Sannyasi Charan Sadhukhan v. Commissioner of Income Tax",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "DAS J."
    ],
    "case_number": "Civil Appeal No. 173 of 1952",
    "date_of_judgment": "1953-10-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Kshetra Mohan Sadhukhan and Sannyasi Charan Sadhukhan, two brothers governed by Dayabhaga School, separated from each other many years ago, started business in partnership under name Kshetra Mohan Sadhukhan and Sannyasi Charan Sadhukhan, each having eight-annas share.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Sannyasi Charan Sadhukhan died in 1932, his sons admitted into partnership, business continued by Kshetra Mohan Sadhukhan and sons of Sannyasi.",
      "type": "background",
      "date": "1932",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Kshetra Mohan Sadhukhan died in 1934, on and from 17th June 1934, sons of Kshetra Mohan Sadhukhan and sons of Sannyasi Charan Sadhukhan continued business in partnership.",
      "type": "background",
      "date": "1934-06-17",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Although carried on in partnership, members of each branch constituted separate Hindu undivided family right up to 13th April 1943, when severance of both families inter se.",
      "type": "material",
      "date": "1943-04-13",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Business continued by members of two branches in partnership; deed of partnership executed on 19th September 1943 between eight partners, another deed on 28th December 1944.",
      "type": "material",
      "date": "1943-09-19",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Chargeable accounting periods: 14th April 1943 to 13th April 1944 (deficiency of Rs. 12,804); 14th April 1944 to 13th April 1945 (profit of Rs. 88,652 over standard profit); 14th April 1945 to 31st March 1946.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Assessee firm registered under section 26A Income-tax Act; claimed carry forward of total deficiencies over Rs. 84,000 from previous years plus Rs. 12,804 under section 7 Excess Profits Tax Act.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Excess Profits Tax Officer held change in persons carrying on business u/s 8 Excess Profits Tax Act w.e.f. 14th April 1943, old business discontinued, new commenced; allowed carry forward only Rs. 12,804; for second period assessed net excess Rs. 75,848; third period no deduction.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appeals to Appellate Assistant Commissioner dismissed, confirming assessments.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Further appeals to Income-tax Appellate Tribunal dismissed by order dated 25th July 1949.",
      "type": "procedural",
      "date": "1949-07-25",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Applications u/s 66(1) Income-tax Act r/w s.21 Excess Profits Tax Act; Tribunal referred question to High Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Calcutta High Court (Chakravartti and S.R. Das Gupta JJ.) by judgment dated 20th June 1951 answered question in affirmative.",
      "type": "procedural",
      "date": "1951-06-20",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appeal to Supreme Court under certificate u/s 66A(2) Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Application dated 19th October 1943 for renewal of registration u/s 26A for 1942-43 showed two partners: Kshetra Mohan Sadhukhan and sons (Rs. 4,370 share), Bijan Kumar Sadhukhan and brothers (Rs. 4,370); instrument dated 19 Sep 1943 between Gosta Behari Sadhukhan and Bros. (first party) and Bijan Kumar Sadhukhan and Bros. (second party), each 8 annas.",
      "type": "material",
      "date": "1943-10-19",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Deed 28 Dec 1944 had eight parties; recitals indicate reconstitution on 14 Apr 1943 as eight partners.",
      "type": "material",
      "date": "1944-12-28",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Returns up to 1943-44 showed two partners each 8 annas; from 1944-45 eight partners.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of this case, there is a change in the persons carrying on the business within the meaning of section 8 of the Excess Profits Tax Act, 1940, with effect from 14th April, 1943, when the business, which had previously been carried on in partnership between two Dayabhaga Hindu undivided families, was carried on by a partnership between the separated male members of the two families?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Firm originally partnership of two HUFs by kartas, then from 17 Jun 1934 sons individually became partners; firm remained constituted of eight individuals at all material times; no change in persons u/s 8 EPT Act.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f5"
      ],
      "legal_basis": "Section 8 Excess Profits Tax Act"
    },
    {
      "id": "pa2",
      "text": "Partnership between individual members of two HUFs may be described as between two HUFs; prior to 13 Apr 1943 business carried by two associations of persons, not HUFs, i.e., eight individuals.",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Previous to 14 Apr 1943, business carried by two HUFs; on 13 Apr 1943 families disrupted; since then individual members formed partnership; new partners not same persons as before.",
      "supporting_facts": [
        "f4",
        "f8",
        "f11"
      ],
      "legal_basis": "Section 8 Excess Profits Tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Assessee's case before EPT Officer, AAC, Tribunal was business by two HUFs till 13 Apr 1943, then eight individuals; new case of continuous eight-partner firm not made earlier, not open now; statement of case by Tribunal binding.",
      "addresses_issue": "i1",
      "key_observation": "New case entirely new, not open to assessee."
    },
    {
      "id": "cr2",
      "text": "HUF not juristic person for all purposes; partnership by two kartas is between kartas, not families ipso facto; no evidence eight members individually partners before 14 Apr 1943.",
      "addresses_issue": "i1",
      "key_observation": "Documents show two partners before 14 Apr 1943."
    },
    {
      "id": "cr3",
      "text": "Registration application 19 Oct 1943, deed 19 Sep 1943, deed 28 Dec 1944 recitals, returns up to 1943-44 show two partners; reconstitution recital inconsistent with prior eight partners.",
      "addresses_issue": "i1",
      "key_observation": "Parties themselves considered two partners before."
    },
    {
      "id": "cr4",
      "text": "Question referred implies prior partnership of two HUFs (kartas), post-disruption eight individuals; if always eight, no question of law.",
      "addresses_issue": "i1",
      "key_observation": "Facts as found show change in persons u/s 8."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "There has been a change in the persons carrying on the business within the meaning of section 8 of the Excess Profits Tax Act w.e.f. 14th April 1943.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Excess Profits Tax Act, 1940",
      "sections": [
        "Section 7",
        "Section 8",
        "Section 21"
      ],
      "relevance": "Change in persons u/s 8 prevents carry forward of pre-change deficiencies u/s 7; reference r/w s.21."
    },
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "Section 26A",
        "Section 66(1)",
        "Section 66A(2)"
      ],
      "relevance": "Registration of firm; reference to High Court and appeal to Supreme Court."
    },
    {
      "name": "Indian Income-tax Rules",
      "sections": [
        "Rule 2",
        "Rule 3"
      ],
      "relevance": "Application for registration signed by all partners personally, in prescribed form."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court agrees with High Court and Tribunal that there was a change in persons carrying on business u/s 8 Excess Profits Tax Act w.e.f. 14 Apr 1943; assessee not entitled to carry forward pre-1943 deficiencies; appeal dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It appears to us that this is an entirely new case which is not now open to the assessee to put forward.\"",
      "speaker": "court",
      "significance": "Rejects petitioner's new argument of continuous eight-partner firm."
    },
    {
      "text": "\"A Hindu undivided family is no doubt included in the expression 'person'... but it is not a juristic person for all purposes.\"",
      "speaker": "court",
      "significance": "Clarifies legal nature of HUF in partnership context."
    },
    {
      "text": "\"If the firm was before 1st Baisak, 1350 B.S., constituted of eight partners then there could be no occasion for reciting that the firm was reconstituted as constituted of eight partners.\"",
      "speaker": "court",
      "significance": "Interprets partnership deed against petitioner's claim."
    }
  ],
  "_case_id": "1953_85",
  "_label": 0,
  "_text_length": 15528,
  "_extracted_at": "2026-02-10T19:14:40.436389"
}