{
  "metadata": {
    "case_name": "Dalip Singh & Ors. v. State",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "Bose J."
    ],
    "case_number": "Criminal Appeal No. 22 of 1953",
    "date_of_judgment": "1953-05-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "All seven accused belong to the same village and the same faction or party.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Appellants Dalip Singh and Battan Singh are brothers. Jarnail Singh (acquitted) is son of Battan Singh. Remaining four, including appellants Sadhu Singh and Kundan Singh, not closely related to the other three except by party affiliation.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Dalip Singh and Battan Singh assaulted the two deceased (Rattan Singh and Bawa Singh) about twenty years before the occurrence, were prosecuted, convicted, and served short terms of imprisonment.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Dalip Singh and Battan Singh believed to be dacoits; deceased furnished information to police. This is the motive for the murders.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "On 16th June 1951, about 2 p.m., Rattan Singh taking food to well near house for himself and son. Wife Mst. Punnan (PW 2) heard cries, rushed out with daughter Mst. Charni (PW 11), saw all seven accused assaulting Rattan Singh until he fell.",
      "type": "material",
      "date": "1951-06-16",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Accused left Rattan, rushed to his haveli where Bawa Singh lying on cot, shouting they would make short work of him. All seven belaboured Bawa on cot, dragged him out, beat more. Returned to Rattan still on ground, gave more blows, then ran away.",
      "type": "material",
      "date": "1951-06-16",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Weapons: Appellants Dalip Singh and Sadhu Singh with barchhas; appellant Battan Singh and two acquitted with lathis; appellant Kundan Singh with takwa (hatchet long handle); accused Kehar Singh (acquitted) with khunda (hefty stick curved iron end).",
      "type": "material",
      "date": "1951-06-16",
      "source": "PW 2"
    },
    {
      "id": "f8",
      "text": "Rattan Singh: 19 injuries; two on head fatal in themselves (blunt weapons); rest on non-vital parts (foot, ankle, leg, knee, thigh, buttock, forearm, wrist); six grievous. Death by shock from multiple injuries aided by brain haemorrhage (injury No. 14). One injury sharp-edged pointed, rest blunt.",
      "type": "material",
      "date": null,
      "source": "medical_evidence"
    },
    {
      "id": "f9",
      "text": "Bawa Singh: 16 injuries; two serious (one head, one ruptured spleen - blunt); rest non-vital (ankle, leg, knee, thigh, elbow, thumb, wrist); eleven grievous. Death by spleen rupture.",
      "type": "material",
      "date": null,
      "source": "medical_evidence"
    },
    {
      "id": "f10",
      "text": "Appellant Dalip Singh arrested 17th June 1951; other three appellants 18th June; each wearing blood-stained clothes.",
      "type": "procedural",
      "date": "1951-06-17",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Weapons recovered 30th June 1951 (14 days after); some blood-stained. One set pointed by Jarnail Singh (acquitted) in Dalip Singh's field; another by Sadhu Singh in Kehar Singh's field.",
      "type": "procedural",
      "date": "1951-06-30",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Sessions Judge convicted all seven under section 302/149 IPC, sentenced to transportation for life. All assessors considered guilty.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court acquitted three (Jarnail, Indar, Kehar), sustained convictions of four appellants, enhanced sentences to death.",
      "type": "procedural",
      "date": "1952-11-19",
      "source": "high_court"
    },
    {
      "id": "f14",
      "text": "FIR by Mst. Punnan (PW 2) at 8:30 p.m. on 16th June 1951, within 6.5 hours, 12 miles from PS, naming all seven accused.",
      "type": "procedural",
      "date": "1951-06-16",
      "source": "PW 2"
    },
    {
      "id": "f15",
      "text": "Bawa died shortly after assault; Rattan survived a little longer.",
      "type": "material",
      "date": "1951-06-16",
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether conviction under section 302 read with section 149 IPC sustainable given High Court's uncertainty that there were at least five persons sharing common object, but acquitted three saying they 'may or may not have taken part'.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether High Court properly enhanced sentences from transportation for life to death.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Blood-stained clothes and weapon recoveries not important (Sessions Judge did not attach much weight; recoveries 14 days later). Eyewitnesses (two women) require corroboration; part of story doubtful, introduced at police instance.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "High Court inconsistency: found at least five but acquitted three (may or may not), undermining section 149 which requires five sharing common object.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "IPC section 149"
    },
    {
      "id": "pa3",
      "text": "FIR delayed; general enmity alleged but not substantiated.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Story of eyewitnesses true; blood-stained clothes corroborate four appellants.",
      "supporting_facts": [
        "f5",
        "f6",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court uncertainty on number (at least five but three may or may not) makes section 149 foundation insecure; cannot convict four under 149 without certain five.",
      "addresses_issue": "i1",
      "key_observation": "Men cannot be hanged on vacillating and vaguely uncertain conclusions."
    },
    {
      "id": "cr2",
      "text": "Reviewed evidence independently; eyewitnesses reliable, no rule requiring corroboration because women or relatives; relationship often guarantee of truth.",
      "addresses_issue": "i1",
      "key_observation": "No such general rule of prudence; each case on own facts."
    },
    {
      "id": "cr3",
      "text": "FIR prompt (6.5 hrs reasonable); names all seven consistently; weapons specified match post-mortem generally; discoveries corroborate (in fields of named accused).",
      "addresses_issue": "i1",
      "key_observation": "Blood-stained clothes strong corroboration for four; weapons link others."
    },
    {
      "id": "cr4",
      "text": "Believe eyewitnesses on all seven; convictions under 302/149 sustainable for four appellants (acquittals stand).",
      "addresses_issue": "i1",
      "key_observation": "High Court unnecessarily cautious in acquitting three."
    },
    {
      "id": "cr5",
      "text": "Death sentence ordinarily in murder unless trial judge records reasons for lesser; appellate enhancement rare, only if trial discretion improperly exercised.",
      "addresses_issue": "i2",
      "key_observation": "Here vicarious liability under 149; impossible to attribute specific injuries; Sessions Judge properly exercised discretion for life sentences."
    },
    {
      "id": "cr6",
      "text": "High Court gave no reasons for enhancement.",
      "addresses_issue": "i2",
      "key_observation": "Not proper to interfere without showing improper exercise."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Convictions of four appellants under section 302/149 IPC upheld.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Sentences enhanced to death by High Court set aside; restored to transportation for life as imposed by Sessions Judge.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "No general rule requiring corroboration of eyewitnesses because they are women or relatives.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rameshwar v. The State of Rajasthan",
      "citation": "1952 S.C.R. 377 at 390",
      "treatment": "followed",
      "relevance": "Dispelled fallacy that testimony of close relatives requires corroboration as general rule."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "149",
        "34"
      ],
      "relevance": "Conviction under 302/149; distinguished from 34 (not charged)."
    },
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "342"
      ],
      "relevance": "Examinations of accused."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court upheld convictions of four appellants under section 302 read with 149 IPC but set aside High Court's enhancement of sentences to death, restoring Sessions Judge's sentences of transportation for life. Acquittals of other three stand.",
    "relief_granted": "Sentences reduced to transportation for life",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Men cannot be hanged on vacillating and vaguely uncertain conclusions.",
      "speaker": "court",
      "significance": "Criticizes High Court's uncertain finding on number of accused for section 149."
    },
    {
      "text": "A witness is normally to be considered independent unless he or she springs from sources which are likely to be tainted... Ordinarily, a close relative would be the last to screen the real culprit.",
      "speaker": "court",
      "significance": "Rejects need for corroboration of relatives' testimony as general rule."
    },
    {
      "text": "The power to enhance a sentence from transportation to death should very rarely be exercised and only for the strongest possible reasons.",
      "speaker": "court",
      "significance": "Principle on appellate enhancement of sentence to death."
    }
  ],
  "_case_id": "1953_78",
  "_label": 0,
  "_text_length": 24216,
  "_extracted_at": "2026-02-10T19:14:48.570128"
}