{
  "metadata": {
    "case_name": "Sons of Govinda (Plaintiffs) v. Palani Bala (Defendant No. 1) and others",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "Mukherjea J."
    ],
    "case_number": "Civil Appeal No. 19 of 1952",
    "date_of_judgment": "1953-01-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Deity Dakshineshwar Jew situated at village Dhop Dhopi, 24-Parganas, West Bengal; ancient deity founded by Udhab Chandra Pandit; shebaiti rights vested in Iswar Chandra Chakraborti, common ancestor of parties.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Iswar died leaving six sons: Ashutosh, Govinda, Gopal, Sadananda, Trailokhya, Haran; they divided shebaiti right into six equal shares by palas (turns of worship), each getting 5 days pala per month.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Custom grew up in family allowing palas to be bought, sold or alienated amongst family members.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Govinda (father of plaintiffs) sold his 5 days pala to brother Haran; Haran acquired 10 days pala (one-third share).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Haran died issueless, survived by widow Rajlakshmi as sole heir; she continued to hold one-third shebaiti right.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "17th June 1920: Rajlakshmi granted ijara lease of her shebaiti right for 2 years to Satish Chandra Dey.",
      "type": "material",
      "date": "1920-06-17",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "1st April 1921: Satish sold leasehold interest to Ram Rakhal Ghose.",
      "type": "material",
      "date": "1921-04-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "6th August 1920: Ram Rakhal took 5-year lease from Rajlakshmi commencing after Satish's lease.",
      "type": "material",
      "date": "1920-08-06",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Ram Rakhal got possession of shebait office from 1st April 1921.",
      "type": "material",
      "date": "1921-04-01",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "7th November 1921: Rajlakshmi sold shebaiti right outright to Ram Rakhal.",
      "type": "material",
      "date": "1921-11-07",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "27th November 1921: Ram Rakhal sold interest to Nagendra and Surendra (sons of Trailokhya).",
      "type": "material",
      "date": "1921-11-27",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Surendra died; 20th June 1925: Widow Tarakali sold Surendra's share to Nagendra.",
      "type": "material",
      "date": "1925-06-20",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Nagendra held entirety of one-third shebaiti right (10 days pala).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Rajlakshmi died 22nd December 1943.",
      "type": "material",
      "date": "1943-12-22",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Plaintiffs (two surviving sons of Govinda) filed Title Suit No. 53 of 1944 for possession of one-third shebaiti right as next heirs of Haran; against defendant 1 Palani Bala (Nagendra's minor daughter, represented by husband), defendant 2 receiver, defendants 3 and 4 other descendants.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Plaintiffs claimed Rajlakshmi had restricted widow's estate; reversioners entitled after her death; prayer for possession (10 days pala), mesne profits from widow's death; no prayer for temple lands/structures.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Defendants' defence: Rajlakshmi's sale void; transferees' possession adverse to all shebaits; defendant 1 acquired title by adverse possession; suit barred by limitation.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "Trial court (Subordinate Judge, 3rd Court, 24-Parganas) judgment 22nd December 1948: decreed for plaintiffs; held Art 141 not attracted but suit not barred (Nagendra purchased life interest recognizing reversioners; no ouster as co-shebaits).",
      "type": "procedural",
      "date": "1948-12-22",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Defendants 1 and 2 appealed to Calcutta High Court (Das and Guha JJ.); judgment 19th June 1950: affirmed other findings, but reversed on limitation applying Art 124; possession adverse >12 years; suit dismissed.",
      "type": "procedural",
      "date": "1950-06-19",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Plaintiffs appealed to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the plaintiffs' suit is governed by Article 124 or Article 141 of the Limitation Act?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If Article 124 applies, when did the defendant or her predecessors take possession of the hereditary office of shebait adversely to the plaintiffs? From date of transfer by Rajlakshmi or only at her death?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Alienation of shebaiti right by shebait to stranger void ab initio; alienee trespasser, possession adverse from beginning against transferor (Rajlakshmi); but adverse possession barring widow does not bar reversioners who do not derive title through her; principle since 1871, embodied in Art 141.",
      "supporting_facts": [
        "f5",
        "f10",
        "f11",
        "f14",
        "f15"
      ],
      "legal_basis": "Article 141 Limitation Act; Hindu law on reversioners"
    },
    {
      "id": "pa2",
      "text": "Even if Art 124 applies, adverse possession against plaintiffs only from widow's death, not before.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Article 124 Limitation Act; Section 2(8) definition of plaintiff"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No general principle that adverse possession against Hindu widow does not bar reversioners; rule confined to Art 141 cases; Art 141 inapplicable here; Art 124 governs; possession adverse from transfer date against all.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": "Article 124 Limitation Act; pre-1871 law; Shivagunga case principle"
    },
    {
      "id": "ra2",
      "text": "Female shebait's powers not more restricted than male; trust estate fully in her; next shebait bound.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Hindu law on shebaitship; Gnanasambanda v. Velu"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Alienation of shebaiti right by shebait to stranger absolutely void; alienee trespasser; possession adverse from beginning against transferor.",
      "addresses_issue": "i2",
      "key_observation": "Proposition well established in Hindu law."
    },
    {
      "id": "cr2",
      "text": "History of limitation law: Pre-1871, adverse possession against widow barred reversioners (Shivagunga, Nobin Chunder); Act 1871 introduced Art 142 (now 141) changing law, treating widow's estate as life estate for limitation; reversioner's cause accrues on widow's death (Ranchordas v. Parvati, Jaggo v. Utsava).",
      "addresses_issue": "i1",
      "key_observation": "Legislature deliberately assimilated Hindu widow's estate to tenant for life for limitation purposes."
    },
    {
      "id": "cr3",
      "text": "Shebaitship combines office and property; heritable; female shebait has widow's estate (limited alienation due to inherent restrictions on shebaiti right, not gender; succeeds to heirs of last male).",
      "addresses_issue": "i1",
      "key_observation": "But Art 141 applies to 'immovable property'; shebaiti right is hereditary office under Art 124, not clearly immovable property."
    },
    {
      "id": "cr4",
      "text": "Art 124 applies as specific provision for hereditary office; period 12 years when defendant takes possession adversely to plaintiff.",
      "addresses_issue": "i1",
      "key_observation": "Specific article prevails."
    },
    {
      "id": "cr5",
      "text": "Under Art 124 read with S.2(8), adverse possession must be against plaintiff or person through whom plaintiff derives title; reversioners do not derive through widow.",
      "addresses_issue": "i2",
      "key_observation": "As in Gnanasambanda v. Velu."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Article 124 of Limitation Act applies to suit for possession of shebaiti right as hereditary office.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "For Art 124, defendant's possession must be adverse to the plaintiff or person from/through whom plaintiff derives title; in case of intervening female heir, adverse only from her death.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Katama Natchier v. Rajah of Shivagunga",
      "citation": "9 Moo. I.A. 539",
      "treatment": "followed",
      "relevance": "Widow represents estate; decree against her binds reversioner."
    },
    {
      "case_name": "Nobin Chunder v. Issur Chunder",
      "citation": "9 W.R. 505",
      "treatment": "referred",
      "relevance": "Pre-1871: adverse possession against widow bars reversioners."
    },
    {
      "case_name": "Aumirtolall v. Rajonee Kant",
      "citation": "2 I.A. 113",
      "treatment": "followed",
      "relevance": "Affirmed Nobin Chunder under 1859 Act."
    },
    {
      "case_name": "Srinath Kur v. Prosunno Kumar",
      "citation": "9 Cal. 934",
      "treatment": "followed",
      "relevance": "Art 141 assimilates widow's estate to life estate."
    },
    {
      "case_name": "Vundravandas v. Cursondas",
      "citation": "21 Bom. 646",
      "treatment": "followed",
      "relevance": "Art 141 view; affirmed in Ranchordas."
    },
    {
      "case_name": "Ranchordas v. Parvati",
      "citation": "26 I.A. 71",
      "treatment": "followed",
      "relevance": "Reversioner's right accrues on widow's death; even for movables."
    },
    {
      "case_name": "Vaithialinga v. Srirangath",
      "citation": "52 I.A. 322",
      "treatment": "distinguished",
      "relevance": "Some doubted its effect on Ranchordas but overruled."
    },
    {
      "case_name": "Jaggo v. Utsava",
      "citation": "56 I.A. 267",
      "treatment": "followed",
      "relevance": "Set doubts at rest; cause of action accrues on widow's death."
    },
    {
      "case_name": "Pydigantan v. Rama Dass",
      "citation": "28 Mad. 197",
      "treatment": "distinguished",
      "relevance": "Female shebait rights not qualified like widow's estate."
    },
    {
      "case_name": "Lilabati v. Bishen",
      "citation": "6 C.L.J. 621",
      "treatment": "distinguished",
      "relevance": "Followed Pydigantan."
    },
    {
      "case_name": "Gnanasambanda v. Velu",
      "citation": "27 I.A. 69",
      "treatment": "followed",
      "relevance": "Adverse possession under similar provision must be to plaintiff or through whom derives title."
    },
    {
      "case_name": "Angurbala v. Debabrata",
      "citation": "1951 S.C.R. 1125",
      "treatment": "referred",
      "relevance": "Hereditary office treated like land for limitation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Limitation Act (1908)",
      "sections": [
        "Article 124",
        "Article 141",
        "Section 2(8)"
      ],
      "relevance": "Governs suit for possession of hereditary office (124) vs suit by reversioner after female heir's death (141); plaintiff includes through whom derives right."
    },
    {
      "name": "Limitation Act (1871)",
      "sections": [
        "Article 142"
      ],
      "relevance": "Introduced 12 years from female heir's death for reversioners; repealed 1859 Act."
    },
    {
      "name": "Limitation Act (1859)",
      "sections": [
        "Section 12",
        "Section 16"
      ],
      "relevance": "General 12/6 years from cause of action; no special reversioner rule."
    },
    {
      "name": "Limitation Act (1877)",
      "sections": [
        "Article 141"
      ],
      "relevance": "Reproduced 1871 provision."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court held Article 124 applies but adverse possession to bar reversioners under it requires dispossession adverse to them or through whom they derive title, i.e., from widow's death; suit not barred.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The proposition is well established that the alienation of the shebaiti right by a shebait in favour of a stranger is absolutely void in Hindu law and cannot be validated even on the footing of a custom.",
      "speaker": "court",
      "significance": "Core legal principle on validity of shebaiti alienation."
    },
    {
      "text": "Reading article 124 of the Limitation Act along with section 2(8), the conclusion is irresistible that to defeat the title of the plaintiff under article 124 it is necessary to establish that the defendant had taken possession of the office adversely to the plaintiff or somebody from or through whom the plaintiff derives his title.",
      "speaker": "court",
      "significance": "Key holding on when adverse possession starts under Art 124."
    },
    {
      "text": "Shebaitship... combines in it both the elements of office and property.",
      "speaker": "court",
      "significance": "Nature of shebaiti right justifying Art 124."
    }
  ],
  "_case_id": "1953_9",
  "_label": 1,
  "_text_length": 29922,
  "_extracted_at": "2026-02-08T22:09:13.131432"
}