{
  "metadata": {
    "case_name": "Dalip Singh & Ors. v. State",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "Bose J."
    ],
    "case_number": "Criminal Appeal No. 22 of 1953",
    "date_of_judgment": "1953-05-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "All seven accused belong to the same village and belong to the same faction or party.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Appellants Dalip Singh and Battan Singh are brothers. Jarnail Singh who was acquitted is a son of Battan Singh. The remaining four, including the appellants Sadhu Singh and Kundan Singh, are not related to the other three and, except for the evidence that they belong to the same party, are not shown to have any common interest with the other three.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellants Dalip Singh and Battan Singh assaulted the two dead men Rattan and Bawa about twenty years before the occurrence. They were prosecuted and convicted and served short terms of imprisonment.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Dalip Singh and Battan Singh are said to be dacoits and it is said that they believed that the two dead men used to furnish information against them to the police. This is said to be the motive for the murders.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "On 16th June, 1951, about 2 p.m., Rattan Singh was taking some food out to a well a short distance from his house for himself and his son. Just as he left the house, his wife Mst. Punnan PW 2 heard cries of alarm and on rushing out with her daughter Mst. Charni PW 11 saw all seven accused assaulting her husband. They beat him up till he fell to the ground.",
      "type": "material",
      "date": "1951-06-16",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "As soon as Rattan Singh fell down, the seven accused left him and rushed to his Rattan Singh's Haveli where the other brother Bawa Singh was lying on a cot, shouting that they would also make short work of him. All seven belaboured him on the cot, then they dragged him out and beat him up some more.",
      "type": "material",
      "date": "1951-06-16",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "After this they returned to where Rattan Singh was still lying on the ground and gave him some more blows. Then they ran away.",
      "type": "material",
      "date": "1951-06-16",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Bawa Singh died very shortly after the assault. The other brother survived a little longer but he also died not long after.",
      "type": "material",
      "date": "1951-06-16",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "The accused were armed as follows: The appellants Dalip Singh and Sadhu Singh with barchhas; the appellant Battan Singh and two of the accused who have been acquitted with lathis; the appellant Kundan Singh had a takwa - a hatchet with a long handle, and the accused Kehar Singh, who has been acquitted, had a khunda - a hefty stick with a curved iron end.",
      "type": "material",
      "date": "1951-06-16",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Rattan Singh had nineteen injuries on his person. Of these, only two, on the head, would have been fatal in themselves. The rest were on non-vital parts like the foot, ankle, leg, knee, thigh, buttock, forearm and wrist, but of these six were grievous. Death was caused by shock produced by the multiple injuries aided by haemorrhage in the brain due to injury No. 14.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "In Rattan Singh's case, only one of the injuries was inflicted by a sharp-edged pointed weapon and all the rest by blunt weapons. The two on the head were inflicted by blunt weapons.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Bawa had sixteen injuries but except for two the rest were on non-vital parts. One of the two was on the head and the other ruptured the spleen. The rest were on the ankle, leg, knee, thigh, elbow, took thumb and wrist, but eleven of them were grievous. Death down to rupture of the spleen.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "In Bawa Singh's case, four wounds were caused by a sharp-edged or pointed sharp-edged weapon. The others were all inflicted by blunt weapons. Here again, the fatal injury which ruptured the spleen was caused by a blunt weapon.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "The appellant Dalip Singh was arrested on the 17th June and the other three on the 18th. Each was wearing blood-stained clothes.",
      "type": "procedural",
      "date": "1951-06-17",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Recovery of certain weapons, some of which were blood-stained.",
      "type": "procedural",
      "date": "1951-06-30",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Learned Sessions Judge did not attach much importance to the bloodstained clothes, nor did he regard the recovery of certain weapons as of much consequence. But he was impressed with the evidence of the two eyewitnesses Mst. Punnan PW 2 and Mst. Charni PW 11 and believing them convicted each of the seven accused under section 302 read with section 149, Indian Penal Code. Sentenced all to transportation for life.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "High Court acquitted three of the seven but sustained the convictions of the four appellants and enhanced their sentences in each case to death.",
      "type": "procedural",
      "date": "1952-11-19",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Weapons recovered 14 days after murders: one set pointed out by Jarnail Singh (acquitted) in Dalip Singh's field, another set pointed out by Sadhu Singh in Kehar Singh's field.",
      "type": "procedural",
      "date": "1951-06-30",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "High Court considered blood-stained clothes an important factor for corroboration of four appellants.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "First information report made by Mst. Punnan PW 2 at 8-30 p.m. within 6-1/2 hours of the occurrence at a place 12 miles from the police station. Names the seven accused, not less and not more.",
      "type": "procedural",
      "date": "1951-06-16",
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the conviction under section 302 read with section 149 IPC can stand given the High Court's uncertainty about the presence of at least five persons sharing the common object.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the testimony of the two eyewitnesses requires corroboration merely because they are women or relatives of the deceased.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the High Court properly exercised discretion in enhancing the sentence from transportation for life to death.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Elaborately took the court through the evidence.",
      "supporting_facts": [
        "f16",
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Attacked the promptness of the FIR.",
      "supporting_facts": [
        "f20"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Criticisms advanced against the witnesses, most of which are to be found in the judgments of the lower courts.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "None explicitly detailed in the judgment.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court inconsistency: found certainly not less than five persons took part, but the three acquitted may or may not have taken part, which creates uncertainty for applying section 149 requiring five persons sharing common object.",
      "addresses_issue": "i1",
      "key_observation": "Men cannot be hanged on vacillating and vaguely uncertain conclusions."
    },
    {
      "id": "cr2",
      "text": "Reviewed evidence independently and found Sessions Judge's conclusions right. Testimony of two eyewitnesses does not require corroboration merely because they are women or relatives; no general rule of prudence requiring corroboration for relatives.",
      "addresses_issue": "i2",
      "key_observation": "A close relative would be the last to screen the real culprit and falsely implicate an innocent person."
    },
    {
      "id": "cr3",
      "text": "Eyewitnesses reliable: prompt FIR naming all seven consistently; blood-stained clothes corroborate four appellants; weapons recovery links others; no substantiated enmity.",
      "addresses_issue": "i1",
      "key_observation": "We agree with the learned Sessions Judge that Mst. Punnan and Mst. Charni are to be believed regarding the main facts and that they correctly named all seven accused as the assailants."
    },
    {
      "id": "cr4",
      "text": "In murder cases under 302/149 where no individual attribution of fatal injuries possible, trial judge's discretion to award life imprisonment proper; appellate court should rarely enhance to death without strong reasons.",
      "addresses_issue": "i3",
      "key_observation": "The power to enhance a sentence from transportation to death should very rarely be exercised and only for the strongest possible reasons."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Conviction under section 302 read with section 149 IPC sustained for the four appellants as eyewitnesses credible and named all seven correctly, enabling application of section 149.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No general rule requiring corroboration of testimony of female relatives in criminal cases; each case on its own facts.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "High Court improperly enhanced sentence to death without reasons; Sessions Judge properly exercised discretion in awarding transportation for life given inability to attribute specific fatal blows.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rameshwar v. The State of Rajasthan",
      "citation": "1952 S.C.R. 377",
      "treatment": "followed",
      "relevance": "Dispelled fallacy that testimony of close relatives requires corroboration."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "149",
        "34"
      ],
      "relevance": "Conviction under 302 r/w 149; 34 not charged; common intention under 34 different from common object under 149."
    },
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "342"
      ],
      "relevance": "Examinations under section 342."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court upheld the convictions of the four appellants under section 302 read with section 149 IPC, allowing the acquittals of the other three to stand, but set aside the High Court's enhancement of sentence to death and restored the Sessions Judge's sentence of transportation for life, holding that the trial judge properly exercised discretion and the High Court gave no reasons for enhancement.",
    "relief_granted": "Sentences reduced from death to transportation for life.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Men cannot be hanged on vacillating and vaguely uncertain conclusions.",
      "speaker": "court",
      "significance": "Criticizes High Court's uncertain finding on number of participants for section 149."
    },
    {
      "text": "There is no such general rule [requiring corroboration of relatives]. Each case must be limited to and be governed by its own facts.",
      "speaker": "court",
      "significance": "Rejects need for corroboration of eyewitnesses merely as relatives."
    },
    {
      "text": "The power to enhance a sentence from transportation to death should very rarely be exercised and only for the strongest possible reasons.",
      "speaker": "court",
      "significance": "Principle on appellate enhancement of death sentence."
    }
  ],
  "_case_id": "1953_78",
  "_label": 0,
  "_text_length": 24216,
  "_extracted_at": "2026-02-08T22:11:40.716418"
}