{
  "metadata": {
    "case_name": "Punjab National Bank Ltd. v. Workmen represented by their Union",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "Patanjali Sastri C.J."
    ],
    "case_number": "Civil Appeal No. 181 of 1952",
    "date_of_judgment": "1953-04-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Several disputes between the Bank and its workmen referred on February 21, 1950, to Industrial Tribunal presided over by Sri K. S. Campbell-Puri.",
      "type": "procedural",
      "date": "1950-02-21",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "During pendency of proceedings before Campbell-Puri Tribunal, respondents along with other workmen commenced a general strike on April 18, 1951, in connection with a fresh dispute.",
      "type": "material",
      "date": "1951-04-18",
      "source": "bank"
    },
    {
      "id": "f3",
      "text": "Notice issued to strikers that unless they returned to work by April 24, 1951, they would be deemed to have left service of their own accord.",
      "type": "procedural",
      "date": "1951-04-24",
      "source": "bank"
    },
    {
      "id": "f4",
      "text": "Strikers ignored the notice; second notice issued on April 27, 1951, terminating their service.",
      "type": "procedural",
      "date": "1951-04-27",
      "source": "bank"
    },
    {
      "id": "f5",
      "text": "Government of India intervened; Bank agreed to take back all employees except 150 against whom objections on account of subversive activities and objectionable conduct.",
      "type": "background",
      "date": null,
      "source": "bank"
    },
    {
      "id": "f6",
      "text": "Government constituted Tribunal on July 2, 1951, to decide questions regarding dismissals of the 150 employees.",
      "type": "procedural",
      "date": "1951-07-02",
      "source": "government"
    },
    {
      "id": "f7",
      "text": "Industrial Tribunal made award on February 9, 1952, refusing reinstatement on ground of illegal strike in contravention of section 23(b) of Industrial Disputes Act; granted compensation at half rates from dismissal to publication.",
      "type": "procedural",
      "date": "1952-02-09",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Respondents appealed to Labour Appellate Tribunal at Calcutta (Appeals Nos. Cal. 366/51, Cal. 69/52, Cal. 70/52).",
      "type": "procedural",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f9",
      "text": "Labour Appellate Tribunal on September 22, 1952, agreed strike illegal but held condoned by Bank; dismissal wrongful as no charges framed or explanations called for; directed further evidence on specific points and reserved decision on reinstatement.",
      "type": "procedural",
      "date": "1952-09-22",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Supreme Court granted special leave on October 16, 1952.",
      "type": "procedural",
      "date": "1952-10-16",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Bank condoned or waived the illegal strike, allowing reliance on it for dismissal.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Appellate Tribunal had jurisdiction to order reinstatement of the respondents.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Applicability of section 33 of the Industrial Disputes Act to the dismissal during pendency of proceedings.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Bank did not condone the illegal strike; it was open to rely on illegal strike to justify dismissal.",
      "supporting_facts": [
        "f2",
        "f7"
      ],
      "legal_basis": "Section 23(b) Industrial Disputes Act"
    },
    {
      "id": "pa2",
      "text": "Reinstatement would compel Bank to employ afresh; Appellate Tribunal had no jurisdiction to order it.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Section 33 has no application as strikes/lock-outs in Chapter V; respondents not concerned in pending disputes.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": "Section 33 Industrial Disputes Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Illegal strike was condoned by Bank; not open to justify dismissal on that ground.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Dismissal wrongful as no charges framed for violence/subversive activities and no explanations called for.",
      "supporting_facts": [
        "f5",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Unnecessary to decide condonation/waiver of illegal strike.",
      "addresses_issue": "i1",
      "key_observation": "Assuming no condonation, section 33 provides answer."
    },
    {
      "id": "cr2",
      "text": "Dismissal during pendency of proceedings before Campbell-Puri Tribunal without permission under section 33 was illegal; pendency made strike illegal under section 23(b), similarly for dismissal.",
      "addresses_issue": "i3",
      "key_observation": "Section 33 applies generally to all discharges; amendment by Act XLVIII of 1950 omitted exceptions."
    },
    {
      "id": "cr3",
      "text": "Terms of section 33 wide enough to cover case; placement in Chapter VII (Miscellaneous) consistent with general application.",
      "addresses_issue": "i2",
      "key_observation": "Rejects argument that section inapplicable due to Chapter V or lack of concern in disputes."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Dismissal of respondents illegal under section 33 Industrial Disputes Act for lack of permission during pendency of proceedings.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Appellate Tribunal had jurisdiction regarding reinstatement as dismissal was illegal.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "Section 23(b)",
        "Section 33"
      ],
      "relevance": "Strike illegal under s.23(b) during pendency; dismissal illegal under s.33 without permission during pendency."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Court holds dismissal illegal under section 33 despite illegal strike, rejecting Bank's contentions on condonation and jurisdiction; upholds Appellate Tribunal's approach obviating need to set aside its order.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "If the pendency of the proceedings before Sri Campbell-Puri made the strike of the respondents illegal under section 23(b) of the Act, the dismissal of the respondents by the Bank without obtaining his permission as required by section 33 was also illegal.",
      "speaker": "court",
      "significance": "Core reasoning linking illegality of strike and dismissal under the Act."
    },
    {
      "text": "We consider it unnecessary to express any opinion on the question of condonation or waiver of the illegal strike.",
      "speaker": "court",
      "significance": "Indicates court's avoidance of one issue in favor of decisive statutory provision."
    }
  ],
  "_case_id": "1953_119",
  "_label": 0,
  "_text_length": 6506,
  "_extracted_at": "2026-02-10T19:14:34.698480"
}