{
  "metadata": {
    "case_name": "Central National Bank Limited v. United Industrial Bank Limited",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "Mukherjea J."
    ],
    "case_number": "Civil Appeal No. 32 of 1953",
    "date_of_judgment": "1953-11-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The shares in question, 800 in number of Indian Iron and Steel Company Ltd. and Steel Corporation of Bengal Ltd., were the property of Radhika Mohan Bhuiya, defendant No. 2.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Sometime in February 1946, Bhuiya agreed to sell these shares to Dwijendra Nath Mukherjee for Rs. 38,562-8-0.",
      "type": "material",
      "date": "1946-02",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 14th February 1946, Bhuiya sent the shares along with relative transfer deeds to the defendant bank (United Industrial Bank) with instructions to deliver to Mukherjee against payment of Rs. 38,562-8-0.",
      "type": "material",
      "date": "1946-02-14",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 18th February 1946, defendant bank directed officer Nilkrishna Paul to go to Mukherjee's office and hand over shares after receiving pay order for Rs. 38,562-8-0 signed by Punjab National Bank.",
      "type": "material",
      "date": "1946-02-18",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Paul met Mukherjee at about 11 a.m., Mukherjee asked to see shares to check them, Paul placed shares and transfer deeds on table, Mukherjee examined them.",
      "type": "material",
      "date": "1946-02-18",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "When Mukherjee was about to leave with shares and deeds without pay order, Paul objected; Mukherjee said 'I am going out to get the pay order it is ready. You take your seat I am coming.' and left without returning.",
      "type": "disputed",
      "date": "1946-02-18",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Mukherjee went straight to plaintiff bank (Central National Bank), pledged shares, opened account with Rs. 100 cheque, got Rs. 29,000 overdraft, executed promissory note.",
      "type": "material",
      "date": "1946-02-18",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Mukherjee has not been heard of since.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Paul waited, then informed superiors, complaint lodged with police, Mukherjee's Rs. 100 cheque dishonored.",
      "type": "procedural",
      "date": "1946-02-18",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Plaintiff bank demanded payment from Mukherjee, no reply, sold shares through broker Jalan for part payment Rs. 16,000 by cheque which was stopped, police took possession of shares.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Criminal case against Shaw (accomplice) unsuccessful, acquitted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Defendant bank paid full price to Bhuiya, applied to Magistrate for return of shares as owner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Plaintiff bank instituted suit No. 1112 of 1946 in Calcutta High Court Original Side for declaration of pledgee rights, possession, damages.",
      "type": "procedural",
      "date": "1946",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Trial Judge Sarkar J. decreed in favor of plaintiff.",
      "type": "procedural",
      "date": "1950-03-21",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Appellate bench Harries CJ and Banerjee J reversed on 12th March 1951.",
      "type": "procedural",
      "date": "1951-03-12",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Bhuiya had no further interest after payment by defendant bank.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Mukherjee had no legal title, only agreement for sale, property not passed till payment.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Paul instructed not to deliver unless payment received, to check pay order.",
      "type": "material",
      "date": "1946-02-18",
      "source": "respondent"
    },
    {
      "id": "f19",
      "text": "Paul protested when Mukherjee took shares, waited 2-3 minutes, Mukherjee did not return.",
      "type": "material",
      "date": "1946-02-18",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the plaintiff bank acquired rights of a pledgee under Section 30(2) of the Indian Sale of Goods Act, specifically whether Mukherjee obtained possession of the shares with the consent of the seller (or agent) and whether plaintiff received in good faith without notice.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether consent under Section 30(2) requires free consent uninfluenced by fraud, or if fraud/false representation negates consent; whether criminality like larceny by trick affects it.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Plaintiff was bona fide pledgee without notice; Mukherjee obtained possession with consent of seller's agent; consent means physical custody, determined by Section 13 Contract Act; fraud/misrepresentation does not negate factual consent; no import of criminal law principles.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5",
        "f6",
        "f7",
        "f17"
      ],
      "legal_basis": "Section 30(2) Indian Sale of Goods Act; Section 13 Indian Contract Act"
    },
    {
      "id": "pa2",
      "text": "Paul consented to part with possession allowing Mukherjee to have shares, duped by false promise but consent in fact existed.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Mukherjee not in possession with consent of seller; plaintiff not bona fide without notice of defect; no intention to give delivery, Mukherjee took shares and bolted, act was theft.",
      "supporting_facts": [
        "f6",
        "f18",
        "f19"
      ],
      "legal_basis": "Section 30(2) Indian Sale of Goods Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Consent under Section 30(2) means agreeing to same thing in same sense per Section 13 Contract Act; free consent per Section 14 not required; fraud makes transaction voidable not void; innocent pledgee protected if possession obtained with real consent, even if induced by fraud/false pretences.",
      "addresses_issue": "i2",
      "key_observation": "Consent induced by fraud is sufficient unless fraud as to identity of person/property making it void."
    },
    {
      "id": "cr2",
      "text": "Criminality like larceny by trick does not negate owner's consent for civil purposes under Sale of Goods Act; criminal intent irrelevant to owner's state of mind; no import of English criminal fictions.",
      "addresses_issue": "i2",
      "key_observation": "Prove consent as fact per contract law, not nullified by criminal rules."
    },
    {
      "id": "cr3",
      "text": "On facts, Paul placed shares for inspection only, retained control; when Mukherjee took away, Paul protested/objected, did not assent to possession on promise to return; no consent to possession.",
      "addresses_issue": "i1",
      "key_observation": "Mukherjee got physical possession against Paul's express desire, no opportunity for assent."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Plaintiff bank not entitled to protection of Section 30(2) as Mukherjee did not obtain possession with consent of seller's agent.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Consent under Section 30(2) is factual per Contract Act; fraud/false representation does not negate unless void ab initio (e.g., identity error); criminal doctrines like larceny by trick irrelevant.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Cahn v. Pocketts Bristol Channel Steam Packet Company",
      "citation": "1899 1 Q.B. 643",
      "treatment": "followed",
      "relevance": "Fraudulent possession does not prevent good title to innocent transferee unless larceny by trick."
    },
    {
      "case_name": "Pearson v. Rose",
      "citation": "1950 2 All E.R. 1027",
      "treatment": "followed",
      "relevance": "Fraud makes transaction voidable; consent obtained by fraud enables Factors Act until avoided."
    },
    {
      "case_name": "Lake v. Simmons",
      "citation": "1927 A.C. 487",
      "treatment": "distinguished",
      "relevance": "No consensus ad idem where fraud as to identity; void, not mere voidable."
    },
    {
      "case_name": "Folkes v. King",
      "citation": "1923 1 K.B. 282",
      "treatment": "followed",
      "relevance": "Criminal intent irrelevant to owner's consent under Factors Act; keep criminal and civil distinct."
    },
    {
      "case_name": "Oppenheimer v. Frazer",
      "citation": "1907 2 K.B. 50",
      "treatment": "referred",
      "relevance": "Accepted exception for larceny by trick but broader view preferred."
    },
    {
      "case_name": "Whitehorn v. Davison",
      "citation": "1911 1 K.B. 463",
      "treatment": "referred",
      "relevance": "Larceny by trick excluding Factors Act where no real consent."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Sale of Goods Act",
      "sections": [
        "30(2)",
        "2(15)"
      ],
      "relevance": "Protection for good faith transferee from buyer in possession with seller's consent; terms borrow Contract Act definitions."
    },
    {
      "name": "Indian Contract Act",
      "sections": [
        "13",
        "14"
      ],
      "relevance": "Definition of consent and free consent applied to determine possession with consent."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld the appellate decision of Calcutta High Court reversing trial court's decree in favor of plaintiff; plaintiff did not acquire pledgee rights as no consent to possession by Mukherjee.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"However fraudulent a person in actual custody may have been, in obtaining the possession, provided it does not amount to larceny by trick... he can, by his disposition, give a good title to the purchaser.\"",
      "speaker": "court",
      "significance": "Collins J.'s principle on fraudulent possession protecting innocent transferees."
    },
    {
      "text": "\"The effect of fraud is as a rule only to make the transaction voidable and not void, and if, therefore, an innocent purchaser has bought the goods before the transaction is avoided the true owner cannot claim them back.\"",
      "speaker": "court",
      "significance": "Denning L.J. affirming protection despite fraud-induced consent."
    },
    {
      "text": "\"It is quite clear that when Paul placed the share certificates upon the table and allowed Mukherjee to scrutinise them, he did not part with the possession of or control over the shares... When Mukherjee went out... Paul actually protested and objected.\"",
      "speaker": "court",
      "significance": "Key factual finding negating consent to possession."
    }
  ],
  "_case_id": "1953_62",
  "_label": 0,
  "_text_length": 30512,
  "_extracted_at": "2026-02-10T19:14:41.671026"
}