{
  "metadata": {
    "case_name": "Kali Nirmal and another v. Palani Bala and others",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "Mukherjea J."
    ],
    "case_number": "Civil Appeal No. 19 of 1952",
    "date_of_judgment": "1953-01-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Deity Dakshineshwar Jew situated at village Dhop Dhopi, 24-Parganas, West Bengal; ancient idol with reputed founder and first shebait Udhab Chandra Pandit.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Shebaiti rights vested in Iswar Chandra Chakroborti, common ancestor of parties.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Iswar died leaving six sons: Ashutosh, Govinda, Gopal, Sadananda, Trailokhya, Haran.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Six sons divided shebaiti right into six equal shares by palas or turns of worship: 5 days every month per son.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Custom grew up in family allowing palas to be bought, sold or alienated amongst shebaits family members.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Govinda (father of plaintiffs) sold his 5 days pala to brother Haran; Haran acquired 10 days pala (one-third share).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Haran died without issue, leaving widow Rajlakshmi as sole heir under Hindu law.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Rajlakshmi granted ijara lease of her shebaiti right for 2 years to Satish Chandra Dey.",
      "type": "material",
      "date": "1920-06-17",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Satish sold leasehold interest to Ram Rakhal Ghose.",
      "type": "material",
      "date": "1921-04-01",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Ram Rakhal took lease from Rajlakshmi for 5 years commencing after Satish's lease.",
      "type": "material",
      "date": "1920-08-06",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Ram Rakhal got possession of shebait office from 1st April 1921.",
      "type": "material",
      "date": "1921-04-01",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Rajlakshmi sold shebaiti right outright to Ram Rakhal by deed.",
      "type": "material",
      "date": "1921-11-07",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Ram Rakhal sold interest to Nagendra and Surendra (sons of Trailokhya).",
      "type": "material",
      "date": "1921-11-27",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Surendra died; widow Tarakali sold his share to Nagendra.",
      "type": "material",
      "date": "1925-06-20",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Nagendra held entirety of one-third shebaiti right (10 days pala).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Rajlakshmi died.",
      "type": "material",
      "date": "1943-12-22",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Plaintiffs (surviving sons of Govinda: Kali Nirmal Plff.1, Abani Plff.2) filed suit for possession of one-third shebaiti right as next heirs of Haran.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "Nagendra died; Deft.1 Palani Bala (daughter, minor, represented by husband); Deft.2 receiver; Deft.3,4 other descendants holding remaining interest.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Suit: Title Suit No. 53 of 1944; prayer for possession of 10 days pala, mesne profits from widow's death; no prayer for temple lands.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f20",
      "text": "Defendants' defence: Sale by Rajlakshmi void; possession of Ram Rakhal etc. adverse, acquired title by adverse possession; suit barred by limitation.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f21",
      "text": "Trial court (Subordinate Judge, 3rd Court, 24-Parganas) decreed for plaintiffs on 22.12.1948; held not barred by limitation (Art 141 not attracted but suit within time).",
      "type": "procedural",
      "date": "1948-12-22",
      "source": "lower_court"
    },
    {
      "id": "f22",
      "text": "High Court Division Bench (Das and Guha JJ.) reversed on 19.06.1950; applied Art 124, suit barred; dismissed suit.",
      "type": "procedural",
      "date": "1950-06-19",
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Appeal to Supreme Court by plaintiffs.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the plaintiffs suit is governed by article 124 or article 141 of the Limitation Act?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If article 124 applies, when did the defendant or her predecessors take possession of the hereditary office of shebait adversely to the plaintiffs?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Alienation of shebaiti right by shebait void; alienee trespasser, possession adverse from beginning against transferor (Rajlakshmi), but adverse possession against widow does not bar reversioners who do not derive title from her; Art 141 applies.",
      "supporting_facts": [
        "f7",
        "f12",
        "f16",
        "f17"
      ],
      "legal_basis": "Article 141 Limitation Act; principle since 1871"
    },
    {
      "id": "pa2",
      "text": "Even if Art 124 applies, possession adverse to plaintiffs only from widow's death, not before; suit within 12 years.",
      "supporting_facts": [
        "f16",
        "f19"
      ],
      "legal_basis": "Article 124 Limitation Act; Section 2(8) definition of plaintiff"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No general principle that adverse possession against Hindu widow does not bar reversioners; rule confined to Art 141 cases; Art 141 inapplicable; Art 124 governs; possession adverse from transfer date against all.",
      "supporting_facts": [
        "f12",
        "f11"
      ],
      "legal_basis": "Article 124 Limitation Act; law prior to Art 141; female shebait powers not restricted like widow's estate"
    },
    {
      "id": "ra2",
      "text": "Shebaitship hereditary office; female shebait holds completely like male; next shebait bound by prior possession.",
      "supporting_facts": [
        "f7",
        "f15"
      ],
      "legal_basis": "Gnanasambanda v. Velu; shebait represents entire trust estate"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "History of limitation law: Pre-1871, adverse possession against widow barred reversioners (Shivagunga, Nobin Chunder); Act 1871 introduced Art 142 (now 141) changing law, cause of action accrues on widow's death; deliberate legislative change assimilating widow's estate to life estate for limitation.",
      "addresses_issue": "i1",
      "key_observation": "Article 141 recognizes reversioners do not trace title through widow; adverse possession against widow does not bar reversioners."
    },
    {
      "id": "cr2",
      "text": "Shebaiti right combines office and property; heritable; female shebait has widow's estate (limited alienation due to inherent restrictions, not gender; reverts to last male heirs); but Art 141 applies only to 'immovable property'; shebaiti right is hereditary office under Art 124.",
      "addresses_issue": "i1",
      "key_observation": "Article 124 applies, not 141."
    },
    {
      "id": "cr3",
      "text": "Under Art 124, possession must be adverse to plaintiff or person through whom plaintiff derives title (Sec 2(8)); reversioners do not derive through widow; adverse possession starts on widow's death.",
      "addresses_issue": "i2",
      "key_observation": "To defeat reversioner under Art 124, adverse to heir of last male holder."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Article 124 of Limitation Act applies to suit for possession of hereditary shebaiti office, not Article 141.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "For Art 124, defendant must prove possession adverse to plaintiff or through whom plaintiff derives title; reversioners claim as heirs of Haran (last male), not through widow Rajlakshmi; adverse possession commences only on her death.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Plaintiffs' suit not barred by limitation.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Katama Natchier v. Rajah of Shivagunga",
      "citation": "9 Moo. I.A. 539",
      "treatment": "followed",
      "relevance": "Widow represents estate; decree against her binds reversioner."
    },
    {
      "case_name": "Nobin Chunder v. Issur Chunder",
      "citation": "9 W.R. 505",
      "treatment": "referred",
      "relevance": "Pre-1871: adverse possession against widow bars reversioners."
    },
    {
      "case_name": "Aumirtolall v. Rajonee Kant",
      "citation": "2 I.A. 113",
      "treatment": "followed",
      "relevance": "Affirmed Nobin Chunder under 1859 Act."
    },
    {
      "case_name": "Srinath Kur v. Prosunno Kumar",
      "citation": "9 Cal. 934",
      "treatment": "followed",
      "relevance": "Art 141 assimilates widow's estate to life estate for limitation."
    },
    {
      "case_name": "Vundravandas v. Cursondas",
      "citation": "21 Bom. 646",
      "treatment": "followed",
      "relevance": "Full Bench; affirmed by PC in Ranchordas."
    },
    {
      "case_name": "Ranchordas v. Parvati",
      "citation": "26 I.A. 71",
      "treatment": "followed",
      "relevance": "Reversioner's right accrues on widow's death; even for movables."
    },
    {
      "case_name": "Vaithialinga v. Srirangath",
      "citation": "52 I.A. 322",
      "treatment": "distinguished",
      "relevance": "Some doubted effect on Ranchordas but overruled."
    },
    {
      "case_name": "Jaggo v. Utsava",
      "citation": "56 I.A. 267",
      "treatment": "followed",
      "relevance": "Set doubts at rest; cause of action on widow's death unless fair decree."
    },
    {
      "case_name": "Pydigantan v. Rama Dass",
      "citation": "28 Mad. 197",
      "treatment": "distinguished",
      "relevance": "Female shebait rights not more restricted."
    },
    {
      "case_name": "Lilabati v. Bishen",
      "citation": "6 C.L.J. 621",
      "treatment": "distinguished",
      "relevance": "Followed Pydigantan."
    },
    {
      "case_name": "Gnanasambanda v. Velu",
      "citation": "27 I.A. 69",
      "treatment": "followed",
      "relevance": "Adverse possession under Art 124 must be against plaintiff or through whom derives title; heir suit allowed post-12 years from vendor."
    },
    {
      "case_name": "Angurbala v. Debabrata",
      "citation": "1951 S.C.R. 1125",
      "treatment": "referred",
      "relevance": "Hereditary office treated like land for limitation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Limitation Act",
      "sections": [
        "Article 124",
        "Article 141",
        "Section 2(8)"
      ],
      "relevance": "Governs suit for possession of hereditary office; 12 years from adverse possession to plaintiff or through whom derives title; Art 141 for reversioners post female heir death (immovable property)."
    },
    {
      "name": "Limitation Act, 1859",
      "sections": [
        "Section 12",
        "Section 16"
      ],
      "relevance": "Pre-1871 law: general 12 years from cause of action; adverse against widow barred reversioners."
    },
    {
      "name": "Limitation Act, 1871",
      "sections": [
        "Article 142"
      ],
      "relevance": "Introduced special rule for reversioners; 12 years from female heir's death."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court holds Article 124 applies but suit not barred by limitation as adverse possession to plaintiffs commenced only on Rajlakshmi's death in 1943; reverses High Court; allows plaintiffs' appeal (implied restoration of trial decree).",
    "relief_granted": "Possession of one-third shebaiti right (10 days pala); mesne profits.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the alienation of the shebaiti right by a shebait in favour of a stranger is absolutely void in Hindu law and cannot be validated even on the footing of a custom. The alienee of the right is, therefore, a trespasser out and out and his possession as against the transferor is adverse from the very beginning.",
      "speaker": "court",
      "significance": "Establishes transferee's possession adverse to widow from transfer."
    },
    {
      "text": "the cause of action for a suit to be instituted by a reversioner to recover such property either against an alienee from the female heir or a trespasser who held adversely to her accrues only on the death of the female heir.",
      "speaker": "court",
      "significance": "Core principle protecting reversioners from widow's laches."
    },
    {
      "text": "shebaitship combines in it both the elements of office and property. As the shebaiti interest is heritable and follows the line of inheritance from the founder obviously when the heir is a female, she must be deemed to have, what is known, as widows estate in the shebaiti interest.",
      "speaker": "court",
      "significance": "Characterizes female shebait's estate for succession."
    },
    {
      "text": "to defeat the title of the plaintiff under article 124 it is necessary to establish that the defendant had taken possession of the office adversely to the plaintiff or somebody from or through whom the plaintiff derives his title, more than 12 years prior to the institution of the suit.",
      "speaker": "court",
      "significance": "Interprets Art 124 with Sec 2(8) for reversioners."
    }
  ],
  "_case_id": "1953_9",
  "_label": 1,
  "_text_length": 29922,
  "_extracted_at": "2026-02-10T19:14:13.136388"
}