{
  "metadata": {
    "case_name": "Ham Narayan Singh on behalf of Dr. S. P. Mukerjee, Shri N. C. Chatterjee, Pandit Nandial Sharma and Pandit Guru Dutt Vaid v. Respondents",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "Patanjali Sastri C.J."
    ],
    "case_number": "Petition No. 54 of 1953",
    "date_of_judgment": "1953-03-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Four persons - Dr. S. P. Mukerjee, Shri N. C. Chatterjee, Pandit Nandial Sharma and Pandit Guru Dutt Vaid - arrested on the evening of the 6th March, 1953, prosecuted for alleged defiance of an order prohibiting meetings and processions, offence under section 188 of the Indian Penal Code.",
      "type": "material",
      "date": "1953-03-06",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Remand order alleged to have been passed by Mr. Dhillon, Additional District Magistrate, Delhi, at about 8 p.m. on the 6th March, 1953; conceded to have expired on the 9th March and no longer in force.",
      "type": "procedural",
      "date": "1953-03-06",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Remand order alleged to have been passed by the trying Magistrate at about 3 p.m. on the 9th March, 1953, while adjourning the case on representation that a habeas corpus petition was being moved in this Court.",
      "type": "procedural",
      "date": "1953-03-09",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Order of trying Magistrate under section 344 CrPC produced: merely directs adjournment of case till 11th March, contains no direction for remanding accused to custody.",
      "type": "procedural",
      "date": "1953-03-09",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "This Court's order on 10th March directed production of records before Additional District Magistrate and trying Magistrate together with remand papers.",
      "type": "procedural",
      "date": "1953-03-10",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Four slips of paper handed to Registrar at 5:20 p.m. last evening, purporting to be warrants dated 6th March with endorsements 'Remanded to judicial till 11th March, 1953'; not produced notwithstanding direction, court records do not contain any order of remand on 9th March.",
      "type": "procedural",
      "date": "1953-03-11",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Affidavit filed on behalf of Government on 10th March justifying detention as lawful.",
      "type": "procedural",
      "date": "1953-03-10",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Lawfulness of the detention of the four petitioners at the time of the return in habeas corpus proceedings.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Validity of the remand order alleged to have been made by the trying Magistrate on 9th March under section 344 CrPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Various questions of law and fact argued by Mr. Sethi on behalf of the petitioners.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Detention justified on basis of two remand orders: one by Additional District Magistrate on 6th March and other by trying Magistrate on 9th March.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Section 344 of the Criminal Procedure Code"
    },
    {
      "id": "ra2",
      "text": "Slips of paper were with a police officer present in court, filed before Registrar at 5:20 p.m. after court rose.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Unnecessary to discuss questions argued as first remand order of 6th March expired on 9th March.",
      "addresses_issue": "i1",
      "key_observation": "First remand order no longer in force."
    },
    {
      "id": "cr2",
      "text": "Trying Magistrate proceeding under section 344 CrPC, which requires every order of remand by court other than High Court to be in writing signed by presiding Magistrate; produced order only adjourns case, no remand direction.",
      "addresses_issue": "i2",
      "key_observation": "No valid written remand order."
    },
    {
      "id": "cr3",
      "text": "Cannot take notice of slips of paper produced late at 5:20 p.m.; not satisfied there was any order of remand to 11th March; court records do not contain such order.",
      "addresses_issue": "i2",
      "key_observation": "Documents not produced as directed."
    },
    {
      "id": "cr4",
      "text": "In habeas corpus, regard to legality of detention at time of return (10th March), not institution; on that date no order remanding to custody.",
      "addresses_issue": "i1",
      "key_observation": "Detention unlawful on material date."
    },
    {
      "id": "cr5",
      "text": "Those depriving personal liberty must strictly observe forms and rules of law.",
      "addresses_issue": "i1",
      "key_observation": "Scrupulous observance required."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In habeas corpus proceedings, Court to have regard to legality of detention at time of return and not institution.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Order under section 344 CrPC by Magistrate must be in writing signed; mere adjournment without remand direction invalid.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "This Court",
      "citation": null,
      "treatment": "followed",
      "relevance": "Held that in habeas corpus, regard to legality at time of return."
    },
    {
      "case_name": "This Court",
      "citation": null,
      "treatment": "followed",
      "relevance": "Reiterated that those depriving liberty must strictly observe law."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Petition for writ of habeas corpus"
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 188"
      ],
      "relevance": "Offence for defiance of prohibiting order"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "Section 344"
      ],
      "relevance": "Remand on adjournment must be in writing signed by Magistrate"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Petition for habeas corpus succeeds as no valid remand order existed on 10th March, the material date; detention unlawful.",
    "relief_granted": "Writ of habeas corpus to be issued (implied by finding of unlawful detention)",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Every order made under this section by a Court other than a High Court shall be in writing signed by the presiding Judge or Magistrate.",
      "speaker": "court",
      "significance": "Requirements for valid remand under section 344 CrPC"
    },
    {
      "text": "We cannot take notice of documents produced in such circumstances, and we are not satisfied that there was any order of remand committing the accused to further custody till the 11th March.",
      "speaker": "court",
      "significance": "Rejection of late-produced slips as evidence of remand"
    },
    {
      "text": "This Court has often reiterated before that those who feel called upon to deprive other persons of their personal liberty... must strictly and scrupulously observe the forms and rules of the law.",
      "speaker": "court",
      "significance": "Principle on strict compliance in detention matters"
    }
  ],
  "_case_id": "1953_31",
  "_label": 1,
  "_text_length": 5147,
  "_extracted_at": "2026-02-08T22:11:25.886704"
}