{
  "metadata": {
    "case_name": "Rama Ayyar v. Ranganayaki Ammal",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "Mahajan J."
    ],
    "case_number": "Civil Appeal No. 95 of 1952",
    "date_of_judgment": "1953-04-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Lakshminarayana Iyer, a Hindu Brahmin, owned considerable properties in Tirunelveli district, died on 13th December, 1924, leaving widow Ranganayaki and married daughter Ramalakshmi, who had children alive at his death.",
      "type": "background",
      "date": "1924-12-13",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Before death, Lakshminarayana executed will on 16th November, 1924: widow to enjoy entire properties till her lifetime; thereafter Ramalakshmi and her heirs to enjoy with absolute rights and powers of alienation; widow to settle maintenance for daughter-in-law Lakshmi Ammal.",
      "type": "material",
      "date": "1924-11-16",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Ranganayaki entered possession of properties on husband's death.",
      "type": "procedural",
      "date": "1924-12-13",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 21st February, 1928, widow settled maintenance claim of Lakshmi Ammal by paying Rs. 3,350 cash and agreeing to pay Rs. 240 per annum, obtained release deed.",
      "type": "material",
      "date": "1928-02-21",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Ramalakshmi died on 25th April, 1938, during lifetime of widow; none of her children survived her.",
      "type": "material",
      "date": "1938-04-25",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On 24th July, 1945, widow, describing herself as absolute owner, sold one item of property to 2nd defendant for Rs. 500.",
      "type": "material",
      "date": "1945-07-24",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On 18th September, 1945, plaintiff (husband and sole heir of Ramalakshmi) instituted suit for declaration that sale not binding beyond widow's lifetime and restrain alienation of other properties.",
      "type": "procedural",
      "date": "1945-09-18",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On 19th September, 1945, ad interim injunction issued restraining widow from alienating properties.",
      "type": "procedural",
      "date": "1945-09-19",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On 27th September, 1945, despite injunction, widow executed two deeds of settlement in favour of other defendants comprising properties; plaint amended to challenge these.",
      "type": "material",
      "date": "1945-09-27",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Subordinate Judge of Tinnevelly, in Original Suit No. 50 of 1945, held widow took limited life interest, not absolute or Hindu widow's estate; daughter got vested interest; plaintiff succeeded; decree that widow had life estate, alienations not beyond her lifetime; validity of alienations left undetermined. Dated 13th August, 1946.",
      "type": "procedural",
      "date": "1946-08-13",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Defendants appealed to High Court of Madras (Appeal No. 635 of 1946); during pendency, widow died on 14th February, 1948; High Court affirmed trial court on 27th February, 1950.",
      "type": "procedural",
      "date": "1950-02-27",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Leave to appeal to Supreme Court granted; appeal admitted on 27th November, 1951.",
      "type": "procedural",
      "date": "1951-11-27",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the estate granted by the testator to his widow was a full woman's estate under Hindu law or merely a limited life estate in the English sense.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the daughter's interest under the will was vested or contingent.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Plaintiff had no title to maintain suit; widow entitled under will to absolute estate or at least estate analogous to or no less than Hindu widow's estate; estate to daughter contingent, she predeceased widow so no interest devolved on plaintiff.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Hindu law on widow's estate; precedents like Ram Bahadur Jager Nath Prasad, Pavani Subbamma, Vasantharao Ammannamma"
    },
    {
      "id": "pa2",
      "text": "Testator, Brahmin versed in sastras, intended restricted estate analogous to Hindu woman's estate, not English life estate; construe by analogy to similar wills.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Ordinary notions of Hindus on property devolution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Ramalakshmi obtained vested interest in properties under father's will; plaintiff as sole heir entitled to maintain suit.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Law leans in favour of vesting estates (Jarman on Wills)"
    },
    {
      "id": "ra2",
      "text": "No express or implied power of alienation for legal necessities conferred on widow, negativing Hindu widow's estate.",
      "supporting_facts": [
        "f2",
        "f6",
        "f9"
      ],
      "legal_basis": "Precedents like Ratna Chetty, Mst. Bhagwati Devi, Lallu v. Jagmohan"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Testator intended widow to have limited life estate: enjoy till lifetime, then pass entire to daughter and heirs absolutely with alienation powers; no powers to widow; daughter fresh stock of descent.",
      "addresses_issue": "i1",
      "key_observation": "Properties to be kept intact for daughter; no indication daughter takes only undisposed remainder."
    },
    {
      "id": "cr2",
      "text": "No express power of alienation to widow; implicit power for debts/maintenance not necessary as properties sufficient; even if so, falls short of Hindu widow's wide powers.",
      "addresses_issue": "i1",
      "key_observation": "Widow had control over income but no power over corpus."
    },
    {
      "id": "cr3",
      "text": "Daughter got vested interest: present right of future enjoyment; law favours vesting.",
      "addresses_issue": "i2",
      "key_observation": "Certain she gets entire estate."
    },
    {
      "id": "cr4",
      "text": "Construction by analogy to other wills dangerous; depends on language and circumstances; distinguished cited cases as differently worded.",
      "addresses_issue": "i1",
      "key_observation": "No sufficient grounds to disturb lower courts."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Estate conferred on widow was limited life estate in English sense, not full Hindu widow's estate.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Daughter got vested interest in properties on testator's death.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ram Bahadur Jager Nath Prasad",
      "citation": "3 Pat. L. J. 199",
      "treatment": "distinguished",
      "relevance": "No analogy; different indications for widow's estate."
    },
    {
      "case_name": "Pavani Subbamma v. Ammala Rama Naidu",
      "citation": "1937 1 M.L.J. 268",
      "treatment": "distinguished",
      "relevance": "Supports limited interest; observations on possible widow's estate not binding."
    },
    {
      "case_name": "Maharaja of Kolhapur v. Sundaram Iyer",
      "citation": "1925 I.L.R. 48 Mad. 1",
      "treatment": "referred",
      "relevance": "Life estate resembling widow's but not inheritance."
    },
    {
      "case_name": "Nathu Ram Mahajan v. Gangayabai",
      "citation": null,
      "treatment": "referred",
      "relevance": "Casual observation on possession not helpful."
    },
    {
      "case_name": "Vasantharao Ammannamma v. Venkata Kodanda Rao Pantalu",
      "citation": "1940 M.L.J. 188",
      "treatment": "distinguished",
      "relevance": "Different language; reasoning would support limited estate here."
    },
    {
      "case_name": "Mahomed Shumsool v. Shewukram",
      "citation": "1874-75 2 I.A. 7",
      "treatment": "referred",
      "relevance": "Consider Hindu notions but language governs."
    },
    {
      "case_name": "Ratna Chetty v. Narayanaswami Chetty",
      "citation": "1914 26 M.L.J. 616",
      "treatment": "distinguished",
      "relevance": "Vested interest in that case; not relevant."
    },
    {
      "case_name": "Mst. Bhagwati Devi v. Chowdry Bholonath Thakur",
      "citation": "1874-75 2 I.A. 256",
      "treatment": "distinguished",
      "relevance": "Plain meaning life estate; distinguishable."
    },
    {
      "case_name": "Lallu v. Jagmohan",
      "citation": "1898 I.L.R. 22 Bom. 409",
      "treatment": "followed",
      "relevance": "Life estate with vested remainder."
    },
    {
      "case_name": "Sasiman v. Shib Narain",
      "citation": null,
      "treatment": "referred",
      "relevance": "Construction by analogy dangerous."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hindu Law",
      "sections": [
        "Widow's estate rules"
      ],
      "relevance": "Distinguished from will-created limited estate; Hindu can create life estate by will."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court affirmed High Court and trial court: widow had limited life estate, alienations not binding beyond her lifetime; no grounds to disturb unanimous lower court opinion on will construction.",
    "relief_granted": "Declaratory decree upheld that widow had life estate; alienations not enure beyond lifetime.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The courts primary duty in such cases is to ascertain from the language employed by the testator what were his intentions, keeping in view the surrounding circumstances...",
      "speaker": "court",
      "significance": "Guiding principle for will construction."
    },
    {
      "text": "We therefore hold that the estate conferred on Ranganayaki Ammal was more like the limited estate in the English sense of the term than like a full Hindu widows estate...",
      "speaker": "court",
      "significance": "Core holding on estate type."
    },
    {
      "text": "According to Jarman on Wills, the law leans in favour of vesting of estates...",
      "speaker": "court",
      "significance": "Basis for vested interest in daughter."
    }
  ],
  "_case_id": "1953_106",
  "_label": 0,
  "_text_length": 30562,
  "_extracted_at": "2026-02-08T22:11:35.003794"
}