{
  "metadata": {
    "case_name": "Defendant No. 1 (grandsons of Girdhari Balaram) v. Respondents (daughter and grandsons of Vinayakbhat)",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "MAHAJAN J."
    ],
    "case_number": "Civil Appeal No. 154 of 1952",
    "date_of_judgment": "1953-02-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Ramabai owned two inam lands at Mundhava, Pratibhandi Nos. 71 and 72 (corresponding to present survey Nos. 86/1 and 86/2).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 1st July 1863, Ramabai passed a permanent lease of both lands to Ladha Ibrahim Sheth for premium of Rs. 999, yearly rent of Rs. 80 during her lifetime and after her death yearly amount equal to assessment to heirs. Lease provided that in default of payment of rent, tenant's rights would come to an end.",
      "type": "material",
      "date": "1863-07-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 18th August 1870, Ladha Ibrahim sold tenancy rights to Girdhari Balaram Lodhi for Rs. 7,999. Sale deed provided that in default of payment of rent to Ramabai or heirs, purchaser would have no rights. Purchaser passed rent note in favour of Ramabai for payment in month of Poush every year, default leading to no right over land.",
      "type": "material",
      "date": "1870-08-18",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Defendant No. 1 and other defendants are grandsons of Girdhari Balaram. Lessee has been habitual defaulter.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In 1913, rent for six years in arrears. Vinayakbhat filed Suit No. 99 of 1913 for possession on forfeiture. Defences including no notice negatived, but relief against forfeiture granted. Defendant No. 1 was minor, became major around 1925.",
      "type": "procedural",
      "date": "1913",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In 1928, rent for two years (later three years) in arrears. Vinayakbhat filed Civil Suit No. 258 of 1928 for possession. Plaintiff waived forfeiture by accepting arrears and costs.",
      "type": "procedural",
      "date": "1928",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In 1931, rent for three years in arrears, sent by money order and accepted by landlord.",
      "type": "material",
      "date": "1931",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In 1934, rent for three years unpaid. Government proceedings for acquisition of old survey No. 72. Landlord claimed full compensation as tenant rights forfeited. Defendant No. 1 sent notice, landlord accepted arrears, forfeiture waived. Defendants got Rs. 32,000 compensation for tenancy rights in No. 72, landlord Rs. 1,400.",
      "type": "material",
      "date": "1934",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In 1938, rent for four years in arrears. Vinayakbhat filed Civil Suit No. 982 of 1938 for possession of 86/1 and 86/2. Defences negatived, forfeiture held but relief granted. District Judge on appeal refused to interfere but warned no relief for fourth default.",
      "type": "procedural",
      "date": "1938",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Default on 28th January 1941, rent not paid though demanded. Plaintiff filed Suit No. 858 of 1941 for possession of 86/1 and 86/2 after removal of structures, and arrears.",
      "type": "material",
      "date": "1941-01-28",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Defendant No. 1 pleaded partition gave him 86/2; plaintiff to approach for rent; no demand made; offered rent but refused fraudulently; notice required; relief against forfeiture.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Trial court (Extra Joint Sub-Judge Poona) decreed suit on 31st March 1943, possession with condition for structures till end March 1950. Held lease determined u/s 111(b) TPA, no notice u/s 111(g) needed; no relief due to contumacious conduct, habitual default post-1922/23, false defences.",
      "type": "procedural",
      "date": "1943-03-31",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Plaintiff took possession April 1943 except one acre on 13th Sept 1943. Defendant No. 1 retained structures on 86/2.",
      "type": "procedural",
      "date": "1943-04",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "District Court Poona (Civil Appeal No. 175/1943) on 19th March 1945 confirmed decree with mods: allowed removal of buildings/trees on 86/2 within 3 months. Held lease u/s 111(g) but no notice needed for pre-TPA lease. No interference on relief refusal.",
      "type": "procedural",
      "date": "1945-03-19",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "High Court Bombay (Second Appeal No. 557/1945, Chagla CJ & Gajendragadkar J) on 23rd June 1949 dismissed appeal, allowed cross-objections on trees/costs. Leave to SC granted for 86/2.",
      "type": "procedural",
      "date": "1949-06-23",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether notice as contemplated by section 111(g) of the Transfer of Property Act is necessary for the determination of a lease for non-payment of rent even where such lease was executed before the coming into force of the Transfer of Property Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the High Court should have interfered with the discretion of the lower courts in refusing relief against forfeiture in the circumstances of this case.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Notice in writing u/s 111(g) TPA required even for pre-TPA lease as amendment embodies principle of justice, equity and good conscience applicable via s.2 TPA.",
      "supporting_facts": [
        "f2",
        "f3",
        "f10"
      ],
      "legal_basis": "Section 111(g) TPA (as amended 1929); principles of justice, equity and good conscience; Umar Pulavar v. Dawood Rowther; Krishna Shetti v. Gilbert Pinto"
    },
    {
      "id": "pa2",
      "text": "Relief against forfeiture should be granted as discretion must favour tenant if no third party injury and rent tendered.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Section 114 TPA; Debendralal Khan v. F.M.A. Cohen"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No notice required for pre-TPA lease; filing suit manifests election to forfeit. Habitual defaulter disentitled to relief.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7",
        "f8",
        "f9",
        "f12"
      ],
      "legal_basis": "Pre-TPA law; institution of suit sufficient; s.111(g) unamended"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Lease executed 1863 before TPA 1882, excluded by s.2 TPA. 1929 amendment to s.111(g) not retrospective (s.63 Act XX 1929 applies post 1.4.1930). Written notice is statutory formality, not equity principle; equity requires no specific form, oral or suit suffices. English law: no notice for non-payment rent, suit is unequivocal act.",
      "addresses_issue": "i1",
      "key_observation": "Provision as to notice in writing is not based on principle of justice, equity and good conscience."
    },
    {
      "id": "cr2",
      "text": "Indian cases hold for pre-TPA leases, forfeiture complete on breach, suit manifests election. Lessee cannot terminate unilaterally or take advantage of own wrong.",
      "addresses_issue": "i1",
      "key_observation": "Institution of suit is sufficient manifestation of election."
    },
    {
      "id": "cr3",
      "text": "Cited cases distinguished/overruled where notice held equity principle. TPA provisions not all equity-based.",
      "addresses_issue": "i1",
      "key_observation": "Careful in applying TPA as guide only if embodies general equity."
    },
    {
      "id": "cr4",
      "text": "Relief u/s 114 discretionary; consider conduct, delay. Habitual defaulter (25 years defaults, false defences, warned previously) disentitled; must come with clean hands.",
      "addresses_issue": "i2",
      "key_observation": "No rigid rule; wide discretion considering all circumstances and conduct."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No notice u/s 111(g) TPA required for pre-TPA lease; filing suit sufficient to determine lease on forfeiture for non-payment.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Lower courts' refusal of relief against forfeiture not to be interfered with; habitual defaulter's contumacious conduct disentitles relief.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Umar Pulavar v. Dawood Rowther",
      "citation": "A.I.R. 1947 Mad. 68",
      "treatment": "doubted",
      "relevance": "Held s.111(g) amended embodies equity requiring notice even for pre-TPA; court disagrees."
    },
    {
      "case_name": "Krishna Shetti v. Gilbert Pinto",
      "citation": "I.L.R. 42 Mad. 654",
      "treatment": "distinguished",
      "relevance": "TPA reproduces English equity rules; court limits, not all provisions equity-based."
    },
    {
      "case_name": "Prakashchandra Das v. Rajendranath Basu",
      "citation": "I.L.R. 58 Cal. 1359",
      "treatment": "followed",
      "relevance": "Institution of suit manifests election for pre-TPA forfeiture."
    },
    {
      "case_name": "Padmabhaya v. Ranga",
      "citation": "I.L.R. 34 Mad. 161",
      "treatment": "followed",
      "relevance": "Forfeiture complete on breach; election not precedent to action."
    },
    {
      "case_name": "Rama Aiyangar v. Guruswami Chetty",
      "citation": "35 M.L.J. 129",
      "treatment": "followed",
      "relevance": "Suit institution determines pre-TPA lease, no prior notice."
    },
    {
      "case_name": "Venkatachari v. Rangaswami Aiyar",
      "citation": "36 M.L.J. 532",
      "treatment": "followed",
      "relevance": "Same view as above."
    },
    {
      "case_name": "Nourang Singh v. Janardan Kishor",
      "citation": "I.L.R. 45 Cal. 469",
      "treatment": "distinguished",
      "relevance": "Suit not requisite act; dissented from."
    },
    {
      "case_name": "Ramakrishna Mallaya v. Baburaya",
      "citation": "24 I.C. 139",
      "treatment": "followed",
      "relevance": "No act needed beyond suit for pre-TPA ejectment."
    },
    {
      "case_name": "Hyman v. Rose",
      "citation": "1912 A.C. 623",
      "treatment": "followed",
      "relevance": "Wide discretion u/s 114-like provision; no rigid rules, consider conduct."
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [
        "111(g)",
        "111(b)",
        "2",
        "114"
      ],
      "relevance": "s.111(g): Forfeiture by breach requires notice post-1929 amendment (not applicable here); s.114: Relief against forfeiture discretionary; s.2 excludes pre-Act leases."
    },
    {
      "name": "Transfer of Property (Amendment) Act, 1929 (Act XX of 1929)",
      "sections": [
        "63"
      ],
      "relevance": "Amendment to s.111(g) applies only to transfers after 1st April 1930."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal confined to survey No. 86/2, confirming High Court decree granting possession to respondents on forfeiture of lease for non-payment of rent, refusing relief against forfeiture due to appellant's conduct.",
    "relief_granted": "Possession of survey No. 86/2 to respondents; appellant allowed prior removals per lower courts.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is axiomatic that the courts must apply the principles of justice, equity and good conscience to transactions which come up before them for determination even though the statutory provisions of the Transfer of Property Act are not made applicable to these transactions.\"",
      "speaker": "court",
      "significance": "Basis for considering if TPA amendment embodies equity."
    },
    {
      "text": "\"The insistence therein that the notice should be given in writing is intrinsic evidence of the fact that the formality is merely statutory and it cannot trace its origin to any rule of equity.\"",
      "speaker": "court",
      "significance": "Rejects notice as equity principle for pre-TPA leases."
    },
    {
      "text": "\"No rule of equity, justice or good conscience can be invoked in the case of a tenant of this description. He cannot always be allowed to take advantage of his own wrong.\"",
      "speaker": "court",
      "significance": "Justifies refusal of relief to habitual defaulter."
    }
  ],
  "_case_id": "1953_19",
  "_label": 0,
  "_text_length": 38956,
  "_extracted_at": "2026-02-10T19:13:52.455409"
}