{
  "metadata": {
    "case_name": "State of Bihar v. Gaya Electric Supply Co. Ltd.",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "Mahajan J."
    ],
    "case_number": "Civil Appeal No. 175 of 1951",
    "date_of_judgment": "1953-02-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "A licence for the supply of electric energy in the town of Gaya was obtained by one Khandelwal in the year 1928 under the Indian Electricity Act, 1910.",
      "type": "background",
      "date": "1928",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "With the required sanction of the Government the licence was transferred to the Gaya Electric Supply Co. Ltd. in 1932.",
      "type": "background",
      "date": "1932",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "By a notification dated 23rd June, 1949, the licence was revoked by the Government with effect from 9th July, 1949.",
      "type": "background",
      "date": "1949-06-23",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Thereupon the company filed a suit against the State for a declaration that the revocation of the licence was arbitrary, mala fide and ultra vires (Suit No. 58 of 1949).",
      "type": "procedural",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "During the pendency of the suit negotiations started between the company and the State for a settlement of the dispute and ultimately on 28th October, 1949, a deed of agreement was arrived at between them.",
      "type": "background",
      "date": "1949-10-28",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Effect of the agreement: The company would withdraw the suit No. 58 of 1949 unconditionally on 25th October, 1949.",
      "type": "material",
      "date": "1949-10-25",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Within three days of the withdrawal of the suit the State of Bihar would make an advance payment of rupees five lakhs to the company, and simultaneously the company would formally hand over the possession of the undertaking to an authorized officer of the Government.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Both parties will make their respective valuations within three months of taking over the undertaking and any balance of money found due to the company as per Government valuation will be paid to the company and in case of overpayment the excess paid to the company on account of the advance payment of rupees five lakhs will be refunded to the Government.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In the case of any difference or dispute between the parties over the payment of the balance which may be found due after valuation such dispute shall be submitted to the sole arbitration of a single arbitrator who should be a high government officer of the provincial government of rank equal to or higher than a Divisional Commissioner and his award shall be binding and final on both parties.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The arbitration clause is contained in a letter dated 13th October, 1949, and was substantially accepted by the company in its letter dated 17th October, 1949.",
      "type": "material",
      "date": "1949-10-13",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "As set out by the State Government: 'In the case of any difference or dispute between the parties over the valuation as arrived at by the Government and that arrived at by the company, such difference or dispute, including the claim for additional compensation of 20% shall be referred to arbitration'.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "In pursuance of the agreement the respondent (State) took over the undertaking on 28th October, 1949, and also made a payment of rupees five lakhs to the company.",
      "type": "procedural",
      "date": "1949-10-28",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On the 19th January, 1950, the company sent a statement of valuation of the assets amounting to Rs. 22,06,072, to the Chief Electrical Engineer, Bihar.",
      "type": "material",
      "date": "1950-01-19",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The Chief Electrical Engineer characterized the valuation of 22 lakhs by the company as fantastic and stated that according to a rough valuation the amount would be approximately five lakhs and that the final valuation would be settled after the company had furnished a detailed history of the plants and machineries.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The company declined to give any further details and stated that time was of the essence of the contract and it would be extended from 28th January, to 15th February, 1950.",
      "type": "disputed",
      "date": "1950-01-28",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "On 6th April, 1950, the Chief Electrical Engineer intimated that the valuation amounted to Rs. 6,56,221.",
      "type": "material",
      "date": "1950-04-06",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "No reply to this letter was received and the State Government intimated to the company that as difference and dispute had arisen relating to valuation, Mr. M. S. Rao, C.S. was being appointed as sole arbitrator to decide the dispute.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "On 28th September, 1950, the company instituted the suit (Title Suit No. 47 of 1950), the subject-matter of the application for stay, after necessary notice under section 80 of the Code of Civil Procedure.",
      "type": "procedural",
      "date": "1950-09-28",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "In the plaint it was alleged that as the State Government had failed and neglected to make its valuation or to make payment to the company by the 15th March, 1950, it committed a breach of the agreement and by reason of this breach the company had rescinded the agreement and had forfeited the sum of five lakhs paid as advance by the State.",
      "type": "disputed",
      "date": "1950-03-15",
      "source": "respondent"
    },
    {
      "id": "f20",
      "text": "The company prayed inter alia for the reliefs of declaration that the electrical undertaking belonged to them, for damages, for appointment of receiver and for injunction.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f21",
      "text": "On the 9th October, 1950, the State Government filed the present application under section 34 of the Indian Arbitration Act.",
      "type": "procedural",
      "date": "1950-10-09",
      "source": "petitioner"
    },
    {
      "id": "f22",
      "text": "It was stated therein that the company had with a dishonest and mala fide motive and with a view to avoid the decision of the matter in dispute in arbitration instituted the suit on incorrect and false allegations; that the arbitration agreement was still subsisting and valid and binding on the parties.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f23",
      "text": "The company denied the allegations of mala fides and pleaded that the arbitration clause was no longer in existence and that even assuming it to be in existence, the suit was in no way connected with the same.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f24",
      "text": "The subordinate judge held that the suit was not in respect of any matter agreed to be referred, and that the court had no jurisdiction to stay the proceedings. In the result the stay application was dismissed.",
      "type": "procedural",
      "date": "1950-12-18",
      "source": "lower_court"
    },
    {
      "id": "f25",
      "text": "Against this order the State Government appealed to the High Court (Miscellaneous Appeal No. 19 of 1951).",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f26",
      "text": "The High Court held that the dispute in the suit was one which arose out of or was in respect of the agreement and that the question in the suit was directly within the scope of the arbitration clause. (Order dated 30th March, 1951 by Ramaswami and Rai JJ.)",
      "type": "procedural",
      "date": "1951-03-30",
      "source": "court"
    },
    {
      "id": "f27",
      "text": "By an order of this court dated 22nd May, 1951, the company was granted special leave under article 136 of the Constitution.",
      "type": "procedural",
      "date": "1951-05-22",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the legal proceedings (suit filed by the company) are in respect of any matter agreed to be referred under the arbitration clause, warranting a stay under section 34 of the Indian Arbitration Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The suit arose out of and related to the agreement and was covered by the arbitration clause; the cause of action as alleged in the plaint being non-compliance with the agreement; the arbitration agreement was still subsisting and valid; the State was ready and willing to have the dispute settled by arbitration; the company instituted the suit with dishonest and mala fide motive.",
      "supporting_facts": [
        "f12",
        "f13",
        "f16",
        "f17",
        "f19"
      ],
      "legal_basis": "Section 34, Indian Arbitration Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The State Government committed breach by failing to make valuation or payment by 15th March 1950; time was of the essence; agreement rescinded and 5 lakhs forfeited; arbitration clause no longer in existence; suit not connected with arbitration clause.",
      "supporting_facts": [
        "f15",
        "f19"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The suit was not in respect of any matter agreed to be referred.",
      "supporting_facts": [
        "f24"
      ],
      "legal_basis": "Section 34, Indian Arbitration Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The legal proceeding sought to be stayed must be in respect of a matter agreed to be referred and within the ambit of the arbitration agreement; if suit outside submission, court bound to refuse stay.",
      "addresses_issue": "i1",
      "key_observation": "Language of section 34 clear."
    },
    {
      "id": "cr2",
      "text": "Quoting Heyman v. Darwins Ltd.: Answer depends on (a) what is the dispute, (b) what disputes the clause covers. If clause broad embracing any dispute in respect of agreement, and avoidance arises out of terms, referable; but if avoidance for reasons dehors contract, not.",
      "addresses_issue": "i1",
      "key_observation": "Arbitration clause must be considered according to its language."
    },
    {
      "id": "cr3",
      "text": "Present dispute from plaint paras 14-17: Government committed breach, failed to value/pay, time essence, rescinded agreement, forfeited 5 lakhs, entitled to compensation for deprivation.",
      "addresses_issue": "i1",
      "key_observation": "Claim founded on rescission of agreement containing arbitration clause and breach thereof."
    },
    {
      "id": "cr4",
      "text": "If clause broadly worded 'all disputes arising out of agreement', suit might be within ambit; but here clause narrow: 'if any difference or dispute arises over the payment of the balance which may be found due after valuation' or 'over the valuation as arrived at by Government and company'.",
      "addresses_issue": "i1",
      "key_observation": "Scope limited to valuation pure and simple; breach/rescission outside."
    },
    {
      "id": "cr5",
      "text": "Scheme: Government to value within 3 months per Electricity Act, pay balance or refund excess; dispute over valuation (incl. 20% extra) to arbitration.",
      "addresses_issue": "i1",
      "key_observation": "Arbitrator has no power on time essence or breach by not valuing in time."
    },
    {
      "id": "cr6",
      "text": "High Court erred in considering whether compensation payable within 3 months or after award; that is issue in suit; under s.34, only check if claim within submission, not merits.",
      "addresses_issue": "i1",
      "key_observation": "Function under s.34 limited."
    },
    {
      "id": "cr7",
      "text": "High Court wrongly relied on Harinagar Sugar Mills (broad clause) and Governor-General case (any dispute arising out of contract).",
      "addresses_issue": "i1",
      "key_observation": "Those clauses comprehensive, unlike here."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The arbitration clause is narrow and covers only disputes over valuation/difference in valuations and payment of balance due after valuation; the suit claiming breach, rescission and forfeiture is outside its scope; application for stay under s.34 refused.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Heyman v. Darwins Ltd.",
      "citation": "1942 A.C. 356",
      "treatment": "referred",
      "relevance": "Principle on scope of arbitration clause: depends on what dispute is and what clause covers; broad vs. narrow clauses; avoidance out of terms vs. dehors."
    },
    {
      "case_name": "Monro v. Bognor Urban Council",
      "citation": "1915 3 K.B. 167",
      "treatment": "referred",
      "relevance": "Under stay provision, only consider if claim within submission; merits (frivolous etc.) irrelevant."
    },
    {
      "case_name": "Harinagar Sugar Mills Ltd. v. Skoda India Ltd.",
      "citation": "A.I.R. 1948 Cal. 230",
      "treatment": "distinguished",
      "relevance": "High Court relied erroneously; clause there comprehensive: dispute arising out of agreement."
    },
    {
      "case_name": "Governor-General in Council v. Associated Livestock Farm Ltd.",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "High Court relied erroneously; clause: any dispute or difference arising out of the contract."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Arbitration Act",
      "sections": [
        "34"
      ],
      "relevance": "Governs stay of proceedings if suit in respect of matter agreed to be referred; applicant ready/willing."
    },
    {
      "name": "Indian Electricity Act, 1910",
      "sections": null,
      "relevance": "Licence obtained/revoked under it; valuation as laid down therein."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "80"
      ],
      "relevance": "Notice given before suit."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "136"
      ],
      "relevance": "Special leave granted."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave, set aside the High Court's order granting stay, and held that the suit is not in respect of any matter agreed to be referred under the narrow arbitration clause, refusing stay under section 34 of the Arbitration Act.",
    "relief_granted": "Stay refused; suit to proceed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'In the case of any difference or dispute between the parties over the valuation as arrived at by the Government and that arrived at by the company, such difference or dispute, including the claim for additional compensation of 20 shall be referred to arbitration'.",
      "speaker": "court",
      "significance": "Exact wording of narrow arbitration clause defining its limited scope."
    },
    {
      "text": "'the answer to the question whether a dispute falls within an arbitration clause in a contract must depend on a what is the dispute, and b what disputes the arbitration clause covers.'",
      "speaker": "court",
      "significance": "Test from Heyman v. Darwins for determining arbitrability."
    },
    {
      "text": "'Questions relating to the breach of contract or its rescission are outside the reach of this clause.'",
      "speaker": "court",
      "significance": "Core holding on why suit not covered."
    }
  ],
  "_case_id": "1953_20",
  "_label": 1,
  "_text_length": 15871,
  "_extracted_at": "2026-02-10T19:13:48.648364"
}