{
  "metadata": {
    "case_name": "Defendant No. 1 v. Respondents (Heirs of Vinayakbhat)",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "MAHAJAN J."
    ],
    "case_number": "Civil Appeal No. 154 of 1952",
    "date_of_judgment": "1953-02-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Ramabai owned two inam lands at Mundhava (Pratibhandi Nos. 71 and 72, corresponding to present survey Nos. 86/1 and 86/2). On 1st July 1863, she passed a permanent lease of both to Ladha Ibrahim Sheth for premium of Rs. 999, yearly rent of Rs. 80 during her lifetime and after her death yearly amount equal to assessment to heirs. Lease provided that in default of payment of rent, tenant's rights would come to an end.",
      "type": "background",
      "date": "1863-07-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 18th August 1870, Ladha Ibrahim sold tenancy rights to Girdhari Balaram Lodhi for Rs. 7,999. Sale deed provided that in default of payment of rent to Ramabai or heirs, purchaser would have no rights. On same day, purchaser passed rent note in favour of Ramabai for payment in month of Poush every year, and in default tenant or heirs would have no right over land.",
      "type": "background",
      "date": "1870-08-18",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Defendant No. 1 and other defendants are grandsons of Seth Girdhari Balaram. Lessee has been more or less habitual defaulter in payment of rent despite nullity clause.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1913, rent for six years in arrears. Vinayakbhat filed Suit No. 99 of 1913 against defendants for possession on ground of forfeiture. Defences included no notice given. Contentions negatived but relief against forfeiture granted. Defendant No. 1 was minor then, became major in or about 1925.",
      "type": "procedural",
      "date": "1913",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In 1928, rent for two years in arrears. Vinayakbhat filed Civil Suit No. 258 of 1928 for possession on forfeiture. Plaintiff waived forfeiture by accepting three years rent and costs.",
      "type": "procedural",
      "date": "1928",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In 1931, rent for three years in arrears, sent by money order and accepted by landlord.",
      "type": "material",
      "date": "1931",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In 1934, rent for three years unpaid. Government proceedings for acquisition of old survey No. 72. Landlord claimed full compensation as tenant rights forfeited. Defendant No. 1 sent notice to Vinayakbhat to come and take arrears. Accepted arrears, forfeiture waived. Defendants got Rs. 32,000 compensation for tenancy rights in No. 72, Vinayakbhat Rs. 1,400 for landlord rights.",
      "type": "material",
      "date": "1934",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In 1938, rent for four years in arrears. Vinayakbhat filed Civil Suit No. 982 of 1938 for possession of 86/1 and 86/2 on forfeiture. Defendant No. 1 pleaded no forfeiture as no rent fixed for suit property and plaintiff to recover rent. Contentions negatived, forfeiture held but relief granted. District Judge on appeal refused to interfere but observed defendants should not expect relief fourth time if default again.",
      "type": "procedural",
      "date": "1938",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Default on 28th January 1941, rent due not paid though demanded. Plaintiff filed Suit No. 858 of 1941 for possession of 86/1 and 86/2 after removal of structures, and arrears.",
      "type": "material",
      "date": "1941-01-28",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Defendant No. 1 pleaded: partition rights in 86/2 to his share; per rent note plaintiff to approach for rent; no demand made so no forfeiture; offered rent but plaintiff refused fraudulently; notice required; alternatively relief against forfeiture.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Trial court (Extra Joint Sub-Judge Poona) decreed suit 31st March 1943: no notice needed as lease determined u/s 111(b) not 111(g) TPA, clause of nullity not forfeiture; no relief against forfeiture due to contumacious conduct, habitual default post-1922-23, false defences. Condition: defendant No. 1 possess structures till end March 1950. Plaintiff took possession April 1943 except one acre Sept 1943.",
      "type": "procedural",
      "date": "1943-03-31",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Defendant No. 1 appealed to District Judge Poona (Civil Appeal 175/1943), confirmed 19th March 1945 with mods: allow remove buildings/trees on 86/2 within 3 months. Held lease ended u/s 111(g) but no notice needed as pre-TPA lease. No interference on relief issue.",
      "type": "procedural",
      "date": "1945-03-19",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Second Appeal No. 557/1945 to Bombay High Court (Chagla CJ & Gajendragadkar J.), judgment 23rd June 1949: dismissed appeal, allowed cross-objections on trees/costs. Leave to SC granted for 86/2.",
      "type": "procedural",
      "date": "1949-06-23",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether notice as contemplated by section 111(g) of the Transfer of Property Act is necessary for the determination of a lease for non-payment of rent even where such lease was executed before the coming into force of the Transfer of Property Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the High Court should have interfered with the discretion of the lower courts in refusing relief against forfeiture in the circumstances of this case.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Notice in writing under amended s.111(g) TPA necessary even for pre-TPA lease as amendment embodies principle of justice, equity and good conscience; institution of suit not sufficient act.",
      "supporting_facts": [
        "f1",
        "f2",
        "f9"
      ],
      "legal_basis": "Section 111(g) TPA (as amended 1929); principles of justice, equity and good conscience; Umar Pulavar v. Dawood Rowther; Krishna Shetti v. Gilbert Pinto; Brahmayya v. Sundaramma; Tatya Savla Sudrik v. Yeshwanta Kondiba Mulay"
    },
    {
      "id": "pa2",
      "text": "Relief against forfeiture should be granted as discretion must be exercised in favour of tenant if no third party injury and rent tendered; chronic default not bar.",
      "supporting_facts": [
        "f4",
        "f5",
        "f7",
        "f8",
        "f10"
      ],
      "legal_basis": "Section 114 TPA; Debendralal Khan v. F. M. A. Cohen"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No notice required for pre-TPA lease; amendment 1929 not retrospective (s.63 Act XX 1929, s.2 TPA); filing suit is sufficient unequivocal act indicating intention to determine lease.",
      "supporting_facts": [
        "f1",
        "f2",
        "f11",
        "f12"
      ],
      "legal_basis": "Section 111(g) TPA (unamended); s.2, s.63 Act XX 1929 TPA; English law (Foa's Landlord and Tenant); Indian cases like Rama Aiyangar v. Guruswami Chetty, Venkatachari v. Rangaswami Aiyar"
    },
    {
      "id": "ra2",
      "text": "No relief against forfeiture due to habitual default, false defences, contumacious conduct over 25 years; discretion properly exercised by lower courts.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Section 114 TPA; Hyman v. Rose; Appaya Shetty v. Mohammad Beari"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Lease executed 1863 pre-TPA 1882; amendment to s.111(g) by Act XX 1929 (notice in writing) not retrospective per s.63, excluded by s.2 TPA. Not principle of justice/equity/good conscience as formality (writing) is statutory, not equitable; equity concerns substance not form. Pre-1929, overt act sufficient; filing suit is unequivocal act (English/Indian law).",
      "addresses_issue": "i1",
      "key_observation": "Provision as to notice in writing is merely statutory and technical, not based on equity; institution of suit manifests election to forfeit."
    },
    {
      "id": "cr2",
      "text": "Relief u/s 114 discretionary, considering conduct of parties; habitual defaulter over 25 years, false defences, warned previously; no equity for such tenant. Discretion of lower courts not to interfere.",
      "addresses_issue": "i2",
      "key_observation": "Tenant must come with clean hands; no rigid rule to always grant relief if rent paid."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No notice under s.111(g) TPA required to determine pre-TPA lease for non-payment of rent; filing suit sufficient to indicate intention.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Refusal of relief against forfeiture upheld; discretion properly exercised against habitual defaulter.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Umar Pulavar v. Dawood Rowther",
      "citation": "A.I.R. 1947 Mad. 68",
      "treatment": "doubted",
      "relevance": "Held amended s.111(g) embodies equity principle applicable even to old leases; SC disagrees."
    },
    {
      "case_name": "Krishna Shetti v. Gilbert Pinto",
      "citation": "I.L.R. 42 Mad. 654",
      "treatment": "distinguished",
      "relevance": "TPA provisions as rules of equity; SC limits to those embodying general principles."
    },
    {
      "case_name": "Rama Aiyangar v. Guruswami Chetty",
      "citation": "35 M.L.J. 129",
      "treatment": "followed",
      "relevance": "For pre-TPA lease, suit institution sufficient determination, no prior notice."
    },
    {
      "case_name": "Venkatachari v. Rangaswami Aiyar",
      "citation": "36 M.L.J. 532",
      "treatment": "followed",
      "relevance": "Similar to above."
    },
    {
      "case_name": "Prakashchandra Das v. Rajendranath Basu",
      "citation": "I.L.R. 58 Cal. 1359",
      "treatment": "followed",
      "relevance": "Institution of suit is election; dissented from Nourang Singh."
    },
    {
      "case_name": "Hyman v. Rose",
      "citation": "1912 A.C. 623",
      "treatment": "followed",
      "relevance": "Wide discretion u/s 114-like provision; consider all circumstances, no rigid rules."
    },
    {
      "case_name": "Appaya Shetty v. Mohammad Beari",
      "citation": "I.L.R. 39 Mad. 834",
      "treatment": "followed",
      "relevance": "Discretion in relief against forfeiture considers conduct, delay."
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [
        "111(g)",
        "111(b)",
        "114",
        "2"
      ],
      "relevance": "s.111(g): Forfeiture by non-payment requires notice post-1930, but not for pre-TPA leases; suit filing sufficient. s.114: Discretionary relief against forfeiture for rent. s.2: Excludes pre-Act leases."
    },
    {
      "name": "Transfer of Property (Amendment) Act, 1929 (Act XX of 1929)",
      "sections": [
        "63"
      ],
      "relevance": "Amendment to s.111(g) (written notice) applies only post 1st April 1930."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal confined to survey No. 86/2, confirming High Court decree granting possession to respondents (plaintiffs) on forfeiture for non-payment of rent. No notice required under s.111(g) TPA for pre-Act lease; refusal of relief against forfeiture upheld due to tenant's conduct.",
    "relief_granted": "Possession of survey No. 86/2 to respondents; defendants allowed remove structures/trees (per lower courts).",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is axiomatic that the courts must apply the principles of justice, equity and good conscience to transactions which come up before them for determination even though the statutory provisions of the Transfer of Property Act are not made applicable to these transactions.\"",
      "speaker": "court",
      "significance": "Basis for considering if TPA amendment is equity principle."
    },
    {
      "text": "\"The insistence therein that the notice should be given in writing is intrinsic evidence of the fact that the formality is merely statutory and it cannot trace its origin to any rule of equity.\"",
      "speaker": "court",
      "significance": "Rejects notice as equity for old leases."
    },
    {
      "text": "\"No rule of equity, justice or good conscience can be invoked in the case of a tenant of this description. He cannot always be allowed to take advantage of his own wrong.\"",
      "speaker": "court",
      "significance": "Justifies refusal of relief to habitual defaulter."
    }
  ],
  "_case_id": "1953_19",
  "_label": 0,
  "_text_length": 38956,
  "_extracted_at": "2026-02-08T22:11:39.678766"
}