{
  "metadata": {
    "case_name": "Central National Bank Limited v. United Industrial Bank Ltd.",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "Mukherjea J."
    ],
    "case_number": "Civil Appeal No. 32 of 1953",
    "date_of_judgment": "1953-11-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The shares in question, 800 in number of Indian Iron and Steel Company Ltd. and Steel Corporation of Bengal Ltd., were the property of Radhika Mohan Bhuiya, defendant No. 2.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Sometime in February 1946, Bhuiya agreed to sell these shares to Dwijendra Nath Mukherjee for Rs. 38,562-8-0.",
      "type": "admitted",
      "date": "1946-02",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 14th February 1946, Bhuiya sent the shares along with relative transfer deeds to the defendant bank (United Industrial Bank) with instructions to deliver to Mukherjee against payment of Rs. 38,562-8-0.",
      "type": "material",
      "date": "1946-02-14",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 18th February 1946, defendant bank directed officer Nilkrishna Paul to go to Mukherjee's office and hand over shares after receiving pay order for Rs. 38,562-8-0.",
      "type": "material",
      "date": "1946-02-18",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Paul met Mukherjee at about 11 a.m., Mukherjee asked to see shares, Paul placed them on table for inspection, Mukherjee examined them, then took them and left saying he was going to get the pay order and would return, but did not.",
      "type": "disputed",
      "date": "1946-02-18",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Mukherjee went straight to plaintiff bank (Central National Bank), pledged shares, opened account with Rs. 100 cheque, got overdraft of Rs. 29,000, executed promissory note.",
      "type": "material",
      "date": "1946-02-18",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Mukherjee has not been heard of since.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Paul waited, then informed superiors, police complaint lodged by defendant bank.",
      "type": "material",
      "date": "1946-02-18",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Mukherjee's Rs. 100 cheque to plaintiff dishonored.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Plaintiff demanded payment from Mukherjee, no reply, sold shares through broker Jalan for Rs. 16,000 part payment, but cheque stopped, police took possession of shares.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Criminal case against Shaw (accomplice) unsuccessful, acquitted.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Defendant bank paid full price to Bhuiya, applied to Magistrate for return of shares as owner.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Plaintiff instituted suit No. 1112 of 1946 in Calcutta High Court Original Side for declaration of pledgee rights, possession, damages.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Trial Judge (Mr. Justice Sarkar) decreed in favor of plaintiff on 21st March 1950.",
      "type": "procedural",
      "date": "1950-03-21",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appellate bench (Harries C.J. and Banerjee J.) reversed on 12th March 1951.",
      "type": "procedural",
      "date": "1951-03-12",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Bhuiya had no further interest after payment by defendant bank.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Mukherjee had no legal title, only agreement for sale, property not passed till payment.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Paul instructed not to deliver unless payment received, to examine pay order.",
      "type": "material",
      "date": "1946-02-18",
      "source": "respondent"
    },
    {
      "id": "f19",
      "text": "Paul protested when Mukherjee took shares without pay order.",
      "type": "disputed",
      "date": "1946-02-18",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the plaintiff bank acquired rights of a pledgee under section 30(2) of the Indian Sale of Goods Act, specifically whether Mukherjee obtained possession of the shares with the consent of the seller (or agent) and whether plaintiff received in good faith without notice.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether consent under section 30(2) requires free consent uninfluenced by fraud, or whether fraud-induced consent suffices unless void for identity error.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether criminality (e.g., larceny by trick) negatives consent for section 30(2) purposes.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Mukherjee obtained possession with consent of seller's agent (Paul), consent means agreeing to same thing in same sense per S.13 Contract Act; fraud irrelevant if consent in fact exists; physical custody suffices; plaintiff bona fide pledgee without notice.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6",
        "f17"
      ],
      "legal_basis": "Section 30(2) Indian Sale of Goods Act; Section 13 Indian Contract Act"
    },
    {
      "id": "pa2",
      "text": "Paul consented to Mukherjee taking shares relying on promise to return with pay order.",
      "supporting_facts": [
        "f5",
        "f19"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Mukherjee not in possession with consent of seller; plaintiff not bona fide without notice of defect.",
      "supporting_facts": [
        "f5",
        "f18",
        "f19"
      ],
      "legal_basis": "Section 30(2) Indian Sale of Goods Act"
    },
    {
      "id": "ra2",
      "text": "No intention to give delivery; Mukherjee took shares and bolted, akin to theft.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Consent under S.30(2) means agreeing to same thing in same sense per S.13 Contract Act (via S.2(15) Sale of Goods Act); free consent per S.14 not required; fraud makes voidable, not void, unless error as to identity/person; protects innocent transferee while possession not defeated.",
      "addresses_issue": "i2",
      "key_observation": "Fraud-induced consent suffices unless void."
    },
    {
      "id": "cr2",
      "text": "Criminality (larceny by trick) does not negative owner's consent; consent determined by contract law, not criminal technicalities; dishonest intent of receiver immaterial to owner's state of mind.",
      "addresses_issue": "i3",
      "key_observation": "No importation of English criminal fictions into commercial statute."
    },
    {
      "id": "cr3",
      "text": "On facts, Paul placed shares for inspection only, not parted possession/control; when Mukherjee took and left despite protest, no consent to possession; Paul did not rely on promise, waited briefly out of shock.",
      "addresses_issue": "i1",
      "key_observation": "Mukherjee got possession without consent of Paul."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Plaintiff not entitled to protection of S.30(2) as Mukherjee did not obtain possession with consent of seller/agent.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Consent under S.30(2) is real consent per contract law; fraud does not negative unless void ab initio (e.g., identity); criminal doctrines irrelevant.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Larceny by trick or fraud does not exclude S.30(2) operation if consent in fact given.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Cahn v. Pocketts Bristol Channel Steam Packet Company",
      "citation": "1899 1 Q.B. 643",
      "treatment": "followed",
      "relevance": "Fraudulent possession holder can give good title unless larceny by trick."
    },
    {
      "case_name": "Pearson v. Rose",
      "citation": "1950 2 All E.R. 1027",
      "treatment": "followed",
      "relevance": "Fraud makes voidable; consent enables Factors Act/S.30(2) till avoided."
    },
    {
      "case_name": "Lake v. Simmons",
      "citation": "1927 A.C. 487",
      "treatment": "distinguished",
      "relevance": "No consensus ad idem if fraud as to identity; void, not mere fraud."
    },
    {
      "case_name": "Folkes v. King",
      "citation": "1923 1 K.B. 282",
      "treatment": "followed",
      "relevance": "Consent in fact given despite larceny by trick; criminal intent immaterial."
    },
    {
      "case_name": "Oppenheimer v. Frazer",
      "citation": "1907 2 K.B. 50",
      "treatment": "referred",
      "relevance": "Accepted exception for larceny by trick but broader view preferred."
    },
    {
      "case_name": "Whitehorn v. Davison",
      "citation": "1911 1 K.B. 463",
      "treatment": "referred",
      "relevance": "Larceny by trick types distinguished."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Sale of Goods Act",
      "sections": [
        "30(2)",
        "2(15)"
      ],
      "relevance": "Protection for good faith transferee from buyer in possession with seller's consent; terms borrow from Contract Act."
    },
    {
      "name": "Indian Contract Act",
      "sections": [
        "13",
        "14"
      ],
      "relevance": "Defines consent and free consent; applies via S.2(15) Sale of Goods Act."
    },
    {
      "name": "English Sale of Goods Act",
      "sections": [
        "25(2)"
      ],
      "relevance": "Analogous provision discussed."
    },
    {
      "name": "Factors Act (English)",
      "sections": [
        "2(1)"
      ],
      "relevance": "Analogous to S.30(2); English cases apply principles."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld the appellate High Court's reversal of trial court's decree, holding that Mukherjee did not obtain possession of shares with consent of defendant bank's agent under S.30(2) Sale of Goods Act, denying plaintiff pledgee rights.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"However fraudulent a person in actual custody may have been, in obtaining the possession, provided it does not amount to larceny by trick... he can, by his disposition, give a good title to the purchaser.\"",
      "speaker": "court",
      "significance": "Core principle protecting innocent transferees from fraud-induced possession."
    },
    {
      "text": "\"The effect of fraud is as a rule only to make the transaction voidable and not void, and if, therefore, an innocent purchaser has bought the goods before the transaction is avoided the true owner cannot claim them back.\"",
      "speaker": "court",
      "significance": "Explains why S.30(2) operates despite fraud."
    },
    {
      "text": "\"It is quite clear that when Paul placed the share certificates upon the table and allowed Mukherjee to scrutinise them, he did not part with the possession of or control over the shares... Mukherjee got possession without the consent of Paul.\"",
      "speaker": "court",
      "significance": "Decisive factual finding against plaintiff."
    }
  ],
  "_case_id": "1953_62",
  "_label": 0,
  "_text_length": 30512,
  "_extracted_at": "2026-02-08T22:11:35.858387"
}