{
  "metadata": {
    "case_name": "Archakas v. Konduru Venkatapayya (Executive Officer, Sri Somasekharaswami Temple)",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "DAS J."
    ],
    "case_number": "Civil Appeal No. 121 of 1951",
    "date_of_judgment": "1953-02-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Immovable properties measuring about 93 acres and 33 cents described in Schedule A to the plaint.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Suit instituted by Konduru Venkatapayya, respondent No. 1, as Executive Officer appointed by Government on 15th July 1942 for Sri Somasekharaswami Temple at Kotipalle, hamlet of Donepudi, notified on 26th October 1939 under Chapter VIA of Madras Hindu Religious Endowments Act 1927. Suit in forma pauperis.",
      "type": "procedural",
      "date": "1942-07-15",
      "source": "plaintiff"
    },
    {
      "id": "f3",
      "text": "Properties belonged to temple by Inam grant made in 1770 A.D. by Janganna Rao, Zamindar of Rachur.",
      "type": "background",
      "date": "1770",
      "source": "plaintiff"
    },
    {
      "id": "f4",
      "text": "Defendants 1 to 16 and predecessors were Archakas rendering Nitya Naivedya Deeparadhana services, in possession for and on behalf of the temple.",
      "type": "admitted",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f5",
      "text": "Defendants 17 to 43 were lessees under the Archakas.",
      "type": "material",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f6",
      "text": "Defendants 1 to 16 wrongfully claiming properties as their own; others as lessees.",
      "type": "disputed",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f7",
      "text": "Plaintiff gave registered notice to defendants to deliver possession; defendants continued in possession.",
      "type": "procedural",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f8",
      "text": "Subordinate Judge of Tenali decreed plaintiff's suit on 31st July 1945 in O.S. No. 24 of 1944.",
      "type": "procedural",
      "date": "1945-07-31",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Some defendants appealed to High Court of Madras (Appeal No. 474 of 1945); dismissed on 15th December 1948 by Subba Rao and Pakesa Ayyar JJ.",
      "type": "procedural",
      "date": "1948-12-15",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court granted leave to appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Exhibit P/3: Copy of Inam Register of 1860, prepared after enquiries by Inam Deputy Collector; classified as Devadayam; for support of Pagoda; sarvadumbala; permanent; grantor Janganna Rao, fasli 1179 (1770 AD); grantee Sri Somasekharaswami Temple; assessment Rs. 198-13-9.",
      "type": "material",
      "date": "1860",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Exhibit D/3: Statement by then Archakas in 1859-60 Inam Inquiry; Inamdar and present enjoyer: Sree Somasekharaswami Varu; sarvadumbala; cist Rs. 266-3-1; signed by Karnams and witnesses. No mention of Archakas as grantees.",
      "type": "material",
      "date": "1859-1860",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Defendants and predecessors in possession from ancient times.",
      "type": "admitted",
      "date": null,
      "source": "appellants"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Inam grant was made in favour of the temple or in favour of the Archakas burdened with duties of service.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "What right the grant conferred - grant of the land itself or only of the melvaram interest.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Defendants and predecessors in possession from ancient times; presume lawful title via lost grant principle in favour of Archakas.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Judicial decisions on presumption of lost grant for long quiet possession"
    },
    {
      "id": "pa2",
      "text": "Grant was only of melvaram interest; Archakas have kudivaram rights and cannot be ejected.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "Unreported Madras HC Appeal No. 213 of 1942 (melvaram only where assessment equals income)"
    },
    {
      "id": "pa3",
      "text": "In equity, Archakas rendering faithful services from ancient times should not be ejected entirely; allow possession for service expenses, reasonable remuneration, rest to temple.",
      "supporting_facts": [
        "f4",
        "f13"
      ],
      "legal_basis": "Unreported Madras HC Appeals No. 218/1946 (AIR 1948 Mad 72), No. 709/1944"
    },
    {
      "id": "pa4",
      "text": "Grantor Janganna Rao was only revenue Collector, could not grant more than melvaram.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Kistna District Manual"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Properties belong to temple by 1770 Inam grant; Archakas in possession on behalf of temple; defendants wrongfully claiming absolute title.",
      "supporting_facts": [
        "f3",
        "f4",
        "f11",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Presumption of lost grant not applicable where convincing proof of grant nature exists; Exhibits P/3 and D/3 show grant to temple (Devadayam, for Pagoda support, grantee temple named, no mention of Archakas).",
      "addresses_issue": "i1",
      "key_observation": "Definite evidence of grant to deity; first question against appellants."
    },
    {
      "id": "cr2",
      "text": "Inam Register (P/3) assessment Rs. 198-13-9; Statement (D/3) income Rs. 266-3-1; differ, unlike cited case; no evidence Archakas had prior kudivaram; form of entries same for full grant or melvaram.",
      "addresses_issue": "i2",
      "key_observation": "Cited unreported decision (Appeal 213/1942) of doubtful authority, dissented in Yelamanchili Venkatadri; grant comprises both interests."
    },
    {
      "id": "cr3",
      "text": "Equity claims out of place in ejectment suit on title proof; Archakas asserted adverse title despite predecessors' admissions.",
      "addresses_issue": "i2",
      "key_observation": "Conduct disentitling; cited scheme decisions inapplicable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Inam grant made to temple as grantee.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Grant comprised both melvaram and kudivaram interests in the land.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Board of Commissioners for Hindu Religious Endowments, Madras v. Parasaram Veeraraghavacharyulu",
      "citation": "Unreported, Madras HC Appeal No. 213 of 1942",
      "treatment": "distinguished",
      "relevance": "Held melvaram only based on equal assessment/income; facts differ, reasoning unsupported."
    },
    {
      "case_name": "Yelamanchili Venkatadri v. Vedantam Seshacharyulu",
      "citation": null,
      "treatment": "followed",
      "relevance": "Dissented from prior unreported decision; preferred by HC."
    },
    {
      "case_name": "Dandibhotla Kutumba Sastrulu v. Kontharapu Venkatalingam",
      "citation": "AIR 1948 Mad 72",
      "treatment": "doubted",
      "relevance": "Equity for Archakas in scheme framing; inapplicable to ejectment suit."
    },
    {
      "case_name": "Buddu Satyanarayana v. Dasari Butchayya, Executive Officer",
      "citation": "Unreported, Madras HC Appeal No. 709 of 1944",
      "treatment": "doubted",
      "relevance": "Equity for Archakas in scheme; inapplicable to ejectment suit."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Hindu Religious Endowments Act 1927",
      "sections": [
        "Chapter VIA"
      ],
      "relevance": "Temple notified thereunder; basis for Executive Officer appointment."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, affirming High Court and trial court decrees for plaintiff; Inam grant to temple of full proprietary rights; defendants to deliver possession to Executive Officer.",
    "relief_granted": "Possession of suit properties to Executive Officer of temple.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the Inam grant was made in favour of the temple by the grantor and that in the face of this definite evidence and proof of the nature of the grant, no presumption of a lost grant can be made in favour of the Archakas.\"",
      "speaker": "court",
      "significance": "Rejects lost grant presumption based on documentary proof."
    },
    {
      "text": "\"this Inam grant in favour of the temple comprised both the interests in the land.\"",
      "speaker": "court",
      "significance": "Determines full proprietary rights vested in temple."
    },
    {
      "text": "\"Such conduct cannot but be regarded as disentitling them from any claim founded on equity.\"",
      "speaker": "court",
      "significance": "Rejects equitable relief for Archakas due to adverse claim."
    }
  ],
  "_case_id": "1953_23",
  "_label": 0,
  "_text_length": 14081,
  "_extracted_at": "2026-02-10T19:13:51.447515"
}