{
  "metadata": {
    "case_name": "Surendra Singh & Ors. v. State",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "BOSE J."
    ],
    "case_number": "Criminal Appeal No. 34 of 1953",
    "date_of_judgment": "1953-11-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Three appellants prosecuted for the murder of Babu Singh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Surendra Singh convicted of murder and sentenced to death.",
      "type": "material",
      "date": "1952-01-19",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Other two appellants convicted under section 225 Indian Penal Code and sentenced to three years rigorous imprisonment and fine of Rs. 200.",
      "type": "material",
      "date": "1952-01-19",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "All three appealed to High Court at Allahabad Lucknow Bench in Criminal Appeal Register No. 24 of 1952 and Capital Sentence Register No. 4 of 1952.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appeal heard on 5th December 1952 by Kidwai and Bhargava JJ. Judgment reserved.",
      "type": "procedural",
      "date": "1952-12-05",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Bhargava J. transferred to Allahabad. Dictated judgment purporting to be joint judgment on behalf of himself and Kidwai J., used pronoun 'we', signed every page and at end but did not date it. Sent to Kidwai J. at Lucknow.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Bhargava J. died on 24th December 1952.",
      "type": "procedural",
      "date": "1952-12-24",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On 5th January 1953, Kidwai J. purported to deliver the judgment of the court, signed it and dated it 5th January 1953. Bhargava J.'s signature remained.",
      "type": "procedural",
      "date": "1953-01-05",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "High Court dismissed the appeal and confirmed the death sentence.",
      "type": "procedural",
      "date": "1953-01-05",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Allahabad High Court Rules 1952 came into force on 15th September 1952, Chapter VII rules 1-4 deal with judgments.",
      "type": "background",
      "date": "1952-09-15",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court judgment could be validly delivered after the death of one of the two Judges who heard the appeal.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Arguments covered a wide range but court confines to narrower issues arising from facts regarding validity of judgment delivery after death of Bhargava J.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Counsel argued that judgment had to be both pronounced and delivered as two different things under High Court rules.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Allahabad High Court Rules Chapter VII"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Arguments covered a wide range but court confines to narrower issues arising from facts.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Delivery of judgment is a solemn act with serious consequences; must be performed in a judicial way in open court as formal intimation of decision.",
      "addresses_issue": "i1",
      "key_observation": "Judgment is final decision intimated by formal pronouncement or delivery in open court."
    },
    {
      "id": "cr2",
      "text": "Draft judgments signed beforehand are not operative until formally delivered in open court; judges have locus poenitentiae until delivery.",
      "addresses_issue": "i1",
      "key_observation": "Judge delivering must be in existence at moment of delivery to potentially change mind."
    },
    {
      "id": "cr3",
      "text": "High Court rules use 'pronounced' and 'delivered'; not to be construed too technically; inherent jurisdiction to cure defects but substance must be there.",
      "addresses_issue": "i1",
      "key_observation": "Rules further ends of justice; defects in authentication curable but not core judicial act."
    },
    {
      "id": "cr4",
      "text": "Section 369 CrPC emphasizes judgment after signing cannot be altered except clerical errors; delivery crystallizes it.",
      "addresses_issue": "i1",
      "key_observation": "Public policy against inquiring into whether signed draft was final or tentative."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Judgment within meaning of sections is final decision of court intimated to parties and world by formal pronouncement or delivery in open court.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Judgment purportedly delivered by Kidwai J. on 5th January 1953 was not valid because Bhargava J. died before delivery.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Firm Gokal Chand v. Firm Nand Ram",
      "citation": "A.I.R. 1938 P.C. 292",
      "treatment": "followed",
      "relevance": "Court has inherent jurisdiction to supply defects like death before signing; rules not to nullify judgment; irregularity curable."
    },
    {
      "case_name": "Mahomed Akil v. Asadunnissa Bibee",
      "citation": "9 W.R.I. F.B.",
      "treatment": "followed",
      "relevance": "Signed drafts handed in before delivery not judgments; must be pronounced in open court; even if minds made up, cannot deliver after death/retirement."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "225"
      ],
      "relevance": "Convictions of two appellants under this section."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "366",
        "424",
        "537",
        "369"
      ],
      "relevance": "Deal with judgments in subordinate courts; s.537 cures irregularities like CPC ss.99,108; s.369 prohibits alteration after signing."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "225"
      ],
      "relevance": "High Courts power to make rules continued."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "99",
        "108"
      ],
      "relevance": "Analogy for curing irregularities in criminal context via s.537 CrPC."
    },
    {
      "name": "Allahabad High Court Rules",
      "sections": [
        "Chapter VII rules 1-4"
      ],
      "relevance": "Provide for pronouncement/delivery of judgments in different situations."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, High Court order set aside as invalid due to delivery after death of one judge; case remanded to High Court for re-hearing and delivery of proper judgment.",
    "relief_granted": "Appeal allowed; High Court judgment set aside; remanded for re-hearing.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Delivery of judgment is a solemn act which carries with it serious consequences for the person or persons involved.",
      "speaker": "court",
      "significance": "Emphasizes gravity and need for certainty in judgment delivery."
    },
    {
      "text": "A judgment within the meaning of these sections is the final decision of the court intimated to the parties and to the world at large by formal pronouncement or delivery in open court.",
      "speaker": "court",
      "significance": "Defines core essence of what constitutes a valid judgment."
    },
    {
      "text": "The Judge who delivers the judgment... must be in existence as a member of the court at the moment of delivery so that he can, if necessary, stop delivery and say that he has changed his mind.",
      "speaker": "court",
      "significance": "Key reason why delivery after death is invalid; preserves locus poenitentiae."
    },
    {
      "text": "Our conclusion is that the judgment which Kidwai J. purported to deliver on 5th January, 1953, was not a valid judgment because the other member of the Bench died before it could be delivered.",
      "speaker": "court",
      "significance": "Direct holding on the case."
    }
  ],
  "_case_id": "1953_88",
  "_label": 1,
  "_text_length": 17895,
  "_extracted_at": "2026-02-10T19:14:34.745748"
}