{
  "metadata": {
    "case_name": "Gurusidhwaswami v. Dakshina Maharashtra Digambar Jain Sabha",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "Mukherjea J."
    ],
    "case_number": "Civil Appeal No. 187 of 1952",
    "date_of_judgment": "1953-10-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On November 13, 1887, Gurusidhwaswami, then head of Murusavirmath, granted a permanent lease of a tract of land (R. No. 34) to Pradhanappa at rent of Rs. 50 per annum for first six years, thereafter Rs. 25 annually.",
      "type": "material",
      "date": "1887-11-13",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On June 19, 1892, Pradhanappa sold a portion of the leasehold property (Schedule 1b to the plaint) to Bharamappa.",
      "type": "material",
      "date": "1892-06-19",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1897 Gurusidhwaswami died and was succeeded by Gangadhar Swami who did not repudiate the permanent lease and accepted rents from the lessee.",
      "type": "background",
      "date": "1897",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In April 1905, another part of the land (Schedule 1a to the plaint) was sold in execution of a decree against Pradhanappa's heirs to Kadayya, who sold it to Bharamappa.",
      "type": "material",
      "date": "1905-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On April 8, 1910, Bharamappa made a gift of the entire premises (Schedules 1a and 1b) to Dakshina Maharashtra Digambar Jain Sabha for building a school for Jain students.",
      "type": "material",
      "date": "1910-04-08",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On August 31, 1920, Gangadhar Swami died; affairs of Math managed by committee for some time.",
      "type": "material",
      "date": "1920-08-31",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On November 25, 1925, present plaintiff Gurusidhwaswami became head of the Math.",
      "type": "background",
      "date": "1925-11-25",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On August 27, 1932, plaintiff instituted Suit No. 80 of 1932 against heirs and successors of Bharamappa for possession of the land, alleging no legal necessity for lease, void on death of last Mahant. Jain Sabha impleaded as defendant No. 23 under wrong name.",
      "type": "procedural",
      "date": "1932-08-27",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Suit No. 80/1932 dismissed by trial judge; on appeal, Bombay High Court reversed on November 26, 1942, allowed khas possession against all defendants except defendant No. 23 (Jain Sabha) dismissed for misdescription.",
      "type": "procedural",
      "date": "1942-11-26",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On December 3, 1943, plaintiff commenced present suit (Special Civil Suit No. 21 of 1944) against Jain Sabha for khas possession, alleging original lease not binding on Math, defendant could not acquire title from lessee.",
      "type": "procedural",
      "date": "1943-12-03",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Trial court (Civil Judge, Hubli) on December 17, 1945: held lease not supported by legal necessity (favour plaintiff) but suit barred by limitation under Article 134-B Limitation Act; suit dismissed.",
      "type": "procedural",
      "date": "1945-12-17",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Bombay High Court (Bavdekar and Dixit JJ.) on October 19, 1949: affirmed trial court, dismissed appeal.",
      "type": "procedural",
      "date": "1949-10-19",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the original permanent lease was supported by legal necessity.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the plaintiff's suit was barred by limitation under Article 134-B of the Indian Limitation Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Decree for ejectment in 1932 suit against heirs of Bharamappa binds present defendant on principle that decree against lessee binds sub-lessee.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Principle that sub-lessee bound by eviction decree against lessee"
    },
    {
      "id": "pa2",
      "text": "Limitation saved by Section 10 of Indian Limitation Act.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Section 10, Indian Limitation Act"
    },
    {
      "id": "pa3",
      "text": "Lease not for valuable consideration as rent inadequate (Rs.50 first 6 years, then Rs.25).",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Section 10 exception does not apply"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Suit barred by limitation under Article 134-B Limitation Act, 12 years from death of previous Mahant in 1920.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": "Article 134-B, Indian Limitation Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Even if first contention correct, suit barred under Section 47 CPC; proper remedy execution of previous decree, but contention fails as 1932 suit not by landlord against tenant but by Math manager to recover improperly alienated property; defendants in 1932 were trespassers post previous Mahant's death.",
      "addresses_issue": "i2",
      "key_observation": "1932 suit not eviction by lessor against lessee"
    },
    {
      "id": "cr2",
      "text": "Jain Sabha not sub-lessee; document is deed of gift, not sub-lease, despite reverter condition for specific purpose.",
      "addresses_issue": "i2",
      "key_observation": "Gift deed for school construction, not sub-lease"
    },
    {
      "id": "cr3",
      "text": "Section 10 Limitation Act inapplicable: defendant not assign without valuable consideration; lease was for valuable consideration (rent, though low); 'valuable consideration' not synonymous with 'adequate'.",
      "addresses_issue": "i2",
      "key_observation": "Lease for valuable consideration, falls within Section 10 exception"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Suit governed by Article 134-B Limitation Act; 12 years from previous Mahant's death in 1920; present suit time-barred.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Original permanent lease not binding on Math for lack of legal necessity (as held below).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sailendra v. Bijan",
      "citation": "49 C.W.N. 133",
      "treatment": "referred",
      "relevance": "Sub-lessee bound by decree for possession against lessee if eviction determines sub-lease"
    },
    {
      "case_name": "Yusuff v. Jyotish Chandra",
      "citation": "L.R. 59 Cal. 739",
      "treatment": "referred",
      "relevance": "Sub-lessee bound by decree for possession against lessee if eviction determines sub-lease"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Limitation Act",
      "sections": [
        "Article 134-B",
        "Section 10"
      ],
      "relevance": "Governs limitation period for suit to recover Math property alienated without necessity; Section 10 benefit unavailable due to valuable consideration in lease"
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 47"
      ],
      "relevance": "Suit could be treated as execution if no limitation bar; bars suit if previous decree available"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, affirming High Court and trial court that the suit is barred by limitation under Article 134-B of Limitation Act, despite finding no legal necessity for original lease.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It may be assumed as a proposition of law that a sub-lessee would be bound by a decree for possession obtained by the lessor against the lessee, no matter whether the sub-lease was created before or after the suit, provided the eviction is based on a ground which determines the sublease also.",
      "speaker": "court",
      "significance": "States general principle but distinguishes facts"
    },
    {
      "text": "The expression valuable consideration has a well known connotation in law and it is not synonymous with adequate consideration.",
      "speaker": "court",
      "significance": "Key to rejecting Section 10 argument"
    }
  ],
  "_case_id": "1953_116",
  "_label": 0,
  "_text_length": 11843,
  "_extracted_at": "2026-02-10T19:14:58.751088"
}