{
  "metadata": {
    "case_name": "Archakas (Defendants 1-16) v. Konduru Venkatapayya (Executive Officer, Sri Somasekharaswami Temple)",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "DAS J."
    ],
    "case_number": "Civil Appeal No. 121 of 1951",
    "date_of_judgment": "1953-02-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Certain immovable properties measuring about 93 acres and 33 cents described in Schedule A to the plaint.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Suit instituted by Konduru Venkatapayya, respondent No. 1, in his capacity as Executive Officer appointed by Government on 15th July 1942, for Sri Somasekharaswami Temple at Kotipalle, hamlet of Donepudi, notified on 26th October 1939 under Chapter VIA of Madras Hindu Religious Endowments Act 1927.",
      "type": "procedural",
      "date": "1942-07-15",
      "source": "plaintiff"
    },
    {
      "id": "f3",
      "text": "Suit instituted in forma pauperis for recovery of possession.",
      "type": "procedural",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f4",
      "text": "Properties belonged to temple by Inam grant made in 1770 A.D. by Janganna Rao, Zamindar of Rachur.",
      "type": "material",
      "date": "1770",
      "source": "plaintiff"
    },
    {
      "id": "f5",
      "text": "Defendants 1 to 16 and predecessors were Archakas rendering Nitya Naivedya Deeparadhana services, in possession for and on behalf of the temple.",
      "type": "background",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f6",
      "text": "Defendants 17 to 43 were lessees under the Archakas.",
      "type": "material",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f7",
      "text": "Defendants 1 to 16 wrongfully claiming properties as their own; others as lessees.",
      "type": "disputed",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f8",
      "text": "Registered notice given to defendants to deliver possession to plaintiff as Executive Officer, but defendants continuing in possession.",
      "type": "procedural",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f9",
      "text": "Learned Subordinate Judge decreed plaintiff's suit on 31st July 1945.",
      "type": "procedural",
      "date": "1945-07-31",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Some defendants appealed to High Court of Madras (Appeal No. 474 of 1945), dismissed.",
      "type": "procedural",
      "date": "1948-12-15",
      "source": "high_court"
    },
    {
      "id": "f11",
      "text": "High Court granted leave to appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f12",
      "text": "Exhibit P/3: Copy of relevant entries in Inam Register of 1860, prepared after enquiries by Inam Deputy Collector; classified as Devadayam; for support of Pagoda; sarvadumbala; Permanent; grantor Janganna Rao, fasli 1179 (1770 AD); temple as original grantee.",
      "type": "material",
      "date": "1860",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Exhibit D/3: Copy of statement filed by then Archakas before Inam Deputy Collector in 1859-60; Sree Somasekharaswami Varu as Inamdar and present enjoyer; sarvadumbala Inam; Cist Rs. 266/31.",
      "type": "material",
      "date": "1859-1860",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Defendants and predecessors in possession from ancient times.",
      "type": "admitted",
      "date": null,
      "source": "appellants"
    },
    {
      "id": "f15",
      "text": "In Inam Register Ex. P/3, under column 7 assessment Rs. 198/1/39.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Inam grant was made in favour of the temple or whether the grant was made in favour of the Archakas burdened with the duties of service.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "What right did the grant confer on the grantee - whether it was a grant of the land itself or only of the melvaram interest in the properties.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Defendants and predecessors in possession from ancient times; presume lost grant in favour of Archakas under principle of lost grant.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "judicial decisions on presumption of lawful title for long quiet possession"
    },
    {
      "id": "pa2",
      "text": "Assuming grant to temple, it was only melvaram interest; Archakas have kudivaram rights and cannot be ejected.",
      "supporting_facts": [
        "f12",
        "f13",
        "f15"
      ],
      "legal_basis": "Unreported Madras HC Appeal No. 213 of 1942 (melvaram only where assessment equals income)"
    },
    {
      "id": "pa3",
      "text": "In equity, Archakas rendering faithful services from ancient times should not be ejected entirely; allow possession for expenses, remuneration, rest to temple.",
      "supporting_facts": [
        "f5",
        "f14"
      ],
      "legal_basis": "Unreported Madras HC Appeals Nos. 218 of 1946 and 709 of 1944"
    },
    {
      "id": "pa4",
      "text": "Grantor Janganna Rao was only Collector of revenue, could not grant more than melvaram.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Kistna District Manual by Gordon Mackenzie"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Inam grant made to temple; Archakas in possession on behalf of temple.",
      "supporting_facts": [
        "f4",
        "f5",
        "f12",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Grant comprised both melvaram and kudivaram rights.",
      "supporting_facts": [
        "f12",
        "f13",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Presumption of lost grant cannot apply where convincing proof of grant nature exists; Ex. P/3 and D/3 show grant to temple (Devadayam, for Pagoda, temple as grantee/enjoyer); no mention of Archakas as grantees.",
      "addresses_issue": "i1",
      "key_observation": "Definite evidence proves deity as grantee."
    },
    {
      "id": "cr2",
      "text": "Unreported Appeal 213/1942 distinguished: there Archakas grantees with prior kudivaram, assessment=income; here Archakas not mentioned, no prior kudivaram evidence, assessment Rs.198/1/39 vs income Rs.266/31; reasoning flawed as form same for full grant.",
      "addresses_issue": "i2",
      "key_observation": "Different entries show grant of both interests."
    },
    {
      "id": "cr3",
      "text": "Prefer Yelamanchili Venkatadri v. Vedantam Seshacharyulu over unreported decision.",
      "addresses_issue": "i2",
      "key_observation": "High Court right in holding full grant."
    },
    {
      "id": "cr4",
      "text": "Equity argument inapplicable in ejectment suit on title; Archakas' conduct in asserting adverse title despite predecessors' admissions disentitling.",
      "addresses_issue": "i2",
      "key_observation": "No equitable relief in title suit."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Inam grant made in favour of the temple/deity.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Grant comprised the land itself, i.e., both melvaram and kudivaram rights.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Board of Commissioners for the Hindu Religious Endowments, Madras v. Parasaram Veeraraghavacharyulu",
      "citation": "Unreported, Appeal No. 213 of 1942 (Madras High Court)",
      "treatment": "distinguished",
      "relevance": "Held melvaram only but facts different and reasoning flawed"
    },
    {
      "case_name": "Yelamanchili Venkatadri v. Vedantam Seshacharyulu",
      "citation": null,
      "treatment": "followed",
      "relevance": "Preferred over unreported decision; supports full grant interpretation"
    },
    {
      "case_name": "Dandibhotla Kutumba Sastrulu v. Kontharapu Venkatalingam",
      "citation": "Unreported, Appeal No. 218 of 1946 (Madras High Court); A.I.R. 1948 Mad. 72",
      "treatment": "doubted",
      "relevance": "Equity for Archakas in scheme framing, not applicable to ejectment"
    },
    {
      "case_name": "Buddu Satyanarayana v. Dasari Butchayya, Executive Officer",
      "citation": "Unreported, Appeal No. 709 of 1944 (Madras High Court)",
      "treatment": "doubted",
      "relevance": "Equity for Archakas in scheme framing, not applicable to ejectment"
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Hindu Religious Endowments Act, 1927",
      "sections": [
        "Chapter VIA"
      ],
      "relevance": "Temple notified thereunder; basis for Executive Officer's appointment and suit"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding the decree of the Subordinate Judge and High Court in favour of the plaintiff Executive Officer for recovery of possession of the suit properties belonging to the temple.",
    "relief_granted": "Possession of suit properties to Executive Officer of the temple",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the Inam grant was made in favour of the temple by the grantor and that in the face of this definite evidence and proof of the nature of the grant, no presumption of a lost grant can be made in favour of the Archakas.",
      "speaker": "court",
      "significance": "Rejects lost grant presumption based on documentary evidence"
    },
    {
      "text": "Having regard to the different entries under the different columns in Exhibit P/3 and Exhibit D/3 there is no escape from the position that this Inam grant in favour of the temple comprised both the interests in the land.",
      "speaker": "court",
      "significance": "Holds grant includes both melvaram and kudivaram"
    },
    {
      "text": "Such conduct cannot but be regarded as disentitling them from any claim founded on equity.",
      "speaker": "court",
      "significance": "Rejects equity relief due to Archakas' adverse claim"
    }
  ],
  "_case_id": "1953_23",
  "_label": 0,
  "_text_length": 14081,
  "_extracted_at": "2026-02-08T22:11:35.183110"
}