{
  "metadata": {
    "case_name": "Surendra Singh & Ors. v. State",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "BOSE J."
    ],
    "case_number": "Criminal Appeal No. 34 of 1953",
    "date_of_judgment": "1953-11-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Three appellants prosecuted for the murder of Babu Singh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Surendra Singh convicted of murder and sentenced to death.",
      "type": "procedural",
      "date": "1952-01-19",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Other two appellants convicted under section 225 Indian Penal Code, sentenced to three years rigorous imprisonment and fine of Rs. 200.",
      "type": "procedural",
      "date": "1952-01-19",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Sessions Judge, Sitapur, in Sessions Case No. 97 of 1951 delivered judgment on 19th January 1952.",
      "type": "procedural",
      "date": "1952-01-19",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "All three appealed to High Court at Allahabad Lucknow Bench in Criminal Appeal Register No. 24 of 1952 and Capital Sentence Register No. 4 of 1952.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appeal heard on 5th December 1952 by Kidwai and Bhargava JJ., judgment reserved.",
      "type": "procedural",
      "date": "1952-12-05",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Bhargava J. transferred to Allahabad, dictated judgment purporting to be joint judgment using 'we', signed every page but did not date it, sent to Kidwai J. at Lucknow.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Bhargava J. died on 24th December 1952.",
      "type": "procedural",
      "date": "1952-12-24",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On 5th January 1953, Kidwai J. purported to deliver the judgment, signed and dated it 5th January 1953.",
      "type": "procedural",
      "date": "1953-01-05",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "High Court dismissed the appeal and confirmed the death sentence.",
      "type": "procedural",
      "date": "1953-01-05",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court judgment could be validly delivered after the death of one of the two Judges who heard the appeal.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Delivery of judgment is a solemn act which carries serious consequences; it must be a final decision intimated by formal pronouncement or delivery in open court.",
      "addresses_issue": "i1",
      "key_observation": "Judgment is the formal declaration of the court's mind in open court at the time of delivery."
    },
    {
      "id": "cr2",
      "text": "Draft judgments, even if signed, are not operative until formally delivered in open court; judges retain locus poenitentiae until delivery.",
      "addresses_issue": "i1",
      "key_observation": "The judge who delivers or causes delivery must be in existence at the moment of delivery to potentially change mind."
    },
    {
      "id": "cr3",
      "text": "Rules on signing, dating etc. are for authentication and certainty, curable irregularities; essence is formal intimation in open court.",
      "addresses_issue": "i1",
      "key_observation": "Cannot assume a deceased judge's views remain unchanged; against public policy to investigate intent of drafts."
    },
    {
      "id": "cr4",
      "text": "Distinction between pre-delivery (non-judicial, alterable out of court) and post-delivery (final, alterable only via review).",
      "addresses_issue": "i1",
      "key_observation": "Undelivered judgment not operative; death prevents valid delivery."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A judgment within the meaning of section 369 CrPC is the final decision intimated by formal pronouncement or delivery in open court; draft signed by deceased judge cannot be delivered validly by surviving judge.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Firm Gokal Chand v. Firm Nand Ram",
      "citation": "A.I.R. 1938 P.C. 292",
      "treatment": "followed",
      "relevance": "Court has inherent jurisdiction to cure defects like death before signing; rules not to nullify judgment if irregularly authenticated."
    },
    {
      "case_name": "Mahomed Akil v. Asadunnissa Bibee",
      "citation": "9 W.R.I. F.B.",
      "treatment": "followed",
      "relevance": "Signed drafts handed in before delivery not judgments; must be pronounced in open court; cannot deliver after judge's death or retirement."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 225"
      ],
      "relevance": "Convictions of two appellants"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "Section 366",
        "Section 424",
        "Section 537",
        "Section 369"
      ],
      "relevance": "Deal with delivery of judgments in subordinate courts, curative irregularities, no alteration after signing except clerical errors."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 225"
      ],
      "relevance": "High Courts' power to make rules continued."
    },
    {
      "name": "Allahabad High Court Rules",
      "sections": [
        "Chapter VII, Rules 1-4"
      ],
      "relevance": "Provide for pronouncement and delivery of judgments in different situations."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 99",
        "Section 108"
      ],
      "relevance": "Analogous to CrPC s.537 on criminal side for curing irregularities."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, set aside the High Court order purporting to be its judgment as invalid due to death of Bhargava J. before delivery, and remanded the case to High Court for re-hearing and delivery of proper judgment.",
    "relief_granted": "Appeal allowed; High Court judgment set aside; remanded for re-hearing.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "In our opinion, a judgment within the meaning of these sections is the final decision of the court intimated to the parties and to the world at large by formal pronouncement or delivery in open court.",
      "speaker": "court",
      "significance": "Defines essence of judgment delivery."
    },
    {
      "text": "However much a draft judgment may have been signed beforehand, it is nothing but a draft till formally delivered as the judgment of the court.",
      "speaker": "court",
      "significance": "Emphasizes locus poenitentiae until delivery."
    },
    {
      "text": "The Judge who delivers the judgment... must be in existence as a member of the court at the moment of delivery so that he can, if necessary, stop delivery and say that he has changed his mind.",
      "speaker": "court",
      "significance": "Core reason judgment invalid post-death."
    }
  ],
  "_case_id": "1953_88",
  "_label": 1,
  "_text_length": 17895,
  "_extracted_at": "2026-02-08T22:11:27.118864"
}