{
  "metadata": {
    "case_name": "Punjab National Bank Ltd. v. Its Workmen",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "Patanjali Sastri C.J."
    ],
    "case_number": "Civil Appeal No. 181 of 1952",
    "date_of_judgment": "1953-04-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Several other disputes between the parties had already been referred on February 21, 1950, to another Industrial Tribunal presided over by Sri K. S. Campbell-Puri.",
      "type": "procedural",
      "date": "1950-02-21",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "During the pendency of the proceedings before the said Tribunal, the Bank alleged that the respondents along with other workmen numbering more than a thousand illegally commenced a general strike on April 18, 1951, in connection with a fresh dispute.",
      "type": "material",
      "date": "1951-04-18",
      "source": "bank"
    },
    {
      "id": "f3",
      "text": "Notice was issued to the strikers that unless they returned to work by April 24, 1951, they would be deemed to have left service of their own accord.",
      "type": "procedural",
      "date": "1951-04-24",
      "source": "bank"
    },
    {
      "id": "f4",
      "text": "That notice having been ignored by the strikers a second notice was issued to them on April 27, 1951, terminating their service.",
      "type": "procedural",
      "date": "1951-04-27",
      "source": "bank"
    },
    {
      "id": "f5",
      "text": "The Government of India intervened, and as a result of the discussions held between the Government officials and the Bank, the latter agreed to take back all the employees except 150 against whom the Bank had objections on account of their alleged subversive activities and other objectionable and unlawful conduct before and during the strike.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On July 2, 1951, the Government of India constituted a Tribunal to decide the questions regarding the dismissals etc. of the aforesaid 150 employees.",
      "type": "procedural",
      "date": "1951-07-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "That Tribunal, after calling for the statements of case on behalf of the parties and hearing them, made an award on February 9, 1952, refusing reinstatement on the sole ground that the respondents had gone on an illegal strike in contravention of section 23(b) of the Industrial Disputes Act, and that the Bank was entitled to dismiss them. The Tribunal, however, granted to the respondents compensation by way of salary and allowances at half the rates from the date of dismissal to the date of the publication of the award.",
      "type": "procedural",
      "date": "1952-02-09",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The respondents appealed to the Labour Appellate Tribunal at Calcutta which, while agreeing with the Industrial Tribunal that the strike was illegal, held that it was condoned by the Bank and it was, therefore, not open to it to justify the dismissal of the respondents on the ground that they had participated in the illegal strike.",
      "type": "procedural",
      "date": "1952-09-22",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The Appellate Tribunal further held that the dismissal of the respondents was wrongful because no charges were framed against any of them in respect of their alleged acts of violence or subversive activities and their explanation was not called for.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The Appellate Tribunal accordingly thought that further evidence was necessary on certain specific points mentioned in its order and reserved its decision as to whether the respondents were entitled to reinstatement till after such evidence was taken.",
      "type": "procedural",
      "date": "1952-09-22",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appeal by special leave granted by the Supreme Court on the 16th October, 1952, from the decision dated the 22nd December, 1952, of the Labour Appellate Tribunal of India at Calcutta in Appeals Nos. Cal. 366/51, Cal. 69/52 and Cal. 70/52.",
      "type": "procedural",
      "date": "1952-10-16",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Bank had condoned the illegal strike by the respondents.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether it was open to the Bank to rely upon the illegal strike as justifying the dismissal of the respondents.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the Appellate Tribunal had jurisdiction to order reinstatement of the respondents.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Applicability of section 33 of the Industrial Disputes Act, 1947 to the dismissal during pendency of proceedings.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Challenged the correctness of the conclusion that the Bank had, in the circumstances of the case, condoned the illegal strike by the respondents, and maintained that it was open to the Bank to rely upon the illegal strike as justifying the dismissal of the respondents.",
      "supporting_facts": [
        "f2",
        "f7"
      ],
      "legal_basis": "section 23(b) of the Industrial Disputes Act"
    },
    {
      "id": "pa2",
      "text": "On that basis argued that there could no longer be any question of reinstating the respondents in the service of the Bank as such reinstatement would in law amount to compelling the Bank to employ these respondents afresh in its service, which the Appellate Tribunal had no jurisdiction to do.",
      "supporting_facts": [
        "f8",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Section 33 has no application to the case as strikes and lock-outs are dealt with in a different chapter, Chapter V, and as the respondents were not concerned in the disputes pending adjudication before Sri Campbell-Puri.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "section 33 of the Industrial Disputes Act, 1947"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The strike was illegal but condoned by the Bank.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Dismissal wrongful because no charges were framed against any of them in respect of their alleged acts of violence or subversive activities and their explanation was not called for.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is unnecessary to express any opinion on the question of condonation or waiver of the illegal strike for, assuming that there was no such condonation or waiver and it was open to the Bank to rely upon the illegal strike as a valid ground for dismissing the respondents.",
      "addresses_issue": "i1",
      "key_observation": "Unnecessary to decide condonation."
    },
    {
      "id": "cr2",
      "text": "Section 33 of the Industrial Disputes Act, 1947, provides that no employer shall, during the pendency of any proceedings before a tribunal in respect of any industrial dispute, discharge by way of dismissal or otherwise, any workman concerned in the dispute save with the permission in writing of the said Tribunal. Admittedly, no such permission was obtained.",
      "addresses_issue": "i4",
      "key_observation": "Dismissal illegal under section 33 due to pendency before Campbell-Puri Tribunal."
    },
    {
      "id": "cr3",
      "text": "If the pendency of the proceedings before Sri Campbell-Puri made the strike of the respondents illegal under section 23(b) of the Act, the dismissal of the respondents by the Bank without obtaining his permission as required by section 33 was also illegal.",
      "addresses_issue": "i2",
      "key_observation": "Both strike and dismissal illegal under the Act."
    },
    {
      "id": "cr4",
      "text": "The terms of section 33 are wide enough to cover the present case, and the fact that it finds place in Chapter VII headed Miscellaneous is by no means inconsistent with its general application to all cases of discharge on whatever ground it may be based. This is shown by the recent amendment of the section by Act XLVIII of 1950 which has omitted the words except for misconduct not connected with the dispute in the newly substituted section.",
      "addresses_issue": "i4",
      "key_observation": "Section 33 applies broadly post-amendment."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Dismissal of the respondents by the Bank without obtaining permission under section 33 during pendency of proceedings was illegal.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Section 33 applies to the case notwithstanding arguments to the contrary.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "section 23(b)",
        "section 33"
      ],
      "relevance": "Strike illegal under s.23(b) due to pendency; dismissal illegal under s.33 without permission during pendency."
    },
    {
      "name": "Act XLVIII of 1950",
      "sections": [
        "amendment to section 33"
      ],
      "relevance": "Omitted words 'except for misconduct not connected with the dispute', broadening application of s.33."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Labour Appellate Tribunal's decision by holding that even assuming no condonation of the illegal strike, the dismissal was illegal under section 33 of the Industrial Disputes Act due to lack of permission during pendency of prior proceedings, rejecting the Bank's appeal and allowing the Appellate Tribunal's further inquiry.",
    "relief_granted": "None specified; upholds lower tribunal's direction for further evidence on reinstatement.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "If the pendency of the proceedings before Sri Campbell-Puri made the strike of the respondents illegal under section 23(b) of the Act, the dismissal of the respondents by the Bank without obtaining his permission as required by section 33 was also illegal.",
      "speaker": "court",
      "significance": "Core reasoning linking illegality of strike and dismissal under the Act."
    },
    {
      "text": "The terms of section 33 are wide enough to cover the present case, and the fact that it finds place in Chapter VII headed Miscellaneous is by no means inconsistent with its general application to all cases of discharge on whatever ground it may be based.",
      "speaker": "court",
      "significance": "Establishes broad applicability of s.33."
    }
  ],
  "_case_id": "1953_119",
  "_label": 0,
  "_text_length": 6506,
  "_extracted_at": "2026-02-08T22:11:32.809419"
}