{
  "metadata": {
    "case_name": "State of Bihar v. Gaya Electric Supply Co. Ltd.",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "MAHAJAN J.",
      "Ramaswami J.",
      "Rai J."
    ],
    "case_number": "Civil Appeal No. 175 of 1951",
    "date_of_judgment": "1953-02-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "A licence for the supply of electric energy in the town of Gaya was obtained by one Khandelwal in the year 1928 under the Indian Electricity Act, 1910.",
      "type": "background",
      "date": "1928",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "With the required sanction of the Government the licence was transferred to the Gaya Electric Supply Co. Ltd. in 1932.",
      "type": "background",
      "date": "1932",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "By a notification dated 23rd June, 1949, the licence was revoked by the Government with effect from 9th July, 1949.",
      "type": "material",
      "date": "1949-06-23",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Thereupon the company filed a suit against the State for a declaration that the revocation of the licence was arbitrary, mala fide and ultra vires (Suit No. 58 of 1949).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "During the pendency of the suit negotiations started between the company and the State for a settlement of the dispute and ultimately on 28th October, 1949, a deed of agreement was arrived at between them.",
      "type": "material",
      "date": "1949-10-28",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Effect of the agreement: The company would withdraw the suit No. 58 of 1949 unconditionally; within three days of withdrawal, State would make advance payment of Rs. five lakhs and company would hand over possession; both parties to make valuations within three months; balance due per Government valuation to be paid, excess refunded; any difference or dispute over payment of balance after valuation to be submitted to sole arbitration of a high government officer.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Arbitration clause contained in letter dated 13th October, 1949, substantially accepted by company in letter dated 17th October, 1949: 'In the case of any difference or dispute between the parties over the valuation as arrived at by the Government and that arrived at by the company, such difference or dispute, including the claim for additional compensation of 20% shall be referred to arbitration'.",
      "type": "material",
      "date": "1949-10-13",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In pursuance of the agreement the State took over the undertaking on 28th October, 1949, and made payment of Rs. five lakhs to the company.",
      "type": "procedural",
      "date": "1949-10-28",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On 19th January, 1950, the company sent a statement of valuation of the assets amounting to Rs. 22,06,072 to the Chief Electrical Engineer, Bihar.",
      "type": "material",
      "date": "1950-01-19",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Chief Electrical Engineer characterized the valuation as fantastic, stated rough valuation approximately five lakhs, final after details.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Company declined further details, stated time essence of contract, extended to 15th February, 1950.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "On 6th April, 1950, Chief Electrical Engineer intimated valuation Rs. 6,56,221.",
      "type": "material",
      "date": "1950-04-06",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "State intimated appointment of Mr. M.S. Rao, C.S., as sole arbitrator.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "On 28th September, 1950, company instituted suit (Title Suit No. 47 of 1950) after notice u/s 80 CPC, alleging State failed to value/pay by 15th March 1950, breach, company rescinded agreement, forfeited Rs. five lakhs; prayed declaration undertaking belongs to them, damages, receiver, injunction.",
      "type": "procedural",
      "date": "1950-09-28",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On 9th October, 1950, State filed application u/s 34 Arbitration Act for stay, alleging arbitration subsisting, suit covered by clause.",
      "type": "procedural",
      "date": "1950-10-09",
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Company denied mala fides, pleaded clause no longer exists, suit not connected.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f17",
      "text": "Subordinate Judge (Additional Sub-Judge Second at Gaya) held suit not in respect of matter agreed to be referred, no jurisdiction to stay, dismissed application (18th December, 1950).",
      "type": "procedural",
      "date": "1950-12-18",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "State appealed to High Court of Patna (Misc. Appeal No. 19 of 1951), High Court held dispute within arbitration clause, stayed suit (30th March, 1951).",
      "type": "procedural",
      "date": "1951-03-30",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Supreme Court granted special leave to company on 22nd May, 1951.",
      "type": "procedural",
      "date": "1951-05-22",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the legal proceedings (suit) are in respect of any matter agreed to be referred under the arbitration clause, warranting stay u/s 34 of the Indian Arbitration Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Company instituted suit with dishonest mala fide motive to avoid arbitration; arbitration agreement subsisting and valid; even if not rescinded, cause of action is non-compliance with agreement, covered by arbitration clause; ready and willing for arbitration.",
      "supporting_facts": [
        "f6",
        "f7",
        "f14",
        "f15"
      ],
      "legal_basis": "Section 34, Indian Arbitration Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "State committed breach by failing to value/pay within time; agreement rescinded, Rs. five lakhs forfeited; arbitration clause no longer exists; suit not connected with clause.",
      "supporting_facts": [
        "f9",
        "f11",
        "f12",
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Legal proceeding sought to be stayed must be in respect of matter agreed to be referred; suit claims breach and rescission of agreement; arbitration clause narrow - only covers difference over valuation and payment of balance due after valuation, not breach or rescission.",
      "addresses_issue": "i1",
      "key_observation": "Scope of arbitration clause very narrow; only confers jurisdiction on arbitrator on question of valuation pure and simple; questions of breach or rescission outside clause."
    },
    {
      "id": "cr2",
      "text": "High Court erred in considering merits like whether time essence or payment after award; u/s 34, court only decides if claim within submission to arbitration, not if claim good/bad.",
      "addresses_issue": "i1",
      "key_observation": "Validity of plaintiff's contention cannot be gone into u/s 34; function limited."
    },
    {
      "id": "cr3",
      "text": "Cited precedents like Heyman v. Darwins Ltd. distinguished; if clause broad covering all disputes out of agreement, different, but here not.",
      "addresses_issue": "i1",
      "key_observation": "Arbitration clause must be considered according to its language."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Suit not in respect of matter agreed to be referred; arbitration clause does not cover disputes on breach or rescission; stay not grantable u/s 34.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Heyman v. Darwins Ltd.",
      "citation": "1942 A.C. 356",
      "treatment": "referred",
      "relevance": "Dispute falls within clause if avoidance arises out of contract terms; clause must be considered by its language."
    },
    {
      "case_name": "Monro v. Bognor Urban Council",
      "citation": "1915 3 K.B. 167",
      "treatment": "referred",
      "relevance": "u/s 34, only consider if claim within submission; merits like frivolous not relevant."
    },
    {
      "case_name": "Harinagar Sugar Mills Ltd. v. Skoda India Ltd.",
      "citation": "A.I.R. 1948 Cal. 230",
      "treatment": "distinguished",
      "relevance": "Clause there comprehensive; not applicable to narrow clause here."
    },
    {
      "case_name": "Governor-General in Council v. Associated Livestock Farm Ltd.",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Clause there covered any dispute out of contract; not applicable here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Arbitration Act",
      "sections": [
        "Section 34"
      ],
      "relevance": "Governs stay of proceedings if matter agreed to be referred and applicant ready for arbitration."
    },
    {
      "name": "Indian Electricity Act, 1910",
      "sections": [],
      "relevance": "Governed original licence and valuation method."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 80"
      ],
      "relevance": "Notice given before suit."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 136"
      ],
      "relevance": "Special leave to appeal."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal (by company via special leave), set aside High Court order granting stay, holding suit not covered by narrow arbitration clause; proceedings not stayed.",
    "relief_granted": "Suit to proceed without stay.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the answer to the question whether a dispute falls within an arbitration clause in a contract must depend on (a) what is the dispute, and (b) what disputes the arbitration clause covers.\"",
      "speaker": "court",
      "significance": "Test for applicability of arbitration clause."
    },
    {
      "text": "\"The scope of it is arbitration clause is a very narrow one. It only confers jurisdiction on the arbitrator on the question of valuation of the undertaking pure and simple.\"",
      "speaker": "court",
      "significance": "Defines limited ambit of clause, basis for refusing stay."
    },
    {
      "text": "\"If he relies upon a contract, he must rely on it for all purposes.\"",
      "speaker": "court",
      "significance": "Party cannot repudiate contract via its terms but avoid arbitration."
    }
  ],
  "_case_id": "1953_20",
  "_label": 1,
  "_text_length": 15871,
  "_extracted_at": "2026-02-08T22:11:36.760664"
}