{
  "metadata": {
    "case_name": "Kshetra Mohan Sadhukhan and Sons v. Commissioner of Excess Profits Tax",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "DAS J."
    ],
    "case_number": "Civil Appeal No. 173 of 1952",
    "date_of_judgment": "1953-10-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Kshetra Mohan Sadhukhan and Sannyasi Charan Sadhukhan, two brothers governed by Dayabhaga School of Hindu law, separated from each other many years ago, started a business in partnership under the name Kshetra Mohan Sadhukhan and Sannyasi Charan Sadhukhan, each having an eight-annas share.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Sannyasi Charan Sadhukhan died in 1932 and his sons were admitted into the partnership; business continued by Kshetra Mohan Sadhukhan and sons of Sannyasi Charan Sadhukhan.",
      "type": "background",
      "date": "1932",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Kshetra Mohan Sadhukhan died in 1934; on and from 17th June 1934, sons of Kshetra Mohan Sadhukhan and sons of Sannyasi Charan Sadhukhan continued the business in partnership.",
      "type": "background",
      "date": "1934-06-17",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Although carried on in partnership, members of each branch constituted a separate Hindu undivided family right up to 13th April 1943, when there was severance of both families inter se; business continued by members of two branches in partnership.",
      "type": "material",
      "date": "1943-04-13",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Deed of partnership executed between eight partners on 19th September 1943; another deed on 28th December 1944.",
      "type": "procedural",
      "date": "1943-09-19",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Assessment to excess profits tax for chargeable accounting periods: 14th April 1943 to 13th April 1944 (deficiency of Rs. 12,804); 14th April 1944 to 13th April 1945 (profit of Rs. 88,652 over standard profit); 14th April 1945 to 31st March 1946.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Assessee firm registered under section 26A Income-tax Act; claimed carry forward of total deficiencies over Rs. 84,000 from previous years plus Rs. 12,804.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Excess Profits Tax Officer rejected claim, held change in persons carrying on business u/s 8 Excess Profits Tax Act w.e.f. 14th April 1943; old business discontinued, new commenced; allowed only Rs. 12,804 carry forward; for 1944-45 assessed net excess Rs. 75,848; no deduction for 1945-46.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Appeals to Appellate Assistant Commissioner dismissed; further appeals to Income-tax Appellate Tribunal dismissed by order dated 25th July 1949.",
      "type": "procedural",
      "date": "1949-07-25",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Applications u/s 66(1) Income-tax Act read with s.21 Excess Profits Tax Act; Tribunal referred question to High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Calcutta High Court (Chakravartti and S.R. Das Gupta JJ.) by judgment dated 20th June 1951 answered question in affirmative.",
      "type": "procedural",
      "date": "1951-06-20",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Application dated 19th October 1943 for renewal of registration u/s 26A for 1942-43 showed two partners: Kshetra Mohan Sadhukhan and sons (Rs. 4,370 share), Bijan Kumar Sadhukhan and brothers (Rs. 4,370); constitution unaltered.",
      "type": "admitted",
      "date": "1943-10-19",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Partnership deed 19th September 1943 between Gosta Behari Sadhukhan and Bros. (first party) and Bijan Kumar Sadhukhan and Bros. (second party); profits equally eight-annas each; references to 'either partner'.",
      "type": "material",
      "date": "1943-09-19",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Partnership deed 28th December 1944 had eight parties; recitals indicate reconstitution on 14th April 1943 as eight partners.",
      "type": "material",
      "date": "1944-12-28",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Returns up to 1943-44 showed two partners each eight annas; from 1944-45 eight partners.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of this case, there is a change in the persons carrying on the business within the meaning of section 8(1) of the Excess Profits Tax Act, 1940, with effect from 14th April 1943, when the business, previously carried on in partnership between two Dayabhaga Hindu undivided families, was carried on by a partnership between the separated male members of the two families?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Firm originally partnership of two HUFs represented by kartas; from 17th June 1934, sons of both became individual partners; firm remained constituted by eight individuals at all material times; no change in persons carrying on business u/s 8 EPT Act.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": "Section 8 Excess Profits Tax Act; Section 26A Income-tax Act"
    },
    {
      "id": "pa2",
      "text": "Partnership between individual members of two HUFs may be described as between two HUFs; prior to 13th April 1943, business carried on by eight individual members as two associations of persons, not HUFs.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Prior to 14th April 1943, business carried on by two Hindu undivided families; on 13th April 1943 both families disrupted; since then individual members carried on business as partnership; new partners not same persons as before; change u/s 8 EPT Act.",
      "supporting_facts": [
        "f4",
        "f8",
        "f11",
        "f15"
      ],
      "legal_basis": "Section 8 Excess Profits Tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Assessee's case that firm always by eight individuals from 1934 is entirely new, not made before authorities; previously admitted partnership of two HUFs till 13th April 1943, then eight individuals; cannot go behind Tribunal's statement of case.",
      "addresses_issue": "i1",
      "key_observation": "New case not open to assessee."
    },
    {
      "id": "cr2",
      "text": "HUF not juristic person for all purposes; partnership by two kartas is between kartas, not families; no evidence individuals were partners before 14th April 1943.",
      "addresses_issue": "i1",
      "key_observation": "Documents show two partners before 1943."
    },
    {
      "id": "cr3",
      "text": "Registration applications, returns, deeds show two partners (HUFs) till 1943; 1943 deed between two groups; 1944 deed recitals confirm reconstitution on 14th April 1943; Tribunal statement binding.",
      "addresses_issue": "i1",
      "key_observation": "Facts imply change from two HUFs to eight individuals."
    },
    {
      "id": "cr4",
      "text": "If pre-1943 partnership of eight accepted, no question of law would arise; question implies prior partnership of two HUFs.",
      "addresses_issue": "i1",
      "key_observation": "Change in persons u/s 8 EPT Act occurred."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "There was a change in the persons carrying on the business within the meaning of section 8 of the Excess Profits Tax Act with effect from 14th April 1943.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Excess Profits Tax Act, 1940",
      "sections": [
        "Section 8(1)",
        "Section 7",
        "Section 21"
      ],
      "relevance": "Change in persons carrying on business prevents carry forward of pre-change deficiencies; only post-change deficiency carried forward."
    },
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "Section 66(1)",
        "Section 66A(2)",
        "Section 26A"
      ],
      "relevance": "Reference to High Court; registration of firm requires signatures of all partners; renewal applications show constitution."
    },
    {
      "name": "Indian Income-tax Rules",
      "sections": [
        "Rule 2",
        "Rule 3"
      ],
      "relevance": "Application for registration signed by all partners personally; in prescribed form."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court's affirmative answer to the question referred; confirmed change in persons carrying on business u/s 8 EPT Act w.e.f. 14th April 1943; assessee not entitled to carry forward pre-1943 deficiencies.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A Hindu undivided family is no doubt included in the expression 'person' as defined in the Indian Income-tax Act as well as in the Excess Profits Tax Act but it is not a juristic person for all purposes.\"",
      "speaker": "court",
      "significance": "Distinguishes legal nature of HUF in partnership context."
    },
    {
      "text": "\"When two kartas of two Hindu undivided families enter into a partnership agreement the partnership is popularly described as one between the two Hindu undivided families but in the eye of the law it is a partnership between the two kartas.\"",
      "speaker": "court",
      "significance": "Core reasoning on identity of partners."
    },
    {
      "text": "\"It appears to us that this is an entirely new case which is not now open to the assessee to put forward.\"",
      "speaker": "court",
      "significance": "Rejects appellant's changed stance."
    }
  ],
  "_case_id": "1953_85",
  "_label": 0,
  "_text_length": 15528,
  "_extracted_at": "2026-02-08T22:11:35.128176"
}