{
  "metadata": {
    "case_name": "Shree Ram Mills Limited v. Commissioner of Income-tax",
    "case_year": 1945,
    "court": "Supreme Court of India",
    "judges": [
      "Bose, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is the Shree Ram Mills Limited of Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The assessment year is 1945-46 and the accounting year is the calendar year 1944.",
      "type": "procedural",
      "date": "1944-01-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Income-tax Officer assessed the profits for income-tax at Rs. 46,18,384.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The Excess Profits Tax Officer computed the profits, for excess profits tax purposes, at Rs. 46,94,304.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "In reaching the figure of Rs. 46,94,304, the Excess Profits Tax Officer excluded certain items in the return for determining how the profits increased the capital, for example, money given away as presents and in charity.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Under the Excess Profits Tax Act, 1940, to determine the quantum of excess profits tax payable, it is necessary to compute the average amount of capital employed by the business during a certain period under Section 23 as computed in accordance with the Second Schedule, bringing in Rule 5.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Rule 5 of Schedule II provides: For the purpose of ascertaining the average amount of capital employed in a business during any period, the profits or losses made in that period shall, except so far as the contrary is shown, be deemed (a) to have accrued at an even rate throughout the period and (b) to have resulted, as they accrued, in a corresponding increase or decrease, as the case may be, in the capital employed in the business.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The department accepted that the profits accrued at an even rate because the assessee has not rebutted that presumption nor has the department attempted to do so.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Under the Articles of Agreement between the assessee and its managing agents, the agents were to be paid a certain commission due yearly on the thirty-first day of December and payable immediately after annual accounts have been passed by the shareholders.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "The managing agents left the commission lying with the assessee.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on a true construction of Rule 5 of Schedule II of the Excess Profits Tax Act the expression 'so far as the contrary is shown' applies only to sub-clause (a) or also to sub-clause (b)?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the managing agency commission payable by the company to its managing agents for the year 1943 is borrowed money for the purposes of Rule 2A or a debt for the purposes of Rule 2 of Schedule II to the Excess Profits Tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The words 'except so far as the contrary is shown' only govern clause (a) and not clause (b).",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Rule 5 of Schedule II, Excess Profits Tax Act, 1940"
    },
    {
      "id": "pa2",
      "text": "Rule 5 is an artificial rule which creates a fiction that profits accrue evenly; if this is not rebutted or accepted, clause (b) must follow as a corollary.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Rule 5 of Schedule II, Excess Profits Tax Act, 1940"
    },
    {
      "id": "pa3",
      "text": "The managing agency commission left with the assessee constitutes a borrowing within the meaning of Rule 2A of Schedule II.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Rule 2A of Schedule II, Excess Profits Tax Act, 1940"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The words 'except so far as the contrary is shown' apply to both clauses (a) and (b), allowing exclusion of items like charity from capital increase.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Rule 5 of Schedule II, Excess Profits Tax Act, 1940"
    },
    {
      "id": "ra2",
      "text": "The managing agency commission is a debt within the meaning of Rule 2.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Rule 2 of Schedule II, Excess Profits Tax Act, 1940"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The word 'deemed' clearly governs both clauses, for the fiction created is not only that profits shall be deemed to have accrued at an even rate but further that they must be deemed to have resulted in a corresponding increase or decrease in capital. The words 'except so far as the contrary is shown' govern both clauses and it is open to either side to rebut either presumption independently.",
      "addresses_issue": "i1",
      "key_observation": "If only one presumption is rebutted, the other stands."
    },
    {
      "id": "cr2",
      "text": "The managing agency commission is a debt and not a borrowing. Mere inaction cannot convert money due into a loan; a loan imports a positive act of lending coupled with acceptance. The Articles merely give a right to receive commission at a certain time; if not paid, it lies as a debt.",
      "addresses_issue": "i2",
      "key_observation": "Relationship of borrower and lender cannot arise by mere inaction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The expression 'so far as the contrary is shown' in Rule 5 of Schedule II applies to both clauses (a) and (b).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The managing agency commission is a debt under Rule 2 and not borrowed money under Rule 2A of Schedule II.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Excess Profits Tax Act, 1940",
      "sections": [
        "Section 23",
        "Schedule II Rule 5",
        "Schedule II Rule 2",
        "Schedule II Rule 2A"
      ],
      "relevance": "Governs computation of average capital employed, deeming of profits accrual and impact on capital, and classification of debts vs borrowings."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court agreed with the High Court on both questions: the exception in Rule 5 applies to both clauses, and the managing agency commission is a debt under Rule 2, not a borrowing under Rule 2A.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'The word deemed clearly governs both clauses, for the fiction which the Rule creates is not only that the profits shall be deemed to have accrued at an even rate throughout the period, but further that they must be deemed to have resulted, as they accrued, in a corresponding increase or decrease in the capital.'",
      "speaker": "court",
      "significance": "Explains scope of Rule 5's deeming provisions."
    },
    {
      "text": "'A loan imports a positive act of lending coupled with an acceptance by the other side of the money as a loan. The relationship of borrower and lender cannot ordinarily come about by mere inaction.'",
      "speaker": "court",
      "significance": "Distinguishes debt from borrowing for managing agency commission."
    }
  ],
  "_case_id": "1953_12",
  "_label": 0,
  "_text_length": 6386,
  "_extracted_at": "2026-02-08T22:11:27.270318"
}