{
  "metadata": {
    "case_name": "Ham Narayan Singh on behalf of Dr. S. P. Mukerjee & Ors. v. Union of India",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "Patanjali Sastri C.J."
    ],
    "case_number": "Petition No. 54 of 1953",
    "date_of_judgment": "1953-03-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioners Dr. S. P. Mukerjee, Shri N. C. Chatterjee, Pandit Nandial Sharma and Pandit Guru Dutt Vaid arrested on the evening of the 6th March, 1953.",
      "type": "material",
      "date": "1953-03-06",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Arrested for alleged defiance of an order prohibiting meetings and processions in the area in question, an offence punishable under section 188 of the Indian Penal Code.",
      "type": "material",
      "date": "1953-03-06",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Remand order alleged to have been passed by Mr. Dhillon, Additional District Magistrate, Delhi, at about 8 p.m. on the 6th March, 1953.",
      "type": "procedural",
      "date": "1953-03-06",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "First remand order dated 6th March expired on the 9th March and is no longer in force.",
      "type": "procedural",
      "date": "1953-03-09",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Remand order alleged to have been passed by the trying Magistrate at about 3 p.m. on the 9th March while adjourning the case on the representation that a habeas corpus petition was being moved in this Court.",
      "type": "procedural",
      "date": "1953-03-09",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "This Court on 10th March directed production of records before Additional District Magistrate and trying Magistrate together with remand papers for inspection by Counsel for the petitioner.",
      "type": "procedural",
      "date": "1953-03-10",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Order produced by trying Magistrate merely directs adjournment of the case till 11th March and contains no direction for remanding the accused to custody till that date.",
      "type": "procedural",
      "date": "1953-03-09",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Four slips of paper handed to Registrar at 5:20 p.m. on 11th March purporting to be warrants of detention dated 6th March addressed to Superintendent of Jail, Delhi, directing accused to be kept in judicial lock-up and produced in court on 9th March 1953, with endorsements on back 'Remanded to judicial till 11th March, 1953'.",
      "type": "procedural",
      "date": "1953-03-06",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Court records produced do not contain any order of remand made on 9th March.",
      "type": "procedural",
      "date": "1953-03-09",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Affidavit on behalf of Government filed on 10th March justifying detention as lawful.",
      "type": "procedural",
      "date": "1953-03-10",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Lawfulness of the detention of the petitioners at the time of the return in habeas corpus proceedings.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Validity of the remand orders, particularly the order of the trying Magistrate under section 344 CrPC on 9th March.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Various questions of law and fact argued challenging the validity of the detention.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Detention justified on basis of two remand orders: one by Additional District Magistrate on 6th March and another by trying Magistrate on 9th March.",
      "supporting_facts": [
        "f3",
        "f5",
        "f8"
      ],
      "legal_basis": "Section 344 of the Criminal Procedure Code"
    },
    {
      "id": "ra2",
      "text": "Slips of paper were with a police officer present in court, filed before Registrar at 5:20 p.m. after court rose.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Unnecessary to discuss questions argued as first remand order of 6th March expired on 9th March even assuming validity.",
      "addresses_issue": "i1",
      "key_observation": "First order no longer in force."
    },
    {
      "id": "cr2",
      "text": "Trying Magistrate proceeding under section 344 CrPC which requires remand order in writing signed by Magistrate if adjourning case; produced order only adjourns to 11th March with no remand direction.",
      "addresses_issue": "i2",
      "key_observation": "No written remand order as required."
    },
    {
      "id": "cr3",
      "text": "Slips of paper not produced despite clear direction on 10th March; cannot take notice of documents produced in such circumstances.",
      "addresses_issue": "i2",
      "key_observation": "Documents not part of court records and produced late."
    },
    {
      "id": "cr4",
      "text": "In habeas corpus, regard to legality of detention at time of return (10th March when affidavit filed), and on that date no order remanding to custody.",
      "addresses_issue": "i1",
      "key_observation": "No valid detention order on material date."
    },
    {
      "id": "cr5",
      "text": "Those depriving personal liberty must strictly observe forms and rules of law.",
      "addresses_issue": "i1",
      "key_observation": "Scrupulous adherence to procedure required."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In habeas corpus proceedings, Court to have regard to legality of detention at time of return and not institution of proceedings.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Every order under section 344 CrPC by court other than High Court must be in writing signed by presiding Judge or Magistrate.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "No valid order of remand on 9th March; detention unlawful on 10th March.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Decisions of this Court",
      "citation": null,
      "treatment": "followed",
      "relevance": "In habeas corpus, legality at time of return; strict observance of law in depriving liberty."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Basis for petition for writ of habeas corpus."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 188"
      ],
      "relevance": "Offence for which petitioners prosecuted: defiance of prohibitory order."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "Section 344"
      ],
      "relevance": "Requires remand order in writing when adjourning case; violated here."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Petition for habeas corpus allowed as no valid remand order existed on 10th March, the material date for assessing legality of detention; detention unlawful.",
    "relief_granted": "Writ of habeas corpus to secure release of petitioners.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Every order made under this section by a court other than a High Court shall be in writing signed by the presiding Judge or Magistrate.",
      "speaker": "court",
      "significance": "Highlights procedural requirement under section 344 CrPC not complied with."
    },
    {
      "text": "We cannot take notice of documents produced in such circumstances, and we are not satisfied that there was any order of remand committing the accused to further custody till the 11th March.",
      "speaker": "court",
      "significance": "Rejects late-produced slips as invalid for justifying detention."
    },
    {
      "text": "This Court has often reiterated before that those who feel called upon to deprive other persons of their personal liberty in the discharge of what they conceive to be their duty, must strictly and scrupulously observe the forms and rules of the law.",
      "speaker": "court",
      "significance": "Emphasizes strict procedural compliance in detention matters."
    }
  ],
  "_case_id": "1953_31",
  "_label": 1,
  "_text_length": 5147,
  "_extracted_at": "2026-02-10T19:13:34.872701"
}