{
  "metadata": {
    "case_name": "M. Y. Shareef & Anr. v. Judges of Nagpur High Court",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Mehr Chand Mahajan C.J."
    ],
    "case_number": "Criminal Appeal No. 72 of 1952",
    "date_of_judgment": "1954-10-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Shri Zikar filed application under Article 226 alleging he was citizen of Bharat, Custodian and police treating him as Pakistan national, prayed for interim prohibition against deportation.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "High Court granted interim order of prohibition.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 11th August 1950, at hearing, State raised preliminary objection that Zikar suppressed material facts, petition liable to be dismissed.",
      "type": "procedural",
      "date": "1950-08-11",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Shri Shareef, counsel for Zikar, combated contention, submitted preliminary objection could be dealt without merits.",
      "type": "procedural",
      "date": "1950-08-11",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "State filed affidavit on 17th August 1950 stating facts; Zikar directed to file reply by 21st August 1950, which he did.",
      "type": "procedural",
      "date": "1950-08-17",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "On 21st August 1950, proceedings: Shareef filed affidavit and copies; attention drawn to para 4, asked if client understood English contents; Shareef said he explained; para 6 uncalled for; remark if inserted for Supreme Court argument; Shareef said stated facts; Naik continued arguments till lunch.",
      "type": "procedural",
      "date": "1950-08-21",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "After lunch on 21st August 1950, Shareef sought time to apply for transfer due to observations on paras 4 and 6; case adjourned to 25th August 1950.",
      "type": "procedural",
      "date": "1950-08-21",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "On 23rd August 1950, application for transfer signed by Zikar, Shareef and Dr. Kathalay: grounds - observations and references to Supreme Court by Rao and Deo JJ. created bona fide belief of prejudice; unnecessary, no doubt would not receive justice; pray transfer to another Bench.",
      "type": "material",
      "date": "1950-08-23",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Transfer application rejected.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Preliminary objection upheld, Article 226 petition dismissed.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "High Court ordered notices to Zikar, Shareef, Kathalay to show cause why committed for contempt for scandalizing Court via transfer application.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Dr. Kathalay filed written statement 4th October 1950: denied scandalized Court; 40 years career upholding dignity; no animus; bona fide thought could apply for transfer; question of principle on counsel duty; regretted hurt to Judges' feelings.",
      "type": "procedural",
      "date": "1950-10-04",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Shri Shareef filed similar written statement: did not know law prohibited; under impression could apply; expressed regret.",
      "type": "procedural",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Shareef filed further statement 16th October 1950: grieved at malice accusation; defending honour; admits possible error of judgment causing pain, deeply regrets.",
      "type": "procedural",
      "date": "1950-10-16",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "High Court held transfer application constituted contempt; advocates guilty; plea of error not accepted as defiant; regret not apology; sentenced Shareef Rs.500 fine or 2 weeks SI; Kathalay Rs.1000 or 1 month SI.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Leave to appeal refused by High Court, granted by Supreme Court.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "On 12th May 1954, Supreme Court: appellants tendered unqualified apology; sincere; adjourned 2 months, direct tender to Division Bench.",
      "type": "procedural",
      "date": "1954-05-12",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "High Court on remand: apology not different from original; no prayer for relief; hardly apologetic; not accept as right; would encourage notion of right to acceptance; not remit sentence.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Appeal back to Supreme Court; Dr. Tek Chand affirmed genuine sorrow.",
      "type": "procedural",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether signing the transfer application impeaching impartiality of Judges constituted contempt of Court by scandalizing the Court with view to perverting due course of justice.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether unqualified apology tendered purges the contempt, warranting remission of sentence.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether counsel's duty to client prevails over duty to Court when signing applications containing scandalizing matter.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Signing transfer application not scandalizing Court; bona fide belief could apply for transfer; professional duty if client under bona fide impression; no animus; error of judgment; regret and unqualified apology purges contempt.",
      "supporting_facts": [
        "f8",
        "f12",
        "f13",
        "f14",
        "f17",
        "f19"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Misconception prevalent in section of Nagpur Bar about counsel responsibilities; acting in client interest legitimate even if scandalizing.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Transfer application scandalized Judges to divert justice; defiant justification; belated error plea; regret not genuine apology; no right to remission; acceptance sets bad precedent, blow to Court authority.",
      "supporting_facts": [
        "f8",
        "f12",
        "f14",
        "f15",
        "f18"
      ],
      "legal_basis": "Contempt precedents (various English and Indian cases)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Transfer application constituted contempt as scandalized Judges to divert justice; decision stands; no exception taken.",
      "addresses_issue": "i1",
      "key_observation": "Judges scandalized with view to perverting due course of justice."
    },
    {
      "id": "cr2",
      "text": "Proposition: no both justification and apology; apology evidence of contriteness; misconception in Bar that client duty prevails; counsel guilty if sign without prima facie grounds to prevent/delay justice; duty to advise against.",
      "addresses_issue": "i3",
      "key_observation": "Misconception to be rooted out by clear pronouncement."
    },
    {
      "id": "cr3",
      "text": "Act under mistaken view of rights/duties; borderline case settling principle; not patent contempt; Judges' Supreme Court reference unfortunate; counsel genuinely believed right; defence not contumacy.",
      "addresses_issue": "i1",
      "key_observation": "Plea of justification not contumacy given Bar impression."
    },
    {
      "id": "cr4",
      "text": "Unqualified apology sincere, repeated; High Court should have accepted post-finding of guilt; condemnation punishment enough; set aside fine.",
      "addresses_issue": "i2",
      "key_observation": "Apology purges contempt in peculiar circumstances."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Counsel signing applications/pleadings scandalizing Court without prima facie grounds, to prevent/delay justice, guilty of contempt; duty to advise client against.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Unqualified sincere apology can purge contempt in borderline cases settling counsel duties, absent contumacy.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": null,
      "citation": null,
      "treatment": "discussed",
      "relevance": "High Court considered large number of English and Indian authorities to hold contempt; Supreme Court: no application to this character."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Underlying petition for enforcement of fundamental rights and interim prohibition."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal allowed to extent sentence of fine set aside; unqualified apology accepted as purging contempt; strong admonition and warning issued to appellants for conduct.",
    "relief_granted": "Fines set aside",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "there cannot be both justification and an apology. The two things are incompatible.",
      "speaker": "court",
      "significance": "Core principle on apology in contempt."
    },
    {
      "text": "counsel who sign applications or pleadings containing matter scandalizing the Court without reasonably satisfying themselves about the prima facie existence of adequate grounds therefor, with a view to prevent or delay the course of justice, are themselves guilty of contempt of Court",
      "speaker": "court",
      "significance": "Key holding on counsel duty."
    },
    {
      "text": "Whatever the circumstances, I do see how much this application for transfer dated the 23rd August, 1950, has hurt the feelings of the Honble Judges and I very much regret that all this should have happened.",
      "speaker": "petitioner",
      "significance": "Early expression of regret by Dr. Kathalay."
    }
  ],
  "_case_id": "1954_110",
  "_label": 1,
  "_text_length": 24148,
  "_extracted_at": "2026-02-08T22:15:07.600669"
}