{
  "metadata": {
    "case_name": "Karnail Singh and Malkiat Singh v. State of Punjab",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Ayyar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Long standing enmity between the appellants and their party on the one hand and the deceased Gurbaksh Singh and his party on the other, resulting in a number of crimes, and proceedings in court.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On the 27th January, 1952, at about sunset time, Gurbaksh Singh was sitting inside his house and his sister Mst. Bholan was in the kitchen.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "The appellants and their men came to the place armed with rifles, got on the roof of the house of Gurbaksh Singh and challenged him to come out.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Gurbaksh Singh and Mst. Bholan went to the kotha and bolted the door from inside.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "The appellants and their men made holes in the roof with spades, ignited inflammable materials, such as dry twigs, and threw them inside the kotha through the holes and set fire to the building. Both Gurbaksh Singh and Mst. Bholan were caught inside and burnt to death.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "A brother of Gurbaksh Singh called Dev, who had been away at that time, was seized when he subsequently turned up, thrown into the flames and was also burnt to death.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Gurnam Singh, P.W. 13, a cousin of Gurbaksh Singh and his neighbour, managed to slip out of the village and reported the occurrence at the police station at Nihal Singhwala, a place eight miles away vide Exhibit PQ. It was then 10.30 P.M.",
      "type": "procedural",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "On receipt of this information, the police sub-inspector, P.W. 25, went to the village with a posse of constables and with Gurnam Singh. He found the house mostly burnt and recovered therefrom the charred remains of three dead bodies and they were identified as those of Gurbaksh, Dev and Mst. Bholan.",
      "type": "procedural",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "The appellant Karnail Singh was actually seen at that place and arrested on the spot.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Malkiat Singh who had been mentioned in Exhibit PQ as one of the participants was found in his house with gunshot wounds and was also arrested.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Eventually eight persons, including the appellants, were charged under section 148, Indian Penal Code, for forming an unlawful assembly with the object of burning the house of Gurbaksh Singh and murdering him, Dev and Mst. Bholan, and under section 302 read with section 149 for their murder.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "The Additional Sessions Judge, Ferozepore, held that the case had not been established beyond doubt as against two of the accused and he accordingly acquitted them. He convicted the six others including the appellants under section 148 and section 302 read with section 149 and sentenced them to death.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "On appeal, the learned Judges of the Punjab High Court held that although there can be no doubt whatever that the occurrence took place more or less on the lines described by the prosecution witnesses, and the primary object of the culprits must have been to murder Gurbaksh Singh, deceased, in consequence of the bitter enmity between him and the main body of the accused.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "High Court held that although it may very well be true that all the six appellants took part in this occurrence, the evidence against the four accused other than the appellants was insufficient to sustain their conviction, as it consisted of the testimony of persons who were at a distance of 40 to 50 feet from the scene of occurrence and who claimed to identify the particular accused only by their voice. They were accordingly acquitted.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "As against the two appellants, there was evidence of the two eyewitnesses, Gurnam Singh P.W. 13 and Maghar Singh P.W. 14. Maghar Singh was not a reliable witness. Nothing could be urged against the evidence of Gurnam Singh, but it would be unsafe to base a conviction on his evidence alone.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "The presence of Karnail Singh at the spot and the existence of wounds on the person of Malkiat Singh afforded sufficient corroboration of the evidence of Gurnam Singh. Confirmed the conviction and sentences as against the appellants.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "As four of the accused were acquitted in appeal, the learned Judges set aside the conviction of the appellants under section 149 and substituted section 34, Indian Penal Code, therefore.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Karnail Singh was found emerging out of the burning house with a spear in his hand. He had injuries on his person and his pyjama was blood-stained. He was arrested on the spot and the spear and the pyjama were seized and marked as Exhibits P-12 and P-20.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f19",
      "text": "In the statement given by Karnail Singh under section 342, Criminal Procedure Code, he stated that when he saw the house of Gurnam Singh on fire, he went there and was assaulted by culprits, that Malkiat Singh came there to help him, that when they were grappling with the culprits he was attacked and Malkiat Singh received a gunshot and thereafter they went away to their houses. The statement of Malkiat Singh also was on similar lines.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f20",
      "text": "P.W. 14 deposed that while the incidents were in progress Malkiat Singh stated that he had been shot by one of his own men and then left the place.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the evidence which had been accepted by the learned Judges as reliable was insufficient to establish the guilt of the appellants.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether their conviction under section 34 was bad as no charge had been framed against them under that section.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Having held that the only eye witness whose evidence was worthy of credence was P.W. 13, and that even his evidence could not be acted upon unless it was corroborated, the learned Judges were in error in holding that there was such corroboration against the appellants.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The mere presence of Karnail Singh at the place of occurrence would in itself mean nothing and that it would amount to corroboration only if some further act incriminatory in character was proved.",
      "supporting_facts": [
        "f9",
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "With reference to Malkiat Singh, the existence of gunshot wounds would be inconclusive as there was no evidence as to how they were caused. The theory that Gurbaksh Singh might himself have shot at him is wholly unsupported by evidence and opposed to the medical evidence and no gun was recovered.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "The statements of the accused under section 342 must be taken as a whole and it was not proper to accept the incriminating portion and reject the exculpatory portion thereof.",
      "supporting_facts": [
        "f19"
      ],
      "legal_basis": "Hanumant v. State of Madhya Pradesh, 1952 S.C.R. 1091, at page 1111"
    },
    {
      "id": "pa5",
      "text": "The scope of section 149 is different from that of section 34, while section 149 requires proof of a common object, section 34 requires a common intention, and therefore when the charge is under section 149, it cannot be converted in appeal into one under section 34.",
      "supporting_facts": [
        "f11",
        "f17"
      ],
      "legal_basis": "Dalip Singh v. State of Punjab"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "So far as Karnail Singh is concerned, his presence at the scene of occurrence under the circumstances disclosed in the evidence is sufficient to corroborate the evidence of P.W. 13. Karnail Singh was arrested on the spot with a spear and a bloodstained pyjama, and these are pieces of evidence which would support the inference that he was concerned in the crime.",
      "addresses_issue": "i1",
      "key_observation": "Gurnam Singh is not an approver. The corroboration required is what would be sufficient to lend assurance to the evidence. Vide Lachhman Singh v. State, 1952 S.C.R. 839 at p. 845."
    },
    {
      "id": "cr2",
      "text": "For Malkiat Singh, the mention of his name in Exhibit PQ is not independent corroboration. But the admission of presence in section 342 statement is distinct and can be used. The gunshot wounds were received at the house of Gurbaksh Singh, supported by P.W. 14's evidence that Malkiat said he was shot by one of his own men, which High Court accepted on this point.",
      "addresses_issue": "i1",
      "key_observation": "Ample materials for holding that the gunshot wounds were received by Malkiat Singh in the house of Gurbaksh Singh and that is sufficient corroboration."
    },
    {
      "id": "cr3",
      "text": "There is substantial difference between sections 149 and 34 but they overlap. If the common object under 149 necessarily involves common intention under 34, and facts/evidence same, no prejudice, substitution is formal. Here, both appellants got on roof and set fire with deceased inside; object to burn house and cause death of Gurbaksh is also intention.",
      "addresses_issue": "i2",
      "key_observation": "On the facts of this case there can be no difference between the object and the intention with which the offenses were committed. Vide Barendra Kumar Ghosh v. Emperor, I.L.R. 52 Cal. 197 (P.C.); Lachhman Singh v. The State, 1952 S.C.R. 839."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The evidence of P.W. 13 is sufficiently corroborated against both appellants.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Substitution of section 34 for section 149 is valid as no prejudice to accused; common object equates to common intention on facts.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hanumant v. State of Madhya Pradesh",
      "citation": "1952 S.C.R. 1091",
      "treatment": "referred",
      "relevance": "Statements under s.342 must be taken as whole; cited by appellants but distinguished."
    },
    {
      "case_name": "Lachhman Singh v. State",
      "citation": "1952 S.C.R. 839",
      "treatment": "followed",
      "relevance": "Corroboration needed lends assurance; substitution of s.34 for s.149 upheld if facts allow alternative charge."
    },
    {
      "case_name": "Dalip Singh v. State of Punjab",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "No recourse to s.34 if not charged and common intention/object different; not broad proposition, depends on facts."
    },
    {
      "case_name": "Barendra Kumar Ghosh v. Emperor",
      "citation": "I.L.R. 52 Cal. 197 (P.C.)",
      "treatment": "followed",
      "relevance": "Sections 34 and 149 overlap to some extent."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "149",
        "34",
        "148"
      ],
      "relevance": "Charged u/s 148, 302/149; convicted u/s 148, 302/149 then substituted 302/34; common object/intention analyzed."
    },
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "342"
      ],
      "relevance": "Statements of accused used as admissions where distinct."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The convictions and sentences of death under section 302 read with section 34, Indian Penal Code, confirmed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The corroboration that is required in such cases is not what would be necessary to support the evidence of an approver but what would be sufficient to lend assurance to the evidence before them, and satisfy them that the particular persons were really concerned in the murder of the deceased.\"",
      "speaker": "court",
      "significance": "Defines standard of corroboration for partisan witness."
    },
    {
      "text": "\"On the facts of this case there can be no difference between the object and the intention with which the offenses were committed.\"",
      "speaker": "court",
      "significance": "Justifies substitution of s.34 for s.149."
    }
  ],
  "_case_id": "1954_78",
  "_label": 0,
  "_text_length": 16071,
  "_extracted_at": "2026-02-08T22:14:38.723239"
}