{
  "metadata": {
    "case_name": "Lala Kishan Prasad & Co. v. Commissioner of Income Tax",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "Mehr Chand Mahajan, C.J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee, a public limited company, was formed in 1917 with objects including commission agents, insurance agents, commercial agents, bankers, merchants, dealing in money, shares, bills, hundis, securities, acquiring lands, buildings, encouraging industrial undertakings, management thereof.",
      "type": "background",
      "date": "1917",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1933, Sarswati Sugar Syndicate Ltd. (sugar company) incorporated.",
      "type": "background",
      "date": "1933",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "March 1933, Lala Kishan Prasad (managing director of assessee) entered agreement with sugar company: assessee to invest Rs. 5,00,000 in shares for managing agency of third mill (expected 1933) on same terms as other mills.",
      "type": "material",
      "date": "1933-03",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Investment conditional on sugar company receiving other share applications of at least Rs. 7,00,000.",
      "type": "material",
      "date": "1933-03",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "If third mill not erected, sugar company to pay assessee Rs. 15,000 as commission on moneys invested.",
      "type": "material",
      "date": "1933-03",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Modification: assessee to subscribe Rs. 3,00,000 shares themselves, remaining Rs. 2,00,000 by friends.",
      "type": "material",
      "date": "1933",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Assessee purchased 3,000 shares of Rs. 3,00,000 value; share certificates issued; Lala Kishan Prasad made director of sugar company.",
      "type": "material",
      "date": "1933",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Third mill not erected; agreement for managing agency fell through.",
      "type": "material",
      "date": "1933",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Lala Kishan Prasad died in December 1940.",
      "type": "background",
      "date": "1940-12",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Assessee decided to sell all shares in 1941: 2,000 shares sold first, excess Rs. 20,000 over cost.",
      "type": "material",
      "date": "1941",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Remaining 1,000 shares sold in 1943, excess realisation Rs. 2,26,700.",
      "type": "material",
      "date": "1943",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Excess Rs. 20,000 taxed as revenue receipt in assessment year 1942-43; Rs. 2,26,700 in 1944-45 by Income-tax Officer, Ambala.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Assessee's contention of capital appreciation rejected by ITO, confirmed by Appellate Assistant Commissioner and Income-tax Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Tribunal referred two questions to High Court of Punjab at instance of assessee under s.66 IT Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "High Court answered both questions in affirmative on 18th June 1951.",
      "type": "procedural",
      "date": "1951-06-18",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Receipts admitted as casual and non-recurring; shares purchased before s.12B period.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Revenue argument that shares fell under 'securities' in memorandum negatived by High Court and conceded by respondent.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on a proper construction of the relevant clauses of the appellant company's memorandum of association and articles of association and on a consideration of the circumstances in which the shares of the Sarswati Sugar Syndicate were purchased and sold, it could be held that the purchase and sale of such shares was a part of appellant company's business deal?",
      "framed_by": "high_court"
    },
    {
      "id": "i2",
      "text": "Whether in the circumstances of the case, the excess of Rs. 20,000 realised in the assessment year 1942-43 and Rs. 2,26,700 in the year 1944-45 was a revenue receipt chargeable to tax under section 3 of the Income-tax Act and was not a mere appreciation of capital?",
      "framed_by": "high_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Excess amounts were not receipts arising from business, but of casual and non-recurring nature, exempt under section 4(3)(vii) IT Act; mere capital appreciation.",
      "supporting_facts": [
        "f10",
        "f11",
        "f16"
      ],
      "legal_basis": "Section 4(3)(vii) Income-tax Act"
    },
    {
      "id": "pa2",
      "text": "Purchase of shares was investment to secure managing agency, no intention to trade or resell.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Purchase and sale was part of business; intention to obtain managing agency and directorship fell within object to undertake management of commercial undertaking.",
      "supporting_facts": [
        "f1",
        "f3",
        "f7"
      ],
      "legal_basis": "Memorandum of association objects"
    },
    {
      "id": "ra2",
      "text": "Out of Rs. 3,00,000 invested, only Rs. 1,00,000 for managing agency, remaining Rs. 2,00,000 for profit.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Shares fell within 'securities' allowing dealing (later conceded).",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Memorandum of association"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court erred; transaction was to acquire managing agency (enduring asset), no intention from inception to resell shares or deal in them; isolated transaction, not business dealing.",
      "addresses_issue": "i1",
      "key_observation": "Object was purely to obtain managing agency; when impossible, sold at profit; investment of capital nature."
    },
    {
      "id": "cr2",
      "text": "Agreement indivisible; entire Rs. 3,00,000 investment for managing agency per letters of 14th and 17th March 1933; not splittable.",
      "addresses_issue": "i2",
      "key_observation": "Sole object to acquire managing agency as permanent asset."
    },
    {
      "id": "cr3",
      "text": "Memorandum authorised purchase/sale but beyond this isolated transaction, no dealing in shares; nature of transaction determines capital/revenue, not powers.",
      "addresses_issue": "i1",
      "key_observation": "Profits accretions to capital, not liable to tax."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Purchase of shares was investment, not adventure in business; excesses not income from business, accretions to capital, not liable to tax.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Excesses were not revenue receipts chargeable u/s 3 IT Act.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "Section 3",
        "Section 4(3)(vii)",
        "Section 12B",
        "Section 66"
      ],
      "relevance": "Excesses assessed u/s 3 as revenue; exemption claimed u/s 4(3)(vii) for casual non-recurring non-business receipts; s.12B not applicable; reference u/s 66."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court reverses High Court judgment dated 18th June 1951; holds purchase of shares was capital investment for securing managing agency, not business adventure; excesses of Rs. 20,000 and Rs. 2,26,700 are capital accretions not liable to tax.",
    "relief_granted": "Exemption from tax on the two sums; appeal allowed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the investment of the money in the purchase of shares was of a capital nature and the profits arising out of the sale of the shares in the circumstances of this case were accretions to capital and were not liable to tax.",
      "speaker": "court",
      "significance": "Core holding on nature of transaction and taxability."
    },
    {
      "text": "there was from the inception no intention whatever on the part of the assessee company to re-sell the shares either at a profit or otherwise deal in them.",
      "speaker": "court",
      "significance": "Determines absence of trading intention."
    },
    {
      "text": "the transaction was one and indivisible and the sole object of the agreement was to acquire the managing agency as an asset of a permanent character.",
      "speaker": "court",
      "significance": "Rejects splitting of investment purpose."
    }
  ],
  "_case_id": "1954_62",
  "_label": 1,
  "_text_length": 10767,
  "_extracted_at": "2026-02-10T19:17:18.872604"
}