{
  "metadata": {
    "case_name": "Appellant (Elected MLA from Kendrapara) v. Jadumoni Mangaraj & Ors.",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "VENKATARAMA AYYAR J."
    ],
    "case_number": "Civil Appeal No. 25 of 1954",
    "date_of_judgment": "1954-04-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Four persons nominated for election to Legislative Assembly, Orissa, from Kendrapara Constituency: appellant, respondents Nos. 1 to 3.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Loknath Das (third respondent) withdrew his candidature.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Election held between 9th and 15th January 1952; appellant secured largest number of votes and declared elected.",
      "type": "material",
      "date": "1952-01-09 to 1952-01-15",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent No. 1 (Jadumoni Mangaraj) presented election petition under section 81 of Representation of the People Act, 1951, alleging corrupt practices by appellant; last date 4th April 1952.",
      "type": "procedural",
      "date": "1952-04-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Petition delivered at post office Cuttack on 3rd April 1952 for registered post, reached Election Commission Delhi on 5th April 1952.",
      "type": "procedural",
      "date": "1952-04-03 to 1952-04-05",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Petition defective in verification as it did not specify paragraphs verified on personal knowledge vs. information received and believed true, per Order VI rule 15(2) CPC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Election Commission condoned delay by order dated 2nd July 1952.",
      "type": "procedural",
      "date": "1952-07-02",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Election Commission by communication dated 3rd July 1952 drew attention to verification defect and suggested application to Tribunal for amendment.",
      "type": "procedural",
      "date": "1952-07-03",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Order passed under section 86 appointing Election Tribunal, Cuttack, on 15th July 1952.",
      "type": "procedural",
      "date": "1952-07-15",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Petitioner applied to Tribunal for amending verification; ordered and amended on 24th July 1952 to conform to Order VI rule 15(2) CPC.",
      "type": "procedural",
      "date": "1952-07-24",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant in written statement contended petition liable to dismissal under section 85 for delay and defective verification.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Election Tribunal by majority judgment dated 16th November 1953 held three corrupt practices proved: (1) induced third respondent to withdraw on promise of employment (s123(1)); (2) used Bus No. O.R.C. 1545 for conveying electors (s123(6)); (3) obtained assistance of Extra Departmental Agents and Presidents of Chaukidari Union (s123(8)).",
      "type": "disputed",
      "date": "1953-11-16",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Election Tribunal set aside appellant's election.",
      "type": "material",
      "date": "1953-11-16",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appeal by special leave granted by Supreme Court on 11th December 1953.",
      "type": "procedural",
      "date": "1953-12-11",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether election petition was maintainable despite being presented one day late and having defective verification.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether Election Commission could condone delay suo motu under proviso to section 85 RPA without application by petitioner.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Election Tribunal had power under section 90(4) to condone defects even if Election Commission lacked jurisdiction.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether findings of corrupt practices by Election Tribunal were perverse or based on no evidence.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Petition presented out of time under s81 and defective verification under s83; liable to dismissal by Election Commission under mandatory s85; Tribunal should dismiss as not maintainable.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Representation of the People Act, 1951 ss 81, 83, 85"
    },
    {
      "id": "pa2",
      "text": "Election Commission order condoning delay invalid as passed suo motu without application by petitioner; requires strict proof like under Limitation Act s5.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Proviso to s85 RPA; Limitation Act s5"
    },
    {
      "id": "pa3",
      "text": "Proviso to s85 requires petitioner to satisfy Commission in person.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Proviso to s85 RPA"
    },
    {
      "id": "pa4",
      "text": "Election Tribunal order under s86 without jurisdiction as petition liable to dismissal under s85; proceedings nullity.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "ss 85, 86 RPA"
    },
    {
      "id": "pa5",
      "text": "Majority findings on corrupt practices not justified by evidence; dissent correct.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Findings on corrupt practices (inducement to withdraw, use of bus) are pure questions of fact supported by evidence, not perverse; no interference under Art 136.",
      "addresses_issue": "i4",
      "key_observation": "This Court does not sit as court of further appeal on facts, especially Election Tribunal findings."
    },
    {
      "id": "cr2",
      "text": "Election Commission can condone delay suo motu under proviso to s85 without notice or enquiry; decision final, between Commission and petitioner.",
      "addresses_issue": "i1",
      "key_observation": "Rights statutory; policy treats delay as matter for Commission."
    },
    {
      "id": "cr3",
      "text": "S90(4) gives Tribunal discretion to dismiss or not for non-compliance with ss81,83,117 notwithstanding s85; overrides but does not review s85 orders.",
      "addresses_issue": "i1",
      "key_observation": "Applies if Commission passes petition without s85 order."
    },
    {
      "id": "cr4",
      "text": "Delay condonation proper: petition posted one day early, reached one day late; liberal construction for substantial justice.",
      "addresses_issue": "i2",
      "key_observation": "No negligence; proper exercise of discretion."
    },
    {
      "id": "cr5",
      "text": "Proviso to s85 does not require personal appearance; satisfaction can be otherwise.",
      "addresses_issue": "i3",
      "key_observation": "Nothing in language or proceedings requires it."
    },
    {
      "id": "cr6",
      "text": "Even if Commission order invalid, Tribunal could condone under s90(4); declined to dismiss, amended verification - no interference under Art 136.",
      "addresses_issue": "i1",
      "key_observation": "Jurisdiction under s86 if not dismissed under s85 (factual)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Election petition maintainable; delay properly condoned by Commission under proviso to s85; Tribunal had discretion under s90(4).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No interference with Tribunal's findings on corrupt practices under Art 136.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jagan Nath v. Jaswant Singh",
      "citation": "A.I.R. 1954 S.C. 210",
      "treatment": "followed",
      "relevance": "Rights in election petitions statutory, determined by reference to creating statutes."
    },
    {
      "case_name": "Krishnasami Panikondar v. Ramasami Chettiar",
      "citation": "45 I.A. 25",
      "treatment": "referred",
      "relevance": "Order under Limitation Act s5 not final, open to question."
    },
    {
      "case_name": "Krishna v. Chathappan",
      "citation": "I.L.R. 13 Mad. 269",
      "treatment": "followed",
      "relevance": "Sufficient cause under Limitation Act s5 to receive liberal construction for substantial justice absent negligence."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "81",
        "83",
        "85",
        "86",
        "90(4)",
        "117",
        "123(1)",
        "123(6)",
        "123(8)"
      ],
      "relevance": "Governs presentation, verification, dismissal, condonation of delay in election petitions; defines corrupt practices."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order VI rule 15(2)"
      ],
      "relevance": "Manner of verification of pleadings applied to election petitions."
    },
    {
      "name": "Limitation Act",
      "sections": [
        "5"
      ],
      "relevance": "Analogous to condonation of delay, but distinguished as not final."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "136"
      ],
      "relevance": "Special leave appeals; no interference with fact findings unless perverse."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; Election Tribunal's order setting aside appellant's election upheld on grounds of maintainability of petition and proven corrupt practices.",
    "relief_granted": "None to appellant; election set aside confirmed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"This Court does not, when hearing appeals under article 136, sit as a Court of further appeal on facts, and does not interfere with findings given on a consideration of the evidence, unless they are perverse or based on no evidence.\"",
      "speaker": "court",
      "significance": "Limits scope of SC review of Tribunal fact findings."
    },
    {
      "text": "\"the words Sufficient cause should receive a liberal construction so as to advance substantial justice when no negligence nor inaction nor want of bona fides is imputable to the appellant.\"",
      "speaker": "court",
      "significance": "Justifies condonation of one-day delay."
    },
    {
      "text": "\"The policy underlying the provision is to treat the question of delay as one between the Election Commission and the petitioner, and to make the decision of the Election Commission on the question final.\"",
      "speaker": "court",
      "significance": "Explains suo motu condonation power."
    }
  ],
  "_case_id": "1954_96",
  "_label": 0,
  "_text_length": 18244,
  "_extracted_at": "2026-02-10T19:18:15.431287"
}