{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Ratilal Nathalal",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Jagannadhadas, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Hindu undivided family consisting of Ramjibhai, his son Ratilal Nathalal (respondent), Ramjibhai's wife Kamlawanti, Ratilal's wife Kantabai, and Ramjibhai's unmarried daughter Pushpa.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On July 27, 1933, Ramjibhai and Ratilal, the sole coparceners, executed a trust deed in respect of four items of house property belonging to the joint family.",
      "type": "material",
      "date": "1933-07-27",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Effect of trust deed: Income enjoyed by Ramjibhai during lifetime; after his death, by Ratilal alone with right of residence for Kamlawanti; after Ratilal's death, by Kantabai and natural born sons in existence at death of survivor of Ramjibhai and Ratilal.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Express power of revocation reserved to Ramjibhai.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "During Ramjibhai's lifetime, income assessed as joint family income under Section 16(1)(c) as addition to other joint family income.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Section 16 of Indian Income-tax Act modified in 1939; clause (c) of sub-section (1) as amended deems income from revocable settlement or disposition to be income of settlor or transferor.",
      "type": "background",
      "date": "1939",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Ramjibhai died on July 23, 1940.",
      "type": "material",
      "date": "1940-07-23",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "After Ramjibhai's death, Income-tax authorities assessed income from trust properties in hands of respondent (Ratilal) as family income.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Respondent objected that income was his individual income and Section 16(1)(c) had no application; authorities overruled; assessee appealed to Income-tax Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Tribunal by order dated March 16, 1950, confirmed Income-tax authorities.",
      "type": "procedural",
      "date": "1950-03-16",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "At instance of respondent, Tribunal referred case to High Court of Bombay under Section 66(1): 'Whether in the circumstances of the case and on the true construction of the settlement deed, is the income from the trust property liable to be included in the income of the assessee Hindu undivided family?'",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "High Court held: Settlement by Ramjibhai and Ratilal as representing HUF (against assessee); but income to Ratilal individual, not joint family (for assessee).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appeal to Supreme Court by Commissioner under Section 66A.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the income from the trust property after Ramjibhai's death is liable to be included in the income of the assessee Hindu undivided family under Section 16(1)(c), or is it the individual income of Ratilal.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "By virtue of second proviso to Section 16(1)(c), Ratilal is a settlor; provision for income to Ratilal after Ramjibhai's death is retransfer to settlor; thus last portion of clause (c) applies, deeming income of transferor i.e. HUF.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": "Section 16(1)(c) and provisos, Indian Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Settlor was HUF, not individuals; income received by Ratilal in individual capacity, not on behalf of joint family; trust deed does not benefit joint family.",
      "supporting_facts": [
        "f2",
        "f3",
        "f12"
      ],
      "legal_basis": "Construction of trust deed"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Settlor is HUF, executed by Ramjibhai and Ratilal as coparceners representing family; undisputed.",
      "addresses_issue": "i1",
      "key_observation": "Settlement by HUF as unit."
    },
    {
      "id": "cr2",
      "text": "Income to Ratilal after Ramjibhai's death is his individual income per trust deed; received in different capacity from that in which alienated.",
      "addresses_issue": "i1",
      "key_observation": "No benefit to joint family."
    },
    {
      "id": "cr3",
      "text": "Fallacy in appellant's argument: Cannot treat Ratilal as settlor for second proviso and HUF for deeming provision; HUF is independent unit larger than coparceners.",
      "addresses_issue": "i1",
      "key_observation": "Provision for income to Ratilal not retransfer to original settlor (HUF)."
    },
    {
      "id": "cr4",
      "text": "Last portion of Section 16(1)(c) does not come into operation.",
      "addresses_issue": "i1",
      "key_observation": "Fictions in clause and provisos do not apply successively to deem individual income as joint family income."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Income from trust property in hands of Ratilal after Ramjibhai's death is his individual income, not joint family income; Section 16(1)(c) does not apply to include it in HUF income.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ramji Keshavji v. Commissioner of Income-tax, Bombay",
      "citation": null,
      "treatment": "referred",
      "relevance": "Relied on by respondent for no retransfer of income; unnecessary to express opinion."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "Section 66A",
        "Section 66",
        "Section 66(1)",
        "Section 16(1)(c)"
      ],
      "relevance": "Governs appeal, reference, and deeming of income from revocable settlements as settlor's income."
    },
    {
      "name": "Indian Income-tax (Amendment) Act, 1939 (VII of 1939)",
      "sections": [
        "Amends Section 16(1)(c)"
      ],
      "relevance": "Introduced provisions deeming income from revocable settlements/dispositions to be settlor's/transferor's."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by Commissioner dismissed; High Court judgment upheld that income from trust property is individual income of Ratilal and not includible in HUF income.",
    "relief_granted": "None specified beyond upholding High Court decision in favour of assessee.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Ratilal alienated the property in one capacity and he receives the benefit under the trust deed in an altogether different capacity. Therefore it cannot be stated that this trust deed in any way benefits the joint family.",
      "speaker": "court",
      "significance": "High Court reasoning adopted; crux of why income is individual."
    },
    {
      "text": "The fallacy of this argument consists in treating the respondent Ratilal as one out of two settlors for the purpose of the second proviso while treating the family as the settlor for the purpose of the last portion of clause (c) of Section 16(1).",
      "speaker": "court",
      "significance": "Rejects appellant's interpretation of Section 16(1)(c)."
    }
  ],
  "_case_id": "1954_31",
  "_label": 0,
  "_text_length": 9802,
  "_extracted_at": "2026-02-10T19:17:34.562110"
}