{
  "metadata": {
    "case_name": "Appellants v. First Respondent",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI J."
    ],
    "case_number": "Civil Appeal No. 154 of 1953",
    "date_of_judgment": "1954-05-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The first respondent was the owner of three shops situated on the ground floor of the premises known as Irani Manzil.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The property was requisitioned on the 15th April, 1943, by the Collector of Bombay under rule 75-A of the Defence of India Rules read with Notification dated 15th April, 1942.",
      "type": "material",
      "date": "1943-04-15",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Requisition order: necessary for public safety and efficient prosecution of war; possession to Food Controller, Bombay; continued during war and six months thereafter or shorter period specified by Food Controller.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Premises used for housing Government Grain Shop No. 176.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Letter dated 30th July, 1946/17th August, 1946 from Controller of Government Grain Shops to first respondent: requisition validity expires 30th September, 1946; suggested allowing Department to remain as tenants.",
      "type": "procedural",
      "date": "1946-07-30",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "First respondent's advocates replied 27th August, 1946, offering tenancy on certain terms, which were not accepted; occupation continued after 30th September, 1946.",
      "type": "procedural",
      "date": "1946-08-27",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "First respondent complained about continued occupation after requisition period ended and contemplated transfer to private party without reference to her.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Notice dated 29th August, 1947 from first respondent's advocates to Collector: vacate shops giving two clear calendar months; deliver peaceful vacant possession.",
      "type": "procedural",
      "date": "1947-08-29",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Letter 1st October, 1947 from Controller: possession handed to second respondent for Grain Shop No. 176; requested consent for electric connection.",
      "type": "procedural",
      "date": "1947-10-01",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "First respondent refused consent and protested.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Collector letter 15th January, 1948: requisition continued after 30th September, 1946 by Act XVII of 1947; possession handed to second respondent; no vacant possession.",
      "type": "procedural",
      "date": "1948-01-15",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Correspondence: Collector admitted subletting to second respondent but contended maintenance of essential supplies justified continued requisition.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Suit No. 235 of 1949 filed by first respondent against appellants (defendants 1&2) and second respondent (defendant 3) for vacant possession and compensation for wrongful use and occupation.",
      "type": "procedural",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Second respondent filed no written statement and did not contest.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Trial Judge Mr. Justice Coyajee decreed suit for first respondent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Appeal No. 117 of 1952: High Court confirmed decree on construction of clause 3 Ordinance No. XIX of 1946; declined other points.",
      "type": "procedural",
      "date": "1953-01-08",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "High Court rejected leave to appeal; special leave granted under Article 136.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Defence of India Act, 1939 and rules expire 30th September, 1946.",
      "type": "background",
      "date": "1946-09-30",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Ordinance No. XIX of 1946 promulgated 26th September, 1946 by Governor-General under section 72 Government of India Act.",
      "type": "background",
      "date": "1946-09-26",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Construction of clause 3 of the Requisitioned Land Continuance of Powers Ordinance, 1946 (No. XIX of 1946): whether it continues requisition orders subject to requisition on expiry of Defence of India Act, including those with inherent limited duration expiring on that date.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Other contentions by first respondent: requisition expired as purpose ceased; user after August 1947 by State Government not Dominion; ceased by Act IX of 1951.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Clause 3 continues all requisitioned lands subject to requisition when Defence of India Act expired on 30th September, 1946, regardless of whether requisition order had limited or indefinite duration; plain grammatical construction; non-obstante clause does not cut down clear words.",
      "supporting_facts": [
        "f2",
        "f3",
        "f18",
        "f19"
      ],
      "legal_basis": "Clause 3 Ordinance No. XIX of 1946; definition in clause 2"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Requisitioning order expired on 30th September, 1946 due to inherent limitation; clause 3 only continues orders that would cease solely by expiry of Act/rules, not those expiring ipso facto by own terms; non-obstante clause supports this; purpose no longer obtained; wrongful possession post-August 1947 by State not Dominion; ceased by Act IX of 1951.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Clause 3 Ordinance No. XIX of 1946; Act IX of 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Preamble and clause 3 address emergency from expiry of Defence of India Act; definition of requisitioned land includes property subject to requisition on expiry date; plain construction covers all such properties irrespective of order's duration.",
      "addresses_issue": "i1",
      "key_observation": "Non-obstante clause cannot cut down clear terms of enactment; incorporated by abundant caution."
    },
    {
      "id": "cr2",
      "text": "Strict construction for measures affecting property rights, but express provisions cover all requisitions on 30th September, 1946; courts cannot speculate beyond clear words.",
      "addresses_issue": "i1",
      "key_observation": "Even limited duration orders covered as they also ceased due to Act expiry."
    },
    {
      "id": "cr3",
      "text": "High Court erred in holding clause 3 did not continue requisition; remand for decision on all points raised at trial.",
      "addresses_issue": "i1",
      "key_observation": "No decision on other points by appellate court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Clause 3 of Ordinance No. XIX of 1946 continues all requisitioned lands subject to requisition on expiry of Defence of India Act, 1939, including those with limited duration.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Defence of India Act, 1939",
      "sections": [
        "Rule 75-A"
      ],
      "relevance": "Powers for requisition exercised thereunder; expired 30th September, 1946"
    },
    {
      "name": "Requisitioned Land Continuance of Powers Ordinance, 1946 (No. XIX)",
      "sections": [
        "Clause 2 (definition)",
        "Clause 3"
      ],
      "relevance": "Continues requisitions post-expiry of Defence of India Act"
    },
    {
      "name": "Government of India Act",
      "sections": [
        "Section 72"
      ],
      "relevance": "Power for Governor-General to promulgate Ordinance"
    },
    {
      "name": "Act XVII of 1947",
      "sections": [],
      "relevance": "Mentioned by Collector as continuing requisition"
    },
    {
      "name": "Act IX of 1951",
      "sections": [],
      "relevance": "Contended by first respondent as ceasing requisition"
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Supreme Court held that clause 3 of Ordinance No. XIX of 1946 continued the requisition order; reversed High Court on that point; remanded appeal to High Court for decision on all points raised before trial court.",
    "relief_granted": "Remand to High Court of Judicature at Bombay",
    "costs": "No order for costs in favour of first respondent"
  },
  "key_quotes": [
    {
      "text": "\"Notwithstanding the expiration of the Defence of India Act, 1939 (XXXV of 1939), and the rules made thereunder, all requisitioned lands shall continue to be subject to requisition until the expiry of this Ordinance\"",
      "speaker": "court",
      "significance": "Text of clause 3 central to construction"
    },
    {
      "text": "\"If the words of the enactment are clear and are capable of only one interpretation on a plain and grammatical construction of the words thereof, a non obstante clause cannot cut down that construction\"",
      "speaker": "court",
      "significance": "Key reasoning rejecting respondent's interpretation of non-obstante clause"
    },
    {
      "text": "\"We cannot help remanding the matter to the Court of appeal with a direction that the appeal be disposed of on all the points which were dealt with by the trial Court.\"",
      "speaker": "court",
      "significance": "Basis for remand order"
    }
  ],
  "_case_id": "1954_102",
  "_label": 1,
  "_text_length": 19871,
  "_extracted_at": "2026-02-08T22:14:35.576639"
}