{
  "metadata": {
    "case_name": "Chaturbhuj Jasani v. Election Petitioner",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Bose J."
    ],
    "case_number": "Civil Appeal No. 155 of 1953",
    "date_of_judgment": "1954-02-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Elections held on five days in December 1951 and January 1952 for two seats in Bhandara Parliamentary Constituency: one general, one reserved for Scheduled Caste (Mahar caste).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Thirteen candidates filed nomination papers, six contested the Scheduled Caste seat including Gangaram Thaware (born Mahar, later joined Mahanubhava Panth).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Objection to Gangaram Thaware's nomination for reserved seat on ground he was no longer a Mahar after joining Mahanubhava Panth, which does not believe in caste or forms separate caste. Nomination rejected.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f4",
      "text": "Nomination of another Scheduled Caste candidate rejected; five others including petitioner withdrew before election.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Elected candidates: Tularam Sakhare (Scheduled Caste seat), Chaturbhuj Jasani (general seat).",
      "type": "material",
      "date": "1952-01-14",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Election Petition No. 3 of 1952 filed challenging Jasani's election on ground disqualified under section 7(d) Representation of the People Act 1951 due to interest in contract for supply of goods to Central Government via firm Moolji Sicka & Co.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Election Tribunal held rejection of Gangaram Thaware's nomination improper as he continued to be Mahar despite joining Mahanubhava Panth; held Jasani disqualified due to contract with Central Government; set aside whole election.",
      "type": "procedural",
      "date": "1953-07-15",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Chaturbhuj Jasani partner in Moolji Sicka & Co., bidi manufacturers; firm had arrangement with Canteen Stores Department (Central Government) for supply of bidis to troops via canteens.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Arrangement embodied in letters: firm undertook to sell to canteen contractors only through Canteen Stores, pay commission on sales; continuing arrangement, Government entitled to commission on orders placed/accepted.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Settlement of Rs. 7,500 paid by firm to Canteen Stores before crucial dates, illustrating continuing arrangement.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Tabular statement (Exhibit C) shows orders, invoices, despatches, payments between Moolji Sicka & Co. and Canteen Stores from Oct 1951 to March 1952, with contracts outstanding between crucial dates 15-11-1951 (last nomination date) and 14-02-1952 (result declaration). Total value Rs. 15,39,345 approx outstanding at times.",
      "type": "material",
      "date": "1951-10 to 1952-03",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Specific consignments to Bombay, Delhi, Calcutta depots under Consignment System between 9-8-1951 and 31-10-1951, value Rs. 28,444-2-3, obligations continued to April 1952.",
      "type": "material",
      "date": "1951-10-01 to 1951-10-19",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Correspondence from 30-3-1951 onwards details evolution from Direct Supply System to Consignment System (pay as sold, return unsold within 6 months for replacement) accepted 9-8-1951; Direct Supply abolished 1-11-1951.",
      "type": "background",
      "date": "1951-03-30 to 1951-08-09",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Gangaram Thaware twice married to Mahar girls (first never converted, second after marriage); led Mahar agitations, contested 1936 election as Mahar; declared himself Mahar in nomination verification and affidavit.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "No evidence of outcasting from Mahars for joining Mahanubhava Panth; Mahars admit converts to functions, intermarry; witnesses confirm Thaware still Mahar.",
      "type": "admitted",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Chaturbhuj Jasani disqualified under section 7(d) Representation of the People Act 1951 for having share/interest in contract for supply of goods to Central Government via partnership in Moolji Sicka & Co.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether contracts subsisted on crucial dates (15-11-1951, 14-02-1952) even after supply/despatch, until payment.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether contracts void under Article 299(1) Constitution for not expressed/made in President's name.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether Gangaram Thaware ceased to be member of Mahar caste upon joining Mahanubhava Panth.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No binding contract from letters, only readiness to do business; each order/acceptance separate contract; no contract subsisting on crucial dates as goods supplied before.",
      "supporting_facts": [
        "f9",
        "f11"
      ],
      "legal_basis": "Rose and Frank Co. v. J.R. Crompton Bros. Ltd."
    },
    {
      "id": "pa2",
      "text": "Contract terminates upon full execution by supplier (delivery), leaving only debtor-creditor relation; disqualification only if executory on contractor's part.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "English cases like Royse v. Birley, Tranton v. Astor"
    },
    {
      "id": "pa3",
      "text": "Contracts void under Article 299(1) as not expressed/executed in President's name.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Article 299(1) Constitution; cases under GOI Acts"
    },
    {
      "id": "pa4",
      "text": "Gangaram Thaware ceased to be Mahar upon joining Mahanubhava Panth, which repudiates caste or forms separate caste.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Arrangement constituted continuing contract for supply; specific orders/invoices show contracts subsisting between crucial dates with outstanding payments.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Contract continues until fully performed by both sides (payment); interest persists until discharge.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Thaware continued as Mahar; no outcasting, intermarriages, participation in caste functions.",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Letters created continuing arrangement for commission on sales; individual orders created contracts governed by terms; contracts subsisted on crucial dates per Exhibit C showing outstanding orders/payments.",
      "addresses_issue": "i1",
      "key_observation": "Various contracts aggregating over Rs.15 lakhs outstanding between 15-11-1951 and 14-02-1952."
    },
    {
      "id": "cr2",
      "text": "Contract for supply continues until fully discharged by performance on both sides (including payment); rejects debtor-creditor termination view.",
      "addresses_issue": "i2",
      "key_observation": "Vendor retains interest to enforce payment; debt depends on contract."
    },
    {
      "id": "cr3",
      "text": "Contracts not void under Art 299(1); formal requirements protect Govt from unauthorised acts but innocent parties protected under s.230(3) Contract Act; Govt not suable but contracts effective.",
      "addresses_issue": "i3",
      "key_observation": "Chairman acted for Union Govt; goods for troops; technical defect does not void."
    },
    {
      "id": "cr4",
      "text": "Conversion to Mahanubhava Panth does not alter caste status for Scheduled Caste seat; no outcasting by Mahars, Thaware retained ties/marriages/activities; practical social test over theology.",
      "addresses_issue": "i4",
      "key_observation": "Mahars regard converts as members; Thaware identified as/acted as Mahar."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Jasani had share/interest in subsisting contracts for supply of goods to Govt on crucial dates; disqualified under s.7(d) RPA.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Contract continues till full performance including payment.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Non-compliance with Art 299(1) does not void contracts against innocent party; s.230(3) applies.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Gangaram Thaware continued as Mahar despite conversion; nomination wrongly rejected.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rose and Frank Co. v. J.R. Crompton Bros. Ltd.",
      "citation": "1925 A.C. 445",
      "treatment": "referred",
      "relevance": "Each order and acceptance constitutes distinct contract."
    },
    {
      "case_name": "OCarroll v. Hastings",
      "citation": "1905 2 I.R. 590",
      "treatment": "followed",
      "relevance": "Contract continues till fully discharged by both sides."
    },
    {
      "case_name": "Satyendrakumar Das v. Chairman of Municipal Commissioners of Dacca",
      "citation": "I.L.R. 58 Cal. 180",
      "treatment": "followed",
      "relevance": "Contract subsists till payment."
    },
    {
      "case_name": "Royse v. Birley",
      "citation": "L.R. 4 C.P 296",
      "treatment": "distinguished",
      "relevance": "Turned on specific statutory language requiring executory contract."
    },
    {
      "case_name": "Abraham v. Abraham",
      "citation": "9 M.I.A. 195",
      "treatment": "followed",
      "relevance": "Principles on convert's retention of old law ties apply analogously."
    },
    {
      "case_name": "Collector of Masulipatam v. Cavaly Venkata Narrainapah",
      "citation": "8 M.I.A. 529",
      "treatment": "referred",
      "relevance": "Govt bound if ratifies excess authority."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "Section 7(d)"
      ],
      "relevance": "Disqualification if share/interest in contract for supply of goods to Govt."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 299(1)"
      ],
      "relevance": "Contracts by Govt to be expressed/executed in President's name; directory for validity against innocent parties."
    },
    {
      "name": "Indian Contract Act, 1872",
      "sections": [
        "Section 230(3)",
        "Section 70"
      ],
      "relevance": "Protection for innocent contracting party with unauthorised Govt agent; compensation claim."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against Election Tribunal's order setting aside elections dismissed; upheld Jasani's disqualification under s.7(d) RPA and improper rejection of Thaware's nomination.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A person shall be disqualified for being chosen as... if by himself he has any share or interest in a contract for the supply of goods to the appropriate Government.\"",
      "speaker": "court",
      "significance": "Quotes s.7(d) RPA central to disqualification."
    },
    {
      "text": "We hold therefore that these contracts which Moolji Sicka Company had entered into with the Government subsisted on 15th November, 1951, and on 14th February, 1952.",
      "speaker": "court",
      "significance": "Key finding on subsisting contracts triggering disqualification."
    },
    {
      "text": "Conversion to this sect imports little beyond an intellectual acceptance of certain ideological tenets and does not alter the convert's caste status.",
      "speaker": "court",
      "significance": "Determines Thaware remains Mahar."
    }
  ],
  "_case_id": "1954_178",
  "_label": 0,
  "_text_length": 47423,
  "_extracted_at": "2026-02-10T19:19:10.269450"
}