{
  "metadata": {
    "case_name": "Appellants (first cousins of Harnam Singh) v. Harnam Singh and Gurmej Singh",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Ghulam Hasan J."
    ],
    "case_number": "Civil Appeal No. 124 of 1951",
    "date_of_judgment": "1954-04-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The two appellants are admittedly the first cousins of the respondent, Harnam Singh, and belong to village Gillanwali, Tahsil Batala, District Gurdaspur.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Gurmej Singh, respondent No. 2, is a collateral of Harnam Singh in the 8th degree.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellants sued for a declaration that the deed of adoption executed by Harnam Singh on July 30, 1940, adopting Gurmej Singh was invalid and could not affect the reversionary rights of the appellants after the death of Harnam Singh.",
      "type": "material",
      "date": "1940-07-30",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Appellants' case: under the Customary Law of Gurdaspur District applicable to the Gill Jats of village Gillanwali, Harnam Singh could only adopt a near collateral and Gurmej Singh being a distant collateral his adoption was invalid.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Defence was a denial of the plaintiffs' claim.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Trial Court (Senior Subordinate Judge, Gurdaspur) dismissed suit on 31st July, 1941.",
      "type": "procedural",
      "date": "1941-07-31",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "District Judge, Gurdaspur, in Appeal No. 91 of 1941, confirmed dismissal on 14th January, 1942.",
      "type": "procedural",
      "date": "1942-01-14",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court of Lahore in Civil Regular Second Appeal No. 450 of 1942 (Trevor Harries C.J. and Mahajan J.) confirmed dismissal on July 12, 1944.",
      "type": "procedural",
      "date": "1944-07-12",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Deed of adoption, Exhibit D.1, recites that Harnam Singh had no male issue who could perform his kirya karam ceremony after his death, that Gurmej Singh had been brought up while he was an infant by his wife and that he had adopted him according to the prevailing custom.",
      "type": "material",
      "date": "1940-07-30",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Deed recites that since the adoption he had been treating and calling Gurmej Singh as his adopted son, this fact was well-known in the village, adoptee enjoying all rights of a son, executed formal document to end disputes, made him owner of all property.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Appeal by special leave granted by Privy Council dated 30th October, 1945.",
      "type": "procedural",
      "date": "1945-10-30",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was sufficient evidence of the factum of adoption.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether under the Customary Law of Gurdaspur District (Riwaj-i-am Question 9), a collateral in the 8th degree (Gurmej Singh) could be validly adopted by Harnam Singh, or whether the rule recognising adoption of 'near collaterals only' is mandatory.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under Customary Law of Gurdaspur District applicable to Gill Jats of village Gillanwali, Harnam Singh could only adopt a near collateral; Gurmej Singh being distant collateral in 8th degree, adoption invalid.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "Riwaj-i-am of Gurdaspur District 1913, Question 9 (adoption of near collaterals only recognised)"
    },
    {
      "id": "pa2",
      "text": "Expression 'near collaterals only' must be construed to mean a collateral up to the third degree and does not cover remote collateral in 8th degree; restriction mandatory and cannot be ignored.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Customary Law interpretation"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Denial of plaintiffs' claim; factum and validity of adoption fully established.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Factum of adoption established by deed (Exhibit D.1) and subsequent conduct of Harnam Singh; ample evidence sustains finding.",
      "addresses_issue": "i1",
      "key_observation": "Deed recites no male issue, adoption per custom, treatment as son, public knowledge, made owner of property."
    },
    {
      "id": "cr2",
      "text": "High Court correctly found sufficient evidence of factum from deed and conduct; all necessary under custom is clear intention by adoptive father, manifested by deed, registration, public declarations, treatment as son.",
      "addresses_issue": "i1",
      "key_observation": "Expression of clear intention constitutes adoption."
    },
    {
      "id": "cr3",
      "text": "Riwaj-i-am Question 9 answer that 'near collaterals only' recognised is not mandatory; language ambiguous, in derogation of general custom, must be proved clearly; amounts to expression of wish, not mandatory.",
      "addresses_issue": "i2",
      "key_observation": "Custom recorded in Riwaj-i-am in derogation of general custom must be proved by clear language; ambiguous words not mandatory."
    },
    {
      "id": "cr4",
      "text": "Right of selection rests with adopter; no warrant to limit 'near collaterals' to certain degree; provision detracts from mandatory nature.",
      "addresses_issue": "i2",
      "key_observation": "Discretion conferred on adopter; no restriction on choice between collaterals."
    },
    {
      "id": "cr5",
      "text": "Punjab customary adoption secular, to appoint heir for agricultural pursuits/family affairs; no emphasis on ceremonies, great latitude in selection; unlike Hindu Law (spiritual benefit).",
      "addresses_issue": "i2",
      "key_observation": "Rules on preferences directory; factum valet applies."
    },
    {
      "id": "cr6",
      "text": "Cited cases show even peremptory language in Riwaj-i-am held directory; e.g., adoption of 9th degree collateral valid despite nearer ones.",
      "addresses_issue": "i2",
      "key_observation": "Custom declarations directory under Punjab law."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Factum of adoption fully established.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Under Gurdaspur District Customary Law (Riwaj-i-am Q9), adoption of 8th degree collateral valid; 'near collaterals only' directory, not mandatory; adopter has right of selection without degree restriction.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jowala v. Diwan Singh",
      "citation": "166 I.C. 237",
      "treatment": "followed",
      "relevance": "Adoption of near collaterals only in Riwaj-i-am not mandatory; relied by High Court."
    },
    {
      "case_name": "Basant Singh v. Brij Raj Saran Singh",
      "citation": "I.L.R. 57 All. 494",
      "treatment": "followed",
      "relevance": "Restriction in Riwaj-i-am to same gotra recommendatory; person of different gotra may be adopted; relied by High Court."
    },
    {
      "case_name": "Jiwan Singh and Another v. Pal Singh and Another",
      "citation": "22 P.R. 1913, p. 84",
      "treatment": "followed",
      "relevance": "Among Randhawa Jats, adoption by deed of 9th degree collateral (16 years old) valid despite nearer collaterals and age rule; provision recommendatory."
    },
    {
      "case_name": "Sant Singh v. Mula and Others",
      "citation": "44 P.R. 913, p. 73; A.I.R. 1935 Lah. 83",
      "treatment": "followed",
      "relevance": "Among Jats, may appoint distant collateral over nearer; clause advisory."
    },
    {
      "case_name": "Chanan Singh v. Buta Singh and Others",
      "citation": null,
      "treatment": "followed",
      "relevance": "Formalities like baradari gathering indicatory, not mandatory; conduct suffices."
    },
    {
      "case_name": "Jowala v. Dewan Singh",
      "citation": "166 I.C. 237",
      "treatment": "followed",
      "relevance": "Adoption of 4th degree collateral valid despite nearer; Riwaj-i-am entry indicatory."
    }
  ],
  "statutes_cited": [
    {
      "name": "Riwaj-i-am of Gurdaspur District (1913)",
      "sections": [
        "Question 9"
      ],
      "relevance": "Recorded custom on adoption: near collaterals only recognised for most tribes, right of selection with adopter; held directory, not mandatory."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the High Court, trial court and District Judge decisions confirming validity of the adoption of Gurmej Singh by Harnam Singh under Gurdaspur customary law.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The custom recorded in the Riwaj-i-am is in derogation of the general custom and those who set up such a custom must prove it by clear and unequivocal language.\"",
      "speaker": "court",
      "significance": "Explains why ambiguous custom provision not mandatory."
    },
    {
      "text": "\"Under the Customary Law in the Punjab, adoption is secular in character, the object being to appoint an heir and the rules relating to ceremonies and to preferences in selection have to be held to be directory.\"",
      "speaker": "court",
      "significance": "Core holding distinguishing Punjab custom from Hindu Law."
    },
    {
      "text": "\"The right of selection rests with the person adopting.\"",
      "speaker": "court",
      "significance": "From Riwaj-i-am answer; supports adopter's discretion."
    }
  ],
  "_case_id": "1954_156",
  "_label": 0,
  "_text_length": 13701,
  "_extracted_at": "2026-02-08T22:15:07.334275"
}