{
  "metadata": {
    "case_name": "Kunwar Rananjaya Singh v. Baijnath Singh",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "DAB J."
    ],
    "case_number": "Civil Appeal No. 73 of 1954",
    "date_of_judgment": "1954-09-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Kunwar Rananjaya Singh, son of Raja Bhagwan Bux Singh of Amethi, was the successful candidate at an election to the Uttar Pradesh Legislative Assembly from Amethi Central constituency.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Polling took place on 31st January 1952, result announced on 6th February 1952, published in Uttar Pradesh State Gazette on 26th February 1952.",
      "type": "procedural",
      "date": "1952-01-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Baijnath Singh, unsuccessful candidate, filed Election Petition No. 252 of 1952 challenging the election on grounds of corrupt practices: bribery, undue influence, false statements, concealment of expenses.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Appellant denied charges, filed petition of recrimination challenging respondent's conduct.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Election Tribunal found against appellant on 7 recrimination issues, dismissed recrimination petition.",
      "type": "procedural",
      "date": "1954-02-11",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Tribunal found in favour of appellant on issues 1,2,4,5,6,7 but against on issue 3: employed more persons than authorised (20 Ziladars with peons/orderlies, Manager, Assistant Manager of Amethi estate), concealed expenditures, exceeded Rs. 8000 limit.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Tribunal held appellant guilty of corrupt practice under section 123(7) and minor corrupt practice under section 124(4), declared election void under section 100.",
      "type": "material",
      "date": "1954-02-11",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Amethi estate belonged to appellant's father; appellant heir apparent, looked after estate; servants employed and paid by father.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appeal by special leave against Tribunal's judgment dated 11th February 1954.",
      "type": "procedural",
      "date": "1954-02-11",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Did respondent No.1 employ for election more persons than authorised by law? Did respondent No.1 incur the expenditure shown in the list as heads of other concealed expenditures? Did he exceed the prescribed limit of expenditure for election?",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Whether employment and payment of extra persons (estate servants) by appellant's father constitutes corrupt practice under section 123(7) by the appellant.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Denied all charges of corrupt practices; estate servants employed and paid by father, not by appellant; volunteers, not employed for payment by candidate or agent.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 123(7) requires employment or excess expenditure by candidate or agent; cited Joseph Forster Wilson v. Sir Christopher Furness"
    },
    {
      "id": "pa2",
      "text": "No excess expenditure incurred or authorised by appellant; no concealment.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Sections 123(7), 124(4)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant looked after estate, so servants virtually his own, employed for payment by him.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Conceded cannot support tribunal's view on servants being appellant's; but section 77 covers excess persons regardless of who employed them.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Section 77, Rules 117, 118"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Servants employed and paid by father; appellant heir apparent but not his servants; father assisted son; equivalent to holiday on full pay with voluntary help.",
      "addresses_issue": "i2",
      "key_observation": "Extra persons in employment of father, paid by father; neither employed nor paid by appellant."
    },
    {
      "id": "cr2",
      "text": "Section 123(7) requires excess employment/expenditure by candidate or agent; rules 117,118 to be read in light of this; section 77 consonant with it.",
      "addresses_issue": "i1",
      "key_observation": "Gist of corrupt practice is action by candidate or agent."
    },
    {
      "id": "cr3",
      "text": "Not guilty of section 123(7), hence no concealment under 124(4); unnecessary to decide if own servants' salary counts as election expense.",
      "addresses_issue": "i1",
      "key_observation": "Spirit of law cannot override plain language."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant not guilty of corrupt practice under section 123(7) or minor corrupt practice under section 124(4).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Joseph Forster Wilson and Another v. Sir Christopher Furness",
      "citation": "6 O'Malley and Hardcastle's Report of Election Cases, page 1 at page 6",
      "treatment": "followed",
      "relevance": "Observation apposite: employment by others not attributable to candidate."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "Section 77",
        "Section 100(2)(b)",
        "Section 145",
        "Section 123(7)",
        "Section 124(4)",
        "Section 100(2)(a)"
      ],
      "relevance": "Defines corrupt practices of excess employment/expenditure by candidate/agent and concealment; basis for voiding election."
    },
    {
      "name": "Conduct of Elections Rules, 1951",
      "sections": [
        "Rule 117",
        "Rule 118",
        "Schedule V",
        "Schedule VI"
      ],
      "relevance": "Prescribes maximum expenses (Rs. 8000 for single-member UP constituency) and permissible paid persons; contravention corrupt practice."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; tribunal's findings on corrupt practices set aside; appellant not guilty; election not void.",
    "relief_granted": "Election of appellant upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "in order to amount to a corrupt practice the excess expenditure must be incurred or authorised by a candidate or his agent and the employment of extra persons must likewise be by a candidate or his agent.",
      "speaker": "court",
      "significance": "Core interpretation of section 123(7)"
    },
    {
      "text": "There can be no doubt that in the eye of the law these extra persons were in the employment of the father of the appellant and paid by the father and they were neither employed nor paid by the appellant.",
      "speaker": "court",
      "significance": "Key factual and legal finding overturning tribunal"
    },
    {
      "text": "the spirit of the law may well be an elusive and unsafe guide and the supposed spirit can certainly not be given effect to in opposition to the plain language of the sections of the Act",
      "speaker": "court",
      "significance": "Rejects policy-based argument for strict construction"
    }
  ],
  "_case_id": "1954_107",
  "_label": 1,
  "_text_length": 12261,
  "_extracted_at": "2026-02-10T19:18:07.390043"
}