{
  "metadata": {
    "case_name": "Lachminarayan Ramgopal & Son Ltd. v. Commissioner of Excess Profits Tax",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI J."
    ],
    "case_number": "Civil Appeals Nos. 292 and 312 of 1950",
    "date_of_judgment": "1954-04-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Mills Company was registered on the 14th February, 1920, at Hyderabad in the then territories of His Exalted Highness the Nizam.",
      "type": "background",
      "date": "1920-02-14",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellants were registered as a private limited company at Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "An agreement was entered into between the Mills Company and the appellants appointing the appellants its Agents for a period of 30 years on certain terms and conditions therein recorded.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellants throughout worked only as the Agents of the Mills Company and for the Fasli years 1351 and 1352 received their remuneration under the terms of the Agency agreement.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "A notice was issued under section 13 of the Hyderabad Excess Profits Tax Regulation by the Excess Profits Tax Officer calling upon the appellants to pay the amount of tax appertaining to these chargeable accounting periods.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellants submitted their accounts and contended that the remuneration received by them from the Mills Company was not taxable on the ground that it was not income, profits or gains from business and was outside the pale of the Excess Profits Tax Regulation.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "This contention of the appellants was negatived and on the 24th April, 1944, the Excess Profits Tax Officer made an order assessing the income of the appellants for the accounting periods 1351 and 1352 Fasli at Rs. 8,957 and Rs. 83,768 respectively and assessed the tax accordingly.",
      "type": "procedural",
      "date": "1944-04-24",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "An appeal was taken by the appellants to the Deputy Commissioner of Excess Profits Tax who disallowed the same.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "An application made by the appellants under section 48(2) for statement of the case to the High Court was rejected by the Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The appellants filed a petition to the High Court under section 48(3) to compel the Commissioner to state the case to the High Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "An order was made by the High Court on this petition directing the Commissioner to state the case and the statement of the case was submitted by the Commissioner on the 26th February, 1946.",
      "type": "procedural",
      "date": "1946-02-26",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Four questions were referred by the Commissioner to the High Court: 1. Whether the Petitioner Company is a partnership firm or a registered firm? 2. Whether under the terms of the agreement the petitioner is an employee of the Mills Company or is carrying on business? 3. Whether the remuneration received from the Mills is on account of service or is the remuneration for business? 4. Whether the principle of personal qualification referred to in section 2, clause 4, of the Excess Profits Regulation is applicable to the Petitioner Company?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The Full Bench of the High Court delivered their judgment, the majority deciding the questions 2 and 3 which were the only questions considered determinative of the reference against the appellants.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The appellants appealed to the Judicial Committee. But before the Judicial Committee heard the appeals there was a merger of the territories of Hyderabad with India.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The appeals finally came for hearing before the Supreme Court Bench at Hyderabad on the 12th December, 1950, when an order was passed transferring the appeals to this Court at Delhi.",
      "type": "procedural",
      "date": "1950-12-12",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The objects for which the appellants were incorporated included: To act as agents for Governments or Authorities or for any bankers, manufacturers, merchants, shippers, Joint Stock Companies and others and carry on all kinds of agency business.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Under Article 115 of the Articles of Association of the Mills Company the appellants and their assigns were appointed the agents of the Company upon the terms, provisions and conditions set out in the Agreement referred to in clause 6 of the Company's Memorandum of Association.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Article 116 provided that the general management of the business of the Company subject to the control and supervision of the Directors, was to be in the hands of the Agents of the Company, who were to have the power and authority on behalf of the Company to enter into all contracts and to do all other things usual, necessary and desirable in the management of the affairs of the Company.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Article 118 authorised the agents to sub-delegate all or any of the powers, authorities and discretions for the time being vested in them.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "The Agency agreement provided that the appellants and their assigns were to be the Agents of the Company for a period of 30 years from the date of registration of the Company and they were to continue to act as such agents until they of their own will resigned.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "The remuneration of the appellants as such Agents was to be a commission of 2-1/2 per cent on the amount of sale proceeds of all yarn cloth and other produce of the Company including cotton grown which commission was to be exclusive of any remuneration or wages payable to the bankers, Solicitors engineers, etc., who may be employed by the appellants.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Clauses 3 and 4 of the agency agreement detailed extensive powers of the appellants subject to the control and supervision of the Directors, including acquiring lands, purchasing/selling machinery, raw materials, manufacturing and selling products, entering contracts, appointing employees, etc.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Clause 4 allowed the appellants liberty to deal with the Company by way of sale to the Company of cotton all raw materials and articles required and purchase from the Company of yarn cloth etc., provided sanctioned by Directors.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f24",
      "text": "Clause 8 provided that two of the members for the time being of the appellants were at the option of the appellants to be the ex-officio Directors of the Company.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f25",
      "text": "Clause 9 empowered the appellants to assign the agreement and the rights thereunder subject to the approval and sanction of the Board.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether under the terms of the agreement the petitioner is an employee of the Mills Company or is carrying on business?",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Whether the remuneration received from the Mills is on account of service or is the remuneration for business?",
      "framed_by": "lower_court"
    },
    {
      "id": "i3",
      "text": "Whether the Petitioner Company is a partnership firm or a registered firm?",
      "framed_by": "lower_court"
    },
    {
      "id": "i4",
      "text": "Whether the principle of personal qualification referred to in section 2, clause 4, of the Excess Profits Regulation is applicable to the Petitioner Company?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The remuneration received by them from the Mills Company was not taxable on the ground that it was not income, profits or gains from business and was outside the pale of the Excess Profits Tax Regulation.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The appellants only worked as the agents of the Mills Company and no others and therefore what they did did not constitute a business.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Questions 1 and 4 not seriously pressed, implying reliance on personal qualifications exclusion for firms/companies.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "section 2, clause 4, of the Excess Profits Regulation"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The remuneration is income, profits or gains from business taxable under the Excess Profits Tax Regulation.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Hyderabad Excess Profits Tax Regulation"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The appellants were agents of the Company and not merely servants, based on distinction: servants under direct control as to manner of work, agents have discretion; powers under Articles 115,116,118 and Agency Agreement clauses 3,4,8,9 indicate agency not servitude; remuneration by commission, fixity of tenure, assignability support this.",
      "addresses_issue": "i1",
      "key_observation": "Directors had general control and supervision but not as to method/manner of day-to-day management."
    },
    {
      "id": "cr2",
      "text": "Even as agents, activities constituted carrying on business: nature and scope of activities relevant, not extent; inclusive definition of business in s.2(4) covers; objects include agency business; continuity of operations, power to deal, sub-delegate etc.; companies come into existence for particular purposes unlike individuals.",
      "addresses_issue": "i2",
      "key_observation": "Activities comprised numerous continuous operations and services; remuneration is income from business."
    },
    {
      "id": "cr3",
      "text": "Questions 1 and 4 not applicable as principle of personal qualifications exclusion does not apply to companies or firms, lacking personal qualifications.",
      "addresses_issue": "i3",
      "key_observation": "Income could not be said to be from profession."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The position of the appellants was not that of servants but the agents of the Company.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The activities of the appellants amounted to the carrying on of business.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "The remuneration received was income, profits or gains from business, taxable under the Regulation.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "William Esplen, Son and Swainston, Limited v. Commissioners of Inland Revenue",
      "citation": "1919 2 K.B. 731",
      "treatment": "referred",
      "relevance": "Company carrying on professional work of partners is not carrying on profession but trade/business, as profits not dependent on personal qualifications of company."
    },
    {
      "case_name": "Inderchand Hari Ram v. Commissioner of Income-tax, U.P. C.P.",
      "citation": "1952 I.T.R. 108",
      "treatment": "referred",
      "relevance": "Partnership carries on business by definition."
    },
    {
      "case_name": "Commissioners of Inland Revenue v. The Korean Syndicate Limited",
      "citation": "1921 12 Tax Cas. 181",
      "treatment": "followed",
      "relevance": "Limited company comes into existence for particular purpose; relevant to determine if carrying on business."
    },
    {
      "case_name": "Commissioners of Inland Revenue v. Birmingham Theatre Royal Estate Co., Limited",
      "citation": "1923 12 Tax Cas. 580",
      "treatment": "followed",
      "relevance": "When considering if enterprise is carrying on business, material to see if a company is doing it."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hyderabad Excess Profits Tax Regulation",
      "sections": [
        "Section 13",
        "Section 48(2)",
        "Section 48(3)",
        "Section 2 clause 4"
      ],
      "relevance": "Basis for assessment notice, reference to High Court, definition of business excluding certain professions based on personal qualifications."
    },
    {
      "name": "Indian Companies Act",
      "sections": [
        "Section 5"
      ],
      "relevance": "Incorporation not necessarily for carrying on business."
    },
    {
      "name": "Indian Partnership Act",
      "sections": [
        "Section 4"
      ],
      "relevance": "Partnership is relation to share profits of business carried on."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's decision against the appellants on questions 2 and 3, holding that the appellants were agents carrying on business and their remuneration was taxable as income from business under the Hyderabad Excess Profits Tax Regulation. Questions 1 and 4 not pressed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Generally a master can tell his servant what to do and how to do it. Generally a principal cannot tell his agent how to carryout his instructions.\"",
      "speaker": "court",
      "significance": "Distinction between servant and agent from Powells Law of Agency."
    },
    {
      "text": "\"The control and supervision of the directors was a general control and supervision and within the limits of their authority the appellants as the agents of the Company had perfect discretion as to how that work of general management was to be done.\"",
      "speaker": "court",
      "significance": "Key to holding appellants as agents not servants."
    },
    {
      "text": "\"It is the nature and scope of these activities and not the extent of the operations which are relevant for this purpose.\"",
      "speaker": "court",
      "significance": "Determines activities constitute business even if restricted to one concern."
    }
  ],
  "_case_id": "1954_126",
  "_label": 0,
  "_text_length": 29786,
  "_extracted_at": "2026-02-08T22:15:18.161826"
}