{
  "metadata": {
    "case_name": "Naresh Charan Das Gupta v. Paresh Charan Das Gupta",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar, J."
    ],
    "case_number": "Civil Appeal No. 202 of 1952",
    "date_of_judgment": "1954-12-02"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Testator Bhabesh Charan Das Gupta died on 27-10-1944 leaving two sons Paresh Charan Das Gupta (first respondent) and Naresh Charan Das Gupta (appellant) and daughter Indira (second respondent).",
      "type": "background",
      "date": "1944-10-27",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Estate consisted of a sixth share in ancestral lands at Matta in District of Dacca and house No. 50 South End Park Calcutta built by testator on purchased site.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Will dated 28-11-1943 directed legacy of Rs. 10 per mensem to younger son (appellant) for life daughter entitled to life estate in five specified rooms in house (personally or by lease) legacy of Rs. 10 per mensem to one of two hospitals subject to legacies first respondent to take estate perform sraddha and pay one-sixth expenses for worship of deity.",
      "type": "material",
      "date": "1943-11-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "First respondent sole executor applied for probate appellant entered caveat application registered as suit No. 94 of 1946.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Issues framed: (1) Was will lawfully and validly executed and attested (2) Had testator testamentary capacity (3) Was will executed under undue influence by Paresh Charan Das Gupta.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Additional District Judge 24-Parganas held in favour of first respondent on issues 1 and 2 against on issue 3 probate refused decree dated 20-01-1949.",
      "type": "procedural",
      "date": "1949-01-20",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "High Court (G.N. Das and S.C. Lahiri JJ) allowed appeal directed grant of probate judgment dated 05-03-1951.",
      "type": "procedural",
      "date": "1951-03-05",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Testator retired as Deputy Superintendent of Police in 1927.",
      "type": "background",
      "date": "1927",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Paresh Charan elder son married in 1925 lived with parents wife and children testator's wife Nirmala died 1929 thereafter Paresh's wife maintained home.",
      "type": "background",
      "date": "1925|1929",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Naresh Charan studied up to I.A. discontinued studies got employment in Tata Co. workshop Jamshedpur on petty salary lived apart from family since then.",
      "type": "background",
      "date": "1920",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Naresh married Shantimayi widow with children in 1928 she Kayastha caste Naresh Baid caste testator strongly opposed marriage correspondence shows father sore wrote it would not pain him if son died.",
      "type": "background",
      "date": "1928",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Will recitals: Younger son Naresh behaving badly married different caste girl without knowledge consent she gave birth to two daughters one son Naresh his son Arun and daughters or future children not entitled to perform sraddh or pindas deprived of inheritance from movable immovable ancestral self-acquired properties no share interest possession also wife Santi deprived.",
      "type": "material",
      "date": "1943-11-28",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Recitals accord with testator's expressions in correspondence at time of marriage and years thereafter.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Over decade passed before will executed correspondence shows testator solicitous about appellant's welfare enquired health sent medicines affectionately disposed to grandchildren sent cloth presents invited wife children to Calcutta stayed with them Jamshedpur gave employment advice.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "After will testator continued corresponding with appellant family in same terms.",
      "type": "material",
      "date": "post 1943-11-28",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Testator man of strong will determined unshakable self-described one-third conservative liberal autocratic solicitous family prestige hurt by inter-caste marriage wrote son broke hearts for woman no right in house as late as 25-12-1941 warned of taunts if wife children live together.",
      "type": "material",
      "date": "1941-12-25",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Net value assets in probate petition Rs. 23,865-10-9 after legacies charges not considerable first respondent salary Rs. 60/month many children appellant Rs. 250/month basic first respondent wife children dependents testator appellant lived apart since 1920.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Indira daughter deposed on commission: testator told her troubles in house elder son objected staying with younger due social trouble daughters marriage wanted to make will later wanted to alter sent for her discussions she excused he said will stands but wants to modify first respondent wife told testator no change in appellant conduct extravagant debts took articles.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Indira husband took sides with appellant wrote he should get share early to avoid complication but insisted on their rights under will.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Will holograph testator made arrangements for execution executed at P.W.1 residence presented for registration himself kept it in cash box found after death lived nearly year after.",
      "type": "material",
      "date": "1943-11-28",
      "source": "court"
    },
    {
      "id": "f21",
      "text": "P.Ws. 1 and 2 attestors stated testator signed in their presence they attested signature not explicitly said signed in testator's presence execution attestation at one sitting at P.W.1 residence all assembled by appointment no cross on attestation.",
      "type": "material",
      "date": "1943-11-28",
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Indira sought to enforce rights under will after testator's death appellant obtained legacy payment for 15 months.",
      "type": "material",
      "date": "post 1944-10-27",
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Due execution attestation not challenged by caveator at trial before Additional District Judge.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the will dated 28-11-1943 was executed under undue influence of the first respondent Paresh Charan Das Gupta.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the will was validly executed and attested as required by section 63 of the Indian Succession Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Will executed under undue influence of first respondent recitals did not reflect testator's mind after decade since marriage natural affection reasserted forgiven forgotten recitals inspired by first respondent dispositions unnatural appellant practically disinherited children ignored Indira evidence shows first respondent influenced testator.",
      "supporting_facts": [
        "f12",
        "f14",
        "f17",
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No proof of due attestation as P.Ws. 1 and 2 did not state they signed in presence of testator.",
      "supporting_facts": [
        "f21"
      ],
      "legal_basis": "Section 63 Indian Succession Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Will valid no undue influence testator competent free agent recitals consistent with longstanding feelings correspondence shows separate streams of affection and property disposition first respondent no part in preparation execution.",
      "supporting_facts": [
        "f11",
        "f12",
        "f13",
        "f16",
        "f20"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Burden on appellant to prove undue influence once due execution solemnities and capacity admitted not in dispute here.",
      "addresses_issue": "i1",
      "key_observation": "Boyse v. Rossborough Craig v. Lamoureux"
    },
    {
      "id": "cr2",
      "text": "Recitals accord with testator's feelings at marriage and thereafter correspondence shows continued resentment despite affection no suggestion wanted appellant to share estate even in difficulties no obligation to help testator strong-willed hurt by social humiliation.",
      "addresses_issue": "i1",
      "key_observation": "Natural affection and property settlement distinct testator's sore unhealed."
    },
    {
      "id": "cr3",
      "text": "Dispositions not unnatural given testator's character feelings estate value first respondent dependent appellant independent.",
      "addresses_issue": "i1",
      "key_observation": "No intrinsic evidence of undue influence."
    },
    {
      "id": "cr4",
      "text": "Indira's evidence unreliable biased falls within illustration to s.61 not undue influence mere persuasion first respondent entitled to views testator decided freely no fraud coercion.",
      "addresses_issue": "i1",
      "key_observation": "Hall v. Hall s.61 Indian Succession Act."
    },
    {
      "id": "cr5",
      "text": "First respondent no act in preparation execution registration holograph will testator arranged everything discussed post-execution.",
      "addresses_issue": "i1",
      "key_observation": "Will represents free volition."
    },
    {
      "id": "cr6",
      "text": "Attestation valid circumstances show all present one sitting no cross-examination on point not challenged at trial pure fact finding accepts lower courts.",
      "addresses_issue": "i2",
      "key_observation": "Section 63 Indian Succession Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Will not executed under undue influence represents free volition of testator.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Will duly executed and attested.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Boyse v. Rossborough",
      "citation": "1857 6 H.L.C. 2 10 E.R. 1192",
      "treatment": "followed",
      "relevance": "Burden of proving undue influence on party alleging it once due solemnities capacity shown."
    },
    {
      "case_name": "Craig v. Lamoureux",
      "citation": "1920 A.C. 349",
      "treatment": "followed",
      "relevance": "Burden of proving undue influence."
    },
    {
      "case_name": "Hall v. Hall",
      "citation": "1868 L.R. 1 P. & D. 481",
      "treatment": "followed",
      "relevance": "Distinction between legitimate persuasion and undue influence pressure overpowering volition."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Succession Act 1925",
      "sections": [
        "61",
        "63"
      ],
      "relevance": "S.61 will caused by fraud coercion importunity taking free agency void illustration on persuasion not invalidating will S.63 due attestation requires signing in presence of testator."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal agreeing with High Court that the will was validly executed without undue influence and duly attested directing grant of probate to first respondent.",
    "relief_granted": "Probate granted to first respondent",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"When once it has been proved... that a will has been executed with due solemnities by a person of competent understanding and apparently a free agent, the burden of proving that it was executed under undue influence is on the party who alleges it.\"",
      "speaker": "court",
      "significance": "Establishes burden of proof on appellant."
    },
    {
      "text": "\"It is one thing for a father... to wish him well in life, and quite another thing to give him any of his properties.\"",
      "speaker": "court",
      "significance": "Distinguishes affection from inheritance entitlement."
    },
    {
      "text": "\"A testator may be led, but not driven and his will must be the offspring of his own volition, and not the record of some one elses.\"",
      "speaker": "court",
      "significance": "Defines undue influence per Hall v. Hall."
    }
  ],
  "_case_id": "1954_118",
  "_label": 0,
  "_text_length": 19212,
  "_extracted_at": "2026-02-10T19:18:14.790984"
}