{
  "metadata": {
    "case_name": "Kunjilal and Deopal v. State",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "GHULAM HASAN J."
    ],
    "case_number": "Criminal Appeal No. 73 of 1953",
    "date_of_judgment": "1954-10-08"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Export of essential supplies such as rice and ghee was prohibited from Madhya Pradesh to another State under section 7 of the Essential Supplies (Temporary Powers) Act, 1946.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 1st March, 1949, three bullock carts belonging to the appellants carrying bags of rice and tins of ghee were crossing the river Dhasan on the Madhya Pradesh and Uttar Pradesh border.",
      "type": "material",
      "date": "1949-03-01",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Head Constable Abdul Samad received information, reached the spot, seized the prohibited goods and brought the carts back to Shahgarh in Madhya Pradesh.",
      "type": "material",
      "date": "1949-03-01",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "When they reached the jungle near Shahgarh, the two appellants allegedly beaten the Head Constable and taken away the property seized to the house of Paltu Bania at Bagrohi.",
      "type": "disputed",
      "date": "1949-03-01",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Appellants denied the offence, pleaded that the goods were not being exported to Uttar Pradesh but to a place called Baraitha in Madhya Pradesh and that they did not beat the Head Constable.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Carts were seized when they were in the mid-stream; cart-men requested Head Constable to let them take carts to the other side for meals, which was allowed, then brought back.",
      "type": "material",
      "date": "1949-03-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Magistrate, Sagar, in Criminal Case No. 44 of 1950, found both offences proved, accepted prosecution evidence on beating and exporting contraband, medical evidence supported; sentenced to 1 year RI u/s 392 IPC and Rs.500 fine u/s 332 IPC each.",
      "type": "procedural",
      "date": "1951-03-26",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Additional Sessions Judge, Sagar, upheld findings, found story of going to Baraitha false as route to Baraitha does not pass through Dhasan river; seizure legal despite crossing border temporarily; reduced sentences: Kunjilal to 6 months RI and Rs.350 fine, Deopal bound over u/s 562 CrPC, fine Rs.250 u/s 332.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "High Court of Judicature at Nagpur dismissed revision in Criminal Revision No. 399 of 1951 on 12th November, 1952.",
      "type": "procedural",
      "date": "1952-11-12",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellants prosecuted separately u/s 7 Essential Supplies Act; convicted by Magistrate, acquitted on appeal by Additional Sessions Judge, Sagar, on October 31, 1952.",
      "type": "procedural",
      "date": "1952-10-31",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Appellants are father Kunjilal and son Deopal aged 17.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was absence of mens rea necessary under section 392 IPC, as appellants honestly believed they were taking goods to a place within Madhya Pradesh.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the trial under sections 332 and 392 IPC was barred under section 403 CrPC due to prior acquittal under section 7 of Essential Supplies Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the seizure of carts was legal, given they were apprehended mid-stream and temporarily taken to other bank.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Absence of mens rea under section 392 IPC as appellants honestly believed taking goods to Baraitha within Madhya Pradesh when caught in mid-stream.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Section 392 IPC"
    },
    {
      "id": "pa2",
      "text": "Route chosen led to Baraitha; seizure illegal as took place beyond Madhya Pradesh border.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Barred by section 403(1) CrPC as already tried and acquitted under section 7 Essential Supplies Act on same facts; sections 236 and 237 CrPC do not apply.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Section 403(1), 236, 237 CrPC"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In Special Leave appeal under Article 136, not open to re-agitate questions of fact; findings of courts below binding.",
      "addresses_issue": "i3",
      "key_observation": "Findings of fact accepted as binding."
    },
    {
      "id": "cr2",
      "text": "Mens rea not absent; route chosen did not lead to Baraitha or any place in Madhya Pradesh but to Uttar Pradesh.",
      "addresses_issue": "i1",
      "key_observation": "Conclusion of honest belief negatived by wrong route finding."
    },
    {
      "id": "cr3",
      "text": "Not barred by section 403(1) CrPC; distinct offence under section 403(2) CrPC for which separate charge might have been made under section 235(1); sections 236 and 237 do not apply.",
      "addresses_issue": "i2",
      "key_observation": "Offences under ss.332/392 IPC distinct from s.7 Essential Supplies Act; seizure legality and acts of hurt/robbery separate questions."
    },
    {
      "id": "cr4",
      "text": "Carts captured before crossing UP border; seizure legal and proper.",
      "addresses_issue": "i3",
      "key_observation": "Evidence accepted that seized mid-stream."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Findings of fact binding; mens rea established under section 392 IPC.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Trial not barred; distinct offence under section 403(2) CrPC.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Seizure legal.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "No substance in contentions.",
      "resolves_issue": null,
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 332",
        "Section 392"
      ],
      "relevance": "Offences of voluntarily causing hurt to public servant and robbery."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "Section 235(1)",
        "Section 236",
        "Section 237",
        "Section 403(1)",
        "Section 403(2)",
        "Section 562"
      ],
      "relevance": "Joinder of charges, double jeopardy, binding over."
    },
    {
      "name": "Essential Supplies (Temporary Powers) Act, 1946",
      "sections": [
        "Section 7"
      ],
      "relevance": "Prohibition on export of essential supplies."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 136"
      ],
      "relevance": "Special leave to appeal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal under Article 136 dismissed as findings of fact binding, mens rea present, and offences distinct under section 403(2) CrPC; no substance in contentions; lower court convictions and sentences upheld.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In a Special Leave to Appeal under article 136, it is not open to the appellants to re-agitate questions of fact and ask the Court to disturb the findings of fact arrived at by the Courts below. Those findings must therefore be accepted as binding.\"",
      "speaker": "court",
      "significance": "Limits scope of Article 136 appeal on facts."
    },
    {
      "text": "\"Sub-section (2) of section 403 in our opinion furnishes a complete answer to the contention raised on behalf of the appellants. That sub-section reads: 403(2)--A person acquitted or convicted of any offence may be afterwards tried for any distinct offence for which a separate charge might have been made against him on the former trial under section 235, sub-section (1).\"",
      "speaker": "court",
      "significance": "Rejects double jeopardy argument."
    },
    {
      "id": "kq3",
      "text": "\"We hold that there is no substance in this contention.\"",
      "speaker": "court",
      "significance": "Concludes appeal lacks merit."
    }
  ],
  "_case_id": "1954_58",
  "_label": 0,
  "_text_length": 7550,
  "_extracted_at": "2026-02-08T22:14:06.426499"
}