{
  "metadata": {
    "case_name": "Appellant Company v. Commissioner of Income-tax",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI J."
    ],
    "case_number": "Civil Appeal No. 162 of 1952",
    "date_of_judgment": "1954-11-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On the 14th November, 1938, the appellant company acquired from the Government of Assam a lease of certain limestone quarries, known as the Komorrah quarries situated in the Khasi and Jaintia Hills District for the purpose of carrying on the manufacture of cement.",
      "type": "background",
      "date": "1938-11-14",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The lease was for 20 years commencing on the 1st November, 1938, and ending on the 31st October, 1958, with a clause for renewal for a further term of 20 years.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The rent reserved was a half-yearly rent certain of Rs. 3,000 for the first two years and thereafter a half-yearly rent certain of Rs. 6,000 with the provision for payment of further royalties in certain events.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Under clause 4 of the lease, protection fee of Rs. 5,000 payable annually during the whole period of the lease in consideration of lessor undertaking not to grant any lease, permit or prospecting licence regarding limestone in the Durgasil area to any other party without condition that no limestone shall be used for manufacture of cement.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Under clause 5, further protection fee of Rs. 35,000 payable annually for 5 years starting from 15th November, 1940, in consideration of lessor undertaking not to allow any lease etc. for limestone in whole Khasi and Jaintia Hills District without condition that no limestone extracted shall be used for manufacture of cement; with abatement if limestone converted into cement exceeds 22,00,000 maunds.",
      "type": "material",
      "date": "1940-11-15",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In the accounting years 1944-45 and 1945-46 the company paid its lessor sums of Rs. 40,000 in accordance with these two covenants.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Company claimed to deduct the sums in computation of its business profits under section 10(2)(xv) of the Income-tax Act in assessments for 1945-46 and 1946-47.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Income-tax Officer, Appellate Assistant Commissioner and Income-tax Appellate Tribunal rejected the contention.",
      "type": "procedural",
      "date": "1949-11-22",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Tribunal referred question to High Court: Whether the two sums of Rs. 5,000 and Rs. 35,000 paid under clauses 4 and 5 were rightly disallowed as capital expenditure not allowable under section 10(2)(xv).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court of Calcutta answered in affirmative on 7th June 1951.",
      "type": "procedural",
      "date": "1951-06-07",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appeal to Supreme Court with leave under section 66A(2) of Indian Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, in the circumstances of the case, the two sums of Rs. 5,000 and Rs. 35,000 paid under clauses 4 and 5 of the deed of the 14th November, 1938, were rightly disallowed as being expenditure of a capital nature and so not allowable under section 10(2)(xv) of the Indian Income-tax Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The sums of Rs. 40,000 paid were deductible as revenue expenditure under section 10(2)(xv) in computation of business profits.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Section 10(2)(xv) of the Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The payments under clauses 4 and 5 were expenditure of a capital nature, not allowable under section 10(2)(xv).",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Section 10(2)(xv) of the Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Discusses line of demarcation between capital and revenue expenditure, citing various English and Indian precedents, adopting Viscount Cave's test in Atherton v. British Insulated: expenditure made not only once and for all but with view to bringing into existence an asset or advantage for enduring benefit of trade is capital.",
      "addresses_issue": "i1",
      "key_observation": "Preponderance of opinion supports Viscount Cave's test; supplemented by whether expenditure altered original character of capital asset."
    },
    {
      "id": "cr2",
      "text": "Synthesizes tests from authorities: outlay for initiation/extension/replacement of business is capital; if for acquiring enduring asset/advantage, capital regardless of source or periodicity; otherwise revenue.",
      "addresses_issue": "i1",
      "key_observation": "Aim and object of expenditure determines character; fixed vs circulating capital as fallback."
    },
    {
      "id": "cr3",
      "text": "Applies to clause 4: Rs. 5,000 annual payment acquires enduring benefit (protection in Durgasil area for whole lease period), appreciates capital asset (lease), not operational expense.",
      "addresses_issue": "i1",
      "key_observation": "Recurring nature immaterial; right to carry business unfettered by competition is capital asset."
    },
    {
      "id": "cr4",
      "text": "Applies to clause 5: Rs. 35,000 for 5 years acquires protection for whole district, enuring for lease period (unless terminated), enhances profit-yielding capacity of capital asset.",
      "addresses_issue": "i1",
      "key_observation": "Not working expense; acquisition of enduring advantage despite 5-year payment period."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The payments of Rs. 5,000 and Rs. 35,000 under clauses 4 and 5 are capital expenditure, not allowable as deduction under section 10(2)(xv).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dovey v. Cory",
      "citation": "1901 A.C. 477",
      "treatment": "referred",
      "relevance": "Warning against formulating precise rules for capital vs revenue."
    },
    {
      "case_name": "Countess Warwick Steamship Co. Ltd. v. Ogg",
      "citation": "1924 2 K.B. 292",
      "treatment": "referred",
      "relevance": "Difficulty in laying down general rule."
    },
    {
      "case_name": "City of London Contract Corporation v. Styles",
      "citation": "1887 2 T.C. 239",
      "treatment": "followed",
      "relevance": "Expenditure to acquire concern (capital) vs carrying on concern (revenue)."
    },
    {
      "case_name": "Vallambrosa Rubber Co., Ltd. v. Farmer",
      "citation": "1910 5 T.C. 529",
      "treatment": "followed",
      "relevance": "Once and for all vs recurring as rough criterion."
    },
    {
      "case_name": "Atherton v. British Insulated and Helsby Cables Ltd.",
      "citation": "1925 10 T.C. 155",
      "treatment": "followed",
      "relevance": "Enduring benefit test for capital expenditure."
    },
    {
      "case_name": "John Smith & Son v. Moore",
      "citation": "1921 12 T.C. 266",
      "treatment": "referred",
      "relevance": "Fixed vs circulating capital test."
    },
    {
      "case_name": "Anglo-Persian Oil Co. v. Dale",
      "citation": "1932 1 K.B. 124",
      "treatment": "referred",
      "relevance": "Fixed/circulating capital; enduring benefit."
    },
    {
      "case_name": "Van Den Berghs Ltd. v. Clark",
      "citation": "1935 19 T.C. 390",
      "treatment": "followed",
      "relevance": "Enduring benefit over fixed/circulating; consistency with Cave's principle."
    },
    {
      "case_name": "Tata Hydro-Electric Agencies Ltd. v. CIT",
      "citation": "1937 LR 64 IA 215",
      "treatment": "followed",
      "relevance": "Expenditure for acquisition of income-earning right (capital) vs earning process (revenue)."
    },
    {
      "case_name": "Munshi Gulab Singh & Sons v. CIT",
      "citation": "1946 14 ITR 66",
      "treatment": "followed",
      "relevance": "Adoption of Cave's test in India."
    },
    {
      "case_name": "CIT v. Century Spinning & Manufacturing Co. Ltd.",
      "citation": "1947 15 ITR 105",
      "treatment": "followed",
      "relevance": "Cave's test as legal touchstone."
    },
    {
      "case_name": "Benarsidas Jagannath, In re",
      "citation": "1946 15 ITR 185",
      "treatment": "followed",
      "relevance": "Synthesis of tests for capital vs revenue."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "10(2)(xv)",
        "66A(2)"
      ],
      "relevance": "Deduction for revenue expenditure; reference to High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court and Income-tax authorities, holding that the protection fees of Rs. 40,000 paid in 1944-45 and 1945-46 under clauses 4 and 5 were capital expenditure not deductible under section 10(2)(xv).",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"But when an expenditure is made, not only once and for all, but with a view to bringing into existence an asset or an advantage for the enduring benefit of a trade, I think that there is very good reason... for treating such an expenditure as properly attributable not to revenue but to capital.\"",
      "speaker": "court",
      "significance": "Viscount Cave's test adopted by the court."
    },
    {
      "text": "The aim and object of the expenditure would determine the character of the expenditure whether it is a capital expenditure or a revenue expenditure.",
      "speaker": "court",
      "significance": "Key principle for distinguishing capital from revenue."
    },
    {
      "text": "The asset which the company had acquired in consideration of this recurring payment was in the nature of a capital asset, the right to carry on its business unfettered by any competition from outsiders within the area.",
      "speaker": "court",
      "significance": "Application to clause 4 payment."
    }
  ],
  "_case_id": "1954_60",
  "_label": 0,
  "_text_length": 34595,
  "_extracted_at": "2026-02-10T19:17:29.540828"
}