{
  "metadata": {
    "case_name": "Appellants v. Respondents (Civil Appeals Nos. 188, 188A, 188B and 188E of 1952)",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "JAGANNADH DAS J."
    ],
    "case_number": "Civil Appeals Nos. 188, 188A, 188B and 188E of 1952",
    "date_of_judgment": "1954-10-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeals by leave granted by the High Court of Bombay under article 133(1)(c) of the Constitution against its common judgment dated 6th December 1951 disposing of Civil Applications Nos. 409, 410, 411 and 780 of 1951 under article 226.",
      "type": "procedural",
      "date": "1951-12-06",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Bombay Taluqdari Tenure Abolition Act, 1949 passed by Bombay Legislature in 1949, received assent of Governor-General on 18th January 1950, gazetted on 24th January 1950.",
      "type": "background",
      "date": "1950-01-18",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Section 3 of the Act: with effect from date of coming into force, taluqdari tenure deemed abolished.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Section 5(1)(a): all taluqdari lands liable to payment of land revenue per Bombay Land Revenue Code and rules.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Section 6: all items of property comprised in taluqdari belonging to taluqdar vest in Government; rights held by taluqdar extinguished.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Section 7: provides for payment of compensation for property vested and rights extinguished; specifies principles and manner of assessment.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Section 14: compensation per Land Acquisition Act payable for rights extinguished not covered by section 7 or other sections.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "High Court held Act for public purpose, compensation neither illusory nor unfair, no violation of section 299 of Government of India Act 1935.",
      "type": "procedural",
      "date": "1951-12-06",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Act is item 4 in Ninth Schedule of Constitution; article 31B inserted by First Amendment 1951.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Act could have been submitted to President for certification under article 31(6) but was not.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Bombay Taluqdari Tenure Abolition Act, 1949 is valid in law, particularly whether it violates section 299 of the Government of India Act 1935 as expropriatory without public purpose and with illusory compensation.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether article 31B and Ninth Schedule protect the Act from challenge based on violation of section 299 of Government of India Act 1935, despite no certification under article 31(6).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Act is expropriatory, not for public purpose, and compensation illusory.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Section 299 of Government of India Act 1935"
    },
    {
      "id": "pa2",
      "text": "No certificate obtained from President under article 31(6); challenge under section 299 remains open.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Article 31(6) of Constitution"
    },
    {
      "id": "pa3",
      "text": "Article 31B protection confined to challenges under Constitution (Part III); open to challenge under section 299 as distinct ground; relies on State of Bihar v. Maharajadhiraja Sir Kameshwar Singh where Bihar Land Reforms Act (Ninth Schedule item 1) provisions held invalid post-First Amendment as fraud on legislative power.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Article 31B; State of Bihar v. Maharajadhiraja Sir Kameshwar Singh of Darbhanga (1952 SCR 889)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Act for public purpose; compensation neither illusory nor unfair; no violation of section 299.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Section 299 of Government of India Act 1935"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Abolition of taluqdari tenure is for public purpose; too late to contend otherwise.",
      "addresses_issue": "i1",
      "key_observation": "Public purpose requirement satisfied."
    },
    {
      "id": "cr2",
      "text": "High Court correctly held compensation not illusory or unfair.",
      "addresses_issue": "i1",
      "key_observation": "No violation of section 299 on merits."
    },
    {
      "id": "cr3",
      "text": "Act listed as item 4 in Ninth Schedule; article 31B provides immunity from challenge on ground of inconsistency with or abridgement of rights in Part III, notwithstanding prior judgments; protects pre-existing rights under section 299 elevated to fundamental rights.",
      "addresses_issue": "i2",
      "key_observation": "Article 31B protects against section 299 challenge as it concerns same rights now in Part III."
    },
    {
      "id": "cr4",
      "text": "Bihar case distinguished: challenge there was on legislative competency as fraud on power, not mere Part III violation.",
      "addresses_issue": "i2",
      "key_observation": "Narrow view of article 31B rejected."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Challenge to validity of Bombay Taluqdari Tenure Abolition Act, 1949 on ground of violation of section 299 of Government of India Act 1935 not open due to protection under article 31B and Ninth Schedule.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Act valid; public purpose established; compensation adequate.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Bihar v. Maharajadhiraja Sir Kameshwar Singh of Darbhanga and Others",
      "citation": "1952 S.C.R. 889",
      "treatment": "distinguished",
      "relevance": "Challenge allowed there on legislative competency as fraud on power, not applicable to Part III violation protected by article 31B."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Taluqdari Tenure Abolition Act, 1949",
      "sections": [
        "3",
        "5(1)(a)",
        "6",
        "7",
        "14"
      ],
      "relevance": "Impugned Act abolishing taluqdari tenures, vesting property in government, providing compensation; held valid and protected."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "299"
      ],
      "relevance": "Prohibited deprivation of property without law providing compensation for public purpose; alleged violation rejected."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "133(1)(c)",
        "226",
        "31(6)",
        "31A",
        "31B",
        "Ninth Schedule (item 4)"
      ],
      "relevance": "Basis for appeals, applications, protection of Act via Ninth Schedule and article 31B."
    },
    {
      "name": "Bombay Land Revenue Code",
      "sections": [],
      "relevance": "Taluqdari lands liable to land revenue thereunder."
    },
    {
      "name": "Land Acquisition Act",
      "sections": [],
      "relevance": "Compensation payable under section 14 for certain rights."
    },
    {
      "name": "Bihar Land Reforms Act, 1950",
      "sections": [],
      "relevance": "Ninth Schedule item 1; cited in argument."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals dismissed as challenge to validity of Bombay Taluqdari Tenure Abolition Act, 1949 not open under article 31B and Ninth Schedule; Act continues in force.",
    "relief_granted": "None",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "By the above amendment therefore and by specifically enumerating this Act in the Ninth Schedule, it appears to us to have been clearly and unequivocally intended that the provisions of this Act should be immune from attack of the kind put forward.",
      "speaker": "court",
      "significance": "Core reasoning on protection under article 31B."
    },
    {
      "text": "We are, therefore, clearly of the opinion that the challenge to the validity of the Bombay Taluqdari Tenure Abolition Act, 1949 on the ground put forward was not open. The appeals must, therefore, be dismissed with costs.",
      "speaker": "court",
      "significance": "Final holding and disposition."
    },
    {
      "text": "No person shall be deprived of his property in British India save by authority of law. Neither the Federal nor a Provincial Legislature shall have power to make any law authorising the compulsory acquisition for public purposes... unless the law provides for the payment of compensation...",
      "speaker": "court",
      "significance": "Quotes section 299 GOI Act central to challenge."
    }
  ],
  "_case_id": "1954_163",
  "_label": 0,
  "_text_length": 11930,
  "_extracted_at": "2026-02-08T22:15:45.036422"
}