{
  "metadata": {
    "case_name": "State of Rajasthan v. Rao Manohar Singhji",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Ghulam Hasan J."
    ],
    "case_number": "Civil Appeal No. 143 of 1952",
    "date_of_judgment": "1954-03-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent Rao Manohar Singhji is the owner of the Jagir of Bedla situate in the former State of Mewar.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Former State of Mewar was integrated in April 1948 to form the former United State of Rajasthan.",
      "type": "background",
      "date": "1948-04",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In April and May 1949, the former United State of Rajasthan was amalgamated with former States of Bikaner, Jaipur, Jaisalmer, Jodhpur and Union of Matsya to form the present United State of Rajasthan.",
      "type": "background",
      "date": "1949-04 to 1949-05",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Three Ordinances issued: No. XXVII of 1948, Nos. X and XV of 1949 by former State of Rajasthan in connection with State Jagirs.",
      "type": "background",
      "date": "1948 and 1949",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Management of Jagirs including Jagir of Bedla assumed by former State of Rajasthan under powers in these Ordinances.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "After formation of State of Rajasthan in May 1949, Ordinances remained in force in part of present Rajasthan, resulting in jagirs managed by State in that area while untouched in rest.",
      "type": "background",
      "date": "1949-05",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondent filed petition under Article 226 on 4th January 1951 contending Ordinances ultra vires Constitution, void under Article 13(1) read with Articles 14 and 31.",
      "type": "procedural",
      "date": "1951-01-04",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Petition challenged Ordinances as infringing Articles 14, 19, 31; prejudicially affecting only Jagirdars of former State of Rajasthan formed in 1948, not those integrated later.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "State replied that Jagir was State grant held at pleasure of Ruler, reverted on death, not heritable/transferable, no compensation under Article 31(2); Ordinances transfer management only, not deprive property.",
      "type": "admitted",
      "date": null,
      "source": "state"
    },
    {
      "id": "f10",
      "text": "High Court (Wanchoo C.J. and Bapna J.) held provisions of Ordinances Nos. X and XV of 1949 not void under Article 31(2) or 19(1)(f); but section 8-A inserted by Ordinance X of 1949 and amended by XV of 1949 void under Article 13(1) read with Article 14.",
      "type": "procedural",
      "date": "1951-12-11",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court issued writ restraining State from collecting rents from tenants of lands comprising Jagir of Bedla.",
      "type": "procedural",
      "date": "1951-12-11",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appeal filed under Article 132(1) on certificate granted by High Court of Rajasthan.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Since High Court judgment, State passed Acts abolishing Jagirs throughout State, but question affects respondent's right to collect rents for short period.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Ordinance No. XXVII of 1948 (Jagirdars Abolition of Powers Ordinance) made July 26, 1948; section 8-A introduced by Ordinance X of 1949 directing revenue collected by Government, paid to Jagirdar after expenses.",
      "type": "background",
      "date": "1948-07-26",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Section 8-A amended by Ordinance XV of 1949 adding 'Including taxes, cesses and other revenue from forests'.",
      "type": "background",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Jagirdars in former State of Rajasthan could not collect rents, while those in Jaipur, Bikaner etc. unaffected post-integration.",
      "type": "disputed",
      "date": "1949-04 to 1949-05",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Constitution came into force January 26, 1950; Article 13 declares inconsistent laws void.",
      "type": "background",
      "date": "1950-01-26",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether section 8-A inserted in Rajasthan Ordinance No. XXVII of 1948 by section 4 of Ordinance No. X of 1949, and amended by section 3 of Ordinance XV of 1949, is void under Article 14 of the Constitution.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Ordinances infringe Articles 14, 19 and 31 of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Jagirdars entitled to compensation under Article 31(2) upon State taking possession.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Decision of High Court that impugned section 8-A as amended hit by Article 14 erroneous.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": "Article 14; reasonable classification based on geographical consideration; precedents like Frank J. Bowman v. Edward A. Lewis"
    },
    {
      "id": "pa2",
      "text": "Jagir held at pleasure of Ruler, not heritable/transferable; no deprivation of property, mere transfer of management; no compensation required under Article 31(2).",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Article 31(2)"
    },
    {
      "id": "pa3",
      "text": "Discrimination not inherent in Ordinances but due to pre-existing provisions in former Rajasthan; justifiable as continuing old laws in integrated areas.",
      "supporting_facts": [
        "f6",
        "f16"
      ],
      "legal_basis": "Article 14; Bowman case; Ramjilal v. ITO; State of Punjab v. Ajaib Singh"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Ordinances ultra vires, void under Article 13(1) read with Articles 14 and 31; infringe equality as only Jagirdars of former Rajasthan affected.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Articles 14, 19, 31"
    },
    {
      "id": "ra2",
      "text": "Denial of equality before law and equal protection; State took possession without compensation.",
      "supporting_facts": [
        "f5",
        "f8"
      ],
      "legal_basis": "Article 14, 31(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court correctly held section 8-A void under Article 14; discrimination obvious as Jagirdars of only part of Rajasthan (former area) subjected to disability post-integration, others unaffected.",
      "addresses_issue": "i1",
      "key_observation": "Discrimination based on no reasonable classification; manifestly unreasonable and arbitrary."
    },
    {
      "id": "cr2",
      "text": "Proper classification must bear reasonable relation to things classified; no substantial distinction shown between Jagirdars of affected and unaffected areas.",
      "addresses_issue": "i1",
      "key_observation": "State failed to allege or prove geographical consideration or different laws of tenure justifying differentiation."
    },
    {
      "id": "cr3",
      "text": "Pre-Constitution discrimination not challengeable until Jan 26, 1950; post-Constitution, Article 14 applies; no rational basis for classification.",
      "addresses_issue": "i1",
      "key_observation": "Preambles of Ordinances do not justify imposition of disability only on former Rajasthan Jagirdars."
    },
    {
      "id": "cr4",
      "text": "Agree with High Court: no objection to abolishing judicial/police powers, but no reason to take away power to collect rents via section 8-A.",
      "addresses_issue": "i1",
      "key_observation": "No real distinction why Jagirdars of particular area treated unequally."
    },
    {
      "id": "cr5",
      "text": "Bowman case inapplicable: no continuation of unchanged old laws in one portion vs different in other; no peculiarity in former Rajasthan Jagirs.",
      "addresses_issue": "i1",
      "key_observation": "Post-formation, no occasion to disfavor one area."
    },
    {
      "id": "cr6",
      "text": "Ramjilal distinguishable: pending proceedings under prior law; Punjab v. Ajaib Singh on geographical basis for abducted persons valid.",
      "addresses_issue": "i1",
      "key_observation": "Rajasthan High Court cases distinguished on reasonable basis existing there."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 8-A of Ordinance No. XXVII of 1948 as amended is void as contravention of Article 14.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Provisions of Ordinances Nos. X and XV of 1949 not void under Article 31(2) or 19(1)(f).",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Frank J. Bowman v. Edward A. Lewis",
      "citation": "101 U.S. 22, 25 L. Ed. 989",
      "treatment": "distinguished",
      "relevance": "Relied by State for geographical/municipal considerations allowing different laws in portions of State; distinguished as no continuation of peculiar old laws here."
    },
    {
      "case_name": "Ramjilal v. Income-tax Officer, Mohindargarh",
      "citation": "1951 S.C.R. 127",
      "treatment": "distinguished",
      "relevance": "Pending proceedings concluded under prior law reasonable; not applicable here."
    },
    {
      "case_name": "State of Punjab v. Ajaib Singh",
      "citation": "1953 S.C.R. 254",
      "treatment": "distinguished",
      "relevance": "Geographical classification for abducted persons recovery valid; not analogous."
    },
    {
      "case_name": "Thakur Madan Singh v. Collector of Sikar",
      "citation": "Rajasthan Law Weekly, 1954, P.1",
      "treatment": "referred",
      "relevance": "Rajasthan HC upheld Jaipur District Boards Act on reasonable basis (higher development); distinguished present case."
    },
    {
      "case_name": "In re, Raja Hari Singh v. Rajasthan",
      "citation": "Unreported, November 10, 1953",
      "treatment": "referred",
      "relevance": "Rajasthan HC upheld Mewar tenancy/revenue laws as ameliorative; no similar laws elsewhere not discriminatory; adhered to view in present case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14",
        "Article 19(1)(f)",
        "Article 31",
        "Article 31(2)",
        "Article 13(1)",
        "Article 132(1)",
        "Article 226"
      ],
      "relevance": "Section 8-A held void under Art 14 for discrimination; other challenges under 19,31 rejected."
    },
    {
      "name": "United State of Rajasthan Jagirdars Abolition of Powers Ordinance, 1948 (No. XXVII)",
      "sections": [
        "Section 8",
        "Section 8-A"
      ],
      "relevance": "Assumed management; s.8A directed revenue collection by Govt, held discriminatory."
    },
    {
      "name": "United State of Rajasthan Jagirdars Abolition of Powers Amendment Ordinance, 1949 (No. X)",
      "sections": [
        "Section 4"
      ],
      "relevance": "Inserted s.8A."
    },
    {
      "name": "United State of Rajasthan Jagirdars Abolition of Powers 2nd Amendment Ordinance, 1949 (No. XV)",
      "sections": [
        "Section 3"
      ],
      "relevance": "Amended s.8A to include taxes, cesses, forest revenue."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court's judgment declaring section 8-A void under Article 14, prohibiting State from collecting rents from tenants of Bedla Jagir; appeal by State dismissed.",
    "relief_granted": "Writ upheld restraining State from collecting rents.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Judged by this criterion it seems to us that the discrimination is based on no classification at all and is manifestly unreasonable and arbitrary.",
      "speaker": "court",
      "significance": "Core holding on Article 14 violation."
    },
    {
      "text": "Section 8-A of the impugned Ordinance as amended is a clear contravention of the respondents right under article 14 of the Constitution and must be declared void.",
      "speaker": "court",
      "significance": "Final declaration on validity."
    },
    {
      "text": "Such an obvious discrimination can be supported only on the ground that it was based upon reasonable classification.",
      "speaker": "court",
      "significance": "Test applied for Article 14."
    }
  ],
  "_case_id": "1954_16",
  "_label": 0,
  "_text_length": 18079,
  "_extracted_at": "2026-02-10T19:17:21.504775"
}