{
  "metadata": {
    "case_name": "Civil Appeals Nos. 188, 188A, 188B and 188E of 1952",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Jagannadh Das J."
    ],
    "case_number": "Civil Appeals Nos. 188, 188A, 188B and 188E of 1952",
    "date_of_judgment": "1954-10-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeals by leave granted by the High Court of Bombay under article 133(1)(c) of the Constitution against its common judgment disposing of certain applications under article 226.",
      "type": "procedural",
      "date": "1951-12-06",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Bombay Taluqdari Tenure Abolition Act, 1949 passed by Bombay Legislature in 1949, received assent of Governor-General on 18th January 1950, gazetted on 24th January 1950.",
      "type": "background",
      "date": "1950-01-24",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Section 3 of the Act: with effect from date of coming into force, taluqdari tenure deemed abolished.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Section 5(1)(a): all taluqdari lands liable to payment of land revenue under Bombay Land Revenue Code.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Section 6: all items of property comprised in taluqdari belonging to taluqdar vest in Government; rights held by taluqdar extinguished.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Section 7: provides for payment of compensation in respect of property vested and rights extinguished; specifies principles and manner.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Section 14: compensation under Land Acquisition Act payable for rights extinguished not covered by section 7 or other sections.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "High Court held Act for public purpose, compensation not illusory or unfair, no violation of section 299 of Government of India Act, 1935.",
      "type": "procedural",
      "date": "1951-12-06",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Act is item 4 in Ninth Schedule of Constitution; protected by article 31B inserted by First Amendment in 1951.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Bombay Taluqdari Tenure Abolition Act, 1949 is valid in law, particularly whether it violates section 299 of the Government of India Act, 1935 (expropriatory, not for public purpose, illusory compensation).",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether article 31B and Ninth Schedule protect the Act from challenge based on violation of section 299 of Government of India Act, 1935, despite no certification under article 31(6).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Act is expropriatory, not for public purpose, compensation illusory.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Section 299, Government of India Act, 1935"
    },
    {
      "id": "pa2",
      "text": "Article 31B protection confined to challenges under Constitution (Part III); open to challenge under section 299 GOI Act; cites Bihar Land Reforms Act challenge allowed post-First Amendment on legislative competency/fraud grounds.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Article 31B; State of Bihar v. Maharajadhiraja Sir Kameshwar Singh; Article 31(6)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Act for public purpose; compensation neither illusory nor unfair; no violation of section 299 GOI Act.",
      "supporting_facts": [
        "f3",
        "f6",
        "f7"
      ],
      "legal_basis": "Section 299, Government of India Act, 1935"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Abolition of taluqdari tenure is for public purpose; too late to contend otherwise.",
      "addresses_issue": "i1",
      "key_observation": "Public purpose requirement satisfied."
    },
    {
      "id": "cr2",
      "text": "Act listed in Ninth Schedule (item 4); article 31B protects from challenges that Act inconsistent with or abridges rights in Part III, including pre-existing rights under section 299 GOI Act now fundamental rights.",
      "addresses_issue": "i2",
      "key_observation": "Article 31B covers violation of section 299 rights as they are now Part III rights; Bihar case was on legislative competency fraud, not Part III violation."
    },
    {
      "id": "cr3",
      "text": "Challenge based on section 299 is in substance attack on fundamental right to property acquisition only for public purpose with compensation; protected by article 31B notwithstanding prior judgments.",
      "addresses_issue": "i1",
      "key_observation": "Acts in Ninth Schedule continue in force immune from such challenges."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Bombay Taluqdari Tenure Abolition Act, 1949 valid; challenge on grounds of section 299 GOI Act not open due to article 31B and Ninth Schedule protection.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Article 31B protects Acts in Ninth Schedule from challenges on grounds of inconsistency with Part III rights, including those mirroring section 299 GOI Act.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Bihar v. Maharajadhiraja Sir Kameshwar Singh of Darbhanga",
      "citation": "1952 S.C.R. 889",
      "treatment": "referred",
      "relevance": "Challenge to Bihar Land Reforms Act allowed post-First Amendment on legislative competency/fraud grounds, not Part III violation; distinguished from present case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Taluqdari Tenure Abolition Act, 1949",
      "sections": [
        "3",
        "5(1)(a)",
        "6",
        "7",
        "14"
      ],
      "relevance": "Impugned Act abolishing taluqdari tenures, vesting property in Government, providing compensation."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "299"
      ],
      "relevance": "Prohibits deprivation of property without law providing for public purpose and compensation; basis of challenge."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "133(1)(c)",
        "226",
        "31(6)",
        "31A",
        "31B",
        "Ninth Schedule"
      ],
      "relevance": "Basis for appeals, High Court applications; article 31B protects Ninth Schedule Acts from Part III challenges."
    },
    {
      "name": "Bombay Land Revenue Code",
      "sections": [],
      "relevance": "Taluqdari lands liable to land revenue thereunder."
    },
    {
      "name": "Land Acquisition Act",
      "sections": [],
      "relevance": "Compensation payable under section 14 for certain extinguished rights."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals against High Court judgment upholding validity of Bombay Taluqdari Tenure Abolition Act, 1949 dismissed; Act protected by article 31B and Ninth Schedule from challenge under section 299 GOI Act, 1935.",
    "relief_granted": null,
    "costs": "with costs"
  },
  "key_quotes": [
    {
      "text": "By the above amendment therefore and by specifically enumerating this Act in the Ninth Schedule, it appears to us to have been clearly and unequivocally intended that the provisions of this Act should be immune from attack of the kind put forward.",
      "speaker": "court",
      "significance": "Core reasoning on protection under article 31B."
    },
    {
      "text": "What article 31-B protects is not a mere contravention of the provisions of Part III of the Constitution but an attack on the grounds that the impugned Act is inconsistent with or takes away or abridges any of the rights conferred by any provisions of this Part.",
      "speaker": "court",
      "significance": "Explains broad scope of article 31B protection."
    },
    {
      "text": "The appeals must, therefore, be dismissed with costs.",
      "speaker": "court",
      "significance": "Final disposition."
    }
  ],
  "_case_id": "1954_163",
  "_label": 0,
  "_text_length": 11930,
  "_extracted_at": "2026-02-10T19:18:48.133820"
}