{
  "metadata": {
    "case_name": "Gurunath v. Respondents",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Mehr Chand Mahajan C.J."
    ],
    "case_number": "Civil Appeal No. 105 of 1953",
    "date_of_judgment": "1954-12-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dyamappa had two sons: Kalasappa and Krishtarao.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Krishtarao died in 1890, leaving surviving two widows Radhabai (senior widow) and Gangabai (junior widow) and a son Dattatraya.",
      "type": "material",
      "date": "1890",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Dattatraya died in 1913 leaving surviving a widow Sundarabai and a son Jagannath.",
      "type": "material",
      "date": "1913",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Sundarabai died shortly after her husband Dattatraya in 1913.",
      "type": "material",
      "date": "1913",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Jagannath died in 1914.",
      "type": "material",
      "date": "1914",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Gangabai adopted Gurunath (plaintiff/appellant) in 1943.",
      "type": "disputed",
      "date": "1943",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Factum of adoption upheld by trial court.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Suit instituted by appellant on 15th March 1944 in forma pauperis for possession of adoptive father's properties comprised in the suit and declaration regarding compensation money payable to plaintiff's family for land acquired by Hubli Municipality.",
      "type": "procedural",
      "date": "1944-03-15",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Defendants are sons and grandsons of Kalasappa (first cousin of Krishtarao) and disputed the adoption on ground that Gangabai's power extinguished when Dattatraya died leaving widow Sundarabai and son Jagannath.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Gangabai in written statement supported plaintiff's claim and asserted senior widow Radhabai gave consent to adoption.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Trial court (Civil Judge, Senior Division, Hubli, Special Suit No. 56 of 1944) decreed on 30th July 1946: upheld factum of adoption but held Radhabai did not give consent and Gangabai's power extinguished; dismissed suit.",
      "type": "procedural",
      "date": "1946-07-30",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court of Bombay in Appeal No. 274 of 1948 judgment dated 2nd September 1949 affirmed trial court: Gangabai's power ended when son died leaving son and widow; no finding on Radhabai's consent.",
      "type": "procedural",
      "date": "1949-09-02",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appeal to Supreme Court by special leave granted on 24th September 1951, in forma pauperis.",
      "type": "procedural",
      "date": "1951-09-24",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a widow can exercise a power of adoption conferred on her or possessed by her at any time during her life irrespective of any devolution of property or changes in the family or other circumstances and even after a grandson has come on the scene but has subsequently died without leaving a widow or a son.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Hindu Shastric Law itself sets no limit to the exercise of the widow's power of adoption once she has acquired that power or is possessed of it, and the power can be exercised by her during her lifetime when necessity arises for the purpose of continuing the line of her husband.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "Hindu Shastric Law"
    },
    {
      "id": "pa2",
      "text": "Power suspended during son's lifetime revives on son dying sonless and unmarried; logically revives when son, his widow, grandson and his widow all die out; substitution for spiritual reasons essence, devolution of property accessory.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Amarendra Mansingh v. Sanatan (1933)"
    },
    {
      "id": "pa3",
      "text": "Rule in Amarendra's case has no application; on death of grandson widow's power revives; cites Bapuji v. Gangaram (Nagpur HC) and Prem Jagat Kuer v. Harihar Bakhsh Singh (Lucknow).",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "High Court decisions"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Though Hindu Shastric Law sets no limit, judicially recognised that power is not unlimited and absolute; comes to an end when another heir has come on the scene and passed on duty of continuing the line.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Privy Council decisions"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Reviews Privy Council decisions: Bhoobun Moyee v. Ram Kishore (1876), Padma Coomari v. Court of Wards (1878) - power incapable when son leaves widow; Thayammal (1887), Tarachurn (1889); Bombay FB Ramkrishna v. Shamrao (1902) - power extinguished if son leaves son or widow; approved in Madana Mohana (1918).",
      "addresses_issue": "i1",
      "key_observation": "Power ends upon vesting in son's widow."
    },
    {
      "id": "cr2",
      "text": "Amarendra Mansingh (1933): Stress on spiritual duty; interposition of grandson or son's widow ends power; mere birth of son does not; not based on property vesting; power revives only if son dies sonless unmarried before competence.",
      "addresses_issue": "i1",
      "key_observation": "Duty passed to grandson ends grandmother's power permanently."
    },
    {
      "id": "cr3",
      "text": "Rule affirmed in Vijaysingji, Anant Bhikappa; accepted in Shrinivas Krishnarao (SC); part of Hindu law for 75 years; courts can interpret on justice, equity; no grounds to depart.",
      "addresses_issue": "i1",
      "key_observation": "Too late to remove limits on widow's power."
    },
    {
      "id": "cr4",
      "text": "Rejects revival argument: Once duty passed to grandson/son's widow, power gone forever; misapprehends Amarendra; Bapuji v. Gangaram erroneous; Prem Jagat follows it wrongly.",
      "addresses_issue": "i1",
      "key_observation": "Power cannot revive after interposition."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Widow's power to adopt comes to an end by the interposition of a grandson or the son's widow competent to continue the line by adoption; cannot revive thereafter.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Plaintiff's adoption by Gangabai invalid as her power extinguished in 1913 when Dattatraya died leaving son and widow.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bhoobun Moyee v. Ram Kishore",
      "citation": "1865 10 M.I.A. 279",
      "treatment": "followed",
      "relevance": "Power incapable when son leaves married widow as heir."
    },
    {
      "case_name": "Padma Coomari v. Court of Wards",
      "citation": "1881 L.R. 8 I.A. 229",
      "treatment": "followed",
      "relevance": "Power ends on vesting in son's widow; cannot divest her estate."
    },
    {
      "case_name": "Thayammal and Kuttiswami Aiyan v. Venkatarama Aiyan",
      "citation": "1887 L.R. 14 I.A. 67",
      "treatment": "followed",
      "relevance": "Affirms limits on widow's power."
    },
    {
      "case_name": "Tarachurn v. Suresh Chunder",
      "citation": "1889 L.R. 16 I.A. 166",
      "treatment": "followed",
      "relevance": "Affirms limits on widow's power."
    },
    {
      "case_name": "Ramkrishna Ramchandra v. Shamrao",
      "citation": "1902 I.L.R. 26 Bom. 526 (FB)",
      "treatment": "followed",
      "relevance": "Power extinguished if son leaves son or widow; cannot revive."
    },
    {
      "case_name": "Madana Mohana v. Purushothama Deo",
      "citation": "1918 L.R. 45 I.A. 150",
      "treatment": "followed",
      "relevance": "Approves Bombay FB principle."
    },
    {
      "case_name": "Amarendra Mansingh v. Sanatan",
      "citation": "1933 L.R. 60 I.A. 242",
      "treatment": "followed",
      "relevance": "Interposition of grandson/son's widow ends power; spiritual duty basis; revives only if son dies incompetent sonless."
    },
    {
      "case_name": "Vijaysingji v. Shivsangji",
      "citation": "1935 L.R. 62 I.A. 161",
      "treatment": "followed",
      "relevance": "Applies Amarendra rule."
    },
    {
      "case_name": "Anant Bhikappa Patil v. Shankar Ramchandra Patil",
      "citation": "1943 L.R. 70 I.A. 232",
      "treatment": "followed",
      "relevance": "Reaffirms limitations on widow's power."
    },
    {
      "case_name": "Shrinivas Krishnarao Kango v. Narayan Devji Kango",
      "citation": "1955 1 S.C.R. 1",
      "treatment": "referred",
      "relevance": "Accepts proposition from Anant Bhikappa."
    },
    {
      "case_name": "Bapuji v. Gangaram",
      "citation": "1941 I.L.R. Nagpur 178",
      "treatment": "distinguished",
      "relevance": "Erroneous; wrongly interprets Amarendra to allow revival on son's widow remarriage."
    },
    {
      "case_name": "Prem Jagat Kuer v. Harihar Bakhsh Singh",
      "citation": "1945 I.L.R. 21 Luck. 1",
      "treatment": "distinguished",
      "relevance": "Follows erroneous Nagpur decision; misapprehends Privy Council approval."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court affirms High Court and trial court; holds Gangabai's power to adopt extinguished in 1913; plaintiff's adoption invalid; suit for possession dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the power is not an unlimited and absolute one, and that it comes to an end when another heir has come on the scene and he has passed on to another the duty of continuing the line.",
      "speaker": "court",
      "significance": "Summarises respondent's position and judicial recognition."
    },
    {
      "text": "the validity of an adoption is to be determined by spiritual rather than temporal considerations that the substitution of a son of the deceased for spiritual reasons is the essence of the thing, and the consequent devolution of property a mere accessory to it.",
      "speaker": "court",
      "significance": "From Amarendra; crux of spiritual basis but limits still apply."
    },
    {
      "text": "where the duty of providing for the continuance of the line for spiritual purposes which was upon the father, and was laid by him conditionally upon the mother, has been assumed by the son and by him passed on to a grandson or to the son's widow, the mother's power is gone.",
      "speaker": "court",
      "significance": "True reason for rule; no revival."
    },
    {
      "text": "it is too late in the day to say that there are no limitations of any kind on the widow's power to adopt excepting those that limit the power of her husband to adopt.",
      "speaker": "court",
      "significance": "Court declines to depart from settled rule."
    }
  ],
  "_case_id": "1954_72",
  "_label": 0,
  "_text_length": 26868,
  "_extracted_at": "2026-02-10T19:18:17.775065"
}