{
  "metadata": {
    "case_name": "Gopal Singh and Sardar Singh v. Mst. Biro and her sons",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "BOSE J."
    ],
    "case_number": "Civil Appeal No. 174 of 1952",
    "date_of_judgment": "1954-04-02"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Harnam Singh owned the property in dispute and died before 2nd November 1914.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 2nd November 1914, after Harnam Singh's death, his daughter Mst. Biro (second defendant) gifted the plaint properties to her sons (grouped as first defendant).",
      "type": "material",
      "date": "1914-11-02",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Property in suit consisted of: 1) 253 bighas of Khas land; 2) a half share in 3 bighas 19 biswas; 3) a share in certain shamlat property.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Defendants claimed Harnam Singh gifted 123 bighas of the Khas land absolutely to Mst. Biro.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "A house was not included in the gift by Mst. Biro to her sons.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Description of the house: tiny dwelling, distance between door of Sabbat and Darwaja about two karams (eleven feet), one Jhallani opening into Sabbat, no other roofed portion except compound for cattle; lived in by Mst. Biro and her three sons.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Harnam Singh had mortgaged a part of his estate and placed mortgagees in possession; after his death, some collaterals took possession of unencumbered portion.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Mst. Biro instituted two suits: one for possession against collaterals (including present plaintiffs or predecessors), and one for declaration against mortgagees, joining collaterals; succeeded on ground that property was not ancestral (Exhibits DD and DF).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Trial Court (Sub-Judge 1st Class, Mansa, 10th August 1948): held property not ancestral on admission of plaintiffs' counsel; daughters' sons succeed after her to exclusion of plaintiffs; gift accelerated estate; dismissed suit.",
      "type": "procedural",
      "date": "1948-08-10",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Lower Appellate Court (Additional District Judge, Bhatinda, 21st September 1949): upheld not ancestral (not contested); house not included in gift, so decreed plaintiffs' claim for that part.",
      "type": "procedural",
      "date": "1949-09-21",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court (Patiala and East Punjab States Union, 27th June 1950): upheld not ancestral (conceded); house not included but small part, retention does not indicate intention not to efface herself; plaintiffs collaterals in fifth degree; property not ancestral so daughters' sons nearest heirs; gift accelerated estate despite house exclusion; reversed lower appellate, restored trial court decree.",
      "type": "procedural",
      "date": "1950-06-27",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Supreme Court: plaintiffs' counsel tried to reopen not ancestral finding but not allowed as mixed question of law and fact conceded in lower courts; res judicata from prior suits.",
      "type": "procedural",
      "date": "1954-04-02",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Parties are agricultural Jats governed by Punjab custom.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Plaintiffs are collaterals of the fifth degree (per High Court), claimed as seventh by defendants.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the property was ancestral (conceded as not by all courts).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Under Punjab custom for agricultural Jats, whether daughter's sons exclude father's collaterals as heirs to non-ancestral property after daughter.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the gift by daughter Mst. Biro to her sons operated as surrender/acceleration of her estate, despite retention of a small house.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Property is ancestral; daughter got only life estate; gift will not affect reversionary rights of plaintiffs as presumptive reversioners.",
      "supporting_facts": [
        "f2",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Tried to reopen finding that property not ancestral.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "No acceleration/surrender because house not included in gift to sons.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Paragraph 64 of Rattigan's Digest (no female can permanently alienate)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "According to customary law, collaterals beyond fifth degree not heirs in presence of daughter and her line; plaintiffs seventh degree.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Property was not ancestral; plaintiffs cannot challenge daughter's alienation.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Harnam Singh gifted 123 bighas absolutely to Mst. Biro.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Not ancestral conceded in all courts; mixed question of law and fact; res judicata from prior suits (Exhibits DD, DF).",
      "addresses_issue": "i1",
      "key_observation": "Whole land in dispute not ancestral."
    },
    {
      "id": "cr2",
      "text": "Under Punjab custom (Rattigan para 23(2), Roe and Rattigan p.61): daughter preferred to collaterals for acquired property but as limited heir; succeeds merely to pass to her male issue; her sons exclude collaterals.",
      "addresses_issue": "i2",
      "key_observation": "Sons take as if descent in male line; supported by Lehna v. Mst. Thakri and Lal Singh v. Roor Singh."
    },
    {
      "id": "cr3",
      "text": "Gift to sons was acceleration/surrender; retention of tiny house (small part of 253 bighas) does not invalidate as omission due to oversight; intention to efface completely shown by gifting absolute portion too.",
      "addresses_issue": "i3",
      "key_observation": "Mulla's Hindu Law p.217: omission of small portion does not affect bona fide surrender."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Property not ancestral.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Daughter's sons exclude father's collaterals under custom for non-ancestral property.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Gift operated to accelerate succession to sons despite house retention.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Plaintiffs no longer reversioners.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Lehna v. Mst. Thakri",
      "citation": "32 Punjab Record 1895",
      "treatment": "followed",
      "relevance": "Daughters' sons and descendants exclude collaterals even for ancestral property (Full Bench, Punjab Chief Court)."
    },
    {
      "case_name": "Lal Singh v. Roor Singh",
      "citation": "55 Punjab Law Reporter 168 at 172",
      "treatment": "followed",
      "relevance": "For non-ancestral property, daughters preferred to collaterals; sons exclude collaterals."
    }
  ],
  "statutes_cited": [
    {
      "name": "Rattigan's Digest of Customary Law",
      "sections": [
        "Paragraph 23(2)",
        "Paragraph 64"
      ],
      "relevance": "Daughter preferred for acquired property but limited; no permanent alienation by female."
    },
    {
      "name": "Roe and Rattigan's Tribal Law of the Punjab",
      "sections": [
        "Page 61"
      ],
      "relevance": "Daughter succeeds as means to pass to her sons; limited like widow."
    },
    {
      "name": "Mulla's Hindu Law",
      "sections": [
        "11th edition, page 217"
      ],
      "relevance": "Omission of small portion does not affect validity of bona fide surrender."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court judgment, restoring trial court decree dismissing plaintiffs' suit for declaration that gift does not affect their reversionary rights; gift accelerated estate to sons under custom.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Where a succession of a married daughter is allowed, the general principle is that she succeeds not as an ordinary heir, but merely as the means of passing on the property to another male...\"",
      "speaker": "court",
      "significance": "Explains limited nature of daughter's estate under Punjab custom."
    },
    {
      "text": "\"But the omission, due to ignorance or to oversight, of a small portion of the whole property does not affect the validity of the surrender when it is otherwise bona fide.\"",
      "speaker": "court",
      "significance": "Justifies acceleration despite house retention (from Mulla's Hindu Law)."
    },
    {
      "text": "\"The gift operated [to] accelerate the succession.\"",
      "speaker": "court",
      "significance": "Core holding on effect of gift to sons."
    }
  ],
  "_case_id": "1954_154",
  "_label": 0,
  "_text_length": 11188,
  "_extracted_at": "2026-02-08T22:15:10.726394"
}