{
  "metadata": {
    "case_name": "Appellants (Private Bus Operators) v. State of U.P.",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "MUKHERJEE J."
    ],
    "case_number": "Civil Appeals Nos. 182 and 183 of 1954",
    "date_of_judgment": "1954-10-13"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants and others have been carrying on the business of plying motor vehicles as stage carriages on hire on the Bulandshahr-Delhi route for a number of years past.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Running of vehicles regulated by Motor Vehicles Act of 1939, providing for permits by Regional Transport Authorities; Section 42(3) exempts transport vehicles owned by or on behalf of Provincial Government from permits unless connected with Indian State Railway business.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "After 1947, Government of U.P. conceived idea of running own buses; first as competitors, later to exclude private operators and establish complete State monopoly using Motor Vehicles Act provisions.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Transport Authorities began cancelling permits of private operators and refusing new permits in furtherance of State policy.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Private bus owners filed petitions under Article 226 in Allahabad High Court against illegal use of Motor Vehicles Act by U.P. Government.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Full Bench of Allahabad High Court (five judges, four judgments) held: State cannot discriminate under Section 42(3); sub-section exempting State buses conflicts with Article 14; nationalisation impossible by executive order without legislation justifiable under Article 19(6). Directed authorities to process permits without State monopoly consideration.",
      "type": "procedural",
      "date": "1953-11-17",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "U.P. Road Transport Act (Act II of 1951) passed, became law on 10th February 1951, to provide for State Road Transport Services.",
      "type": "material",
      "date": "1951-02-10",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Preamble: Expedient in interest of general public and for promotion of suitable and efficient road transport to provide for State Road Transport Services in Uttar Pradesh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Section 3: State Government may declare road transport services exclusively by State, or in conjunction with railway, or partly by State and others.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Notification dated 25th March 1953: Declared stage carriage services on Bulandshahr-Delhi route inter alia to be run exclusively by State Government.",
      "type": "material",
      "date": "1953-03-25",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Notification dated 7th April 1953: Set out scheme for operation of State carriage services on these routes.",
      "type": "material",
      "date": "1953-04-07",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Two appellants and 106 other private bus owners filed writ petitions under Article 226 before Allahabad High Court for mandamus directing U.P. Government and authorities not to interfere with their operations and to refrain from State service except per Motor Vehicles Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Division Bench (Mukherji and Chaturvedi JJ.) dismissed writs by judgments dated 17th November 1953; certificates granted for appeal to Supreme Court.",
      "type": "procedural",
      "date": "1953-11-17",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the U.P. Road Transport Act, 1951 violates fundamental right under Article 19(1)(g) and is not saved by Article 19(6) as it stood at enactment.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Act deprives appellants of property/interest in commercial undertaking without compensation, violating Article 31(2).",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the Act is discriminatory, violating Article 14.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the Act violates freedom of trade, commerce and intercourse under Article 301.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Right to carry on occupation, trade or business guaranteed by Article 19(1)(g); appellants carrying business of plying buses until now; Act prevents pursuit, conflicts with Article 19(1)(g).",
      "supporting_facts": [
        "f1",
        "f3",
        "f12"
      ],
      "legal_basis": "Article 19(1)(g)"
    },
    {
      "id": "pa2",
      "text": "Beneficial interest in commercial undertaking is property under Article 31(2); Act does not conform to requirements.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Article 31(2)"
    },
    {
      "id": "pa3",
      "text": "Right to use public highway for trade is easement, hence property; deprivation by Act.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Act discriminatory under Article 14: discriminates in favour of State against private individuals; unfettered discretion to associate persons in transport business.",
      "supporting_facts": [
        "f3",
        "f10"
      ],
      "legal_basis": "Article 14"
    },
    {
      "id": "pa5",
      "text": "Violates Article 301 guarantee of freedom of inter-State and intra-State trade.",
      "supporting_facts": [
        "f1",
        "f10"
      ],
      "legal_basis": "Article 301"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No legal right to ply buses on public road beyond passing and repassing; rights created by State legislation (permits), can be deprived by State legislation; no conflict with Article 19(1)(g).",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "User for trade is special/extraordinary, requiring State sanction; State as owner of highways can prohibit or condition.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "American cases: Packard v. Banton, Frost v. Railroad Commission, Stephenson v. Binford"
    },
    {
      "id": "ra3",
      "text": "Creation of State monopoly justifiable as reasonable restriction under Article 19(6) in interests of general public for efficient transport.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Article 19(6); Cooverjee v. Excise Commissioner"
    },
    {
      "id": "ra4",
      "text": "No acquisition of petitioners' right; State always had equal right; mere prohibition, not deprivation attracting Article 31(2).",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Article 31(1)"
    },
    {
      "id": "ra5",
      "text": "Article 301 concerns trade as whole/passage of commodities/persons, not individual rights (covered by Article 19(1)(g)).",
      "supporting_facts": null,
      "legal_basis": "Article 301"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Public highway (Grand Trunk Road) dedicated for passage; right extends to vehicular traffic including modern motor vehicles as incident of public right, anterior to Motor Vehicles Act; State regulates but does not create right; applies to trade/business.",
      "addresses_issue": "i1",
      "key_observation": "Right to ply motor vehicles for business on public road exists independently of permits; Article 19(1)(g) attracted."
    },
    {
      "id": "cr2",
      "text": "Act excludes private operators, prima facie infraction of Article 19(1)(g); 'restriction' in Article 19(6) normally implies continued existence, not total prohibition; even if includes prohibition, not reasonable here: no materials showing conducive to public welfare; immediate effect deprives hundreds of livelihood without compensation.",
      "addresses_issue": "i1",
      "key_observation": "State monopoly not per se reasonable; no evidence of benefits or prevailing conditions justifying; violates Article 19(1)(g) not saved by pre-1951 Article 19(6)."
    },
    {
      "id": "cr3",
      "text": "Prohibition deprives interest in commercial undertaking (property); not mere regulation but acquisition equivalent; Articles 31(1) and (2) read together.",
      "addresses_issue": "i2",
      "key_observation": "Deprivation without compensation violates Article 31(2)."
    },
    {
      "id": "cr4",
      "text": "Classification inherent in State monopoly rational; State as trader differentiated legitimately in welfare state; Section 3 discretion guided by Motor Vehicles Act permits process.",
      "addresses_issue": "i3",
      "key_observation": "No violation of Article 14."
    },
    {
      "id": "cr5",
      "text": "Declined to decide Article 301 issue as unnecessary; indicated arguments possible (individual rights included, no prior Presidential sanction under Article 304(b)).",
      "addresses_issue": "i4",
      "key_observation": "Unnecessary to decide."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "U.P. Road Transport Act, 1951 void under Article 13(2) as violates Article 19(1)(g), not protected by Article 19(6) as stood at enactment.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Act conflicts with Article 31(2) by depriving property without compensation.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Act does not violate Article 14.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "A.K. Gopalan v. The State",
      "citation": "1950 S.C.R. 88",
      "treatment": "referred",
      "relevance": "Distinction between restriction and deprivation; Article 19 presupposes substratum of personal freedom."
    },
    {
      "case_name": "Cooverjee B. Bharucha v. Excise Commissioner",
      "citation": "1954 S.C.R. 873",
      "treatment": "distinguished",
      "relevance": "Reasonableness depends on nature of trade; general observations on prohibition not applicable to non-injurious trade."
    },
    {
      "case_name": "State of West Bengal v. Subodh Gopal Bose",
      "citation": "1954 S.C.R. 587",
      "treatment": "followed",
      "relevance": "Articles 31(1) and (2) read together; deprivation means acquisition."
    },
    {
      "case_name": "Dwarkadas Shrinivas v. Sholapur Spinning and Weaving Co. Ltd.",
      "citation": "1954 S.C.R. 674",
      "treatment": "followed",
      "relevance": "Articles 31(1) and (2) not mutually exclusive."
    },
    {
      "case_name": "Motilal v. Uttar Pradesh Government",
      "citation": "I.L.R. 1951 All. 257",
      "treatment": "referred",
      "relevance": "Rejected American extraordinary use doctrine."
    },
    {
      "case_name": "C.S.S. Motor Service v. State of Madras",
      "citation": "1952 2 M.L.J. 894",
      "treatment": "followed",
      "relevance": "Public right to use highways for transport business; no franchise doctrine in India."
    },
    {
      "case_name": "Commonwealth of Australia v. Bank of New South Wales",
      "citation": "1950 A.C. 235",
      "treatment": "referred",
      "relevance": "State monopoly judged on facts; Section 92 includes individual rights."
    },
    {
      "case_name": "Packard v. Banton",
      "citation": "264 U.S. 140",
      "treatment": "distinguished",
      "relevance": "American view of extraordinary use rejected for India."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14",
        "Article 19(1)(g)",
        "Article 19(6)",
        "Article 31(1)",
        "Article 31(2)",
        "Article 301",
        "Article 302",
        "Article 304(b)",
        "Article 226",
        "Article 132(1)"
      ],
      "relevance": "Act held void for violating Articles 19(1)(g) and 31(2); no violation of 14; Article 301 undecided."
    },
    {
      "name": "Motor Vehicles Act, 1939",
      "sections": [
        "Section 42(3)"
      ],
      "relevance": "Exempts State vehicles; used discriminatorily pre-Act; permits process guides discretion."
    },
    {
      "name": "U.P. Road Transport Act, 1951 (Act II of 1951)",
      "sections": [
        "Section 2",
        "Section 3",
        "Section 4",
        "Section 5",
        "Section 7",
        "Section 8",
        "Section 9",
        "Section 10",
        "Section 12"
      ],
      "relevance": "Impugned Act creating State monopoly; held unconstitutional."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; High Court judgment set aside; writ of mandamus issued restraining respondents from enforcing U.P. State Road Transport Act, 1951 against appellants or their men.",
    "relief_granted": "Writ in nature of mandamus restraining enforcement of the Act.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The true position then is, that all public streets and roads vest in the State, but that the State holds them as trustees on behalf of the public. The members of the public are entitled as beneficiaries to use them as a matter of right...\"",
      "speaker": "court",
      "significance": "Defines public right to use highways for transport business under Article 19(1)(g)."
    },
    {
      "text": "\"...the legislation in question which violates the fundamental right of the appellants under article 19(1)(g) of the Constitution and is not shown to be protected by clause (6) of the article, as it stood at the time of the enactment, must be held to be void under article 13(2) of the Constitution.\"",
      "speaker": "court",
      "significance": "Core holding on invalidity under Article 19."
    },
    {
      "text": "\"...in these circumstances the legislation does conflict with the provision of article 31(2) of the Constitution and as the requirements of that clause have not been complied with, it should be held to be invalid on that ground.\"",
      "speaker": "court",
      "significance": "Holding on Article 31(2) violation."
    }
  ],
  "_case_id": "1954_175",
  "_label": 1,
  "_text_length": 56331,
  "_extracted_at": "2026-02-08T22:15:52.026353"
}