{
  "metadata": {
    "case_name": "Petition No. 55 of 1954",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "JAGANNADHADAS J."
    ],
    "case_number": "Petition No. 55 of 1954",
    "date_of_judgment": "1954-04-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner No. 1 was an Agricultural Demonstrator of the Government of Madras and was employed as an Assistant Marketing Officer in Central Provinces and Berar for the purchase and movement of blackgram and other grains on behalf of the Madras Government.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Petitioner No. 1, second petitioner and 44 others are under prosecution before Shri K. E. Pandey, a Special Magistrate of Nagpur, Madhya Pradesh, in Case No. I of 1949.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Prosecution charges: cheating, attempt to commit cheating, criminal breach of trust and criminal conspiracy, i.e., offences punishable under section 420 read with section 120-B or 109 of the Indian Penal Code, section 409 and section 409 read with section 120-B of the Indian Penal Code.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Allegation: by reason of the acts committed by the accused, the Government of Madras had to incur an expenditure of Rs. 3,57,147-10-0 in excess of the amount due.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Special Magistrate appointed by the Madhya Pradesh Government under section 14 of the Criminal Procedure Code.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Prosecution against first petitioner initiated by sanction given by the Government of Madras under section 197(1) of the Criminal Procedure Code.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Trial has not yet commenced.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Shri K. L. Pandey who was first appointed as a Special Magistrate for the trial of the case, and to whose file on such appointment this case was transferred, was later on appointed as acting Sessions Judge for some time and ceased to have this case before him. He reverted back from his position as acting Sessions Judge to his original post.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Questions raised before the High Court at previous stages by means of applications under article 226 and decided against. No appeals to this Court have been taken against the orders therein.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Section 14 of the Criminal Procedure Code, in so far as it authorises the Provincial Government to confer upon any person all or any of the powers conferred or conferrable by or under the Code on a Magistrate of the first, second or third class in respect of particular cases and thereby to constitute a Special Magistrate for the trial of an individual case, violates the guarantee under article 14 of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "The sanction given under section 197(1) of the Criminal Procedure Code for the prosecution as against the first petitioner is invalid, inasmuch as the order of the Madras Government granting the sanction does not disclose that all the facts constituting the offences to be charged were placed before the sanctioning authority nor does the sanction state the time or place of the occurrence or the transactions involved in it, or the persons with whom the offences were committed.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Even if the sanction under section 197(1) of the Criminal Procedure Code is valid, it is for the very Government which accords the sanction to specify also the Court before which the trial is to be held under section 197(2) and in the absence of any such specification by the said Government, the power under section 14 of the Criminal Procedure Code of appointing a Special Magistrate for the trial of the case cannot be exercised by the Madhya Pradesh Government.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Without a fresh notification appointing Shri K. L. Pandey as Special Magistrate and transferring the case to him as such, after he reverted from acting Sessions Judge, he cannot be said to be seized of this case as Special Magistrate.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Section 14 CrPC violates Art.14, relying on Anwar Ali Sarkar's case.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Article 14 of the Constitution; Anwar Ali Sarkar's case (1952 S.C.R. 284)"
    },
    {
      "id": "pa2",
      "text": "Sanction under s.197(1) CrPC invalid as it does not disclose all facts constituting offences, time, place, transactions or persons involved, relying on Gokulchand Dwarkadas Morarka v. The King.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Section 197(1) CrPC; Gokulchand Dwarkadas Morarka v. The King (A.I.R. 1948 P.C. 82)"
    },
    {
      "id": "pa3",
      "text": "Government sanctioning under s.197(1) must specify court under s.197(2); absence implies no special court, so MP Govt cannot appoint under s.14. Dual exercise contrary to policy of protecting public servant.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Section 197(2) CrPC; Section 14 CrPC"
    },
    {
      "id": "pa4",
      "text": "No fresh notification for Shri K. L. Pandey after reverting from acting Sessions Judge.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 14 CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Anwar Ali Sarkar does not apply as Special Magistrate tries under normal procedure, no discrimination.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Article 14; Anwar Ali Sarkar's case"
    },
    {
      "id": "ra2",
      "text": "Trial not commenced; lacunas in sanction can be remedied by evidence at trial. Evidence on facts before sanctioning authority will be given.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Section 197(1) CrPC; Gokulchand case"
    },
    {
      "id": "ra3",
      "text": "S.197(2) power permissive and relates to Court, not person; s.14 relates to person functioning in Court. No exclusion of s.14.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Section 197(2) CrPC; Section 14 CrPC"
    },
    {
      "id": "ra4",
      "text": "Prepared to advise Government to issue necessary notification and transfer case to Shri K. L. Pandey.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Anwar Ali Sarkar applies only where special procedure prejudices; here Special Magistrate uses normal procedure, no discrimination. Law vesting discretion not discriminatory.",
      "addresses_issue": "i1",
      "key_observation": "No discrimination of the kind contemplated by Anwar Ali Sarkar."
    },
    {
      "id": "cr2",
      "text": "Trial not commenced; Privy Council in Gokulchand recognises lacunas can be remedied by evidence at trial. State will give such evidence. Unnecessary to decide validity now.",
      "addresses_issue": "i2",
      "key_observation": "Lacunas, if any, can be remedied in the course of the trial."
    },
    {
      "id": "cr3",
      "text": "S.197(2) permissive power to specify Court (not person); non-exercise has no implication excluding s.14. S.14 appoints person to function in Court. No substance in contention.",
      "addresses_issue": "i3",
      "key_observation": "The one relates to the Court and the other to the Person."
    },
    {
      "id": "cr4",
      "text": "Unnecessary to pronounce as State prepared to issue fresh notification and transfer case.",
      "addresses_issue": "i4",
      "key_observation": "In view of that statement, it is unnecessary to pronounce on the objection."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No violation of Article 14 by section 14 CrPC in this case.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Unnecessary to decide validity of sanction under s.197(1) as trial not commenced and can be remedied.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Madhya Pradesh Government can appoint Special Magistrate under s.14 even without specification of Court by Madras Government under s.197(2).",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "All points fail; petition dismissed.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Anwar Ali Sarkar's case",
      "citation": "1952 S.C.R. 284",
      "treatment": "followed",
      "relevance": "Distinguished; applies only to special procedure prejudicing accused, not here."
    },
    {
      "case_name": "Gokulchand Dwarkadas Morarka v. The King",
      "citation": "A.I.R. 1948 P.C. 82",
      "treatment": "referred",
      "relevance": "Recognises lacunas in sanction can be remedied by evidence at trial."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 14"
      ],
      "relevance": "Petition under Art.32; challenge to s.14 CrPC under Art.14."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "Section 14",
        "Section 197(1)",
        "Section 197(2)"
      ],
      "relevance": "Appointment of Special Magistrate; sanction for prosecution of public servant; specification of court."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 420",
        "Section 120-B",
        "Section 109",
        "Section 409"
      ],
      "relevance": "Offences charged: cheating, conspiracy, breach of trust."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "All points raised by petitioners challenging the validity of the prosecution and Special Magistrate's appointment fail. Petition under Article 32 dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "That decision, however, applies only to a case where on the allotment of an individual case to a special Court authorised to conduct the trial by a procedure substantially different from the normal procedure, discrimination arises...",
      "speaker": "court",
      "significance": "Distinguishes Anwar Ali Sarkar case on facts."
    },
    {
      "text": "The one relates to the Court and the other to the Person.",
      "speaker": "court",
      "significance": "Key distinction rejecting third contention on s.197(2) vs s.14."
    },
    {
      "text": "In the result, all the points raised on behalf of the petitioners fail, and this petition must be dismissed.",
      "speaker": "court",
      "significance": "Final disposition of the petition."
    }
  ],
  "_case_id": "1954_155",
  "_label": 0,
  "_text_length": 10513,
  "_extracted_at": "2026-02-10T19:18:52.473005"
}