{
  "metadata": {
    "case_name": "Istimrardar of Kharwa v. Chief Commissioner of Ajmer",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Mehr Chand Mahajan C.J.",
      "Mukherjea J.",
      "Vivian Bose J.",
      "Bhagwati J.",
      "Venkatarama Ayyar J.",
      "Das J.",
      "Jagannadhadas J."
    ],
    "case_number": "Civil Appeal No. 43 of 1954",
    "date_of_judgment": "1954-12-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is the Istimrardar of Kharwa.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant has held a cattle fair on his estate every year for some twenty years.",
      "type": "admitted",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "It is admitted that the land on which the fair is normally held belongs to the appellant.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 8-1-1951 the Chief Commissioner of Ajmer framed certain rules for the regulation of cattle and other fairs in the State of Ajmer under sections 40 and 41 of the Ajmer Laws Regulation of 1877.",
      "type": "material",
      "date": "1951-01-08",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "One of the rules required that persons desiring to hold fairs should obtain a permit from the District Magistrate.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant applied for a permit.",
      "type": "procedural",
      "date": "1952-07-09",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The permit was refused on the ground that no more permits were to be issued to private individuals. District Magistrate replied: 'It has been decided that as a matter of policy permits to hold fairs will be issued only to local bodies and not to private individuals.' Order dated 18-9-1952.",
      "type": "material",
      "date": "1952-09-18",
      "source": "district_magistrate"
    },
    {
      "id": "f8",
      "text": "The appellant applied under article 226 of the Constitution to the Judicial Commissioners Court at Ajmer for the issue of a writ directing the authorities concerned to permit the appellant to hold his fair as usual.",
      "type": "procedural",
      "date": "1952",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The learned Judicial Commissioner refused to issue the writ but granted leave to appeal under article 132(1) of the Constitution.",
      "type": "procedural",
      "date": "1952-11-22",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Leave confined to the vires of the Regulation and the bye-laws but allowed the appellant to attack the validity of the District Magistrate's action as well.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the rules promulgated by the Chief Commissioner were ultra vires sections 40 and 41 of the Ajmer Laws Regulation of 1877.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the regulation and the bye-laws framed thereunder amount to a reasonable restriction on the appellant's fundamental right to hold a cattle fair in his own land under Article 19(1)(f) and (g).",
      "framed_by": "lower_court"
    },
    {
      "id": "i3",
      "text": "Validity of the District Magistrate's action in refusing the permit.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Fundamental rights under the Constitution were infringed.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Articles 19(1)(f), 19(1)(g), 226"
    },
    {
      "id": "pa2",
      "text": "The rules promulgated by the Chief Commissioner were ultra vires the Regulation under which he purported to act.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Sections 40 and 41 of Ajmer Laws Regulation, 1877"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The rules travel beyond the Regulation in at least two respects: (1) The Regulation empowers the Chief Commissioner to make rules for the establishment of a system of conservancy and sanitation by bringing a system into existence and incorporating it in his rules; instead, rules leave it to the District Magistrate to determine what a proper system is, which is delegation ultra vires. (2) The fourth sub-rule empowers the District Magistrate to revoke any permit without assigning reasons or giving notice, which is absolute and arbitrary power ultra vires.",
      "addresses_issue": "i1",
      "key_observation": "The Regulation assumes the right of persons to hold fairs and requires due regard for conservancy etc., via rules by Chief Commissioner, not arbitrary prohibition by DM."
    },
    {
      "id": "cr2",
      "text": "The District Magistrate's order prohibits the holding of the fair without aid of valid rules or law, hence bad. Covered by Tahir Hussain v. District Board, Muzafarnagar.",
      "addresses_issue": "i3",
      "key_observation": "DM has no power in himself to impose the ban without valid empowering law."
    },
    {
      "id": "cr3",
      "text": "The rules only authorise DM to satisfy himself on conservancy etc., and impose terms, but not reject on policy ground of issuing only to local bodies.",
      "addresses_issue": "i3",
      "key_observation": "Impugned order bad as rules do not authorise rejection on that ground."
    },
    {
      "id": "cr4",
      "text": "Rules purport to establish ad hoc control by DM through permits, which cannot be said to constitute a system of conservancy etc., hence not within intent of section 40.",
      "addresses_issue": "i1",
      "key_observation": "A system of ad hoc control requires explicit legislative grant."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The sub-rules of Rule I are ultra vires as they delegate to DM the power to make his own system of conservancy and allow arbitrary revocation.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "The District Magistrate's order dated 18-9-1952 is quashed as bad without valid rules.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Tahir Hussain v. District Board, Muzafarnagar",
      "citation": "A.I.R. 1954 S.C. 630",
      "treatment": "followed",
      "relevance": "Covers the matter where action without valid empowering law is bad."
    }
  ],
  "statutes_cited": [
    {
      "name": "Ajmer Laws Regulation, 1877",
      "sections": [
        "Section 40",
        "Section 41"
      ],
      "relevance": "Empowers Chief Commissioner to make rules on conservancy, sanitation, watch and ward at fairs, and penalties; rules held ultra vires these sections."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 19(1)(f)",
        "Article 19(1)(g)",
        "Article 19(5)",
        "Article 19(6)",
        "Article 132(1)",
        "Article 226"
      ],
      "relevance": "Fundamental right to hold fair on own land as property and occupation; restrictions must be reasonable; basis for writ and appeal."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, order of Judicial Commissioner set aside. Rules declared void to the extent indicated (sub-rules of Rule I), District Magistrate's order dated 18-9-1952 quashed. No order as to costs as point not taken in proper time.",
    "relief_granted": "Declaration that rules void in parts; quashing of DM order permitting appellant to hold fair.",
    "costs": "No order about costs."
  },
  "key_quotes": [
    {
      "text": "\"Therefore, the Chief Commissioner cannot by Rule invest the District Magistrate with the right arbitrarily to prohibit that which the law and the Constitution, not only allow, but guarantee.\"",
      "speaker": "court",
      "significance": "Core holding on ultra vires nature and protection of fundamental rights."
    },
    {
      "text": "\"It has been decided that as a matter of policy permits to hold fairs will be issued only to local bodies and not to private individuals.\"",
      "speaker": "district_magistrate",
      "significance": "Reason for refusal, held unauthorized by rules."
    },
    {
      "text": "\"The net effect of these rules is merely to establish a system of ad hoc control by the District Magistrate through the issue of a permit.\"",
      "speaker": "court",
      "significance": "Explains why rules exceed rule-making power under section 40."
    }
  ],
  "_case_id": "1954_70",
  "_label": 1,
  "_text_length": 10537,
  "_extracted_at": "2026-02-08T22:14:33.369240"
}