{
  "metadata": {
    "case_name": "Kunwar Rananjaya Singh v. Baijnath Singh",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "DAB J."
    ],
    "case_number": "Civil Appeal No. 73 of 1954",
    "date_of_judgment": "1954-09-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Kunwar Rananjaya Singh, son of Raja Bhagwan Bux Singh of Amethi, was the successful candidate at an election to the Uttar Pradesh Legislative Assembly from Amethi Central constituency.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Polling took place on 31st January 1952, result announced on 6th February 1952, published in Uttar Pradesh State Gazette on 26th February 1952.",
      "type": "procedural",
      "date": "1952-01-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Baijnath Singh, unsuccessful candidate (respondent No. 1), filed Election Petition No. 252 of 1952 challenging the election on grounds of corrupt practices: bribery, undue influence, false statements, concealment of expenses.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Appellant denied all charges in written statement and filed petition of recrimination challenging respondent's conduct.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Election Tribunal found against appellant on all 7 issues from recrimination petition and dismissed it.",
      "type": "procedural",
      "date": "1954-02-11",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Tribunal found in favour of appellant on issues 1,2,4,5,6,7 of main petition but against on issue No. 3: employment of more persons than authorised (20 Ziladars with peons/orderlies, Manager, Assistant Manager of Amethi estate) and concealed expenditures exceeding limit.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Tribunal held appellant guilty of corrupt practice under section 123(7) and minor corrupt practice under section 124(4), declared election void under section 100(2)(b) and 100(2)(a) read with section 145.",
      "type": "material",
      "date": "1954-02-11",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Amethi estate belonged to appellant's father; appellant looked after it as heir apparent on behalf of old and infirm proprietor.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Maximum election expense for single-member constituency in UP: Rs. 8,000 (Schedule V). Allowed persons: 1 election agent, 1 counting agent, 1 clerk, 1 messenger, plus extras per electors/polling booths (Schedule VI).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appeal by special leave against Tribunal's judgment dated 11th February 1954.",
      "type": "procedural",
      "date": "1954-02-11",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Did respondent No. 1 employ for election more persons than authorised by law? Did respondent No. 1 incur the expenditure shown in the list as heads of other concealed expenditures? Did he exceed the prescribed limit of expenditure for election?",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Whether servants of appellant's father's estate (Manager, Assistant Manager, 20 Ziladars, peons, orderlies) were employed for payment by the appellant or his agent, constituting corrupt practice under section 123(7)?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether excess expenditure was incurred or authorised by candidate or agent, and whether concealed in return under section 124(4)?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Denied each and every charge of corrupt practices; filed recrimination challenging respondent's conduct.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Servants were employed and paid by father, not by appellant; they were volunteers assisting at father's request.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Section 123(7) requires employment/incurring by candidate or agent; cited Joseph Forster Wilson v. Sir Christopher Furness"
    },
    {
      "id": "pa3",
      "text": "No excess expenditure incurred or authorised by appellant; no concealment.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Sections 123(7), 124(4)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant employed extra persons (20 Ziladars with peons/orderlies, Manager, Asst Manager) exceeding Schedule VI limits; their salaries as election expenses exceed Rs. 8,000 limit.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Section 77, Rules 117,118, Schedules V,VI; Section 123(7)"
    },
    {
      "id": "ra2",
      "text": "Servants of estate were virtually appellant's own as he managed estate.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Section 77 covers excess persons employed for payment regardless of who employed them.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Section 77"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Tribunal erroneously held estate servants were appellant's; they were father's employees, paid by father, assisted son at father's request like volunteers on holiday with full pay.",
      "addresses_issue": "i2",
      "key_observation": "Extra persons employed and paid by father, not appellant or agent."
    },
    {
      "id": "cr2",
      "text": "Section 123(7) requires excess employment/expenditure by candidate or agent; rules 117,118 follow this language; section 77 read consonant with it.",
      "addresses_issue": "i1",
      "key_observation": "Gist of corrupt practice is action by candidate/agent."
    },
    {
      "id": "cr3",
      "text": "No corrupt practice under 123(7), hence no minor corrupt practice under 124(4) for concealment.",
      "addresses_issue": "i3",
      "key_observation": "No excess expenditure by appellant."
    },
    {
      "id": "cr4",
      "text": "Spirit of law cannot override plain language; if disadvantageous to poor candidates, appeal to Parliament.",
      "addresses_issue": "i1",
      "key_observation": "Construed per ordinary grammatical meaning."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant not guilty of corrupt practice under section 123(7) as persons not employed/paid by him or agent.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No minor corrupt practice under section 124(4); election not void.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Joseph Forster Wilson and Another v. Sir Christopher Furness",
      "citation": "O'Malley and Hardcastle's Report of Election Cases, page 1 at page 6",
      "treatment": "followed",
      "relevance": "Observation apposite: employment must be by candidate; supports reading sections together."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "Section 77",
        "Section 100(2)(b)",
        "Section 145",
        "Section 123(7)",
        "Section 124(4)",
        "Section 100(2)(a)"
      ],
      "relevance": "Defines corrupt practices for excess employment/expenditure by candidate/agent; consequences for election validity and return."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; Tribunal's findings on corrupt practices under sections 123(7) and 124(4) set aside; election of appellant not void.",
    "relief_granted": "Election upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Section 123(7) clearly shows that in order to amount to a corrupt practice the excess expenditure must be incurred or authorised by a candidate or his agent and the employment of extra persons must likewise be by a candidate or his agent.\"",
      "speaker": "court",
      "significance": "Core interpretation limiting corrupt practice to candidate/agent actions."
    },
    {
      "text": "\"There can be no doubt that in the eye of the law these extra persons were in the employment of the father of the appellant and paid by the father and they were neither employed nor paid by the appellant.\"",
      "speaker": "court",
      "significance": "Key factual finding exonerating appellant."
    },
    {
      "text": "\"The spirit of the law may well be an elusive and unsafe guide and the supposed spirit can certainly not be given effect to in opposition to the plain language of the sections of the Act.\"",
      "speaker": "court",
      "significance": "Rejects policy-based override of statutory language."
    }
  ],
  "_case_id": "1954_107",
  "_label": 1,
  "_text_length": 12261,
  "_extracted_at": "2026-02-08T22:15:02.359062"
}