{
  "metadata": {
    "case_name": "Suleman Issa v. State of Bombay",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Gulam Hasan J."
    ],
    "case_number": "Criminal Appeal No. 67 of 1951",
    "date_of_judgment": "1954-03-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Suleman Issa, inhabitant of Natal in South Africa, left Durban in August 1947 by car for India to visit native place Sarsa in District Kaira, accompanied by Daud Hassam.",
      "type": "background",
      "date": "1947-08",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Travelled to Mombasa by car, took boat on August 30 to Colombo on September 1, flew to Madras on September 14, car shipped by steamer, arrived October 1 after paying Rs. 2,700 custom duty and Rs. 10,000 security deposit.",
      "type": "background",
      "date": "1947-08-30 to 1947-10-01",
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "Motored to Nardana on October 7 via Bangalore, Poona, Nasik, Dhulia; then train to Sarsa on October 8; car booked from Nardana to Anand, then driven to Sarsa.",
      "type": "background",
      "date": "1947-10-07 to 1947-10-08",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Senior Police Inspector Ratansing Kalusing Raol noticed car with Indian number in Nadiad, instructed watch; appellant ordered to appear before Sub-Inspector on October 12.",
      "type": "procedural",
      "date": "1947-10-12",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "On questioning, appellant stated family original inhabitants of Jamnagar State, business in Durban for 60 years; brother Daud Issa in Bombay; gave journey details, produced passports, custom receipts.",
      "type": "admitted",
      "date": "1947-10-12",
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "On October 15, Head Constable Ajit Singh informed Raol of unknown person (appellant) giving large quantity of gold to jeweller Umarbhai to melt; police seized gold from jeweller and brother's shop, total 27731 tolas worth Rs. 3 lakhs; seized car.",
      "type": "material",
      "date": "1947-10-15",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Proceedings under section 20 Indian Telegraph Act dropped as wireless set not transmitter; car examined, nothing incriminating; appellant detained under Public Securities Act, released.",
      "type": "procedural",
      "date": "1947-10-15 onwards",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Prosecuted on January 2, 1948 on complaint of Raol under section 61E Bombay District Police Act IV of 1890 read with section 109 IPC.",
      "type": "procedural",
      "date": "1948-01-02",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Sub-Divisional Magistrate convicted appellant on December 31, 1948, fined Rs. 100, confiscated gold under section 517 CrPC; acquitted others charged with abetment. Held circumstances led to reasonable belief gold stolen or fraudulently obtained.",
      "type": "procedural",
      "date": "1948-12-31",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Sessions Judge of Kaira acquitted appellant on May 7, 1949, set aside conviction and sentence, ordered gold restored; possession suspicious but not sufficient for reasonable belief.",
      "type": "procedural",
      "date": "1949-05-07",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court (Dixit and Chainani JJ.) on June 26, 1950 allowed State appeal, set aside acquittal, restored Magistrate's conviction and confiscation; rejected prosecution story of gold smuggled in car but held circumstances gave reason to believe stolen/fraudulently obtained; rejected appellant's explanation gold from father; held s.517 applicable as property produced before court.",
      "type": "procedural",
      "date": "1950-06-26",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellant stated family brought gold to Sarsa from time to time by father.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the court had jurisdiction under section 517 CrPC to order confiscation of the gold, and whether such order was appropriate in the circumstances.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the gold was produced before the court or in its custody, or regarding which any offence appears to have been committed, or used for commission of offence, for purposes of s.517 CrPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Concedes conviction under s.61E Bombay District Police Act was right, but s.517 CrPC had no application as gold sent to Treasury, never produced before court.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": "Section 517 CrPC"
    },
    {
      "id": "pa2",
      "text": "Even if jurisdiction existed, confiscation not proper order in circumstances.",
      "supporting_facts": [
        "f9",
        "f11"
      ],
      "legal_basis": "Section 517 CrPC"
    },
    {
      "id": "pa3",
      "text": "Gold from father's visits to Sarsa.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Gold brought into India by appellant in motor-car (rejected by High Court).",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Circumstances gave reason to believe gold stolen or fraudulently obtained.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": "Section 61E Bombay District Police Act"
    },
    {
      "id": "ra3",
      "text": "S.517 applicable as property produced before court; no need to find offence committed in respect of it.",
      "supporting_facts": [
        "f9",
        "f11"
      ],
      "legal_basis": "Section 517 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S.517 empowers disposal of property produced before court, in its custody, or regarding which offence appears committed, or used for offence; extends to confiscation but not mandatory.",
      "addresses_issue": "i1",
      "key_observation": "Power discretionary, not every case requires confiscation."
    },
    {
      "id": "cr2",
      "text": "Evidence unclear if gold produced before court (point not raised below); not property re offence or used for offence.",
      "addresses_issue": "i2",
      "key_observation": "Gold seized by police, sent to Treasury."
    },
    {
      "id": "cr3",
      "text": "Confiscation inappropriate for offence u/s 61E (max 3 months RI or Rs.100 fine); no substantive confiscation provision like Sea Customs Act; court could deliver to possessor.",
      "addresses_issue": "i1",
      "key_observation": "No evidence gold stolen/fraudulently obtained, mere belief; harsh for minor offence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Court has jurisdiction under s.517 but confiscation not appropriate here; set aside confiscation order.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bombay District Police Act, 1890",
      "sections": [
        "61E"
      ],
      "relevance": "Offence for possession/conveyance of suspected stolen/fraudulently obtained property without satisfactory account; conviction conceded."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "109"
      ],
      "relevance": "Abetment; others acquitted."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "517"
      ],
      "relevance": "Disposal of property; confiscation set aside as inappropriate."
    },
    {
      "name": "Indian Telegraph Act",
      "sections": [
        "20"
      ],
      "relevance": "Proceedings dropped."
    },
    {
      "name": "Sea Customs Act",
      "sections": [],
      "relevance": "Contrasted as having substantive confiscation provision."
    },
    {
      "name": "Public Securities Act",
      "sections": [],
      "relevance": "Detention and release."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal by special leave allowed to extent of setting aside High Court's restoration of confiscation order under s.517 CrPC; conviction under s.61E conceded and stands; gold not to be confiscated.",
    "relief_granted": "Confiscation order set aside",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Confiscation is not the only mode of disposal under section 517 and is singularly inappropriate in a case where the accused is prosecuted for an offence punishable with a maximum sentence of 3 months and a fine of Rs. 100.\"",
      "speaker": "court",
      "significance": "Core reason for setting aside confiscation."
    },
    {
      "text": "\"It is not every case in which the court must necessarily pass an order of confiscation irrespective of the circumstances of the case.\"",
      "speaker": "court",
      "significance": "Clarifies discretionary nature of s.517."
    }
  ],
  "_case_id": "1954_125",
  "_label": 1,
  "_text_length": 10823,
  "_extracted_at": "2026-02-08T22:15:02.903131"
}