{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Ayyar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was elected to the Legislative Assembly, Vindhya Pradesh, from Laundi Constituency.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Election Tribunal, Nowgong, set aside the appellant's election on grounds: (1) employed Government servants as polling agents, committing corrupt practice under Section 123(8) of Act 43 of 1951; (2) subsisting contracts between appellant and Vindhya Pradesh Government for printing electoral rolls, disqualifying under Section 17 of Act 49 of 1951.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Evidence of P.W. 5, if accepted, shows polling agent also did canvassing work for appellant.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "No finding by Tribunal on whether polling agent did canvassing work; decision rested merely on appointment of Government servants as polling agents.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Tribunal found contracts subsisting between appellant and Vindhya Pradesh Government for printing electoral rolls.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Exhibit A-4 is copy of letter sent by appellant to Secretary to the Chief Commissioner, Vindhya Pradesh, showing Vindhya Pradesh Government settled terms of contract and made payments thereunder.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether appointment of Government servant as polling agent per se constitutes corrupt practice under Section 123(8) of Act 43 of 1951, or requires canvassing work.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether contracts for printing electoral rolls were with Election Commission or with Vindhya Pradesh Government/Chief Commissioner, disqualifying appellant under Section 17 of Act 49 of 1951 read with Section 7(d) of Act 43 of 1951.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appointment of Government servant as polling agent does not per se fall within mischief of Section 123(8).",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Satya Dev Busheri v. Padam Dev (A and S.B.)"
    },
    {
      "id": "pa2",
      "text": "Contract for printing electoral rolls entered into with Election Commission, not State or Union Government.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Article 324 of the Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Evidence of P.W. 5 shows polling agent did canvassing work, constituting corrupt practice under Section 123(8).",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 123(8) of Act 43 of 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appointment of Government servant as polling agent does not per se fall within Section 123(8); no finding by Tribunal on canvassing, so no contravention.",
      "addresses_issue": "i1",
      "key_observation": "Following Satya Dev Busheri v. Padam Dev"
    },
    {
      "id": "cr2",
      "text": "Contracts with Chief Commissioner in Part C States operate as disqualification under Section 17 of Act 49 of 1951 read with Section 7(d) of Act 43 of 1951.",
      "addresses_issue": "i2",
      "key_observation": "Preparation of electoral rolls distinct from printing; Tribunal finding that Vindhya Pradesh Government got rolls printed; Exhibit A-4 shows Government settled terms and made payments."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No contravention of Section 123(8) by appellant.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Contracts with Vindhya Pradesh Government/Chief Commissioner disqualify under Section 17 of Act 49 of 1951 read with Section 7(d) of Act 43 of 1951.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Satya Dev Busheri v. Padam Dev",
      "citation": "A and S.B.",
      "treatment": "followed",
      "relevance": "Appointment of Government servant as polling agent not per se corrupt practice u/s 123(8); contracts with Chief Commissioner disqualify"
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951 (Act 43 of 1951)",
      "sections": [
        "Section 123(8)",
        "Section 7(d)"
      ],
      "relevance": "Corrupt practice of employing government servants; disqualification linkage"
    },
    {
      "name": "Act 49 of 1951",
      "sections": [
        "Section 17"
      ],
      "relevance": "Disqualification due to subsisting government contracts"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 324"
      ],
      "relevance": "Superintendence of electoral rolls by Election Commission argued but distinguished from printing contracts"
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal allowed on first ground (no corrupt practice u/s 123(8)); second ground upheld (disqualification due to contracts with Vindhya Pradesh Government).",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the appointment of a Government servant as polling agent does number per se tall within the mischief of Section 123(8).",
      "speaker": "court",
      "significance": "Core holding on corrupt practice"
    },
    {
      "text": "companytracts with the Chief Commissioner in Part C States would operate as a disqualification for election to the State Legislatures under Section 17 of Act 49 of 1951 read along with Section 7(d) of Act 43 of 1951.",
      "speaker": "court",
      "significance": "Affirmation of disqualification rule"
    }
  ],
  "_case_id": "1954_164",
  "_label": 0,
  "_text_length": 3168,
  "_extracted_at": "2026-02-08T22:15:36.449956"
}