{
  "metadata": {
    "case_name": "Lala Kishan Prasad & Co. v. Commissioner of Income Tax",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "Mehr Chand Mahajan, C.J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee, a public limited company, was formed in 1917 with objects including to undertake general business of commission agents, insurance agents, commercial agents, bankers, merchants, to deal in money, shares, bills, hundis and other securities, to acquire lands, buildings, to encourage, originate, finance or undertake management of commercial and industrial undertakings.",
      "type": "background",
      "date": "1917",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1933, Sarswati Sugar Syndicate Ltd. (sugar company) was incorporated.",
      "type": "background",
      "date": "1933",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Lala Kishan Prasad, managing director of assessee company, entered agreement with sugar company in March 1933: assessee to invest Rs. 5,00,000 in sugar company shares in lieu of managing agency of third mill (not yet erected) on same terms as other mills.",
      "type": "material",
      "date": "1933-03",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Investment conditional on sugar company receiving other share applications of at least Rs. 7,00,000. If third mill not erected, sugar company to pay assessee Rs. 15,000 as commission on moneys invested.",
      "type": "material",
      "date": "1933-03",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Agreement modified: assessee to subscribe to shares worth Rs. 3,00,000 themselves, remaining Rs. 2,00,000 by their friends.",
      "type": "material",
      "date": "1933",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Assessee purchased 3,000 shares of Rs. 3,00,000 value; share certificates issued; Lala Kishan Prasad made director of sugar company.",
      "type": "material",
      "date": "1933",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Third mill not erected; agreement for managing agency fell through.",
      "type": "material",
      "date": "1933",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Lala Kishan Prasad died in December 1940.",
      "type": "background",
      "date": "1940-12",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Assessee decided to sell all shares in 1941: 2,000 shares sold first, excess of Rs. 20,000 over cost price.",
      "type": "material",
      "date": "1941",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Remaining 1,000 shares sold in 1943, excess realisation of Rs. 2,26,700.",
      "type": "material",
      "date": "1943",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Excess amounts taxed as revenue receipts: Rs. 20,000 in assessment year 1942-43, Rs. 2,26,700 in 1944-45 by Income-tax Officer, Ambala.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Tax order confirmed by Appellate Assistant Commissioner and Income-tax Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Tribunal referred two questions to High Court of Punjab at instance of assessee.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "High Court answered both questions in affirmative by judgment dated 18th June 1951.",
      "type": "procedural",
      "date": "1951-06-18",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on a proper construction of the relevant clauses of the appellant company's memorandum of association and articles of association and on a consideration of the circumstances in which the shares of the Sarswati Sugar Syndicate were purchased and sold, it could be held that the purchase and sale of such shares was a part of appellant company's business deal?",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Whether in the circumstances of the case, the excess of Rs. 20,000 realised in the assessment year 1942-43 and Rs. 2,26,700 in the year 1944-45 was a revenue receipt chargeable to tax under section 3 of the Income-tax Act and was not a mere appreciation of capital?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Excess amounts were not receipts arising from business, were of casual and non-recurring nature, hence exempt under section 4(3)(vii) Income-tax Act; constituted capital appreciation.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Section 4(3)(vii) Income-tax Act"
    },
    {
      "id": "pa2",
      "text": "Memorandum of association did not authorise dealing in shares as dealers; beyond this isolated transaction, company did not deal in shares.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "By virtue of memorandum of association, assessee allowed to deal in shares as securities.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Intention and purpose was to obtain managing agency and directorship, which fell within object to undertake management of commercial undertaking; true nature was business operation.",
      "supporting_facts": [
        "f3",
        "f4",
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Out of Rs. 3,00,000 invested, only Rs. 1,00,000 for managing agency, remaining Rs. 2,00,000 for profit.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court erred: main purpose was to acquire managing agency and directorship, capital nature; no intention from inception to resell shares or deal in them; when mill not erected, sold at profit; isolated transaction.",
      "addresses_issue": "i1",
      "key_observation": "Object of buying shares purely to obtain managing agency, asset of enduring nature; no intention to resell."
    },
    {
      "id": "cr2",
      "text": "Investment in shares capital nature; profits accretions to capital, not liable to tax; transaction one and indivisible, cannot split.",
      "addresses_issue": "i2",
      "key_observation": "Letters of 14th and 17th March 1933 show sole object to acquire managing agency permanently."
    },
    {
      "id": "cr3",
      "text": "Whether transaction within powers irrelevant to whether profits capital or revenue.",
      "addresses_issue": "i1",
      "key_observation": "Ultra vires irrelevant to nature of transaction."
    },
    {
      "id": "cr4",
      "text": "Revenue conceded no authorisation to deal in shares as dealers.",
      "addresses_issue": "i1",
      "key_observation": "Assessee not a dealer in shares."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Purchase of shares was an investment and not an adventure in nature of trade; sums realised were accretions to capital, not income from business, not liable to tax.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Excess amounts not revenue receipts chargeable under section 3.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "Section 3",
        "Section 4(3)(vii)",
        "Section 12B",
        "Section 66"
      ],
      "relevance": "Excess amounts assessed as revenue under s.3; exemption claimed under s.4(3)(vii) for casual non-recurring non-business receipts; reference under s.66; s.12B not applicable as shares pre-date."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court reverses High Court judgment, holds that the purchase of shares was an investment of capital nature to secure managing agency, sale profits were capital accretions not taxable as business income.",
    "relief_granted": "Exemption from tax on Rs. 20,000 and Rs. 2,26,700",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the investment of the money in the purchase of shares was of a capital nature and the profits arising out of the sale of the shares in the circumstances of this case were accretions to capital and were not liable to tax.",
      "speaker": "court",
      "significance": "Core holding on nature of transaction"
    },
    {
      "text": "there was from the inception no intention whatever on the part of the assessee company to re-sell the shares either at a profit or otherwise deal in them.",
      "speaker": "court",
      "significance": "Distinguishes trading from investment"
    },
    {
      "text": "the transaction was one and indivisible and the sole object of the agreement was to acquire the managing agency as an asset of a permanent character",
      "speaker": "court",
      "significance": "Rejects splitting of investment purpose"
    }
  ],
  "_case_id": "1954_62",
  "_label": 1,
  "_text_length": 10767,
  "_extracted_at": "2026-02-08T22:33:17.230671"
}