{
  "metadata": {
    "case_name": "Petition No. 315 of 1954",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Mehr Chand Mahajan C.J."
    ],
    "case_number": "Petition No. 315 of 1954",
    "date_of_judgment": "1954-10-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner is a resident of Akola in the State of Madhya Pradesh and carries on business in oil mills, banking, money lending, etc.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "During the war years petitioner made huge profits but evaded payment of tax.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1948 Central Government under section 5(1) of Taxation on Income (Investigation Commission) Act, 1947 referred petitioner's case to Investigation Commission for profits from 1st January 1939 to 31st December 1947.",
      "type": "procedural",
      "date": "1948",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Commission reported on 28th February 1951 that concealed income was Rs. 27,25,363 and tax payable Rs. 18,44,949.",
      "type": "material",
      "date": "1951-02-28",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "During pendency, petitioner applied for settlement under section 8A of Act XXX of 1947, proposing payment of Rs. 18,44,949 in installments: Rs. 3,44,949 by 25-6-1951, Rs. 5,00,000 by 25-3-1952, Rs. 5,00,000 by 25-3-1953, Rs. 5,00,000 by 25-3-1954, with credit for Rs. 32,034-4-6 already paid.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Central Government accepted the proposal; claim settled by mutual agreement.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Petitioner requested and was granted extensions for installments.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "From 16th July 1951 to 10th April 1954, petitioner paid total Rs. 14,00,000 towards liability; Rs. 4,50,000 remains due payable up to 25th March 1955.",
      "type": "material",
      "date": "1951-07-16 to 1954-04-10",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Settlement term: petitioner undertook not to transfer, mortgage, charge, alienate or encumber movable or immovable properties (barring stock-in-trade) without permission of Commissioner of Income-tax, except for payment of tax.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In June 1954, after Suraj Mal Mohta v. A.V. Viswanatha Sastri, petitioner filed petition under Article 32 alleging proceedings illegal, ultra vires, void, unconstitutional; Income-tax authorities not entitled to recover Rs. 4,50,000.",
      "type": "procedural",
      "date": "1954-06",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Petition claims sections 5,6,7,8 of Act XXX 1947 invalid violating Articles 14, 19(1)(f), 31; no reasonable classification; executive unrestrained right to pick and choose; procedure more prejudicial than Income-tax Act section 34.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Petition prays: quash proceedings and orders; restrain proceedings under Act; restore Rs. 13,99,715-10-6 with 6% interest; restrain recovery of Rs. 4,50,000 with interest.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether sections 5,6,7,8 of Taxation on Income (Investigation Commission) Act, 1947 are ultra vires Articles 14, 19(1)(f), 31 of Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the settlement proposed by petitioner and accepted by Central Government is binding, or improperly procured under pressure of the Act, allowing relief under Article 32.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Entire proceedings under Act resulted in liability of Rs. 18,44,949 and payments of Rs. 13,99,175 wholly illegal, ultra vires, void, unconstitutional.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": "Articles 14, 19(1)(f), 31; sections 5,6,7,8 of Act XXX 1947; Income-tax Act section 34"
    },
    {
      "id": "pa2",
      "text": "Sections 5,6,7,8 invalid: no reasonable classification, executive unrestrained right to pick and choose taxpayers, procedure prejudicial unlike Income-tax Act s.34.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Article 14"
    },
    {
      "id": "pa3",
      "text": "Settlement application made under pressure of coercive machinery of Act XXX 1947, not binding.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Petition wholly misconceived: tax paid or recoverable based on settlement proposed by petitioner and accepted by Central Government; no assessment under Income-tax Act procedure followed.",
      "addresses_issue": "i2",
      "key_observation": "Unless petitioner establishes settlement improperly procured and not binding, cannot claim fundamental rights contravened under Article 32."
    },
    {
      "id": "cr2",
      "text": "Article 32 not intended for relief against involuntary actions of a person; remedy if any lies in other proceedings.",
      "addresses_issue": "i2",
      "key_observation": "Allegation of settlement under pressure cannot be raised under Article 32; forum elsewhere."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Petition under Article 32 not maintainable as recovery based on voluntary settlement; no violation of fundamental rights established.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Suraj Mal Mohta v. A. V. Viswanatha Sastri and Another",
      "citation": "A.I.R. 1954 S.C. 545",
      "treatment": "referred",
      "relevance": "Decision prompted petitioner to file this petition alleging proceedings illegal"
    }
  ],
  "statutes_cited": [
    {
      "name": "Taxation on Income (Investigation Commission) Act, 1947 (Act XXX of 1947)",
      "sections": [
        "5(1)",
        "5",
        "6",
        "7",
        "8",
        "8A"
      ],
      "relevance": "Basis of reference, investigation, report, settlement; challenged as ultra vires"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 14",
        "Article 19(1)(f)",
        "Article 31"
      ],
      "relevance": "Basis for petition; Article 32 not for challenging voluntary settlement"
    },
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "34"
      ],
      "relevance": "Petitioner claimed Act XXX procedure more prejudicial than this"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Petition held wholly misconceived as liability based on voluntary settlement proposed by petitioner; Article 32 not applicable for such relief; allegations of improper procurement to be raised elsewhere.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "In our judgment this petition is wholly misconceived. Whatever tax the petitioner has already paid, or whatever is still recoverable from him, is being recovered on the basis of the settlement proposed by him and accepted by the Central Government.",
      "speaker": "court",
      "significance": "Core reason for dismissal"
    },
    {
      "text": "Article 32 of the Constitution is not intended for relief against the involuntary actions of a person. His remedy, if any, lies in other appropriate proceedings.",
      "speaker": "court",
      "significance": "Limits scope of Article 32 remedy"
    }
  ],
  "_case_id": "1954_176",
  "_label": 0,
  "_text_length": 6186,
  "_extracted_at": "2026-02-08T22:15:34.939220"
}