{
  "metadata": {
    "case_name": "Mahant of Rajgunj Asthal v. Respondents",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Ayyar J."
    ],
    "case_number": "Civil Appeals Nos. 109 to 115 of 1952",
    "date_of_judgment": "1954-12-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is the Mahant of a religious institution known as Rajgunj Asthal in Burdwan.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The suits were instituted by the appellant to recover possession of various plots of land in the occupation of the defendants, or in the alternative, for assessment of fair and equitable rent.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The suit lands were comprised in Mouza Nala forming part of the permanently settled estate of Burdwan, and were Mal lands assessed to revenue.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "More than 200 years previously there had been a permanent Mokarrari grant of those lands by the Maharaja of Burdwan to the Rajgunj Asthal.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "In the record of rights published during the settlement in 1931 they were erroneously described as rent-free.",
      "type": "material",
      "date": "1931-06-16",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "On the strength of that entry the defendants were refusing to surrender possession of the lands to the plaintiff.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The lands were not Mal lands comprised within Mouza Nala, that they did not form part of the zamindari of Burdwan but had been granted as Lakheraj to their predecessors-in-title long prior to the permanent settlement.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Neither the Maharaja of Burdwan nor the plaintiff claiming under him had any title to them, and that the entry in the record of rights in 1931 was correct.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The defendants and their predecessors had been in possession of the lands for over 200 years under assertion of an adverse title.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The District Munsif held that the lands were included in Mouza Nala in Touzi No. 1, which was comprised in the permanently settled estate of Burdwan, that their income was taken into account in fixing the revenue payable by the estate, that they had been granted in permanent Mokarrari by the then Maharaja of Burdwan to the Rajgunj Asthal.",
      "type": "admitted",
      "date": "1944-09-16",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The plea of the defendants that they held them under a Lakheraj grant made prior to the permanent settlement was not true.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The documents on which the defendants claimed to have dealt with the properties as owners under assertion of an adverse title were not proved to relate to the suit lands.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The relationship subsisting between the parties was one of landlord and tenant, as there had been no determination of tenancy, no decree in ejectment could be passed but the plaintiff was entitled to fair rent.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The claim was not barred by reason of article 131 of the Limitation Act.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "District Judge agreed that the suit lands were Mal lands within the zamindari of Burdwan, and that they had been settled on the plaintiff by the Maharaja of Burdwan.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "As the defendants and their predecessors had been in possession of the lands for a very long time without payment of rent, a presumption of a lost grant could be made in their favour.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "High Court agreed with District Judge on both points.",
      "type": "admitted",
      "date": "1950-03-09",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "There was a permanent settlement of the zamindari of Burdwan in 1793, and the suit lands were included as part of the Mal or assessed lands of the estate.",
      "type": "material",
      "date": "1793",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "The District Munsif held that the documents put forward by the defendants as containing assertions by them that they held under a Lakheraj grant were not shown to relate to the suit lands.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "District Judge differed, observing there are some unmistakable names of tanks, etc., by which some of the lands of these documents at least can be connected with the suit lands.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "No attempt was made before Supreme Court on behalf of the respondents to connect any of the documents with the lands held by them. The finding of the District Munsif on the point must be accepted.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "On the question whether the plaintiff had knowledge of the assertion of any hostile title by the defendants, District Judge answered in affirmative relying on Exhibits A to A-24, which are receipts for realisations of cesses from the defendants.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f23",
      "text": "High Court held that there was no proof of the contents of these documents, and that they must therefore be excluded.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f24",
      "text": "There is no proof that the respondents set up any adverse title prior to 1931, much less that the plaintiff had knowledge of the same.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f25",
      "text": "The defendants and their predecessors in title had been in possession for a long period without payment of rent but there is no finding as to the precise length of time.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f26",
      "text": "The entry in record of rights describes the lands as Bhog Dakhal Sutre Niskar, translated as without rent by virtue of possession and enjoyment.",
      "type": "material",
      "date": "1931",
      "source": "respondent"
    },
    {
      "id": "f27",
      "text": "Plaintiff attacked this entry as made at the instance of the defendants acting in collusion with one of his agents. Courts below held that had not been established.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f28",
      "text": "The suit properties formed part of Mauza Nala within the zamindari of Burdwan.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f29",
      "text": "According to the District Judge, the suit properties had been settled on the Rajgunj Asthal more than 200 years ago.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f30",
      "text": "The final settlement of records was published on 16-6-1931, and the present suits were filed within 12 years thereof.",
      "type": "procedural",
      "date": "1931-06-16",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the materials on record the Courts below were right in presuming a lost grant in favour of the defendants.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the claim was barred by limitation.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Suit lands were Mal lands assessed to revenue in permanently settled estate of Burdwan, permanent Mokarrari grant by Maharaja to Rajgunj Asthal more than 200 years ago, record of rights 1931 erroneously rent-free.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Record of rights entry made at instance of defendants in collusion with plaintiff's agent.",
      "supporting_facts": [
        "f27"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Lands not Mal lands in Mouza Nala or zamindari of Burdwan, granted as Lakheraj to predecessors prior to permanent settlement, neither Maharaja nor plaintiff had title, record of rights entry correct.",
      "supporting_facts": [
        "f7",
        "f8",
        "f26"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "In possession over 200 years under assertion of adverse title, claim barred by limitation.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Limitation Act"
    },
    {
      "id": "ra3",
      "text": "Strong presumption in favour of correctness of record of rights entry as made in ordinary course of business, sufficient for lost grant.",
      "supporting_facts": [
        "f26"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Documents contain assertions of Lakheraj title, connectable to suit lands.",
      "supporting_facts": [
        "f20"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Documents not proved to relate to suit lands (accepting Munsif's finding), no proof of adverse title assertion prior to 1931 or plaintiff's knowledge thereof (Exhibits A-A24 excluded by High Court). Bare long possession without rent payment and no precise duration insufficient for lost grant presumption.",
      "addresses_issue": "i1",
      "key_observation": "No proof that the respondents set up any adverse title prior to 1931, much less that the plaintiff had knowledge of the same."
    },
    {
      "id": "cr2",
      "text": "Permanent settlement 1793 included suit lands as Mal/assessed lands; scheme fixed revenue on estimated income, Section 36 Reg. 8/1793 excludes lakheraj; inconsistent to presume pre-settlement Lakheraj grant for assessed lands.",
      "addresses_issue": "i1",
      "key_observation": "It would be inconsistent with the scheme of the settlement and section 36 of Regulation No. 8 of 1793 to hold that the assessed or Mal lands in an estate could have been held on an anterior Lakheraj grant."
    },
    {
      "id": "cr3",
      "text": "Record of rights entry 'Bhog Dakhal Sutre Niskar' per Rule 37 means not paying rent, not rent-free grant; cannot outweigh non-exclusion from Mal estate.",
      "addresses_issue": "i1",
      "key_observation": "What it imports is not that there was a rent-free grant, but that the person in possession was not actually paying rent."
    },
    {
      "id": "cr4",
      "text": "Defendants denied title of both Maharaja and Asthal, cannot presume grant from them after repudiation.",
      "addresses_issue": "i1",
      "key_observation": "Having failed in that plea, cannot fall back on a presumption of lost grant by the very persons, whose title they have repudiated."
    },
    {
      "id": "cr5",
      "text": "Presumed grant by Mahant >200 yrs ago would be ultra vires as rent-free Lakheraj without consideration or necessity; Mahant cannot bind institution perpetually.",
      "addresses_issue": "i1",
      "key_observation": "It is well settled that it is beyond the powers of a manager of a religious institution to grant perpetual lease binding the institution for all times to a fixed rent, unless there is a compelling necessity or benefit therefor."
    },
    {
      "id": "cr6",
      "text": "No adverse possession: no issue framed, no discussion below; documents not related, no pre-1931 hostile claim to knowledge of plaintiff; suits within 12 yrs of 1931 publication under Art. 131 Limitation Act.",
      "addresses_issue": "i2",
      "key_observation": "It was only in 1931 that the defendants could be said clearly to have asserted a hostile title, and the suits are within time from that date."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No presumption of lost grant possible on facts found.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Plaintiff entitled to assessment of fair and equitable rent.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Suits not barred by limitation.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Attorney-General v. Simpson",
      "citation": "1901 2 Ch. D. 671, 698",
      "treatment": "referred",
      "relevance": "Presumption not made if facts go against it: 'It cannot be the duty of a Judge to presume a grant the non-existence of which he is convinced.'"
    },
    {
      "case_name": "Raja Braja Sundar Deb v. Moni Behara",
      "citation": "1951 SCR 431, 416",
      "treatment": "followed",
      "relevance": "No presumption if no person competent to receive grant, as fluctuating body."
    },
    {
      "case_name": "Barker v. Richardson",
      "citation": "1821 4 B. Ald. 579",
      "treatment": "followed",
      "relevance": "No presumption if grant illegal or beyond grantor's powers."
    },
    {
      "case_name": "The Rochdale Canal Company v. Radcliffe",
      "citation": "1852 18 Q.B. 287",
      "treatment": "followed",
      "relevance": "No presumption if grant ultra vires."
    },
    {
      "case_name": "Palaniappa Chetty v. Sreenath Devasikamony",
      "citation": "1917 LR 44 IA 147",
      "treatment": "followed",
      "relevance": "Mahant cannot grant perpetual lease without necessity/benefit."
    }
  ],
  "statutes_cited": [
    {
      "name": "Regulation No. 8 of 1793",
      "sections": [
        "Section 36"
      ],
      "relevance": "Assessment fixed exclusive of lakheraj lands; assessed Mal lands could not be lakheraj at settlement."
    },
    {
      "name": "Limitation Act",
      "sections": [
        "Article 131"
      ],
      "relevance": "Suits within 12 years of record publication for rent assessment."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(c)"
      ],
      "relevance": "Certificate granted by High Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; decrees of District Court and High Court set aside; decrees of District Munsif restored.",
    "relief_granted": "Plaintiff entitled to assessment of fair and equitable rent.",
    "costs": "Costs in this Court and in the two Courts below."
  },
  "key_quotes": [
    {
      "text": "\"It cannot be the duty of a Judge to presume a grant the non-existence of which he is convinced.\"",
      "speaker": "court",
      "significance": "Limits application of lost grant presumption."
    },
    {
      "text": "It would be inconsistent with the scheme of the settlement and section 36 of Regulation No. 8 of 1793 to hold that the assessed or Mal lands in an estate could have been held on an anterior Lakheraj grant.",
      "speaker": "court",
      "significance": "Rejects pre-settlement lakheraj for assessed lands."
    },
    {
      "text": "What it imports is not that there was a rent-free grant, but that the person in possession was not actually paying rent.",
      "speaker": "court",
      "significance": "Interprets 'Niskar' in record of rights."
    }
  ],
  "_case_id": "1954_143",
  "_label": 1,
  "_text_length": 17632,
  "_extracted_at": "2026-02-10T19:19:00.042196"
}