{
  "metadata": {
    "case_name": "State of Bombay v. Respondents (Civil Appeals Nos. 145, 146, 147 of 1952)",
    "case_year": 1952,
    "court": "Supreme Court of India",
    "judges": [
      "Bose, J."
    ],
    "case_number": "Civil Appeals Nos. 145, 146 and 147 of 1952",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Three petitions made in the Bombay High Court for writs of mandamus under article 226 of the Constitution. The writs have been granted and the State of Bombay appeals.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Governor of Bombay, acting through the Assistant Controller of Accommodation, issued orders under section 6(4)(a) of the Bombay Land Requisition Act, 1948, in Civil Appeals Nos. 145 and 146 of 1952 and under section 5(1) in Civil Appeal No. 147 of 1952, requisitioning the premises of the three respondents.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In Civil Appeal No. 145 of 1952 the respondents are uncle and nephew. The uncle, who is the first respondent, is the tenant. The second respondent is his nephew. He and his family live with the first respondent in the requisitioned premises.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In Civil Appeal No. 146 of 1952 the premises are owned by a trust. The first and second respondents are the trustees and the third respondent claims to be a licensee living on the premises. The State contends that he is a tenant but that is no longer of consequence because of the assurance given by the learned Attorney-General that the possession of the petitioners in this case will not be disturbed for any reason arising out of these proceedings.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In Civil Appeal No. 147 of 1952 there is only one respondent, a private limited company which occupies the requisitioned premises as a tenant for the purposes of its business.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Act of 1948 would have expired in April, 1950, but its life was extended by Bombay Act II of 1950. Later, sections 5 and 6 were amended by Bombay Act XXXIX of 1950.",
      "type": "background",
      "date": "1950-04",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The premises specified in the orders had become vacant on or after the month of May 1950.",
      "type": "material",
      "date": "1950-05",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The petitions in Civil Appeals Nos. 145 and 146 were filed on the 30th and 4th of April, 1951, respectively. Affidavits in reply were made on the 18th and 19th of June, and then in August, 1951, the following order was served on the petitioners: In continuation of the order dated etc the Government of Bombay is pleased to declare that the premises mentioned in that order were requisitioned for a public purpose, namely housing a person having no housing accommodation on the date of the said order cited above.",
      "type": "procedural",
      "date": "1951-04-30",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "At that time the housing situation in Bombay was acute, largely due to the influx of refugees.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In the year 1947 the Government of Bombay passed the Bombay Land Requisition Ordinance and invited applications for the allotment of vacancies from the general public.",
      "type": "background",
      "date": "1947",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Government introduced allotments to those who gave information about suppressed vacancies and nominal occupation, allotting to the first informant provided he genuinely needed accommodation.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "In 1949, and again in 1950, Government declared that it would not consider further applications from the public as it had decided to restrict the allotments to Government and other public purposes.",
      "type": "background",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The allottees in the present appeals are from the class of first informants.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "In Civil Appeal No. 146 of 1952, question whether the premises were let or intended to be let within section 4(3). Learned trial Judge threw burden on State, State did not lead evidence, accepted petitioners' affidavit.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether sections 5 and 6 of the Bombay Land Requisition Act, 1948 (as amended and extended post-Constitution) are ultra vires articles 19(1)(f) and 31(2) of the Constitution.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether the requisition orders are ultra vires for lack of public purpose.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "In Civil Appeal No. 146 of 1952, whether the premises were within the meaning of section 4(3) of the Act (let or intended to be let).",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether mandamus can issue.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Article 19(1)(f) does not apply to tenants and licensees as there is substantial deprivation of property rights, turning to Article 31. The Act provides compensation in section 8, and public purpose is evident from preamble and sections 5 and 6 ('for the purpose of the State or any other public purpose').",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Articles 19(1)(f), 31; Bombay Land Requisition Act ss.5,6,8"
    },
    {
      "id": "pa2",
      "text": "Purpose need not be in initial order if proved otherwise; here proved by affidavits and subsequent orders for housing homeless amid housing crisis.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "State of Bihar v. Kameshwar Singh; Biswabhusan Naik v. State of Orissa"
    },
    {
      "id": "pa3",
      "text": "Allotment to first informants fulfills public purpose of housing homeless; wide discretion to Government; no fraud etc. alleged.",
      "supporting_facts": [
        "f11",
        "f13"
      ],
      "legal_basis": "Constitution authorizes requisitions for public purpose"
    },
    {
      "id": "pa4",
      "text": "Burden on petitioners to prove order illegal; they have special knowledge.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sections 5 and 6 ultra vires as restrictions on right to hold property not reasonable in interests of general public and Act does not require public purpose.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Articles 19(1)(f), 31(2)"
    },
    {
      "id": "ra2",
      "text": "Subsequent specification of purpose is no avail, evident afterthought.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "No public purpose: allotments to informers as reward, not equitable distribution; restricted to govt servants.",
      "supporting_facts": [
        "f10",
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Premises not within s.4(3) as not let or intended to be let.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Bombay Land Requisition Act s.4(3)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Article 19(1)(f) does not apply to tenants/licensees due to substantial total deprivation of property (right to occupy, transfer etc. gone, mere husk left); turn to Article 31.",
      "addresses_issue": "i1",
      "key_observation": "Articles 19(1)(f) and 31 cover different fields; 19 assumes existence of property to restrict."
    },
    {
      "id": "cr2",
      "text": "Act valid under Art.31 as provides compensation s.8, and public purpose from preamble/sections despite pre-Constitution.",
      "addresses_issue": "i1",
      "key_observation": "Unnecessary to state precise purpose if gathered from tenor of Act for State/public benefit."
    },
    {
      "id": "cr3",
      "text": "Purpose not necessary in initial order if proved otherwise; here proved by affidavits/subsequent orders for housing homeless amid crisis due to refugees, rapacious landlords etc.",
      "addresses_issue": "i2",
      "key_observation": "Clear public purpose and benefit."
    },
    {
      "id": "cr4",
      "text": "Allotment to first informants valid; fulfills housing homeless; discretion to Govt on schemes considering urgency, costs etc.; no fraud alleged.",
      "addresses_issue": "i2",
      "key_observation": "Not proper to view narrowly; broad lines of principle."
    },
    {
      "id": "cr5",
      "text": "Burden on petitioners to disprove prima facie valid order; they have special knowledge. But due to assurance, no further inquiry.",
      "addresses_issue": "i3",
      "key_observation": "Burden wrongly placed by High Court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sections 5 and 6 not ultra vires Arts.19(1)(f) and 31(2); Art.19(1)(f) inapplicable to substantial deprivation.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Requisition orders valid; public purpose for housing homeless proved.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Burden of proof on petitioners regarding s.4(3); but appeal dismissed due to assurance.",
      "resolves_issue": "i3",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "The State of West Bengal v. Subodh Gopal Bose",
      "citation": "1954 S.C.R. 587",
      "treatment": "followed",
      "relevance": "Articles 19(1)(f) and 31 deal with different subjects and cover different fields."
    },
    {
      "case_name": "Dwarkadas Shrinivas of Bombay v. The Sholapur Spinning and Weaving Co. Ltd. Others",
      "citation": "1954 S.C.R. 674",
      "treatment": "followed",
      "relevance": "Articles 19(1)(f) and 31 different; substantial deprivation means robbing attributes of enjoyment; mere husk of title."
    },
    {
      "case_name": "A. K. Gopalan v. The State of Madras",
      "citation": "1950 S.C.R. 88",
      "treatment": "followed",
      "relevance": "Article 19 freedoms assume existence of free citizen; analogous to property."
    },
    {
      "case_name": "The State of Bihar v. Maharajadhiraja Sir Kameshwar Singh of Darbhanga",
      "citation": "1952 S.C.R. 889, 940",
      "treatment": "followed",
      "relevance": "Unnecessary to state precise purpose if from tenor of Act for State/public benefit."
    },
    {
      "case_name": "Biswabhusan Naik v. The State of Orissa",
      "citation": null,
      "treatment": "followed",
      "relevance": "Underlying principle: purpose need not be in order if proved otherwise."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Land Requisition Act, 1948",
      "sections": [
        "5(1)",
        "6(4)(a)",
        "8",
        "4(3)"
      ],
      "relevance": "Requisition powers, compensation, definition of premises; valid for public purpose."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "19(1)(f)",
        "31(2)",
        "226"
      ],
      "relevance": "Property rights; writs; sections not ultra vires."
    },
    {
      "name": "Bombay Act II of 1950",
      "sections": [],
      "relevance": "Extended life of 1948 Act."
    },
    {
      "name": "Bombay Act XXXIX of 1950",
      "sections": [
        "5",
        "6"
      ],
      "relevance": "Amended sections 5 and 6."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Civil Appeals Nos. 145 and 147 of 1952 allowed, High Court writs dismissed as orders valid. Civil Appeal No. 146 of 1952 dismissed due to Attorney-General's assurance not to disturb possession; High Court order stands. No order as to costs throughout.",
    "relief_granted": "None; appeals allowed/dismissed as above.",
    "costs": "No order about costs throughout."
  },
  "key_quotes": [
    {
      "text": "\"By substantial deprivation is meant the sort of deprivation that substantially robs a man of those attributes of enjoyment which normally accompany rights to, or an interest in, property.\"",
      "speaker": "court",
      "significance": "Defines when Art.19(1)(f) inapplicable, applies to case."
    },
    {
      "text": "\"It is unnecessary to state in express terms in the statute itself the precise purpose for which property is being taken, provided from the whole tenor and intendment of the Act it could be gathered that the property was being acquired either for purposes of the State or for purposes of the public.\"",
      "speaker": "court",
      "significance": "Upholds Act's validity under Art.31."
    },
    {
      "text": "\"A wide discretion must be left to Government to carry out the policy of the Act.\"",
      "speaker": "court",
      "significance": "Justifies allotments to informants."
    }
  ],
  "_case_id": "1954_136",
  "_label": 0,
  "_text_length": 18364,
  "_extracted_at": "2026-02-08T22:15:10.594878"
}