{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. Mysore Chromite Ltd.",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "DAS J."
    ],
    "case_number": "Civil Appeal No. 117 of 1953",
    "date_of_judgment": "1954-11-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee company is a private limited company registered in the Mysore State under the Mysore Company Regulations and has its registered office at Sinduvalli in Mysore State.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The management and control of the assessee company was vested in Messrs. Oakley Bowden & Co. Madras Ltd., another private limited company incorporated under the Indian Companies Act, having its registered office at No. 15, Armenian Street, Madras.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The assessee company owns chromite mines in Mysore State. Chrome ores are extracted from the mines and converted into a merchantable product and then sold to buyers mostly outside India.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "A very small proportion of the total sales is effected in India and for the purposes of this case may be left out of consideration. The sales are mostly to buyers in America and Europe.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The sales to the purchasers in Europe are put through in London by Bowden Oakley & Co. Ltd., London, which is the agent of the assessee company in Europe holding a power of attorney from the assessee company. The contracts for sale to European purchasers are signed by Bowden Oakley & Co. Ltd., in London.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The sales to purchasers in America are effected through Messrs. W. R. Grace & Co., who buy for undisclosed principals. The contracts for sale to American purchasers are signed by W. R. Grace & Co., presumably in America and by Oakley Bowden & Co. Madras, Ltd., in Madras.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Under both forms of contracts the price was F.C.B. Madras or Marmagoa. A very small quantity of goods was sold F.O.B. Marmagoa and the same need not be considered here. Provision was made for weighment, sampling and assay of goods at destination.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Terms of payment under the European contract: Buyers to open a confirmed irrevocable Bankers credit in favour of Messrs. Mysore Chromite Ltd., Madras to be advised to sellers through the Eastern Bank Ltd., for 90 per cent. of the Provisional Invoice against documents. Documents to consist of- Bills of Lading, Provisional Invoice. Provisional invoice to be based on Bill of Lading weight and contract price for 48 per cent. Cr. 203. Balance on ascertainment of weight and analysis to be paid in London to Bowden Oakley & Co., Ltd., within 10 days of the final invoice, based on outturn weights and assays.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Terms of payment under the American contracts: Letter of credit for eighty per cent. of invoice value to be available against drafts at ninety days sight with documents attached to be opened immediately in London in favour of the seller. Balance estimated twenty per cent. of the margin due to be paid by telegraphic transfer through London on receipt of information as to assay and outturn which should be submitted within a month after the arrival of the steamer at destination.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The European contracts also provided for insurance by buyers but no such provision was made in the American contracts.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Before the goods were actually shipped, the buyers used to open a confirmed irrevocable Bankers credit with some first class bank in London. Being informed of the opening of such credit the Eastern Bank Ltd., London sent intimation to the Eastern Bank Ltd., Madras, and the latter in its turn used to pass on the intimation by letter addressed to the assessee company.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Specimen letter from Eastern Bank Ltd., Madras: informed the assessee company that a confirmed and irrevocable credit has been opened in your favour by Messrs. Morgan Grenfell & Co., Ltd., London, for account of Messrs. W. R. Grace & Co., New York, for a sum not exceeding £7,300, available by delivery to us on or before 15th January, 1940, of the following documents. They were prepared to negotiate drafts drawn in terms of the arrangement provided that the documents appear to be in order. The advice was given for guidance without responsibility.",
      "type": "material",
      "date": "1940-01-15",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On receipt of such intimation the assessee company placed the contracted goods on board the steamer at Madras and obtained a bill of lading in its own name. Shipments were made principally at Madras Port.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Thereafter, the assessee company used to make out a provisional invoice on the basis of the bill of lading weight and contract price for 48 per cent Cr. 203 and used to draw a bill of exchange on the buyers Bank for 90 per cent. (European) or 80 per cent. (American) of the amount of the provisional invoice payable at sight or 90 days sight, drawn in favour of the Eastern Bank Ltd., London.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The bill of exchange together with the relative bill of lading endorsed in blank by the assessee company and the provisional invoice was then negotiated with the Eastern Bank Ltd., Madras, who used to credit the assessee company with the amount of the bill of exchange.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The Eastern Bank Ltd., Madras, then forwarded the documents to the Eastern Bank Ltd., London, who used to present the bill of exchange to the buyers Bank in London and upon the bill of exchange being accepted the Eastern Bank Ltd., London, used to deliver the bill of lading and the invoice to the buyers Bank. The buyers Bank used to pay the amount to the Eastern Bank Ltd., London.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Thereafter, on arrival of the goods and after weighment and assay, the sale price was ascertained and the balance of price, after deducting the payments made against the bill of exchange, used to be paid to the Eastern Bank Ltd., London, which was the assessee company's agent and banker in London.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Proceedings for assessment to income-tax of the respondent for the years 1939-1940, 1940-1941, 1941-1942 and 1942-1943.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "The Income-tax Officer assessed the assessee company on the entire profits in respect of these sales on the footing that they arose and were also received in British India.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "On appeal, the Appellate Assistant Commissioner confirmed the assessment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "The assessee company appealed to the Income-tax Appellate Tribunal. The Tribunal by its order dated 22nd January, 1948, concluded that the sales took place outside British India and that the money was received by the agent in London.",
      "type": "procedural",
      "date": "1948-01-22",
      "source": "court"
    },
    {
      "id": "f22",
      "text": "The Commissioner of Income-tax applied to the Tribunal to refer questions of law. The Tribunal referred the two questions.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "High Court of Madras on 29th March, 1951, answered both questions in the affirmative in favor of assessee.",
      "type": "procedural",
      "date": "1951-03-29",
      "source": "court"
    },
    {
      "id": "f24",
      "text": "It was agreed between the department and the assessee company that the income arose at the place where the sales took place.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case the profits derived by the assessee company from sales made to European and American buyers arose outside British India?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether on the facts and in the circumstances of the case the profits derived by the assessee company from sales made to European and American buyers were received outside British India?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Having regard to the terms of the contracts the sales must be regarded as having taken place in British India. Facts: price and delivery on F.O.B. terms; in European contracts insurance by buyers; payment of 80 or 90 per cent. made in Madras by Eastern Bank Madras to assessee on delivery of documents. All indicate property passed at Madras.",
      "supporting_facts": [
        "f7",
        "f9",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Irrespective of place of sale, profits were received in Madras as assessee received payment from Eastern Bank Madras after handing over documents.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sales took place outside British India and money received by agent in London.",
      "supporting_facts": [
        "f5",
        "f6",
        "f16",
        "f17",
        "f21"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "According to section 4 of the Indian Sale of Goods Act, contract of sale transfers or agrees to transfer property in goods. For unascertained goods, property passes when goods unconditionally appropriated to contract (s.23). Seller may reserve right of disposal until conditions fulfilled (s.25), notwithstanding delivery to carrier.",
      "addresses_issue": "i1",
      "key_observation": "Contracts for unascertained goods; appropriation not unconditional due to retention of bill of lading until bill of exchange honoured."
    },
    {
      "id": "cr2",
      "text": "FOB delivery discharges seller's liability and risk passes to buyer, but not decisive for property passing if seller reserves right of disposal via documents until payment.",
      "addresses_issue": "i1",
      "key_observation": "Bill of lading (document of title) not parted with until bill of exchange accepted in London."
    },
    {
      "id": "cr3",
      "text": "Property in goods could not have passed earlier than when bill of exchange accepted by buyers' bank in London and documents delivered there.",
      "addresses_issue": "i1",
      "key_observation": "Sales took place outside British India; profits arose outside."
    },
    {
      "id": "cr4",
      "text": "Payment by Eastern Bank Madras was an advance on security of bill of lading and drawer's liability, backed by letter of credit; not receipt of price. Price paid by buyers' London banks to Eastern Bank London, agent of assessee.",
      "addresses_issue": "i2",
      "key_observation": "First receipt of price by Eastern Bank London on behalf of sellers; balance also in London."
    },
    {
      "id": "cr5",
      "text": "Cites Lord Sumner in The Prinz Adalbert: shipper discounting draft with bill of lading makes goods security; banker surrenders bill upon acceptance.",
      "addresses_issue": "i2",
      "key_observation": "Payment by Eastern Bank Madras is advance to customer, not price payment."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The sales took place outside British India and the profits derived from such sales arose outside British India.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The profits derived from such sales were received outside British India by the agent in London.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "The Prinz Adalbert",
      "citation": "L.R. 1917 A.C. 586",
      "treatment": "followed",
      "relevance": "Explains nature of discounting bill of exchange with bill of lading as security; banker acts on shipper's mandate upon acceptance."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "section 66(1)"
      ],
      "relevance": "Basis for reference of questions by Tribunal to High Court."
    },
    {
      "name": "Indian Sale of Goods Act",
      "sections": [
        "section 4",
        "section 18",
        "section 23",
        "section 25"
      ],
      "relevance": "Determines when property in goods passes in contracts for unascertained goods; seller can reserve right of disposal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court and Tribunal, answering both referred questions in the affirmative: profits arose and were received outside British India. Appeal by Commissioner dismissed.",
    "relief_granted": "Assessment on profits from export sales not taxable in British India upheld in favor of assessee.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It must, therefore, follow that at the earliest the property in the goods passed in London where the bill of lading was handed over to the buyers Bank against the acceptance of the relative bill of exchange.\"",
      "speaker": "court",
      "significance": "Determines place of sale as outside British India."
    },
    {
      "text": "\"The first receipt of the price, therefore, as pointed out by the High Court, was by the Eastern Bank Ltd., London, on behalf of the sellers.\"",
      "speaker": "court",
      "significance": "Establishes place of receipt of profits as London."
    },
    {
      "text": "\"When a shipper takes his draft, not as yet accepted, but accompanied by a bill of lading... and discounts it with a banker, he makes himself liable on the instrument as drawer, and he further makes the goods... security for its payment.\"",
      "speaker": "court",
      "significance": "Quotes precedent to explain advance nature of bank payment."
    }
  ],
  "_case_id": "1954_116",
  "_label": 0,
  "_text_length": 22538,
  "_extracted_at": "2026-02-10T19:18:15.676181"
}