{
  "metadata": {
    "case_name": "Appellant v. Respondents",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar J."
    ],
    "case_number": "Civil Appeal No. 31 of 1954",
    "date_of_judgment": "1954-05-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The suit was instituted by the appellant on a hundi for Rs. 10,000 dated 4th December, 1947, drawn in his favour by Haji Jethabhai Gokuil and Co. of Basra on the respondents, who are merchants and commission agents in Bombay.",
      "type": "material",
      "date": "1947-12-04",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The hundi was sent by registered post to the appellant in Bombay, and was actually received by one Parikh Vrajlal Narandas, who presented it to the respondents on 10th December, 1947, and received payment therefor.",
      "type": "material",
      "date": "1947-12-10",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellant had been doing business in forward contracts through Vrajlal as his commission agent, and was actually residing at his Pedhi.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 12th January, 1948, the appellant sent a notice to the respondents repudiating the authority of Vrajlal to act for him and demanding the return of the hundi.",
      "type": "procedural",
      "date": "1948-01-12",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Respondents sent a reply on 10th February, 1948, denying their liability and stating that Vrajlal was the agent of the appellant, and that the amount was paid to him bona fide on his representation that he was authorised to receive the payment.",
      "type": "procedural",
      "date": "1948-02-10",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "On 9th December, 1950, the appellant instituted the present suit in the Court of the City Civil Judge, Bombay in Suit No. 2310 of 1950. In the plaint he merely alleged that the payment to Vrajlal was not binding on him, and that the defendant-drawee remained liable on the hundi.",
      "type": "procedural",
      "date": "1950-12-09",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Defendants pleaded that Vrajlal had authority to grant discharge, and that the plaint did not disclose a cause of action as there was no averment that the hundi had been accepted by them.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "At trial, appellant gave evidence that Vrajlal had received the registered cover containing the hundi in his absence, and collected the amount due thereunder without his knowledge or authority. The City Civil Judge accepted this evidence, held Vrajlal had no authority to receive the amount, and that the plea of discharge implied acceptance. Decreed the suit on 24th July, 1951.",
      "type": "admitted",
      "date": "1951-07-24",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Defendants appealed to High Court of Bombay in Appeal No. 811 of 1951. Chagla C.J. and Shah J. held no right of action unless accepted, and plaint had no allegation of acceptance, so no cause of action. Allowed appeal and dismissed suit on 9th September, 1952.",
      "type": "procedural",
      "date": "1952-09-09",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Plaintiff (appellant) prefers appeal by special leave under Article 136 of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the drawee of a negotiable instrument (hundi payable on demand) is liable to the payee absent acceptance.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there was valid presentment for acceptance by Vrajlal on behalf of the appellant.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether acceptance can be implied from payment to Vrajlal, possession of hundi, or plea of discharge.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Payment to Vrajlal was not binding as he had no authority.",
      "supporting_facts": [
        "f2",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Acceptance must be implied from respondents receiving the bill and making payment, as it acknowledges liability to the lawful holder.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Possession of hundi by defendants constitutes acceptance.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Common law (verbal acceptance valid)"
    },
    {
      "id": "pa4",
      "text": "Plea of discharge implies acknowledgment of liability, sufficient for right of action.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Vrajlal was the agent of the appellant and payment was made bona fide.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Plaint does not disclose cause of action as no averment of acceptance.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Negotiable Instruments Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Drawee not liable to payee unless accepts the bill, per Section 32 NI Act. No provision makes drawee liable as such, except for cheques under s.31.",
      "addresses_issue": "i1",
      "key_observation": "Liability arises only on acceptance establishing privity."
    },
    {
      "id": "cr2",
      "text": "For bill payable on demand, presentment for acceptance and payment synchronize; valid presentment requires authority of holder under s.78.",
      "addresses_issue": "i2",
      "key_observation": "Vrajlal lacked authority to receive payment, hence no valid presentment for acceptance."
    },
    {
      "id": "cr3",
      "text": "Acceptance invalid unless written and signed by drawee per s.7 NI Act; no oral or implied acceptance by conduct or possession.",
      "addresses_issue": "i3",
      "key_observation": "Plea of discharge implies acknowledgment but not signed acceptance on bill."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Drawee of negotiable instrument not liable to payee without acceptance.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No valid presentment for acceptance as Vrajlal unauthorized.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No valid acceptance; plea of discharge insufficient.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Seth Khandas Narandas v. Dahibai",
      "citation": "I.L.R. 3 Bom. 182",
      "treatment": "followed",
      "relevance": "Where there is no acceptance, no cause of action to payee against drawee."
    },
    {
      "case_name": "Ram Ravji Jambhekar v. Pralhaddas Subkarn",
      "citation": "I.L.R. 20 Bom. 133",
      "treatment": "followed",
      "relevance": "Presentment for acceptance precedes presentment for payment."
    },
    {
      "case_name": "Bank of England v. Archer",
      "citation": "1843 I M. & W. 383",
      "treatment": "referred",
      "relevance": "Under common law, verbal acceptance valid."
    },
    {
      "case_name": "Harvey v. Martin",
      "citation": "1808 1 Camp. 425",
      "treatment": "referred",
      "relevance": "Acceptance implied from undue retention under common law."
    }
  ],
  "statutes_cited": [
    {
      "name": "Negotiable Instruments Act",
      "sections": [
        "Section 7",
        "Section 31",
        "Section 32",
        "Section 61",
        "Section 64",
        "Section 78"
      ],
      "relevance": "Defines acceptance (s.7), liability on acceptance (s.32), presentment requirements."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 136"
      ],
      "relevance": "Special leave to appeal."
    },
    {
      "name": "Bills of Exchange Act, 1882 (England)",
      "sections": [
        "Section 17"
      ],
      "relevance": "Acceptance must be written and signed; followed in NI Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's decision, holding no valid presentment or acceptance of the hundi, thus no liability on respondents to appellant. Appeal dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the drawee of a negotiable instrument is not liable on it to the payee, unless he has accepted it.\"",
      "speaker": "court",
      "significance": "Core legal position affirmed."
    },
    {
      "text": "\"It is acceptance that establishes privity on the instrument between the payee and the drawee.\"",
      "speaker": "court",
      "significance": "Explains requirement for liability."
    },
    {
      "text": "\"there was neither a valid presentment of the hundi for acceptance, nor a valid acceptance thereof.\"",
      "speaker": "court",
      "significance": "Conclusion dismissing appeal."
    }
  ],
  "_case_id": "1954_132",
  "_label": 0,
  "_text_length": 10622,
  "_extracted_at": "2026-02-10T19:18:14.756892"
}