{
  "metadata": {
    "case_name": "Appellant v. Jadumoni Mangaraj & Ors.",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Ayyar J."
    ],
    "case_number": "Civil Appeal No. 25 of 1954",
    "date_of_judgment": "1954-04-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Four persons, the appellant and respondents Nos. 1 to 3, were duly nominated for election to the seat from Kendrapara Constituency, Orissa Legislative Assembly.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Loknath Das, the third respondent, withdrew his candidature, leaving the contest to the other three.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Election held between 9th and 15th January 1952; appellant secured the largest number of votes and was declared elected.",
      "type": "material",
      "date": "1952-01-09 to 1952-01-15",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent Jadumoni Mangaraj presented petition under section 81 of Representation of the People Act No. XLIII of 1951 alleging corrupt practices by appellant, praying election be set aside.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Last date for presenting petition was 4th April 1952; delivered at post office at Cuttack on 3rd April 1952 for registered post, reached Election Commission at Delhi on 5th April 1952.",
      "type": "procedural",
      "date": "1952-04-03 to 1952-04-05",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Petition defective in verification as it did not specify which paragraphs verified on personal knowledge and which on information received and believed to be true, per Order VI rule 15(2) CPC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Election Commission condoned delay by order dated 2nd July 1952.",
      "type": "procedural",
      "date": "1952-07-02",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Election Commission by communication dated 3rd July 1952 drew attention to defect in verification and suggested applying to Tribunal for amendment.",
      "type": "procedural",
      "date": "1952-07-03",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Order passed under section 86 appointing Election Tribunal, Cuttack, on 15th July 1952.",
      "type": "procedural",
      "date": "1952-07-15",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Petitioner applied to Election Tribunal for amending verification; ordered and amended on 24th July 1952 to conform to Order VI rule 15(2) CPC.",
      "type": "procedural",
      "date": "1952-07-24",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Election Tribunal by judgment dated 16th November 1953 held by majority three corrupt practices established: (1) appellant induced third respondent to withdraw on promise of employment violating sec 123(1); (2) used Bus No. O.R.C. 1545 for conveying electors violating sec 123(6); (3) obtained assistance of Extra Departmental Agents and Presidents of Chaukidari Union, viewed as Government servants, violating sec 123(8). Set aside election.",
      "type": "material",
      "date": "1953-11-16",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appeal by special leave granted by Supreme Court on 11th December 1953.",
      "type": "procedural",
      "date": "1953-12-11",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the election petition was maintainable given it was presented late (beyond 4th April 1952) and had defective verification.",
      "framed_by": "appellant"
    },
    {
      "id": "i2",
      "text": "Whether Election Commission could condone delay suo motu under proviso to sec 85 RPA without application by petitioner.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Election Tribunal had power under sec 90(4) to condone defects in presentation and verification despite sec 85.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether findings of corrupt practices by Tribunal were perverse or based on no evidence.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Petition presented out of time and verification defective, liable to dismissal by Election Commission under sec 85; Tribunal should dismiss as not maintainable.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Secs 81, 83, 85 RPA 1951"
    },
    {
      "id": "pa2",
      "text": "Election Commission order condoning delay invalid as passed suo motu without application by petitioner.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Proviso to sec 85 RPA; analogous to sec 5 Limitation Act"
    },
    {
      "id": "pa3",
      "text": "Proviso to sec 85 requires petitioner to satisfy Commission in person.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Proviso to sec 85 RPA"
    },
    {
      "id": "pa4",
      "text": "Tribunal order under sec 86 without jurisdiction as petition liable to dismissal under sec 85; proceedings nullity.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Secs 85, 86 RPA"
    },
    {
      "id": "pa5",
      "text": "Tribunal findings on corrupt practices not justified by evidence; perverse.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Article 136 Constitution"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Findings on corrupt practices (promise to withdraw, use of bus) are pure questions of fact supported by evidence, not perverse; no interference under Art 136 especially for Election Tribunals.",
      "addresses_issue": "i4",
      "key_observation": "Findings supported by evidence, cannot be characterised as perverse."
    },
    {
      "id": "cr2",
      "text": "EC can condone delay suo motu under proviso to sec 85 without notice or enquiry; decision final, not reviewable by Tribunal.",
      "addresses_issue": "i2",
      "key_observation": "Policy treats delay as matter between EC and petitioner; differs from Limitation Act sec 5."
    },
    {
      "id": "cr3",
      "text": "Sec 90(4) gives Tribunal discretion to dismiss or not for non-compliance with secs 81,83,117 notwithstanding sec 85; overrides EC power but not review of EC orders.",
      "addresses_issue": "i1",
      "key_observation": "Tribunal can condone defects; order declining dismissal final."
    },
    {
      "id": "cr4",
      "text": "Delay condonation proper: petition posted one day early, received one day late; sufficient cause liberally construed.",
      "addresses_issue": "i1",
      "key_observation": "No negligence; advances substantial justice."
    },
    {
      "id": "cr5",
      "text": "Proviso to sec 85 does not require personal appearance of petitioner.",
      "addresses_issue": "i3",
      "key_observation": "Satisfy Commission that sufficient cause existed; can be otherwise than personally."
    },
    {
      "id": "cr6",
      "text": "Jurisdiction under sec 86 arises if petition not dismissed under sec 85 (factual); sec 90(4) allows Tribunal discretion even if liable to dismissal.",
      "addresses_issue": "i3",
      "key_observation": "Tribunal amendment of verification and refusal to dismiss valid."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Election petition maintainable; delay properly condoned by EC under proviso to sec 85 suo motu.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Tribunal has discretion under sec 90(4) to condone defects in presentation and verification notwithstanding sec 85.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No interference with Tribunal findings on corrupt practices under Art 136.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jagan Nath v. Jaswant Singh",
      "citation": "A.I.R. 1954 S.C. 210",
      "treatment": "followed",
      "relevance": "Rights in election petitions statutory; determined by reference to statutes creating them."
    },
    {
      "case_name": "Krishna v. Chathappan",
      "citation": null,
      "treatment": "followed",
      "relevance": "Sufficient cause under Limitation Act liberally construed to advance substantial justice absent negligence."
    },
    {
      "case_name": "Krishnasami Panikondar v. Ramasami Chettiar",
      "citation": "45 I.A. 25",
      "treatment": "referred",
      "relevance": "Order excusing delay under Limitation Act sec 5 not final, open to question."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "81",
        "83",
        "85",
        "86",
        "90(4)",
        "117",
        "123(1)",
        "123(6)",
        "123(8)"
      ],
      "relevance": "Governs presentation, verification, dismissal/condonation of election petitions, corrupt practices; Tribunal discretion to condone defects."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order VI rule 15(2)"
      ],
      "relevance": "Manner of verification of pleadings applied to election petitions."
    },
    {
      "name": "Limitation Act",
      "sections": [
        "5"
      ],
      "relevance": "Analogous for condonation of delay but distinguished as not final."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "136"
      ],
      "relevance": "Special leave appeals; no re-appreciation of facts unless perverse."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; Election Tribunal's order setting aside appellant's election upheld as petition maintainable and corrupt practices proved.",
    "relief_granted": "None to appellant; election set aside confirmed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "This Court does not, when hearing appeals under article 136, sit as a Court of further appeal on facts, and does not interfere with findings given on a consideration of the evidence, unless they are perverse or based on no evidence.",
      "speaker": "court",
      "significance": "Limits SC review of Tribunal fact findings."
    },
    {
      "text": "The words 'Sufficient cause' should receive a liberal construction so as to advance substantial justice when no negligence nor inaction nor want of bona fides is imputable to the appellant.",
      "speaker": "court",
      "significance": "Justifies condonation of delay."
    },
    {
      "text": "The policy underlying the provision is to treat the question of delay as one between the Election Commission and the petitioner, and to make the decision of the Election Commission on the question final.",
      "speaker": "court",
      "significance": "EC condonation final, suo motu valid."
    }
  ],
  "_case_id": "1954_96",
  "_label": 0,
  "_text_length": 18244,
  "_extracted_at": "2026-02-08T22:14:46.633305"
}