{
  "metadata": {
    "case_name": "Kishore Chandra Singh Deo v. Legal Representatives of Radha Prasad Bhagat",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar J."
    ],
    "case_number": "Civil Appeals Nos. 1 and 2 of 1949",
    "date_of_judgment": "1954-03-09"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Mortgage deed Exhibit A dated 5th April 1923 executed by defendant in favour of Radha Prasad Bhagat for Rs. 1,25,000 over Bodogodo Zemindari estate in Ganjam District, Madras Province, governed by Madras Impartible Estates Act 11 of 1904.",
      "type": "background",
      "date": "1923-04-05",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Deed recites Rs. 12,500 advanced on promissory note Exhibit J dated 30th March 1923, balance Rs. 1,12,500 paid in cash, borrowed for expenses of marriage of defendant's second daughter with eldest son of Rajah of Talcher; marriage took place on 27th April 1923.",
      "type": "admitted",
      "date": "1923-03-30",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Rs. 1,12,500 actually paid on 14th April 1923 to Mr. Henry Tapp, defendant's manager, on defendant's authority after mortgage registered on 10th April 1923.",
      "type": "material",
      "date": "1923-04-14",
      "source": "plaintiffs"
    },
    {
      "id": "f4",
      "text": "Defendant made payments towards mortgage in 1926 and 1927 aggregating Rs. 42,000.",
      "type": "admitted",
      "date": "1926-1927",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Mortgagee Radha Prasad Bhagat died on 18th November 1933; legal representatives filed suit in 1935 (Original Suit No. 11 of 1935) for balance due by sale of property.",
      "type": "procedural",
      "date": "1935",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Subordinate Judge of Berhampore decreed for plaintiffs on 23rd November 1936: no consideration for Exhibit J (salami), but Rs. 1,12,500 paid to Tapp authorised, bond duly attested and registered.",
      "type": "procedural",
      "date": "1936-11-23",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "High Court of Patna on 22nd December 1942 concurred on payment to Tapp, attestation and registration, but held Exhibit J supported by consideration; discharged finding on binding nature under Impartible Estates Act leaving open.",
      "type": "procedural",
      "date": "1942-12-22",
      "source": "high_court"
    },
    {
      "id": "f8",
      "text": "Power-of-attorney Exhibit B executed by defendant before Registrar at residence of Chief of Hindol at Cuttack; defendant described as temporarily residing there; Registrar examined and authenticated under section 33 Registration Act.",
      "type": "material",
      "date": "1923-04-05",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Exhibit B presented by P. Sundaram, described as personal assistant; contained endorsement of presentation for registration but actually only authenticated, not registered.",
      "type": "disputed",
      "date": "1923-04-05",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Defendant resided at Cuttack for a week prior, son's studies there, borrowed Rs.12,500 under Exhibit J there, came for loan negotiations.",
      "type": "material",
      "date": "1923",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Defendant died while appeals pending; legal representatives prosecuting.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether mortgage bond Exhibit A was validly registered in accordance with sections 32 and 33 of the Registration Act via power-of-attorney Exhibit B.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether defendant was residing at Cuttack for purposes of section 33(1)(a) Registration Act at time of Exhibit B.",
      "framed_by": "appellant"
    },
    {
      "id": "i3",
      "text": "Whether presentation of Exhibit B by Sundaram invalidates authentication under section 32.",
      "framed_by": "appellant"
    },
    {
      "id": "i4",
      "text": "Whether authentication at residence valid absent bodily infirmity under proviso to section 33(1).",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Mortgage supported by consideration only to extent of Rs.25,000, discharged by payments.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Mortgage bond not duly attested or validly registered, hence void.",
      "supporting_facts": [],
      "legal_basis": "Sections 32, 33 Registration Act"
    },
    {
      "id": "pa3",
      "text": "Defendant not residing at Cuttack at time of Exhibit B, Registrar no jurisdiction under section 33(1)(a).",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Section 33(1)(a) Registration Act"
    },
    {
      "id": "pa4",
      "text": "Exhibit B presented for registration by unauthorised Sundaram, presentation void under section 32, authentication invalid.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Sections 32, 33 Registration Act"
    },
    {
      "id": "pa5",
      "text": "No bodily infirmity, authentication at residence under proviso to section 33(1) bad.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Proviso to Section 33(1) Registration Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Rs.1,12,500 paid to Tapp under defendant's authority.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Exhibit J supported by consideration.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Mortgage bond duly attested and validly registered.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Sections 32, 33 Registration Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Courts below found Rs.1,12,500 paid to Tapp authorised, bond duly attested and supported by consideration including Exhibit J; affirmed.",
      "addresses_issue": "i1",
      "key_observation": "Mortgage bond supported by consideration and duly attested."
    },
    {
      "id": "cr2",
      "text": "Temporary residence at Cuttack sufficient under section 33(1)(a); facts show defendant resided there a week, for loan business, son's studies; Registrar's endorsement confirms residence.",
      "addresses_issue": "i2",
      "key_observation": "Even temporary residence clothes Registrar with jurisdiction."
    },
    {
      "id": "cr3",
      "text": "Exhibit B produced for authentication, not registration; endorsement of presentation a mistake; authentication independent and valid under section 33; any invalid presentation cured by Registrar's attendance.",
      "addresses_issue": "i3",
      "key_observation": "Section 32 applies to registration, not mere authentication."
    },
    {
      "id": "cr4",
      "text": "Registrar's decision on bodily infirmity procedural, within jurisdiction; even if erroneous, does not invalidate; defendant re-signed before Registrar.",
      "addresses_issue": "i4",
      "key_observation": "Mistake in exercise of jurisdiction does not affect validity."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Document presented by unauthorised agent under invalid power renders registration void.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Temporary residence sufficient for section 33(1)(a); Registrar's endorsement evidence of residence.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Authentication under section 33 valid even if initial presentation erroneous.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Registrar's finding of infirmity procedural, non-jurisdictional error does not invalidate registration.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jambu Prasad v. Muhammad Aftar Ali Khan",
      "citation": "42 I.A. 22; I.L.R. 28 All. 707",
      "treatment": "followed",
      "relevance": "Sections 32,33 imperative; unauthorised presentation makes registration void."
    },
    {
      "case_name": "Ishri Prasad v. Baijnath",
      "citation": null,
      "treatment": "followed",
      "relevance": "Approved in Jambu Prasad on imperative nature of sections 32,33."
    },
    {
      "case_name": "Sharat Chandra Basu v. Bijay Chand Mahtab",
      "citation": "64 I.A. 77",
      "treatment": "followed",
      "relevance": "Temporary residence sufficient under section 33; Registrar's endorsement evidence."
    },
    {
      "case_name": "Bharat Indu v. Hamid Ali Khan",
      "citation": "47 I.A. 177",
      "treatment": "followed",
      "relevance": "Subsequent authentication at residence cures invalid initial presentation."
    },
    {
      "case_name": "Ma Pwa May v. Chettiar Firm",
      "citation": "56 I.A. 379",
      "treatment": "followed",
      "relevance": "Distinguish jurisdictional defects from procedural mistakes by Registrar."
    },
    {
      "case_name": "Mujibunnissa v. Abdul Rahim",
      "citation": "28 I.A. 15",
      "treatment": "referred",
      "relevance": "Examples of lack of jurisdiction making registration inoperative."
    }
  ],
  "statutes_cited": [
    {
      "name": "Registration Act, 1908",
      "sections": [
        "Section 32",
        "Section 33"
      ],
      "relevance": "Governs presentation and authentication of power-of-attorney for registration of mortgage."
    },
    {
      "name": "Madras Impartible Estates Act 11 of 1904",
      "sections": [
        "Section 4"
      ],
      "relevance": "Whether mortgage binding on impartible estate; issue left open by High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals, affirming High Court decree enforcing the mortgage; held power-of-attorney Exhibit B validly authenticated under section 33 Registration Act, mortgage validly registered.",
    "relief_granted": "None to appellant; mortgage decree upheld for respondents.",
    "costs": "Not specified explicitly; standard costs implied."
  },
  "key_quotes": [
    {
      "text": "\"The expression 'resides', as used in section 33, is not defined in the statute but there is no reason for assuming that it contemplates only permanent residence and excludes temporary residence.\"",
      "speaker": "court",
      "significance": "Clarifies scope of 'resides' for jurisdiction under section 33(1)(a)."
    },
    {
      "text": "\"A decision of the Registrar that an applicant was suffering from bodily infirmity for the purposes of section 33(1), proviso, clause (1), relates to a mere matter of procedure not affecting his jurisdiction.\"",
      "speaker": "court",
      "significance": "Distinguishes procedural errors from jurisdictional defects."
    },
    {
      "text": "\"The terms of sections 32 and 33 of Act III of 1877 are imperative, and that a presentation of a document for registration by an agent who has not been duly authorized in accordance with those sections, does not give to the Registering Officer the indispensable foundation.\"",
      "speaker": "court",
      "significance": "States rule on invalid presentation rendering registration void."
    }
  ],
  "_case_id": "1954_150",
  "_label": 0,
  "_text_length": 19857,
  "_extracted_at": "2026-02-08T22:15:13.571546"
}