{
  "metadata": {
    "case_name": "Appellants v. State of Bihar",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "DAS J."
    ],
    "case_number": "Criminal Appeal No. 83 of 1953",
    "date_of_judgment": "1954-12-02"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The case against the appellants was investigated by the local police and on the 4th June, 1951 a challan was submitted before the Sub-Divisional Magistrate.",
      "type": "procedural",
      "date": "1951-06-04",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Sub-Divisional Magistrate passed the following order in the order-sheet: Let the record be sent to the Dy. Commr., Hazaribagh for transferring it to the file of the Spl. Magistrate for trial.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "The Deputy Commissioner passed the following order: Perused S.D.Os order-sheet. Withdrawn and transferred to the file of Mr. S. F. Azam, Magte. with powers u/s 30, Cr. P.C. for favour of disposal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The appellants were tried by Mr. S. F. Azam, Magistrate of the first class exercising powers under section 30 of the Code of Criminal Procedure on charges under sections 366 and 143 of the Indian Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Each of the appellants was convicted under both sections and sentenced to rigorous imprisonment for five years under section 366, Indian Penal Code, no separate sentence having been passed under section 143.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The appellants preferred an appeal to the High Court of Judicature at Patna. The appeal was heard by a Bench consisting of S. K. Das and C. P. Sinha, JJ.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "There was a difference of opinion between the two learned Judges as to the constitutionality of section 30 of the Code of Criminal Procedure. S. K. Das, J., took the view that the impugned section did not bring about any discrimination or inequality between persons similarly circumstanced and consequently did not offend the equal protection clause of the Constitution, while C. P. Sinha, J., was of the opinion that the section was hit by article 14.",
      "type": "disputed",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f8",
      "text": "The appeal was thereupon placed before Reuben, C. J., who in agreement with S. K. Das, J., held that section 30 did not violate the inhibition of article 14. The learned Chief Justice upheld the conviction but reduced the sentence.",
      "type": "procedural",
      "date": "1953-08-25",
      "source": "high_court"
    },
    {
      "id": "f9",
      "text": "On application by the appellants the High Court granted them a certificate under article 132(1) and the present appeal has been filed accordingly.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether section 30 of the Code of Criminal Procedure violates Article 14 of the Constitution of India by discriminating against accused persons tried by a section 30 Magistrate instead of a Court of Session.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The appellants had been tried by a section 30 Magistrate and not by a Court of Session. A section 30 Magistrate is enjoined by that section to try the case brought before him as a Magistrate and accordingly in cases like the present case he will follow the warrant procedure which is different from the procedure followed by a Court of Session.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Article 14 of the Constitution of India"
    },
    {
      "id": "pa2",
      "text": "A trial before the Sessions Judge is much more advantageous to the accused person in that he gets the benefit of the commitment proceedings before a Magistrate and then a trial before the Sessions Judge with the aid of the jury or assessors.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Although the section itself may not be discriminatory, it may lend itself to abuse bringing about a discrimination between persons accused of offences of the same kind, for the police may send up a person accused of an offence under section 366 to a section 30 Magistrate and the police may send another person accused of an offence under the same section to a Magistrate who can commit the accused to the Court of Session.",
      "supporting_facts": [],
      "legal_basis": "Yick Wo v. Hopkins (US case)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Section 30 does not bring about any discrimination or inequality between persons similarly circumstanced and consequently does not offend the equal protection clause of the Constitution.",
      "supporting_facts": [],
      "legal_basis": "Article 14; Section 30 CrPC"
    },
    {
      "id": "ra2",
      "text": "Section 30 abrogates or overrides altogether the provisions of section 28 and the second schedule in the sense that in the specified territories Magistrates empowered under section 30 become an additional court in which all offences not punishable with death become triable.",
      "supporting_facts": [],
      "legal_basis": "Sections 28, 30 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Article 14 forbids class legislation but does not forbid reasonable classification for the purposes of legislation. Two conditions: (i) classification founded on intelligible differentia distinguishing grouped persons from others; (ii) differentia has rational relation to object sought.",
      "addresses_issue": "i1",
      "key_observation": "Classification may be geographical; section 30 based on territorial needs in specified areas."
    },
    {
      "id": "cr2",
      "text": "Article 14 condemns discrimination not only by substantive law but also by procedure. There are four modes of trial in CrPC with different procedures.",
      "addresses_issue": "i1",
      "key_observation": "Section 30 adds section 30 Magistrate as additional court for offences not punishable with death in specified areas."
    },
    {
      "id": "cr3",
      "text": "The ultimate decision as to whether a person charged under section 366 should be tried by the Court of Session or by a section 30 Magistrate does not depend merely on the whim of police or executive but on proper exercise of judicial discretion by the Magistrate concerned.",
      "addresses_issue": "i1",
      "key_observation": "Judicial discretion at stages under ss. 209, 347, 528 CrPC prevents capricious discrimination."
    },
    {
      "id": "cr4",
      "text": "No suggestion of intentional or purposeful discrimination against appellants; judicial discretion not arbitrary, subject to revision.",
      "addresses_issue": "i1",
      "key_observation": "No case of infringement of Article 14 made out."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 30 of the Code of Criminal Procedure does not violate Article 14 of the Constitution.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chiranjit Lal Chowdhuri v. Union of India",
      "citation": "1950 S.C.R. 869",
      "treatment": "referred",
      "relevance": "Discussion on Article 14"
    },
    {
      "case_name": "State of Bombay v. F.N. Balsara",
      "citation": "1951 S.C.R. 682",
      "treatment": "referred",
      "relevance": "Discussion on Article 14"
    },
    {
      "case_name": "State of West Bengal v. Anwar Ali Sarkar",
      "citation": "1952 S.C.R. 284",
      "treatment": "referred",
      "relevance": "Discussion on Article 14"
    },
    {
      "case_name": "Kathi Raning Rawat v. State of Saurashtra",
      "citation": "1952 S.C.R. 435",
      "treatment": "referred",
      "relevance": "Discussion on Article 14"
    },
    {
      "case_name": "Lachmandas Kewalram Ahuja v. State of Bombay",
      "citation": "1952 S.C.R. 710",
      "treatment": "referred",
      "relevance": "Discussion on Article 14"
    },
    {
      "case_name": "Qasim Razvi v. State of Hyderabad",
      "citation": "1953 S.C.R. 581",
      "treatment": "referred",
      "relevance": "Discussion on Article 14"
    },
    {
      "case_name": "Habeeb Mohamad v. State of Hyderabad",
      "citation": "1953 S.C.R. 661",
      "treatment": "referred",
      "relevance": "Discussion on Article 14"
    },
    {
      "case_name": "State of Punjab v. Ajaib Singh",
      "citation": "1953 S.C.R. 254",
      "treatment": "followed",
      "relevance": "Upholding territorial classification in Abducted Persons Recovery and Restoration Act"
    },
    {
      "case_name": "Yick Wo v. Hopkins",
      "citation": "118 U.S. 356",
      "treatment": "distinguished",
      "relevance": "Administration with evil eye leading to discrimination"
    },
    {
      "case_name": "Snowden v. Hughes",
      "citation": "321 U.S. 1",
      "treatment": "referred",
      "relevance": "No denial of equal protection unless intentional purposeful discrimination"
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "30",
        "28",
        "29",
        "34",
        "347",
        "528",
        "209",
        "210",
        "208"
      ],
      "relevance": "Empowers Magistrates to try serious offences as Magistrate; limits punishment; allows commitment or transfer; judicial discretion in trial forum"
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "366",
        "143"
      ],
      "relevance": "Offences charged: kidnapping/abduction and unlawful assembly"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "14",
        "132(1)"
      ],
      "relevance": "Equal protection; certificate for appeal on substantial constitutional question"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's decision, holding that section 30 CrPC does not violate Article 14. The conviction stands as modified by the High Court which reduced the sentence.",
    "relief_granted": "None to appellants; sentence reduced by High Court",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "While article 14 forbids class legislation, it does not forbid reasonable classification for the purposes of legislation.",
      "speaker": "court",
      "significance": "Core test for Article 14 validity"
    },
    {
      "text": "The ultimate decision as to whether a person charged under section 366 should be tried by the Court of Session or by a section 30 Magistrate does not depend merely on the whim or idiosyncrasies of the police or the executive Government but depends ultimately on the proper exercise of judicial discretion by the Magistrate concerned.",
      "speaker": "court",
      "significance": "Rejects executive whim argument; emphasizes judicial discretion"
    },
    {
      "text": "On the facts and circumstances of this case we find ourselves in agreement with S. K. Das, J., and Reuben, C. J., and hold that no case of infringement of fundamental right under Article 14 has been made out.",
      "speaker": "court",
      "significance": "Final holding dismissing appeal"
    }
  ],
  "_case_id": "1954_68",
  "_label": 0,
  "_text_length": 17744,
  "_extracted_at": "2026-02-08T22:14:36.072468"
}