{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI J."
    ],
    "case_number": "Civil Appeal No. 61 of 1953",
    "date_of_judgment": "1954-12-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant entered into three contracts with respondent: two dated 8th August 1949 for 1,80,000 bags each at Rs. 134/4/- and Rs. 135/4/- per 100 bags, and third dated 17th August 1949 for 90,000 bags at Rs. 138/- per 100 bags, for October, November and December 1949 deliveries in equal monthly instalments on terms of Indian Jute Mills Association contract forms.",
      "type": "material",
      "date": "1949-08-08",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In September 1949, respondent expressed inability to deliver goods under the contracts and requested appellant to settle by selling back the goods at Rs. 161-8-0 per 100 bags.",
      "type": "material",
      "date": "1949-09",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Three settlement contracts entered into on 28th September 1949 whereby appellant agreed to sell goods under original contracts to respondent at Rs. 161-8-0 per 100 bags on terms of Indian Jute Mills Association contract forms.",
      "type": "material",
      "date": "1949-09-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant submitted bills aggregating Rs. 1,15,650 to respondent, which respondent accepted but failed to pay despite demands.",
      "type": "material",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant filed suit on original side of High Court of Calcutta (Suit No. 3614 of 1950) to recover Rs. 1,25,962-2-0 with interest and costs.",
      "type": "procedural",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "West Bengal Jute Goods Future Ordinance, 1949 came into force on 22nd September 1949.",
      "type": "background",
      "date": "1949-09-22",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Government of West Bengal issued Notification No. 4665 Com. dated 23rd September 1949 prohibiting making of contracts relating to jute goods futures on and from date of publication in Official Gazette; published in Calcutta Gazette on 23rd September 1949.",
      "type": "background",
      "date": "1949-09-23",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Notification No. 4666 Com. dated 23rd September 1949 recognised certain jute goods futures markets as notified markets.",
      "type": "background",
      "date": "1949-09-23",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Respondent did not possess or have control over godown and other means for storage and supply of jute goods; never dealt in sale or purchase involving actual delivery.",
      "type": "admitted",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Contracts did not provide for payment or receipt of margin.",
      "type": "admitted",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "In chain contracts: mills held goods, sold to A, A to B, B to defendant (respondent), defendant to plaintiff (appellant), plaintiff to C, C to shipper. Delivery orders or mates receipts passed by endorsement against cash payment.",
      "type": "material",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Trial Court (High Court Ordinary Original Civil Jurisdiction) decreed appellant's claim on 25th May 1951.",
      "type": "procedural",
      "date": "1951-05-25",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "High Court in Appeal from Original Decree No. 124 of 1951 dismissed appellant's suit on 16th May 1952, holding settlement contracts void under Ordinance.",
      "type": "procedural",
      "date": "1952-05-16",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Last closing rate in notified market: Rs. 146/14/- per 100 bags.",
      "type": "background",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the three settlement contracts dated 28th September 1949 were contracts relating to jute goods futures prohibited by the West Bengal Jute Goods Future Ordinance, 1949, and thus void and unenforceable, as respondent was not a person who habitually dealt in sale or purchase of jute goods involving actual delivery of possession thereof.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the respondent habitually dealt in the sale or purchase of jute goods involving the actual delivery of possession thereof.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Interpretation of 'actual delivery of possession' in section 2(1)(b)(i) of the Ordinance: whether it includes symbolic or constructive delivery in chain contracts resulting in ultimate physical delivery.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether the Ordinance was ultra vires.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Delivery orders and mates receipts represent the goods and are dealt with in market as such; each successive buyer paid full price in cash against endorsement, obtaining title and actual delivery of possession; in chain contracts, delivery alongside vessel by mills implements all contracts simultaneously, involving actual delivery all along the chain.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Standard form of Indian Jute Mills Association contracts; Nippon Yusen Kaisha v. Ramjiban"
    },
    {
      "id": "pa2",
      "text": "Legislature does not require dealer to personally give manual delivery; sales and purchases involve actual delivery even if given by third party in performance thereof.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Section 2(1)(b)(i) of Ordinance"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Settlement contracts illegal and void under West Bengal Jute Goods Future Ordinance, 1949 as contracts relating to purchase of jute goods on forward basis by person not habitually dealing in sale/purchase involving actual delivery of possession, without godown etc.",
      "supporting_facts": [
        "f9",
        "f3"
      ],
      "legal_basis": "West Bengal Jute Goods Future Ordinance, 1949, sections 2, 3"
    },
    {
      "id": "ra2",
      "text": "Transactions purely speculative; mere delivery orders passed, no actual physical delivery between intermediate parties, only differences paid.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Section 2(1)(b)(i) of Ordinance requires actual (physical/manual) delivery"
    },
    {
      "id": "ra3",
      "text": "Ordinance ultra vires.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Trial Court correctly held delivery orders represent goods, pass by endorsement against cash payment; in chain contracts, delivery by mills alongside vessel implements all contracts eo instanti, each middleman gives and takes actual delivery simultaneously.",
      "addresses_issue": "i2",
      "key_observation": "Actual delivery occurs all along chain at moment of shipment."
    },
    {
      "id": "cr2",
      "text": "Appeal Court erred in assuming no full price paid except by shipper; evidence shows each buyer paid full price to immediate seller against endorsement.",
      "addresses_issue": "i2",
      "key_observation": "Full cash payments made at each step."
    },
    {
      "id": "cr3",
      "text": "'Actual delivery of possession' in section 2(1)(b)(i) not limited to physical/manual delivery but includes symbolic/constructive delivery via documents like delivery orders/mates receipts, resulting in ultimate physical delivery; word 'involving' means resulting in actual delivery in ultimate analysis.",
      "addresses_issue": "i3",
      "key_observation": "Narrow construction would make jute trade impossible; Ordinance targets dealings in differences only."
    },
    {
      "id": "cr4",
      "text": "Ordinance intra vires under Head 27 List II, Government of India Act: Trade and commerce within Province, markets and fairs.",
      "addresses_issue": "i4",
      "key_observation": "Provincial Legislature competent."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Settlement contracts not void under Ordinance as respondent's dealings involved actual delivery of possession via chain contracts and document transfers resulting in ultimate physical delivery.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "'Actual delivery of possession' includes constructive/symbolic delivery in chain contracts where documents pass against payment, culminating in physical delivery.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Ordinance not ultra vires.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Nippon Yusen Kaisha v. Ramjiban",
      "citation": "1938 L.R. 65 I.A. 263",
      "treatment": "followed",
      "relevance": "Observations on standard Indian Jute Mills Association contract form: property passes on delivery alongside; entire export business conducted under this form."
    }
  ],
  "statutes_cited": [
    {
      "name": "West Bengal Jute Goods Future Ordinance, 1949",
      "sections": [
        "Section 2",
        "Section 3(1)",
        "Section 3(2)"
      ],
      "relevance": "Defined jute goods futures contracts; prohibited such contracts post-notification; voided contravening contracts; settlement on last closing rate in notified market."
    },
    {
      "name": "Indian Sale of Goods Act",
      "sections": [
        "Section 2(2)",
        "Section 2(4)",
        "Section 30",
        "Proviso to Section 36(3)",
        "Proviso to Section 53(1)"
      ],
      "relevance": "Definition of delivery as voluntary transfer of possession (includes symbolic/constructive); documents of title; transfer of documents tantamount to transfer of goods possession."
    },
    {
      "name": "Government of India Act",
      "sections": [
        "Head 27 of List II, Seventh Schedule"
      ],
      "relevance": "Legislative competence of Province on trade, commerce, markets."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, reversed High Court judgment dismissing suit, upheld Trial Court decree for appellant's claim; settlement contracts held valid and enforceable.",
    "relief_granted": "Recovery of Rs. 1,15,650 with interest and costs as per Trial Court decree.",
    "costs": "With costs (as per Trial Court; High Court costs not specified)"
  },
  "key_quotes": [
    {
      "text": "\"The sales and purchases of the dealer involve actual delivery if such actual delivery is given not by the dealer but by a third party in performance of and in relation to the sales and purchases of the dealer.\"",
      "speaker": "court",
      "significance": "Interprets 'involving actual delivery' broadly, not requiring personal manual delivery."
    },
    {
      "text": "\"Prima facie at the moment of the delivery alongside the steamer there is appropriation and the passing of the property in the goods and the giving and taking of actual delivery of possession thereof all along the chain at the same moment.\"",
      "speaker": "trial_judge",
      "significance": "Explains simultaneous delivery in chain contracts."
    },
    {
      "text": "\"This is a form under which the entire export business in gunnies in Calcutta is conducted.\"",
      "speaker": "Lord Wright in Nippon Yusen",
      "significance": "Validates standard jute contract practices involving delivery alongside."
    }
  ],
  "_case_id": "1954_71",
  "_label": 1,
  "_text_length": 22244,
  "_extracted_at": "2026-02-08T22:14:45.985387"
}