{
  "metadata": {
    "case_name": "Achhru Ram v. Respondent No. 1",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "MUKERJEA, J."
    ],
    "case_number": "Civil Appeal No. 15 of 1951",
    "date_of_judgment": "1954-04-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The premises in suit belonged to defendants Nos. 2 to 5, who are residents of Calcutta and they sold it by a conveyance executed on the 29th March, 1941, and registered on the 3rd of April following, to defendant No. 1, also a resident of Calcutta, for the price of Rs. 7,000.",
      "type": "material",
      "date": "1941-03-29",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The plaintiff is the owner of the two premises to wit, premises Nos. D 37/85 and D 37/44, within the same Mohalla of the city of Banaras, which are in close proximity to the property in dispute and adjoin it on the northern and eastern sides respectively.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The plaintiff is the landlord of the property in suit and the vendors were his tenants.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Plaintiff commenced the suit, Original Suit No. 79 of 1941, in the Court of the Civil Judge at Banaras for enforcement of his right of pre-emption in respect of an enclosed plot of land with certain structures upon it, situated within Mohalla Baradeo in the city of Banaras and bearing Municipal No. D 37/48.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "As soon as the plaintiff received news of the sale, he made an immediate assertion or demand of his rights and repeated the same in the presence of the witnesses as required by Muhammadan Law and he further sent a registered notice to defendant No. 1 on the 21st May, 1941, asking the latter to transfer the property to the plaintiff on receipt of the price which he had actually paid to the vendors.",
      "type": "procedural",
      "date": "1941-05-21",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The Civil Judge who tried the suit held that there was in fact a custom of pre-emption in the city of Banaras, the incidents of which were the same as in Muhammadan Law, but dismissed the suit finding the custom could not be enforced against non-natives/non-domiciled parties and plaintiff did not make requisite demands.",
      "type": "procedural",
      "date": "1941-11-19",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "High Court of Allahabad (Mulla and Yorke JJ.) in First Appeal No. 157 of 1942 affirmed the trial court, holding custom requires vendor and vendee to be natives or domiciled in Banaras; dated 29th August, 1944.",
      "type": "procedural",
      "date": "1944-08-29",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Plaintiff applied for leave to appeal to Judicial Committee, refused by High Court but got special leave dated 11th December, 1945; after abolition, appeal transferred to Supreme Court.",
      "type": "procedural",
      "date": "1945-12-11",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the custom of pre-emption in the city of Banaras is restricted to persons who are inhabitants or domiciled therein, or applies to all owners of property in the city irrespective of nativity or domicile.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the plaintiff made the two demands in the proper manner as required by Muhammadan Law.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the plaintiff, being the landlord, could eject his own tenants by exercise of the right of pre-emption.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Nature of the right of pre-emption: whether it is a personal right of re-purchase or an incident attached to the property.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There is a custom of pre-emption in the entire city of Banaras without restriction or limitation to natives or domiciled persons; all who own property in the city are governed by the custom.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5"
      ],
      "legal_basis": "Custom prevalent in Banaras; various judgments proving custom"
    },
    {
      "id": "pa2",
      "text": "The right of pre-emption is an incident annexed to the lands, not merely a personal right of re-purchase.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Muhammadan Law authorities; Govinda Dayal v. Inayatulla"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Even if custom exists, it can only be availed where both vendors and vendee are natives of or domiciled in Banaras; neither were here as both from Calcutta.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "Local custom requires nativity/domicile; Byjnath Pershad v. Kapilmon Singh; Roland Wilson, Mulla, Tyabji"
    },
    {
      "id": "ra2",
      "text": "Plaintiff did not make demands properly as per Muhammadan Law.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Muhammadan Law requirements"
    },
    {
      "id": "ra3",
      "text": "Landlord cannot eject own tenants via pre-emption.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "No law or custom allows"
    },
    {
      "id": "ra4",
      "text": "Right of pre-emption is personal, not incident of property.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Sheikh Kudratulla v. Mahini Mohan"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The right of pre-emption under Muhammadan Law and custom is not a personal right of re-purchase but an incident attached to the property itself, imposing a limitation on the owner's right of sale; benefit and burden run with the land.",
      "addresses_issue": "i4",
      "key_observation": "Sale is condition precedent to enforceability, not existence; avoids introduction of stranger."
    },
    {
      "id": "cr2",
      "text": "Custom of pre-emption exists in entire city of Banaras, proved by judgments; no evidence it is restricted to natives/domiciled; presumed co-extensive with Muhammadan Law unless contrary proved.",
      "addresses_issue": "i1",
      "key_observation": "Custom becomes lex loci, affects all lands in locality irrespective of owners' religion, nationality, domicile."
    },
    {
      "id": "cr3",
      "text": "Lower courts erred in holding custom inapplicable to non-natives based on wrong assumption of personal nature; decisions like Byjnath incorrect.",
      "addresses_issue": "i1",
      "key_observation": "Right attaches to land, enforceable against any owner."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Local custom of pre-emption exists in city of Banaras attaching to house properties; no incident restricting to natives or domiciled persons.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Right of pre-emption is incident of property, not personal right.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Digambar Singh v. Ahmad",
      "citation": "42 I.A. 10",
      "treatment": "followed",
      "relevance": "Custom of pre-emption may vary from Muhammadan Law or follow it; village customs."
    },
    {
      "case_name": "Jadulal v. Janki Koer",
      "citation": "39 I.A. 101",
      "treatment": "followed",
      "relevance": "Custom among non-Muslims presumed co-extensive with Muhammadan Law unless contrary shown; preliminary forms required."
    },
    {
      "case_name": "Govinda Dayal v. Inayatulla",
      "citation": "7 All. 775",
      "treatment": "followed",
      "relevance": "Right of pre-emption inherent in property, right of substitution; like easement."
    },
    {
      "case_name": "Sheikh Kudratulla v. Mahini Mohan",
      "citation": "Beng. L.R. Full Bench Rulings page 134",
      "treatment": "distinguished",
      "relevance": "Held right is mere re-purchase; based on mistranslation."
    },
    {
      "case_name": "Byjnath Pershad v. Kapilmon Singh",
      "citation": "24 W.R. 95",
      "treatment": "overruled",
      "relevance": "Held custom does not bind non-natives; wrong assumption."
    },
    {
      "case_name": "Chakauri Devi v. Sundari Devi",
      "citation": "28 All. 590",
      "treatment": "referred",
      "relevance": "Affirms custom in Banaras."
    },
    {
      "case_name": "Ram Chandra v. Goswami Ram Puri",
      "citation": "45 All. 501",
      "treatment": "referred",
      "relevance": "Affirms custom in Banaras; confined to house properties."
    },
    {
      "case_name": "Gouri Sankar v. Sitaram",
      "citation": "54 All. 76",
      "treatment": "referred",
      "relevance": "Modifies to include building sites."
    }
  ],
  "statutes_cited": [
    {
      "name": "Muhammadan Law",
      "sections": [
        "Pre-emption rules, demands, vicinage"
      ],
      "relevance": "Incidents of custom same as Muhammadan Law; preliminary demands mandatory."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal allowed, judgments of courts below set aside; case remanded to High Court to decide if demands complied with Muhammadan Law and if landlord can pre-empt own tenants.",
    "relief_granted": "Remand for further consideration; costs of appeal to appellant from respondent No. 1.",
    "costs": "Appellant to have costs of this appeal from respondent No. 1."
  },
  "key_quotes": [
    {
      "text": "The crux of the whole thing is that the benefit as well as the burden of the right of pre-emption run with the land and can be enforced by or against the owner of the land for the time being although the right of the pre-emptor does not amount to an interest in the land itself.",
      "speaker": "court",
      "significance": "Defines nature of pre-emption right as property incident."
    },
    {
      "text": "When a right of pre-emption rests upon custom it becomes the lex loci or the law of the place and affects all lands situated in that place irrespective of the religion or nationality or domicile of the owners of the lands except where such incidents are proved to be a part of the custom itself.",
      "speaker": "court",
      "significance": "Holds custom territorial, not personal."
    }
  ],
  "_case_id": "1954_95",
  "_label": 1,
  "_text_length": 33225,
  "_extracted_at": "2026-02-10T19:18:13.855532"
}