{
  "metadata": {
    "case_name": "Naresh Charan Das Gupta v. Paresh Charan Das Gupta",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar J."
    ],
    "case_number": "Civil Appeal No. 202 of 1952",
    "date_of_judgment": "1954-12-02"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Testator Bhabesh Charan Das Gupta executed will dated 28-11-1943 and died on 27-10-1944 leaving two sons Paresh Charan Das Gupta (first respondent) and Naresh Charan Das Gupta (appellant) and daughter Indira (second respondent).",
      "type": "background",
      "date": "1943-11-28",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Estate consisted of a sixth share in ancestral lands at Matta in District of Dacca and house No. 50 South End Park Calcutta built by testator on purchased site.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Will directed legacy of Rs. 10 per mensem to younger son (appellant) for life life estate in five specified rooms of house to daughter to be enjoyed personally or by leasing Rs. 10 per mensem to one or other of two named hospitals and subject to legacies first respondent to take estate perform sraddha and pay one-sixth expenses for worship of deity.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "First respondent sole executor applied for probate appellant entered caveat application registered as suit.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Issues framed: (1) Was will lawfully and validly executed and attested? (2) Had testator testamentary capacity? (3) Was will executed under undue influence by Paresh Charan Das Gupta?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Additional District Judge 24-Parganas held in favour of first respondent on issues 1 and 2 but against on issue 3 refused probate.",
      "type": "procedural",
      "date": "1949-01-20",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "First respondent appealed to High Court Calcutta heard by G.N. Das and S.C. Lahiri JJ who held in favour of first respondent on undue influence and attestation allowed appeal directed grant of probate.",
      "type": "procedural",
      "date": "1951-03-05",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Testator retired as Deputy Superintendent of Police in 1927.",
      "type": "background",
      "date": "1927",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Paresh Charan elder son married in 1925 lived with parents wife and children testator's wife Nirmala died 1929 thereafter Paresh's wife maintained home.",
      "type": "background",
      "date": "1925",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Naresh Charan studied to I.A. discontinued 1920 got employment Tata Co. Jamshedpur on petty salary lived apart from family.",
      "type": "background",
      "date": "1920",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Naresh married Shantimayi widow with children in 1928 she Kayastha caste Naresh Baid caste testator strongly opposed tried to stop.",
      "type": "background",
      "date": "1928",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Correspondence between appellant and testator showed testator sore over marriage wrote it would not pain him if son died.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Will recitals: Younger son Naresh behaving badly married different caste girl without knowledge consent she gave birth to two daughters one son they not entitled to perform sraddh or offer pindas deprived of inheritance from movable immovable properties ancestral self-acquired no share interest possession also Naresh's wife Santi.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Recitals accord with testator's expressions in correspondence at time of marriage and years thereafter.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Over decade passed before will executed argued natural affection re-asserted forgiven forgotten recitals not reflect then mind.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Correspondence showed testator solicitous about appellant's welfare enquired health sent medicines affectionately disposed to grandchildren sent cloth presents modified attitude invited wife children to Calcutta stayed with them Jamshedpur gave employment advice.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "After will testator continued correspond with appellant family same terms.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Testator man of strong will determined unshakable wrote of himself one-third conservative liberal autocratic solicitous family prestige hurt by inter-caste marriage wrote 'You broke our hearts for a woman who has no right to be in my house' as late as 25-12-1941 warned of taunts if wife children live with him.",
      "type": "admitted",
      "date": "1941-12-25",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Net value assets in probate petition Rs. 23,865-10-9 after legacies charges not considerable first respondent salary Rs. 60/month many children appellant Rs. 250/month basic first respondent family dependents testator appellant lived apart from 1920.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Indira daughter deposed on commission testator told her troubles in house elder son objected staying with younger due social trouble daughters marriage wanted to make will subsequently wanted to alter sent for her discussions she excused he said 'At present this will stand but I want to modify it in future' first respondent wife told testator no change in appellant's conduct extravagant debts took articles.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f21",
      "text": "Indira husband took sides with appellant wrote to him despite will should have share early to avoid complication but insisted on their rights.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Indira sought enforce rights under will shortly after testator's death appellant obtained legacy payment 15 months.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Will holograph testator made arrangements for execution executed at P.W.1 residence presented for registration himself kept it in cash box found after death lived nearly year after execution often discussed it declared it should stand.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f24",
      "text": "P.Ws. 1 and 2 attestors stated testator signed in their presence they attested signature not added signed in presence of testator.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f25",
      "text": "Execution attestation at one sitting at P.W.1 residence all assembled by appointment witnesses not cross-examined on attestation due attestation inferred fact of due execution attestation not challenged at trial by caveator.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Was the will executed under undue influence of the first respondent Paresh Charan Das Gupta?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Was the will validly executed and attested as required by section 63 of the Indian Succession Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Will executed under undue influence of first respondent recitals not reflect testator's then mind after decade passage natural affection re-asserted forgiven forgotten inspired by first respondent dispositions unnatural appellant practically disinherited children ignored evidence of Indira shows first respondent influenced.",
      "supporting_facts": [
        "f15",
        "f16",
        "f19",
        "f20"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No proof of due attestation as required by section 63 Indian Succession Act witnesses did not state they signed in presence of testator.",
      "supporting_facts": [
        "f24"
      ],
      "legal_basis": "Section 63 Indian Succession Act 1925"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Will not result of undue influence testator of competent understanding free agent recitals consistent with longstanding resentment over inter-caste marriage testator strong-willed dispositions natural given family circumstances first respondent entitled express views no fraud coercion testator arranged execution himself.",
      "supporting_facts": [
        "f12",
        "f13",
        "f14",
        "f17",
        "f18",
        "f19",
        "f21",
        "f22",
        "f23"
      ],
      "legal_basis": "Indian Succession Act Section 61; Boyse v. Rossborough; Craig v. Lamoureux; Hall v. Hall"
    },
    {
      "id": "ra2",
      "text": "Will duly attested execution attestation at one sitting all present witnesses not cross-examined not challenged at trial.",
      "supporting_facts": [
        "f23",
        "f25"
      ],
      "legal_basis": "Section 63 Indian Succession Act 1925"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Burden on appellant to prove undue influence once due execution solemnities competent understanding free agent proved not in dispute here testator executed will had mental capacity.",
      "addresses_issue": "i1",
      "key_observation": "Recitals accord with longstanding resentment over inter-caste marriage shown in correspondence testator strong-willed solicitous welfare but distinguished from giving property no obligation to help financially even in difficulties continued same correspondence post-will natural affection and property settlement distinct channels no change of heart affecting dispositions."
    },
    {
      "id": "cr2",
      "text": "Dispositions not unnatural given testator character feelings net estate small first respondent dependent appellant independent lived apart secures continuance existing state.",
      "addresses_issue": "i1",
      "key_observation": "Indira evidence unreliable biased falls within illustration to s.61 no undue influence first respondent expressed views but testator decided freely full mental faculties no fraud coercion."
    },
    {
      "id": "cr3",
      "text": "Will holograph testator arranged execution presented registration kept it lived year after discussed but upheld.",
      "addresses_issue": "i1",
      "key_observation": "Cumulative evidence establishes will free volition not undue influence."
    },
    {
      "id": "cr4",
      "text": "Not every influence undue persuasion legitimate pressure overpowering volition undue s.61 void if fraud coercion importunity takes free agency but here testator led not driven.",
      "addresses_issue": "i1",
      "key_observation": "Case within illustration vii s.61."
    },
    {
      "id": "cr5",
      "text": "Attestation question of fact depends circumstances here one sitting all present no cross-examination inferred due attestation not challenged at trial.",
      "addresses_issue": "i2",
      "key_observation": "Finding of due attestation based on all materials accepted."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Will not executed under undue influence represents free volition of testator.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Will duly executed and attested as required by s.63 Indian Succession Act.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Boyse v. Rossborough",
      "citation": "1857 6 H.L.C. 2 10 E.R. 1192",
      "treatment": "referred",
      "relevance": "Burden of proving undue influence on party alleging once due execution competent understanding free agent proved."
    },
    {
      "case_name": "Craig v. Lamoureux",
      "citation": "1920 A.C. 349",
      "treatment": "referred",
      "relevance": "Supports burden of proof for undue influence."
    },
    {
      "case_name": "Hall v. Hall",
      "citation": "1868 L.R. 1 P. & D. 481",
      "treatment": "followed",
      "relevance": "Distinguishes lawful persuasion appeals to affections from undue pressure overpowering volition testator may be led but not driven."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Succession Act 1925",
      "sections": [
        "61",
        "63"
      ],
      "relevance": "S.61 will void if caused by fraud coercion importunity taking free agency illustration vii persuasion not invalidating if free judgment; s.63 due attestation requires signing in presence of testator."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed upholding High Court judgment directing grant of probate to first respondent will held valid not vitiated by undue influence duly attested.",
    "relief_granted": "Probate granted to first respondent",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "When once it has been proved... that a will has been executed with due solemnities by a person of competent understanding and apparently a free agent, the burden of proving that it is executed under undue influence is on the party who alleges it.",
      "speaker": "court",
      "significance": "Establishes burden of proof on appellant."
    },
    {
      "text": "It is one thing for a father... to wish him well in life, and quite another thing to give him any of his properties.",
      "speaker": "court",
      "significance": "Distinguishes natural affection from testamentary disposition."
    },
    {
      "text": "A testator may be led, but not driven and his will must be the offspring of his own volition, and not the record of some one elses.",
      "speaker": "court",
      "significance": "Defines undue influence per Hall v. Hall."
    },
    {
      "text": "I am one-third conservative, one-third liberal and one-third autocratic.",
      "speaker": "testator",
      "significance": "Illustrates testator's strong-willed character."
    }
  ],
  "_case_id": "1954_118",
  "_label": 0,
  "_text_length": 19212,
  "_extracted_at": "2026-02-08T22:15:11.223815"
}