{
  "metadata": {
    "case_name": "Legal representatives of P. B. Deshmukh and S. B. Deshmukh v. Secretary of State for India in Council",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "Mehr Chand Mahajan, C.J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "P. B. Deshmukh (deceased, represented by legal representatives) and S. B. Deshmukh, both cousins, formed a joint Hindu family of which P. B. Deshmukh was the manager.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For facility of management, S. B. Deshmukh managed money-lending shops at Kelod and Rejegaon, while P. B. Deshmukh managed the shop at Badegaon.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 1st April 1930, Income-tax Officer Nagpur issued notice under section 22(2) of Income Tax Act against the three shops calling for return of total income of joint family during 1928-29.",
      "type": "procedural",
      "date": "1930-04-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 3rd July 1930, M. K. Hirde, holding general power of attorney from the two cousins, filed return signed and verified by him as agent.",
      "type": "procedural",
      "date": "1930-07-03",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Pursuant to notice under section 23(2), account books for 1924-29 produced.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On 23rd November 1930, P. B. Deshmukh examined on oath by Income-tax Officer regarding omissions in return: Rs. 7,231 advanced from personal funds, not joint family; Rs. 30,477 repayments omitted due to mistake by agent Raghunath Choudhary (dismissed since 1929).",
      "type": "material",
      "date": "1930-11-23",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Income-tax Officer not satisfied, recommended prosecution; Assistant Commissioner issued notice to show cause why prosecution not sanctioned.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On 13th December 1930, Assistant Commissioner examined P. B. Deshmukh, who admitted concealing income over Rs. 30,000; told he would be prosecuted under section 52; P. B. Deshmukh proposed compounding under section 53 upon payment of Rs. 30,000, agreed by Assistant Commissioner; payment made in two instalments, matter closed.",
      "type": "material",
      "date": "1930-12-13",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In January 1934, two cousins filed suit for recovery of Rs. 30,000 and Rs. 5,331-1-3 interest against Secretary of State; ground: statement of 13th Dec 1930 incorrectly recorded, sum extorted under threat of legal proceedings without jurisdiction, no offence committed; omission due to agent mistake reiterated.",
      "type": "procedural",
      "date": "1934-01",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Defence: statements of 23rd Nov and 13th Dec 1930 correctly recorded; proposal for compounding emanated from P. B. Deshmukh after consulting counsel; no coercion; agent competent via general power of attorney, aware of omissions.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Trial Court (First Additional District Judge, Nagpur, 30th June 1938): statements correct record; voluntarily offered Rs. 30,000 owning mistakes; not compelled; claim outcome of legal advice; agent competent to sign/verify returns; liable to prosecution under section 107 r/w section 177 IPC; suit dismissed.",
      "type": "procedural",
      "date": "1938-06-30",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court of Nagpur (28th February 1945): upheld statements authentic; P. B. Deshmukh experienced businessman and honorary magistrate; voluntary offer after consulting adviser, knowing liability under s52; apprehended conviction; bound by agent; even if abettor, for criminal court; appeal dismissed.",
      "type": "procedural",
      "date": "1945-02-28",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Certificate for leave to appeal to Supreme Court granted on 23rd February 1951.",
      "type": "procedural",
      "date": "1951-02-23",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the return of income must be signed by the individual personally and not by agent even with power of attorney, rendering P. B. Deshmukh not liable under section 52 Income Tax Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether compounding under section 53 valid even if no offence under section 52 committed, and authority of Assistant Commissioner to compound.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Omission due to mistake of agent Raghunath Choudhary; statement of 13th Dec 1930 incorrectly recorded; Rs. 30,000 extorted under threat of proceedings without jurisdiction; no offence committed.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Under law per Commissioner of Agricultural Income-tax, Bengal v. Shri Keshab Chandra Mandal, return must be signed personally, not by agent; P. B. Deshmukh not liable for agent's act, could not be prosecuted under s52.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Commissioner of Agricultural Income-tax, Bengal v. Shri Keshab Chandra Mandal"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Statements of 23rd Nov and 13th Dec 1930 correctly recorded; proposal for compounding from P. B. Deshmukh after counsel; no coercion; agent competent via general power of attorney and aware of omissions.",
      "supporting_facts": [
        "f8",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Concurrent findings of fact by courts below; no question of law arises.",
      "addresses_issue": "i1",
      "key_observation": "Statements authentic; voluntary offer to compound after consulting adviser; knew liability."
    },
    {
      "id": "cr2",
      "text": "Section 53 allows Inspecting Assistant Commissioner to compound offences under s51 or s52 before/after proceedings; does not require proof of commission; if proceeding under s51/52, within purview.",
      "addresses_issue": "i2",
      "key_observation": "P. B. Deshmukh voluntarily offered to avoid prosecution; Assistant Commissioner competent."
    },
    {
      "id": "cr3",
      "text": "Even if not liable under s52 due to agent's verification, liable under s51(c) for failing to furnish return u/s 22(2) without reasonable cause; s53 covers both; court could alter charge.",
      "addresses_issue": "i2",
      "key_observation": "Liability under s51(c) or s52 makes no difference to compounding authority."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Compounding under s53 valid; Assistant Commissioner competent; P. B. Deshmukh liable under s51(c) or s52.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No merit in contention that agent could not sign return rendering no liability under s52.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Agricultural Income-tax, Bengal v. Shri Keshab Chandra Mandal",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Contended that return must be signed personally, not by agent; court finds contention has no force as s53 covers s51(c) alternatively."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income Tax Act",
      "sections": [
        "22(2)",
        "23(2)",
        "51(c)",
        "52",
        "53"
      ],
      "relevance": "Notice, return, examination, offences of failure to furnish return/false statement, compounding applied; s53 covers both offences."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "107",
        "177"
      ],
      "relevance": "Trial court held liable under s107 r/w s177 for false statement."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upholds concurrent findings of trial court and High Court dismissing suit for recovery of Rs. 30,000 paid for compounding income tax offence; no question of law arises; compounding valid under s53 even if liability under s51(c) rather than s52.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "What section 53 provides is that a person shall not be proceeded against for an offence under section 51 or section 52 except at the instance of the Inspecting Assistant Commissioner and that the last-mentioned officer may, before or after the institution of proceedings, compound any such offence.",
      "speaker": "court",
      "significance": "Explains scope of compounding power under s53."
    },
    {
      "text": "P. B. Deshmukh being anxious to avoid his liability for prosecution made a voluntary offer to compound the offence which the Assistant Commissioner of Income-tax was fully competent to accept under section 53 of the Act.",
      "speaker": "court",
      "significance": "Key finding on voluntariness and competence."
    }
  ],
  "_case_id": "1954_64",
  "_label": 0,
  "_text_length": 8419,
  "_extracted_at": "2026-02-08T22:14:38.524730"
}