{
  "metadata": {
    "case_name": "Mahant of Rajgunj Asthal v. Respondents",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar J."
    ],
    "case_number": "Civil Appeals Nos. 109 to 115 of 1952",
    "date_of_judgment": "1954-12-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is the Mahant of religious institution known as Rajgunj Asthal in Burdwan.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Suit lands comprised in Mouza Nala forming part of permanently settled estate of Burdwan, Mal lands assessed to revenue.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "More than 200 years previously, permanent Mokarrari grant of suit lands by Maharaja of Burdwan to Rajgunj Asthal.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "In record of rights published during settlement in 1931, suit lands erroneously described as rent-free.",
      "type": "material",
      "date": "1931-06-16",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Defendants in possession of suit lands, refusing to surrender possession on strength of 1931 record of rights entry.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Suit lands not Mal lands comprised within Mouza Nala, not part of zamindari of Burdwan but granted as Lakheraj to predecessors-in-title long prior to permanent settlement.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Neither Maharaja of Burdwan nor plaintiff claiming under him had title to suit lands; 1931 record of rights entry correct.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Defendants and predecessors in possession for over 200 years under assertion of adverse title; claim barred by limitation.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "District Munsif held suit lands included in Mouza Nala in Touzi No. 1, comprised in permanently settled estate of Burdwan; income taken into account in fixing revenue.",
      "type": "admitted",
      "date": "1944-09-16",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Suit lands granted in permanent Mokarrari by Maharaja of Burdwan to Rajgunj Asthal; defendants' plea of prior Lakheraj grant not true.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Documents on which defendants claimed adverse title not proved to relate to suit lands; relationship landlord-tenant; no determination of tenancy; no ejectment but entitled to fair rent; not barred by Article 131 Limitation Act.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "District Judge agreed suit lands Mal lands within zamindari of Burdwan, settled on plaintiff by Maharaja; but presumption of lost grant due to long possession without rent.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "District Judge differed from Munsif on documents relating to suit lands, found some connection via names of tanks etc.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "High Court agreed with District Judge, dismissed appeals, granted certificate under Article 133(1)(c).",
      "type": "procedural",
      "date": "1950-03-09",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Permanent settlement of Burdwan zamindari in 1793; suit lands included as part of Mal or assessed lands.",
      "type": "background",
      "date": "1793",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "District Munsif held defendants' documents not relating to suit lands; Supreme Court accepts this finding.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "No proof of contents of Exhibits A to A-24 (receipts for cesses); excluded by High Court.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "No proof defendants set up adverse title prior to 1931 or plaintiff had knowledge thereof; bare possession without rent for considerable but unascertained period.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "1931 record of rights entry: Bhog Dakhal Sutre Niskar (without rent by virtue of possession and enjoyment); made per Rule 37, not importing rent-free grant.",
      "type": "material",
      "date": "1931",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Suit properties settled on Rajgunj Asthal more than 200 years ago per District Judge.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "Suits filed within 12 years of final settlement publication on 16-6-1931.",
      "type": "procedural",
      "date": "1931-06-16",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the materials on record the Courts below were right in presuming a lost grant in favour of the defendants.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the suits are barred by limitation.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Suit lands were Mal lands assessed to revenue in permanently settled estate of Burdwan; permanent Mokarrari grant by Maharaja >200 years ago to Rajgunj Asthal; 1931 record of rights erroneously rent-free due to collusion.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Entitled to ejectment or in alternative assessment of fair and equitable rent.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Suit lands not Mal lands in Mouza Nala or zamindari of Burdwan; granted as Lakheraj prior to permanent settlement to predecessors; no title in Maharaja or plaintiff; 1931 ROFR correct.",
      "supporting_facts": [
        "f6",
        "f7",
        "f19"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Possession >200 years under adverse title; barred by limitation.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Limitation Act"
    },
    {
      "id": "ra3",
      "text": "Long possession without rent, continuous assertion of Lakheraj to knowledge of plaintiff; presumption of lost grant; 1931 ROFR supports.",
      "supporting_facts": [
        "f13",
        "f17",
        "f19"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Defendants' documents not proved to relate to suit lands (accept Munsif finding); no proof of adverse title assertion pre-1931 or plaintiff's knowledge; Exhibits A-A24 excluded for lack of proof of contents.",
      "addresses_issue": "i1",
      "key_observation": "Bare long possession without rent insufficient for lost grant presumption."
    },
    {
      "id": "cr2",
      "text": "Permanent settlement 1793 included suit lands as Mal/assessed; per Reg. 8 of 1793 s.36, assessment exclusive of lakheraj; Mal lands could not be held as pre-settlement Lakheraj.",
      "addresses_issue": "i1",
      "key_observation": "Legal impediment to presuming pre-settlement Lakheraj grant for assessed lands."
    },
    {
      "id": "cr3",
      "text": "1931 ROFR 'Bhog Dakhal Sutre Niskar' per Rule 37 means no actual rent payment, not rent-free grant.",
      "addresses_issue": "i1",
      "key_observation": "Entry does not support lost grant presumption."
    },
    {
      "id": "cr4",
      "text": "Defendants denied title of both possible grantors (Maharaja/Asthal); cannot presume grant from them; Mahant cannot grant unsupported Lakheraj (beyond powers).",
      "addresses_issue": "i1",
      "key_observation": "No competent grantor; grant would be illegal/ultra vires."
    },
    {
      "id": "cr5",
      "text": "No adverse possession: no proof of hostile title assertion pre-1931 to knowledge of plaintiff; suits within 12 years of 1931 publication per Art.131 Limitation Act.",
      "addresses_issue": "i2",
      "key_observation": "Possession not adverse till 1931."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No presumption of lost grant possible on facts; circumstances for presumption not met (no adverse assertion proof, legal impediments from settlement and grantor powers).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Plaintiff entitled to assessment of fair and equitable rent.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Suits not barred by limitation.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Attorney-General v. Simpson",
      "citation": "1901 2 Ch. D. 671, 698",
      "treatment": "followed",
      "relevance": "Presumption not juris et de jure; not if judge convinced of non-existence."
    },
    {
      "case_name": "Raja Braja Sundar Deb v. Moni Behara",
      "citation": "1951 SCR 431, 436",
      "treatment": "followed",
      "relevance": "No presumption if no competent recipient (fluctuating body)."
    },
    {
      "case_name": "Barker v. Richardson",
      "citation": "1821 4 B. Ald. 579",
      "treatment": "followed",
      "relevance": "No presumption if grant illegal/beyond grantor powers."
    },
    {
      "case_name": "The Rochdale Canal Company v. Radcliffe",
      "citation": "1852 18 Q.B. 287",
      "treatment": "followed",
      "relevance": "No presumption if grant ultra vires."
    },
    {
      "case_name": "Palaniappa Chetty v. Sreenath Devasikamony",
      "citation": "1917 LR 44 IA 147",
      "treatment": "followed",
      "relevance": "Manager of religious institution cannot grant perpetual lease without necessity/benefit."
    }
  ],
  "statutes_cited": [
    {
      "name": "Regulation No. 8 of 1793",
      "sections": [
        "Section 36"
      ],
      "relevance": "Assessment fixed exclusive of lakheraj lands; Mal lands not held as pre-settlement lakheraj."
    },
    {
      "name": "Limitation Act",
      "sections": [
        "Article 131"
      ],
      "relevance": "Suits within 12 years of 1931 record publication for rent assessment."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(c)"
      ],
      "relevance": "Certificate granted by High Court for appeal."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; decrees of District Court and High Court set aside; decrees of District Munsif restored; plaintiff entitled to fair and equitable rent.",
    "relief_granted": "Assessment of fair and equitable rent; costs in this Court and courts below.",
    "costs": "Costs in this Court and in the two Courts below."
  },
  "key_quotes": [
    {
      "text": "\"It cannot be the duty of a Judge to presume a grant of the non-existence of which he is convinced.\"",
      "speaker": "court",
      "significance": "Explains presumption of lost grant not mandatory if facts against it."
    },
    {
      "text": "\"When it is shown that lands in an estate are assessed, it must follow that they could not have been held on the date of the permanent settlement as Lakheraj.\"",
      "speaker": "court",
      "significance": "Key reason precluding lost grant due to 1793 settlement scheme."
    },
    {
      "text": "\"It is well settled that it is beyond the powers of a manager of a religious institution to grant perpetual lease binding the institution for all times to a fixed rent, unless there is a compelling necessity or benefit therefor.\"",
      "speaker": "court",
      "significance": "Mahant lacked power for lakheraj grant."
    }
  ],
  "_case_id": "1954_143",
  "_label": 1,
  "_text_length": 17632,
  "_extracted_at": "2026-02-08T22:15:10.770887"
}