{
  "metadata": {
    "case_name": "State of Bihar v. Respondent (Sub-Inspector of Police)",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Mahajan C.J."
    ],
    "case_number": "Civil Appeal No. 70 of 1952",
    "date_of_judgment": "1954-02-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent was appointed a Sub-Inspector of Police by the Inspector-General of Police, Bihar and Orissa, in January, 1920.",
      "type": "background",
      "date": "1920-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In the year 1937 departmental proceedings were taken against him and he was found guilty of cowardice and of not preparing search lists and was punished by demotion for ten years.",
      "type": "material",
      "date": "1937",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On appeal the Deputy Inspector-General of Police held that the respondent was guilty of cowardice but acquitted him of the other charge.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "By an order dated the 23rd July, 1940, which was communicated to the respondent on the 29th of July, 1940, the Deputy Inspector-General of Police having found him guilty of cowardice made an order dismissing him from service.",
      "type": "material",
      "date": "1940-07-23",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Further appeals by the respondent to the Inspector-General of Police and to the Governor of Bihar were unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Aggrieved by the departmental action taken against him, the respondent filed the suit out of which this appeal arises in the court of additional subordinate judge against the State of Bihar for a declaration that the order of the Deputy Inspector-General of Police dismissing him from service was illegal and void and that he should be regarded as continuing in office. He also claimed a sum of Rs. 4,241 from 30th July, 1940, to the date of the suit on account of arrears of salary.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The State contested the claim and pleaded that the plaintiff held his service at the pleasure of the Crown, and could not call in question the grounds or the reasons which led to his dismissal, and that in any case he had been reinstated in service from the 30th of July, 1940, and the order of dismissal therefore was no longer operative, and the suit had thus become infructuous.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The additional subordinate judge by his judgment dated the 2nd February, 1945, dismissed the suit on the finding that the Government having reinstated the respondent he had no cause of action. As regards the arrears of salary, it was held that the claim to it could only be made according to the procedure prescribed under rule 95 of section 4 of Chapter IV of Bihar and Orissa Service Code.",
      "type": "procedural",
      "date": "1945-02-02",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "This decision was confirmed in appeal by the additional district judge.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "On further appeal the High Court reversed these decisions and decreed the claim for arrears of salary in the sum of Rs. 3,099-12-0.",
      "type": "procedural",
      "date": "1949-05-05",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "It was only after the present suit was filed that the Government reinstated him. This was not proceeding in revision or appeal. After the institution of the suit, the Chief Secretary to the Government of Bihar realising the untenability of the Governments position wrote to the Inspector-General of Police that the order of dismissal should be treated as null and void and that the respondent should be reinstated.",
      "type": "procedural",
      "date": "1943-12-30",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The respondent here was dismissed by the Deputy Inspector-General of Police, though he was appointed by the Inspector-General of Police. This was clearly contrary to the provisions of section 240(3) of the Government of India Act, 1935, which provides that no person shall be dismissed from the service of His Majesty by an authority subordinate to that by which he was appointed.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court correctly held that rule 95 of the Bihar and Orissa Service Code had no application to the case?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether a suit for arrears of salary by a civil servant is competent in a civil court?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Rule 95 of the Bihar and Orissa Service Code applies and bars the suit for arrears of salary.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Rule 95 of Bihar and Orissa Service Code"
    },
    {
      "id": "pa2",
      "text": "A suit by a public servant against the State for recovery of arrears of salary cannot be maintained in a civil court as service is held at the pleasure of the Crown.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Section 240 Government of India Act 1935; I.M. Lall (75 IA 225); Suraj Narain Anand (75 IA 343)"
    },
    {
      "id": "pa3",
      "text": "Tara Chand Pandit case is no longer good law, dissented from or overruled by Privy Council in I.M. Lall case.",
      "supporting_facts": [],
      "legal_basis": "Tara Chand Pandit (1947 FCR 89); I.M. Lall (75 IA 225)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Rule 95 has no application because the respondent had never been dismissed within the meaning of that rule.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Rule 95 Bihar and Orissa Service Code; Section 240(3) Government of India Act 1935"
    },
    {
      "id": "ra2",
      "text": "The plaintiff was entitled to maintain the suit for arrears of pay in view of the decision of the Federal Court in Tara Chand Pandit case.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Tara Chand Pandit (1947 FCR 89)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 95 enables appellate or revising authority to grant relief upon reinstatement, but has no application here as dismissal was by subordinate authority contrary to s.240(3) GOI Act 1935, appeals rejected, and reinstatement was after suit by Government realizing untenability, not by appellate authority.",
      "addresses_issue": "i1",
      "key_observation": "The enabling provisions of rule 95 had no application whatsoever to the case of the plaintiff."
    },
    {
      "id": "cr2",
      "text": "Suit for arrears maintainable; agrees with Federal Court in Tara Chand Pandit; s.240 GOI Act statutory form of pleasure, subject to limitations; breach allows action for relief beyond declaration; CPC s.60 allows attachment of salary by creditors, inconsistent to deny servant.",
      "addresses_issue": "i2",
      "key_observation": "The rule of English law that a civil servant cannot maintain a suit against the State or against the Crown for the recovery of arrears of salary does not prevail in this country and that it has been negatived by the provisions of the statute law in India."
    },
    {
      "id": "cr3",
      "text": "Distinguishes I.M. Lall and Suraj Narain Anand as not directly on point re arrears, no consideration of CPC or Tara Chand; English prerogatives not applicable in India due to CPC and GOI Acts.",
      "addresses_issue": "i2",
      "key_observation": "We are in no way bound by the decision given either in Tara Chand Pandit case, or by the decision given by the Privy Council in I.M. Lall case. But on a consideration of the reasons given in the two judgments we think that the rule of English law... does not prevail in this country."
    },
    {
      "id": "cr4",
      "text": "Holds office at pleasure concerns tenure, not salary as bounty; no right for wrongful dismissal damages, but arrears earned are recoverable under CPC as quantum meruit.",
      "addresses_issue": "i2",
      "key_observation": "The expression concerns itself with the tenure of office of the civil servant and it is not implicit in it that a civil servant serves the Crown ex gratia or that his salary is in the nature of a bounty."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rule 95 of the Bihar and Orissa Service Code had no application to the facts and circumstances of this case and did not operate as a bar to the plaintiff's action.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "A civil servant can maintain a suit in a civil court against the State for recovery of arrears of salary.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Tara Chand Pandit",
      "citation": "1947 F.C.R. 89",
      "treatment": "followed",
      "relevance": "Suit for arrears of salary by civil servant maintainable; CPC provisions allow recovery."
    },
    {
      "case_name": "I. M. Lall",
      "citation": "75 I.A. 225",
      "treatment": "distinguished",
      "relevance": "Not directly on arrears of pay; did not consider CPC or Tara Chand; declaration only sought."
    },
    {
      "case_name": "Suraj Narain Anand",
      "citation": "75 I.A. 343",
      "treatment": "distinguished",
      "relevance": "Privy Council declined opinion on arrears of pay entitlement despite awareness of Tara Chand."
    },
    {
      "case_name": "Mulvenna v. The Admiralty",
      "citation": "1926 S.C. 842",
      "treatment": "distinguished",
      "relevance": "English rule on no suit for pay as bounty; inapplicable in India due to CPC."
    },
    {
      "case_name": "Lucas v. Lucas and High Commissioner for India",
      "citation": "1943 P. 68",
      "treatment": "distinguished",
      "relevance": "Attachment of salary in England; did not consider Indian CPC."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bihar and Orissa Service Code",
      "sections": [
        "Rule 95 (Chapter IV, Section 4)"
      ],
      "relevance": "Enables appellate authority to grant pay on reinstatement; no application as no such reinstatement."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Section 240",
        "Section 243",
        "Section 292",
        "Section 176(1)"
      ],
      "relevance": "Dismissal only by appointing authority; pleasure subject to limitations; CPC continues."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 60 (clauses i, j, proviso, explanation 2)",
        "Order XXI"
      ],
      "relevance": "Salary attachable by creditors; implies enforceable right for servant against State."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by the State of Bihar, upholding the High Court of Patna's decree for arrears of salary of Rs. 3,099-12-0 to the respondent from 30th July 1940 up to the date of institution of the suit, holding rule 95 inapplicable and suit maintainable.",
    "relief_granted": "High Court's decree for arrears upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The enabling provisions of rule 95 had no application whatsoever to the case of the plaintiff.\"",
      "speaker": "court",
      "significance": "Core holding on rule 95 inapplicability."
    },
    {
      "text": "\"the rule of English law that a civil servant cannot maintain a suit against the State or against the Crown for the recovery of arrears of salary does not prevail in this country\"",
      "speaker": "court",
      "significance": "Rejects English prerogative; affirms Indian law allows suit."
    },
    {
      "text": "\"no person shall be dismissed from the service of His Majesty by an authority subordinate to that by which he was appointed.\"",
      "speaker": "court",
      "citation": "Section 240(3) GOI Act 1935",
      "significance": "Basis for dismissal being illegal."
    }
  ],
  "_case_id": "1954_7",
  "_label": 0,
  "_text_length": 33407,
  "_extracted_at": "2026-02-10T19:17:29.746653"
}