{
  "metadata": {
    "case_name": "Appellant v. State of Bombay",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar, J."
    ],
    "case_number": "Criminal Appeal No. 31 of 1953",
    "date_of_judgment": "1954-10-08"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On 6th April, 1951, the appellant transported 15 maunds of juwar from his village of Khanjroli to Mandvi without a permit, contravening section 5(1) of the Bombay Food Grains Regulation of Movement and Sale Order, 1949.",
      "type": "material",
      "date": "1951-04-06",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "The Resident First Class Magistrate of Bardoli tried the case, found appellant guilty under section 7 of the Essential Supplies Temporary Powers Act No. XXIV of 1946, and sentenced him to imprisonment till the rising of the Court and a fine of Rs. 500.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Conviction and sentence affirmed by the Sessions Judge, Surat, on appeal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Appellant filed revision petition in High Court of Bombay (Criminal Revision Application No. 642 of 1952), raising for the first time objection that Resident First Class Magistrate had no jurisdiction because under section 2 of Bombay Act No. XXXVI of 1947 offence punishable with imprisonment up to seven years, triable only by Sessions Court per Second Schedule to CrPC.",
      "type": "procedural",
      "date": "1952",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "High Court Bench (Bavdekar and Chainani JJ.) differed: Bavdekar J. held Bombay Act unaffected; Chainani J. held Central Act LII of 1950 prevailed. Matter heard by Chagla C.J. who agreed with Chainani J., found repugnancy under Article 254(2), dismissed revision on 20-1-1953.",
      "type": "procedural",
      "date": "1953-01-20",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appeal to Supreme Court on certificate under Article 132(1).",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether contravention of section 5(1) of the Bombay Food Grains Regulation of Movement and Sale Order, 1949, is punishable under section 2 of Bombay Act No. XXXVI of 1947 (imprisonment up to seven years, Sessions Court jurisdiction) or under section 7 of Essential Supplies Temporary Powers Act as amended by Act No. LII of 1950 (maximum three years, Magistrate jurisdiction).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Resident First Class Magistrate had no jurisdiction as offence punishable under section 2 of Bombay Act No. XXXVI of 1947 with imprisonment up to seven years, triable only by Sessions Court; amendments to Essential Supplies Act did not trench on Bombay Act.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Bombay Act No. XXXVI of 1947, section 2; CrPC Second Schedule; argued subject in Provincial List, Article 254 inapplicable."
    },
    {
      "id": "pa2",
      "text": "Act No. LII of 1950 did not expressly repeal Bombay Act; no repugnancy as Bombay Act dealt with enhanced penalty only.",
      "supporting_facts": [],
      "legal_basis": "Article 254(2) Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Subsequent amendments to Essential Supplies Temporary Powers Act (1948, 1949, Act LII of 1950) made Bombay Act No. XXXVI of 1947 inoperative; Central Act LII of 1950 as later legislation on concurrent subject prevails over Bombay Act under Article 254(2)/section 107(2) Govt of India Act.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Essential Supplies Temporary Powers Act No. XXIV of 1946 as amended; Central Act No. LII of 1950, section 7; Article 254(2); section 107(2) Govt of India Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Detailed chronological legislative history: Essential Supplies Act 1946 (s.7: up to 3 years); Bombay Act XXXVI/1947 enhanced to 7 years with Governor-General assent under s.107(2) Govt India Act; amendments 1948,1949; Act LII/1950 recast s.7 comprehensively for punishments graded by commodity/offence type, covering same field as Bombay Act.",
      "addresses_issue": "i1",
      "key_observation": "Act LII/1950 covers entire field of punishment for contraventions under Essential Supplies Act, including enhanced for hoarding foodgrains."
    },
    {
      "id": "cr2",
      "text": "Under Article 254(2)/s.107(2), later Central legislation on same concurrent matter prevails over State law even without express repeal if repugnant; here both cover punishment for contraventions, cannot split subject-matter.",
      "addresses_issue": "i1",
      "key_observation": "Punishment constitutes single subject-matter; later alters degree, supersedes earlier (citing Maxwell, Smith v. Benabo)."
    },
    {
      "id": "cr3",
      "text": "Rejected appellant's new argument that subject exclusively Provincial List as not raised in leave petition under Art.132(1).",
      "addresses_issue": "i1",
      "key_observation": "Only repugnancy under Art.254 raised in certificate petition."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 2 of Bombay Act No. XXXVI of 1947 cannot prevail against section 7 of Essential Supplies Temporary Powers Act as amended by Act LII of 1950; trial by Magistrate valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Attorney-General for Ontario v. Attorney-General for the Dominion",
      "citation": "1896 A.C. 348",
      "treatment": "referred",
      "relevance": "Dominion Parliament could not directly repeal Provincial statute under similar provision; Central Legislature similar position pre-Constitution."
    },
    {
      "case_name": "Smith v. Benabo",
      "citation": "1937 1 K.B. 518",
      "treatment": "followed",
      "relevance": "Later statute describing same offence with different punishment repeals earlier."
    },
    {
      "case_name": "Michell v. Brown",
      "citation": "1 El. & El. 267, 274",
      "treatment": "followed",
      "relevance": "Later statute varying punishment or procedure repeals earlier (per Lord Campbell)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Essential Supplies (Temporary Powers) Act, 1946",
      "sections": [
        "3",
        "4",
        "7"
      ],
      "relevance": "Power to issue orders; punishment for contravention (up to 3 years originally, recast by LII/1950)."
    },
    {
      "name": "Bombay Act No. XXXVI of 1947",
      "sections": [
        "2"
      ],
      "relevance": "Enhanced punishment to 7 years for contraventions despite Central Act; held inoperative post LII/1950."
    },
    {
      "name": "Essential Supplies (Temporary Powers) Amendment Act, 1948",
      "sections": [
        "7 (proviso)"
      ],
      "relevance": "Amended punishment proviso for foodstuffs."
    },
    {
      "name": "Essential Supplies (Temporary Powers) Amendment Act, 1949",
      "sections": [
        "7"
      ],
      "relevance": "Further amended s.7 for foodstuffs contraventions."
    },
    {
      "name": "Essential Supplies (Temporary Powers) Amendment Act, 1950 (No. LII)",
      "sections": [
        "7"
      ],
      "relevance": "Repealed and recast s.7 comprehensively; prevails over State law under Art.254(2)."
    },
    {
      "name": "Bombay Food Grains (Regulation of Movement and Sale) Order, 1949",
      "sections": [
        "5(1)"
      ],
      "relevance": "Order contravened by transporting juwar without permit."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "Second Schedule",
        "429"
      ],
      "relevance": "Jurisdiction (Sessions for 7 years); revision procedure."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "132(1)",
        "254(2)"
      ],
      "relevance": "Certificate for appeal; Central law prevails over repugnant State law on concurrent matter."
    },
    {
      "name": "Government of India Act",
      "sections": [
        "107(2)"
      ],
      "relevance": "Pre-Constitution: State law with assent prevails but subject to further Central legislation."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, holding that section 7 of the Essential Supplies (Temporary Powers) Act as amended by Act LII of 1950 prevailed over section 2 of Bombay Act XXXVI of 1947 under Article 254(2), validating the Magistrate's jurisdiction; conviction and sentence upheld.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The point for determination is whether contravention of section 5(1) of the Bombay Food Grains Regulation of Movement and Sale Order, 1949, is punishable under section 2 of the Bombay Act No. XXXVI of 1947... or whether it is punishable under section 7 of the Essential Supplies Temporary Powers Act, as amended by Act No. LII of 1950.",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "Section 7 is thus a comprehensive code covering the entire field of punishment for offences under the Act, graded according to the commodities and to the character of the offence.",
      "speaker": "court",
      "significance": "Explains why Central Act covers same field, causing repugnancy."
    },
    {
      "text": "The question of punishment for contravention of orders under the Essential Supplies Temporary Powers Act both under Act No. XXXVI of 1947 and under Act No. LII of 1950 constitutes a single subject-matter and cannot be split up.",
      "speaker": "court",
      "significance": "Rejects splitting subject-matter for repugnancy test."
    }
  ],
  "_case_id": "1954_53",
  "_label": 0,
  "_text_length": 21807,
  "_extracted_at": "2026-02-10T19:17:19.484610"
}