{
  "metadata": {
    "case_name": "Shyam Lal v. The President of India",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "DAS J."
    ],
    "case_number": "Civil Appeal No. 248 of 1953",
    "date_of_judgment": "1954-03-30"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant passed his Civil Engineering degree examination from the Thomason College, Roorkee, in 1922. He stood first in order of merit and carried away the Gold Medal and other prizes awarded to the best student of that year.",
      "type": "background",
      "date": "1922",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "He was appointed by the Secretary of State for India in Council to the Indian Service of Engineers as an Assistant Executive Engineer with effect from the 20th October, 1923. The conditions governing the appellant's terms of appointment, promotion, leave, pension, etc., will be found recorded in a letter issued from India Office, London, on the 13th February, 1924.",
      "type": "background",
      "date": "1923-10-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "He was posted in the United Provinces.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1944 the appellant was promoted to the rank of officiating Superintending Engineer.",
      "type": "background",
      "date": "1944",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After the attainment of independence by India a fresh agreement was entered into by and between the appellant the Governor of the United Provinces and the Governor General of India on the 16th September, 1948 confirming the appellant's terms of appointment contained in the letter of the 13th February, 1924.",
      "type": "background",
      "date": "1948-09-16",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "At or about this time the appellant along with several other officers was recommended by the Chief Engineer for confirmation as Superintending Engineer. The appellant, however, was not confirmed but continued to officiate as Superintending Engineer until the time hereinafter stated.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On the 4th January, 1950, the Public Works Department of the U.P. Government addressed a letter to the Chief Engineer, Irrigation Branch U.P. requesting him to communicate the letter enclosed therewith to the appellant and to ask him to submit as early as possible whatever explanation he might desire to give. The enclosed letter called upon the appellant to show cause within three weeks why he should not be compulsorily retired under the provisions of article 465-A, Civil Service Regulations, as it appeared (1) that he had been making systematic and gross overpayments apparently for no other reason than to benefit the contractors concerned and (2) that he had spent large amounts of public money for his own personal convenience and (3) that he had taken recourse to devious and unscrupulous methods. No less than, six instances on which these charges were based, were then set out.",
      "type": "material",
      "date": "1950-01-04",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The covering letter concluded with the following remarks: Under the rules Government reserve the right to compulsorily retire any officer whose retention in service they consider not to be in the public interest. This is not, therefore, a formal enquiry under the Classification. Control and Appeal Rules but before taking the action indicated above Government were pleased to and an opportunity to Shri Shyam Lal, I.S.E., to show cause why he should not be compulsorily retired.",
      "type": "material",
      "date": "1950-01-04",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "A copy of the letter of the 4th January, 1950, together with a copy of the enclosure was sent to the appellant with the request that his explanation might be forwarded, within the period mentioned by the Government.",
      "type": "procedural",
      "date": "1950-01-04",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The appellant submitted his explanations which, together with the Chief Engineer's comments thereon, were placed before the Union Public Service Commission. The Commission came to the conclusion that five out of the six charges had been proved and submitted their report accordingly.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On the 17th April, 1953, the President, after considering the case and the recommendations of the Commission, decided that the appellant should retire forthwith from service under Note I to article 465-A of the Civil Service Regulations.",
      "type": "material",
      "date": "1953-04-17",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Before this order could be served on him the appellant on the 24th April, 1953, filed before the Allahabad High Court a petition under article 226 of the Constitution praying that the order made by the President on the 17th April, 1953, be quashed on the ground, inter alia, that the order was illegal and void in that it was made without affording him any opportunity to show cause against the action proposed to be taken in regard to him.",
      "type": "procedural",
      "date": "1953-04-24",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The High Court by its judgment dated the 1st October, 1953, dismissed the application but, as the case involved a substantial question of the interpretation of the Constitution, the High Court granted leave to the appellant to appeal to this Court.",
      "type": "procedural",
      "date": "1953-10-01",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether article 465-A of the Civil Service Regulations is applicable to or binding on the appellant",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether compulsory retirement is nothing but removal from service and the provisions of article 311 of the Constitution apply to the case of compulsory retirement",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Note I to article 465-A of the Civil Service Regulations, in so far as it confers on the Government an absolute right to retire an officer, who has completed twenty-five years qualifying service without giving any reason, is repugnant to article 311 of the Constitution",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Article 465-A of the Civil Service Regulations is not applicable to or binding on the appellant as it was not in operation at the time of the Government of India Act, 1919, not validated by s.96B(4), and not made by Secretary of State in Council under s.96B(2) or (3).",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Government of India Act, 1919 s.96B(2),(3),(4)"
    },
    {
      "id": "pa2",
      "text": "Compulsory retirement is nothing but removal from service and provisions of article 311 apply; Note I to article 465-A sanctions compulsory retirement without assigning reason or opportunity to show cause, repugnant to article 311.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Constitution of India Art. 311"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Article 465-A applicable via rule 7 and 26 of Civil Services Classification, Control and Appeal Rules.",
      "supporting_facts": [],
      "legal_basis": "Civil Services Classification, Control and Appeal Rules r.7,26"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Article 465-A and Note 1 derived from Resolution No.1085-E.A. of 15 Nov 1919, in force before GOI Act 1919 passed on 23 Dec 1919, validated by s.96B(4); subsequent incorporations in CSR clarify scope, do not create new rule. Government's right to retire pre-existed.",
      "addresses_issue": "i1",
      "key_observation": "New rules of 15 Nov 1919 validated by s.96B(4); Note 1 retains existing right, does not confer new one."
    },
    {
      "id": "cr2",
      "text": "Compulsory retirement not dismissal/removal under Art.311: no stigma/imputation of misconduct (public interest test); not a penalty (full pension retained, no loss of accrued benefits); differs from dismissal/removal which entail loss of pension and disqualification.",
      "addresses_issue": "i2",
      "key_observation": "Termination of service by compulsory retirement lacks elements of charge and punishment present in dismissal/removal."
    },
    {
      "id": "cr3",
      "text": "Note 1 not repugnant to Art.311 as compulsory retirement not removal/dismissal; Art.311 protects against punitive actions, not retirement in public interest after 25 years service.",
      "addresses_issue": "i3",
      "key_observation": "Compulsory retirement has no stigma or implication of misbehaviour or incapacity."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Article 465-A and Note 1 applicable to appellant as validated by GOI Act 1919 s.96B(4).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Compulsory retirement under Note 1 to Art.465-A is not dismissal or removal, does not attract Art.311(2).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Note 1 to Art.465-A not repugnant to Art.311.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rangachari v. Secretary of State",
      "citation": "L.R. 64 I.A. 40",
      "treatment": "referred",
      "relevance": "Held that s.96B(1) opening words did not qualify Crown's discretion to dismiss; remedy not lawsuit but official appeal."
    },
    {
      "case_name": "Venkatarao v. Secretary of State",
      "citation": "L.R. 64 I.A. 55; A.I.R. 1937 P.C. 37",
      "treatment": "referred",
      "relevance": "Similar to Rangachari; rules ineffective against Crown's plenary power pre-1935 Act."
    },
    {
      "case_name": "I.M. Lal's case",
      "citation": "L.R. 75 I.A. 225; A.I.R. 1948 P.C. 121",
      "treatment": "followed",
      "relevance": "Removal within s.240(3) GOI Act 1935, implying removal comprised in dismissal."
    },
    {
      "case_name": "Satischandra Anand v. The Union of India",
      "citation": "1953 S.C.R. 655",
      "treatment": "followed",
      "relevance": "Art.311 not apply to all terminations; contract termination not dismissal/removal; terms used in same sense."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 132",
        "Article 226",
        "Article 310",
        "Article 311"
      ],
      "relevance": "Appeal under 132; writ under 226; tenure during pleasure (310); protection against dismissal/removal (311) not applicable to compulsory retirement."
    },
    {
      "name": "Civil Service Regulations",
      "sections": [
        "Article 349-A",
        "Article 353",
        "Article 465-A Note 1"
      ],
      "relevance": "Applies to Indian Service of Engineers; no pension on dismissal/removal; absolute right to retire after 25 years service in public interest."
    },
    {
      "name": "Government of India Act, 1919",
      "sections": [
        "Section 96B(1)",
        "Section 96B(2)",
        "Section 96B(3)",
        "Section 96B(4)"
      ],
      "relevance": "Validated existing rules including pension rules of 1919; power to make service rules."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Section 240(1)",
        "Section 240(2)",
        "Section 240(3)"
      ],
      "relevance": "Tenure during pleasure; no dismissal by subordinate authority; reasonable opportunity before dismissal/reduction."
    },
    {
      "name": "Civil Services (Classification, Control and Appeal) Rules",
      "sections": [
        "Rule 49",
        "Rule 55",
        "Rule 7",
        "Rule 26"
      ],
      "relevance": "Penalties including removal/dismissal; procedure for inquiry; explanation excludes certain terminations from removal/dismissal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the High Court's dismissal of the writ petition challenging the President's order of compulsory retirement under Note 1 to Article 465-A CSR is dismissed. The Court holds Article 465-A applicable and compulsory retirement not amounting to dismissal/removal under Article 311.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Government retains an absolute right to retire any officer after he has completed twenty-five years qualifying service without giving any reasons, and no claim to special compensation on this account will be entertained.",
      "speaker": "court",
      "significance": "Text of Note 1 to Article 465-A CSR central to the case."
    },
    {
      "text": "A compulsory retirement has no stigma or implication of misbehaviour or incapacity.",
      "speaker": "court",
      "significance": "Key distinction from dismissal/removal under Art.311."
    },
    {
      "text": "There is a clear distinction between the loss of benefit already earned and the loss of prospect of earning something more.",
      "speaker": "court",
      "significance": "Explains why compulsory retirement not punishment."
    }
  ],
  "_case_id": "1954_84",
  "_label": 0,
  "_text_length": 35604,
  "_extracted_at": "2026-02-10T19:18:12.151440"
}