{
  "metadata": {
    "case_name": "Shri M.Y. Shareef & Dr. D.W. Kathalay v. The Judges of the High Court of Judicature at Nagpur",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Mehr Chand Mahajan C.J."
    ],
    "case_number": "Criminal Appeal No. 72 of 1952",
    "date_of_judgment": "1954-10-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Shri Zikar filed application under Article 226 of the Constitution alleging he was citizen of Bharat, Custodian of Evacuee Property and police treating him as national of Pakistan, prayed for interim order prohibiting deportation.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "High Court granted interim order of prohibition against the State.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "At hearing on 11th August 1950, State raised preliminary objection that Zikar suppressed material facts, petition liable to be dismissed.",
      "type": "procedural",
      "date": "1950-08-11",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Shri Shareef, counsel for Zikar, combated contention.",
      "type": "procedural",
      "date": "1950-08-11",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Affidavit filed by State on 17th August 1950, Zikar directed to file reply by 21st August 1950, which he did.",
      "type": "procedural",
      "date": "1950-08-17",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On 21st August 1950 proceedings: Shareef files affidavit and statement; judges draw attention to para 4, suggest client may claim not understood English; Shareef says explained contents; remark on para 6 uncalled for, possibly for Supreme Court argument; Naik argues preliminary point.",
      "type": "procedural",
      "date": "1950-08-21",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "After lunch on 21st August 1950, Shareef informs wants time to apply for transfer due to observations on paras 4 and 6; case adjourned to 25th August 1950.",
      "type": "procedural",
      "date": "1950-08-21",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "On 23rd August 1950, transfer application filed by Zikar, signed by Shareef and Dr. Kathalay as counsel, grounds: observations by Rao and Deo JJ. created bona fide belief of prejudice, references to Supreme Court unnecessary, would not receive justice.",
      "type": "material",
      "date": "1950-08-23",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Transfer application rejected.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Preliminary objection upheld, Article 226 petition dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Notices issued to Zikar, Shareef, Kathalay to show cause why committed for contempt for scandalizing Court via transfer application.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Dr. Kathalay filed written statement on 4th October 1950 denying contempt, averred no animus, bona fide belief transfer application permissible, professional duty, expressed regret that application hurt judges' feelings.",
      "type": "procedural",
      "date": "1950-10-04",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Shareef filed similar written statement, unaware law prohibited transfer application, expressed regret.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Shareef filed further statement on 16th October 1950, grieved at malice accusation, defending professional honour, admitted possible error of judgment causing pain to judges, deeply regretted.",
      "type": "procedural",
      "date": "1950-10-16",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "High Court held transfer application constituted contempt, advocates guilty, sentenced Shareef to fine Rs. 500 or 2 weeks SI, Kathalay Rs. 1000 or 1 month SI.",
      "type": "procedural",
      "date": "1950-11-30",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Leave to appeal to SC refused by High Court, granted by SC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "On 12th May 1954, SC recorded appellants tendered unqualified apology, adjourned appeal 2 months, directed tender to Division Bench.",
      "type": "procedural",
      "date": "1954-05-12",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "High Court on remand: rejected apology as not genuine, no remission of sentence.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Appeal back to SC, counsel affirmed genuine regret.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether signing the transfer application impeaching impartiality of judges constituted contempt of court by scandalizing the court with view to perverting due course of justice.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the unqualified apology tendered purged the contempt, warranting remission of sentence.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Signing transfer application was bona fide belief permissible and professional duty when client under impression of prejudice; no animus to scandalize court.",
      "supporting_facts": [
        "f8",
        "f12",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Prevalent misconception in Nagpur Bar that counsel's duty to client prevails over court obligations in signing such applications.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Admitted possible error of judgment, expressed regret; tendered unqualified apology to purge contempt.",
      "supporting_facts": [
        "f12",
        "f14",
        "f17",
        "f19"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Transfer application scandalized judges to divert course of justice; defiant justification despite early indication of acceptance of mistake.",
      "supporting_facts": [
        "f8",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Belated plea of error of judgment not candid; regret not adequate apology; apology on remand not genuine, no right to remission.",
      "supporting_facts": [
        "f14",
        "f18"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Transfer application constituted contempt as it scandalized judges to pervert course of justice; no exception to High Court decision on that.",
      "addresses_issue": "i1",
      "key_observation": "Decision that application constituted contempt stands."
    },
    {
      "id": "cr2",
      "text": "Prevalent misconception in section of Nagpur Bar about counsel responsibilities; counsel under erroneous impression duty to client prevails.",
      "addresses_issue": "i1",
      "key_observation": "Misconception to be rooted out: counsel signing scandalizing applications without prima facie grounds guilty of contempt."
    },
    {
      "id": "cr3",
      "text": "Judges' reference to Supreme Court during hearing unfortunate, may have been misunderstood.",
      "addresses_issue": "i1",
      "key_observation": "Counsel genuinely believed right in acting."
    },
    {
      "id": "cr4",
      "text": "Plea of justification not contumacious in borderline case settling principle; alternative apology merits consideration.",
      "addresses_issue": "i2",
      "key_observation": "High Court should have considered early regret; unqualified apology sincere and purges contempt."
    },
    {
      "id": "cr5",
      "text": "Condemnation by High Court heavy punishment for senior counsel; no past disrespect; matter stale.",
      "addresses_issue": "i2",
      "key_observation": "Set aside sentences to uphold dignity without fine."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Counsel who sign applications containing matter scandalizing court without prima facie grounds, to prevent/delay justice, guilty of contempt; duty to advise client against such.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Unqualified apology purges contempt in circumstances of misconception, borderline principle case, no contumacy.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": null,
      "citation": null,
      "treatment": "referred",
      "relevance": "High Court considered large number of English and Indian authorities to hold act constituted contempt."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Zikar's petition under Article 226 for enforcement of fundamental right."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal allowed to extent sentences of fine set aside; unqualified apology accepted as purging contempt; strong admonition and warning issued to appellants for conduct.",
    "relief_granted": "Sentences set aside.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "There cannot be both justification and an apology. The two things are incompatible.",
      "speaker": "court",
      "significance": "Core principle on apology in contempt proceedings."
    },
    {
      "text": "Counsel who sign applications or pleadings containing matter scandalizing the Court without reasonably satisfying themselves about the prima facie existence of adequate grounds therefor, with a view to prevent or delay the course of justice, are themselves guilty of contempt of Court.",
      "speaker": "court",
      "significance": "Emphatic pronouncement clarifying counsel's duties."
    },
    {
      "text": "Whatever the circumstances, I do see how much this application for transfer dated the 23rd August, 1950, has hurt the feelings of the Honble Judges and I very much regret that all this should have happened.",
      "speaker": "petitioner_counsel",
      "significance": "Early expression of regret by Dr. Kathalay."
    }
  ],
  "_case_id": "1954_110",
  "_label": 1,
  "_text_length": 24148,
  "_extracted_at": "2026-02-10T19:18:10.048591"
}