{
  "metadata": {
    "case_name": "Legal representatives of P. B. Deshmukh and S. B. Deshmukh v. Secretary of State for India in Council",
    "case_year": 1951,
    "court": "Supreme Court of India",
    "judges": [
      "Mehr Chand Mahajan, C.J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "P. B. Deshmukh, deceased, represented by his legal representatives, and S. B. Deshmukh, both cousins, formed a joint Hindu family of which the former was the manager.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For facility of the management of business S. B. Deshmukh managed money-lending shops at Kelod and Rejegaon, while P. B. Deshmukh managed the shop at Badegaon.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On the 1st of April, 1930, the Income-tax Officer Nagpur, issued a notice under section 22, sub-section 2, of the Income tax Act against the three shops of the firm calling for the return of the total income of the joint family during 1928-29.",
      "type": "procedural",
      "date": "1930-04-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On the 3rd July, 1930, M. K. Hirde, who held a general power of attorney from the two cousins, filed a return which was signed and verified by him as agent.",
      "type": "procedural",
      "date": "1930-07-03",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Pursuant to a notice issued under section 23(2) by the Income-tax Officer, the account books of the firm for 1924-29 were produced and P. B. Deshmukh was examined on oath by the Income-tax Officer on the 23rd November, 1930, in respect of certain omissions in the return.",
      "type": "procedural",
      "date": "1930-11-23",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "P. B. Deshmukh explained that the omissions of an item of Rs. 7,231 was due to the fact that it was advanced from his own personal funds and had nothing to do with the joint family, while the omissions of other items of repayment amounting to Rs. 30,477 by the debtors were due to the mistake of his agent, one Raghunath Choudhary, who had been dismissed since 1929.",
      "type": "disputed",
      "date": "1930-11-23",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Not being satisfied with his explanation, the Income-tax Officer recommended P. B. Deshmukhs prosecution and the Assistant Commissioner of Income-tax issued notice to him to show cause why his prosecution in respect of these omissions should not be sanctioned.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Assistant Commissioner examined P. B. Deshmukh on 13th December, 1930, when he admitted that he had concealed income of over Rs. 30,000.",
      "type": "disputed",
      "date": "1930-12-13",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "He was told that he would be prosecuted under section 52 of the Act. As a result of the discussion which followed, P. B. Deshmukh proposed that the offence should be compounded under section 53 upon payment by him of Rs. 30,000 to the taxing authorities and this was agreed to by the Assistant Commissioner. The payment was made in two instalments and the matter was closed.",
      "type": "material",
      "date": "1930-12-13",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In January, 1934, the two cousins filed a suit for recovery of Rs. 30,000 and Rs. 5,331-1-3 as interest, against the Secretary of State for India in Council.",
      "type": "procedural",
      "date": "1934-01",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The ground of the claim was that P. B. Deshmukhs statement of 13th December, 1930, was incorrectly recorded and that the sum of Rs. 30,000 was extorted from him under a threat of legal proceedings which were without jurisdiction and that he had committed no offence. The plea that the omission was due to the mistake of the agent was reiterated.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "The suit was resisted and it was pleaded in defence that both the statements of P. B. Deshmukh dated 23rd November, and 13th December, 1930, were correctly recorded, that the proposal for compounding the offence on payment of Rs. 30,000 emanated from P. B. Deshmukh himself after he had consulted his counsel and that there was no coercion exercised on him in compounding the offence.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "It was stated that the agent was fully competent, by virtue of his general power of attorney, to act on behalf of P. B. Deshmukh the manager and that he was fully aware of the omissions from the returns.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "The trial Court framed issues embodying the controversy between the parties, and, after a careful consideration of the entire evidence, held that the statements made by P. B. Deshmukh before the Income-tax authority represented a correct record of facts that he voluntarily offered to pay Rs. 30,000 by owning his mistakes and that he was not compelled to agree to the composition of the offence upon payment of Rs. 30,000.",
      "type": "procedural",
      "date": "1938-06-30",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "The trial Court held that the claim was the outcome of legal advice rather than one of an aggrieved person compelled to pay under threat of legal prosecution with a show of domination under power of authority.",
      "type": "procedural",
      "date": "1938-06-30",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "The trial Court also held that the agent who held the general power of attorney from P. B. Deshmukh was competent to sign and verify the income-tax returns and that the latter was liable to prosecution under section 107 read with section 177, Indian Penal Code.",
      "type": "procedural",
      "date": "1938-06-30",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Upon these findings the claim was dismissed by the First Additional District Judge, Nagpur, on 30th June, 1938.",
      "type": "procedural",
      "date": "1938-06-30",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "The High Court of Nagpur on appeal upheld the finding that the two statements of 23rd November and 13th December, 1930, were an authentic record of the statement of P. B. Deshmukh.",
      "type": "procedural",
      "date": "1945-02-28",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "The High Court further found that P. B. Deshmukh was an experienced businessman and an honorary magistrate and that he made a voluntary offer to compound the offence after consulting his legal adviser knowing fully well that he was at fault and was liable to be prosecuted under section 52 of the Act.",
      "type": "procedural",
      "date": "1945-02-28",
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "The High Court also found that P. B. Deshmukh knew not only that he was liable to be prosecuted but that he would, in all probability be convicted and sentenced and in consequence of this apprehension he admitted his guilt and volunteered to pay Rs. 30,000 as composition fee.",
      "type": "procedural",
      "date": "1945-02-28",
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "The High Court held that P. B. Deshmukh was bound by the action of his agent and was liable under section 52 but even if he was not liable as a principal but only as an abettor that was a question for the criminal court to decide. In the result the appeal was dismissed.",
      "type": "procedural",
      "date": "1945-02-28",
      "source": "lower_court"
    },
    {
      "id": "f22",
      "text": "The certificate for leave to appeal to this Court was granted on 23rd February, 1951.",
      "type": "procedural",
      "date": "1951-02-23",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether under the law the return of income must be signed by the individual personally and not by his agent even if he holds a power of attorney and whether P. B. Deshmukh was liable for the act of his agent and could be prosecuted for the false statement in the return under section 52 of the Income tax Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Assistant Commissioner could compound the offence under section 53 even if the offence under section 52 was not proved or if liability arose under section 51(c).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "P. B. Deshmukhs statement of 13th December, 1930, was incorrectly recorded and that the sum of Rs. 30,000 was extorted from him under a threat of legal proceedings which were without jurisdiction and that he had committed no offence. The omission was due to the mistake of the agent.",
      "supporting_facts": [
        "f6",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "On the authority of Commissioner of Agricultural Income-tax, Bengal v. Shri Keshab Chandra Mandal that under the law the return of income must be signed by the individual personally and not by his agent even if he holds a power of attorney and P. B. Deshmukh was not liable for the act of his agent and could not be prosecuted for the false statement in the return under section 52 of the Income tax Act.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Commissioner of Agricultural Income-tax, Bengal v. Shri Keshab Chandra Mandal; Section 52, Income Tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Both the statements of P. B. Deshmukh dated 23rd November, and 13th December, 1930, were correctly recorded, that the proposal for compounding the offence on payment of Rs. 30,000 emanated from P. B. Deshmukh himself after he had consulted his counsel and that there was no coercion exercised on him in compounding the offence.",
      "supporting_facts": [
        "f5",
        "f8",
        "f9",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The agent was fully competent, by virtue of his general power of attorney, to act on behalf of P. B. Deshmukh the manager and that he was fully aware of the omissions from the returns.",
      "supporting_facts": [
        "f4",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Upon the concurrent findings of fact arrived at by the Courts below no question of law arises.",
      "addresses_issue": "i1",
      "key_observation": "Concurrent findings of fact by lower courts upheld."
    },
    {
      "id": "cr2",
      "text": "What section 53 provides is that a person shall not be proceeded against for an offence under section 51 or section 52 except at the instance of the Inspecting Assistant Commissioner and that the last-mentioned officer may, before or after the institution of proceedings, compound any such offence. The section does not say that the offence can only be compounded if it is proved to have been actually committed. If there is a proceeding on a charge under section 51 or section 52, it comes within the purview of section 53 and a compounding of the offence will be quite within the section.",
      "addresses_issue": "i2",
      "key_observation": "Compounding valid under section 53 without proof of offence."
    },
    {
      "id": "cr3",
      "text": "P. B. Deshmukh being anxious to avoid his liability for prosecution made a voluntary offer to compound the offence which the Assistant Commissioner of Income-tax was fully competent to accept under section 53 of the Act. The offer was made obviously to avert the disgrace and ignominy of a prosecution.",
      "addresses_issue": "i1",
      "key_observation": "Voluntary offer by P.B. Deshmukh."
    },
    {
      "id": "cr4",
      "text": "But even if it be assumed that P. B. Deshmukh was not liable to be prosecuted under section 52 because of the verification being made by his agent and not by himself, that there was no return by him under section 22 of the Income-tax Act, his liability under section 51(c) for failing without reasonable cause or excuse to furnish in due time any of the returns mentioned in section 22, sub-section 2, would nevertheless remain unaffected.",
      "addresses_issue": "i1",
      "key_observation": "Alternative liability under section 51(c)."
    },
    {
      "id": "cr5",
      "text": "Whether his liability arose under section 51 for failure to furnish the return as required by section 51(c) or for making a false statement in the return as contemplated by section 52, it made no difference to the authority of the Assistant Commissioner to permit the composition of the offence under section 53. That section covers both the offences under sections 51 and 52.",
      "addresses_issue": "i2",
      "key_observation": "Section 53 covers both sections 51 and 52."
    },
    {
      "id": "cr6",
      "text": "There can be no doubt therefore that P. B. Deshmukh could be prosecuted either under section 51(c) or section 52 and even if he had been prosecuted by the Income-tax authorities under section 52 only, there was nothing to prevent the Court from altering the charge to one under section 51(c) if it thought fit.",
      "addresses_issue": "i1",
      "key_observation": "Court could alter charge if needed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The contention that P. B. Deshmukh was not liable for the act of his agent under section 52 has no force as section 53 allows compounding of offences under sections 51 or 52 without proof, and alternative liability exists under section 51(c).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Compounding under section 53 is valid even if proceedings are initiated under section 52, as it covers both sections 51 and 52.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Agricultural Income-tax, Bengal v. Shri Keshab Chandra Mandal",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Petitioner contended it requires personal signature on return, but court holds contention has no force."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income Tax Act",
      "sections": [
        "22(2)",
        "23(2)",
        "51",
        "51(c)",
        "52",
        "53"
      ],
      "relevance": "Governs notices, returns, offences of failure to furnish return or false statement, and compounding of such offences."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "107",
        "177"
      ],
      "relevance": "Trial court held liability to prosecution under section 107 read with section 177."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed as upon the concurrent findings of fact arrived at by the Courts below no question of law arises and the compounding was valid under section 53 of the Income Tax Act.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Upon the concurrent findings of fact arrived at by the Courts below no question of law arises.",
      "speaker": "court",
      "significance": "Basis for dismissing the appeal."
    },
    {
      "text": "The section does not say that the offence can only be compounded if it is proved to have been actually committed.",
      "speaker": "court",
      "significance": "Clarifies scope of section 53 for compounding."
    },
    {
      "text": "P. B. Deshmukh being anxious to avoid his liability for prosecution made a voluntary offer to compound the offence which the Assistant Commissioner of Income-tax was fully competent to accept under section 53 of the Act.",
      "speaker": "court",
      "significance": "Upholds voluntariness and competence of compounding."
    }
  ],
  "_case_id": "1954_64",
  "_label": 0,
  "_text_length": 8419,
  "_extracted_at": "2026-02-10T19:17:29.999105"
}