{
  "metadata": {
    "case_name": "Appellant (elected from Laundi Constituency) v. Respondent",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Ayyar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant elected to the Legislative Assembly, Vindhya Pradesh, from Laundi Constituency.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Election Tribunal, Nowgong, set aside the appellant's election on ground that he employed Government servants as polling agents, committing corrupt practice under Section 123(8) of Act 43 of 1951.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "At the material period, contracts subsisting between the appellant and the Vindhya Pradesh Government for printing electoral rolls, disqualifying him under Section 17 of Act 49 of 1951.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Evidence of P.W. 5, if accepted, shows that the polling agent also did canvassing work for the appellant.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "No finding by the Tribunal on whether polling agent did canvassing work.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Tribunal finding that Vindhya Pradesh Government got the electoral rolls printed.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Exhibit A-4 is a copy of a letter sent by the appellant to the Secretary to the Chief Commissioner, Vindhya Pradesh, showing that Vindhya Pradesh Government settled the terms of the contract and made payments thereunder.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether appointment of Government servant as polling agent constitutes per se corrupt practice under Section 123(8) of Act 43 of 1951, or if canvassing also occurred.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether contracts for printing electoral rolls were with Vindhya Pradesh Government (Chief Commissioner in Part C State), operating as disqualification under Section 17 of Act 49 of 1951 read with Section 7(d) of Act 43 of 1951, or with Election Commission.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appointment of Government servant as polling agent does not per se fall within mischief of Section 123(8).",
      "supporting_facts": [],
      "legal_basis": "Satya Dev Busheri v. Padam Dev (prior decisions)"
    },
    {
      "id": "pa2",
      "text": "Contract for printing electoral rolls entered into with Election Commission, not State Government or Union Government.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Article 324 of the Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Polling agent did canvassing work for appellant, constituting corrupt practice under Section 123(8).",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 123(8) of Act 43 of 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appointment of Government servant as polling agent does not per se fall within mischief of Section 123(8); no finding by Tribunal on canvassing by polling agent.",
      "addresses_issue": "i1",
      "key_observation": "Tribunal decision rests merely on appointment, not canvassing."
    },
    {
      "id": "cr2",
      "text": "Contracts with Chief Commissioner in Part C States operate as disqualification under Section 17 of Act 49 of 1951 read with Section 7(d) of Act 43 of 1951; preparation of electoral rolls distinct from printing; no provision for Election Commission to enter printing contracts; Tribunal finding confirmed by Exhibit A-4 that Vindhya Pradesh Government settled terms and made payments.",
      "addresses_issue": "i2",
      "key_observation": "Article 324 vests superintendence in Election Commission but does not imply it enters printing contracts."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No contravention of Section 123(8) by the appellant.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Subsisting contracts with Vindhya Pradesh Government for printing electoral rolls result in disqualification under Section 17 of Act 49 of 1951.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Satya Dev Busheri v. Padam Dev",
      "citation": "A and S B",
      "treatment": "followed",
      "relevance": "Appointment of Government servant as polling agent not per se corrupt practice under Section 123(8); contracts with Chief Commissioner in Part C States disqualify under Section 17 of Act 49 of 1951"
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951 (Act 43 of 1951)",
      "sections": [
        "Section 123(8)",
        "Section 7(d)"
      ],
      "relevance": "Defines corrupt practice and disqualification due to contracts"
    },
    {
      "name": "Act 49 of 1951",
      "sections": [
        "Section 17"
      ],
      "relevance": "Provides disqualification for election due to subsisting government contracts"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 324"
      ],
      "relevance": "Vests superintendence, direction and control of preparation of electoral rolls in Election Commission, but distinguished from printing contracts"
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Court overturned the finding of corrupt practice under Section 123(8) but upheld the disqualification under Section 17 of Act 49 of 1951 due to government contracts for printing electoral rolls.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Following the decisions already mentioned, we hold that there has been no contravention of Section 123(8) by the appellant.",
      "speaker": "court",
      "significance": "Direct holding on first issue in favor of appellant"
    },
    {
      "text": "Exhibit A-4 is a copy of a letter sent by the appellant to the Secretary to the Chief Commissioner, Vindhya Pradesh, and that clearly shows that it was the Vindhya Pradesh Government that settled the terms of the contract and made payments thereunder.",
      "speaker": "court",
      "significance": "Confirms contract with state government, upholding disqualification"
    }
  ],
  "_case_id": "1954_164",
  "_label": 0,
  "_text_length": 3168,
  "_extracted_at": "2026-02-10T19:18:54.248711"
}