{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Mysore Chromite Ltd.",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "DAS J."
    ],
    "case_number": "Civil Appeal No. 117 of 1953",
    "date_of_judgment": "1954-11-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee company is a private limited company registered in the Mysore State under the Mysore Company Regulations and has its registered office at Sinduvalli in Mysore State.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The management and control of the assessee company was vested in Messrs. Oakley Bowden & Co. (Madras) Ltd., another private limited company incorporated under the Indian Companies Act, having its registered office at No. 15, Armenian Street, Madras.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The assessee company owns chromite mines in Mysore State. Chrome ores are extracted from the mines and converted into a merchantable product and then sold to buyers mostly outside India. A very small proportion of the total sales is effected in India.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Sales to purchasers in Europe are put through in London by Bowden Oakley & Co. Ltd., London, which is the agent of the assessee company in Europe holding a power of attorney from the assessee company. Contracts for sale to European purchasers are signed by Bowden Oakley & Co. Ltd., in London.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Sales to purchasers in America are effected through Messrs. W. R. Grace & Co., who buy for undisclosed principals. Contracts for sale to American purchasers are signed by W. R. Grace & Co., presumably in America and by Oakley Bowden & Co. (Madras), Ltd., in Madras.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Under both forms of contracts the price was F.C.B. Madras or Marmagoa. A very small quantity of goods was sold F.O.B. Marmagoa. Provision was made for weighment, sampling and assay of goods at destination.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Terms of payment under European contract: Buyers to open confirmed irrevocable Bankers credit in favour of Messrs. Mysore Chromite Ltd., Madras to be advised to sellers through the Eastern Bank Ltd., for 90 per cent. of the Provisional Invoice against documents (Bills of Lading, Provisional Invoice). Balance on ascertainment of weight and analysis to be paid in London to Bowden Oakley & Co., Ltd., within 10 days of the final invoice.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Terms of payment under American contracts: Letter of credit for 80 per cent. of invoice value at 90 days sight with documents attached to be opened immediately in London in favour of the seller. Balance estimated 20 per cent. to be paid by telegraphic transfer through London on receipt of information as to assay and outturn.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "European contracts provided for insurance by buyers but no such provision in American contracts.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Before goods shipped, buyers open confirmed irrevocable Bankers credit with first class bank in London. Eastern Bank Ltd., London intimates Eastern Bank Ltd., Madras, which informs assessee by letter.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On receipt of intimation, assessee places contracted goods on board steamer at Madras and obtains bill of lading in its own name. Shipments principally at Madras Port.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Assessee makes provisional invoice on basis of bill of lading weight and contract price for 48 per cent Cr. 203, draws bill of exchange on buyers' Bank for 90% (European) or 80% (American) of provisional invoice, drawn in favour of Eastern Bank Ltd., London.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Bill of exchange with bill of lading (endorsed in blank) and provisional invoice negotiated with Eastern Bank Ltd., Madras, who credits assessee with amount. Eastern Bank Madras forwards documents to Eastern Bank London, who presents to buyers' Bank in London.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Upon acceptance of bill of exchange, Eastern Bank London delivers bill of lading and invoice to buyers' Bank, who pays amount to Eastern Bank London.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On arrival of goods, after weighment and assay, sale price ascertained, balance paid to Eastern Bank Ltd., London, assessee's agent and banker.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Proceedings for assessment to income-tax of assessee for years 1939-1940, 1940-1941, 1941-1942 and 1942-1943.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Income-tax Officer assessed assessee on entire profits from these sales on footing they arose and were received in British India.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Appellate Assistant Commissioner confirmed the assessment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Income-tax Appellate Tribunal by order dated 22nd January 1948 held sales took place outside British India and money received by agent in London.",
      "type": "procedural",
      "date": "1948-01-22",
      "source": "tribunal"
    },
    {
      "id": "f20",
      "text": "Commissioner applied to Tribunal to refer questions of law under section 66(1) Income-tax Act. Tribunal referred two questions.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "High Court of Madras on 29th March 1951 answered both questions in affirmative against Commissioner.",
      "type": "procedural",
      "date": "1951-03-29",
      "source": "high_court"
    },
    {
      "id": "f22",
      "text": "Commissioner preferred appeal to Supreme Court with certificate of fitness.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Agreed between department and assessee that income arose at place where sales took place.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case the profits derived by the assessee company from sales made to European and American buyers arose outside British India?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether on the facts and in the circumstances of the case the profits derived by the assessee company from sales made to European and American buyers were received outside British India?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Having regard to the terms of the contracts the sales must be regarded as having taken place in British India: price and delivery on F.O.B. terms; in European contracts insurance concern of buyers; payment of 80% or 90% made in Madras by Eastern Bank Madras to assessee on delivery of documents. Property in goods passed at Madras.",
      "supporting_facts": [
        "f6",
        "f9",
        "f12",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Irrespective of place of sale, profits received in Madras as assessee received payment of 80% or 90% of provisional invoice from Eastern Bank Madras after handing over documents.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sales took place outside British India as property passed outside; money received by agent in London.",
      "supporting_facts": [
        "f4",
        "f5",
        "f14",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Contracts for sale of unascertained goods. Under Sale of Goods Act s.23, property passes on unconditional appropriation. Here, appropriation not unconditional due to reservation of right of disposal until conditions fulfilled (s.25). Bill of lading (document of title) not parted with until bill of exchange honoured.",
      "addresses_issue": "i1",
      "key_observation": "Property in goods could not have passed earlier than date when bill of exchange accepted by buyers' Bank in London and documents delivered there."
    },
    {
      "id": "cr2",
      "text": "FOB delivery discharges seller's liability and risk passes, but seller reserved right of disposal until payment via letter of credit against documents.",
      "addresses_issue": "i1",
      "key_observation": "Sales took place outside British India; profits arose outside."
    },
    {
      "id": "cr3",
      "text": "Payment by Eastern Bank Madras was advance on security of bill of lading and drawer's liability, backed by irrevocable credit; not receipt of price. Actual price paid by buyers' London Banks to Eastern Bank London (assessee's agent).",
      "addresses_issue": "i2",
      "key_observation": "First receipt of price by Eastern Bank London on behalf of sellers. Balance also received in London."
    },
    {
      "id": "cr4",
      "text": "Cites Prinz Adalbert: Shipper discounting draft with bill of lading makes goods security; banker surrenders bill of lading against acceptance.",
      "addresses_issue": "i2",
      "key_observation": "Payment by Eastern Bank Madras is advance to customer, not price payment."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sales took place outside British India as property passed in London when documents delivered against acceptance of bill of exchange.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Profits received outside British India, first by agent Eastern Bank London.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "The Prinz Adalbert",
      "citation": "L.R. 1917 A.C. 586, 589",
      "treatment": "followed",
      "relevance": "Explains nature of discounting draft with bill of lading as advance on security, not payment of price."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "66(1)"
      ],
      "relevance": "Basis for reference of questions by Tribunal to High Court."
    },
    {
      "name": "Indian Sale of Goods Act",
      "sections": [
        "4",
        "18",
        "23",
        "25"
      ],
      "relevance": "Defines contract of sale, passing of property in unascertained goods, unconditional appropriation, reservation of right of disposal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court and Tribunal, answering both referred questions in the affirmative: profits from sales to European and American buyers arose and were received outside British India.",
    "relief_granted": "In favour of assessee company; assessments on these profits not taxable in British India.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the property in the goods could not have passed to the buyer earlier than the date when the bill of exchange was accepted by the buyers Bank in London and the documents were delivered by the assessee companys agent, the Eastern Bank Ltd., London, to the buyers Bank.\"",
      "speaker": "court",
      "significance": "Determines place of sale outside British India."
    },
    {
      "text": "\"This payment by the Eastern Bank Ltd., Madras, therefore, is nothing but an advance made by them to their own customer on the security of the goods covered by the bill of lading\"",
      "speaker": "court",
      "significance": "Clarifies that bank payment was advance, not receipt of profits."
    }
  ],
  "_case_id": "1954_116",
  "_label": 0,
  "_text_length": 22538,
  "_extracted_at": "2026-02-08T22:15:08.093528"
}