{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Bombay v. Assessee (companion case to Civil Appeal No. 19 of 1953)",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "Das, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The question referred by the Income-tax Appellate Tribunal for the opinion of the Bombay High Court was: Whether on the facts of the case, income, profits and gains in respect of sales made to Government of India was received in British India within the meaning of Section 41 of the Act?",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The High Court answered the question in the negative for reasons set out in its judgment covering this case as well as the case out of which Appeal No. 19 of 1953 came to be filed before us.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "The facts found in this case are similar to those found in Civil Appeal No. 19 of 1953 Commissioner of Income-tax, Bombay v. Messrs, Ogale Glass Works Ltd., except that: 1. all cheques were made non-negotiable, 2. credit was given by the bank to the assessee before collection, 3. there was no finding that the assessee gave credit to the Government for the amount of the cheque immediately on receipt thereof.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Learned counsel on either side did not suggest that the differences numbered above would make any difference in the answer to the referred question which is the same as in the other appeal.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts of the case, income, profits and gains in respect of sales made to Government of India was received in British India within the meaning of Section 41 of the Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "That being the position, this case is governed by the judgment which has just been pronounced by us in the other appeal.",
      "addresses_issue": "i1",
      "key_observation": "Facts similar to Ogale Glass Works case except minor differences which counsel agree do not affect the answer."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The referred question is answered in the affirmative.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Bombay v. Messrs, Ogale Glass Works Ltd.",
      "citation": "Civil Appeal No. 19 of 1953",
      "treatment": "followed",
      "relevance": "Facts similar and governs the answer to the referred question in this case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income Tax Act",
      "sections": [
        "Section 41"
      ],
      "relevance": "Determines if income from sales to Government of India was received in British India."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed and the referred question is answered in the affirmative, following the judgment in the companion case Civil Appeal No. 19 of 1953.",
    "relief_granted": "Referred question answered in the affirmative",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Whether on the facts of the case, income, profits and gains in respect of sales made to Government of India was received in British India within the meaning of Section 41 of the Act?",
      "speaker": "court",
      "significance": "The core legal question referred and decided."
    },
    {
      "text": "We accordingly allow the appeal and answer the referred question in the affirmative.",
      "speaker": "court",
      "significance": "Final determination reversing the High Court."
    }
  ],
  "_case_id": "1954_128",
  "_label": 1,
  "_text_length": 1379,
  "_extracted_at": "2026-02-10T19:17:56.221253"
}