{
  "metadata": {
    "case_name": "Karnail Singh and Malkiat Singh v. State",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Ayyar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Long standing enmity between the appellants and their party on the one hand and the deceased Gurbaksh Singh and his party on the other, resulting in a number of crimes, and proceedings in court.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On the 27th January, 1952, at about sunset time, Gurbaksh Singh was sitting inside his house and his sister Mst. Bholan was in the kitchen.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "The appellants and their men came to the place armed with rifles, got on the roof of the house of Gurbaksh Singh and challenged him to come out.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Gurbaksh Singh and Mst. Bholan went to the kotha and bolted the door from inside.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "The appellants and their men made holes in the roof with spades, ignited inflammable materials, such as dry twigs, and threw them inside the kotha through the holes and set fire to the building.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Both Gurbaksh Singh and Mst. Bholan were caught inside and burnt to death.",
      "type": "material",
      "date": "1952-01-27",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "A brother of Gurbaksh Singh called Dev, who had been away, was seized when he subsequently turned up, thrown into the flames and was also burnt to death.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Gurnam Singh, P.W. 13, a cousin of Gurbaksh Singh and his neighbour, managed to slip out of the village and reported the occurrence at the police station at Nihal Singhwala, a place eight miles away vide Exhibit PQ. It was then 10.30 P.M.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "On receipt of this information, the police sub-inspector, P.W. 25, went to the village with a posse of constables and with Gurnam Singh. He found the house mostly burnt and recovered therefrom the charred remains of three dead bodies and they were identified as those of Gurbaksh, Dev and Mst. Bholan.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "The appellant Karnail Singh was actually seen at that place and arrested on the spot.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Malkiat Singh who had been mentioned in Exhibit PQ as one of the participants was found in his house with gunshot wounds and was also arrested.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Eventually eight persons, including the appellants, were charged under section 148, Indian Penal Code, for forming an unlawful assembly with the object of burning the house of Gurbaksh Singh and murdering him, Dev and Mst. Bholan, and under section 302 read with section 149 for their murder.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "The Additional Sessions Judge, Ferozepore, held that the case had not been established beyond doubt as against two of the accused and he accordingly acquitted them. He convicted the six others including the appellants under section 148 and section 302 read with section 149 and sentenced them to death.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "On appeal, the learned Judges of the Punjab High Court held that the occurrence took place more or less on the lines described by the prosecution witnesses, and the primary object of the culprits must have been to murder Gurbaksh Singh in consequence of the bitter enmity; evidence against the four accused other than the appellants was insufficient and they were acquitted.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "As against the two appellants, there was evidence of the two eyewitnesses, Gurnam Singh PW 13 and Maghar Singh PW 14; Maghar Singh was not a reliable witness; nothing could be urged against the evidence of Gurnam Singh, but unsafe to base conviction on his evidence alone; presence of Karnail Singh at the spot and wounds on Malkiat Singh afforded sufficient corroboration.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "High Court confirmed the conviction and sentences as against the appellants. As four of the accused were acquitted in appeal, set aside the conviction of the appellants under section 149 and substituted section 34, Indian Penal Code, therefore.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Karnail Singh was found emerging out of the burning house with a spear in his hand. He had injuries on his person and his pyjama was blood-stained. He was arrested on the spot and the spear and the pyjama were seized and marked as Exhibits P-12 and P-20.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    },
    {
      "id": "f18",
      "text": "In the statement given by Karnail Singh under section 342, Criminal Procedure Code, he stated that when he saw the house of Gurnam Singh on fire, he went there and was assaulted by culprits, that Malkiat Singh came there to help him, that when they were grappling with the culprits he was attacked and Malkiat Singh received a gunshot and thereafter they went away to their houses. The statement of Malkiat Singh also was on similar lines.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f19",
      "text": "PW 14 deposed that while the incidents were in progress Malkiat Singh stated that he had been shot by one of his own men and then left the place.",
      "type": "material",
      "date": "1952-01-27",
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the evidence which had been accepted by the High Court as reliable was insufficient to establish the guilt of the appellants.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether their conviction under section 34 was bad as no charge had been framed against them under that section, when charged under section 302 read with section 149.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Having held that the only eye witness whose evidence was worthy of credence was P.W. 13, and that even his evidence could not be acted upon unless it was corroborated, the learned Judges were in error in holding that there was such corroboration against the appellants.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The mere presence of Karnail Singh at the place of occurrence would in itself mean nothing and that it would amount to corroboration only if some further act incriminatory in character was proved.",
      "supporting_facts": [
        "f10",
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "With reference to Malkiat Singh, the existence of gunshot wounds would be inconclusive as there was no evidence as to how they were caused; the theory that Gurbaksh Singh might himself have shot at him is unsupported by evidence, opposed to medical evidence, and no gun recovered.",
      "supporting_facts": [
        "f11",
        "f19"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "If the statements under section 342 are to be taken into consideration they must be taken as a whole and it was not proper to accept the incriminating portion and reject the exculpatory portion thereof.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": "Hanumant v. State of Madhya Pradesh, 1952 S.C.R. 1091 at p. 1111"
    },
    {
      "id": "pa5",
      "text": "The scope of section 149 is different from that of section 34; while section 149 requires proof of a common object, section 34 requires a common intention; therefore when the charge is under section 149, it cannot be converted in appeal into one under section 34.",
      "supporting_facts": [
        "f12",
        "f16"
      ],
      "legal_basis": "Dalip Singh v. State of Punjab; Barendra Kumar Ghosh v. Emperor, I.L.R. 52 Cal. 197 (P.C.)"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "So far as Karnail Singh is concerned, his presence at the scene of occurrence under the circumstances disclosed in the evidence is sufficient to corroborate the evidence of P.W. 13. Karnail Singh was arrested on the spot with a spear and a bloodstained pyjama, and these are pieces of evidence which would support the inference that he was concerned in the crime.",
      "addresses_issue": "i1",
      "key_observation": "Gurnam Singh is not an approver; corroboration required is what would lend assurance to the evidence; vide Lachhman Singh v. State, 1952 S.C.R. 839 at p. 845."
    },
    {
      "id": "cr2",
      "text": "For Malkiat Singh, mention in FIR not independent corroboration; but admission in s.342 statement of presence is distinct and can be used; injuries received at scene supported by PW14 evidence that Malkiat said he was shot by one of his own men, accepted by HC.",
      "addresses_issue": "i1",
      "key_observation": "Ample materials for holding gunshot wounds received by Malkiat Singh in the house of Gurbaksh Singh."
    },
    {
      "id": "cr3",
      "text": "There is substantial difference between sections 149 and 34 but they overlap; question depends on facts of each case; if common object under 149 involves common intention under 34, and no prejudice, substitution is formal.",
      "addresses_issue": "i2",
      "key_observation": "Not bound by Dalip Singh as broad proposition; vide Lachhman Singh v. State."
    },
    {
      "id": "cr4",
      "text": "Both appellants had long standing enmity, got on roof and set fire with deceased complled up within; object to burn house and cause death of Gurbaksh same as intention under s.34; charge wording mentions intentionally set fire and murdered.",
      "addresses_issue": "i2",
      "key_observation": "No difference between object and intention on facts."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Evidence of PW13 corroborated sufficiently for both appellants; first contention overruled.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Substitution of s.34 for s.149 valid on facts as common object involved common intention, no prejudice to accused.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hanumant v. State of Madhya Pradesh",
      "citation": "1952 S.C.R. 1091",
      "treatment": "referred",
      "relevance": "Statements under s.342 must be read as whole if used as admission."
    },
    {
      "case_name": "Lachhman Singh v. State",
      "citation": "1952 S.C.R. 839",
      "treatment": "followed",
      "relevance": "Corroboration needed to lend assurance, not as for approver; substitution of s.34 for s.149 upheld if facts allow alternative charge."
    },
    {
      "case_name": "Dalip Singh v. State of Punjab",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "No recourse to s.34 if not charged and common intention/object different; but not broad proposition."
    },
    {
      "case_name": "Barendra Kumar Ghosh v. Emperor",
      "citation": "I.L.R. 52 Cal. 197 (P.C.)",
      "treatment": "referred",
      "relevance": "Sections 149 and 34 overlap to some extent."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "149",
        "34",
        "148"
      ],
      "relevance": "Charged u/s 148, 302/149; convicted u/s 148, 302/149 by Sessions, substituted 302/34 by HC; SC upheld substitution as facts support common intention."
    },
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "342"
      ],
      "relevance": "Statements of accused used as admissions of presence."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the High Court judgment confirming conviction under section 302 read with section 34 IPC and death sentence is dismissed; contentions on sufficiency of evidence and validity of substitution of s.34 rejected.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The corroboration that is required in such cases is not what would be necessary to support the evidence of an approver but what would be sufficient to lend assurance to the evidence before them.",
      "speaker": "court",
      "significance": "Defines standard of corroboration for PW13's testimony."
    },
    {
      "text": "If the common object which is the subject-matter of the charge under section 149 does not necessarily involve a common intention, then the substitution of section 34 for section 149 might result in prejudice to the accused.",
      "speaker": "court",
      "significance": "Test for substituting s.34 for s.149."
    }
  ],
  "_case_id": "1954_78",
  "_label": 0,
  "_text_length": 16071,
  "_extracted_at": "2026-02-10T19:18:08.672517"
}