{
  "metadata": {
    "case_name": "Chenabasavana (Defendant No. 1) v. Plaintiff (Respondent No. 1)",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Mukherjea J."
    ],
    "case_number": "Civil Appeal No. 89 of 1953",
    "date_of_judgment": "1954-04-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The land in suit, area a little over 9 acres (9 acres 49 cents of wet land), was property of Basappa who died before 1918 leaving three daughters: Paramma, Pompamma and Hampamma.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Under settlement with Basappa's reversioner, evidenced by registered deeds Exhibits P-2 (1918) and P-3 (1919), three sisters got 15-16 acres wet land in absolute right.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Hampamma took her one-third share; remaining two-thirds share (9 acres 49 cents) enjoyed by Paramma and Pompamma, subject-matter of suit.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Pompamma married Nagana Gowd, gave birth to two sons Siddalingana and Chenabasavana, died in 1923; her share devolved upon the two sons.",
      "type": "admitted",
      "date": "1923",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After Pompamma's death, Nagana remarried and stayed in ancestral village; two infant sons remained at village Kampli with Paramma, who reared them.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On 22nd June 1923, Paramma executed deed of gift conveying her share in suit property to two sons of Pompamma; entirety of 9 acres 49 cents owned jointly by two sons.",
      "type": "material",
      "date": "1923-06-22",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Siddalingana (elder son) died in 1924; plaintiff's case: his half-share devolved on father Nagana under Hindu law of inheritance.",
      "type": "disputed",
      "date": "1924",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Paramma continued to possess entirety of land on behalf of younger son Chenabasavana (defendant No. 1).",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On 25th August 1926, lease deed Exhibit D-1 and counterpart D-2: Nagana as father/guardian of infant Chenabasavana granted lease of entire property to Paramma for 12 years at Rs. 500/year.",
      "type": "material",
      "date": "1926-08-25",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Rent receipts Exhibits D-4 (1927) and D-4-1 (1932) passed by Nagana to Paramma on behalf of Chenabasavana.",
      "type": "admitted",
      "date": "1927, 1932",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "In 1934, Nagana as guardian of Chenabasavana sued Paramma in Munsif's Court Hospet for Rs. 500 rent; decreed ex parte, discharged by Exhibit D-3 (14th November 1934) reciting rents paid as Paramma borrowed for minor.",
      "type": "material",
      "date": "1934-11-14",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Nagana became financially involved; on 27th August 1935, executed mortgage by conditional sale of half-share of disputed land to defendant No. 2 for Rs. 3,000; recited half-share devolved on death of Siddalingana, mortgagor in possession.",
      "type": "material",
      "date": "1935-08-27",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On 16th July 1936, Nagana sold mortgaged property (half-share) to defendant No. 2 by deed Exhibit P-6 for Rs. 3,000.",
      "type": "material",
      "date": "1936-07-16",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Defendant No. 2 never obtained possession.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On 2nd May 1944, defendant No. 2 sold property to plaintiff by conveyance Exhibit P-1.",
      "type": "material",
      "date": "1944-05-02",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "On 18th July 1944, plaintiff filed Original Suit No. 17 of 1944 in District Judge Bellary against Chenabasavana (defendant No. 1) for half-share after partition, defendant No. 2 impleaded.",
      "type": "procedural",
      "date": "1944-07-18",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Trial Judge (District Judge Bellary) dismissed suit on 23rd July 1945: deed of gift conferred no right on Nagana, disclaimed by lease/receipts; plaintiff never in possession within 12 years; Nagana disclaimed as co-owner.",
      "type": "procedural",
      "date": "1945-07-23",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Plaintiff appealed to High Court Madras (Appeal No. 654 of 1945); Division Bench (Rajamannar C.J., Balakrishna Ayyar J.) allowed appeal on 28th March 1949: sons tenants-in-common, Nagana got interest; no adverse possession as animus ceased in 1935.",
      "type": "procedural",
      "date": "1949-03-28",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Defendant No. 1 appealed to Supreme Court on certificate under Article 133 Constitution read with Sections 109, 110 CPC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Defendant No. 1's defences: (1) donees joint tenants with survivorship, Siddalingana's interest to defendant No. 1; (2) plaintiff barred by adverse possession.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the two sons took property under deed of gift as joint tenants (survivorship to surviving brother) or tenants-in-common (interest of deceased son to father Nagana).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether defendant No. 1 acquired title to half-share by adverse possession against Nagana and his alienees, given acts like lease by Nagana as guardian and later mortgage.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Nagana disclaimed rights as co-owner by lease deed (1926), receipts, rent suit (1934); acted only as guardian of Chenabasavana; presumption of one co-owner's possession for all does not apply; adverse possession from 1926.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "Hindu law; limitation (12 years)"
    },
    {
      "id": "pa2",
      "text": "Not pressing joint tenancy point in Supreme Court; accepts Nagana became co-owner after Siddalingana's death.",
      "supporting_facts": [
        "f7",
        "f20"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sons took as tenants-in-common; Siddalingana's interest vested in father Nagana.",
      "supporting_facts": [
        "f4",
        "f6",
        "f7"
      ],
      "legal_basis": "Hindu law of inheritance"
    },
    {
      "id": "ra2",
      "text": "Nagana's animus to hold solely for Chenabasavana lasted only till 1935 mortgage asserting own half-share right; adverse possession interrupted.",
      "supporting_facts": [
        "f9",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Accepts no joint tenancy argument pressed; Nagana co-owner with infant son Chenabasavana; presumption possession of one co-owner for other unless ouster proved.",
      "addresses_issue": "i1",
      "key_observation": "Defendant must prove adverse possession for statutory period."
    },
    {
      "id": "cr2",
      "text": "Nagana's lease (1926) as guardian asserted son's exclusive title, denying own; lessee's possession is lessor's (son's); adverse even with father's consent/knowledge.",
      "addresses_issue": "i2",
      "key_observation": "Adverse possession possible with consent of true owner."
    },
    {
      "id": "cr3",
      "text": "1935 mortgage mere assertion of title by dispossessed father; does not interrupt adverse possession without re-entry, resumption of possession, or acknowledgment by possessor.",
      "addresses_issue": "i2",
      "key_observation": "No change in possession; property leased to Paramma; Nagana continued acknowledging son's title via receipts, suit."
    },
    {
      "id": "cr4",
      "text": "Father's acts re lease as guardian are son's acts; mortgage personal act of father qua proprietor, adverse to son; no effect on continuity.",
      "addresses_issue": "i2",
      "key_observation": "Guardian cannot unilaterally change for minor."
    },
    {
      "id": "cr5",
      "text": "Defendant No. 1 in possession throughout; no act acknowledging father's title.",
      "addresses_issue": "i2",
      "key_observation": "Adverse possession completes; plaintiff suit barred."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "After Siddalingana's death, Nagana co-owner but dispossessed adversely by son from 1926 via lease etc.; 1935 mortgage did not interrupt.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Defendant No. 1 acquired title by adverse possession; plaintiff not entitled.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133"
      ],
      "relevance": "Certificate for appeal to Supreme Court"
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Sections 109",
        "110"
      ],
      "relevance": "For certificate of appeal"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment and decree of High Court set aside; judgment and decree of District Judge restored; plaintiff's suit dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "In law the possession of the lessee is the possession of the lessor and consequently ever since 1926 when Paramma began to possess the property as a lessee in terms of the lease deed, her possession in law was the possession of the infant alone to the exclusion of Nagana, the father.",
      "speaker": "court",
      "significance": "Explains start of adverse possession via lease."
    },
    {
      "text": "There can be in law, under certain circumstances, adverse possession with the consent of the true owner.",
      "speaker": "court",
      "significance": "Key principle applied to father's consent."
    },
    {
      "text": "Once it is held that the possession of a co-sharer has become adverse to the other co-sharer as a result of ouster, the mere assertion of his joint title by the dispossessed co-sharer would not interrupt the running of adverse possession.",
      "speaker": "court",
      "significance": "Why 1935 mortgage ineffective."
    }
  ],
  "_case_id": "1954_29",
  "_label": 1,
  "_text_length": 17641,
  "_extracted_at": "2026-02-08T22:14:02.793604"
}