{
  "metadata": {
    "case_name": "Appellants v. Respondents",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Ayyar J."
    ],
    "case_number": "Civil Appeal No. 14 of 1953",
    "date_of_judgment": "1954-04-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants instituted suit in Court of Subordinate Judge, Monghyr, Title Suit No. 34 of 1944, for recovery of possession of 12 acres 51 cents of land in mauza Bardih, of which defendants Nos. 12 and 13 (second party) are proprietors.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "On 12th April 1943, plaintiffs were admitted by second party as occupancy tenants on payment of Rs. 1,950 as salami and put into possession of the lands.",
      "type": "material",
      "date": "1943-04-12",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Thereafter, first party consisting of defendants Nos. 1 to 11 trespassed on the lands and carried away the crops.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Suit valued at Rs. 2,950, made up of Rs. 1,950 for possession and Rs. 1,000 for past mesne profits.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Defendants Nos. 1 to 11 contested suit, pleaded possession as tenants on batai system from fasli 1336, acquired occupancy rights; second party had no right to settle with plaintiffs; settlement dated 12th April 1943 conferred no rights.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Defendants Nos. 12 and 13 remained ex-parte.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Subordinate Judge relied on receipts Exhibits A to A-114 (handwriting of patwaris of second party, fasli 1336 to 1347), held defendants 1-11 in possession over 12 years as cultivating tenants, acquired occupancy rights; settlement conferred no rights; dismissed suit on 27th November 1945.",
      "type": "admitted",
      "date": "1945-11-27",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Plaintiffs appealed to 1st Additional District Judge, Monghyr (S.J. Title Appeal No. I of 1946), who agreed receipts genuine, occupancy rights acquired, dismissed appeal on 24th May 1946.",
      "type": "procedural",
      "date": "1946-05-24",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Plaintiffs filed second appeal to High Court Patna, S.A. No. 1152 of 1946.",
      "type": "procedural",
      "date": "1946",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "In High Court, Stamp Reporter objected to valuation; after enquiry, court determined correct valuation Rs. 9,980; plaintiffs paid additional court-fees.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Plaintiffs contended on revised valuation, appeal from Subordinate Judge lay to High Court not District Court; S.A. 1152/1946 should be heard as first appeal.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "High Court (Sinha and Rai JJ.) followed Ramdeo Singh v. Raj Narain, held appeal to District Court competent, decision reversed only if prejudice on merits shown; no prejudice, dismissed second appeal on 19th July 1950.",
      "type": "procedural",
      "date": "1950-07-19",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Supreme Court granted special leave on 29th October 1951.",
      "type": "procedural",
      "date": "1951-10-29",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Construction of section 11 of the Suits Valuation Act: effect where court entertains suit or appeal without jurisdiction due to over-valuation or under-valuation.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether decree passed by court lacking jurisdiction due to under-valuation is a nullity, or governed by section 11 Suits Valuation Act.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "What constitutes 'prejudice' under section 11 Suits Valuation Act, particularly whether mere change of forum or error in findings of fact amounts to prejudice.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "On true valuation (Rs. 9,980), District Court had no jurisdiction to entertain appeal from Subordinate Judge; its decree nullity; High Court should hear S.A. 1152/1946 as first appeal on facts and law.",
      "supporting_facts": [
        "f4",
        "f10"
      ],
      "legal_basis": "General principles on jurisdiction; Rajlakshmi Dasee v. Katyayani Dasee; Shidappa Venkatrao v. Rachappa Subrao"
    },
    {
      "id": "pa2",
      "text": "Alternatively, under section 11 Suits Valuation Act, prejudice suffered as appeal heard by inferior court (District Court) instead of High Court.",
      "supporting_facts": [
        "f8",
        "f11"
      ],
      "legal_basis": "Section 11 Suits Valuation Act"
    },
    {
      "id": "pa3",
      "text": "To ascertain prejudice, second appeal court must hear fully on facts as first appeal, per Ramdeo Singh v. Raj Narain.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Section 11 Suits Valuation Act; Section 103 CPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Receipts A to A-114 genuine; in possession from fasli 1336 as tenants, acquired occupancy rights; no right in second party to settle.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Fundamental principle: decree by court without jurisdiction is nullity, but section 11 Suits Valuation Act alters this for over/under-valuation; such objections dealt with only under s.11, not as nullity.",
      "addresses_issue": "i2",
      "key_observation": "Section 11 protects decrees on merits from jurisdictional challenge due to valuation error unless prejudice on merits."
    },
    {
      "id": "cr2",
      "text": "Cited cases like Rajlakshmi and Shidappa do not support nullity; objections highly technical, not to be entertained if not raised earlier.",
      "addresses_issue": "i2",
      "key_observation": "District Court decree not nullity."
    },
    {
      "id": "cr3",
      "text": "Prejudice under s.11 not mere change of forum; undervaluation enlarged appellants' appeal rights (two appeals instead of one); change in forum alone not prejudice.",
      "addresses_issue": "i3",
      "key_observation": "Full Bench decisions correct: mere change of forum not prejudice."
    },
    {
      "id": "cr4",
      "text": "Prejudice not error in findings of fact; second appeal court cannot re-examine facts under s.11; must be directly attributable to valuation error.",
      "addresses_issue": "i3",
      "key_observation": "No power under s.11 or CPC s.103 to reverse factual findings."
    },
    {
      "id": "cr5",
      "text": "Prejudice is equitable jurisdiction for failure of justice due to erroneous assumption of jurisdiction; here, no prejudice: appellants chose valuation, no objection by parties earlier, full hearing on merits, no injustice.",
      "addresses_issue": "i3",
      "key_observation": "Appellants cannot complain of prejudice from their own valuation choice."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Decree by court lacking jurisdiction solely due to over/under-valuation not nullity but governed by s.11 Suits Valuation Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Mere change of forum due to under-valuation not prejudice under s.11.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Errors in factual findings not prejudice under s.11; second appeal court cannot re-hear on facts.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "No prejudice to appellants; High Court correctly dismissed second appeal.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ramdeo Singh v. Raj Narain",
      "citation": "I.L.R. 27 Patna 109; A.I.R. 1949 Patna 278",
      "treatment": "followed",
      "relevance": "Appeal to District Court competent despite valuation error; reverse only on prejudice on merits."
    },
    {
      "case_name": "Rajlakshmi Dasee v. Katyayani Dasee",
      "citation": "I.L.R. 38 Cal. 639",
      "treatment": "distinguished",
      "relevance": "Nullity in collateral proceeding by stranger; s.11 not considered."
    },
    {
      "case_name": "Shidappa Venkatrao v. Rachappa Subrao",
      "citation": "I.L.R. 36 Bom. 628",
      "treatment": "distinguished",
      "relevance": "No over/under-valuation issue; affirmed by Privy Council that technical objections not to be assisted."
    },
    {
      "case_name": "Rachappa Subrao Jadhav v. Shidappa Venkatrao Jadhav",
      "citation": "46 I.A. 24",
      "treatment": "followed",
      "relevance": "Court Fees Act not weapon of technicality; objection misconceived if not raised early."
    },
    {
      "case_name": "Kelu Achan v. Cheriya Parvathi Nethiar",
      "citation": "I.L.R. 46 Mad. 631",
      "treatment": "followed",
      "relevance": "Mere change of forum not prejudice under s.11."
    },
    {
      "case_name": "Mool Chand v. Ram Kishan",
      "citation": "I.L.R. 55 All. 315",
      "treatment": "followed",
      "relevance": "Mere change of forum not prejudice under s.11."
    }
  ],
  "statutes_cited": [
    {
      "name": "Suits Valuation Act",
      "sections": [
        "Section 11"
      ],
      "relevance": "Governs objections to jurisdiction due to over/under-valuation; decree not nullity unless prejudice on merits."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 100",
        "Section 99",
        "Section 103",
        "Section 578",
        "Section 21"
      ],
      "relevance": "S.99 excepts jurisdiction defects but s.11 cures for valuation; s.100 limits second appeal; s.21 analogous for territorial jurisdiction; no power to re-examine facts."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, holding that the District Court's decree was not a nullity under section 11 of the Suits Valuation Act, no prejudice resulted from under-valuation or change of forum, and the High Court correctly dismissed the second appeal without re-examining merits.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is a fundamental principle well established that a decree passed by a Court without jurisdiction is a nullity...",
      "speaker": "court",
      "significance": "States general rule before applying s.11 exception."
    },
    {
      "text": "The policy of the Legislature has been to treat objections to jurisdiction both territorial and pecuniary as technical and not open to consideration by an appellate Court, unless there has been a prejudice on the merits.",
      "speaker": "court",
      "significance": "Explains legislative intent behind s.11 and analogy to CPC s.21."
    },
    {
      "text": "The prejudice contemplated by the section is something different from the fact of the appeal having been heard in a forum which would not have been competent to hear it on a correct valuation.",
      "speaker": "court",
      "significance": "Defines scope of 'prejudice' under s.11."
    },
    {
      "text": "Courts cannot recognise that as prejudice which flows from the action of the very party who complains about it.",
      "speaker": "court",
      "significance": "Appellants estopped from complaining of own valuation error."
    }
  ],
  "_case_id": "1954_152",
  "_label": 0,
  "_text_length": 29348,
  "_extracted_at": "2026-02-08T22:15:12.212394"
}