{
  "metadata": {
    "case_name": "Petitioner (Resident of Akola) v. Respondents (Central Government and Investigation Commission)",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Mehr Chand Mahajan C.J."
    ],
    "case_number": "Original Jurisdiction Petition No. 315 of 1954",
    "date_of_judgment": "1954-10-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner is a resident of Akola in the State of Madhya Pradesh and carries on business in oil mills, banking, money lending, etc.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "During the war years, petitioner made huge profits but evaded payment of tax.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1948, Central Government under section 5(1) of the Taxation on Income (Investigation Commission) Act, 1947 referred petitioner's case to the Investigation Commission for investigation of profits from 1st January 1939 to 31st December 1947.",
      "type": "procedural",
      "date": "1948",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Commission reported on 28th February 1951 that concealed income was Rs. 27,25,363 and tax payable was Rs. 18,44,949.",
      "type": "material",
      "date": "1951-02-28",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "During pendency of investigation, petitioner applied for settlement under section 8A of Act XXX of 1947.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Settlement proposal: Pay Rs. 18,44,949 in instalments - Rs. 3,44,949 by 25-6-1951, Rs. 5,00,000 by 25-3-1952, Rs. 5,00,000 by 25-3-1953, Rs. 5,00,000 by 25-3-1954; credit for Rs. 32,034-4-6 already paid.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Central Government accepted the proposal; claim settled by mutual agreement.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Petitioner requested and was granted extensions for instalments.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "From 16th July 1951 to 10th April 1954, petitioner paid total Rs. 14,00,000 towards liability.",
      "type": "material",
      "date": "1951-07-16 to 1954-04-10",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Rs. 4,50,000 remains due, payable in instalments up to 25th March 1955.",
      "type": "material",
      "date": "1955-03-25",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Settlement term: Petitioner undertook not to transfer, mortgage, charge, alienate or encumber movable or immovable properties (except stock-in-trade) without permission of Commissioner of Income-tax, except for payment of tax.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "In June 1954, after Suraj Mal Mohta v. A. V. Visvanatha Sastri decision, petitioner filed petition under Article 32 alleging proceedings illegal, ultra vires, void; paid Rs. 13,99,175.",
      "type": "procedural",
      "date": "1954-06",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether sections 5, 6, 7 and 8 of Act XXX of 1947 are invalid and ultra vires as contravening Articles 14, 19(1)(f) and 31 of the Constitution, lacking reasonable classification, allowing executive to pick and choose taxpayers, and prescribing prejudicial procedure compared to section 34 of Indian Income-tax Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether petitioner can seek relief under Article 32 against liability based on voluntary settlement, or if settlement was improperly procured under pressure of the Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Entire proceedings under the Act resulted in illegal liability of Rs. 18,44,949 and payments made; Income-tax authorities not entitled to recover Rs. 4,50,000.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Articles 14, 19(1)(f), 31; sections 5,6,7,8 of Act XXX 1947 ultra vires"
    },
    {
      "id": "pa2",
      "text": "No reasonable or equitable basis for classification; Act gives executive unrestrained right to pick and choose; procedure more prejudicial than under section 34 of Income-tax Act.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Suraj Mal Mohta v. A. V. Visvanatha Sastri, AIR 1954 SC 545"
    },
    {
      "id": "pa3",
      "text": "Settlement application made under pressure of coercive machinery of Act XXX of 1947, hence not binding.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Petition wholly misconceived; tax paid or recoverable based on settlement proposed by petitioner and accepted by Central Government; no assessment under Income-tax Act procedure due to settlement request.",
      "addresses_issue": "i2",
      "key_observation": "Unless petitioner establishes settlement improperly procured and not binding, cannot claim fundamental rights contravened under Article 32."
    },
    {
      "id": "cr2",
      "text": "Article 32 not intended for relief against voluntary actions of a person; remedy for improper procurement lies elsewhere.",
      "addresses_issue": "i2",
      "key_observation": "Allegation of settlement under pressure cannot be raised under Article 32."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Petition under Article 32 not maintainable against voluntary settlement; forum for challenging settlement as improperly procured is elsewhere.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Suraj Mal Mohta v. A. V. Visvanatha Sastri and Another",
      "citation": "AIR 1954 SC 545",
      "treatment": "referred",
      "relevance": "Decision prompted petitioner to file petition alleging proceedings illegal"
    }
  ],
  "statutes_cited": [
    {
      "name": "Taxation on Income (Investigation Commission) Act, 1947 (Act XXX of 1947)",
      "sections": [
        "5(1)",
        "5",
        "6",
        "7",
        "8",
        "8A"
      ],
      "relevance": "Basis for reference, investigation, report, settlement; challenged as ultra vires"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 14",
        "Article 19(1)(f)",
        "Article 31"
      ],
      "relevance": "Basis for petition enforcing fundamental rights; Article 32 not for voluntary actions"
    },
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "34"
      ],
      "relevance": "Compared to procedure under Investigation Act as less prejudicial"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The petition under Article 32 is wholly misconceived as the liability arises from a voluntary settlement proposed by the petitioner and accepted by the Central Government; Article 32 provides no relief against voluntary actions, and challenges to the settlement's validity must be pursued elsewhere.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "In our judgment this petition is wholly misconceived.",
      "speaker": "court",
      "significance": "Directly states basis for dismissal"
    },
    {
      "text": "Article 32 of the Constitution is not intended for relief against the voluntary actions of a person.",
      "speaker": "court",
      "significance": "Core holding limiting Article 32's scope"
    },
    {
      "text": "Whatever be the merits of such a contention, it obviously cannot be raised in an application made under the provisions of article 32 of the Constitution.",
      "speaker": "court",
      "significance": "Rejects challenge to settlement under Article 32"
    }
  ],
  "_case_id": "1954_176",
  "_label": 0,
  "_text_length": 6186,
  "_extracted_at": "2026-02-10T19:18:45.185550"
}