{
  "metadata": {
    "case_name": "Harishankar Bagla and Smt. Gomti Bagla v. State of Madhya Pradesh",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Mehar Chand Mahajan C.J."
    ],
    "case_number": "Criminal Appeal No. 7 of 1953",
    "date_of_judgment": "1954-05-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant, Harishankar Bagla, and his wife, Smt. Gomti Bagla, were arrested at Itarsi, by the Railway Police on the 29th November, 1948, for contravention of section 7 of the Essential Supplies (Temporary Powers) Act, 1946, read with clause 3 of the Cotton Textiles (Control of Movement) Order, 1948, having been found in possession of new cotton cloth weighing over six maunds which cloth, it was alleged, was being taken by them from Bombay to Kanpur without any permit.",
      "type": "material",
      "date": "1948-11-29",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "After various vicissitudes through which the chalan passed the case was eventually withdrawn by the High Court to itself on the 3rd of September, 1951, as it involved a decision of constitutional issues.",
      "type": "procedural",
      "date": "1951-09-03",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "By its order dated the 15th September, 1952, the High Court upheld the provisions of sections 3 and 4 of the Essential Supplies (Temporary Powers) Act, 1946, as constitutional. It also upheld the constitutionality of the impugned Order. Section 6 of the Act was held to be inconsistent with the provisions of the Railway Act but it was held that its unconstitutionality did not affect the prosecution in this case. The High Court directed that the prosecution should proceed and the records sent back to the trial Court for being dealt with in accordance with law.",
      "type": "procedural",
      "date": "1952-09-15",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Leave to appeal was given both to the appellants and the respondent and requisite certificates under articles 132 and 134 of the Constitution were granted.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "The appellants never applied for a permit and made no efforts to obtain one.",
      "type": "admitted",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether sections 3 and 4 of the Essential Supplies (Temporary Powers) Act, 1946, and the provisions of the Cotton Textiles (Control of Movement) Order, 1948 contravened the fundamental right of the appellants guaranteed by article 19(1)(f) and (g) of the Constitution",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether section 3 of the Essential Supplies (Temporary Powers) Act, 1946, and in particular section 4 were ultra vires the Legislature on the ground of excessive delegation of legislative power",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether section 6 having been found ultra vires, section 3 was inextricably connected with it and that both the sections should have been declared ultra vires on that ground",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the impugned Control Order contravened existing laws, viz., the provisions of section 27, 28 and 41 of the Indian Railways Act, and was thus void in its entirety",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether section 6 of the Essential Supplies (Temporary Powers) Act, 1946 was unconstitutional",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sections 3 and 4 of the Essential Supplies (Temporary Powers) Act, 1946, and the provisions of the Cotton Cloth Control Order contravened the fundamental right of the appellants guaranteed by article 19(1)(f) and (g) of the Constitution",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Article 19(1)(f) and (g)"
    },
    {
      "id": "pa2",
      "text": "Section 3 of the Essential Supplies (Temporary Powers) Act, 1946, and in particular section 4 were ultra vires, the Legislature on the ground of excessive delegation of legislative power",
      "supporting_facts": [],
      "legal_basis": "Excessive delegation"
    },
    {
      "id": "pa3",
      "text": "Section 6 having been found ultra vires, section 3 was inextricably connected with it and that both the sections should have been declared ultra vires on that ground",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Interconnection of sections 3 and 6"
    },
    {
      "id": "pa4",
      "text": "The impugned Control Order contravened existing laws, viz., the provisions of section 27,28 and 41 of the Indian Railways Act, and was thus void in its entirety",
      "supporting_facts": [],
      "legal_basis": "Sections 27, 28, 41 of Indian Railways Act"
    },
    {
      "id": "pa5",
      "text": "The Textile Commissioner had been given unregulated and arbitrary discretion to refuse or to grant a permit",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Dwarka Prasad v. The State of Uttar Pradesh"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Challenged the judgment of the High Court that section 6 of the Act was unconstitutional",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 6 of Essential Supplies (Temporary Powers) Act, 1946"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The requirement of a permit to transport by rail cotton textiles to a certain extent operates as a restriction on the rights of a person who is engaged in the business of purchase and sale of cotton textiles. Clause (5) of article 19 however permits such restrictions to be placed provided they are in the public interest. During the period of emergency it was necessary to impose control on the production, supply and distribution of commodities essential to the life of the community.",
      "addresses_issue": "i1",
      "key_observation": "The requirement of a permit in this regard cannot be regarded as an unreasonable restriction on the citizens right under sub-clauses (f) and (g) of article 19(1)"
    },
    {
      "id": "cr2",
      "text": "The appellants never applied for a permit and made no efforts to obtain one. If the permit had been applied for and refused arbitrarily they might then have had a right to attack the law on the ground that it vested arbitrary and unregulated power in the textile commissioner.",
      "addresses_issue": "i1",
      "key_observation": "The grant or refusal of a permit is thus to be governed by this policy and the discretion given to the Textile Commissioner is to be exercised in such a way as to effectuate this policy."
    },
    {
      "id": "cr3",
      "text": "The legislature has laid down such a principle and that principle is the maintenance or increase in supply of essential commodities and of securing equitable distribution and availability at fair prices. The principle is clear and offers sufficient guidance to the Central Government in exercising its powers under section 3.",
      "addresses_issue": "i2",
      "key_observation": "Delegation of the kind mentioned in section 3 was upheld before the Constitution in a number of decisions"
    },
    {
      "id": "cr4",
      "text": "Section 4 enumerates the classes of persons to whom the power could be delegated or sub-delegated by the Central Government and it is not correct to say that the instrumentalities have not been selected by the Legislature itself.",
      "addresses_issue": "i2",
      "key_observation": "Section 4 of the Act was attacked on the ground that it empowers the Central Government to delegate its own power to make orders under section 3 to any officer or authority subordinate to it"
    },
    {
      "id": "cr5",
      "text": "The requirement of a permit by clause 3 and provisions of clause 4 of the Order which empower the Textile Commissioner to direct a carrier to close the booking or transport of cloth, apparel, etc., are not in direct conflict with sections 27, 28 and 41 of the Railways Act.",
      "addresses_issue": "i4",
      "key_observation": "This clause merely supplements the relevant provisions of the Railways Act and does not supersede them."
    },
    {
      "id": "cr6",
      "text": "Section 6 does not either expressly or by implication repeal any of the provisions of pre-existing laws neither does it abrogate them. Those laws remain untouched and unaffected so far as the statute book is concerned.",
      "addresses_issue": "i3",
      "key_observation": "The abrogation or the implied repeal is by force of the legislative declaration contained in section 6 and is not by force of the order made by the delegate under section 3."
    },
    {
      "id": "cr7",
      "text": "The High Court was in error in declaring section 6 of the Act unconstitutional.",
      "addresses_issue": "i5",
      "key_observation": "There is no delegation involved in the provisions of section 6 at all and that section could not be held to be unconstitutional on that ground."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sections 3 and 4 of the Essential Supplies (Temporary Powers) Act, 1946, and the Cotton Textiles (Control of Movement) Order, 1948 do not contravene Article 19(1)(f) and (g)",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Sections 3 and 4 of the Essential Supplies (Temporary Powers) Act, 1946 do not involve excessive delegation of legislative power",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Section 6 is constitutional and its validity does not affect section 3",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "The Control Order does not contravene sections 27, 28 and 41 of the Indian Railways Act",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "Section 6 of the Essential Supplies (Temporary Powers) Act, 1946 is constitutional",
      "resolves_issue": "i5",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dwarka Prasad v. The State of Uttar Pradesh",
      "citation": "A.I.R. 1954 S.C. 224",
      "treatment": "distinguished",
      "relevance": "Distinguished on grounds that appellants never applied for permit and no arbitrary discretion as policy is laid down"
    },
    {
      "case_name": "In Re Delhi Laws Act",
      "citation": "1951 S.C.R. 747",
      "treatment": "followed",
      "relevance": "Essential powers of legislation cannot be delegated; policy must be laid down"
    },
    {
      "case_name": "Russell v. The Queen",
      "citation": "7 A.C. 829",
      "treatment": "followed",
      "relevance": "Delegation upheld"
    },
    {
      "case_name": "Hodge v. The Queen",
      "citation": "9 A.C. 117",
      "treatment": "followed",
      "relevance": "Delegation upheld"
    },
    {
      "case_name": "Shannon v. Lower Mainland Dairy Products Board",
      "citation": "1938 A.C. 708",
      "treatment": "followed",
      "relevance": "Power of further delegation upheld; Provincial Legislature supreme within sphere"
    },
    {
      "case_name": "Panama Refining Co. v. Ryan",
      "citation": "293 US 388",
      "treatment": "distinguished",
      "relevance": "No unconstitutional delegation if policy laid down"
    },
    {
      "case_name": "Schechter v. United States",
      "citation": "295 U.S. 495",
      "treatment": "distinguished",
      "relevance": "No unconstitutional delegation if policy laid down"
    }
  ],
  "statutes_cited": [
    {
      "name": "Essential Supplies (Temporary Powers) Act, 1946",
      "sections": [
        "Section 2",
        "Section 3",
        "Section 4",
        "Section 6",
        "Section 7"
      ],
      "relevance": "Central legislation for controlling essential commodities; sections upheld as constitutional"
    },
    {
      "name": "Cotton Textiles (Control of Movement) Order, 1948",
      "sections": [
        "Clause 2",
        "Clause 3",
        "Clause 4",
        "Clause 5",
        "Clause 8"
      ],
      "relevance": "Order issued under section 3; upheld as constitutional and not conflicting with Railways Act"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 19(1)(f)",
        "Article 19(1)(g)",
        "Article 19(5)",
        "Article 132",
        "Article 134"
      ],
      "relevance": "Fundamental rights to trade and profession; reasonable restrictions permitted"
    },
    {
      "name": "Indian Railways Act",
      "sections": [
        "Section 27",
        "Section 28",
        "Section 41"
      ],
      "relevance": "Control Order supplements, does not conflict with or repeal these provisions"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appellants' challenge, upholding the constitutionality of sections 3, 4 and 6 of the Essential Supplies (Temporary Powers) Act, 1946, and the Cotton Textiles (Control of Movement) Order, 1948. It reversed the High Court's finding on section 6's unconstitutionality, allowing the prosecution to proceed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The requirement of a permit in this regard cannot be regarded as an unreasonable restriction on the citizens right under sub-clauses (f) and (g) of article 19(1).",
      "speaker": "court",
      "significance": "Core holding on Article 19 challenge"
    },
    {
      "text": "The legislature has laid down such a principle and that principle is the maintenance or increase in supply of essential commodities and of securing equitable distribution and availability at fair prices.",
      "speaker": "court",
      "significance": "Defines legislative policy for delegation"
    },
    {
      "text": "Section 6 does not either expressly or by implication repeal any of the provisions of pre-existing laws neither does it abrogate them.",
      "speaker": "court",
      "significance": "Rejects High Court's view on section 6"
    },
    {
      "text": "The result therefore is that in our opinion the provisions of sections 3, 4 and 6 of the Essential Supplies (Temporary Powers) Act, 1946, are constitutional and the impugned order is also constitutional.",
      "speaker": "court",
      "significance": "Final determination on constitutionality"
    }
  ],
  "_case_id": "1954_36",
  "_label": 0,
  "_text_length": 22819,
  "_extracted_at": "2026-02-10T19:17:25.750628"
}