{
  "metadata": {
    "case_name": "Achhru Ram v. Respondent No. 1",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Mukerjea, J."
    ],
    "case_number": "Civil Appeal No. 15 of 1951",
    "date_of_judgment": "1954-04-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plaintiff owns premises Nos. D 37/85 and D 37/44 within Mohalla Baradeo, Banaras, adjoining suit property on northern and eastern sides.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Suit property (Municipal No. D 37/48, enclosed plot with structures in Mohalla Baradeo, Banaras) belonged to defendants Nos. 2 to 5, residents of Calcutta, sold by conveyance on 29th March 1941, registered 3rd April 1941, to defendant No. 1, resident of Calcutta, for Rs. 7,000.",
      "type": "admitted",
      "date": "1941-03-29",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Plaintiff is landlord of suit property; vendors (defendants 2-5) were his tenants.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Plaintiff made immediate assertion/demand of pre-emption rights upon news of sale, repeated in presence of witnesses as per Muhammadan Law, sent registered notice to defendant No. 1 on 21st May 1941 demanding transfer on payment of price paid.",
      "type": "disputed",
      "date": "1941-05-21",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Suit filed by plaintiff in Court of Civil Judge at Banaras, Original Suit No. 79 of 1941, for enforcement of pre-emption right based on custom of vicinage in Banaras.",
      "type": "procedural",
      "date": "1941",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Civil Judge held custom of pre-emption exists in Banaras with incidents same as Muhammadan Law, but not enforceable against non-natives/domiciled; demands not properly made; suit dismissed on 19th November 1941.",
      "type": "procedural",
      "date": "1941-11-19",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Plaintiff appealed to High Court of Allahabad, First Appeal No. 157 of 1942; Division Bench (Mulla and Yorke JJ.) affirmed trial court on 29th August 1944, holding custom requires vendor/vendee to be natives/domiciled; other issues undecided.",
      "type": "procedural",
      "date": "1944-08-29",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court refused leave to appeal to Judicial Committee; special leave granted by Judicial Committee on 11th December 1945; appeal transferred to Supreme Court post-abolition.",
      "type": "procedural",
      "date": "1945-12-11",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether custom of pre-emption in city of Banaras is limited to natives/domiciled persons or applies to all owners of property therein regardless of residence/domicile.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether plaintiff made requisite demands in proper manner as required by Muhammadan Law.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether plaintiff, as landlord, can enforce pre-emption against his own tenants under the custom.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Nature of right of pre-emption under Muhammadan Law and custom: whether personal right of re-purchase or incident attaching to the property.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Custom of pre-emption prevalent in entire city of Banaras admits no restriction to natives/domiciled; applies to all who own property in city, immaterial if non-residents.",
      "supporting_facts": [
        "f1",
        "f2",
        "f5"
      ],
      "legal_basis": "Custom proved by judgments; Muhammadan Law incidents apply unless proved otherwise"
    },
    {
      "id": "pa2",
      "text": "Right of pre-emption is incident annexed to lands, not mere personal right of re-purchase.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Muhammadan Law authorities; Govinda Dayal v. Inayatulla"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Custom of pre-emption obtains exclusively amongst inhabitants/natives/domiciled in Banaras; not available against outsiders even if owning property there.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Byjnath Pershad v. Kapilmon Singh; Roland Wilson, Mulla, Tyabji texts"
    },
    {
      "id": "ra2",
      "text": "No proper demands made as per Muhammadan Law.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Muhammadan Law"
    },
    {
      "id": "ra3",
      "text": "Landlord cannot eject own tenants via pre-emption.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Custom/law"
    },
    {
      "id": "ra4",
      "text": "Right is personal, not incident of property.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Sheikh Kudratulla v. Mahini Mohan (Calcutta FB)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Right of pre-emption under Muhammadan Law is not personal right of re-purchase but incident attaching to property itself, imposing limitation on owner's right to sell to stranger; benefit/burden runs with land.",
      "addresses_issue": "i4",
      "key_observation": "Sale is condition precedent to enforceability, not existence; avoids inconvenience of stranger."
    },
    {
      "id": "cr2",
      "text": "Custom in Banaras established, co-extensive with Muhammadan Law unless contrary proved; no evidence custom limited to natives/domiciled or house properties only (extends to building sites/small vacant lands).",
      "addresses_issue": "i1",
      "key_observation": "Custom becomes lex loci, affects all lands in locality irrespective of owners' religion/nationality/domicile unless proved part of custom."
    },
    {
      "id": "cr3",
      "text": "Lower courts erred relying on texts assuming personal nature; decisions like Byjnath based on wrong view of right's nature.",
      "addresses_issue": "i1",
      "key_observation": "Precedents like Govinda Dayal v. Inayatulla (Allahabad FB) preferred over Calcutta FB."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Local custom of pre-emption exists in city of Banaras attaching to house properties/building sites/small vacant lands; not limited to natives/domiciled owners.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Right of pre-emption under Muhammadan Law/custom is incident of property, enforceable against any owner for time being.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Digambar Singh v. Ahmad",
      "citation": "42 I.A. 10",
      "treatment": "followed",
      "relevance": "Custom of pre-emption may follow or vary from Muhammadan Law; village customs."
    },
    {
      "case_name": "Jadulal v. Janki Koer",
      "citation": "39 I.A. 101",
      "treatment": "followed",
      "relevance": "Custom among non-Muslims presumed co-extensive with Muhammadan Law unless contrary shown; preliminary forms required."
    },
    {
      "case_name": "Govinda Dayal v. Inayatulla",
      "citation": "7 All. 775",
      "treatment": "followed",
      "relevance": "Right of pre-emption inherent in property, right of substitution; like easement/legal servitude."
    },
    {
      "case_name": "Sheikh Kudratulla v. Mahini Mohan",
      "citation": "Beng. L.R. Full Bench Rulings page 134",
      "treatment": "distinguished",
      "relevance": "Held right mere re-purchase; based on mistranslation of 'Tajibo'."
    },
    {
      "case_name": "Byjnath Pershad v. Kapilmon Singh",
      "citation": "24 W.R. 95",
      "treatment": "overruled",
      "relevance": "Custom does not bind non-native vendor; proceeded on wrong assumption of personal right."
    },
    {
      "case_name": "Chakauri Devi v. Sundari Devi",
      "citation": "28 All. 590",
      "treatment": "referred",
      "relevance": "Affirmed custom in Banaras."
    },
    {
      "case_name": "Ram Chandra v. Goswami Ram Puri",
      "citation": "45 All. 501",
      "treatment": "referred",
      "relevance": "Affirmed custom in Banaras; confined to house properties."
    },
    {
      "case_name": "Gouri Sankar v. Sitaram",
      "citation": "54 All. 76",
      "treatment": "referred",
      "relevance": "Modified to include building sites/small vacant lands."
    }
  ],
  "statutes_cited": [
    {
      "name": "Muhammadan Law",
      "sections": [
        "Pre-emption rules, demands, vicinage"
      ],
      "relevance": "Incidents apply to custom unless varied; right attaches to property."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal allowed; judgments of lower courts set aside; case remanded to High Court for decision on whether demands complied with Muhammadan Law and whether landlord can pre-empt own tenants.",
    "relief_granted": "Remand for further consideration of undecided issues",
    "costs": "Appellant to have costs of this appeal from respondent No. 1"
  },
  "key_quotes": [
    {
      "text": "The crux of the whole thing is that the benefit as well as the burden of the right of pre-emption run with the land and can be enforced by or against the owner of the land for the time being although the right of the pre-emptor does not amount to an interest in the land itself.",
      "speaker": "court",
      "significance": "Defines nature of pre-emption right as incident of property."
    },
    {
      "text": "When a right of pre-emption rests upon custom it becomes the lex loci or the law of the place and affects all lands situated in that place irrespective of the religion or nationality or domicile of the owners of the lands except where such incidents are proved to be a part of the custom itself.",
      "speaker": "court",
      "significance": "Holds custom applies universally to property owners in locality."
    }
  ],
  "_case_id": "1954_95",
  "_label": 1,
  "_text_length": 33225,
  "_extracted_at": "2026-02-08T22:14:38.152760"
}