{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI J."
    ],
    "case_number": "Civil Appeal No. 61 of 1953",
    "date_of_judgment": "1954-12-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant entered into three contracts with respondent: two dated 8th August 1949 for 1,80,000 bags each at Rs. 134/4/- and Rs. 135/4/- per 100 bags, and third dated 17th August 1949 for 90,000 bags at Rs. 138/- per 100 bags, for October, November and December 1949 deliveries in equal monthly instalments on terms of Indian Jute Mills Association (IJMA) contract forms.",
      "type": "material",
      "date": "1949-08-08",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In September 1949, respondent expressed inability to deliver goods under original contracts and requested appellant to settle by selling back the goods at Rs. 161-8-0 per 100 bags.",
      "type": "material",
      "date": "1949-09",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Three settlement contracts entered into on 28th September 1949 whereby appellant agreed to sell goods under original contracts to respondent at Rs. 161-8-0 per 100 bags on IJMA terms.",
      "type": "material",
      "date": "1949-09-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant submitted bills aggregating Rs. 1,15,650 under settlement contracts, which respondent accepted but failed to pay despite demands.",
      "type": "material",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant filed suit No. 3614 of 1950 in High Court of Calcutta (Original Side) for recovery of Rs. 1,25,962-2-0 with interest and costs.",
      "type": "procedural",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondent's written statement contested claim, alleging settlement contracts illegal and void under West Bengal Jute Goods Future Ordinance, 1949; respondent did not deal in sale/purchase involving actual delivery, had no godown or storage means.",
      "type": "disputed",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Trial Court (High Court decree dated 25th May 1951) negatived respondent's contentions and decreed appellant's claim.",
      "type": "procedural",
      "date": "1951-05-25",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court Appeal from Original Decree No. 124 of 1951: Appeal Court held settlement contracts void as forward contracts by non-habitual dealer in actual delivery; only right was settlement at last closing rate Rs. 146/14/- per 100 bags; dismissed suit with costs (judgment 16th May 1952).",
      "type": "procedural",
      "date": "1952-05-16",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "West Bengal Jute Goods Future Ordinance, 1949 came into force on 22nd September 1949.",
      "type": "background",
      "date": "1949-09-22",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Notification No. 4665 Com. dated 23rd September 1949 prohibited jute goods futures contracts from date of publication; Notification No. 4666 Com. recognised certain markets; published in Calcutta Gazette on 23rd September 1949.",
      "type": "background",
      "date": "1949-09-23",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "IJMA contract terms: Buyers give 7 clear working days notice; payment in cash for Delivery Orders, Railway Receipts, Docks Receipts or Mates Receipts; sellers' lien subsists until payment.",
      "type": "background",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "In chain contracts: mills held goods, sold to A, A to B, B to defendant (respondent), defendant to plaintiff (appellant), plaintiff to C, C to shipper; delivery orders/mates receipts passed by endorsement against cash payment.",
      "type": "material",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Delivery orders issued by mills against cash, pass hand to hand by endorsement, represent goods, authorise endorsee to receive goods.",
      "type": "admitted",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Contracts did not provide for payment/receipt of margin.",
      "type": "admitted",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Respondent did not possess or control godown or storage equipment.",
      "type": "admitted",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the settlement contracts were 'contracts relating to jute goods futures' prohibited by the West Bengal Jute Goods Future Ordinance, 1949, as made by respondent not habitually dealing in sale/purchase of jute goods involving actual delivery of possession thereof.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the respondent habitually dealt in sale/purchase of jute goods involving actual delivery of possession, given chain contracts and use of delivery orders/mates receipts.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Meaning of 'actual delivery of possession' in section 2(1)(b)(i) of the Ordinance: whether includes constructive/symbolical delivery via documents in chain contracts resulting in ultimate physical delivery.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether the Ordinance was ultra vires.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Delivery orders/mates receipts represent goods; each successive buyer paid full price in cash to seller before endorsement, obtaining title and actual delivery of possession; ultimate delivery alongside vessel constitutes actual delivery all along chain simultaneously.",
      "supporting_facts": [
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": "IJMA contract terms; Nippon Yusen Kaisha v. Ramjiban"
    },
    {
      "id": "pa2",
      "text": "Legislature did not require dealer to personally give manual delivery; sales/purchases 'involving actual delivery' satisfied even if by third party in performance thereof.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Section 2(1)(b)(i) of Ordinance"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Settlement contracts illegal and void under Ordinance as forward contracts by respondent not habitually dealing in actual delivery; respondent never dealt in jute goods involving actual possession delivery, no godown; transactions purely speculative, mere delivery orders passed, differences paid/received, no actual delivery between intermediates.",
      "supporting_facts": [
        "f6",
        "f14",
        "f15"
      ],
      "legal_basis": "West Bengal Jute Goods Future Ordinance, 1949 ss. 2, 3"
    },
    {
      "id": "ra2",
      "text": "Only actual physical/manual delivery counts, not symbolical/constructive; no one except shipper paid full price or took delivery.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 2(1)(b)(i) of Ordinance"
    },
    {
      "id": "ra3",
      "text": "Ordinance ultra vires.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Delivery orders/mates receipts represent goods, passed hand to hand against cash payment, constituting constructive delivery; chain results in ultimate physical delivery, satisfying 'involving actual delivery of possession'; 'actual' contrasts with mere differences trading, includes symbolical/constructive delivery.",
      "addresses_issue": "i2",
      "key_observation": "Ordinary jute trade via chain contracts would be impossible if only manual delivery required for each intermediate."
    },
    {
      "id": "cr2",
      "text": "Appeal Court erred in assuming no full price payments except by shipper, and narrow construction of 'actual delivery' excluding constructive/symbolical; Trial Court correct on facts and law.",
      "addresses_issue": "i1",
      "key_observation": "Word 'involving' means resulting in actual delivery in ultimate analysis."
    },
    {
      "id": "cr3",
      "text": "Ordinance intra vires under Head 27 List II Seventh Schedule Government of India Act (trade/commerce, markets).",
      "addresses_issue": "i4",
      "key_observation": "Provincial Legislature competent."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Settlement contracts not void under Ordinance; respondent's dealings involved actual delivery of possession via chain contracts and documents representing goods.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "'Actual delivery of possession' in s.2(1)(b)(i) includes constructive/symbolical delivery via documents in chain, resulting in ultimate physical delivery.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Ordinance valid and intra vires.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Nippon Yusen Kaisha v. Ramjiban",
      "citation": "1938 L.R. 65 I.A. 263",
      "treatment": "followed",
      "relevance": "Standard IJMA form: property passes on appropriation by delivery alongside; entire Calcutta gunnies export business conducted thereunder."
    }
  ],
  "statutes_cited": [
    {
      "name": "West Bengal Jute Goods Future Ordinance, 1949",
      "sections": [
        "Section 2",
        "Section 3(1)",
        "Section 3(2)"
      ],
      "relevance": "Defined jute goods futures contracts; prohibited making thereof from 23 Sep 1949; voided contravening contracts; prior contracts settled at last closing rate in notified market."
    },
    {
      "name": "Indian Sale of Goods Act",
      "sections": [
        "Section 2(2)",
        "Section 2(4)",
        "Section 30",
        "Section 36(3)",
        "Section 53(1)"
      ],
      "relevance": "Delivery means voluntary transfer of possession (includes actual/symbolical/constructive); documents of title transfer possession of goods."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Seventh Schedule List II Head 27"
      ],
      "relevance": "Provincial Legislature competent to enact Ordinance on trade/commerce, markets."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, reversed High Court Appellate Bench decision dismissing suit, upheld Trial Court decree for appellant's claim; settlement contracts held valid and enforceable, not prohibited futures contracts.",
    "relief_granted": "Recovery of Rs. 1,15,650 plus interest and costs as per Trial Court decree.",
    "costs": "Not specified; suit decreed with costs in Trial Court, appeal to SC with certificate."
  },
  "key_quotes": [
    {
      "text": "'actual delivery of possession' can be that actual delivery as contrasted with mere dealings in differences was within the intendment of the Ordinance and such actual delivery of possession included within its scope symbolical as well as constructive delivery of possession.",
      "speaker": "court",
      "significance": "Core interpretation rejecting narrow view, upholding contracts."
    },
    {
      "text": "The word 'involving' in the context means resulting in and this condition would be satisfied if the chain contracts as entered into in the market resulted in actual delivery of possession of goods in the ultimate analysis.",
      "speaker": "court",
      "significance": "Explains why chain intermediates qualify as habitual dealers."
    },
    {
      "text": "This is a form under which the entire export business in gunnies in Calcutta is conducted.",
      "speaker": "court",
      "significance": "Cites precedent on IJMA form validity in trade."
    }
  ],
  "_case_id": "1954_71",
  "_label": 1,
  "_text_length": 22244,
  "_extracted_at": "2026-02-10T19:18:21.439372"
}