{
  "metadata": {
    "case_name": "Appellant v. State",
    "case_year": 1955,
    "court": "Supreme Court of India",
    "judges": [
      "JAGANNADHADAS J."
    ],
    "case_number": "Criminal Appeal No. 22 of 1954",
    "date_of_judgment": "1955-03-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Three persons including the appellant were, at the material time, parcel porters at the railway station Manikpur in the district Banda of Uttar Pradesh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On the night of the 18th June, 1952, they were found by two watchmen of the Watch and Ward staff attached to the railway station, committing theft of certain packets of biscuits by breaking open a railway parcel containing those packets.",
      "type": "material",
      "date": "1952-06-18",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "First information of the same was lodged, before the Sub-Inspector, Railway Police, by one Ram Prasad, Head Watchman.",
      "type": "procedural",
      "date": "1952-06-18",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Railway Police filed the charge-sheet under section 379 of the Indian Penal Code on the 20th June, 1952.",
      "type": "procedural",
      "date": "1952-06-20",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The case was taken cognizance of by the Railway Magistrate, Manikpur.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "All the three accused pleaded guilty.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "They were convicted by the Magistrate on the 15th July, 1952, and sentenced to a fine of Rs. 25 each.",
      "type": "procedural",
      "date": "1952-07-15",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Against this conviction the present appellant filed a revision to the Sessions Judge of Banda arguing that by virtue of the U. P. Panchayat Raj Act, 1947, the present case should have been tried by the Panchayati Adalat and that the Railway Magistrate had no jurisdiction.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Sessions Judge accepted this contention and made a reference to the High Court for quashing the conviction and sentence.",
      "type": "procedural",
      "date": "1953-10-27",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "It came before a Single Judge of the High Court who declined to accept the reference on the ground that the revisional jurisdiction of the High Court was discretionary, but granted a certificate for appeal to the Supreme Court.",
      "type": "procedural",
      "date": "1953-10-27",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The charge-sheet filed by the police shows that the theft of the property involved in the case is Rs. 3.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The offence has been committed within the limits of Manikpur.",
      "type": "material",
      "date": "1952-06-18",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "One out of the three accused by name Tulsi belongs to Jubbalpore in Madhya Pradesh.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Railway Magistrate had jurisdiction to try the case or whether it should have been tried by the Panchayati Adalat under the U.P. Panchayat Raj Act, 1947, given that one accused belongs to a place outside the State (Jubbalpore, Madhya Pradesh).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "By virtue of the U. P. Panchayat Raj Act, 1947, the present case should have been tried by the Panchayati Adalat and that the Railway Magistrate had no jurisdiction.",
      "supporting_facts": [
        "f2",
        "f11",
        "f12"
      ],
      "legal_basis": "U.P. Panchayat Raj Act, 1947 sections 51, 52, 55"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under sections 51 and 52 of the U.P. Panchayat Raj Act, 1947, the Panchayati Adalat of Manikpur had prima facie jurisdiction since offence under s.379 IPC with value not exceeding Rs.50, committed within its limits, and no order under s.85.",
      "addresses_issue": "i1",
      "key_observation": "The jurisdiction of the Adalat to try any criminal case has to be exercised by a bench of five Panches formed under s.49."
    },
    {
      "id": "cr2",
      "text": "In this police case, bench must consist of one Panch from Gaon Sabha where offence committed (Manikpur), one from where accused resides, and three others.",
      "addresses_issue": "i1",
      "key_observation": "Since one accused Tulsi from Jubbalpore, Madhya Pradesh (outside State), not possible to constitute bench in compliance with s.49(2)."
    },
    {
      "id": "cr3",
      "text": "Recourse to s.49(4) and rule 84 for special bench, but rule 84 insofar as it relates to constitution of special bench where one party from outside State is ultra vires s.49(4), as it does not authorize rules for persons outside the State.",
      "addresses_issue": "i1",
      "key_observation": "No competent bench could be constituted under s.49 for trial of the case with three accused including one from outside State."
    },
    {
      "id": "cr4",
      "text": "Bar under s.55 applies to the case as a whole, but only where valid machinery for trial exists; here no valid machinery, so jurisdiction of ordinary court under CrPC s.5 not excluded.",
      "addresses_issue": "i1",
      "key_observation": "Exclusion of jurisdiction of court of general jurisdiction requires clear and operative limited jurisdiction machinery."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Railway Magistrate had the jurisdiction to try the case.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Rule 84 of the rules under U.P. Panchayat Raj Act, insofar as it relates to constitution of special bench where one party belongs to place outside the State, is ultra vires.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 379"
      ],
      "relevance": "Offence of theft charged, cognizable by Panchayati Adalat if value <= Rs.50."
    },
    {
      "name": "U.P. Panchayat Raj Act, 1947",
      "sections": [
        "Section 3",
        "Section 42",
        "Section 43",
        "Section 44",
        "Section 49",
        "Section 51",
        "Section 52",
        "Section 55",
        "Section 85"
      ],
      "relevance": "Scheme for jurisdiction of Panchayati Adalats over specified offences including s.379 IPC (value <=Rs.50); bar on ordinary courts unless s.85 order; requirement for benches of five Panches."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "Section 5"
      ],
      "relevance": "Comprehensive jurisdiction of ordinary criminal courts unless validly excluded."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court held that the Railway Magistrate had jurisdiction to try the case as no competent bench could be constituted by the Panchayati Adalat due to one accused being from outside the State, rendering rule 84 ultra vires in that respect and lifting the bar under s.55. The appeal against the High Court's refusal to quash the conviction is dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We are clearly of the opinion that rule 84 in so far as it relates to the constitution of a special bench where one of the parties belongs to a place outside the State is ultra vires.",
      "speaker": "court",
      "significance": "Declares part of rule invalid, key to jurisdiction finding."
    },
    {
      "text": "Exclusion of jurisdiction of a court of general jurisdiction, can be brought about by the setting up of a court of limited jurisdiction, in respect of the limited field, only if the vesting and the exercise of that limited jurisdiction is clear and operative.",
      "speaker": "court",
      "significance": "Principle applied to uphold ordinary court's jurisdiction."
    }
  ],
  "_case_id": "1955_10",
  "_label": 0,
  "_text_length": 14532,
  "_extracted_at": "2026-02-08T22:13:21.734564"
}