{
  "metadata": {
    "case_name": "Baladin Lodhi & Ors. v. State of Uttar Pradesh",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha, J."
    ],
    "case_number": "Criminal Appeal Nos. 118 of 1954 and 119 of 1954",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Twelve or thirteen refugee families from West Punjab rehabilitated in village Goran, provided lands and sites by State Government.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Tension between old residents and new refugee settlers due to competition for house sites and culturable lands, leading to mutual recriminations, cattle grazing disputes, simple assaults, and complaints to authorities over four years.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 4th February 1952, incident between Diwan Singh and Mangal Singh (refugees) and Vir Singh alias Vir Lodhi and Shambhu Lodhi, causing grievous hurt to Shambhu and simple injuries to refugees; cross FIRs lodged, lightly treated by police.",
      "type": "material",
      "date": "1952-02-04",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "On 5th February 1952 morning, 13 male refugees including Mool Singh, Mela Singh, Sant Singh, Ravel Singh went to Orai to report to district authorities and Refugee Officer, made application but no hearing.",
      "type": "material",
      "date": "1952-02-05",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "On 6th February 1952, refugees prepared court complaint; villagers assembled at Parichhat Lodhi's house, resolved to kill all male members of refugee families.",
      "type": "material",
      "date": "1952-02-06",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Ravel Singh and Kartar Singh returned to village, informed of conspiracy by womenfolk, rushed back to Orai night of 6th-7th February, informed others; refugees prepared applications to DM, SP, Refugee Officer about threat and planned to rescue families.",
      "type": "material",
      "date": "1952-02-06/07",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Six refugees - Mool Singh, Mela Singh, Ravel Singh s/o Mangal Singh, Sant Singh, Kastura Singh, Harbans Singh - returned to village Goran at sunrise on 7th February 1952.",
      "type": "material",
      "date": "1952-02-07",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Six refugees found womenfolk alarmed at Mangal Singh's house; Mela Singh, Ravel Singh, Mool Singh went upstairs for breakfast; other three on ground floor.",
      "type": "material",
      "date": "1952-02-07",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Crowd of 80-100 persons armed with axes, spears, daggers, guns surrounded Mangal Singh's house; Narain Das Lodhi and Baladin Lodhi with 15-20 Lodhis appeared on first floor with guns, shot Mela, Mool, Ravel Singh; others attacked with weapons.",
      "type": "material",
      "date": "1952-02-07",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Mela Singh hidden in grain room by Smt. Bhagwanti (PW 20); bodies of Mool and Ravel thrown to Mahabir's cattle shed.",
      "type": "material",
      "date": "1952-02-07",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Ground floor three (Kastura, Harbans, Sant Singh) shot by Prabhu Dayal, Shobha Lal and others, belaboured with spears, axes, daggers.",
      "type": "material",
      "date": "1952-02-07",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Mela Singh dragged out by Raja Ram, Mahabir and others; assaulted by Jangi Lodhi with axe, Uma Charan with sword.",
      "type": "material",
      "date": "1952-02-07",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Dead bodies dragged to front of Manna Teli's house; loaded on two bullock carts (Manna Teli's and Vira Lodhi's), taken to village tank, sprinkled with kerosene, set fire by Vira Lodhi and others, burnt to ashes.",
      "type": "material",
      "date": "1952-02-07",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Eyewitnesses: Mst. Paiyyan Devi (PW 18, widow Mela Singh), Mst. Shanti Devi (PW 21, widow Mool Singh), Mst. Parvati (PW 22, widow Sant Singh), Mst. Bhagwanti (PW 20, wife Mangal Singh, mother Ravel Singh).",
      "type": "material",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Remaining refugees at Orai learned of rumour around 2 pm on 7th Feb; SP interviewed them, sent Circle Inspector Kabir Ahmad (PW 27) with armed guard.",
      "type": "material",
      "date": "1952-02-07",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "At 5 pm, chowkidar Ramola (appellant) reported all quiet at police station.",
      "type": "material",
      "date": "1952-02-07",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Police reached village midnight 7th-8th Feb; village deserted; picked up some women and children.",
      "type": "procedural",
      "date": "1952-02-07/08",
      "source": "prosecution"
    },
    {
      "id": "f18",
      "text": "Morning 8th Feb, Dy SP arrived with Paiyyan Devi and Bhagwanti Devi who had walked to Orai and reported.",
      "type": "procedural",
      "date": "1952-02-08",
      "source": "prosecution"
    },
    {
      "id": "f19",
      "text": "57 accused tried before Sessions Judge Orai under IPC 120B, 148, 201/149, 302/149, 325/149, 452; acquitted all under 120B; convicted 37, 9 death, others life/transportation etc.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "High Court on appeal: affirmed Baladin's death sentence, reduced others from death to life, acquitted 20, confirmed 17 with modifications.",
      "type": "procedural",
      "date": "1954-09-10",
      "source": "court"
    },
    {
      "id": "f21",
      "text": "High Court granted leave to appeal to SC at judgment delivery.",
      "type": "procedural",
      "date": "1954-09-10",
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Police investigation unsatisfactory: Sub-Inspector Raj Bahadur Singh (PW 30) distorted statements to suggest night occurrence; relieved same day; Circle Inspector Kabir Ahmad (PW 27) also biased, relieved 21 Feb; Dy SP C.B. Singh (PW 28) delayed earnest investigation till 30 May 1952.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Defence: complete denial, enmity motive for false implication; occurrence if any in night by unknowns.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the certificate of fitness for appeal under Article 134(1)(c) was properly granted by High Court.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether courts below erred in relying on eyewitnesses despite variances with police-recorded statements.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether inconsistency in accepting eyewitness evidence for some accused but not others vitiates convictions.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether mere presence in assembly suffices for conviction under Section 149 IPC, or overt act required.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Courts below erred in relying on four eyewitnesses as their court statements varied from Sub-Inspector's record.",
      "supporting_facts": [
        "f22"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Courts accepted eyewitnesses for some accused but acquitted others to whom specific roles assigned, inconsistency.",
      "supporting_facts": [
        "f20"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Eyewitness evidence disbelieved for some accused with specific roles, cannot accept for others without specifics.",
      "supporting_facts": [
        "f20"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "No specific overt acts against appellants; mere presence does not make member of unlawful assembly.",
      "supporting_facts": [
        "f23"
      ],
      "legal_basis": "Section 149, 142 IPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "High Court certificate under Art 134(1)(c) invalid as not exercised judicially per individual cases, no reasons given.",
      "supporting_facts": [
        "f21"
      ],
      "legal_basis": "Article 134(1)(c) Constitution; Nar Singh v. State of U.P."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court certificate invalid: mere 'leave granted' without reasons or indication of issues shows no judicial application of mind.",
      "addresses_issue": "i1",
      "key_observation": "High Court must certify fit case with reasons apparent; mechanical grant insufficient."
    },
    {
      "id": "cr2",
      "text": "Appeal not under 134(1)(c), but special leave under Art 136 granted on issue of mere presence vs membership in unlawful assembly.",
      "addresses_issue": "i4",
      "key_observation": "Mere presence insufficient unless overt act or Section 142 IPC."
    },
    {
      "id": "cr3",
      "text": "Eyewitnesses reliable despite police record variances, as Sub-Inspector distorted statements deliberately; police records not substantive evidence, lose value if tainted.",
      "addresses_issue": "i2",
      "key_observation": "High Court erred by relying on tainted police record to discard court testimony."
    },
    {
      "id": "cr4",
      "text": "In riot cases, scrutinize to distinguish active members from spectators; common object included killing and destroying evidence.",
      "addresses_issue": "i4",
      "key_observation": "Specific roles or participation in disposal of bodies implicates."
    },
    {
      "id": "cr5",
      "text": "Upholds convictions where specific overt acts: Baladin, Parichhat s/o Lallu, Ajodhia, Parichhat s/o Sadhoo (shooting upstairs); Raja Ram (dragged Mela, axe); Uma Charan (sword to Mela, burning); Mahabir (dragged bodies/Mela); Narain Das (inciting); Ramola (false report concealing); Vir Singh/Vira (cart, blood stains, on roof); Mannu Teli (cart).",
      "addresses_issue": "i3",
      "key_observation": "History of enmity, proximity support implication."
    },
    {
      "id": "cr6",
      "text": "Acquit Thakur Das, Ishwari Prasad, Mulloo, Jagdish: no specific overt acts, possibly spectators.",
      "addresses_issue": "i4",
      "key_observation": "Benefit of doubt."
    },
    {
      "id": "cr7",
      "text": "Jangi: specific axe to Mela, ring-leader; uphold despite police record lapse.",
      "addresses_issue": "i2",
      "key_observation": "No contradiction with prior statements."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Certificate under Art 134(1)(c) requires judicial discretion with reasons; invalid here.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Special leave under Art 136 on question of mere presence in unlawful assembly insufficient for conviction under S.149 IPC without overt act.",
      "resolves_issue": "i4",
      "in_favor_of": "partial"
    },
    {
      "id": "h3",
      "text": "Tainted police records cannot override reliable court testimony of eyewitnesses.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Nar Singh v. State of U.P.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Principles on validity of certificate under Art 134(1)(c): must be judicial discretion, not mechanical."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "120B",
        "148",
        "149",
        "201",
        "302",
        "325",
        "452",
        "142"
      ],
      "relevance": "Charges: conspiracy, rioting, murder in furtherance of common object of unlawful assembly, causing evidence to disappear; mere presence insufficient."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "87",
        "88"
      ],
      "relevance": "Used in investigation for attachment and proclamation."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "134(1)(c)",
        "136"
      ],
      "relevance": "Appeal rights; certificate for SC appeal must be fit case with judicial reasons; special leave."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court held High Court certificate invalid under Art 134(1)(c), but granted special leave under Art 136; upheld convictions and sentences of 13 appellants (including Baladin, Jangi) under relevant IPC sections; acquitted Thakur Das, Ishwari Prasad, Mulloo, Jagdish for lack of specific overt acts.",
    "relief_granted": "Acquittal to four appellants: Thakur Das, Ishwari Prasad, Mulloo, Jagdish.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Mere presence in an assembly does not make such a person a member of an unlawful assembly unless it is shown that he had done something or omitted to do something which would make him a member.\"",
      "speaker": "court",
      "significance": "Core holding on S.149 IPC liability."
    },
    {
      "text": "\"The word 'certifies' is a strong word. It indicates that the High Court must bring its mind to bear on the question and... the reasons for the order must be apparent on the face of the order itself.\"",
      "speaker": "court",
      "significance": "Explains requirements for Art 134(1)(c) certificate."
    },
    {
      "text": "\"If the police record becomes suspect or unreliable... it loses much of its value and the court... has to weigh the evidence given against him in court.\"",
      "speaker": "court",
      "significance": "Justifies reliance on eyewitnesses over tainted police diary."
    }
  ],
  "_case_id": "1955_26",
  "_label": 0,
  "_text_length": 46144,
  "_extracted_at": "2026-02-08T22:13:37.198351"
}