{
  "metadata": {
    "case_name": "N. Sathianathan v. Respondent No. 1",
    "case_year": 1955,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha J."
    ],
    "case_number": "Civil Appeal No. 252 of 1954",
    "date_of_judgment": "1955-03-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant and respondents 1 to 3 contested the last general elections from the Dharmapuri Parliamentary Constituency in the district of Salem in the State of Madras.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondents 4 to 10 were added as candidates by Tribunal order; their nominations valid but withdrew before polling.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant declared elected to the House of the People.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 5th March 1952, 1st respondent filed election petition No. 35 of 1952 contesting appellant's election on ground of disqualification under section 7(d) of Representation of the People Act, 1951, due to contract with Government of India in Postal Department for transport of postal mail.",
      "type": "procedural",
      "date": "1952-03-05",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Appellant holds stage carriage service permit Ex. B-2 dated 26th April 1949 issued by Regional Transport Authority, Salem, Madras, with condition to enter agreement with Government of India for transport of postal articles and mail bags if called upon.",
      "type": "admitted",
      "date": "1949-04-26",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant entered registered agreement Ex. A-3 with Government of India on 16th November 1949 for transport of postal articles and mail bags from 15th December 1949 to 14th December 1952.",
      "type": "admitted",
      "date": "1949-11-16",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "After appellant filed nomination paper, 1st respondent objected on 28th November 1951 that nomination should be rejected due to contract for mail transport between Salem and Yercaud.",
      "type": "procedural",
      "date": "1951-11-28",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Returning Officer overruled objection by order Ex. A-2 dated 28th November 1951, holding service under imperative order under Rule 160-B of Madras Motor Vehicles Rules, not agreement.",
      "type": "procedural",
      "date": "1951-11-28",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellant filed written statement on 28th May 1952 denying disqualification under section 7(d).",
      "type": "procedural",
      "date": "1952-05-28",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Election Tribunal, North Arcot, Vellore, by order dated 20th January 1953 (header: 22nd January 1953) held appellant disqualified under section 7(d), allowed petition, declared election void under section 100(1)(c) with costs to respondent.",
      "type": "procedural",
      "date": "1953-01-20",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Agreement Ex. A-3 details: Contractor (appellant) to convey postal articles/mail bags by motor vehicles from 15 Dec 1949 to 14 Dec 1952; permitted to carry passengers if mail not prejudiced; maintain buses at own expense; penalties for delays; liable for safe custody; free travel for postal officers; no transfer without consent; remuneration Rs. 200/month adjustable by mileage; terminable by 4 months notice or on permit expiry without compensation; arbitration clause.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Rule 160-B of Madras Motor Vehicles Rules: Condition of every stage carriage permit that holder shall, if required, carry mails at rates/terms fixed by transport authority after consultation.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant is disqualified under section 7(d) of the Representation of the People Act, 1951 for election to the House of the People due to contract with Government of India for transport of postal mail.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Tribunal has jurisdiction to decide disqualification in view of Article 103 of the Constitution of India.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Carrying mails is exclusive privilege of Government of India, normal function statutorily reserved, not performance of service undertaken by Government; no interest in contract for performance of any service within section 7(d); only carrying out obligations under Rule 160-B of Madras Motor Vehicles Rules.",
      "supporting_facts": [
        "f5",
        "f6",
        "f12"
      ],
      "legal_basis": "Section 7(d) Representation of the People Act, 1951; Rule 160-B Madras Motor Vehicles Rules; Article 103 Constitution of India"
    },
    {
      "id": "pa2",
      "text": "Agreement lacks free consensus/offer and acceptance; statutory obligation, not contract; no consideration as remuneration fixed by Regional Transport Officer on 23rd July 1949; service already due to Transport Authority.",
      "supporting_facts": [
        "f6",
        "f11",
        "f12"
      ],
      "legal_basis": "Indian Contract Act"
    },
    {
      "id": "pa3",
      "text": "Transport of mail not a service undertaken by Central Government.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Section 7(d) Representation of the People Act, 1951; Indian Post Office Act, 1898"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant disqualified under section 7(d) as he had contract with Government of India for transport of postal mail, a service undertaken by Central Government; agreement involves mutual obligations from free offer and acceptance, supported by consideration.",
      "supporting_facts": [
        "f4",
        "f6",
        "f11"
      ],
      "legal_basis": "Section 7(d) Representation of the People Act, 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Agreement Ex. A-3 is a formal contract satisfying all requirements; entered with eyes open; not vitiated; independent of permit condition which is mere notice; mutual promises with consideration; terminable by notice.",
      "addresses_issue": "i1",
      "key_observation": "Agreement has all ingredients of valid contract under Indian Contract Act; appellant had free choice to enter or terminate."
    },
    {
      "id": "cr2",
      "text": "Section 7(d) avoids conflict between public duty and private interest; appellant could have terminated contract under clause 18 before election.",
      "addresses_issue": "i1",
      "key_observation": "Permit holder not compelled; additional remuneration after consultation; advantage for permit renewal."
    },
    {
      "id": "cr3",
      "text": "Postal service is undertaken by Government as welfare service, not essential sovereign function; appellant concerned in contract for his benefit.",
      "addresses_issue": "i1",
      "key_observation": "Straightforward case within section 7(d)."
    },
    {
      "id": "cr4",
      "text": "Article 103 not bar to Tribunal jurisdiction (not pressed in appeal).",
      "addresses_issue": "i2",
      "key_observation": "Tribunal has jurisdiction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant disqualified under section 7(d) of Representation of the People Act, 1951; agreement is valid contract for service undertaken by Central Government.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Tribunal conclusions correct; election void.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "Section 7(d)",
        "Section 100(1)(c)"
      ],
      "relevance": "Disqualification for interest in contract for services undertaken by Government; grounds for declaring election void."
    },
    {
      "name": "Motor Vehicles Act",
      "sections": [
        "Section 48(d)"
      ],
      "relevance": "Authority for Rule 160-B."
    },
    {
      "name": "Madras Motor Vehicles Rules",
      "sections": [
        "Rule 160-B"
      ],
      "relevance": "Condition in stage carriage permit to carry mails if required, after consultation."
    },
    {
      "name": "Indian Post Office Act, 1898",
      "sections": [],
      "relevance": "Defines postal articles and mail bags; exclusive privilege enabling, not obligatory."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 103"
      ],
      "relevance": "Question of disqualification decided by President; not bar to Tribunal jurisdiction."
    },
    {
      "name": "Indian Contract Act",
      "sections": [],
      "relevance": "Governs validity of agreement; free consent, consideration present."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upheld Election Tribunal's order declaring appellant's election void under section 100(1)(c) of Representation of the People Act, 1951, on ground of disqualification under section 7(d) due to subsisting contract with Government of India Postal Department for mail transport.",
    "relief_granted": "Election petition allowed; appellant's election declared void.",
    "costs": "Costs to respondent as per Tribunal order."
  },
  "key_quotes": [
    {
      "text": "Section 7 of the Act is clearly intended to avoid a conflict between public duty and private interest.",
      "speaker": "court",
      "significance": "Explains purpose of disqualification provision."
    },
    {
      "text": "The present case is a straightforward illustration of the kind of contract contemplated by section 7(d) of the Act.",
      "speaker": "court",
      "significance": "Confirms applicability to facts."
    },
    {
      "text": "At all material times the appellant has been directly concerned, for his own benefit, in the contract of carrying mail bags and postal articles.",
      "speaker": "court",
      "significance": "Key finding on disqualification."
    }
  ],
  "_case_id": "1955_73",
  "_label": 0,
  "_text_length": 21699,
  "_extracted_at": "2026-02-08T22:14:04.441670"
}