{
  "metadata": {
    "case_name": "State of Bihar v. Kumar Rani Sayeeda Khatoon and others",
    "case_year": 1955,
    "court": "Supreme Court of India",
    "judges": [
      "JAGANNADHADAS J."
    ],
    "case_number": "Civil Appeals Nos. 97 and 98 of 1952",
    "date_of_judgment": "1955-02-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Kumar Rani was born in the territory of India and claims to be the lawfully wedded wife of Captain Maharaj Kumar Gopal Saran Narayan Singh of Gaya by virtue of marriage in 1920 according to Arya Samaj rites and subsequently according to Muslim rites.",
      "type": "background",
      "date": "1920",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "In 1946, Kumar Rani created a wakf of her properties consisting of 427 villages for the maintenance and support of herself, her sons and their descendants, by executing a deed of Wakf-ulal-Aulad dated 4th May 1946, divesting herself of all interest and vesting in Almighty God. She appointed herself sole mutwalli for life or until relinquishment, sons to succeed as joint mutwallis. Net income for maintenance, not more than half for her use.",
      "type": "material",
      "date": "1946-05-04",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Kumar Rani went to Karachi in July 1948.",
      "type": "material",
      "date": "1948-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In December 1948, Kumar Rani returned to India from Pakistan on a temporary permit, stating in application that she was domiciled in Pakistan, representing herself as Pakistani national.",
      "type": "material",
      "date": "1948-12",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Kumar Rani went back to Pakistan in April 1949 on expiry of temporary permit.",
      "type": "material",
      "date": "1949-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Bihar Administration of Evacuee Property Ordinance 1949 (Bihar Ordinance No. III of 1949) came into force on 21st June 1949.",
      "type": "procedural",
      "date": "1949-06-21",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Deputy Custodian issued notification on 2nd September 1949 under section 5 declaring wakf properties vested in Custodian as evacuee property. Possession taken between 20th September and 2nd October 1949.",
      "type": "material",
      "date": "1949-09-02",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Kumar Rani wrote a letter dated 2nd June 1949 to her second son Kumar Fateh Singh purporting to relinquish office of mutwalli. High Court found letter not genuine after remand.",
      "type": "disputed",
      "date": "1949-06-02",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Kumar Rani returned to India on 14th May 1950 under permanent permit from High Commissioner for India in Pakistan.",
      "type": "material",
      "date": "1950-05-14",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Permanent permit cancelled on 12th July 1950 by Deputy High Commissioner as wrongly issued without concurrence of Government required by rules under Influx from Pakistan Control Act 1949.",
      "type": "procedural",
      "date": "1950-07-12",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Sub-Inspector of Police Gaya issued notice dated 23rd July 1950 directing Kumar Rani to leave India by 31st July 1950 due to permit cancellation.",
      "type": "material",
      "date": "1950-07-23",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Application dated 5th July 1950 by Kumar Rani and sons challenging declaration of wakf as evacuee property and possession.",
      "type": "procedural",
      "date": "1950-07-05",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Application dated 28th July 1950 by Kumar Rani challenging police order to leave India.",
      "type": "procedural",
      "date": "1950-07-28",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "High Court of Patna allowed both applications by judgment dated 13th October 1950.",
      "type": "procedural",
      "date": "1950-10-13",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Supreme Court heard appeals on 26th-27th October 1953, remanded CA No.97 to High Court for finding on genuineness of letter dated 2nd June 1949.",
      "type": "procedural",
      "date": "1953-10-26",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "High Court found letter not genuine after remand.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Kumar Rani was a citizen of India at the date of the police order dated 23rd July 1950, given her migration to Pakistan.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the wakf estate was evacuee property under Bihar Administration of Evacuee Property Ordinance 1949, including challenges on her evacuee status, relinquishment via letter, and applicability to wakf property.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Kumar Rani went to Pakistan temporarily for medical treatment, continued to be citizen of India with domicile of husband in India; permit cancellation invalid.",
      "supporting_facts": [
        "f3",
        "f4",
        "f9"
      ],
      "legal_basis": "Article 5, 19 of Constitution"
    },
    {
      "id": "pa2",
      "text": "Kumar Rani not an evacuee.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Definition in Bihar Ordinance No. III of 1949"
    },
    {
      "id": "pa3",
      "text": "Kumar Rani relinquished mutwalli office by letter dated 2nd June 1949 to son, vesting property in three sons who remained in India.",
      "supporting_facts": [
        "f2",
        "f8"
      ],
      "legal_basis": "Terms of wakf deed"
    },
    {
      "id": "pa4",
      "text": "Bihar Ordinance No. III of 1949 not applicable to wakf property or beneficial interest of mutwallis.",
      "supporting_facts": [
        "f2",
        "f7"
      ],
      "legal_basis": "Definition of evacuee property in Bihar Ordinance"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Kumar Rani migrated to Pakistan after 1st March 1947, not citizen; temporary visit story unfounded; permit invalidly issued without state concurrence and properly cancelled.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f10"
      ],
      "legal_basis": "Articles 5,7 Constitution; Influx from Pakistan Control Act 1949, Permit System Rules 1949"
    },
    {
      "id": "ra2",
      "text": "Kumar Rani is evacuee under definition; letter not genuine; evacuee property includes wakf interest as trustee; vesting continued under subsequent central laws.",
      "supporting_facts": [
        "f3",
        "f7",
        "f8",
        "f16"
      ],
      "legal_basis": "Bihar Ordinance No. III 1949 s.5; Central Ordinance XXVII 1949; Central Act XXXI 1950"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court overlooked Article 7 which overrides Article 5; Kumar Rani migrated after 1st March 1947 as per facts: went July 1948, temporary permit Dec 1948 stating Pakistan domicile, back April 1949; not temporary medical visit. Proviso to Art 7 inapplicable as permit invalidly issued without state concurrence and properly cancelled under Rule 29.",
      "addresses_issue": "i1",
      "key_observation": "Article 7 peremptory, no exception for wife leaving husband in India; she deemed not citizen."
    },
    {
      "id": "cr2",
      "text": "Kumar Rani evacuee under Bihar Ordinance definition as left for Pakistan after 1st Nov 1946 in relevant circumstances.",
      "addresses_issue": "i2",
      "key_observation": "Migration facts established."
    },
    {
      "id": "cr3",
      "text": "Letter dated 2nd June 1949 not genuine as found by High Court after remand; no reason to differ.",
      "addresses_issue": "i2",
      "key_observation": "No relinquishment, sons not vested with interest."
    },
    {
      "id": "cr4",
      "text": "Evacuee property definition in Bihar Ordinance includes property where evacuee has right/interest or held under deed of trust; covers wakf as trustee/beneficiary. Confirmed by broader definitions and savings in Central Ordinance XXVII 1949 and Central Act XXXI 1950 with continued vesting.",
      "addresses_issue": "i2",
      "key_observation": "Wakf property and interest vested in Custodian."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Kumar Rani not a citizen of India under Article 7 notwithstanding Article 5; police order to leave valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Wakf estate correctly declared and vested as evacuee property of Kumar Rani who is evacuee; letter invalid; Ordinance applies to wakf interest.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 5",
        "Article 7",
        "Article 19",
        "Article 132",
        "Article 133",
        "Article 226"
      ],
      "relevance": "Citizenship determination: Art 5 domicile/birth, Art 7 migration to Pakistan overrides; Art 19 fundamental right violated if citizen; Arts 132/133/226 basis for appeals/applications."
    },
    {
      "name": "Bihar Administration of Evacuee Property Ordinance, 1949 (No. III of 1949)",
      "sections": [
        "Section 5"
      ],
      "relevance": "Declaration and vesting of evacuee property including wakf; definitions of evacuee and evacuee property."
    },
    {
      "name": "Influx from Pakistan (Control) Act, 1949",
      "sections": [
        "Section 4"
      ],
      "relevance": "Permit System Rules 1949 framed thereunder: Rule 10 requires state concurrence for permanent permit; Rule 29 allows cancellation."
    },
    {
      "name": "Administration of Evacuee Property Ordinance, 1949 (Central No. XXVII of 1949)",
      "sections": [
        "Section 8(2)",
        "Section 55(2)"
      ],
      "relevance": "Repealed Bihar Ordinance; broader evacuee property definition includes trustee/beneficiary interest; savings clause continues vesting."
    },
    {
      "name": "Administration of Evacuee Property Act, 1950 (Central Act No. XXXI of 1950)",
      "sections": [
        "Section 8(2)"
      ],
      "relevance": "Repealed Central Ordinance; evacuee property includes any capacity; savings continues vesting."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Both appeals allowed; High Court orders set aside; Kumar Rani not citizen, police expulsion order valid; wakf correctly vested as evacuee property.",
    "relief_granted": "State of Bihar's actions upheld",
    "costs": "Appellant gets only costs incurred before High Court on remand in Civil Appeal No. 97"
  },
  "key_quotes": [
    {
      "text": "Article 7 clearly overrides article 5. It is peremptory in its scope and makes no exception for such a case, i.e., of the wife migrating to Pakistan leaving her husband in India.",
      "speaker": "court",
      "significance": "Core reasoning on citizenship, Art 7 overriding Art 5 even for wives."
    },
    {
      "text": "This is a case not of a valid permanent permit having been issued... It is a case of an unauthorised issue of an invalid permit which has been properly cancelled.",
      "speaker": "court",
      "significance": "Why proviso to Art 7 inapplicable."
    },
    {
      "text": "The definitions of the phrase evacuee property in the Central Ordinance and by the Central Act are clear and unambiguous so as to include the interest of an evacuee in any property held as a trustee or beneficiary.",
      "speaker": "court",
      "significance": "Applies to wakf interest despite contentions."
    }
  ],
  "_case_id": "1955_4",
  "_label": 1,
  "_text_length": 17975,
  "_extracted_at": "2026-02-08T22:13:21.949663"
}