{
  "metadata": {
    "case_name": "State of Bihar v. Kumar Rani Sayeeda Khatoon and others",
    "case_year": 1955,
    "court": "Supreme Court of India",
    "judges": [
      "Jagannadhadas J."
    ],
    "case_number": "Civil Appeals Nos. 97 and 98 of 1952",
    "date_of_judgment": "1955-02-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Kumar Rani was born in the territory of India and claims to be the lawfully wedded wife of Captain Maharaj Kumar Gopal Saran Narayan Singh of Gaya by virtue of an alleged marriage in 1920 according to Arya Samaj rites and subsequently according to Muslim rites.",
      "type": "background",
      "date": "1920",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "In 1946, Kumar Rani created a wakf of her properties consisting of 427 villages for the maintenance and support of herself, her sons and their descendants, by executing a deed of Wakf-ulal-Aulad dated 4th May 1946, divesting herself of all interest and vesting them in Almighty God. She appointed herself as sole mutwalli for her lifetime or until relinquishment, and her three sons to succeed as joint mutwallis. Net income to be spent for maintenance of herself and sons, not more than half by wakifa for her own use.",
      "type": "material",
      "date": "1946-05-04",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In July 1948, Kumar Rani went to Karachi.",
      "type": "material",
      "date": "1948-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In December 1948, Kumar Rani returned to India from Pakistan on a temporary permit, stating in her application that she was domiciled in Pakistan and representing herself as a Pakistani national, and went back to Pakistan in April 1949.",
      "type": "material",
      "date": "1948-12",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On 21st June 1949, the Bihar Administration of Evacuee Property Ordinance 1949 (Bihar Ordinance No. III of 1949) came into force.",
      "type": "procedural",
      "date": "1949-06-21",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Deputy Custodian issued notification on 2nd September 1949 under section 5 declaring wakf estate as evacuee property and took possession between 20th September and 2nd October 1949.",
      "type": "procedural",
      "date": "1949-09-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Kumar Rani wrote a letter dated 2nd June 1949 to her second son Kumar Fateh Singh purporting to relinquish office of mutwalli.",
      "type": "disputed",
      "date": "1949-06-02",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "On 14th May 1950, Kumar Rani returned to India under a permanent permit from High Commissioner for India in Pakistan.",
      "type": "material",
      "date": "1950-05-14",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Permit cancelled on 12th July 1950 by Deputy High Commissioner as wrongly issued without concurrence of Government required by rules under Influx from Pakistan Control Act 1949.",
      "type": "procedural",
      "date": "1950-07-12",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Sub-Inspector of Police Gaya issued notice on 23rd July 1950 directing Kumar Rani to leave India by 31st July 1950 due to permit cancellation.",
      "type": "procedural",
      "date": "1950-07-23",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Applications filed in High Court of Patna: one dated 5th July 1950 by Kumar Rani and sons challenging wakf declaration and possession; another dated 28th July 1950 by Kumar Rani challenging police order.",
      "type": "procedural",
      "date": "1950-07-05",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "High Court allowed both applications by judgment dated 13th October 1950.",
      "type": "procedural",
      "date": "1950-10-13",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Supreme Court on 26-27 October 1953 remanded Appeal No. 97 to High Court for finding on genuineness of letter dated 2nd June 1949.",
      "type": "procedural",
      "date": "1953-10-26",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "High Court found letter dated 2nd June 1949 not genuine.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Kumar Rani was a citizen of India at the date of the police order dated 23rd July 1950, considering her migration to Pakistan and permit issues under Articles 5, 7 and 19 of the Constitution.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the wakf estate was evacuee property under Bihar Administration of Evacuee Property Ordinance 1949, including whether Kumar Rani was an evacuee, effect of alleged relinquishment letter, and applicability to wakf property.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Kumar Rani went to Pakistan temporarily for medical treatment and continued to be citizen of India with domicile of her husband; permit cancellation invalid.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Article 5, 19 of Constitution; English law on wife's domicile"
    },
    {
      "id": "pa2",
      "text": "Kumar Rani relinquished mutwalli office by letter dated 2nd June 1949, vesting property in sons who remained in India.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Wakf deed terms"
    },
    {
      "id": "pa3",
      "text": "Bihar Ordinance does not apply to wakf property or beneficial interest of mutwalli.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "Definition of evacuee property in Bihar Ordinance No. III of 1949"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Kumar Rani migrated to Pakistan after 1st March 1947, represented as Pakistani national, permit invalidly issued and properly cancelled; not citizen of India.",
      "supporting_facts": [
        "f3",
        "f4",
        "f8",
        "f9"
      ],
      "legal_basis": "Article 7 Constitution; Rule 10, 29 Permit System Rules 1949 under Influx from Pakistan Control Act 1949"
    },
    {
      "id": "ra2",
      "text": "Kumar Rani is evacuee under Bihar Ordinance as she left India for Pakistan after 1st November 1946 in relevant circumstances.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Definition of evacuee in Bihar Ordinance No. III of 1949"
    },
    {
      "id": "ra3",
      "text": "Letter dated 2nd June 1949 not genuine.",
      "supporting_facts": [
        "f7",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Evacuee property definition includes wakf property and interest as trustee or beneficiary, continued vesting under subsequent Central laws.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "Bihar Ordinance No. III of 1949 s.5; Central Ordinance XXVII of 1949; Central Act XXXI of 1950"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court overlooked Article 7 which overrides Article 5; Kumar Rani migrated after 1st March 1947 as per facts: went to Karachi July 1948 not temporarily, returned on temporary permit as Pakistani domiciled, back to Pakistan April 1949, permanent permit attempt after property vesting; not within proviso to Article 7 as permit invalidly issued without state concurrence and properly cancelled under rules.",
      "addresses_issue": "i1",
      "key_observation": "Article 7 peremptory, no exception for wife leaving husband in India; invalid permit no application of proviso."
    },
    {
      "id": "cr2",
      "text": "Kumar Rani evacuee under Bihar Ordinance as migrated after prescribed date in relevant circumstances.",
      "addresses_issue": "i2",
      "key_observation": "Migration facts established, plea of temporary visit rejected."
    },
    {
      "id": "cr3",
      "text": "Letter dated 2nd June 1949 not genuine as found by High Court after remand; no reason to differ.",
      "addresses_issue": "i2",
      "key_observation": "Genuineness challenged and disproved."
    },
    {
      "id": "cr4",
      "text": "Evacuee property definition in Bihar Ordinance includes wakf property and mutwalli interest; confirmed by broader definitions in repealing Central laws and continuance of vesting provisions.",
      "addresses_issue": "i2",
      "key_observation": "Words of sufficient amplitude; successive laws place beyond doubt."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Kumar Rani not citizen of India under Article 7; police order valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Wakf estate properly declared and vested as evacuee property.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 5",
        "Article 7",
        "Article 19",
        "Article 226",
        "Article 132(1)",
        "Article 133(1)(c)"
      ],
      "relevance": "Determines citizenship; Article 7 overrides 5 for migrants to Pakistan post 1 March 1947 unless proviso applies; Article 19 violated if citizen and externed."
    },
    {
      "name": "Bihar Administration of Evacuee Property Ordinance 1949 (No. III of 1949)",
      "sections": [
        "Section 5"
      ],
      "relevance": "Notification declaring wakf as evacuee property; definitions of evacuee and evacuee property include wakf interest."
    },
    {
      "name": "Central Ordinance No. XXVII of 1949",
      "sections": [
        "Section 8(2)",
        "Section 55(2)"
      ],
      "relevance": "Repealed Bihar Ordinance; broader evacuee property definition; continuance of vesting."
    },
    {
      "name": "Administration of Evacuee Property Act 1950 (Central Act No. XXXI of 1950)",
      "sections": [
        "Section 8(2)"
      ],
      "relevance": "Repealed Central Ordinance; evacuee property includes trustee/beneficiary interest; continuance of vesting."
    },
    {
      "name": "Influx from Pakistan (Control) Act 1949",
      "sections": [
        "Section 4"
      ],
      "relevance": "Permit System Rules framed thereunder."
    },
    {
      "name": "Permit System Rules 1949",
      "sections": [
        "Rule 10",
        "Rule 29"
      ],
      "relevance": "Permanent permit requires state concurrence; permits liable to cancellation without reason."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Both appeals allowed; High Court orders set aside; Kumar Rani not citizen of India, police order valid; wakf estate properly vested as evacuee property.",
    "relief_granted": "Restoration of state actions on property and person",
    "costs": "Appellant gets only costs incurred before High Court on remand in Civil Appeal No. 97"
  },
  "key_quotes": [
    {
      "text": "Article 7 clearly overrides article 5. It is peremptory in its scope and makes no exception for such a case, i.e., of the wife migrating to Pakistan leaving her husband in India.",
      "speaker": "court",
      "significance": "Core reasoning on citizenship overriding domicile of husband."
    },
    {
      "text": "It is a case of an unauthorised issue of an invalid permit which has been properly cancelled. Hence the proviso to article 7 can have no possible application.",
      "speaker": "court",
      "significance": "Rejects application of proviso to Article 7."
    },
    {
      "text": "The definitions of the phrase evacuee property in the Central Ordinance and by the Central Act are clear and unambiguous so as to include the interest of an evacuee in any property held as a trustee or beneficiary.",
      "speaker": "court",
      "significance": "Confirms applicability to wakf property."
    }
  ],
  "_case_id": "1955_4",
  "_label": 1,
  "_text_length": 17975,
  "_extracted_at": "2026-02-10T19:16:12.076505"
}