{
  "metadata": {
    "case_name": "Nanak Chand v. State",
    "case_year": 1955,
    "court": "Supreme Court of India",
    "judges": [
      "IMAM J."
    ],
    "case_number": "Criminal Appeal No. 132 of 1954",
    "date_of_judgment": "1955-01-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Sadhu Ram was killed on the 5th of November, 1953, at about 6-45 P.M. at the shop of Vas Dev P.W. 2.",
      "type": "material",
      "date": "1953-11-05",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "The appellant along with others assaulted Sadhu Ram. The appellant was armed with a takwa.",
      "type": "material",
      "date": "1953-11-05",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Numerous injuries were found on the person of Sadhu Ram. According to the doctor, who held the postmortem examination, injuries 1, 3 and 4 were due to a heavy sharp edged weapon and could be caused by a takwa.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "According to the Medical evidence, injuries 1, 3 and 4 individually, as well as collectively, were enough to cause death in the ordinary course of nature.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "In the Court of Sessions the appellant along with others was charged under section 148 and section 302, read with section 149 of the Indian Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Additional Sessions Judge held that the charge of rioting was not proved. He found the appellant and three others guilty under section 302 read with section 34 of the Indian Penal Code. He acquitted the other three accused.",
      "type": "procedural",
      "date": "1954-04-14",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "There was an appeal by three convicted persons to the High Court and the High Court convicted the appellant alone under section 302 of the Indian Penal Code, confirming the sentence of death but altered the conviction of the other accused from section 302/34 to section 323, Indian Penal Code. It held that the provisions of section 34 of the Indian Penal Code did not apply.",
      "type": "procedural",
      "date": "1954-06-15",
      "source": "high_court"
    },
    {
      "id": "f8",
      "text": "Vas Dev P.W. 2 had admitted that Mitu took away the takwa from the appellant after Sadhu Ram had been dragged out of the shop but no takwa blow was given outside the shop.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Prakash Chand P.W. 4, another eye-witness, also admitted that Mitu had taken the takwa from the appellant when they had come out of the shop.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "With reference to injury No. 1 the doctor stated that the wounds were not very clean-cut. The other incised injuries on the head were bone deep. The bone, however, had not been cut.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant could legally be convicted for murder and sentenced under section 302, Indian Penal Code when he was not charged with that offence, after acquittal of rioting (s148) and offence under s302/149.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether section 149 of the Indian Penal Code creates a specific offence distinct from the substantive offence under s302.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether sections 236 and 237 of the Code of Criminal Procedure apply to permit conviction under s302 without a specific charge.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellant could not be convicted for the substantive offence of murder under section 302, Indian Penal Code, without a charge having been framed against him under that section, as he had been acquitted of the charge of rioting and the offence under section 302/149.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Sections 233, 234, 235, 236, 237, 239 CrPC; s149 IPC creates specific offence separate from s302 IPC; Barendra Kumar Ghosh v. Emperor; Panchu Das v. Emperor; Reazuddi v. King-Emperor; Emperor v. Madan Mandal"
    },
    {
      "id": "pa2",
      "text": "Appellant was misled in his defence by the absence of a charge under s302, as he would have questioned doctor more closely about incised injuries and witnesses about takwa.",
      "supporting_facts": [
        "f8",
        "f9",
        "f10"
      ],
      "legal_basis": "Sections 535, 537 CrPC; prejudice due to no charge"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Section 149 did not create any offence at all and therefore no separate charge was obligatory under section 233 CrPC; in any event, provisions of sections 236 and 237 CrPC apply and appellant could be convicted under s302 although no charge for substantive offence framed.",
      "supporting_facts": [],
      "legal_basis": "s149 IPC merely provides constructive guilt similar to s34; Theetkumalai Gounder v. King-Emperor; Queen Empress v. Bisheshar; Ramasray Ahir v. King-Emperor; Sheo Ram v. Emperor"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 149 IPC creates a specific offence distinct from s34 IPC, as it makes members of unlawful assembly guilty of offence committed by one member in prosecution of common object, even without common intention or overt act.",
      "addresses_issue": "i2",
      "key_observation": "Clear distinction between s34 (common intention) and s149 (membership in unlawful assembly with common object)."
    },
    {
      "id": "cr2",
      "text": "A person charged with offence read with s149 cannot be convicted of substantive offence without specific charge under s233 CrPC, following Calcutta High Court view.",
      "addresses_issue": "i1",
      "key_observation": "s149 punishment depends on offence committed, but it is distinct offence."
    },
    {
      "id": "cr3",
      "text": "Sections 236 and 237 CrPC do not apply as no doubt about facts or which offence committed; offence of murder clear if facts proved.",
      "addresses_issue": "i3",
      "key_observation": "No room for alternative charges."
    },
    {
      "id": "cr4",
      "text": "Irregularity not curable under ss535,537 CrPC as appellant prejudiced and misled in defence by absence of s302 charge.",
      "addresses_issue": "i1",
      "key_observation": "Appellant not called upon to meet murder charge specifically."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Conviction under s302 without specific charge is illegal when acquitted of s302/149 and s148.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Section 149 IPC creates a specific offence.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Barendra Kumar Ghosh v. Emperor",
      "citation": "1925 I.L.R. 52 Cal. 197",
      "treatment": "followed",
      "relevance": "Distinction between s34 and s149; s149 creates specific offence."
    },
    {
      "case_name": "Panchu Das v. Emperor",
      "citation": "1907 I.L.R. 34 Cal. 698",
      "treatment": "followed",
      "relevance": "Cannot convict of substantive offence without charge if charged under substantive/s149."
    },
    {
      "case_name": "Reazuddi and Others v. King-Emperor",
      "citation": "1901 6 O.W.N 98",
      "treatment": "followed",
      "relevance": "Cannot convict of substantive if charged under s149."
    },
    {
      "case_name": "Emperor v. Madan Mandal and Others",
      "citation": "1914 I.L.R. 41 Cal. 662",
      "treatment": "followed",
      "relevance": "Supports Calcutta view on need for specific charge."
    },
    {
      "case_name": "Theetkumalai Gounder and Others v. King-Emperor",
      "citation": "1924 I.L.R. 47 Mad. 746",
      "treatment": "distinguished",
      "relevance": "Held s149 not offence like s34, but predates Barendra and disagreed with."
    },
    {
      "case_name": "Queen Empress v. Bisheshar and Others",
      "citation": "1887 I.L.R. 9 All. 645",
      "treatment": "distinguished",
      "relevance": "s149 declaratory like s34."
    },
    {
      "case_name": "Ramasray Ahir v. King-Emperor",
      "citation": "1928 I.L.R. 7 Patna 484",
      "treatment": "distinguished",
      "relevance": "Followed Madras FB view."
    },
    {
      "case_name": "Sheo Ram and Others v. Emperor",
      "citation": "A.I.R. 1948 All. 162",
      "treatment": "distinguished",
      "relevance": "Declined to decide issue."
    },
    {
      "case_name": "Karnail Singh v. State of Punjab",
      "citation": "1954 S.C.R. 904",
      "treatment": "distinguished",
      "relevance": "Cannot convert s302/149 to s302/34 without basis."
    },
    {
      "case_name": "Queen v. Sabid Ali and Others",
      "citation": "1873 20 W.R. Cr. 5",
      "treatment": "referred",
      "relevance": "On s149 creating offence."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "149",
        "34",
        "148",
        "323",
        "150",
        "471",
        "193",
        "195",
        "196",
        "197",
        "200",
        "141",
        "114",
        "40"
      ],
      "relevance": "s149 creates specific offence distinct from substantive offences and s34; charged under 148, 302/149; convicted under 302/34 then 302."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "233",
        "234",
        "235",
        "236",
        "237",
        "239",
        "535",
        "537",
        "232"
      ],
      "relevance": "Requires separate charge for distinct offence; ss236/237 not applicable; irregularities curable only if no failure of justice."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court allowed the appeal, set aside the conviction under s302 IPC and death sentence by the High Court, holding it illegal due to absence of specific charge under s302 after acquittal under 302/149 and 148, causing prejudice to appellant.",
    "relief_granted": "Conviction and sentence set aside",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Section 149 of the Indian Penal Code creates a specific offence.",
      "speaker": "court",
      "significance": "Core holding distinguishing s149 from s34."
    },
    {
      "text": "A person charged with an offence read with section 149 cannot be convicted of the substantive offence without a specific charge being framed as required by section 233 of the Code of Criminal Procedure.",
      "speaker": "court",
      "significance": "Decides principal issue in favor of appellant."
    },
    {
      "text": "There is a clear distinction between the provisions of sections 34 and 149 of the Indian Penal Code and the two sections are not to be confused.",
      "speaker": "court",
      "significance": "Explains difference: common intention vs. common object."
    }
  ],
  "_case_id": "1955_0",
  "_label": 1,
  "_text_length": 24198,
  "_extracted_at": "2026-02-08T22:13:19.638033"
}