{
  "metadata": {
    "case_name": "Baladin Lodhi & Ors. v. State of Uttar Pradesh",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha, J."
    ],
    "case_number": "Criminal Appeal Nos. 118 of 1954 and 119 of 1954",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Twelve or thirteen refugee families from West Punjab rehabilitated in village Goran, provided lands, sites and loans by State Government.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Tension between old residents and new refugee settlers over house sites and culturable lands, leading to mutual recriminations, cattle grazing disputes, simple assaults, harassment allegations and complaints to authorities over four years.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 4th February 1952, incident between Diwan Singh and Mangal Singh (displaced persons) and Vir Singh alias Vir Lodhi and Shambhu Lodhi; grievous hurt to Shambhu Lodhi, simple injuries to displaced persons; cross FIRs lodged, lightly treated by police.",
      "type": "background",
      "date": "1952-02-04",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On morning of 5th February 1952, 13 male refugees including Mool Singh, Mela Singh, Sant Singh and Ravel Singh went to Orai to report to district authorities and Refugee Officer; made application to Refugee Officer but no hearing from district authorities.",
      "type": "procedural",
      "date": "1952-02-05",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Refugees spent 6th February preparing court complaint against Shambhu and others, attempting to contact authorities.",
      "type": "procedural",
      "date": "1952-02-06",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Villagers assembled at Parichhat Lodhi's house, resolved to kill all male members of refugee families.",
      "type": "disputed",
      "date": "1952-02-06",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Ravel Singh and Kartar Singh returned from Orai, informed of conspiracy by womenfolk; returned to Orai that night (6-7 Feb) and informed others.",
      "type": "material",
      "date": "1952-02-06 to 1952-02-07",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Refugees prepared applications to DM, SP, Refugee Officer about resolution and apprehensions, stating they would go to village at night to rescue families.",
      "type": "material",
      "date": "1952-02-06 night",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Six refugees - Mool Singh, Mela Singh, Ravel Singh s/o Mangal Singh, Sant Singh, Kastura Singh, Harbans Singh - returned to village Goran at sunrise on 7th February 1952.",
      "type": "material",
      "date": "1952-02-07",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Six men found womenfolk alarmed and collected at Mangal Singh's house; apprised of situation; Mela Singh, Ravel Singh, Mool Singh went upstairs for breakfast; other three (Kastura, Harbans, Sant Singh) on ground floor.",
      "type": "material",
      "date": "1952-02-07 morning",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Crowd of 80-100 persons armed with axes, spears, daggers, guns etc. surrounded Mangal Singh's house; Narain Das Lodhi and Baladin Lodhi with 15-20 Lodhis appeared on first floor with guns, shot Mela, Ravel, Mool Singh; others attacked with lethal weapons.",
      "type": "material",
      "date": "1952-02-07 morning",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Mela Singh received two gunshot wounds, rolled down, hidden by Smt. Bhagwanti in grain room.",
      "type": "material",
      "date": "1952-02-07 morning",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Dead bodies of Mool Singh and Ravel Singh thrown from roof to Mahabir's cattle shed.",
      "type": "material",
      "date": "1952-02-07 morning",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Ground floor three prevented from escaping by mob; Prabhu Dayal and Shobha Lal fired shots killing them; others belaboured with spears, axes, daggers.",
      "type": "material",
      "date": "1952-02-07 morning",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Mela Singh dragged out by Raja Ram, Mahabir and others; assaulted by Jangi Lodhi with axe, Uma Charan with sword.",
      "type": "material",
      "date": "1952-02-07 morning",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Dead bodies of six victims dragged to front of Manna Teli's house; loaded on two bullock carts (Manna Teli's and Vira Lodhi's); carried to village tank; kerosene sprinkled, set fire by Vira Lodhi and others; burnt to ashes.",
      "type": "material",
      "date": "1952-02-07 morning",
      "source": "prosecution"
    },
    {
      "id": "f17",
      "text": "Eyewitnesses: Mst. Paiyyan Devi (widow Mela Singh, PW18), Mst. Shanti Devi (widow Mool Singh, PW21), Mst. Parvati (PW22, widow Sant Singh), Mst. Bhagwanti (wife Mangal Singh, mother Ravel Singh, PW20).",
      "type": "material",
      "date": "1952-02-07",
      "source": "prosecution"
    },
    {
      "id": "f18",
      "text": "Remaining refugees at Orai tried to contact authorities on 7th Feb; at 2pm heard rumour of murders; SP interviewed them, directed Circle Inspector Kabir Ahmad (PW27) at 4:30pm to go to village with armed guard and refugees.",
      "type": "procedural",
      "date": "1952-02-07",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "After sunset 7th Feb, Circle Inspector met SI Raj Bahadur Singh (in charge Ait PS) coming to Orai, ignorant of events; chowkidar Ramola (appellant) lodged info at 5pm that all quiet.",
      "type": "procedural",
      "date": "1952-02-07",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Police reached village midnight 7-8 Feb; village deserted; refugees and locals fled; Mangal Singh, Diwan Singh found women/children in jungle.",
      "type": "procedural",
      "date": "1952-02-07 to 1952-02-08",
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Morning 8th Feb, DSP arrived with Paiyyan Devi, Bhagwanti who had walked to Orai overnight and informed SP.",
      "type": "procedural",
      "date": "1952-02-08",
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Police investigation unsatisfactory: apathetic/hostile to refugees; SI Raj Bahadur Singh (PW30) twisted case to suggest night occurrence; relieved same day; Circle Inspector Kabir Ahmad took over, also biased, relieved 21 Feb; DSP C.B. Singh (PW28) took charge Feb 22/23 but earnest investigation from 30 May 1952; failed to record individual roles.",
      "type": "procedural",
      "date": "1952-02-07 onwards",
      "source": "court"
    },
    {
      "id": "f23",
      "text": "57 accused tried before Sessions Judge Orai under IPC 120B, 148, 201/149, 302/149, 325/149, 452/149; acquitted all on 120B; convicted 37 (9 death, others life under 302/149, etc.); Kamoda Chamar under 325/149.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f24",
      "text": "High Court on appeal: dismissed Baladin's appeal, confirmed convictions/sentences including death under 302/149; acquitted 4 death sentence appellants, life for others; acquitted 20 appellants; confirmed 17 with sentence modifications.",
      "type": "procedural",
      "date": "1954-09-10",
      "source": "court"
    },
    {
      "id": "f25",
      "text": "High Court granted leave to appeal to SC in last line of judgment: 'Leave to appeal to Supreme Court is granted.'",
      "type": "procedural",
      "date": "1954-09-10",
      "source": "court"
    },
    {
      "id": "f26",
      "text": "Defence: complete denial; enmities with refugees; occurrence if any in night by unknowns; false implication due to enmity.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f27",
      "text": "Sessions Judge found 4 women eyewitnesses truthful, police records unfaithful; scrutinized for individual roles.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f28",
      "text": "High Court relied on 4 eyewitnesses but acquitted where names not in SI's record, despite condemning record as unreliable.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the certificate of leave to appeal under Article 134(1)(c) was properly granted by High Court.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether courts below erred in relying on evidence of four eyewitnesses despite variances with investigating Sub-Inspector's record.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether courts below erred in convicting appellants on eyewitness testimony not acted upon for other acquitted accused.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether courts below erred in disbelieving eyewitnesses for some accused with specific roles but accepting for others without specific parts.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether courts below erred in convicting accused without specific overt acts, merely on presence in assembly.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Courts below erred in relying on four eyewitnesses when their court statements varied from Sub-Inspector's record.",
      "supporting_facts": [
        "f22",
        "f27",
        "f28"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Courts below erred in convicting appellants on eyewitnesses not relied for other acquitted accused.",
      "supporting_facts": [
        "f24"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Eyewitness evidence disbelieved for some accused with specific parts should not be accepted for others without specific roles.",
      "supporting_facts": [
        "f28"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Error in convicting without specific overt acts; mere presence does not make member of unlawful assembly.",
      "supporting_facts": [
        "f26"
      ],
      "legal_basis": "Section 142, Indian Penal Code"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Preliminary objection: High Court certificate under Art 134(1)(c) invalid as not exercised judicially per individual accused, no reasons given.",
      "supporting_facts": [
        "f25"
      ],
      "legal_basis": "Article 134(1)(c) Constitution; Nar Singh v. State of U.P."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court certificate invalid: mere 'leave granted' without reasons or indication of outstanding issues; not judicial discretion; appeal not under Art 134(1)(c).",
      "addresses_issue": "i1",
      "key_observation": "High Court must certify fit case with reasons apparent; mechanical grant insufficient."
    },
    {
      "id": "cr2",
      "text": "But grant special leave under Art 136 as fourth ground (mere presence) raises fit case.",
      "addresses_issue": "i5",
      "key_observation": "Mere presence does not make member of unlawful assembly unless overt act or s.142 IPC."
    },
    {
      "id": "cr3",
      "text": "Police records tainted/unreliable; cannot use to discard court testimony; High Court erred in acquitting based on such records despite condemning them.",
      "addresses_issue": "i2",
      "key_observation": "Police statements not substantive evidence; if perfunctory/dishonest, lose value."
    },
    {
      "id": "cr4",
      "text": "Four eyewitnesses reliable; Sessions Judge scrutinized individually; High Court meticulous but erred on police records.",
      "addresses_issue": "i2",
      "key_observation": "In riot cases, distinguish spectators from members."
    },
    {
      "id": "cr5",
      "text": "Common object included killing and destroying evidence; overt acts in disposal make members.",
      "addresses_issue": "i5",
      "key_observation": "Prosecution must prove overt acts given proximity and general enmity."
    },
    {
      "id": "cr6",
      "text": "Uphold convictions where specific roles: Baladin, Parichhat s/o Lallu, Ajodhia, Parichhat s/o Sadhoo (shooting upstairs); Raja Ram (dragged Mela, axe); Uma Charan (sword on Mela, burning); Mahabir (dragged bodies/Mela); Narain Das (inciting); Ramola (false report concealing); Vir Singh/Vira (cart, blood stains, on roof); Mannu Teli (cart).",
      "addresses_issue": "i3",
      "key_observation": "Not mere spectators; leading parts despite some police record gaps."
    },
    {
      "id": "cr7",
      "text": "Acquit Thakur Das, Ishwari Prasad, Mulloo, Jagdish: no specific parts/overt acts; possible spectators.",
      "addresses_issue": "i5",
      "key_observation": "Benefit of doubt."
    },
    {
      "id": "cr8",
      "text": "Jangi: ring-leader, axe on Mela; upheld despite police record gaps.",
      "addresses_issue": "i4",
      "key_observation": "No contradiction with prior statements."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Certificate under Art 134(1)(c) invalid without judicial reasons; appeal lies under Art 136 special leave.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Tainted police records cannot override reliable court testimony of eyewitnesses.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Mere presence in assembly insufficient for conviction under s.149 IPC; requires overt act in furtherance of common object.",
      "resolves_issue": "i5",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Nar Singh v. State of U.P.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Principles on validity of certificate under Art 134(1)(c): must be judicial discretion with reasons."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "120B",
        "148",
        "149",
        "201",
        "302",
        "325",
        "452",
        "142"
      ],
      "relevance": "Charges: conspiracy, unlawful assembly, house trespass, murder, causing evidence to disappear; mere presence not membership unless overt act (s.142)."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "87",
        "88"
      ],
      "relevance": "Used in investigation: warrants of attachment and proclamation."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "134(1)(c)",
        "136(1)"
      ],
      "relevance": "Appeal rights: certificate must be fit case with judicial discretion; special leave granted."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeals allowed for Thakur Das, Ishwari Prasad, Mulloo and Jagdish (acquitted); dismissed for remaining 13 appellants including Jangi; convictions and sentences under ss.148, 302/149, 201/149, 452 IPC upheld (some sentences modified earlier by High Court from death to life).",
    "relief_granted": "Acquittal of 4 appellants",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Mere presence in an assembly does not make such a person a member of an unlawful assembly unless it is shown that he had done something or omitted to do something which would make him a member.\"",
      "speaker": "court",
      "significance": "Core holding on s.149 IPC liability."
    },
    {
      "text": "\"If the police record becomes suspect or unreliable... it loses much of its value and the court... has to weigh the evidence given against him in court.\"",
      "speaker": "court",
      "significance": "Explains treatment of tainted police statements."
    },
    {
      "text": "\"The word 'certifies' is a strong word. It indicates that the High Court must bring its mind to bear on the question and... the reasons for the order must be apparent.\"",
      "speaker": "court",
      "significance": "Invalidates mechanical certificate under Art 134(1)(c)."
    }
  ],
  "_case_id": "1955_26",
  "_label": 0,
  "_text_length": 46144,
  "_extracted_at": "2026-02-10T19:16:21.842021"
}