{
  "metadata": {
    "case_name": "The Collector of Bombay v. Trustees under Exhibit B (Lady Pochkhanawalla and others)",
    "case_year": 1955,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar J."
    ],
    "case_number": "Civil Appeal No. 74 of 1952",
    "date_of_judgment": "1955-02-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Lands situated within the City of Bombay originally known as Foras lands, rights of occupants settled by Bombay Act No. VI of 1851.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Between 1864 and 1867, Government acquired these lands for B.B. & C.I. Railway under Land Acquisition Act No. VI of 1857.",
      "type": "material",
      "date": "1864-1867",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 22-11-1938, lands no longer required for Railway, sold by Governor-General to Lady Pochkhanawalla and others as joint tenants under deed Exhibit A.",
      "type": "material",
      "date": "1938-11-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 28-3-1939, survivor of purchasers conveyed lands in trust under Exhibit B; respondents are trustees appointed under that deed.",
      "type": "material",
      "date": "1939-03-28",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In April 1942, appellant (Collector) acting under Bombay Act No. II of 1876 issued notices to respondents proposing to levy assessment at specified rates.",
      "type": "procedural",
      "date": "1942-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondents replied denying right to assess; instituted suits Nos. 7 and 23 of 1943 before Revenue Judge for declaration of rights.",
      "type": "procedural",
      "date": "1943",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In plaints, respondents alleged under Foras Act maximum assessment 9 reas per burga, no right to enhance; land acquisition extinguished even this; purchased absolutely under Exhibit A, entitled to hold revenue-free.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Revenue Judge held land acquisition vested lands in Government free from liability to pay assessment; transfer under Exhibit A without reservation gave purchasers right to hold without revenue liability; declared no right to levy, notices illegal. Decree dated 17-03-1945.",
      "type": "procedural",
      "date": "1945-03-17",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "High Court of Bombay (Chagla CJ, Bhagwati J concurring) in Appeal from Original Decree No. 274 of 1945: Foras Act imposed specific limit; land acquisition extinguished even that right; transferred as revenue-free. Appeal dismissed. Judgment dated 10-11-1948.",
      "type": "procedural",
      "date": "1948-11-10",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Historical background: Island of Bombay ceded by Portugal to British Crown 1661 as dowry; granted to East India Company 1668; reclamation in 18th century, Foras payments introduced.",
      "type": "background",
      "date": "1661-18th century",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Assessment on Foras lands at 9 reas per burga from 1858 until acquisition, as per Exhibit N.",
      "type": "admitted",
      "date": "1858-1867",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Respondents at all stages claimed immunity based on s.8 of Act II 1876 as superior holders; did not dispute superior holder status until SC arguments.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the lands are liable to be assessed to revenue under s.8 Bombay City Land Revenue Act No. II of 1876, or if respondents have right in limitation thereof.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Effect of Foras Act No. VI of 1851 on right to assess/enhance assessment.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Effect of land acquisition proceedings 1864-67 under Land Acquisition Act No. VI of 1857 on Government's right to levy assessment.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether sale deed Exhibit A dated 22-11-1938 imposes limitation on right to assess.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Respondents are superior holders; no specific right limiting assessment under s.8 Act II 1876 proved; Foras Act conferred permanent tenure but not permanent assessment; right to enhance preserved.",
      "supporting_facts": [
        "f1",
        "f12"
      ],
      "legal_basis": "Bombay City Land Revenue Act No. II of 1876 s.8; Shapurji Jivanji v. Collector of Bombay (1885 ILR 9 Bom 483)"
    },
    {
      "id": "pa2",
      "text": "Land acquisition under Act VI 1857 only extinguished private interests, not Government's prerogative right to assess.",
      "supporting_facts": [
        "f2",
        "f8"
      ],
      "legal_basis": "Land Acquisition Act No. VI of 1857 s.VIII; Govt of Bombay v. Esupali Salebhai (1909 ILR 34 Bom 618); Deputy Collector Calicut v. Aiyavu Pillay (1911 9 IC 341)"
    },
    {
      "id": "pa3",
      "text": "Exhibit A absolute sale but expressly subject to all cesses, taxes, rates, assessments; no reservation needed for sovereign right; cannot imply revenue-free.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Crown Grants Act No. XV of 1895 s.3 (limited scope)"
    },
    {
      "id": "pa4",
      "text": "Foras tenure extinguished by acquisition; lands sold as freehold, not Foras lands; Foras Act repealed 1870.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Land Acquisition Act No. VI of 1857 s.VIII; Bombay Act No. XIV of 1870"
    },
    {
      "id": "pa5",
      "text": "New contention in SC that respondents not superior holders barred as inconsistent with prior stand, requires new facts.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Under Foras Act, maximum assessment 9 reas per burga, no right to enhance.",
      "supporting_facts": [
        "f1",
        "f12"
      ],
      "legal_basis": "Bombay Foras Act No. VI of 1851 s.2"
    },
    {
      "id": "ra2",
      "text": "Land acquisition extinguished Government's right to assess as an 'interest' in land; compensation paid implicitly.",
      "supporting_facts": [
        "f2",
        "f8"
      ],
      "legal_basis": "Land Acquisition Act No. VI of 1857 s.VIII; Exhibit P"
    },
    {
      "id": "ra3",
      "text": "Absolute sale by Governor-General under Exhibit A conveys revenue-free; no reservation.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Crown Grants Act No. XV of 1895 s.3; Dadoba v. Collector of Bombay (1901 ILR 25 Bom 714)"
    },
    {
      "id": "ra4",
      "text": "In SC, lands held by outright sale, not as superior holders under derivative tenure from Provincial Govt.",
      "supporting_facts": [
        "f3",
        "f13"
      ],
      "legal_basis": "Bombay City Land Revenue Act No. II of 1876 s.3(4), s.8"
    },
    {
      "id": "ra5",
      "text": "Foras tenure incident annexed to lands, survives acquisition and sale; saved by repeal.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": "Bombay Foras Act No. VI of 1851; Bombay Act No. XIV of 1870 s.1"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Proceed on basis respondents are superior holders under s.3(4) Act II 1876; burden on them to prove limitation under s.8 per Privy Council.",
      "addresses_issue": "i1",
      "key_observation": "New contention on superior holder status barred."
    },
    {
      "id": "cr2",
      "text": "Foras Act s.2 extinguishes Company reversion, saves rents 'now severally payable' which continue payable; limits to then-current 9 reas per burga.",
      "addresses_issue": "i2",
      "key_observation": "Words 'now severally payable and which shall continue' impose specific limit despite inartistic drafting."
    },
    {
      "id": "cr3",
      "text": "Land acquisition vests land in Govt free from all OTHER estates/rights/interests; Govt's prerogative right to assess not acquired, outside private interests.",
      "addresses_issue": "i3",
      "key_observation": "No valuation/compensation for Govt right in award; prerogative paramount to ownership."
    },
    {
      "id": "cr4",
      "text": "Exhibit A absolute conveyance subject to all cesses/taxes/assessments; no recital revenue-free; s.3 Crown Grants Act saves express limitations, none here.",
      "addresses_issue": "i4",
      "key_observation": "Clause expressly subjects to assessments; Dadoba distinguished as estoppel case."
    },
    {
      "id": "cr5",
      "text": "Foras tenure extinguished by acquisition; lands sold freehold; repeal of Foras Act 1870, no subsisting rights saved.",
      "addresses_issue": "i1",
      "key_observation": "Tenure incapable of revival; no inseverable incident survives absolute vesting in Govt."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Respondents have no right in limitation of appellant's right to assess under s.8 Act II 1876.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Foras Act limited assessment to 9 reas per burga at that time.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Land acquisition did not extinguish Govt's right to assess.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "Exhibit A does not grant revenue-free holding.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Goswamini Shri Kamala Vahooji v. Collector of Bombay",
      "citation": "1937 L.R. 64 I.A. 334",
      "treatment": "followed",
      "relevance": "s.8 allows plea of no right to assess; burden on superior holder to prove limitation."
    },
    {
      "case_name": "Shapurji Jivanji v. The Collector of Bombay",
      "citation": "1885 I.L.R. 9 Bom. 483",
      "treatment": "referred",
      "relevance": "Govt right to enhance Foras assessments under s.8."
    },
    {
      "case_name": "Government of Bombay v. Esupali Salebhai",
      "citation": "1909 I.L.R. 34 Bom. 618",
      "treatment": "followed",
      "relevance": "Govt need not acquire/pay for own interest in land acquisition."
    },
    {
      "case_name": "Deputy Collector, Calicut Division v. Aiyavu Pillay",
      "citation": "1911 9 I.C. 341",
      "treatment": "followed",
      "relevance": "Land Acquisition Act does not contemplate acquiring Govt's own interest."
    },
    {
      "case_name": "Dadoba v. Collector of Bombay",
      "citation": "1901 I.L.R. 25 Bom. 714",
      "treatment": "distinguished",
      "relevance": "Estoppel/collateral contract from correspondence; not absolute sale implying revenue-free."
    },
    {
      "case_name": "Thakur Jagannath Baksh Singh v. The United Provinces",
      "citation": "1946 F.L.J. 88",
      "treatment": "followed",
      "relevance": "s.3 Crown Grants Act read in context of preamble, limited to T.P. Act doubts."
    },
    {
      "case_name": "Collector of Bombay v. Municipal Corporation of the City of Bombay",
      "citation": "1952 S.C.R. 43",
      "treatment": "distinguished",
      "relevance": "Immunity as incident of prescriptive title; not surviving Govt acquisition."
    },
    {
      "case_name": "Naoroji Beramji v. Rogers",
      "citation": "4 Bom. H.C.R. 1",
      "treatment": "referred",
      "relevance": "Explanation of 'Foras' meaning."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay City Land Revenue Act No. II of 1876",
      "sections": [
        "s.3(4)",
        "s.8"
      ],
      "relevance": "Authority to levy assessment on superior holders; limitation if specific right proved."
    },
    {
      "name": "Bombay Foras Act No. VI of 1851",
      "sections": [
        "Preamble",
        "s.2",
        "s.4"
      ],
      "relevance": "Extinguished Company rights, saved then-current assessment as limit."
    },
    {
      "name": "Land Acquisition Act No. VI of 1857",
      "sections": [
        "s.VIII"
      ],
      "relevance": "Vesting free from other interests; Govt assessment right not extinguished."
    },
    {
      "name": "Crown Grants Act No. XV of 1895",
      "sections": [
        "s.2",
        "s.3"
      ],
      "relevance": "Provisions/restrictions in Crown grants take effect per tenor; limited to T.P. Act issues."
    },
    {
      "name": "Bombay Act No. XIV of 1870",
      "sections": [
        "s.1"
      ],
      "relevance": "Repeal of Foras Act; saves accrued rights, none subsisting post-acquisition."
    },
    {
      "name": "Land Acquisition Act No. I of 1894",
      "sections": [
        "s.3(b)",
        "s.9",
        "s.11",
        "s.16"
      ],
      "relevance": "Analogous; confirms only private interests acquired."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allows the appeal by special leave, reversing High Court and Revenue Judge; holds respondents have no right limiting Government's assessment under s.8 Act II 1876; lands liable to assessment at Collector's discretion.",
    "relief_granted": "Declaration that appellant has right to levy assessment without limitation.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"When there is a right on the part of the superior holder in limitation of the right of Government... the assessment shall not exceed such specific limit.\"",
      "speaker": "court",
      "significance": "Quotes s.8 Act II 1876 central to controversy."
    },
    {
      "text": "\"the lands vest in the Government free from all other estates, rights, titles and interests.\"",
      "speaker": "court",
      "significance": "Key to holding land acquisition did not affect Govt assessment right."
    },
    {
      "text": "\"the true import of the clause... is that while... the right of the Government to recover the assessment is saved, it is... limited to the amount then payable.\"",
      "speaker": "court",
      "significance": "Interprets Foras Act s.2 as limiting to 9 reas per burga."
    },
    {
      "text": "\"the right to impose a tax on land is a prerogative right of the Crown, paramount to the ownership over the land and outside it.\"",
      "speaker": "court",
      "significance": "Crux distinguishing Govt right from private interests."
    }
  ],
  "_case_id": "1955_122",
  "_label": 1,
  "_text_length": 41545,
  "_extracted_at": "2026-02-10T19:17:42.755127"
}