{
  "metadata": {
    "case_name": "Appellant (Parcel Porter) v. State of Uttar Pradesh",
    "case_year": 1955,
    "court": "Supreme Court of India",
    "judges": [
      "Jagannadhadas J."
    ],
    "case_number": "Criminal Appeal No. 22 of 1954",
    "date_of_judgment": "1955-03-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Three persons including the appellant were parcel porters at the railway station Manikpur in the district Banda of Uttar Pradesh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On the night of the 18th June, 1952, they were found by two watchmen of the Watch and Ward staff attached to the railway station, committing theft of certain packets of biscuits by breaking open a railway parcel containing those packets.",
      "type": "material",
      "date": "1952-06-18",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "First information lodged before the Sub-Inspector, Railway Police, by one Ram Prasad, Head Watchman.",
      "type": "procedural",
      "date": "1952-06-18",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Railway Police filed charge-sheet under section 379 of the Indian Penal Code on the 20th June, 1952.",
      "type": "procedural",
      "date": "1952-06-20",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Case taken cognizance of by the Railway Magistrate, Manikpur.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "All three accused pleaded guilty.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Convicted by the Magistrate on the 15th July, 1952, and sentenced to a fine of Rs. 25 each.",
      "type": "procedural",
      "date": "1952-07-15",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Present appellant filed a revision to the Sessions Judge of Banda arguing that under the U. P. Panchayat Raj Act, 1947, the case should have been tried by the Panchayati Adalat and Railway Magistrate had no jurisdiction.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Sessions Judge accepted the contention and made a reference to the High Court for quashing the conviction and sentence.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court single judge declined to accept the reference on the ground that revisional jurisdiction is discretionary, but granted certificate for appeal to Supreme Court dated 27th October 1953.",
      "type": "procedural",
      "date": "1953-10-27",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Theft of property involved valued at Rs. 3.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Offence committed within limits of Manikpur.",
      "type": "material",
      "date": "1952-06-18",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "One of the three accused, Tulsi, belongs to Jubbalpore in Madhya Pradesh.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Railway Magistrate had jurisdiction to try the case under section 379 IPC given the provisions of the U.P. Panchayat Raj Act, 1947, particularly where one accused resides outside the State.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "By virtue of the U.P. Panchayat Raj Act, 1947, the present case should have been tried by the Panchayati Adalat and the Railway Magistrate had no jurisdiction.",
      "supporting_facts": [
        "f2",
        "f4",
        "f11",
        "f12"
      ],
      "legal_basis": "U.P. Panchayat Raj Act, 1947 sections 51, 52, 55"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Panchayati Adalat could not constitute a valid bench due to one accused from outside the State, making rule 84 ultra vires, thus ordinary court jurisdiction not barred.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "U.P. Panchayat Raj Act, 1947 section 49(4), rule 84; CrPC section 5"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Explained scheme of U.P. Panchayat Raj Act, 1947: Gaon Sabhas, circles, Panchayati Adalats under sections 3,42,43,44; criminal jurisdiction under section 52(1) includes theft under IPC s.379 up to Rs.50; institution before Sarpanch s.51(1); no court cognizance without s.85 order s.55.",
      "addresses_issue": "i1",
      "key_observation": "Panchayati Adalat jurisdiction exercisable only by bench of 5 Panches under s.49 with specific composition for police cases."
    },
    {
      "id": "cr2",
      "text": "In this police case, bench requires one Panch from Gaon Sabha where offence committed (Manikpur), one where accused resides, three others; impossible due to Tulsi from Madhya Pradesh.",
      "addresses_issue": "i1",
      "key_observation": "Rule 84 for special benches ultra vires s.49(4) insofar as it applies to parties outside the State."
    },
    {
      "id": "cr3",
      "text": "No competent bench could be constituted under s.49; s.55 bar applies to case as whole only where valid machinery exists; CrPC s.5 jurisdiction comprehensive and not excluded where limited jurisdiction inoperative.",
      "addresses_issue": "i1",
      "key_observation": "Railway Magistrate had jurisdiction to try the case."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rule 84 of U.P. Panchayat Raj Rules ultra vires section 49(4) insofar as it relates to constitution of special bench where one party from outside the State.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Where no valid machinery for Panchayati Adalat to try case due to inability to form bench, section 55 does not bar jurisdiction of ordinary criminal court under CrPC s.5.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Railway Magistrate had jurisdiction to try the case.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 379"
      ],
      "relevance": "Offence of theft charged; cognizable by Panchayati Adalat if value <= Rs.50"
    },
    {
      "name": "U.P. Panchayat Raj Act, 1947",
      "sections": [
        "Section 3",
        "Section 42",
        "Section 43",
        "Section 44",
        "Section 49",
        "Section 51",
        "Section 52",
        "Section 55",
        "Section 85"
      ],
      "relevance": "Scheme for Panchayati Adalats' criminal jurisdiction; bar on ordinary courts; bench constitution; analysed for validity and applicability"
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "Section 5"
      ],
      "relevance": "Comprehensive jurisdiction of ordinary courts not excluded where special court machinery inoperative"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court held that the Railway Magistrate had jurisdiction to try the case as the Panchayati Adalat could not constitute a valid bench due to one accused residing outside Uttar Pradesh, rendering rule 84 ultra vires in that respect and lifting the bar under section 55 of the U.P. Panchayat Raj Act. The appeal against the High Court's refusal to quash the conviction was dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We are clearly of the opinion that rule 84 in so far as it relates to the constitution of a special bench where one of the parties belongs to a place outside the State is ultra vires.",
      "speaker": "court",
      "significance": "Core holding on invalidity of rule allowing jurisdiction over out-of-state accused"
    },
    {
      "text": "Exclusion of jurisdiction of a court of general jurisdiction, can be brought about by the setting up of a court of limited jurisdiction... only if the vesting and the exercise of that limited jurisdiction is clear and operative.",
      "speaker": "court",
      "significance": "Principle applied to uphold ordinary court jurisdiction"
    }
  ],
  "_case_id": "1955_10",
  "_label": 0,
  "_text_length": 14532,
  "_extracted_at": "2026-02-10T19:16:06.915830"
}