{
  "metadata": {
    "case_name": "Committee of Management of Sikh Gurdwaras within the Municipal limits of Amritsar except the Gurdwara Sri Akal Takhat Sahib, Amritsar v. Respondents",
    "case_year": 1955,
    "court": "Supreme Court of India",
    "judges": [
      "JAGANNADHADAS J."
    ],
    "case_number": "Civil Appeal No. 11 of 1954",
    "date_of_judgment": "1955-03-24"
  },
  "facts": [
    {
      "id": "f1",
      "text": "After the Act was passed and within one year of its commencement the then existing statutory Shiromani Gurdwara Parbandhak Committee filed a list under section 3 of the Act claiming the suit properties and certain other items attached thereto as belonging to the Gurdwara Harmandir Sahib.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "These properties comprised two items called Bunga Sarkar and Bunga Mai Mallan and the shops appurtenant to each of them.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Objections were filed to this list by way of two applications under section 8 of the Act claiming these as private properties: one by Sardar Balwant Singh dated the 8th March, 1928 and the other by Sardar Raghbir Singh dated the 10th March, 1928.",
      "type": "procedural",
      "date": "1928-03-08",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Sardar Raghbir Singh claimed the whole of Bunga Sarkar and its appurtenant shops as well as 1/3rd of the Bunga Mai Mallan and of the appurtenant shops. Sardar Balwant Singh's claim was confined to 1/3rd share in Bunga Mai Mallan and in the appurtenant shops.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "These two applications were forwarded under section 14 of the Act to the Gurdwara Tribunal for its decision.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The parties to these proceedings entered into a compromise on the 6th February, 1930. There were two compromises one relating to each of the applications. The net effect of the compromises was that some out of the items claimed were admitted to be the private property of the respective claimants and the rest as wakf bungas for the Yatries to Sri Darbar Sahib, that the personal properties were to remain in the management of the claimants, their heirs and representatives as such wakf with certain stipulations as to how that management was to be carried on.",
      "type": "admitted",
      "date": "1930-02-06",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Tribunal disposed of the two applications before them in terms of these compromises.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Quite independently of these proceedings before the Tribunal, and prior to the filing of the list under section 3 and of the objections under section 8 above referred to, there had been filed a petition under section 7 of the Act, signed by 55 Sikhs, claiming these very properties as being in themselves a Sikh Gurdwara by name Bunga Sarkar Maharaja Ranjit Singh Saheb and enclosing a list of properties as belonging thereto under section 7(2) of the Act.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The petition under section 7 was in the usual course followed by a notification issued by the Government on the 18th February, 1930, under section 7(3) of the Act.",
      "type": "procedural",
      "date": "1930-02-18",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "This resulted in 1) an objection under section 8 by the Granthis objecting that this was not a Sikh Gurdwara, and 2) two other objections by Sardar Raghbir Singh and Sardar Balwant Singh, already previously above referred to, under section 10 of the Act claiming the properties as their own and objecting to the claim made that they were Sikh Gurdwaras. These objections were filed on the 5th April, 1930.",
      "type": "procedural",
      "date": "1930-04-05",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "These objections under sections 8 and 10 and presumably also the petition under section 7 were forwarded to the Tribunal for its decision under section 14 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The petition under section 8 filed by the Granthis was contested by the Shiromani Gurdwara Parbandhak Committee (Statutory) and after recording some evidence, the Tribunal came to the conclusion that Bunga Sarkar was a Sikh Gurdwara and declared it as such on the 28th August, 1935.",
      "type": "procedural",
      "date": "1935-08-28",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "On the objections under section 10 notices were given to the Committee of Management as well as to the Shiromani Gurdwara Parbandhak Committee but they declined to become parties to it.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The contest under section 10 of the Act was only as between the claimants and some of the Sikhs who filed the petition under section 7.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "At the hearing before the Tribunal both sides relied upon the previous compromises in support of their respective claims.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The Tribunal by its decision dated the 4th November, 1935, decided that the properties which had been declared as the properties of Sardar Raghbir Singh and Sardar Balwant Singh respectively, should be declared to be their personal properties and that the rest of the properties claimed to belong to Bunga Sarkar and Bunga Mai Mallan should be declared to be Sikh Gurdwaras and as properties appurtenant thereto. It was also declared that these two Gurdwaras and the properties held to be appurtenant to them should vest in the management of Sardar Raghbir Singh and Sardar Balwant Singh by virtue of and as per terms of the compromises.",
      "type": "material",
      "date": "1935-11-04",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "As against these decrees two appeals were presented by the Sikh worshippers to the High Court and the only question that ultimately appears to have been raised was that the direction given by the Tribunal to the effect that the properties should remain in the management of the claimants, Sardar Raghbir Singh and Sardar Balwant Singh, was illegal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "The High Court without giving any decision on the legal question so raised was of the opinion that it was not function of the Sikh Gurdwara Tribunal to pass an order on an application made under section 10 by the claimants that the claimants should manage the properties appurtenant to the Gurdwaras by virtue of the compromises. They thought that the question of right of management should be left open in these proceedings and that the directions in the decree of the Tribunal relating to the management should be deleted therefrom and that the rest of the decrees of the Sikh Gurdwara Tribunal is to stand.",
      "type": "material",
      "date": "1936-06-16",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "High Court expressed: 'That portion of the decree of the Sikh Gurdwara s Tribunal which has declared the respondents right to manage the Gurdwaras and the properties appended thereto shall form no part of the decree granted by the Tribunal the rest of the decree of the Sikh Gur- dwaras Tribunal stands, that is to say, the properties which have been declared to be the personal properties of Sardar Raghbir Singh and Sardar Balwant Singh shall remain their properties and the properties which have been declared to be appended to the two Gurdwaras shall remain the properties of the two Gurdwaras.'",
      "type": "material",
      "date": "1936-06-16",
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "The High Court also added that though the proceedings mentioned the existence of two Gurdwaras by name Bunga Sarkar and Bunga Mai Mallan, the real position seemed to be that there was only one Gurdwara, viz. Bunga Sarkar, and that Bunga Mai Mallan had no separate existence as a Gurdwara but was a well-known part of Bunga Sarkar.",
      "type": "material",
      "date": "1936-06-16",
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "This was followed by notification No. 9-G dated the 3rd March, 1937, under section 17 of the Act which is the foundation of the present suit.",
      "type": "procedural",
      "date": "1937-03-03",
      "source": "court"
    },
    {
      "id": "f22",
      "text": "The plaint was filed under section 25-A of the Sikh Gurdwaras Act, 1925, for possession of certain properties situated in Amritsar, marked and bounded as specified in the plaint and purporting to have been declared as a Sikh Gurdwara by the Government of Punjab under section 17 of the Act by means of the notification No. 9-G dated the 3rd March, 1937.",
      "type": "procedural",
      "date": "1938-02-25",
      "source": "petitioner"
    },
    {
      "id": "f23",
      "text": "The Sikh Gurdwara Tribunal dated the 19th December, 1940, dismissing the plaintiffs suit.",
      "type": "procedural",
      "date": "1940-12-19",
      "source": "lower_court"
    },
    {
      "id": "f24",
      "text": "High Court of Punjab at Simla in Regular First Appeal No. 73 of 1941 affirmed the decree dated the 20th day of June 1950.",
      "type": "procedural",
      "date": "1950-06-20",
      "source": "lower_court"
    },
    {
      "id": "f25",
      "text": "Appeal on leave granted by the High Court of Punjab.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f26",
      "text": "The present plaintiff which is the Committee of Management for all the Gurdwaras situated within the Municipal limits of Amritsar, except the Gurdwara Sri Akal Takht Sahib was constituted prior to the year 1930 and was in fact functioning at the date of the compromises in the section 5 proceedings dated the 6th February, 1930.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the proceedings under section 10 resulted in any specific declaration that the properties constituted a Sikh Gurdwara.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether the Tribunal had jurisdiction in disposing of an application under section 10 of the Act, to give a positive declaration that the property in question is a Sikh Gurdwara.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether any such decision would be contrary to section 37 of the Act and also contrary to the principles of res judicata.",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether the conduct of the Gurdwara Parbandhak Committee and the concerned Committee of Management in entering into the compromises in the proceedings under section 5 without disclosing the pendency of the petition under section 7, declining to be parties in section 10 proceedings, was fraudulent, estopping them from relying on the decree.",
      "framed_by": "respondent"
    },
    {
      "id": "i5",
      "text": "Whether the suit under section 25-A lies only where the decision on an objection under section 10 is reached after the notification that the Gurdwara is a Sikh Gurdwara is published.",
      "framed_by": "respondent"
    },
    {
      "id": "i6",
      "text": "Whether the suit under section 25-A was barred by limitation.",
      "framed_by": "respondent"
    },
    {
      "id": "i7",
      "text": "Whether the whole appeal abated in the High Court due to death of Sardar Balwant Singh without bringing legal representatives on record.",
      "framed_by": "respondent"
    },
    {
      "id": "i8",
      "text": "Whether section 7 of the Act assumes the existence of a Gurdwara and a notification issued under section 7(3) without there being in fact a Gurdwara in existence would be ultra vires.",
      "framed_by": "court"
    },
    {
      "id": "i9",
      "text": "What is the date of the 'decision' and 'constitution of the Committee' for limitation under section 25-A(1).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Whatever may be the position with reference to the earlier compromises arrived at between the parties in the proceedings under section 5 of the Act, the later proceedings with reference to those very properties under section 10 of the Act resulted in the judgment of the High Court dated the 16th June 1936, which is conclusive and binding. By virtue of the said judgment and the notification dated the 3rd March, 1937, following thereupon, the plaintiff is entitled to possession of the properties by virtue of section 25-A of the Act.",
      "supporting_facts": [
        "f16",
        "f18",
        "f19",
        "f21"
      ],
      "legal_basis": "Section 25-A, Sikh Gurdwaras Act, 1925"
    },
    {
      "id": "pa2",
      "text": "The Committee becomes concerned with the suit Gurdwara only from the date when the notification under section 17 is issued, i.e., from the 3rd March, 1937, and that, therefore, the plaintiff had one year from that date for the filing of the suit.",
      "supporting_facts": [
        "f21",
        "f22",
        "f26"
      ],
      "legal_basis": "Sections 85, 86, 88, Sikh Gurdwaras Act, 1925"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The proceedings under section 10 did not result in any specific declaration in favour of the Committee that the properties in dispute in the present suit constituted a Sikh Gurdwara or belong to a Sikh Gurdwara. No such declaration can be gathered from the decision of the Tribunal dated the 4th November, 1935, or from that of the High Court on appeal dated the 16th June, 1936.",
      "supporting_facts": [
        "f16",
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The Tribunal had no jurisdiction in disposing of an application under section 10 of the Act, to give a positive declaration that the property in question is a Sikh Gurdwara. Its only function was to decide whether or not the properties claimed were the private properties of the claimants.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "Section 10, Sikh Gurdwaras Act, 1925"
    },
    {
      "id": "ra3",
      "text": "Any such decision would be contrary to section 37 of the Act and also contrary to the principles of res judicata and would be, therefore, a nullity on that ground.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Section 37, Sikh Gurdwaras Act, 1925; res judicata"
    },
    {
      "id": "ra4",
      "text": "The conduct of the Gurdwara Parbandhak Committee and the concerned Committee of Management, in entering into the compromises in the proceedings under section 5 of the Act without disclosing the pendency of the petition filed by the 55 Sikhs under section 7 of the Act, followed up by their declining to be made parties in the section 10 proceedings and in virtually promoting the contest of the proceedings under sections 8 and 10, was fraudulent. They are accordingly estopped from relying on the decree obtained under section 10 proceedings.",
      "supporting_facts": [
        "f6",
        "f8",
        "f13"
      ],
      "legal_basis": "estoppel"
    },
    {
      "id": "ra5",
      "text": "The suit under section 25-A lies only where the decision on an objection under section 10(1) is reached after the notification that the Gurdwara is a Sikh Gurdwara is published since the section refers to 'a decision in favour of a Notified Sikh Gurdwara' implying the pre-existence of such notification.",
      "supporting_facts": [
        "f9",
        "f21"
      ],
      "legal_basis": "Section 25-A, Sikh Gurdwaras Act, 1925"
    },
    {
      "id": "ra6",
      "text": "The suit under section 25-A was barred by limitation.",
      "supporting_facts": [
        "f18",
        "f22"
      ],
      "legal_basis": "Section 25-A(1), Sikh Gurdwaras Act, 1925"
    },
    {
      "id": "ra7",
      "text": "The whole appeal abated in the High Court inasmuch as one of the respondents, Sardar Balwant Singh died during the pendency of the appeal. His legal representatives were not brought on record in time.",
      "supporting_facts": [
        "f24"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The date of the decision in this case must be taken to be the date when the High Court on appeal disposed of the proceedings under section 10, i.e., the 16th June, 1936. The present suit has been filed on the 25th February, 1938, i.e., clearly beyond one year of the decision.",
      "addresses_issue": "i6",
      "key_observation": "Date of decision is 16 Jun 1936; suit filed 25 Feb 1938 >1 year."
    },
    {
      "id": "cr2",
      "text": "The question is whether the suit can be said to have been within one year from the date of the constitution of the Committee of the Gurdwara concerned. The present plaintiff Committee was constituted prior to 1930 and functioning by Feb 1930. By virtue of section 85(2), this committee also became the Committee concerned with the suit Gurdwara.",
      "addresses_issue": "i9",
      "key_observation": "Committee pre-existed; s.85 applies."
    },
    {
      "id": "cr3",
      "text": "Contention that this Committee becomes concerned only from date of s.17 notification (3 Mar 1937) is untenable. Section 86 relates to other Gurdwaras; s.88(2) deems date of notification of members as constitution date. Cannot impute other date.",
      "addresses_issue": "i9",
      "key_observation": "Deeming provision in s.88(2) controls; no legislating to add exception."
    },
    {
      "id": "cr4",
      "text": "No hardship as s.25A is enabling cheap remedy; notification issued within 9 months; Committee had time to act.",
      "addresses_issue": "i6",
      "key_observation": "Suit barred by limitation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The present suit under section 25-A is barred by limitation and on this ground the appeal must fail.",
      "resolves_issue": "i6",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Date of constitution of Committee under s.85 is date of publication of notification of its members per s.88(2), not date of s.17 notification.",
      "resolves_issue": "i9",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Sikh Gurdwaras Act, 1925 (Punjab Act VIII of 1925)",
      "sections": [
        "3",
        "5",
        "7",
        "8",
        "10",
        "14",
        "17",
        "25-A",
        "37",
        "85",
        "86",
        "88"
      ],
      "relevance": "Governs claims, objections, notifications, declarations, management committees, and suits for possession; limitation under s.25-A(1) from date of decision or constitution of Committee, whichever later."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court held that the suit under section 25-A was barred by limitation as it was filed more than one year after the High Court's decision dated 16 June 1936, and the concerned Committee was constituted prior to 1930 under section 85, with no alteration for section 17 notification date. Appeal dismissed without opining on other contentions.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"We are clearly of the opinion that the present suit under section 25-A is barred by limitation and on this ground the appeal must fail.\"",
      "speaker": "court",
      "significance": "Final holding dismissing the appeal on limitation."
    },
    {
      "text": "\"In the face of this deeming provision relating to these committees, it is not permissible to impute to such a Committee any other date as the date of its constitution for any of the purposes of the Act.\"",
      "speaker": "court",
      "significance": "Interprets s.88(2) strictly against petitioner's limitation argument."
    }
  ],
  "_case_id": "1955_116",
  "_label": 0,
  "_text_length": 21794,
  "_extracted_at": "2026-02-08T22:14:10.462797"
}