{
  "metadata": {
    "case_name": "The Mill v. Poona Girni Kamagar Union",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "GOVINDA MENON J."
    ],
    "case_number": "Civil Appeal No. 323 of 1955",
    "date_of_judgment": "1956-10-31"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant (The Mill) is a limited company owning and possessing a Cotton Textile Spinning and Weaving Mill situated in Poona, employing a large number of workmen who have a union of theirs.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant was running 580 looms, for working which one weaver had been allotted at the rate of two looms.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On August 29, 1951, the Management issued a notice to the effect that from September 1, 1951, it was desired to carry on an experiment of four looms to a weaver for a period of 2 months, on 16 looms.",
      "type": "material",
      "date": "1951-08-29",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The object of this notice was ostensibly to introduce rationalization or rather efficiency system of work, if and when the suggested experiment proved successful.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On September 4, 1951, the Secretary of the Union wrote to the Manager of the appellant Mill intimating that under the Bombay Industrial Relations Act the Management could not legally introduce any change in the existing system of working without first giving notice of the change in the prescribed form to the representatives of the Union and workers and without going through the other procedure prescribed by the Act.",
      "type": "material",
      "date": "1951-09-04",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The notice also stated that the introduction of the new system would affect the workers wages and cause great hardship and that if anything untoward happened, the blame would be wholly on the management.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Four workers volunteered to work the experiment and started working accordingly on the 16 looms on September 6, 1951, whereupon the other workmen raised an objection and the four loyal workmen were prevented from continuing with the experimental work.",
      "type": "material",
      "date": "1951-09-06",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The second shift among the workmen also refused to work with the result that there was a complete strike in the Mills between the 6th and the 26th of September, 1951.",
      "type": "material",
      "date": "1951-09-06 to 1951-09-26",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On September 10, 1951 the appellant filed an application under sections 78 and 97 of the Bombay Industrial Relations Act, 1946 (Bom. XI of 1947), praying that the strike resorted to by the weavers working on both the shifts commencing on September 6, 1951, and continuing till the presentation of the application be declared illegal being in contravention of the provisions of the said Act.",
      "type": "procedural",
      "date": "1951-09-10",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "On September 16, 1951 the Vice-President of the Mill Mazdoor Sabha filed a written statement in answer to the above complaint stating that the workers did not strike work in contravention of the Bombay Industrial Relations Act and that the weavers never refused to do their proper and usual work but refused only to do the illegal work insisted on them by the employers in other words, they were agreeable to have two looms per weaver and not to work the attempted experiment.",
      "type": "procedural",
      "date": "1951-09-16",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Within three days of the filing of the above written statement, two of the workers filed an application under sections 78 and 98 of the Bombay Industrial Relations Act before the same Labour Court against the Management praying for a declaration that the action of the Management had resulted in an illegal lockout in contravention of the Act, and, therefore, the Management should be ordered to withdraw the said illegal change.",
      "type": "procedural",
      "date": "1951-09-19 approx",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "The Labour Court at Bombay heard both the applications together and by a combined order dated September 26, 1951, held that since the Management had not compelled any one to accept any work, their action could not be considered an illegal lockout. At the same time, it held that the workers did not create a situation amounting to an illegal strike. The result of these findings was the negation of the grant of the prayers contained in the respective applications, but in addition, the court declared that the action of the Management was an illegal change and, therefore, the notice whereby the experiment was attempted to be tried, should be withdrawn.",
      "type": "procedural",
      "date": "1951-09-26",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The Management having been aggrieved by the declaration that their action amounted to an illegal change filed an appeal before the Labour Appellate Tribunal at Bombay (Appeal No. 293 of 1951) upon which the learned Judges of the Labour Appellate Tribunal took the view that the strike by the workmen was illegal. They also concluded that there was no lockout on the part of the Management. That being the case, the order of the Labour Court declaring that there was an illegal change was set aside with the declaration that the strike in question was illegal with the necessary consequences.",
      "type": "procedural",
      "date": "1952-09-04",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "In order to get the said order of the Labour Appellate Tribunal quashed, an application for a writ of certiorari under Arts. 226 and 227 of the Constitution was filed by the two of the workers before the High Court of Bombay where Chagla C.J. and Dixit J., took the view that since the decision of the Appellate Tribunal was erroneous, the same should be quashed, with the result that the decision of the Labour Court was upheld.",
      "type": "procedural",
      "date": "1953-07-02",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "On July 20, 1954, the High Court of Judicature at Bombay granted a certificate of fitness under Art. 133(1)(c) of the Constitution that the judgment dated July 2, 1953, passed in Special Civil Application No. 159 of 1953, was a fit one for appeal to the Supreme Court.",
      "type": "procedural",
      "date": "1954-07-20",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "The appellant had agreed, while asking for a certificate from the Bombay High Court for leave to appeal to the Supreme Court, to pay the taxed costs of the respondents in one set.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the strike commenced and continued from September 6 to September 26, 1951, was illegal under section 97(1)(c) of the Bombay Industrial Relations Act, 1946.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under s. 97(1)(c) a strike shall be illegal if it is commenced or continued only for the reason that the employer has not carried out the provisions of any standing order or has made an illegal change; if a strike is illegal when it is commenced or continued only for the reason that the employer has made an illegal change, a fortiori it must be illegal when it is commenced or continued for a legal change.",
      "supporting_facts": [
        "f3",
        "f8"
      ],
      "legal_basis": "Section 97(1)(c) Bombay Industrial Relations Act, 1946"
    },
    {
      "id": "pa2",
      "text": "The true scope and effect of cl. (c) is this: the word 'only' occurring in the clause goes with the word 'reason' and if the strike is commenced or continued for the only reason that the employer has made an illegal change, it shall be illegal. The test is not whether there was a legal or illegal change in fact but what was the reason for which the employees went on strike.",
      "supporting_facts": [
        "f5",
        "f11"
      ],
      "legal_basis": "Section 97(1)(c) Bombay Industrial Relations Act, 1946"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "There is a common law right for an employee to stop work and that it is only by statutory prohibition that certain strikes have been made illegal in the interest of labour relations. Since there had been no illegal change effected by the employer, the strike in question did not come within the ambit of s. 97.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Section 97 Bombay Industrial Relations Act, 1946"
    },
    {
      "id": "ra2",
      "text": "The workmen have the right to go on strike as a means of collective bargaining against any measure adopted by the employer which the workmen may consider to be detrimental to their interests, provided the strike does not come within the prohibited ambit of s. 97.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Bombay Industrial Relations Act, 1946"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is unnecessary to decide whether there is a common law right of an employee to go on strike because the second argument with regard to the construction of s. 97(1)(c) is correct and should prevail.",
      "addresses_issue": "i1",
      "key_observation": "The true test was to find out the reason for which the strike was commenced or continued."
    },
    {
      "id": "cr2",
      "text": "The workmen themselves came to court with the plea that the action of the employer amounted to an illegal change. In their application to the Labour Court, they said that the opponent be ordered to withdraw the said illegal change. It is obvious, therefore, that the workmen in this case struck work only for the reason that the change or experiment made by the appellant employer was an illegal change. The action of the workmen, therefore, came within the express terms of s. 97(1)(c) of the Act.",
      "addresses_issue": "i1",
      "key_observation": "The relevant consideration with regard to s. 97(1)(c) is the reason for which the strike is commenced or continued."
    },
    {
      "id": "cr3",
      "text": "It is immaterial whether the change is subsequently found by the Labour Court to be a legal change.",
      "addresses_issue": "i1",
      "key_observation": "If the workmen commence or continue a strike for the only reason that the employer has made an illegal change, they come within the express terms of s. 97(1)(c)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "On a proper interpretation of s. 97(1)(c) of the Bombay Industrial Relations Act, 1946, the strike which was commenced and continued from September 6, to September 26, 1951, was clearly illegal.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bombay Industrial Relations Act, 1946 (Bom. XI of 1947)",
      "sections": [
        "3(8)",
        "3(15)",
        "3(18)",
        "3(35A)",
        "3(36)",
        "42",
        "46(4)",
        "46(5)",
        "78",
        "97",
        "98",
        "Schedule II para 4",
        "Chapter XIV"
      ],
      "relevance": "Regulates relations between employers and employees, defines change, illegal change, strike, illegal strikes and lockouts; employer must give notice for changes like rationalization; strike illegal if commenced/continued only for reason employer made illegal change."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "133(1)(c)",
        "226",
        "227"
      ],
      "relevance": "Certificate of fitness for appeal to Supreme Court; writ of certiorari."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed and the order of the High Court dated July 2, 1953, is set aside. The result is that the order of the Labour Appellate Tribunal dated September 4, 1952, stands, with the declaration that the strike in question was illegal with its usual consequences.",
    "relief_granted": "Declaration that the strike was illegal upheld.",
    "costs": "Appellant agreed to pay the taxed costs of the respondents in one set."
  },
  "key_quotes": [
    {
      "text": "\"The true test was to find out the reason for which the strike was commenced or continued, and it was unnecessary to consider or decide whether there was a common law right of the workmen to go on strike.\"",
      "speaker": "court",
      "significance": "Core reasoning on interpretation of s.97(1)(c)"
    },
    {
      "text": "\"The workmen themselves said that they commenced and continued the strike because the employer had made an illegal change. That being the position, the strike was illegal within the express terms of s. 97(1)(c) of the Act.\"",
      "speaker": "court",
      "significance": "Determines illegality based on workers' own pleaded reason"
    }
  ],
  "_case_id": "1956_21",
  "_label": 1,
  "_text_length": 17764,
  "_extracted_at": "2026-02-10T19:15:23.619708"
}