{
  "metadata": {
    "case_name": "Rajes Kanta Roy v. Santi Debi",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "JAGANNADHADAS J."
    ],
    "case_number": "Civil Appeal No. 35 of 1955",
    "date_of_judgment": "1956-11-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Ramani Kanta Roy was possessed of considerable properties. He had three sons, Rajes Kanta Roy, Rabindra Kanta Roy and Ramendra Kanta Roy.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Rabindra died childless in the year 1938 leaving a widow, Santi Debi.",
      "type": "background",
      "date": "1938",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1934 Ramani created an endowment in respect of some of his properties in favour of his family deity and appointed his three sons as shebaits.",
      "type": "background",
      "date": "1934",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1941 Santi Debi instituted a suit against the other members of the family for a declaration that she, as the heir of her deceased husband, was entitled to function as a shebait in the place of her husband. The suit terminated in a compromise recognizing the right of Santi Debi as a shebait.",
      "type": "material",
      "date": "1941",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In the year 1944, Ramani and his two sons, Rajes and Ramendra, filed a suit against Santi Debi for a declaration that the above mentioned compromise decree was null and void. One of the grounds was that the marriage of Santi Debi with Rabindra was a nullity as it was between persons within prohibited degrees.",
      "type": "material",
      "date": "1944",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "During the pendency of that suit Ramani executed a registered trust deed in respect of his entire properties on July 26, 1945. Rajes was appointed thereunder as the sole trustee.",
      "type": "material",
      "date": "1945-07-26",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "After the execution of this trust deed the father Ramani died. The exact date of his death does not appear on the record.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Some time thereafter the suit was compromised on December 3, 1946. By the said compromise Santi Debi gave up her rights under the previous compromise decree of 1941 and agreed to receive for her natural life a monthly allowance of Rs. 475 payable from the month of November, 1946. On default of payment Santi Debi will be entitled to realise the same by means of execution of the decree. The properties mentioned in the schedule (Bharatkhali property in Rangpur Collectorate now in East Pakistan) are hereby charged for the due payment.",
      "type": "material",
      "date": "1946-12-03",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The monthly allowance was regularly paid up to the end of February, 1948, and thereafter payment was defaulted.",
      "type": "material",
      "date": "1948-02-28",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Santi Debi filed an application for execution on July 8, 1949, to realise the arrears of her monthly allowance from March, 1948, to July, 1949, amounting to Rs. 8,075 against both the brothers, Rajes and Ramendra. Execution asked for by way of attachment and sale of premises No. 44/2, Lansdowne Road, Ballygunge.",
      "type": "procedural",
      "date": "1949-07-08",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Rajes filed an objection to the execution under s. 47 of the Code of Civil Procedure on various grounds. Ramendra did not file or join any such application.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Subordinate Judge, Alipore, 2nd Court, Original Order No. 100 of 1950 dated July 18, 1950, over-ruling the objections raised by Rajes in Miscellaneous Case No. 76 of 1949.",
      "type": "procedural",
      "date": "1950-07-18",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appeal to Calcutta High Court dismissed by judgment and decree dated March 10, 1952.",
      "type": "procedural",
      "date": "1952-03-10",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Under the compromise decree, whether charge was created over certain properties for the due payment of the monthly allowance and hence as a matter of construction of the decree, the personal remedy can be pursued only after the remedy by way of charge is exhausted.",
      "framed_by": "appellant"
    },
    {
      "id": "i2",
      "text": "Under the terms of the deed of trust, whether Rajes has attachable interest in the properties sought to be proceeded against, or whether it is only a contingent interest and hence not attachable.",
      "framed_by": "appellant"
    },
    {
      "id": "i3",
      "text": "Whether there is an executable decree, as there is no formal decree directing payment.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under the compromise decree the decree-holder has relinquished all her right, title and interest in respect of all the properties left by Ramani Kanta Roy deceased and she having agreed to realise her dues out of a particular property (charged property) is not entitled to proceed against the properties sought to be attached simultaneously, keeping the said security alive. Personal remedy only after exhausting charge.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Construction of compromise decree clauses c, d, e; Bombay High Court cases"
    },
    {
      "id": "pa2",
      "text": "Under the said deed of trust, the judgment debtor has no interest in the property except that of a trustee and as such the decree holder cannot proceed for realisation. Interest is contingent, not vested, depending on discharge of debts and death of settlor.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": "Trust deed clauses, especially cl.12 a,b; Pestonjee Bhicajee v. P. H. Anderson; ss.19,21 Transfer of Property Act; ss.119,120 Indian Succession Act; Bernard v. Mountague"
    },
    {
      "id": "pa3",
      "text": "No executable decree as no formal direction that plaintiffs pay Rs.475 per month.",
      "supporting_facts": [
        "f8",
        "f12"
      ],
      "legal_basis": "Absence of formal decree clause"
    },
    {
      "id": "pa4",
      "text": "For premises No.44/2, additional contingency of purchasing alternative house worth Rs.40,000 for Ramendra.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": "Trust deed cl.12 c"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Clause c gives unqualified right to execution for personal remedy. Clauses d and e give liberty or option to pursue charge or receiver, not obligatory first.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Construction of compromise decree cls. c,d,e"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Overrules minor objection: Formal order incorporates solenama as part of decree, usual Bengal practice, amounts to direction for payment. No point raised below.",
      "addresses_issue": "i3",
      "key_observation": "Execution not defeated on this ground."
    },
    {
      "id": "cr2",
      "text": "Cls. c imposes personal obligation. Cls. d,e give option/liberty, not limiting cl.c. Intention clear: personal remedy unqualified and concurrent.",
      "addresses_issue": "i1",
      "key_observation": "Decree-holder not obliged to resort to charge first."
    },
    {
      "id": "cr3",
      "text": "Point on trust interest not raised in s.47 petition as such, but allowed as dealt below. Interest vested, not contingent. Discharge of debts not uncertain condition precedent; scheme shows vesting with postponed enjoyment. Income application for debts benefits donees (sons liable for debts). Surplus income devolves same way. Heirs take on death.",
      "addresses_issue": "i2",
      "key_observation": "Vested interest attachable."
    },
    {
      "id": "cr4",
      "text": "For No.44/2: Subject to cl.12c only for absolute devolution post-trust end. Vested but restricted enjoyment (residence right). No additional contingency affecting vesting.",
      "addresses_issue": "i2",
      "key_observation": "Interest vested even in this property."
    },
    {
      "id": "cr5",
      "text": "Compromise decree charge shows parties understood vested interest.",
      "addresses_issue": "i2",
      "key_observation": "Confirms vested nature."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Personal remedy under compromise decree available without first exhausting charged properties.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Rajes' interest under trust deed in properties including No.44/2 Lansdowne Road is vested, not contingent, and attachable.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Executable decree exists via incorporation of solenama.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pestonjee Bhicajee v. P. H. Anderson",
      "citation": null,
      "treatment": "followed",
      "relevance": "Mere contingent interest though transferable inter vivos is not attachable."
    },
    {
      "case_name": "Ranganatha Mudaliar v. A. Mohana Krishna Mudaliar",
      "citation": "1926 A.I.R. 1926 Madras 645",
      "treatment": "referred",
      "relevance": "Cited by High Court on vested interest despite payment of debts clause."
    },
    {
      "case_name": "Bernard v. Mountague",
      "citation": "1816 1 Mer. 422 35 E.R. 729",
      "treatment": "distinguished",
      "relevance": "Payment of debts as condition precedent to vesting, but contrary intention prevails."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 47"
      ],
      "relevance": "Objection to execution filed under; application in course of execution proceedings."
    },
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [
        "Section 19",
        "Section 21"
      ],
      "relevance": "Guiding principles on vested vs contingent interest."
    },
    {
      "name": "Indian Succession Act, 1925",
      "sections": [
        "Section 119",
        "Section 120"
      ],
      "relevance": "Guiding principles on vested vs contingent interest; illustration v to s.119."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. Objections under s.47 CPC overruled. Personal remedy available concurrently with charge. Rajes' interest under trust vested and attachable, including in premises No.44/2 Lansdowne Road. Execution proceedings upheld.",
    "relief_granted": "Execution allowed against properties including No.44/2 Lansdowne Road.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Clause c says that the defendant No.1 will be entitled to realise the amount in default by means of execution of decree. Clause d says that the defendant No.1 will be at liberty to realise the amount in default against the properties charged.\"",
      "speaker": "court",
      "significance": "Clarifies personal remedy unqualified, charge optional."
    },
    {
      "text": "\"A mere contingent interest though transferable inter vivos is not attachable is well settled since the Privy Council decision in Pestonjee Bhicajee v. P. H. Anderson.\"",
      "speaker": "court",
      "significance": "States rule on attachability."
    },
    {
      "text": "\"We are, therefore, of the opinion that in so far as the interest of Rajes is concerned in lots I to IV under the trust deed, it is vested and not contingent.\"",
      "speaker": "court",
      "significance": "Core holding on nature of interest."
    }
  ],
  "_case_id": "1956_91",
  "_label": 0,
  "_text_length": 42161,
  "_extracted_at": "2026-02-08T22:13:18.911859"
}