{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. The Respondent Company",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Ayyar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is a company registered under the Indian Companies Act, 1913, carrying on business in cotton with head office in Bombay and a branch at Karachi for purchasing cotton for shipment to Bombay or export.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Separate accounts are maintained and separate profit and loss statements are prepared for the business at Bombay and at Karachi.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "By an agreement dated 22nd December, the respondent appointed managing agents entitled to 20 per cent of the net annual profits under clause 4.",
      "type": "material",
      "date": "1947-12-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "During the accounting year 1st October 1947 to 30th September 1948, the respondent made total profit of Rs. 15,63,504, of which Rs. 9,44,905 from Bombay and Rs. 6,18,599 from Karachi.",
      "type": "material",
      "date": "1947-10-01 to 1948-09-30",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Commission payable to managing agents: Rs. 3,12,699.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondent debited Rs. 1,88,980 to Bombay P&L (20% of Bombay profits), showing net Bombay profits Rs. 7,55,925; debited Rs. 1,23,719 to Karachi P&L, showing net Karachi profits Rs. 4,94,880.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondent resident and ordinarily resident in India, chargeable to income tax on total world income.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Income Tax Officer assessed total income at Rs. 13,09,375 after deducting entire commission.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Section 49B allowed agreement with Pakistan for avoidance of double taxation; notification issued 10th December 1947.",
      "type": "background",
      "date": "1947-12-10",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "ITO accepted Rs. 4,94,879 as Karachi net profits for double taxation relief, granting abatement on Rs. 5,03,344 after adjustments.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Assessee appealed to Appellate Assistant Commissioner contending Rs. 6,18,599 should be taken as Karachi profits without commission deduction; AAC confirmed ITO.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Tribunal held entire commission payable at Bombay, no portion debited to Karachi branch; allowed appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Tribunal referred question to High Court on application of Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "High Court (Chagla CJ and Tendolkar J) answered reference in affirmative following Birla Brothers Ltd. v. CIT, granted certificate under s.66A.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Pakistan authorities later revised assessment disallowing commission deduction from Karachi profits.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the amount of Rs. 1,23,719 paid to the managing agents as commission at 20% of the net profits of the Karachi branch, is allowable as a revenue deduction against the Indian profits of the assessee company for the year of account?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Rs. 1,23,719 should not be added back to Karachi profits for relief as entire commission already deducted from total income; adding back would give double relief.",
      "supporting_facts": [
        "f5",
        "f6",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Assessee itself deducted amount from Karachi profits and obtained relief in Pakistan on that basis, cannot claim again under agreement.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": "Agreement between India and Pakistan"
    },
    {
      "id": "pa3",
      "text": "Assessee estopped from claiming deduction as it split commission and debited portion to Karachi.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Whole commission payable at Bombay, debatable only to head office; Rs. 6,18,599 should be Karachi profits without deduction.",
      "supporting_facts": [
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": "Terms of managing agency agreement"
    },
    {
      "id": "ra2",
      "text": "Deduction of Rs. 1,23,719 from Karachi P&L was a mistake; Pakistan authorities revised and disallowed it.",
      "supporting_facts": [
        "f6",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Question of double taxation relief not arising for consideration.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Entitlement to deduction depends on law, not on assessee's accounting apportionment; cannot be estopped by erroneous allocation.",
      "addresses_issue": "i1",
      "key_observation": "Deduction governed by provisions of law, not assessee's view."
    },
    {
      "id": "cr2",
      "text": "Under s.10(2)(XV), for business carried at multiple places, one business; all profits pooled, all expenses including commission deducted to arrive at net profits.",
      "addresses_issue": "i1",
      "key_observation": "Foreign branches make no difference for resident assessee; entire commission deductible against Indian profits."
    },
    {
      "id": "cr3",
      "text": "Apportionment not warranted by managing agency agreement; commission on net annual profits of company as whole, considering all branches.",
      "addresses_issue": "i1",
      "key_observation": "In case of loss in one branch, commission adjusted against overall net."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The respondent is entitled to deduct the entire managing agency commission including Rs. 1,23,719 against Indian profits notwithstanding apportionment in P&L statements.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Birla Brothers Ltd. v. Commissioner of Income Tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Managing agency commission to be debited entirely to head office even if duties partly in branch."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act",
      "sections": [
        "Section 10(2)(XV)",
        "Section 49B",
        "Section 66(1)",
        "Section 66A"
      ],
      "relevance": "Allowance for business expenditure; avoidance of double taxation; reference to court."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [],
      "relevance": "Company registered thereunder."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's answer to the reference in the affirmative, holding the deduction allowable, thereby dismissing the Commissioner's appeal.",
    "relief_granted": "Deduction of Rs. 1,23,719 allowed against Indian profits.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Whether the respondent is entitled to the particular deduction or not will depend on the provision of law relating thereto and not on the view which it might have taken of its rights.",
      "speaker": "court",
      "significance": "Rejects estoppel based on assessee's accounting."
    },
    {
      "text": "When an assessee carries on the same business at a number of places, there is for the purpose of section 10, only one business.",
      "speaker": "court",
      "significance": "Clarifies computation of profits for multi-branch business."
    }
  ],
  "_case_id": "1956_78",
  "_label": 0,
  "_text_length": 12380,
  "_extracted_at": "2026-02-08T22:13:21.536784"
}