{
  "metadata": {
    "case_name": "Appellants (Lessees of Salt Works at Kuda) v. Respondents (Agarias)",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI J."
    ],
    "case_number": "Civil Appeal No. 85 of 1956",
    "date_of_judgment": "1956-11-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellants are lessees of the Salt Works from the erstwhile State of Dharangadhara and also hold a licence for the manufacture of salt on the land.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellants require salt for the manufacture of certain chemicals and part of the salt manufactured at the Salt Works is utilised by the appellants in the manufacturing process in the Chemical Works at Dharangadhara and the remaining salt is sold to outsiders.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellants employ a Salt Superintendent who is in charge of the Salt Works and generally supervises the Works and the manufacture of salt carried on there.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellants maintain a railway line and sidings and also have arrangements for storage of drinking water. They also maintain a grocery shop near the Salt Works where the agarias can purchase their requirements on credit.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The salt is manufactured not from sea water but from rain water which soaking down the surface becomes impregnated with saline matter. The operations are seasonal in character and commence sometime in October at the close of the monsoon.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The entire area is parceled out into plots called pattas and they are in four parallel rows intersected by the railway lines. Each agaria is allotted a patta and in general the same patta is allotted to the same agaria year after year. If the patta is extensive it is allotted to two agarias who work the same in partnership.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "At the time of such allotment, the appellants pay a sum of Rs. 400/- for each of the pattas and that is to meet the initial expenses.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Then the agarias commence their work. They level the lands and enclose and sink wells in them.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Then the density of the water in the wells is examined by the Salt Superintendent of the appellants and then the brine is brought to the surface and collected in the reservoirs called condensers and retained therein until it acquires by natural process a certain amount of density.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Then it is flowed into the pattas and kept there until it gets transformed into crystals. The pans have got to be prepared by the agarias according to certain standards and they are tested by the Salt Superintendent.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "When salt crystals begin to form in the pans they are again tested by the Salt Superintendent and only when they are of a particular quality the work of collecting salt is allowed to be commenced.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "After the crystals are collected, they are loaded into the railway wagons and transported to the depots where salt is stored. The salt is again tested there and if it is found to be of the right quality, the agarias are paid therefore at the rate of Rs. 0-5-6 per maund.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Salt which is rejected belongs to the appellants and the agarias cannot either remove the salt manufactured by them or sell it.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The account is made up at the end of the season when the advances which have been paid to them from time to time as also the amounts due from the agarias to the grocery shop are taken into account. On a final settlement of the accounts, the amount due by the appellants to the agarias is ascertained and such balance is paid by the appellants to the agarias.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The manufacturing season comes to an end in June when the monsoon begins and then the agarias return to their villages and take up agricultural work.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The agarias work themselves with their families on the pattas allotted to them. They are free to engage extra labour but it is they who make the payments to these labourers and the appellants have nothing to do with the same.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The appellants do not prescribe any hours of work for these agarias. No muster roll is maintained by them nor do they control how many hours in a day and for how many days in a month the agarias should work. There are no rules as regards leave or holidays. They are free to go out of the works as they like provided they make satisfactory arrangements for the manufacture of salt.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "In about 1950, disputes arose between the agarias and the appellants as to the conditions under which the agarias should be engaged by the appellants in the manufacture of salt.",
      "type": "procedural",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "The Government of Saurashtra, by its letter of Reference dated November 5, 1951, referred the disputes for adjudication to the Industrial Tribunal, Saurashtra State, Rajkot.",
      "type": "procedural",
      "date": "1951-11-05",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "The appellants contested the proceedings on the ground, inter alia, that the status of the agarias was that of independent contractors and not of workmen and that the State was not competent to refer their disputes for adjudication under s. 10 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f21",
      "text": "This question was tried as a preliminary issue and by its order dated August 30, 1952, the Tribunal held that the agarias were workmen within the meaning of the Act and that the reference was intra vires and adjourned the matter for hearing on the merits.",
      "type": "procedural",
      "date": "1952-08-30",
      "source": "lower_court"
    },
    {
      "id": "f22",
      "text": "Against this order the appellants preferred an appeal being Appeal No. 302 of 1952, before the Labour Appellate Tribunal of India.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f23",
      "text": "Having failed to obtain stay of further proceedings before the Industrial Tribunal pending the appeal, they moved the High Court of Saurashtra in M.P. No. 70 of 1952 under Arts. 226 and 227 of the Constitution for an appropriate writ to quash the reference dated November 5, 1951, on the ground that it was without jurisdiction.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f24",
      "text": "Pending the disposal of this writ petition, the appellants obtained stay of further proceedings before the Industrial Tribunal and in view of the same the Labour Appellate Tribunal passed an order on September 27, 1953, dismissing the appeal leaving the question raised therein to the decision of the High Court.",
      "type": "procedural",
      "date": "1953-09-27",
      "source": "lower_court"
    },
    {
      "id": "f25",
      "text": "By their judgment dated January 8, 1954, the learned Judges of the High Court agreed with the decision of the Industrial Tribunal that the agarias were workmen within s. 2(s) of the Act and, accordingly, dismissed the application for writ. They, however, granted a certificate under Art. 133(1)(c) of the Constitution.",
      "type": "procedural",
      "date": "1954-01-08",
      "source": "lower_court"
    },
    {
      "id": "f26",
      "text": "Evidence of the Salt Superintendent: The panholders are allotted work on the salt pans by oral agreement. The Company has no control over the panholders in regard to the hours of work or days of work. The Company's permission is not sought in matter of sickness or in matter of going out to some village. The Company has no control over the panholders as to how many labourers they should engage and what wages they should pay them. The Company's supervision over the work of the panholders is limited to the proper quality as per requirements of the Company and as per standard determined by the Government in matter of salt.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f27",
      "text": "Clause 6 of the agreement: We bind ourselves to work as per advice and instructions of the officers appointed by them in connection with the drawing of brine or with the process of salt production in the pattas and if there is any default, negligence or slackness in executing it on our part or if we do not behave well in any way, the Managing Agent of the said Company can annul this agreement and can take possession of the patta, brine, well etc., and as a result we will not be entitled to claim any sort of consideration or compensation for any half processed salt lying in our patta or in respect of any expense incurred or labour employed in preparing kiwa patta, well bamboo lining etc.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f28",
      "text": "Evidence of Shiva Daya, an agaria: There is work of making enclosures and then of sinking wells. The company supervises this work. While the wells are being sunk, the company measures the density of the brine of wells. In order to bring the brine of wells to the proper density, it is put in a condenser and then the Company tests this and then this brine is allowed to flow in the pattas. The bottom of a patta is prepared after it is properly crushed under feet and after the company inspects and okays that it is alright, water is allowed to flow into it. When salt begins to form at the bottom of a patta, an officer of the company comes and inspects it. At the end of 21 months, the water becomes saturated, i.e., useless, and so it is drained away under the supervision of the company. Then fresh brine is allowed to flow into the patta from the condenser. This instruction is also given by the company's officer.",
      "type": "material",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the agarias working in the Salt Works at Kuda in the Rann of Cutch are workmen within the meaning of the term as defined in s. 2(s) of the Industrial Disputes Act, 1947.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The status of the agarias was that of independent contractors and not of workmen.",
      "supporting_facts": [
        "f17",
        "f26"
      ],
      "legal_basis": "No right of control over manner of work; piece-work payment; agarias employ and pay own labour"
    },
    {
      "id": "pa2",
      "text": "The State was not competent to refer their disputes for adjudication under s. 10 of the Act.",
      "supporting_facts": [
        "f20"
      ],
      "legal_basis": "s. 10 Industrial Disputes Act, 1947"
    },
    {
      "id": "pa3",
      "text": "Even accepting all facts found by Tribunal, agarias are independent contractors: no obligation for fixed hours/days, paid by quantity of salt produced, employ own labour.",
      "supporting_facts": [
        "f12",
        "f16",
        "f17"
      ],
      "legal_basis": "Test of control from Collins v. Hertfordshire County Council; Performing Right Society Ltd. v. Mitchell and Booker Palais de Danse"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The question as regards the relationship between the appellants and the agarias was a pure question of fact, decided by Tribunal, not to be interfered by High Court under Arts. 226/227.",
      "supporting_facts": [],
      "legal_basis": "Ebrahim Aboobakar v. Custodian General of Evacuee Property"
    },
    {
      "id": "ra2",
      "text": "Supervision and control exercised by appellants extended to all stages of manufacture from beginning to end.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11",
        "f12",
        "f28"
      ],
      "legal_basis": "Evidence of Shiva Daya; Clause 6 of agreement (f27)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Essential condition of workman: employed in industry, relationship of employer-employee/master-servant.",
      "addresses_issue": "i1",
      "key_observation": "Prima facie test: right of control over manner of work."
    },
    {
      "id": "cr2",
      "text": "Discusses tests from authorities: control over what and how; but not universal; integration into business; indicia from Short v. JW Henderson.",
      "addresses_issue": "i1",
      "key_observation": "Supervision and control critical."
    },
    {
      "id": "cr3",
      "text": "Question of fact, Tribunal finding supported by evidence: supervision at all stages per evidence.",
      "addresses_issue": "i1",
      "key_observation": "Materials support agarias as workmen, not independent contractors."
    },
    {
      "id": "cr4",
      "text": "Piece-work payment does not preclude workman status.",
      "addresses_issue": "i1",
      "key_observation": "Cites Sadler v. Henlock, Blake v. Thirst."
    },
    {
      "id": "cr5",
      "text": "Agarias personally work (with family), engaging others does not change status to contractor.",
      "addresses_issue": "i1",
      "key_observation": "Workman if agrees to work personally; cites Halsbury."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Agarias are workmen within s. 2(s) of the Industrial Disputes Act, 1947.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Collins v. Hertfordshire County Council",
      "citation": "1947 K.B. 598, 615",
      "treatment": "referred",
      "relevance": "Distinction between contract for services and contract of service: control over how work done."
    },
    {
      "case_name": "Stevenson, Jordan and Harrison Ltd. v. Macdonald and Evans",
      "citation": "1952 T.L.R. 101, 111",
      "treatment": "referred",
      "relevance": "Control test not universal; integration into business."
    },
    {
      "case_name": "Cassidy v. Ministry of Health",
      "citation": "1951 1 T.L.R. 539; 1951 2 K.B. 343, 352-3",
      "treatment": "referred",
      "relevance": "Control not always exercised; ordinary meaning of contract of service."
    },
    {
      "case_name": "Short v. J. W. Henderson, Ltd.",
      "citation": "1946 62 T.L.R. 427, 429",
      "treatment": "followed",
      "relevance": "Indicia of contract of service; need to reconsider due to modern conditions; control decisive."
    },
    {
      "case_name": "Mersey Docks and Harbour Board v. Coggins Griffith (Liverpool) Ltd. and Another",
      "citation": "1947 1 A.C. 1, 23",
      "treatment": "referred",
      "relevance": "Authority to control manner of execution."
    },
    {
      "case_name": "Simmons v. Health Laundry Company",
      "citation": "1910 1 K.B. 543, 549-550",
      "treatment": "referred",
      "relevance": "Degree of control determines contract of service vs professional services."
    },
    {
      "case_name": "Ebrahim Aboobakar v. Custodian General of Evacuee Property",
      "citation": "1952 S.C.R. 696, 702",
      "treatment": "referred",
      "relevance": "Writ not to quash factual findings within jurisdiction."
    },
    {
      "case_name": "Performing Right Society Ltd. v. Mitchell and Booker Palais de Danse",
      "citation": "1924 1 K.B. 762",
      "treatment": "distinguished",
      "relevance": "Mixed question of fact/law per Batts, but generally question of fact."
    },
    {
      "case_name": "Sadler v. Henlock",
      "citation": "1855 4 El. Bl. 570; 119 E.R. 209",
      "treatment": "followed",
      "relevance": "Piece-work does not preclude master-servant relation."
    },
    {
      "case_name": "Blake v. Thirst",
      "citation": "1863 32 L.J. Exchequer 188",
      "treatment": "referred",
      "relevance": "Piece-work ok for servant."
    },
    {
      "case_name": "Grainger v. Aynsley",
      "citation": "1881 6 Q.B.D. 182",
      "treatment": "referred",
      "relevance": "Workman status if personal service, even with assistance."
    },
    {
      "case_name": "Bromley v. Tams",
      "citation": "1852 21 L.J., Q.B. 151",
      "treatment": "referred",
      "relevance": "Workman status if personal service."
    },
    {
      "case_name": "Whitely v. Armitage",
      "citation": "1864 16 W.R. 144",
      "treatment": "referred",
      "relevance": "Workman status if personal service."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 2(s)",
        "s. 10"
      ],
      "relevance": "Definition of 'workman'; reference of disputes for adjudication"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226",
        "Art. 227",
        "Art. 133(1)(c)"
      ],
      "relevance": "Writ jurisdiction of High Court; certificate for appeal to Supreme Court"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court and Industrial Tribunal's decision that agarias are workmen under s. 2(s) of the Industrial Disputes Act, 1947, dismissing the appeal. Tribunal to proceed with merits considering nature of work.",
    "relief_granted": "None specified; reference valid, proceedings to continue.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'Workman means any person employed (including an apprentice) in any industry to do any skilled or unskilled manual or clerical work for hire or reward...'",
      "speaker": "court",
      "significance": "Statutory definition central to issue."
    },
    {
      "text": "The prima facie test... is the existence of the right in the master to supervise and control the work done by the servant not only in the matter of directing what work the servant is to do but also the manner in which he shall do his work.",
      "speaker": "court",
      "significance": "Key test applied to facts."
    },
    {
      "text": "A person can be a workman even though he is paid not per day but by the job.",
      "speaker": "court",
      "significance": "Rejects piece-work as decisive for contractor status."
    },
    {
      "text": "The workman must have consented to give his personal services and not merely to get the work done, but if he is bound under his contract to work personally, he is not excluded from the definition, simply because he has assistance from others.",
      "speaker": "court",
      "significance": "Clarifies personal work despite assistance."
    }
  ],
  "_case_id": "1956_83",
  "_label": 0,
  "_text_length": 28041,
  "_extracted_at": "2026-02-10T19:16:40.049405"
}