{
  "metadata": {
    "case_name": "Timber Merchant (Appellant) v. Commissioner of Income-tax (Respondent)",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI J."
    ],
    "case_number": "Civil Appeal No. 6 of 1954",
    "date_of_judgment": "1956-05-08"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a timber merchant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 5th February 1930, appellant obtained a loan of Rs. 1 lakh from the Bank of India on the joint security of himself and one Mamraj Rambhagat.",
      "type": "material",
      "date": "1930-02-05",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On the same day, 5th February 1930, Mamraj Rambhagat obtained a loan of Rs. 1 lakh from the Imperial Bank of India, Bombay on the joint security of himself and the appellant.",
      "type": "material",
      "date": "1930-02-05",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant paid off his loan of Rs. 1 lakh to the Bank of India.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Mamraj Rambhagat failed to pay his loan to the Imperial Bank of India, Bombay.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Imperial Bank of India realised Rs. 1,00,626 (principal Rs. 1 lakh + interest Rs. 626) from the appellant on 24th March 1930.",
      "type": "material",
      "date": "1930-03-24",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Mamraj Rambhagat failed in his business and his estate went into the hands of receivers on 25th April 1930.",
      "type": "material",
      "date": "1930-04-25",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant opened a ledger account in the name of Mamraj Rambhagat and debited Rs. 1,00,626 to this account.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant received dividends from the receivers: Rs. 31,446 on 30th October 1930, Rs. 9,434 on 25th April 1934, and Rs. 4,716 on 17th May 1938, aggregating Rs. 45,596.",
      "type": "material",
      "date": "1930-10-30",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Balance of Rs. 55,030 remained unpaid and was written off as bad debt by appellant in assessment year 1941-42 (account year 1997 Ramnavmi).",
      "type": "material",
      "date": "1941",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant claimed Rs. 55,030 as allowable deduction under section 10 of the Indian Income-tax Act, 1922.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Income-tax Officer disallowed the claim holding it was a capital loss.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appellate Assistant Commissioner upheld disallowance, distinguishing CIT v. S.A.S. Ramaswamy Chettiar on facts.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Argument before Appellate Assistant Commissioner: Usual custom in Bombay to secure loans on joint security from Banks, preferred by Banks and traders for lower interest; appellant borrowed on joint security frequently; old pro-notes submitted.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Income Tax Appellate Tribunal held custom accepted by Department, no distinction between money lending and timber business, followed CIT v. S.A.S. Ramaswamy Chettiar, allowed claim.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "At instance of respondent, Tribunal referred question to High Court under section 66(1): Whether on the facts found the sum of Rs. 55,030 is allowable as a bad debt under section 10(2)(xi).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Calcutta High Court answered question in negative on 8th June 1951, holding no part of loan applied to appellant's business, debt not trading debt of timber business, distinguished precedents.",
      "type": "procedural",
      "date": "1951-06-08",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Appeal to Supreme Court with certificate under section 66A(2).",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the loss of Rs. 55,030 suffered by the appellant was a capital loss or a trading loss or a bad debt incurred by the appellant in the course of carrying on his business of timber.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether on the facts found the sum of Rs. 55,030 is allowable as a bad debt under the provisions of section 10(2)(xi) of the Indian Income-tax Act.",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Loss was allowable as trading loss/bad debt under section 10(2)(xi) as it arose in course of securing finance for timber business via custom of joint security loans.",
      "supporting_facts": [
        "f2",
        "f3",
        "f6",
        "f10",
        "f14"
      ],
      "legal_basis": "Section 10 of Indian Income-tax Act, 1922; CIT v. S.A.S. Ramaswamy Chettiar (1946) 14 ITR 236"
    },
    {
      "id": "pa2",
      "text": "Custom in Bombay: Businessmen borrow on joint security for lower interest; mutual suretyship essential (A joins B as surety in exchange for B joining A). Transaction of joining Mamraj as surety was essential for appellant's own financing.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Appellate Assistant Commissioner finding: Stood surety in course of securing finance for timber business; old pro-notes prove frequent joint borrowings.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Loss was capital loss, not trading debt of appellant's timber business; no part of loan used in appellant's business.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "Section 10(2)(xi) of Indian Income-tax Act, 1922"
    },
    {
      "id": "ra2",
      "text": "Custom not mutual or essential to timber business; appellant not in business of standing surety or money-lending.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "CIT v. S.R. Subramanya Pillai (1950) 18 ITR 85"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No part of monies borrowed by Mamraj on joint security went to finance appellant's timber business; all utilised by Mamraj.",
      "addresses_issue": "i1",
      "key_observation": "Debt not due to appellant's timber business."
    },
    {
      "id": "cr2",
      "text": "Custom not established as mutual accommodation essential; appellant could procure surety without reciprocating; old pro-notes insufficient proof.",
      "addresses_issue": "i1",
      "key_observation": "Transaction not in course of or for carrying on timber business."
    },
    {
      "id": "cr3",
      "text": "Ramaswamy Chettiar case confined to Nattukottai Chettiars' money-lending business with mutuality; absent here.",
      "addresses_issue": "i1",
      "key_observation": "Distinguished on facts; elements of mutuality and essentiality to business lacking."
    },
    {
      "id": "cr4",
      "text": "Subramanya Pillai case analogous: Loss on joint borrowing for another's benefit is capital loss, not deductible.",
      "addresses_issue": "i1",
      "key_observation": "Proper analogy to present case."
    },
    {
      "id": "cr5",
      "text": "Debt must be trading debt of the trade; appellant is timber merchant, not surety business.",
      "addresses_issue": "i1",
      "key_observation": "Loss capital, not business loss."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Loss of Rs. 55,030 is capital loss, not trading loss or bad debt of timber business; not allowable under section 10(2)(xi).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court correct in answering reference in negative.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Madras v. S. A. S. Ramaswamy Chettiar",
      "citation": "(1946) 14 I.T.R. 236",
      "treatment": "distinguished",
      "relevance": "Custom of mutual suretyship essential to Nattukottai Chettiars' money-lending; not applicable to timber business without mutuality."
    },
    {
      "case_name": "Commissioner of Income-tax, Madras v. S. R. Subramanya Pillai",
      "citation": "(1950) 18 I.T.R. 85",
      "treatment": "followed",
      "relevance": "Loss on joint borrowing where part for another's business is capital loss; confines Ramaswamy Chettiar to its facts; analogous to present case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 66A(2)",
        "Section 66(1)",
        "Section 10",
        "Section 10(2)(xi)"
      ],
      "relevance": "Governs reference, appeal, and allowability of bad debt as deduction only if trading debt of the assessee's business."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court's negative answer to the reference question, holding the Rs. 55,030 loss as capital expenditure not deductible under section 10(2)(xi) as it was not a trading debt of the appellant's timber business.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The sole question for our determination in this appeal is whether the loss of Rs. 55,030 suffered by the appellant in this transaction was a capital loss or was a trading loss or a bad debt incurred by the appellant in the course of carrying on his business of timber.",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "The debt must therefore be one which can properly be called a trading debt and a debt of the trade, the profits of which are being computed.",
      "speaker": "court",
      "significance": "Test for allowability under section 10(2)(xi)."
    },
    {
      "text": "It is their custom to borrow from banks for the purpose of lending out the sums so obtained at higher rates of interest. The banks require such overdrafts to be guaranteed by other Chettiars.",
      "speaker": "court",
      "significance": "Explains mutuality in Ramaswamy Chettiar case, absent here."
    }
  ],
  "_case_id": "1956_56",
  "_label": 0,
  "_text_length": 16697,
  "_extracted_at": "2026-02-10T19:15:28.442093"
}