{
  "metadata": {
    "case_name": "New Prakash Transport Co. Ltd. v. Suwarna Transport Company Limited",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha J."
    ],
    "case_number": "Civil Appeal No. 74 of 1956",
    "date_of_judgment": "1956-09-30"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Suwarna Transport Company Limited held seven permits for running buses on the Buldana-Malkapur route as the sole operator.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Suwarna Transport Company Limited applied for another permit on the same route; New Prakash Transport Co. Ltd. (appellant) and Navjivan Transport Service also applied.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On May 26, 1953, Regional Transport Authority (RTA) of Amraoti (third respondent) heard all three applicants; consideration postponed, resolution passed that no one service should have monopoly on Buldana-Malkapur route.",
      "type": "procedural",
      "date": "1953-05-26",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On March 30, 1954, RTA granted permit to first respondent (Suwarna); rejected appellant's application on ground of police report against it dated March 27, 1954.",
      "type": "material",
      "date": "1954-03-30",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant appealed to Appellate Authority (second respondent) under R.73 of Motor Vehicles Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant challenged correctness of first police report, applied to District Superintendent of Police to verify; police made further report dated May 13, 1954, absolving appellant from allegations.",
      "type": "procedural",
      "date": "1954-05-13",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Further police report read out to parties by Chairman of Appellate Authority at hearing; no objection raised by any party.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "By order dated July 29, 1954, Appellate Authority set aside RTA order, allowed appeal, ordered permit to be issued to appellant.",
      "type": "material",
      "date": "1954-07-29",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "First respondent (Suwarna) moved Nagpur High Court for writ of certiorari under Art. 226 on grounds: error apparent on face of record (misreading police report) and contravention of natural justice (no opportunity to deal with revised report).",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Appellant admitted rejection based on first police report full of mistakes, obtained fresh report absolving it; controverted error on record.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Second respondent corroborated that first report modified by report dated May 13, 1954 based on misunderstanding; report read out at hearing.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Single Judge (Mr. Justice V. R. Sen) on December 13, 1954, discharged rule with costs; no substance in contentions of error or natural justice violation; first respondent did not indicate wish to controvert report.",
      "type": "procedural",
      "date": "1954-12-13",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "First respondent's Letters Patent Appeal No. 2 of 1955 heard by Division Bench (Chief Justice Hidayatulla and Mr. Justice S. P. Kotwal); negative error on record but found failure of natural justice; quashed Appellate Authority order, directed rehearing.",
      "type": "procedural",
      "date": "1955-09-22",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appellant obtained special leave to appeal to Supreme Court after High Court refused certificate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there has been a failure of natural justice in this case as a result of the procedure adopted by the Appellate Authority.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there was an error apparent on the face of the record in the order of the Appellate Authority.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appeal Bench of Nagpur High Court erred in concluding failure of justice; no well-defined criteria for natural justice, depends on terms of legislation creating statutory body; Appellate Authority did all required by ss.47,48,64 MV Act and rules under s.68.",
      "supporting_facts": [
        "f5",
        "f7",
        "f8"
      ],
      "legal_basis": "Sections 47, 48, 64, 68 Motor Vehicles Act; Rule 73"
    },
    {
      "id": "pa2",
      "text": "No grievance made by parties at hearing about procedure; subsequent report read out, no objection or request for adjournment.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No opportunity to study subsequent police report and make submissions; deprived of fair and full opportunity of being heard, failure of natural justice.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "Principles of natural justice"
    },
    {
      "id": "ra2",
      "text": "Appellate Authority misread police report, error apparent on face of record.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No substance in error apparent on face of record; language ambiguous but considered subsequent report; no assumption of facts not borne out by record.",
      "addresses_issue": "i2",
      "key_observation": "Difficult to hold matters referred not contained in subsequent report."
    },
    {
      "id": "cr2",
      "text": "Statutory provisions (ss.47,48,64 MV Act, R.73) require opportunity to appellant, original authority, interested persons; notice given, heard persons appearing, further enquiry if necessary; no regular trial or evidence recording prescribed.",
      "addresses_issue": "i1",
      "key_observation": "Rules contemplate notice to interested persons including opponents."
    },
    {
      "id": "cr3",
      "text": "Police report is information to assist authority, not for parties' use; read out at hearing, no objection, no adjournment requested; no prejudice as report withdrew objections against appellant, nothing against respondent.",
      "addresses_issue": "i1",
      "key_observation": "Enough compliance with natural justice; tribunal not obliged to grant adjournment suo motu."
    },
    {
      "id": "cr4",
      "text": "Rules of natural justice judged by constitution of statutory body, statutory rules; not court of law; precedents like Rice, Arlidge show no need for full trial, fair opportunity suffices; reading report enough here.",
      "addresses_issue": "i1",
      "key_observation": "High Court made unjustified assumptions; MV Act scheme complete."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No failure of natural justice; reading out police report sufficient compliance; no requirement to furnish copy or adjourn absent request.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No error apparent on face of record.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Spackman v. Plumstead Board of Works",
      "citation": "1885 10 A.C. 229",
      "treatment": "referred",
      "relevance": "Substantial requirements of justice; opportunity to be heard without formal procedure."
    },
    {
      "case_name": "Board of Education v. Rice",
      "citation": "1911 A.C. 179",
      "treatment": "followed",
      "relevance": "Statutory bodies must act in good faith, fairly listen to both sides; obtain information any way, give opportunity to correct prejudicial statements; no trial."
    },
    {
      "case_name": "Rex v. Local Government Board, Ex parte Arlidge",
      "citation": "1915 A.C. 120",
      "treatment": "followed",
      "relevance": "Procedure varies by tribunal; obey statute; no court-like methods; judicial spirit and substantial justice suffice."
    },
    {
      "case_name": "General Medical Council v. Spackman",
      "citation": "1943 A.C. 827",
      "treatment": "referred",
      "relevance": "Tribunal master of procedure per statute/rules; due inquiry required; examine witnesses if tendered."
    },
    {
      "case_name": "Veerappa Pillai v. Raman & Raman Ltd.",
      "citation": "1952 S.C.R. 583",
      "treatment": "followed",
      "relevance": "Complete scheme in MV Act for permits; remedies within statute."
    }
  ],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act",
      "sections": [
        "47",
        "48",
        "64",
        "68"
      ],
      "relevance": "Matters for RTA consideration; grant/restrict permits; appeal with hearing opportunity; rule-making."
    },
    {
      "name": "Motor Vehicles Rules",
      "sections": [
        "73"
      ],
      "relevance": "Appellate Authority composition, notice to interested persons, hearing, further enquiry if needed."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "226"
      ],
      "relevance": "High Court writ jurisdiction invoked by first respondent."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, set aside the Letters Patent Bench judgment and order dated September 22, 1955, restored the single Judge's order dated December 13, 1954 discharging the rule.",
    "relief_granted": "Judgment of single Judge restored; writ petition dismissed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the fact that the Appellate Authority had read out the contents of the police report was enough compliance with the rules of natural justice.\"",
      "speaker": "court",
      "significance": "Core holding on sufficiency of procedure under natural justice."
    },
    {
      "text": "\"They must act in good faith and fairly listen to both sides, for that is a duty lying upon everyone who decides anything.\"",
      "speaker": "court",
      "significance": "Quotes Lord Loreburn in Rice; defines minimal natural justice for statutory bodies."
    },
    {
      "text": "\"the rules of natural justice have to be inferred from the nature of the tribunal, the scope of its enquiry and the statutory rules of procedure.\"",
      "speaker": "court",
      "significance": "Principle applied to distinguish court-like procedures."
    }
  ],
  "_case_id": "1956_70",
  "_label": 1,
  "_text_length": 45651,
  "_extracted_at": "2026-02-10T19:16:10.762072"
}