{
  "metadata": {
    "case_name": "The New Prakash Transport Co. Ltd. v. The Suwarna Transport Company Limited",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha J."
    ],
    "case_number": "Civil Appeal No. 74 of 1956",
    "date_of_judgment": "1956-09-30"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Suwarna Transport Company Limited held seven permits for running buses on the Buldana-Malkapur route, as the sole operator on that route.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Suwarna Transport Company Limited applied for another permit for the same route. The appellant, The New Prakash Transport Co. Ltd., and Navjivan Transport Service also applied for a similar permit on that route.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On May 26, 1953, all three applicants were heard by the Regional Transport Authority of Amraoti (third respondent). Consideration was postponed, but a resolution was passed that no one service should have monopoly on Buldana-Malkapur route.",
      "type": "procedural",
      "date": "1953-05-26",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On March 30, 1954, Regional Transport Authority granted the permit to first respondent (Suwarna). Appellant's application rejected on the ground that the police report was against it.",
      "type": "material",
      "date": "1954-03-30",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "First police report dated March 27, 1954, full of mistakes and falsehoods.",
      "type": "disputed",
      "date": "1954-03-27",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Appellant preferred appeal to Appellate Authority (second respondent) constituted under R. 73 of the Motor Vehicles Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant challenged correctness of police report and applied to District Superintendent of Police to verify facts. Police made further report dated May 13, 1954, which absolved appellant from allegations of misconduct in first report.",
      "type": "procedural",
      "date": "1954-05-13",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Further police report read out to parties by Chairman of Appellate Authority at hearing of appeal. No objection raised by any parties.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "By order dated July 29, 1954, Appellate Authority set aside order of Regional Transport Authority, allowed appeal, ordered permit to be issued to appellant.",
      "type": "material",
      "date": "1954-07-29",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "First respondent moved High Court at Nagpur for writ of certiorari under Art. 226 on grounds: (1) error apparent on face of record (misread police report), (2) contravened principles of natural justice (revised report not shown, no effective opportunity).",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Appellant admitted rejection based on first police report, got fresh report after verification which absolved it; controverted error apparent and failure of justice.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Second respondent corroborated: first report modified by report dated May 13, 1954 based on misunderstanding; report read out to parties.",
      "type": "admitted",
      "date": "1954-05-13",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Single Judge (Mr. Justice V. R. Sen) by order dated December 13, 1954, discharged rule with costs; no substance in contentions.",
      "type": "procedural",
      "date": "1954-12-13",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "First respondent preferred Letters Patent Appeal No. 2 of 1955. Division Bench (Chief Justice Hidayatulla and Mr. Justice S. P. Kotwal) by judgment dated September 22, 1955, quashed Appellate Authority order, directed rehearing.",
      "type": "procedural",
      "date": "1955-09-22",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appellant obtained special leave to appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there has been a failure of natural justice in this case as a result of the procedure adopted by the Appellate Authority.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there was an error apparent on the face of the record in the order of the Appellate Authority.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appeal Bench of Nagpur High Court erred in concluding failure of justice; no well defined criteria, depends on terms of legislation creating statutory body; Appellate Authority did all required by law.",
      "supporting_facts": [
        "f6",
        "f8",
        "f9"
      ],
      "legal_basis": "ss. 47, 48, 64 of Motor Vehicles Act; r.73"
    },
    {
      "id": "pa2",
      "text": "Fresh police report read out during hearing, no objection raised; no failure of justice.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No opportunity of studying subsequent police report and making submissions; deprived of fair and full opportunity of being heard; failure of natural justice.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "principles of natural justice"
    },
    {
      "id": "ra2",
      "text": "Appellate Authority misread police report; error apparent on face of record.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No substance in error apparent on face of record; language ambiguous but considered subsequent report.",
      "addresses_issue": "i2",
      "key_observation": "No assumption of facts not borne out by record."
    },
    {
      "id": "cr2",
      "text": "Statutory provisions (ss.47,48,64 MV Act, r.73) require opportunity to appellant, original authority, interested persons; notice given, heard persons who appeared; no elaborate procedure like court.",
      "addresses_issue": "i1",
      "key_observation": "Police report for use of authority, not parties; read out sufficient."
    },
    {
      "id": "cr3",
      "text": "No party objected to reading report or sought adjournment; no grievance at time; report not against first respondent.",
      "addresses_issue": "i1",
      "key_observation": "Tribunal not obliged to grant adjournment suo motu."
    },
    {
      "id": "cr4",
      "text": "Rules of natural justice judged by constitution of statutory body, statutory rules; analyzed English precedents (Spackman, Rice, Arlidge, etc.); not court-like procedure required.",
      "addresses_issue": "i1",
      "key_observation": "Motor Vehicles Act provides complete scheme; no violation."
    },
    {
      "id": "cr5",
      "text": "High Court made unjustified assumptions; single Judge took correct view.",
      "addresses_issue": "i1",
      "key_observation": "Judgment under appeal erroneous."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No failure of natural justice; reading out police report sufficient compliance.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No error apparent on face of record.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Veerappa Pillai v. Raman & Raman Ltd.",
      "citation": "1952 SCR 583",
      "treatment": "followed",
      "relevance": "Complete scheme under MV Act for permits; remedies within statute."
    },
    {
      "case_name": "Spackman v. Plumstead Board of Works",
      "citation": "1885 10 AC 229",
      "treatment": "referred",
      "relevance": "Substantial requirements of justice; opportunity to be heard without formal procedure."
    },
    {
      "case_name": "Board of Education v. Rice",
      "citation": "1911 AC 179",
      "treatment": "followed",
      "relevance": "Statutory bodies must act in good faith, fairly listen to both sides; obtain information best way, give opportunity to correct prejudicial statements."
    },
    {
      "case_name": "Local Government Board v. Arlidge",
      "citation": "1915 AC 120",
      "treatment": "followed",
      "relevance": "Procedure varies; not same as courts; obey statute; natural justice not court methods."
    },
    {
      "case_name": "General Medical Council v. Spackman",
      "citation": "1943 AC 827",
      "treatment": "referred",
      "relevance": "Tribunal master of procedure per statute; due inquiry required by rules."
    },
    {
      "case_name": "R. v. Architects Registration Tribunal",
      "citation": "1945 2 AER 131",
      "treatment": "distinguished",
      "relevance": "Opportunity to meet allegations on professional fitness."
    }
  ],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act",
      "sections": [
        "47",
        "48",
        "64",
        "68"
      ],
      "relevance": "Matters for RTA consideration; appeal procedure; rules under s.68."
    },
    {
      "name": "Motor Vehicles Rules",
      "sections": [
        "73"
      ],
      "relevance": "Appellate Authority composition, notice to interested persons, hearing."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "226"
      ],
      "relevance": "Writ of certiorari sought."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, set aside the Letters Patent Bench judgment and order dated September 22, 1955, restored the single Judge's order dated December 13, 1954, discharging the rule.",
    "relief_granted": "Appeal allowed; High Court judgment set aside.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The fact that the Appellate Authority had read out the contents of the police report was enough compliance with the rules of natural justice.",
      "speaker": "court",
      "significance": "Core holding on natural justice in context."
    },
    {
      "text": "The tribunal in question was not administering justice as a court of law, though while deciding as between the rival claims of the applicants for a permit it had to deal with them in a fair and just manner.",
      "speaker": "court",
      "significance": "Distinguishes quasi-judicial from judicial procedure."
    },
    {
      "text": "They must act in good faith and fairly listen to both sides, for that is a duty lying upon everyone who decides anything. But I do not think they are bound to treat such a question as though it were a trial.",
      "speaker": "court",
      "significance": "Quotes Lord Loreburn LC from Board of Education v. Rice on statutory duties."
    }
  ],
  "_case_id": "1956_70",
  "_label": 1,
  "_text_length": 45651,
  "_extracted_at": "2026-02-08T22:12:37.179248"
}