{
  "metadata": {
    "case_name": "Babubhai Dullabhbhai Bhandari v. District Magistrate of Thana & Ors. (Petition No. 439 of 1955) and Kunwar Rameshwar Singh v. Deputy Commissioner of Police & Ors. (Petition No. 440 of 1955)",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "S. R. Das C.J.",
      "Venkatarama Ayyar J.",
      "B. P. Sinha J.",
      "Jafer Imam J.",
      "Sinha J.",
      "Jagannadhadas J."
    ],
    "case_number": "Petitions Nos. 439 and 440 of 1955",
    "date_of_judgment": "1956-05-08"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner in Petition No. 439, Babubhai Dullabhbhai Bhandari, is a citizen of India carrying on trade in grass at Bhilad, a railway station on the Western Railway.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "On 21st January 1955, Deputy Superintendent of Police and Sub-Divisional Police Officer, Bhiwandi Division, served notice under section 56 of Bombay Police Act, 1951 on petitioner in Petition No. 439 alleging dealing in smuggled foreign liquor, criminal intimidation, physical violence, assaults on villagers and Central Excise/Customs officials, possession of unlicensed firearms, causing alarm in Bhilad and surrounding areas.",
      "type": "material",
      "date": "1955-01-21",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Petitioner in Petition No. 439 appeared before the police officer on 27th January 1955 and on subsequent dates, examined seven respectable persons as witnesses.",
      "type": "procedural",
      "date": "1955-01-27",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "On 11th July 1955, District Magistrate of Thana passed externment order against petitioner in Petition No. 439, satisfied that petitioner engages in threats, assaults on officials and residents, illicit liquor traffic, and witnesses unwilling to come forward due to apprehension.",
      "type": "material",
      "date": "1955-07-11",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Appeal against externment order in Petition No. 439 dismissed by Government on 9th September 1955.",
      "type": "procedural",
      "date": "1955-09-09",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Petition under Article 226 in Bombay High Court against externment in Petition No. 439 dismissed in limine on 7th November 1955.",
      "type": "procedural",
      "date": "1955-11-07",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "District Magistrate of Thana affirmed in affidavit that order passed after considering police reports, petitioner's explanation, witnesses; material not vague; witnesses unwilling to depose publicly; activities cause alarm to public and officials near Daman border; petitioner discharged earlier due to witness fear.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Petitioner in Petition No. 440, Kunwar Rameshwar Singh, is a citizen of India, social worker involved in improving lot of prostitutes and singing girls in Bombay.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "On 2nd November 1954, notice under section 56 read with section 59 served on petitioner in Petition No. 440 alleging since October 1953, movements and acts causing alarm in Falkland Road etc. areas by extorting money from prostitutes, singing girls, shopkeepers etc. with threats, assaults, posting associates to prevent customers, damaging property; witnesses unwilling.",
      "type": "material",
      "date": "1954-11-02",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "On 4th January 1955, Deputy Commissioner of Police, Crime Branch, passed externment order against petitioner in Petition No. 440 directing removal from Greater Bombay within 7 days, not to enter for 2 years without permission.",
      "type": "material",
      "date": "1955-01-04",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appeal against externment in Petition No. 440 dismissed by State of Bombay on 17th January 1955.",
      "type": "procedural",
      "date": "1955-01-17",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Article 226 petition in Bombay High Court dismissed on 14th March 1955; Letters Patent Appeal dismissed holding court cannot go behind officer's opinion on witnesses.",
      "type": "procedural",
      "date": "1955-03-14",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Petitioner in Petition No. 440 entered Greater Bombay on 6th April 1955 due to arrest warrant in pending case, arrested for breach of externment, convicted under section 142, sentenced to 9 months RI on 8th September 1955; appeal dismissed by High Court on 5th October 1955; special leave petition dismissed by Supreme Court on 21st November 1955.",
      "type": "procedural",
      "date": "1955-04-06",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Affidavit by first respondent in Petition No. 440 details petitioner's background: ex-navy, dismissed from jobs for unreliability, false representations for accommodation/shops, convicted; activities in redlight district with bad associates extorting money by violence.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Petitions heard with Petition No. 272 of 1955 under section 57.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Constitutionality of section 56 of Bombay Police Act, 1951, particularly whether it violates Article 19, and validity of externment orders passed thereunder.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether opportunity under section 59 was properly given, as particulars of evidence not supplied.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Interpretation of 'witnesses are not willing to come forward': whether applies only if all witnesses unwilling, or excludes police/customs officials.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Not given full opportunity under section 59 as particulars of evidence and alleged activities not supplied.",
      "supporting_facts": [
        "f3",
        "f10"
      ],
      "legal_basis": "Section 59 Bombay Police Act"
    },
    {
      "id": "pa2",
      "text": "Section 56 requires all witnesses unwilling; Gurbachan Singh supports this.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": "Gurbachan Singh v. State of Bombay"
    },
    {
      "id": "pa3",
      "text": "Witnesses under section 56(1)(b) exclude police and customs officials who must give evidence publicly.",
      "supporting_facts": [
        "f2",
        "f7"
      ],
      "legal_basis": "Section 56 Bombay Police Act"
    },
    {
      "id": "pa4",
      "text": "Section 56 contravenes Article 19; externment unreasonable restriction.",
      "supporting_facts": [
        "f4",
        "f10"
      ],
      "legal_basis": "Article 19 Constitution of India"
    },
    {
      "id": "pa5",
      "text": "In Petition No. 440, conviction under section 142 indicates unreasonableness; entered Bombay due to arrest warrant.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Section 142 Bombay Police Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Orders passed after considering police reports, explanations, witnesses; material clear, not vague; names withheld as witnesses unwilling due to fear.",
      "supporting_facts": [
        "f2",
        "f4",
        "f7",
        "f9",
        "f10",
        "f14"
      ],
      "legal_basis": "Sections 56, 59 Bombay Police Act"
    },
    {
      "id": "ra2",
      "text": "Petitioner's activities cause alarm, danger to persons/property, public servants; previous discharge due to witness fear.",
      "supporting_facts": [
        "f2",
        "f7",
        "f14"
      ],
      "legal_basis": "Section 56(1)(a), (b)"
    },
    {
      "id": "ra3",
      "text": "In Petition No. 440, no police conspiracy; fair opportunity given; witnesses changed statements under petitioner's influence; no permission obtained for re-entry.",
      "supporting_facts": [
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 56 valid as per Gurbachan Singh; no need to re-examine; opportunity under s.59 given by informing general nature of allegations.",
      "addresses_issue": "i1",
      "key_observation": "Provisions dealt with in companion case Petition No. 272."
    },
    {
      "id": "cr2",
      "text": "Gurbachan Singh does not require all witnesses unwilling; section does not lend to extreme contention.",
      "addresses_issue": "i3",
      "key_observation": "Not reading too much into observations."
    },
    {
      "id": "cr3",
      "text": "Witnesses include police/customs; no restricted meaning; if officer satisfied witnesses unwilling, condition fulfilled regardless of class.",
      "addresses_issue": "i3",
      "key_observation": "Counsel of perfection not required."
    },
    {
      "id": "cr4",
      "text": "Petition No. 440 order upheld in criminal proceedings up to Supreme Court special leave refusal; could have obtained permission.",
      "addresses_issue": "i1",
      "key_observation": "Closed chapter."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 56 of Bombay Police Act, 1951 is not unconstitutional; externment orders valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Provisions applicable even if some witnesses willing or if they are police/customs officials.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gurbachan Singh v. State of Bombay",
      "citation": "1952 S.C.R. 737",
      "treatment": "followed",
      "relevance": "Upholds constitutionality of similar provisions in prior Police Act; applies to s.56."
    },
    {
      "case_name": "Gurbachan Singh v. State of Bombay",
      "citation": "1952 S.C.R. 787",
      "treatment": "followed",
      "relevance": "Interprets 'witnesses not willing' for exceptional cases."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Police Act, 1951",
      "sections": [
        "56",
        "57",
        "58",
        "59",
        "142"
      ],
      "relevance": "Challenged provisions for externment; procedure, duration, breach."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "19",
        "32",
        "226"
      ],
      "relevance": "Article 19 for reasonableness; 32/226 for petitions."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "Chapter XII",
        "Chapter XVI",
        "Chapter XVII"
      ],
      "relevance": "Offences involving force/violence/abetment triggering s.56(1)(b)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Petitions under Article 32 challenging constitutionality of section 56 Bombay Police Act and externment orders dismissed; section held valid following Gurbachan Singh; no merit in contentions.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The law is certainly an extraordinary one and has been made only to meet those exceptional cases where no witnesses for fear of violence... are willing to depose publicly against certain bad characters.",
      "speaker": "court",
      "significance": "From Gurbachan Singh, cited to interpret s.56 scope."
    },
    {
      "text": "If such an extreme interpretation were to be put on that part of section 56, it is not difficult to imagine a situation where it will become almost impossible to apply that section to any case.",
      "speaker": "court",
      "significance": "Rejects argument that all witnesses must be unwilling."
    },
    {
      "text": "Externment might appear on the surface not to be as serious an interference with personal liberty as detention. But in actual practice it may be productive of more serious injury.",
      "speaker": "court",
      "significance": "Jagannadhadas J.'s separate opinion expressing reservations but concurring."
    }
  ],
  "_case_id": "1956_69",
  "_label": 0,
  "_text_length": 33490,
  "_extracted_at": "2026-02-10T19:16:14.889132"
}