{
  "metadata": {
    "case_name": "Barsi Light Railway Company Limited v. President of the Barsi Light Railwaymens Union & Ors. and Shri Dinesh Mills Ltd. v. District Labour Officer",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das J."
    ],
    "case_number": "Civil Appeals Nos. 103 and 105 of 1956",
    "date_of_judgment": "1956-11-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Under an agreement dated August 1, 1895, between the Secretary of State for India in Council and the Barsi Light Railway Company Limited, the latter constructed, maintained and worked a light railway between Barsi Town and Barsi Road Station.",
      "type": "background",
      "date": "1895-08-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Agreement contained a clause under which the Secretary of State could purchase and take over the undertaking after giving the Railway Company not less than twelve calendar months' notice in writing.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On December 19, 1952, a notice was given to the Railway Company, for and on behalf of the President of India, by the Director of the Railway Board that the undertaking would be purchased and taken over as from January 1, 1954.",
      "type": "material",
      "date": "1952-12-19",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Notice stated that the President of India gives notice of the determination of the original contract of August 1, 1895, and supplemental contracts, terminating on expiration of 12 months, and purchase on January 1, 1954, including entire railway system, rolling stock, etc., as per clauses 43 and 63.",
      "type": "material",
      "date": "1952-12-19",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On November 11, 1953, the Railway Company served a notice on its workmen that as a result of Government terminating the contract and taking over from January 1, 1954, services of all workmen terminated with effect from afternoon of December 31, 1953; Government intended to employ willing staff on terms to be notified.",
      "type": "material",
      "date": "1953-11-11",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On December 15, 1953, Railway Board intimated terms and conditions for taking over staff, enclosing forms for different categories; service treated as continuous for specific purposes only (provident fund, leave, etc.), but Government rules applicable, previous service not counting for seniority.",
      "type": "material",
      "date": "1953-12-15",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Undertaking taken over on January 1, 1954; about 77% staff re-employed on same scales of pay, 23% on somewhat lower scales but actual pay not affected, 24 declined service.",
      "type": "material",
      "date": "1954-01-01",
      "source": "respondents 4 and 5"
    },
    {
      "id": "f8",
      "text": "Respondent No. 1 filed sixty-one applications on behalf of erstwhile workmen under s.15 Payment of Wages Act, 1936, for retrenchment compensation under cl.(b) of s.25F Industrial Disputes Act, 1947, before Civil Judge Junior Division Madha (respondent No.3).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Civil Judge Madha found against workmen on jurisdiction (issue 1), but in favour on entitlement to compensation (issue 2) and retrenchment on Dec 31, 1953 (issue 3); applications dismissed for lack of jurisdiction; findings governed other applications by consent.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Respondent No.1 moved Bombay High Court in Special Civil Application No.2546 of 1954 under Arts.226/227 Constitution for quashing dismissal order and directing merits decision.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "In High Court, jurisdiction not argued; parties agreed to restrict to merits of claim under s.25F(b); Railway Company undertook to accept finding subject to appeal; High Court (Chagla CJ & Dixit J) on January 24, 1955 held workmen entitled to compensation.",
      "type": "procedural",
      "date": "1955-01-24",
      "source": "high_court"
    },
    {
      "id": "f12",
      "text": "Shri Dinesh Mills Ltd. running woollen mill at Baroda with 450 workmen and 20 clerks, working in shifts.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On or about October 31, 1953, notice declaring intention to close entire mills from December 1, 1953.",
      "type": "material",
      "date": "1953-10-31",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "On November 19, 1953, notice withdrawn; new notice for closing second shift from December 20, 1953.",
      "type": "material",
      "date": "1953-11-19",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Third notice: second shift closed December 20, 1953; first shift from January 8, 1954; clerks terminated January 19, 1954.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Closure process staggered but resulted in termination of all 450 workmen and 20 clerks; bona fide due to heavy losses.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "On April 27, 1954, District Labour Officer (principal respondent) applied under Payment of Wages Act to authority (respondent No.3) for retrenchment compensation under s.25F(b).",
      "type": "procedural",
      "date": "1954-04-27",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Authority decided against workmen on jurisdiction and merits.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Respondent moved Bombay High Court; High Court (Bavdekar & Shah JJ) on July 25, 1955 held jurisdiction exists, accepted prior bench decision on merits, set aside order, directed merits disposal.",
      "type": "procedural",
      "date": "1955-07-25",
      "source": "high_court"
    },
    {
      "id": "f20",
      "text": "Appeals brought on certificates from Bombay High Court; common questions.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "In Civil Appeal 103/1956, counsel does not press jurisdiction as s.25I ID Act allows recovery if valid.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the claim of erstwhile workmen to compensation under cl.(b) of s.25F of the Industrial Disputes Act, 1947 is valid, i.e., whether termination of services on bona fide closure of business (Dinesh Mills) or takeover by Government (Railway Company) constitutes 'retrenchment' under s.2(oo).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether authority under Payment of Wages Act, 1936 has jurisdiction to deal with retrenchment compensation claims (live in Civil Appeal 103/1956).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Retrenchment in ordinary acceptation means termination of surplus staff in continuing business, not all workmen on closure of business.",
      "supporting_facts": [
        "f1",
        "f3",
        "f5",
        "f7",
        "f12",
        "f13",
        "f14",
        "f15",
        "f16"
      ],
      "legal_basis": "s.2(oo) ID Act; ordinary meaning; Pipraich Sugar Mills Ltd. v. Pipraich Sugar Mills Mazdoor Union"
    },
    {
      "id": "pa2",
      "text": "Definition s.2(oo) embodies ordinary meaning; 'for any reason whatsoever' limited by context to continuing industry; scheme of ID Act assumes existing industry.",
      "supporting_facts": [
        "f9",
        "f11",
        "f18",
        "f19"
      ],
      "legal_basis": "ss.25A-25E, 25G, 25H ID Act; Burn Co. v. Employees; Indian Metal and Metallurgical Corporation v. Industrial Tribunal"
    },
    {
      "id": "pa3",
      "text": "s.25FF (1956) supersedes judicial decisions on change of employer, not exposition of s.25F including closure.",
      "supporting_facts": [],
      "legal_basis": "Industrial Disputes (Amendment and Miscellaneous Provisions) Act, 1956"
    },
    {
      "id": "pa4",
      "text": "s.25F constitutionally invalid as unreasonable restriction on right to close business under Art.19(1)(g).",
      "supporting_facts": [],
      "legal_basis": "Arts.19(1)(f),(g),(5),(6) Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Definition of retrenchment in s.2(oo) is wide: termination by employer for any reason whatsoever (excluding punishment, voluntary retirement, etc.), includes closure.",
      "supporting_facts": [
        "f5",
        "f7",
        "f16"
      ],
      "legal_basis": "s.2(oo), s.25F ID Act"
    },
    {
      "id": "ra2",
      "text": "Pre-1953 tribunal decisions awarded compensation on closure; s.25F gives statutory effect.",
      "supporting_facts": [],
      "legal_basis": "Hyderabad Vegetable Oil Products Ltd. v. Their Workers; Kandan Textiles Ltd. v. Their Workers"
    },
    {
      "id": "ra3",
      "text": "s.25FF with non-obstante clause is parliamentary exposition that s.25F applies to change of employer/closure unless conditions met.",
      "supporting_facts": [],
      "legal_basis": "s.25FF ID Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Definition s.2(oo) requires: (a) termination of service of workman (b) by employer (c) for any reason whatsoever (d) not punishment; ordinary meaning of retrenchment (discharge of surplus in continuing business) fits perfectly.",
      "addresses_issue": "i1",
      "key_observation": "'For any reason whatsoever' gets colour from context; no compelling words to extend beyond ordinary meaning to bona fide closure."
    },
    {
      "id": "cr2",
      "text": "Scheme of ID Act contemplates existing/continuing industry; provisions like lay-off, strike, retrenchment meaningless for closed industry.",
      "addresses_issue": "i1",
      "key_observation": "Closure disputes outside Act's purview."
    },
    {
      "id": "cr3",
      "text": "Pre-1953 tribunals awarded compensation on closure as equitable relief, not normal retrenchment; s.25F standardizes for ordinary retrenchment in continuing industry.",
      "addresses_issue": "i1",
      "key_observation": "Legislature did not intend to codify closure compensation."
    },
    {
      "id": "cr4",
      "text": "s.25FF partially supersedes judicial decisions on change of employer causing deadlock, not exposition of s.25F; Industrial Disputes (A&M) Act 1956 distinguishes retrenchment and closure.",
      "addresses_issue": "i1",
      "key_observation": "Later schedules show retrenchment != closure."
    },
    {
      "id": "cr5",
      "text": "No need to decide constitutional validity as s.25F inapplicable to closures/takeovers.",
      "addresses_issue": "i1",
      "key_observation": "Applies only to continuing industry."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Retrenchment under s.2(oo) and s.25F means discharge of surplus labour/staff in continuing/running industry for any reason (not punishment); does not include termination of all workmen on bona fide closure (Dinesh Mills) or takeover (Railway Company).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pipraich Sugar Mills Ltd. v. Pipraich Sugar Mills Mazdoor Union",
      "citation": "1956 S.C.R. 872",
      "treatment": "followed",
      "relevance": "Ordinary meaning of retrenchment excludes closure; scheme of Act for existing industry."
    },
    {
      "case_name": "Burn & Co., Calcutta v. Their Employees",
      "citation": "1956 S.C.R. 781",
      "treatment": "followed",
      "relevance": "Object of labour legislation: fair terms, prevent disputes in existing industry."
    },
    {
      "case_name": "Indian Metal and Metallurgical Corporation v. Industrial Tribunal, Madras",
      "citation": "A.I.R. 1953 Madras 98",
      "treatment": "followed",
      "relevance": "ID Act applies to existing industry."
    },
    {
      "case_name": "K. M. Padmanabha Ayyar v. State of Madras",
      "citation": "1954 1 L.L.J. 469",
      "treatment": "followed",
      "relevance": "Disputes on closed bona fide business outside ID Act."
    },
    {
      "case_name": "Hyderabad Vegetable Oil Products Ltd. v. Their Workers",
      "citation": "1950 2 L.L.J. 1281",
      "treatment": "distinguished",
      "relevance": "Awarded compensation on closure as equitable relief, not normal retrenchment."
    },
    {
      "case_name": "Employees of Messrs. India Reconstruction Corporation Ltd. v. Messrs. India Reconstruction Corporation Ltd.",
      "citation": "1953 L.A.C 563",
      "treatment": "distinguished",
      "relevance": "Difference between closure and retrenchment one of degree only; dissented from."
    },
    {
      "case_name": "Kandan Textiles Ltd. v. Their Workers",
      "citation": "1954 2 249",
      "treatment": "distinguished",
      "relevance": "Compensation on closure as equitable relief."
    },
    {
      "case_name": "Hospital Mazdoor Sabha v. State of Bombay",
      "citation": "1956 58 Bom. L.R. 769",
      "treatment": "referred",
      "relevance": "Non-compliance with s.25F(b) allows challenge to retrenchment; led to s.25FF."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s.2(oo)",
        "s.15",
        "s.25F",
        "s.25G",
        "s.25H",
        "s.25I",
        "s.25FF",
        "ss.25A-25E"
      ],
      "relevance": "Definition and conditions for retrenchment compensation; applies to continuing industry; s.25FF for change of employer."
    },
    {
      "name": "Payment of Wages Act, 1936",
      "sections": [
        "s.15"
      ],
      "relevance": "Authority to entertain claims for retrenchment compensation (jurisdiction not pressed)."
    },
    {
      "name": "Industrial Disputes (Amendment) Act, 1953 (XLIII of 1953)",
      "sections": [],
      "relevance": "Inserted Ch. VA (lay-off, retrenchment), s.2(oo)."
    },
    {
      "name": "Industrial Disputes (Amendment) Act, 1956 (XLI of 1956)",
      "sections": [
        "s.25FF"
      ],
      "relevance": "Inserted s.25FF excluding compensation on change of employer if conditions met."
    },
    {
      "name": "Industrial Disputes (Amendment and Miscellaneous Provisions) Act, 1956 (XXXVI of 1956)",
      "sections": [
        "Schedules (item 10 Third/Fourth)"
      ],
      "relevance": "Distinguishes retrenchment and closure."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Arts.19(1)(f),(g),(5),(6)",
        "Arts.226,227"
      ],
      "relevance": "Right to close business; writ jurisdiction."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Both appeals allowed; Bombay High Court judgments set aside; appellants not liable to pay retrenchment compensation under s.25F as no retrenchment occurred.",
    "relief_granted": "No compensation payable to erstwhile workmen.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'Retrenchment connotes in its ordinary acceptation that the business itself is being continued but that a portion of the staff or the labour force is discharged as plusage and the termination of services of all the workmen as a result of the closure of the business cannot therefore be properly described as retrenchment.'",
      "speaker": "court",
      "significance": "Defines ordinary meaning of retrenchment excluding closure."
    },
    {
      "text": "Retrenchment means the termination by the employer of the service of a workman for any reason whatsoever, otherwise than as a punishment inflicted by way of disciplinary action, but does not include... (exclusions).",
      "speaker": "court",
      "significance": "Quotes s.2(oo) definition and analyzes its scope."
    },
    {
      "text": "We hold... that retrenchment as defined in s.2(oo) and as used in s.25F has no wider meaning than the ordinary, accepted connotation of the word; it means the discharge of surplus labour or staff... and it has no application where the services of all workmen have been terminated... on a real and bona fide closure of business.",
      "speaker": "court",
      "significance": "Core holding resolving the main issue."
    }
  ],
  "_case_id": "1956_90",
  "_label": 1,
  "_text_length": 44092,
  "_extracted_at": "2026-02-10T19:16:18.771780"
}