{
  "metadata": {
    "case_name": "Dwarika Das Bhatia v. State of Jammu and Kashmir",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "JAGANNADHADAS J."
    ],
    "case_number": "Petition No. 172 of 1956",
    "date_of_judgment": "1956-11-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner placed under detention by order of District Magistrate, Jammu under sub-section 2 of section 3 of Jammu and Kashmir Preventive Detention Act, 2011 on 1st May 1956.",
      "type": "procedural",
      "date": "1956-05-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Detention order confirmed and continued on 5th September 1956 by Government under sub-section 1 of section 12 of the Act after taking opinion of Advisory Board.",
      "type": "procedural",
      "date": "1956-09-05",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Both detention orders recited necessity to prevent petitioner from acting in manner prejudicial to maintenance of supplies and services essential to community.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Grounds of detention communicated on 31st May 1956: Petitioner carried on smuggling of essential goods (cloth, zari, mercury) to Pakistan through Ferozpur, Amritsar, and recently Ranbirsinghpura borders, affecting economic condition of public in Kashmir adversely.",
      "type": "disputed",
      "date": "1956-05-31",
      "source": "district_magistrate"
    },
    {
      "id": "f5",
      "text": "On 7th April 1956, petitioner went to village Darsoopura, contacted Ghulam Ahmed and Ram Lal for smuggling Shaffon cloth worth Rs. 2,500 to Pakistan through Ranbirsinghpura border.",
      "type": "material",
      "date": "1956-04-07",
      "source": "district_magistrate"
    },
    {
      "id": "f6",
      "text": "On 11th April 1956, petitioner booked 3 bales of silk cloth through Messrs Jaigopal Rajkumar Shegal of Amritsar to Jammu Tawi addressed to self, and one package of Tila through S. Kanti Lal Zarianwalla of Amritsar to Jammu Tawi.",
      "type": "material",
      "date": "1956-04-11",
      "source": "district_magistrate"
    },
    {
      "id": "f7",
      "text": "Petitioner came to Jammu, waited for goods, contacted Ghulam Ahmed and Ram Lal; on 15th April 1956 tried to get transport receipt from Punjab National Bank but failed as public holiday; goods seized by Central Customs and Excise Department.",
      "type": "material",
      "date": "1956-04-15",
      "source": "district_magistrate"
    },
    {
      "id": "f8",
      "text": "High Court of Jammu and Kashmir in judgment dated 21st June 1956 held Shaffon cloth not an essential commodity under Essential Supplies Temporary Powers Ordinance; zari (luxury article) not essential; mercury is essential commodity; upheld petitioner's detention due to mercury.",
      "type": "procedural",
      "date": "1956-06-21",
      "source": "high_court"
    },
    {
      "id": "f9",
      "text": "Particulars in grounds relate only to cloth and zari (tila is zari); no material that smuggling was substantially only mercury or others inconsequential.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether detention order is illegal if based on smuggling of three commodities where two (Shaffon cloth, zari) are not essential goods, though one (mercury) is essential.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Detention based on assumption that Shaffon cloth, zari and mercury are all essential goods; since two are not, entire order illegal despite mercury being essential.",
      "supporting_facts": [
        "f4",
        "f8"
      ],
      "legal_basis": "Dr. Ram Krishan Bhardwaj v. State of Delhi; Shibban Lal Saksena v. State of U.P."
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Principle of Dr. Ram Krishan Bhardwaj and Shibban Lal Saksena has no application; attempts to distinguish those cases.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Zari not essential commodity, confirmed on instructions.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Essential Supplies Temporary Powers Ordinance"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In Dr. Ram Krishan Bhardwaj, vagueness of some grounds vitiates entire order as constitutional safeguard must be satisfied for each ground.",
      "addresses_issue": "i1",
      "key_observation": "Preventive detention serious invasion of liberty; safeguards jealously enforced."
    },
    {
      "id": "cr2",
      "text": "In Shibban Lal Saksena, if one ground non-existent, cannot uphold on remaining ground as substitutes objective test for subjective satisfaction.",
      "addresses_issue": "i1",
      "key_observation": "Court cannot assess how each ground contributed to satisfaction."
    },
    {
      "id": "cr3",
      "text": "Principle: If satisfaction based on multiple grounds and some invalid, order vitiated unless invalid grounds inconsequential.",
      "addresses_issue": "i1",
      "key_observation": "No material smuggling substantially only mercury; particulars emphasize cloth and zari."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Order of detention bad and must be quashed as two out of three commodities not essential and likely affected subjective satisfaction.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dr. Ram Krishan Bhardwaj v. State of Delhi",
      "citation": "1953 S.C.R. 708",
      "treatment": "followed",
      "relevance": "Vagueness of some grounds vitiates entire detention order."
    },
    {
      "case_name": "Shibban Lal Saksena v. State of U.P.",
      "citation": "1954 S.C.R. 418",
      "treatment": "followed",
      "relevance": "If one ground non-existent, cannot uphold detention on remaining ground."
    },
    {
      "case_name": "Atma Ram Sridhar Vaidya",
      "citation": "1951 S.C.R. 167",
      "treatment": "referred",
      "relevance": "Obligation to supply grounds enables fair representation."
    },
    {
      "case_name": "Keshav Talpade v. King Emperor",
      "citation": "1943 F.C.R. 88",
      "treatment": "followed",
      "relevance": "If some reasons bad, cannot be certain extent they operated on authority's mind."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 21",
        "Article 22"
      ],
      "relevance": "Basis for habeas corpus; safeguards against improper detention."
    },
    {
      "name": "Jammu and Kashmir Preventive Detention Act, 2011",
      "sections": [
        "Section 3(2)",
        "Section 12(1)",
        "Section 7"
      ],
      "relevance": "Authority for detention order and communication of grounds."
    },
    {
      "name": "Essential Supplies Temporary Powers Ordinance of Jammu and Kashmir",
      "sections": [],
      "relevance": "Defines essential commodities; Shaffon cloth, zari not essential, mercury is."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court quashed the detention order dated 5th September 1956 confirming earlier order, holding it invalid due to two non-essential commodities forming substantial part of grounds.",
    "relief_granted": "Writ of habeas corpus issued; detention quashed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Preventive detention is a serious invasion of personal liberty and such meager safeguards as the Constitution has provided against the improper exercise of the power must be jealously watched and enforced by the Court.\"",
      "speaker": "court",
      "significance": "Emphasizes strict enforcement of constitutional safeguards."
    },
    {
      "text": "\"To say that the other ground, which still remains, is quite sufficient to sustain the order, would be to substitute an objective judicial test for the subjective decision of the executive authority.\"",
      "speaker": "court",
      "significance": "Core principle why partial invalidity vitiates entire order."
    },
    {
      "text": "\"We are, therefore, clearly of the opinion that the order of detention in this case is bad and must be quashed.\"",
      "speaker": "court",
      "significance": "Final determination on validity."
    }
  ],
  "_case_id": "1956_46",
  "_label": 1,
  "_text_length": 14586,
  "_extracted_at": "2026-02-10T19:15:15.798095"
}