{
  "metadata": {
    "case_name": "The Mill v. Poona Girni Kamagar Union",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "GOVINDA MENON J."
    ],
    "case_number": "Civil Appeal No. 323 of 1955",
    "date_of_judgment": "1956-10-31"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant (The Mill) owns Cotton Textile Spinning and Weaving Mill in Poona, employing large number of workmen with Poona Girni Kamagar Union.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant running 580 looms, one weaver allotted two looms.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On August 29, 1951, Management issued notice to carry experiment of four looms per weaver for 2 months on 16 looms from September 1, 1951, to introduce rationalization if successful, after notice under the Act.",
      "type": "material",
      "date": "1951-08-29",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On September 4, 1951, Secretary of Union wrote to Manager that under Bombay Industrial Relations Act, Management cannot introduce change without notice in prescribed form and procedure; warned of hardship and inability to control workers.",
      "type": "material",
      "date": "1951-09-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Four workers volunteered for experiment on 16 looms starting September 6, 1951; other workmen objected and prevented them.",
      "type": "material",
      "date": "1951-09-06",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Management did not withdraw notice; except the 4, others required to take part; second shift refused, leading to complete strike from September 6 to 26, 1951.",
      "type": "material",
      "date": "1951-09-06 to 1951-09-26",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On September 10, 1951, appellant filed application under ss.78 and 97 of Bombay Industrial Relations Act before Labour Court declaring strike illegal.",
      "type": "procedural",
      "date": "1951-09-10",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On September 16, 1951, Vice-President of Mill Mazdoor Sabha filed written statement denying illegal strike, stating workers refused only illegal experiment, agreeable to two looms.",
      "type": "procedural",
      "date": "1951-09-16",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Within three days, two workers filed application under ss.78 and 98 before same Labour Court declaring Management's action illegal lockout and ordering withdrawal of illegal change.",
      "type": "procedural",
      "date": "1951-09-19 approx",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant filed written statement denying illegal lockout or illegal change.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Labour Court by combined order dated September 26, 1951: no illegal lockout as no compulsion; no illegal strike; but declared Management's action illegal change, ordered withdrawal of notice.",
      "type": "procedural",
      "date": "1951-09-26",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Workers content; Management appealed to Labour Appellate Tribunal (Appeal No. 293 of 1951); Tribunal held strike illegal, no lockout, set aside illegal change declaration.",
      "type": "procedural",
      "date": "1952-09-04",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Two workers filed writ of certiorari under Arts. 226/227 in Bombay High Court (Special Civil Application No. 159 of 1953); Chagla C.J. and Dixit J. quashed Tribunal order, upheld Labour Court.",
      "type": "procedural",
      "date": "1953-07-02",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Bombay High Court granted certificate under Art. 133(1)(c) on July 20, 1954 for SC appeal.",
      "type": "procedural",
      "date": "1954-07-20",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the strike was illegal under s.97(1)(c) of Bombay Industrial Relations Act, 1946, as commenced/continued only for reason that employer made an illegal change.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Construction of s.97(1)(c): whether strike illegal if for legal change (a fortiori argument), or only if workers believed change illegal.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No common law right to strike; s.97(1)(c) makes strike illegal if commenced/continued only because employer made illegal change; a fortiori illegal for legal change.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "s.97(1)(c) Bombay Industrial Relations Act, 1946"
    },
    {
      "id": "pa2",
      "text": "'Only' modifies 'reason'; strike illegal if workers struck believing change illegal, regardless of whether it was actually illegal.",
      "supporting_facts": [
        "f4",
        "f9"
      ],
      "legal_basis": "s.97(1)(c) Bombay Industrial Relations Act, 1946"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Common law right to strike exists; statutory prohibition only for certain cases; since no illegal change, strike not within s.97.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "s.97 Bombay Industrial Relations Act, 1946"
    },
    {
      "id": "ra2",
      "text": "Workmen have right to strike as collective bargaining against detrimental changes, if not prohibited by s.97.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Bombay Industrial Relations Act, 1946"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Unnecessary to decide common law right to strike; second argument correct: test is reason for strike; workers struck only because they believed change illegal (as per their application).",
      "addresses_issue": "i1",
      "key_observation": "Strike within express terms of s.97(1)(c) if for reason employer made illegal change, immaterial if later found legal."
    },
    {
      "id": "cr2",
      "text": "Workers' application explicitly prayed declaration of illegal change and lockout, confirming reason for strike.",
      "addresses_issue": "i2",
      "key_observation": "High Court did not consider this aspect fully."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Strike from September 6 to 26, 1951 illegal under s.97(1)(c) as commenced/continued only for reason employer made illegal change.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bombay Industrial Relations Act, 1946",
      "sections": [
        "s.3(8)",
        "s.3(15)",
        "s.46(4)",
        "s.46(5)",
        "s.42",
        "s.3(18)",
        "Sch. II para 4",
        "s.3(35)",
        "s.3(36)",
        "s.97",
        "s.98",
        "s.78"
      ],
      "relevance": "Defines change, illegal change, notice requirements, industrial matter, stoppage, strike, illegal strikes/lockouts; applied to determine legality of strike and change."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 133(1)(c)",
        "Art. 226",
        "Art. 227"
      ],
      "relevance": "Certificate for appeal; writ jurisdiction."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order dated July 2, 1953 set aside; Labour Appellate Tribunal order dated September 4, 1952 restored, declaring strike illegal with usual consequences.",
    "relief_granted": "Declaration that strike illegal.",
    "costs": "Appellant agreed to pay taxed costs of respondents in one set while seeking certificate."
  },
  "key_quotes": [
    {
      "text": "\"a strike shall be illegal if it is commenced or continued only for the reason that the employer has not carried out the provisions of any standing order or has made an illegal change.\"",
      "speaker": "court",
      "significance": "Quotes s.97(1)(c) central to interpretation."
    },
    {
      "text": "The true test was to find out the reason for which the strike was commenced or continued.",
      "speaker": "court",
      "significance": "Core holding on construction of s.97(1)(c)."
    },
    {
      "text": "\"That for the above-mentioned reasons it is prayed that this Honourable Court be pleased to declare the said lockout by the opponent Mills as illegal... and the opponent be ordered to withdraw the said illegal change.\"",
      "speaker": "respondent",
      "significance": "Workers' own plea confirming reason for strike was belief in illegal change."
    }
  ],
  "_case_id": "1956_21",
  "_label": 1,
  "_text_length": 17764,
  "_extracted_at": "2026-02-08T22:12:32.098410"
}