{
  "metadata": {
    "case_name": "Dwarika Das Bhatia v. State of Jammu and Kashmir",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "JAGANNADHADAS J."
    ],
    "case_number": "Petition No. 172 of 1956",
    "date_of_judgment": "1956-11-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner placed under detention by order of District Magistrate, Jammu, under sub-section 2 of section 3 of Jammu and Kashmir Preventive Detention Act on 1st May 1956.",
      "type": "procedural",
      "date": "1956-05-01",
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "Detention order confirmed and continued on 5th September 1956 by Government under sub-section 1 of section 12 of the Act after taking opinion of Advisory Board.",
      "type": "procedural",
      "date": "1956-09-05",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Detention orders recited necessity to prevent petitioner from acting prejudicial to maintenance of supplies and services essential to community.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Grounds communicated on 31st May 1956: Petitioner carried on smuggling of essential goods (cloth, zari, mercury) to Pakistan through Ferozpur, Amritsar, and recently Ranbirsinghpura borders, affecting economic condition of public in Kashmir adversely.",
      "type": "disputed",
      "date": "1956-05-31",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "On 7th April 1956, petitioner went to village Darsoopura, contacted Ghulam Ahmed and Ram Lal for smuggling Shaffon cloth worth Rs. 2,500 to Pakistan through Ranbirsinghpura border.",
      "type": "disputed",
      "date": "1956-04-07",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "On 11th April 1956, petitioner booked 3 bales of silk cloth through Messrs Jaigopal Rajkumar Shegal of Amritsar to Jammu Tawi addressed to self, and one package of Tila through S. Kanti Lal Zarianwalla of Amritsar to self at Jammu Tawi.",
      "type": "disputed",
      "date": "1956-04-11",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Petitioner came to Jammu, waited for goods, contacted Ghulam Ahmed and Ram Lal; on 15th April 1956 tried to get transport receipt from Punjab National Bank but failed as public holiday; goods seized by Central Customs and Excise Department.",
      "type": "disputed",
      "date": "1956-04-15",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court of Jammu and Kashmir in judgment dated 21st June 1956 held Shaffon cloth not essential commodity under Essential Supplies Temporary Powers Ordinance; zari (luxury) not essential; mercury is essential (non-ferrous metal); upheld petitioner's detention due to mercury.",
      "type": "procedural",
      "date": "1956-06-21",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Particulars in grounds relate only to cloth and zari (tila is zari); no material that smuggling of mercury was substantial.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether detention order is illegal if based on smuggling of three commodities where two (Shaffon cloth and zari) are not essential goods, though one (mercury) is essential.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Detention based on assumption that Shaffon cloth, zari and mercury are all essential goods; since two out of three are not, entire order illegal despite mercury being essential.",
      "supporting_facts": [
        "f4",
        "f8"
      ],
      "legal_basis": "Dr. Ram Krishan Bhardwaj v. State of Delhi; Shibban Lal Saksena v. State of U.P."
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Principle of Dr. Ram Krishan Bhardwaj and Shibban Lal Saksena has no application; attempts to distinguish those cases.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Zari not essential commodity, confirmed on instructions.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Essential Supplies Temporary Powers Ordinance"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "If some grounds vague or irrelevant, constitutional safeguard infringed; each ground must satisfy requirement unless privileged.",
      "addresses_issue": "i1",
      "key_observation": "From Dr. Ram Krishan Bhardwaj: Vagueness of one ground vitiates entire order as it handicaps representation."
    },
    {
      "id": "cr2",
      "text": "Detaining authority's subjective satisfaction based on all grounds; cannot substitute objective test if some grounds non-existent.",
      "addresses_issue": "i1",
      "key_observation": "From Shibban Lal Saksena and Keshav Talpade: If some grounds invalid, cannot predicate what satisfaction would be without them."
    },
    {
      "id": "cr3",
      "text": "Here, two of three commodities not essential; no material smuggling substantially only mercury; particulars emphasize cloth and zari.",
      "addresses_issue": "i1",
      "key_observation": "Order based on smuggling relating to cloth, zari and mercury; exclusion of two might affect subjective satisfaction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Order of detention bad and must be quashed as some grounds non-existent, affecting subjective satisfaction.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dr. Ram Krishan Bhardwaj v. State of Delhi",
      "citation": "1953 S.C.R. 708",
      "treatment": "followed",
      "relevance": "Vagueness of one or some grounds vitiates entire detention order."
    },
    {
      "case_name": "Shibban Lal Saksena v. State of U.P.",
      "citation": "1954 S.C.R. 418",
      "treatment": "followed",
      "relevance": "If one ground non-existent, cannot uphold on remaining; substitutes objective for subjective satisfaction."
    },
    {
      "case_name": "Atma Ram Sridhar Vaidya",
      "citation": "1951 S.C.R. 167",
      "treatment": "referred",
      "relevance": "Grounds supplied to enable fair representation against detention."
    },
    {
      "case_name": "Keshav Talpade v. King Emperor",
      "citation": "1943 F.C.R. 88",
      "treatment": "followed",
      "relevance": "If some reasons bad, cannot be certain extent they operated on authority's mind."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 21",
        "Article 22(6)"
      ],
      "relevance": "Basis for writ of habeas corpus; safeguards against improper preventive detention."
    },
    {
      "name": "Jammu and Kashmir Preventive Detention Act",
      "sections": [
        "Section 3(2)",
        "Section 12(1)",
        "Section 7"
      ],
      "relevance": "Authority for detention order, confirmation, and communication of grounds."
    },
    {
      "name": "Essential Supplies Temporary Powers Ordinance of Jammu and Kashmir",
      "sections": [],
      "relevance": "Defines essential commodities; Shaffon cloth and zari not essential, mercury is."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court quashed the detention order dated 5th September 1956, holding it invalid due to non-essential nature of two out of three smuggled commodities forming grounds.",
    "relief_granted": "Writ of habeas corpus issued; detention quashed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Preventive detention is a serious invasion of personal liberty and such meager safeguards as the Constitution has provided against the improper exercise of the power must be jealously watched and enforced by the Court.\"",
      "speaker": "court",
      "significance": "Emphasizes strict scrutiny of detention safeguards."
    },
    {
      "text": "\"To say that the other ground, which still remains, is quite sufficient to sustain the order, would be to substitute an objective judicial test for the subjective decision of the executive authority.\"",
      "speaker": "court",
      "significance": "Core principle why invalid grounds vitiate entire order."
    },
    {
      "text": "\"We are, therefore, clearly of the opinion that the order of detention in this case is bad and must be quashed.\"",
      "speaker": "court",
      "significance": "Final determination on validity."
    }
  ],
  "_case_id": "1956_46",
  "_label": 1,
  "_text_length": 14586,
  "_extracted_at": "2026-02-08T22:12:33.806407"
}