{
  "metadata": {
    "case_name": "Appellant (distant agnate of Sheo Ghulam) v. First Defendant (nephew Murlidhar)",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar J."
    ],
    "case_number": "Civil Appeal No. 250 of 1953",
    "date_of_judgment": "1956-10-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Sheo Ghulam, a pious Hindu and resident of village Bhadesia, District Sitapur, constructed Thakurdwara of Sri Radhakrishnaji during 1914-1916 and installed idol ceremoniously.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Sheo Ghulam managed temple till his death in 1928 without issue.",
      "type": "background",
      "date": "1928",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On March 6, 1919, Sheo Ghulam executed a will bequeathing all lands to the Thakur.",
      "type": "material",
      "date": "1919-03-06",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Sheo Ghulam had two wives: Ram Kuar predeceased him; surviving widow Raj Kuar succeeded as Mutawalli per will and managed till her death in 1933.",
      "type": "background",
      "date": "1933",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "First defendant, nephew of Sheo Ghulam, got possession as manager per will provisions.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant, distant agnate of Sheo Ghulam, alleged mismanagement by first defendant and denial of public rights; moved District Court Sitapur under Religious and Charitable Endowments Act XIV of 1920, but court declined as private endowment.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Application to Advocate-General for sanction under s.92 CPC refused as private.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Appellant filed suit (Regular Civil Suit No. 14 of 1944) for declaration that Thakurdwara is public temple where all Hindus entitled to worship.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "First defendant contested suit claiming Thakurdwara and idols private, no public right to interfere.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Additional Civil Judge Sitapur dismissed suit holding private temple for family worship (decree Nov 25, 1944).",
      "type": "procedural",
      "date": "1944-11-25",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "District Judge Sitapur affirmed in Appeal No. 4 of 1945 (decree May 30, 1945).",
      "type": "procedural",
      "date": "1945-05-30",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Chief Court of Oudh affirmed in Second Appeal No. 365 of 1945 (judgment July 14, 1948), granted certificate under s.109 CPC.",
      "type": "procedural",
      "date": "1948-07-14",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Will (Exhibit A-1): After death sans male issue, immovable properties endowed to Sri Radhakrishnan; wives as Mutawallis; half income to wives for life, rest to Thakurdwara; post-wives, whole income to Thakurdwara.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Will Clause 4: If son born, divide properties (not happened).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Will Clause 5: Mutawallis no power to sell/mortgage; maintain accounts; surplus deposit and buy property in deity name.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Will Clause 2: Committee of 4 for management, 2 non-relations different caste; post-wives, committee may appoint nephew Murlidhar (first defendant) unanimously.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Will Clause 3: Fill vacancies in committee.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Will Clause 6: Any heir's claim improper per deed.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Public user: Villagers worshipped freely; built at villagers' instance as no prior temple.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f20",
      "text": "Pujari (PW2) stopped outsiders during wife's purdah puja.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Consecration and installation with solemnity per Sastras, 7 days, PW10 Acharya; Kalasa Puja to Sthapana/Prathista; idols installed per Prathista Mayukha; Prasadothsarga performed, not Uthsarga.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Idol in separate building on vacant site, not residential quarters; some idols permanently on pedestal; puja by appointed archaka; no prior village temple.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "First defendant pleaded private Thakurdwara/idols; witnesses said for Sheo Ghulam's own puja.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Thakurdwara of Sri Radhakrishnaji in village Bhadesia, District Sitapur is a private temple or a public one in which all Hindus are entitled to worship.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Thakurdwara public based on will provisions, public user without interference, ceremonies including Uthsarga/Prasadothsarga conclusive of public dedication, built at villagers' instance, separate building, etc.",
      "supporting_facts": [
        "f3",
        "f13",
        "f16",
        "f19",
        "f21",
        "f22"
      ],
      "legal_basis": "Religious and Charitable Endowments Act XIV of 1920; s.92 CPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Thakurdwara and idols private; built for family worship; public admitted as grace not right; no interference by family.",
      "supporting_facts": [
        "f9",
        "f20",
        "f23"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Question mixed law and fact; principles: private trust for specific individuals, public for general public/class; dedication to idol abandons dominion for pious purposes benefiting worshippers.",
      "addresses_issue": "i1",
      "key_observation": "True beneficiaries are worshippers, not idol; intent key: specific individuals or public."
    },
    {
      "id": "cr2",
      "text": "Will reveals public intent: no male issue recital; committee with non-relations; no restriction on appointments; clause barring heirs; contemplates perpetuity beyond family.",
      "addresses_issue": "i1",
      "key_observation": "Cannot fail for want of objects post-wives; dedicated to public."
    },
    {
      "id": "cr3",
      "text": "Public user consistent with public character; stopping during purdah respect, not denial of right; distinct from private start cases.",
      "addresses_issue": "i1",
      "key_observation": "User by public without interference cogent evidence where dedication to idol."
    },
    {
      "id": "cr4",
      "text": "Ceremonies: Prathista (not Uthsarga) for temples; Prasadothsarga is Sankalpa for mandira, but Prathista establishes public dedication.",
      "addresses_issue": "i1",
      "key_observation": "Uthsarga for charities, Prathista for temples suffices."
    },
    {
      "id": "cr5",
      "text": "Other facts: separate building; permanent idols; appointed archaka; no prior temple; pleadings/evidence not supporting family-only.",
      "addresses_issue": "i1",
      "key_observation": "All indicate public endowment."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Thakurdwara of Sri Radhakrishnaji in Bhadesia is a public temple.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Lakshmidhar Misra v. Rangalal",
      "citation": "1949 L.R. 76 I.A. 271",
      "treatment": "followed",
      "relevance": "Mixed question of law and fact whether dedication public/private; lower findings on fact binding but conclusion on law open."
    },
    {
      "case_name": "Bhupati Nath Smrititirtha v. Ram Lal Maitra",
      "citation": "1910 I.L.R. 37 Cal. 128",
      "treatment": "followed",
      "relevance": "Dedication to idol is abandonment for pious purposes; benefits worshippers."
    },
    {
      "case_name": "Hindu Religious Endowments Board v. Yeeraraghavachariar",
      "citation": "A.I.R. 1937 Mad. 750",
      "treatment": "followed",
      "relevance": "Purpose benefits worshippers; intent decides private/public."
    },
    {
      "case_name": "Nabi Shirazi v. Province of Bengal",
      "citation": null,
      "treatment": "followed",
      "relevance": "No children recital suggests public not family."
    },
    {
      "case_name": "Babu Bhagwan Din v. Gir Har Saroon",
      "citation": "1939 L.R. 67 I.A. 1",
      "treatment": "distinguished",
      "relevance": "Public user not conclusive if initially private grant to individual."
    },
    {
      "case_name": "Mundancheri Koman v. Achuthan",
      "citation": "1984 L.R. 61 I.A. 405",
      "treatment": "followed",
      "relevance": "Public user presumes public if not proved initially private."
    },
    {
      "case_name": "Delroos Banoo Begum v. Nawab Syud Ashgur Ally Khan",
      "citation": "1875 16 Ben. L.R. 167",
      "treatment": "followed",
      "relevance": "Separate public building factor for public character."
    }
  ],
  "statutes_cited": [
    {
      "name": "Religious and Charitable Endowments Act",
      "sections": [
        "XIV of 1920"
      ],
      "relevance": "Appellant sought relief; court declined as private"
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s.92",
        "s.109(c)"
      ],
      "relevance": "Sanction for suit refused; certificate for appeal granted"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; decrees of courts below set aside; declaration granted that Thakurdwara is public temple in terms of para 17(a) of plaint.",
    "relief_granted": "Declaration that Thakurdwara is public temple where all Hindus entitled to worship",
    "costs": "Costs of appellant in all courts out of trust properties"
  },
  "key_quotes": [
    {
      "text": "The distinction between a private and a public trust is that whereas in the former the beneficiaries are specific individuals, in the latter they are the general public or a class thereof.",
      "speaker": "court",
      "significance": "Defines core test for private vs public endowment"
    },
    {
      "text": "When once it is understood that the true beneficiaries of religious endowments are not the idols but the worshippers, and that the purpose of the endowment is the maintenance of that worship for the benefit of the worshippers, the question whether an endowment is private or public presents no difficulty.",
      "speaker": "court",
      "significance": "Explains jurisprudential basis for determining character"
    },
    {
      "text": "We think that the will read as a whole indubitably reveals an intention on the part of the testator to dedicate the Thakurdwara to the public and not merely to the members of his family.",
      "speaker": "court",
      "significance": "Rejects lower courts' view on will's intent"
    },
    {
      "text": "Having considered all the aspects, we are of opinion that the Thakurdwara of Sri Radhakrishnaji in Bhadesia is a public temple.",
      "speaker": "court",
      "significance": "Final holding on issue"
    }
  ],
  "_case_id": "1956_42",
  "_label": 1,
  "_text_length": 26529,
  "_extracted_at": "2026-02-08T22:33:24.105872"
}