{
  "metadata": {
    "case_name": "Distant Agnate of Sheo Ghulam v. Murlidhar (Nephew)",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar J."
    ],
    "case_number": "Civil Appeal No. 250 of 1953",
    "date_of_judgment": "1956-10-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Sheo Ghulam, a pious Hindu and resident of village Bhadesia, District Sitapur, constructed Thakurdwara of Sri Radhakrishnaji during 1914-1916 and installed idol ceremoniously.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Sheo Ghulam managed temple till his death in 1928 without issue.",
      "type": "background",
      "date": "1928",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On March 6, 1919, Sheo Ghulam executed will bequeathing all lands to Thakur; provisions include endowment of immovable property to Sri Radhakrishnaji, wives as Mutawallis, committee of management, etc.",
      "type": "material",
      "date": "1919-03-06",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Ram Kuar (one wife) predeceased; Raj Kuar succeeded as Mutawalli till death in 1933.",
      "type": "background",
      "date": "1933",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "First defendant (nephew Murlidhar) got possession as manager per will.",
      "type": "background",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant, distant agnate of Sheo Ghulam, alleged mismanagement and denial of public rights; moved District Court Sitapur under Religious and Charitable Endowments Act XIV of 1920, but declined as private.",
      "type": "procedural",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Application to Advocate-General for sanction under s.92 CPC refused as private.",
      "type": "procedural",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Appellant filed Regular Civil Suit No. 14 of 1944 for declaration that Thakurdwara is public temple.",
      "type": "procedural",
      "date": "1944",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "First defendant contested, claimed private temple and idols, no public right.",
      "type": "disputed",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Additional Civil Judge Sitapur dismissed suit on 25.11.1944 holding private temple for family worship.",
      "type": "procedural",
      "date": "1944-11-25",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "District Judge Sitapur affirmed in Appeal No. 4 of 1945 on 30.05.1945.",
      "type": "procedural",
      "date": "1945-05-30",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Chief Court of Oudh affirmed in Second Appeal No. 365 of 1945 on 14.07.1948, granted certificate under s.109 CPC.",
      "type": "procedural",
      "date": "1948-07-14",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Villagers worshipped freely without interference; built at instance of villagers as no temple in village.",
      "type": "material",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Pujari stopped outsiders during wife's puja due to purdah.",
      "type": "disputed",
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Consecration and installation with ceremonies per Sastras, lasted 7 days, including Kalasa Puja to Prathista; Prasadothsarga performed, not Uthsarga.",
      "type": "material",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Idol installed in separate building on vacant site, not residential quarters; some idols permanently on pedestal; puja by appointed archaka.",
      "type": "material",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Thakurdwara of Sri Radhakrishnaji in village Bhadesia, District Sitapur is a private temple or a public one in which all Hindus are entitled to worship.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Thakurdwara is public based on will (Exhibit A-1), public user without interference, ceremonies including Uthsarga/Prasadothsarga, built at villagers' instance, no temple in village.",
      "supporting_facts": [
        "f3",
        "f13",
        "f15",
        "f16"
      ],
      "legal_basis": "Dedication scope; public user evidence"
    },
    {
      "id": "pa2",
      "text": "Performance of Uthsarga conclusive for public dedication.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Sanskrit texts on Sankalpa, Uthsarga, Prathista"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Thakurdwara and idols private; built for family worship; public admitted as grace, not right; no interference during purdah puja.",
      "supporting_facts": [
        "f9",
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Question is mixed law and fact; principles: private trust for specific individuals, public for general public/class; dedication to idol abandons dominion for pious purposes benefiting worshippers.",
      "addresses_issue": "i1",
      "key_observation": "True beneficiaries are worshippers, not idol; cardinal point is founder's intention for specified individuals or general public."
    },
    {
      "id": "cr2",
      "text": "Will (Exhibit A-1) reveals public intention: no male issue recital, committee with non-relatives, no restriction on appointments, clause barring heirs' claims, continuance beyond wives' life requires public beneficiaries.",
      "addresses_issue": "i1",
      "key_observation": "Inconceivable to entrust strangers if for family only; endowment would fail otherwise."
    },
    {
      "id": "cr3",
      "text": "Public user consistent with public endowment since initial dedication to idol; not mere grace as in private start cases.",
      "addresses_issue": "i1",
      "key_observation": "Proof of user without interference relevant for public dedication."
    },
    {
      "id": "cr4",
      "text": "Ceremonies: Prathista (not Uthsarga) performed; Prathista takes place of Uthsarga for temples, dedicates to public; Prasadothsarga different.",
      "addresses_issue": "i1",
      "key_observation": "Texts confirm no Uthsarga for temples; Prathista establishes public dedication."
    },
    {
      "id": "cr5",
      "text": "Other facts: separate building, permanent idols, appointed archaka, no prior temple, pleadings lack family-specific claim.",
      "addresses_issue": "i1",
      "key_observation": "Consistent with public character."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Thakurdwara of Sri Radhakrishnaji in Bhadesia is a public temple.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Lakshmidhar Misra v. Rangalal",
      "citation": "1949 L.R. 76 I.A. 271",
      "treatment": "followed",
      "relevance": "Mixed question of law and fact on dedication scope."
    },
    {
      "case_name": "Bhupati Nath Smrititirtha v. Ram Lal Maitra",
      "citation": "1910 I.L.R. 37 Cal. 128",
      "treatment": "followed",
      "relevance": "Dedication to idol is abandonment for pious purposes benefiting worshippers."
    },
    {
      "case_name": "Hindu Religious Endowments Board v. Yeeraraghavachariar",
      "citation": "A.I.R. 1937 Mad. 750",
      "treatment": "followed",
      "relevance": "Endowments benefit worshippers; public if for general public."
    },
    {
      "case_name": "Nabi Shirazi v. Province of Bengal",
      "citation": null,
      "treatment": "referred",
      "relevance": "No children recital suggests public, not family."
    },
    {
      "case_name": "Babu Bhagwan Din v. Gir Har Saroon",
      "citation": "1939 L.R. 67 I.A. 1",
      "treatment": "distinguished",
      "relevance": "Public user insufficient if initially private grant to individual."
    },
    {
      "case_name": "Mundancheri Koman v. Achuthan",
      "citation": "1984 L.R. 61 I.A. 405",
      "treatment": "followed",
      "relevance": "Public user presumes public if not initially private."
    },
    {
      "case_name": "Delroos Banoo Begum v. Nawab Syud Ashgur Ally Khan",
      "citation": "1875 16 Ben. L.R. 167",
      "treatment": "referred",
      "relevance": "Separate public building factor for public endowment."
    }
  ],
  "statutes_cited": [
    {
      "name": "Religious and Charitable Endowments Act",
      "sections": [
        "XIV of 1920"
      ],
      "relevance": "Appellant sought relief; declined as private"
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 92",
        "Section 109"
      ],
      "relevance": "Sanction refused; certificate granted for appeal"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; decrees of courts below set aside; declaration granted that Thakurdwara is public temple in terms of para 17(a) of plaint.",
    "relief_granted": "Declaration that Thakurdwara of Sri Radhakrishnaji is public temple where all Hindus entitled to worship.",
    "costs": "Costs of appellant in all courts out of trust properties."
  },
  "key_quotes": [
    {
      "text": "The distinction between a private and a public trust is that whereas in the former the beneficiaries are specific individuals, in the latter they are the general public or a class thereof.",
      "speaker": "court",
      "significance": "Defines core legal test for public vs private endowment."
    },
    {
      "text": "When once it is understood that the true beneficiaries of religious endowments are not the idols but the worshippers, [...] the question whether an endowment is private or public presents no difficulty.",
      "speaker": "court",
      "significance": "Explains purpose and beneficiaries of dedication."
    },
    {
      "text": "We think that the will read as a whole indubitably reveals an intention on the part of the testator to dedicate the Thakurdwara to the public and not merely to the members of his family.",
      "speaker": "court",
      "significance": "Key holding on interpretation of will."
    }
  ],
  "_case_id": "1956_42",
  "_label": 1,
  "_text_length": 26529,
  "_extracted_at": "2026-02-10T19:15:24.496822"
}