{
  "metadata": {
    "case_name": "Chief Commissioner, Ajmer v. Respondent",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI J."
    ],
    "case_number": "Civil Appeal No. 181 of 1956",
    "date_of_judgment": "1956-11-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent claimed to be a voter of the Ajmer Municipality.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "By an order dated March 12, 1953, the Ajmer Municipal Committee had been suspended and that suspension was to continue till September 11, 1955.",
      "type": "material",
      "date": "1953-03-12",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Chief Commissioner, Ajmer, framed the Ajmer State Municipalities Election Rules, 1955, in exercise of the powers conferred by s. 43 of the Ajmer-Merwara Municipalities Regulation, 1925 (VI of 1925) and published them in the Government Gazette dated August 4, 1955.",
      "type": "procedural",
      "date": "1955-08-04",
      "source": "appellant"
    },
    {
      "id": "f4",
      "text": "On August 8, 1955, the Chief Commissioner notified an election programme and also authenticated and published an electoral roll.",
      "type": "procedural",
      "date": "1955-08-08",
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "The electoral roll had been corrected and altered by the orders of the Sub-Divisional Officer on certain days prior to August 8, 1955, but the respondent's father's name was incorrectly described therein as Ratan Lal instead of Chitar Mal.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "On August 10, 1955, the respondent applied for the correction of his father's name in the Parliamentary Electoral Roll.",
      "type": "procedural",
      "date": "1955-08-10",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "On August 16, 1955, the respondent filed his nomination paper.",
      "type": "procedural",
      "date": "1955-08-16",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "His nomination was rejected on August 17, 1955, by the Returning Officer stating that he was not one of the electors according to the roll.",
      "type": "procedural",
      "date": "1955-08-17",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The respondent's application for rectification of the mistake in the Parliamentary Electoral Roll was rejected on August 18, 1955, by the Electoral Registration Officer on the ground that the roll of the Municipal elections had been finally published on August 8, 1955, and therefore no correction could be made.",
      "type": "procedural",
      "date": "1955-08-18",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "On August 26, 1955, the respondent filed Civil Writ Petition No. 108 of 1955 in the Court of the Judicial Commissioner at Ajmer against the appellant and the District Magistrate, Ajmer, inter alia for a mandamus against the appellant to reconstitute the Ajmer Municipal Committee by a properly made and published notification under s. 81 of the Regulation and an order against the District Magistrate restraining him from holding the elections and poll on September 9, 1955.",
      "type": "procedural",
      "date": "1955-08-26",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "The learned Judicial Commissioner, by judgment dated September 5, 1955, upheld the respondent's contention in regard to the reconstitution of the Committee but did not issue directions as the appellant had already issued a notification under s. 81; held that Rule 7 of the Election Rules was not in consonance with and was in contradiction to s. 30 sub-s. (2) of the Regulation and was in excess of the rule-making power conferred; directed the District Magistrate to refrain from holding the elections on September 9, 1955.",
      "type": "procedural",
      "date": "1955-09-05",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The Judicial Commissioner refused certificate under Art. 133(1)(c) of the Constitution as the date had passed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The appellant obtained special leave under Art. 136 from the Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f14",
      "text": "The appeal was heard ex parte as respondent did not appear.",
      "type": "procedural",
      "date": "1956-11-15",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The appellant had reconstituted the Ajmer Municipal Committee by proper notification under s. 81 and the election date September 9, 1955 had passed.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Rule 7 of the Ajmer State Municipalities Election Rules, 1955 is not in consonance with and in contradiction to s. 30 sub-s. (2) of the Ajmer-Merwara Municipalities Regulation, 1925 and in excess of the rule-making power under s. 43.",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Whether the electoral roll authenticated and published on August 8, 1955 was prepared in accordance with law and could form the basis for valid elections.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The pronouncement that Rule 7 was invalid is a stumbling block for holding further elections on the basis of the electoral roll authenticated on August 8, 1955; setting it aside would avoid need for new roll and expenses.",
      "supporting_facts": [
        "f4",
        "f11",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "To be entitled to enrolment as municipal elector under s. 30(2), a person must: (1) be entitled under Representation of the People Act, 1950 to be registered in parliamentary roll if constituency co-extensive with municipality; (2) name registered in parliamentary roll comprising municipality. First condition subject to scrutiny; second apparent from roll.",
      "addresses_issue": "i1",
      "key_observation": "Necessary to provide for revision of rolls, adjudication of claims and objections."
    },
    {
      "id": "cr2",
      "text": "S. 43(c) empowers rules for preparation, revision of electoral rolls, adjudication of claims/objections. Rules published under s. 248(4) have statutory effect.",
      "addresses_issue": "i1",
      "key_observation": "Amendment of s. 30(2) adopts parliamentary qualifications but does not eliminate revision steps."
    },
    {
      "id": "cr3",
      "text": "Rule 7 makes municipal roll same as final printed parliamentary roll; Rule 9 deems elector only if name appears therein. But does not obviate scrutiny of qualifications or provide for revision/claims/objections; thus defective.",
      "addresses_issue": "i1",
      "key_observation": "Elections on imperfect rolls invalid; rules omit essential provisions."
    },
    {
      "id": "cr4",
      "text": "Expression 'final printed roll' does not incorporate ROP Act procedure into Regulation/Rules.",
      "addresses_issue": "i2",
      "key_observation": "Electoral roll of August 8, 1955 not in conformity with s. 30(2) and cannot form basis for valid elections."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rules 7 and 9 are defective as they fail to provide for scrutiny of qualifications, revision of rolls, adjudication of claims and objections; electoral roll not prepared in accordance with law.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Electoral roll authenticated August 8, 1955 cannot form basis of valid municipal elections.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Ajmer-Merwara Municipalities Regulation, 1925 (VI of 1925)",
      "sections": [
        "Section 30(1)",
        "Section 30(2)",
        "Section 43",
        "Section 81",
        "Section 248(4)"
      ],
      "relevance": "Governs municipal electors' qualifications, rule-making for electoral rolls, reconstitution; s.30(2) requires dual conditions for enrolment; rules must provide for revision/claims/objections."
    },
    {
      "name": "Representation of the People Act, 1950 (XLIII of 1950)",
      "sections": [],
      "relevance": "Qualifications for registration in parliamentary electoral roll adopted as basis for municipal enrolment under s.30(2)."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(c)",
        "Article 136"
      ],
      "relevance": "Certificate refused under Art.133; special leave granted under Art.136."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed as the electoral roll was not prepared in accordance with law due to defective rules lacking provisions for revision, claims and objections; no substance in the appeal.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is of the essence of these elections that proper electoral rolls should be maintained and in order that a proper electoral roll should be maintained it is necessary that after the preparation of the electoral roll opportunity should be given to the parties concerned to scrutinize whether the persons enrolled as electors possessed the requisite qualifications.\"",
      "speaker": "court",
      "significance": "Core reasoning on necessity of revision and scrutiny for valid electoral rolls."
    },
    {
      "text": "\"The electoral roll of the Ajmer Municipality which was authenticated and published by the Chief Commissioner on August 8, 1955, was certainly not an electoral roll prepared in accordance with law on the basis of which the elections and poll to the Ajmer Municipal Committee could be held.\"",
      "speaker": "court",
      "significance": "Direct holding invalidating the electoral roll used."
    }
  ],
  "_case_id": "1956_62",
  "_label": 0,
  "_text_length": 18289,
  "_extracted_at": "2026-02-10T19:16:05.515654"
}