{
  "metadata": {
    "case_name": "Lakshmanan Chettiar & Ors. v. State of Madras",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Ayyar J."
    ],
    "case_number": "Criminal Appeals Nos. 20 to 23 of 1955",
    "date_of_judgment": "1956-11-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On November 18, 1953, the Prohibition Officer, Madras City, and the Deputy Commissioner of Police made a search of premises No. 28, Thanikachala Chetty Street, Thyagarayanagar, Madras, and seized several bottles of foreign liquor and glasses containing whisky and soda.",
      "type": "material",
      "date": "1953-11-18",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant, Lakshmanan Chettiar, was residing at the premises.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The other three appellants, A. S. Krishna, R. Venkataraman and V. S. Krishnaswamy, were found drinking from the glass tumblers.",
      "type": "material",
      "date": "1953-11-18",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "All the four were immediately put under arrest and in due course charge-sheets were laid against them for offences under the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The three appellants other than Lakshmanan Chettiar were charged under ss. 4(1)(a) and 4(1)(j) for possession and consumption of liquor.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Lakshmanan Chettiar was charged under s. 4(1)(k) for allowing the above acts in premises in his immediate possession, under s. 12 for abetment of the offences, and under s. 4(1)(a) on the allegation that though he was a permit-holder, he was in possession of more units than were allowed under the permit.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Immediately after service of summons, the appellants filed an application under s. 432 of the Criminal Procedure Code, contending that ss. 4(2) and 28 to 32 of the Act were repugnant to the provisions of the Constitution, and were therefore void, and prayed that the above question might be referred for the decision of the High Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The Third Presidency Magistrate allowed the application and referred to the High Court as many as seven questions on the constitutionality of various sections of the Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "This reference was heard by Rajamannar, C.J., and Umamaheswaram, J., who held that ss. 4(2) and 28 to 32 were valid, and answered the reference against them, by judgment dated May 7, 1954.",
      "type": "procedural",
      "date": "1954-05-07",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Against this judgment, the appellants have preferred the present appeals under Art. 136 of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether ss. 4(2), 28, 29, 30, 31 and 32 of the Madras Prohibition Act No. X of 1937 are unconstitutional and void.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the impugned provisions are hit by s. 107 of the Government of India Act, 1935, because they are repugnant to the provisions of existing Indian laws with respect to the same matter, to wit, Indian Evidence Act I of 1872 and Criminal Procedure Code Act No. V of 1898.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the impugned sections are repugnant to Art. 14 of the Constitution, and have therefore become void under Art. 13(1).",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Section 4(2) and ss. 28 to 32 of the Act are void under s. 107 of the Government of India Act, 1935, because they are repugnant to the provisions of existing Indian laws with respect to the same matter, to wit, Indian Evidence Act I of 1872 and Criminal Procedure Code Act No. V of 1898.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s. 107 Government of India Act, 1935; Entries 5 and 2 List III"
    },
    {
      "id": "pa2",
      "text": "Though the Act is within the competence of the Provincial Legislature in so far as it prohibits possession, sale, consumption, etc., of liquor under s. 4(1), the matters dealt with under s. 4(2) and ss. 28 to 32 fall not within Entry 31 of List II but within Entries 5 and 2 respectively of List III.",
      "supporting_facts": [],
      "legal_basis": "List II Entry 31; List III Entries 2 and 5"
    },
    {
      "id": "pa3",
      "text": "s. 4(2) enacting as it does a presumption to be drawn by the court on certain facts being established, deals with what is purely a matter of evidence, and it is therefore not a law on intoxicating liquors but evidence. Likewise, the provisions in ss. 28 to 32 deal with matters pertaining to Criminal Procedure, such as warrants, seizure and arrest.",
      "supporting_facts": [],
      "legal_basis": "Indian Evidence Act; Criminal Procedure Code"
    },
    {
      "id": "pa4",
      "text": "The presumptions raised in s. 4(2) of the Act, are repugnant to Art. 14 of the Constitution.",
      "supporting_facts": [],
      "legal_basis": "Art. 14 Constitution of India"
    },
    {
      "id": "pa5",
      "text": "The facts set out in s. 4(2) on which the presumption of guilt is raised have no reasonable relation to the offences themselves, for example, possession of liquor can be no evidence of possession of materials or apparatus for manufacture of liquor under s. 4(1)(g), nor possession of materials, apparatus for manufacture of liquor, evidence of possession or consumption of liquor under s. 4(1)(a) and (j).",
      "supporting_facts": [],
      "legal_basis": "William N. McFarland v. American Sugar Refining Company; Mobile J. K.C.R. Co. v. Turnipseed"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "ss. 4(2) and 28 to 32 were valid.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Madras Prohibition Act, as a whole, is a law in respect of intoxicating liquors, falling within Entry 31 of the Provincial list. The presumptions in s. 4(2) are to be raised only in the trial of offences under s. 4(1) of the Act. They are therefore purely ancillary to the exercise of the legislative power in respect of Entry 31 in List II. So also, the provisions relating to search, seizure and arrest in sections 28 to 32 are only with reference to offences committed or suspected to have been committed under the Act.",
      "addresses_issue": "i1",
      "key_observation": "The entire legislation fell within Entries I and 2 of List II, and no question of repugnancy under s. 107(1) arose."
    },
    {
      "id": "cr2",
      "text": "When a law is impugned on the ground that it is ultra vires the powers of the legislature which enacted it, what has to be ascertained is the true character of the legislation by regard to the enactment as a whole, to its objects and to the scope and effect of its provisions. If on such examination it is found that the legislation is in substance one on a matter assigned to the legislature, then it must be held to be valid in its entirety, even though it might incidentally trench on matters which are beyond its competence.",
      "addresses_issue": "i2",
      "key_observation": "Pith and substance doctrine: regard must be had to its pith and substance."
    },
    {
      "id": "cr3",
      "text": "The Madras Prohibition Act is thus in its entirety a law within the exclusive competence of the Provincial Legislature, and the question of repugnancy under s. 107(1) does not arise.",
      "addresses_issue": "i2",
      "key_observation": "Ancillary provisions do not make it fall under Concurrent List."
    },
    {
      "id": "cr4",
      "text": "We are unable to see how s. 4(2) offends the requirement as to equality before law or the equal protection of laws. The presumptions enacted therein have to be raised against all persons against whom the facts mentioned therein are established.",
      "addresses_issue": "i3",
      "key_observation": "Presumptions reasonable and not arbitrary."
    },
    {
      "id": "cr5",
      "text": "The matters mentioned in s. 4(2) should be read distributively in relation to the offences mentioned in s. 4(1). Possession of liquor, for example, is an offence under s. 4(1)(a). The presumption in s. 4(2) is that if it is found in the possession of a person, he should be presumed to have committed the offence under s. 4(1)(a), unless he could give satisfactory explanation therefor.",
      "addresses_issue": "i3",
      "key_observation": "There is reasonable relation between the presumption and the offence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "ss. 4(2), 28, 29, 30, 31 and 32 of the Madras Prohibition Act No. X of 1937 are constitutional and valid; not repugnant to s. 107 Government of India Act, 1935 or Art. 14 Constitution.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Citizens Insurance Company of Canada v. William Parsons",
      "citation": "1881 7 A.C. 96",
      "treatment": "followed",
      "relevance": "Pith and substance doctrine in federal constitutions."
    },
    {
      "case_name": "Attorney General of Ontario v. Attorney-General for the Dominion of Canada",
      "citation": "1894 A.C. 189",
      "treatment": "followed",
      "relevance": "Pith and substance doctrine."
    },
    {
      "case_name": "Attorney-General of Ontario v. The Attorney-General for the Dominion",
      "citation": "1896 A.C. 348",
      "treatment": "followed",
      "relevance": "Pith and substance doctrine."
    },
    {
      "case_name": "Union Colliery Company of British Columbia v. Bryden",
      "citation": "1899 A.C. 580",
      "treatment": "followed",
      "relevance": "Pith and substance doctrine."
    },
    {
      "case_name": "Attorney-General for Canada v. Attorney-General for Ontario",
      "citation": "1937 A.C. 355",
      "treatment": "followed",
      "relevance": "Pith and substance doctrine."
    },
    {
      "case_name": "Attorney-General for Alberta v. Attorney-General for Canada",
      "citation": "1939 A.C. 117",
      "treatment": "followed",
      "relevance": "Pith and substance doctrine."
    },
    {
      "case_name": "Board of Trustees of Lethbridge Northern Irrigation District v. Independent Order of Foresters",
      "citation": "1940 A.C. 513",
      "treatment": "followed",
      "relevance": "Pith and substance doctrine."
    },
    {
      "case_name": "Subrahmanyan Chettiar v. Muttuswami Goundan",
      "citation": "1940 F.C.R. 188",
      "treatment": "followed",
      "relevance": "Applied pith and substance to Indian legislation under GOI Act 1935."
    },
    {
      "case_name": "Prafulla Kumar Mukherjee v. The Bank of Commerce, Ltd.",
      "citation": "1946-47 74 I.A. 23",
      "treatment": "followed",
      "relevance": "Pith and substance for Bengal Money-Lenders Act; incidental encroachment does not invalidate."
    },
    {
      "case_name": "Lakhi Narayan Das v. The Province of Bihar",
      "citation": "1949 F.C.R. 693",
      "treatment": "followed",
      "relevance": "Ancillary procedure provisions fall within provincial list for public order."
    },
    {
      "case_name": "Albert J. Adams v. People of the State of New York",
      "citation": "192 U.S. 585",
      "treatment": "followed",
      "relevance": "Presumption of knowledge from possession of gambling instruments upheld."
    },
    {
      "case_name": "Robert Hawes v. State of Georgia",
      "citation": "258 U.S. 1",
      "treatment": "followed",
      "relevance": "Presumption that occupier knowingly permitted distilling apparatus upheld."
    },
    {
      "case_name": "William N. McFarland v. American Sugar Refining Company",
      "citation": "241 U.S. 79",
      "treatment": "referred",
      "relevance": "Limits on presumptions: rational connection required."
    },
    {
      "case_name": "Mobile J. K.C.R. Co. v. Turnipseed",
      "citation": "219 U.S. 35",
      "treatment": "referred",
      "relevance": "Inference from proved fact must not be unreasonable."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Prohibition Act No. X of 1937",
      "sections": [
        "4(1)(a)",
        "4(1)(g)",
        "4(1)(j)",
        "4(1)(k)",
        "4(2)",
        "12",
        "28",
        "29",
        "30",
        "31",
        "32"
      ],
      "relevance": "Impugned provisions prohibiting possession, consumption etc. of liquor, presumptions, search, seizure, arrest; held valid as provincial legislation on intoxicating liquors."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "107"
      ],
      "relevance": "Test for repugnancy between provincial and central laws on concurrent matters; held inapplicable as pith and substance is provincial."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 13(1)",
        "Art. 14",
        "Art. 136"
      ],
      "relevance": "Art.14 equal protection not violated by reasonable presumptions; appeals by special leave."
    },
    {
      "name": "Indian Evidence Act, 1872",
      "sections": [],
      "relevance": "Appellants claimed repugnancy; court held s.4(2) ancillary, not general evidence law."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "432"
      ],
      "relevance": "Application for reference on constitutionality; appellants claimed repugnancy with ss.28-32."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeals, upholding the Madras High Court's decision that ss. 4(2) and 28 to 32 of the Madras Prohibition Act, 1937 are constitutional and valid, applying the pith and substance doctrine and finding no violation of Art. 14.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The point for decision in these appeals is whether ss. 4(2), 28, 29, 30, 31 and 32 of the Madras Prohibition Act No. X of 1937, hereinafter referred to as the Act, are unconstitutional and void.",
      "speaker": "court",
      "significance": "Frames the core issue."
    },
    {
      "text": "if a statute is found in substance to relate to a topic within the competence of the legislature, it should be held to be intra vires, even though it might incidentally trench on topics not within its legislative competence.",
      "speaker": "court",
      "significance": "Key application of pith and substance doctrine."
    },
    {
      "text": "The Madras Prohibition Act is thus in its entirety a law within the exclusive competence of the Provincial Legislature, and the question of repugnancy under s. 107(1) does not arise.",
      "speaker": "court",
      "significance": "Rejects first contention."
    },
    {
      "text": "It is essential that there shall be some rational connection between the fact proved and the ultimate fact presumed, and that the inference of one fact from proof of another shall not be so unreasonable as to be a purely arbitrary mandate.",
      "speaker": "petitioner_counsel",
      "significance": "Petitioner's argument on presumptions, distinguished by court."
    }
  ],
  "_case_id": "1956_96",
  "_label": 0,
  "_text_length": 29332,
  "_extracted_at": "2026-02-08T22:13:27.645698"
}