{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. The Respondent Company",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Ayyar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is a company registered under the Indian Companies Act, 1913, carrying on business in cotton. Its head office is in Bombay, and it maintains a branch at Karachi for purchasing cotton for shipment to Bombay or export direct to other places.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Separate accounts are maintained and separate profit and loss statements are prepared for the business at Bombay and at Karachi.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "By an agreement dated 22nd December, the respondent appointed managing agents, and under clause 4 of the agreement, the remuneration payable to them was fixed at 20 per cent of the net annual profits.",
      "type": "background",
      "date": "1947-12-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "During the accounting year 1st October, 1947, to 30th September, 1948, the respondent made a total profit of Rs. 15,63,504, of which Rs. 9,44,905 was earned in the business at Bombay and Rs. 6,18,599 at Karachi.",
      "type": "material",
      "date": "1947-10-01 to 1948-09-30",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On this, the commission payable to the managing agents as per clause 4 of the agreement was Rs. 3,12,699.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The respondent debited a sum of Rs. 1,88,980 out of this amount in the profit and loss statement of the Bombay head office, being the 20% apportionable to the profits shown therein, and deducting this sum from the total profits of Rs. 9,44,905 showed a sum of Rs. 7,55,925 as the net profits of the business of Bombay.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "It likewise debited a sum of Rs. 1,23,719 to the profit and loss statement of the Karachi branch, and deducting it out of the total profits of Rs. 6,18,599 earned by the branch, showed a sum of Rs. 4,94,879 as its net profits.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The respondent is resident and ordinarily resident in India, and therefore it would be chargeable to income-tax on its total world income.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Income Tax Officer took into account profits earned both in India and in Karachi, deducted therefrom the entire commission paid to the managing agents, and after making certain adjustments, determined the total income at Rs. 13,09,375.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "As part of this income was earned in Karachi, it would also be chargeable to income tax in Pakistan.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Section 49B provided for agreement with Pakistan for avoidance of double taxation, and a notification was issued on 10th December, 1947.",
      "type": "background",
      "date": "1947-12-10",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The Income Tax Officer accepted Rs. 4,94,879 as the net profits in the profit and loss statement for Karachi, and after adjustments, held that the amount for abatement under the agreement was Rs. 5,03,344.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The assessee appealed to the Appellate Assistant Commissioner contending that Rs. 6,18,599 should be taken as Karachi profits without deducting Rs. 1,23,719 commission, as whole commission payable at Bombay.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Appellate Assistant Commissioner confirmed the ITO order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Tribunal held that entire commission payable at Bombay, no portion debited to Karachi branch, allowed appeal to that extent.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "On application of Commissioner, Tribunal referred the question: Whether on the facts and circumstances of the case, the amount of Rs. 1,23,719 paid to the managing agents as commission at 20% of the net profits of the Karachi branch, is allowable as a revenue deduction against the Indian profits of the assessee company for the year of account?",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Bombay High Court (Chagla, C.J. and Tendolkar, J.) answered the reference in the affirmative, following Birla Brothers Ltd. v. Commissioner of Income-tax, granted certificate under s.66A.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "In Pakistan, Income Tax authorities originally admitted the deduction but subsequently revised the assessment and disallowed it.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the amount of Rs. 1,23,719 paid to the managing agents as commission at 20% of the net profits of the Karachi branch, is allowable as a revenue deduction against the Indian profits of the assessee company for the year of account?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The sum of Rs. 1,23,719 should not be added to Rs. 4,94,879 as profits assessable in Pakistan because entire commission of Rs. 3,12,699 deducted from total income, and to disallow it would give relief twice over.",
      "supporting_facts": [
        "f9",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "As the assessee itself deducted the amount from Karachi profits and obtained relief in Pakistan on that footing, it is not entitled to claim relief in respect of that amount under the Agreement.",
      "supporting_facts": [
        "f7",
        "f12"
      ],
      "legal_basis": "Agreement between India and Pakistan"
    },
    {
      "id": "pa3",
      "text": "The respondent had split up the commission and appropriated Rs. 1,23,719 to Karachi profits and debited it, so estopped from claiming it as deduction against Indian profits.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Under the Income Tax Act, respondent not entitled to deduct Rs. 1,23,719 from profits earned at Karachi; deducting it was a mistake; whole commission payable at Bombay and debitable to head office.",
      "supporting_facts": [
        "f3",
        "f5",
        "f13"
      ],
      "legal_basis": "Indian Income Tax Act"
    },
    {
      "id": "ra2",
      "text": "Pakistan Income Tax authorities revised assessment on ground of error and disallowed the deduction.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Question of relief under Agreement does not arise for consideration.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Whether entitled to deduction depends on provisions of law, not on view assessee took; no estoppel if whole commission deductible against Indian profits.",
      "addresses_issue": "i1",
      "key_observation": "Erroneous allocation does not preclude claiming deduction under law."
    },
    {
      "id": "cr2",
      "text": "Section 10(2)(xv) allows deduction for expenditure laid out wholly and exclusively for business. When assessee carries on same business at multiple places, one business for s.10; net profits from all expenses including commissions.",
      "addresses_issue": "i1",
      "key_observation": "Profits in India and Karachi thrown together, expenses deducted therefrom."
    },
    {
      "id": "cr3",
      "text": "Apportionment of Rs. 1,23,719 not warranted by managing agency agreement; commission on net annual profits of company from all branches.",
      "addresses_issue": "i1",
      "key_observation": "In case of loss in one branch, commission on net after set-off."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The respondent is entitled to deduct the managing agency commission including Rs. 1,23,719 against the Indian profits.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Birla Brothers Ltd. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Managing agency commission to be debited in entirety to head office even if duties partly in branch."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "Section 10(2)(xv)",
        "Section 49B",
        "Section 66(1)",
        "Section 66A"
      ],
      "relevance": "Deduction for business expenditure; avoidance of double taxation agreement; reference to High Court and appeal to Supreme Court."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [],
      "relevance": "Company registered thereunder."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's answer to the reference in the affirmative, holding that the sum of Rs. 1,23,719 is allowable as a deduction against the Indian profits. Appeal dismissed.",
    "relief_granted": "Deduction of Rs. 1,23,719 allowed against Indian profits",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Whether the respondent is entitled to the particular deduction or not will depend on the provision of law relating thereto and not on the view which it might have taken of its rights.\"",
      "speaker": "court",
      "significance": "Rejects estoppel argument based on assessee's own apportionment."
    },
    {
      "text": "\"When an assessee carries on the same business at a number of places, there is for the purpose of section 10, only one business, and the net profits of the business have to be ascertained after deducting therefrom all the expenses.\"",
      "speaker": "court",
      "significance": "Explains computation of profits for multi-branch business."
    }
  ],
  "_case_id": "1956_78",
  "_label": 0,
  "_text_length": 12380,
  "_extracted_at": "2026-02-10T19:16:14.158784"
}