{
  "metadata": {
    "case_name": "Narayan Rao v. State",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha J."
    ],
    "case_number": "Criminal Appeal No. 97 of 1957",
    "date_of_judgment": "1957-07-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The murdered man Baga Rao, who was an excise contractor, had separated from his other brothers and had partitioned the family lands. There were differences amongst the brothers which had led to arbitration proceedings a few months earlier, which did not satisfy Baga Rao.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On the Saturday previous to the Monday, December 26, 1955, which was the day of the occurrence, there was a quarrel between Baga Rao on one side and Lingarao and Narsingrao on the other in the field said to belong to Baga Rao.",
      "type": "background",
      "date": "1955-12-24",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The parties reside in village Kollamaddi taluk Sircilla, district Karimnagar.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "At about 7 a.m. on the morning of December 26, 1955, Baga Rao had been proceeding from his village towards Nirmal side. The accused, who appears to have been lying in wait for Baga Rao, came running from behind and the appellant fell upon Baga Rao with his knife. The other accused persons caught hold of Baga Rao and the appellant inflicted several injuries on his person with his knife (M.O. 13).",
      "type": "material",
      "date": "1955-12-26",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "At first, Baga Rao got himself released from the grip of Narsingrao but the latter chased him and overtook him. All the accused overpowered him by catching hold of the different parts of his body, and the appellant stabbed him in the regions of the neck, abdomen, thigh and other parts of his body, the fatal injuries being in the neck and the abdomen.",
      "type": "material",
      "date": "1955-12-26",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "At the time of the occurrence, P.W. 1, father's brother of the appellant, who also was proceeding towards Nirmal, saw most of the occurrence and then, out of fear, hid himself in a hut nearby.",
      "type": "material",
      "date": "1955-12-26",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "P.W. 2-a boy of about 12 years-a student of 4th standard in a Government school, was also proceeding in that direction that morning, and saw the whole occurrence from beginning to end from a short distance of a few yards. This young boy claimed the murdered Baga Rao as his maternal uncle, stating that his mother is the sister of Baga Rao. But the wife of the murdered man, P.W. 6, stated in cross-examination that P.W. 2-Ramchander Rao-is distantly related to her husband and that he is not the son of her husband's sister.",
      "type": "disputed",
      "date": "1955-12-26",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "The father of the murdered man, Chatriah, aged about 85 years, who has been examined as defence witness No. 1, disclaimed all relationship with the said P.W. 2, but stated that he is related to Dharmiah, P.W. 1, who is no other than his full brother.",
      "type": "disputed",
      "date": null,
      "source": "defence"
    },
    {
      "id": "f9",
      "text": "Chatriah, the father, had been examined to support the defence suggestion that it was P.W. 1, Dharmiah Rao and his son who got Baga Rao murdered and falsely implicated the accused persons. That evidence has naturally not been accepted by the courts below because such a case was never sought to be made out at any previous stage of the proceedings until his examination in court.",
      "type": "disputed",
      "date": null,
      "source": "defence"
    },
    {
      "id": "f10",
      "text": "D.W. 2 who claims to be the son-in-law of P.W. 1, was examined only to prove that there had been a rivalry between P.W. 1 and the accused persons for the purchase of some land. His evidence was rejected as vague and of no relevance.",
      "type": "disputed",
      "date": null,
      "source": "defence"
    },
    {
      "id": "f11",
      "text": "P.W. 1 aforesaid informed Gopal Rao (P.W. 8)-Police Patel-about the occurrence, he drew up the first information report at about 11 a.m., on December 26. All the four accused were named as the culprits in the first information report. He issued that report to the station house, Gambhiraopet, about 5 miles from the place of occurrence.",
      "type": "procedural",
      "date": "1955-12-26",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "The Sub-Inspector of police, P.W. 11, proceeded to the spot and prepared the inquest report. He found the throat of the deceased cut, besides other injuries on the left side of the stomach and right thigh and three wounds on the left hand.",
      "type": "procedural",
      "date": "1955-12-26",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Two panchas, Lachmayya and Ramayya (P.W. 10), were called by the police officer and in their presence and under their signatures, he entered a long note as to what the panchas saw on the spot, and then follows the substance of the statements of the eye-witnesses, P.Ws. 1 and 2, aforesaid.",
      "type": "procedural",
      "date": "1955-12-26",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "The post mortem report, made the next day, December 27, corroborated the nature of the injuries stated above, and added that the incised wound across the lower part of the neck, had cut the vital organs like trachea, oesophagus and the jugular vein.",
      "type": "material",
      "date": "1955-12-27",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "The prosecution also proved, as exhibit P-5, the panchnama prepared the same day and signed not only by the panchas but purporting to have been signed also by the accused persons. This document is a record which is a complete confession of the crime from the beginning to the end by all the accused persons.",
      "type": "procedural",
      "date": "1955-12-26",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "On January 10 and 11, 1956, the learned Munsiff-Magistrate recorded the full length statements of Ramchander Rao as P.W. 1, and of Dharmiah Rao, P.W. 2, under s. 164 of the Code of Criminal Procedure.",
      "type": "procedural",
      "date": "1956-01-10",
      "source": "prosecution"
    },
    {
      "id": "f17",
      "text": "The police report under s. 173 of Criminal Procedure Code was made by the investigating police officer on January 11, 1956, and was placed before the Munsiff-Magistrate on January 12.",
      "type": "procedural",
      "date": "1956-01-11",
      "source": "prosecution"
    },
    {
      "id": "f18",
      "text": "The learned Munsiff-Magistrate appears to have examined the investigating police officer as W. 1, and the two eye-witnesses, Dharmiah and Ramchander Rao, as P.Ws. 2 and 3, and the medical officer as P.W. 4, on or about February 15, 1956.",
      "type": "procedural",
      "date": "1956-02-15",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "On February 16,1956, the learned Munsiff-Magistrate put very detailed questions to each one of the accused persons and placed the evidence of all the witnesses examined by him in detail, to the accused persons who have denied their complicity in the crime and who alleged enmity with the two eyewitnesses aforesaid.",
      "type": "procedural",
      "date": "1956-02-16",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "The learned Munsiff-Magistrate framed a charge for murder under s. 302, against the appellant, and for participation in the crime, against the other three accused, under s. 302, read with ss. 34 and 109 of Indian Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "Evidence of recovery of the blood-stained garments from the houses of the accused persons and the blood-stained knife found near the dead body, and identified in court as belonging to the appellant, which were all found by the chemical examiner, to have stains of human blood.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f22",
      "text": "Appellant tried by Sessions Judge of Karimnagar under s. 302 IPC for murder of his brother Baga Rao, sentenced to death. Conviction and sentence affirmed by Andhra Pradesh High Court on appeal and reference.",
      "type": "procedural",
      "date": "1956-04-25",
      "source": "lower_court"
    },
    {
      "id": "f23",
      "text": "Along with the appellant, three other persons, named Lingarao (appellant's brother), Narsingrao (nephew of appellant and son of Lingarao), and Mahboob Ali (close friend), tried under s. 302 read with ss. 34 and 109 IPC, convicted and sentenced to life imprisonment. High Court dismissed their appeals.",
      "type": "procedural",
      "date": "1956-11-20",
      "source": "lower_court"
    },
    {
      "id": "f24",
      "text": "No grievance made before Munsiff-Magistrate or Sessions Judge regarding non-compliance with s.173(4). Grievance raised first in High Court appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f25",
      "text": "High Court found accused got copies in Sessions Court before recording of statements, no request for adjournment or grievance about time.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether and, if so, how far non-compliance with the provisions of ss. 173(4) and 207A(3) of the Code of Criminal Procedure, has affected the legality of the proceedings and the trial resulting in the conviction of the appellant.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The provisions of ss. 173(4) and 207A(3) of the Code of Criminal Procedure, have not been complied with, and that, as a necessary consequence of those omissions, the entire proceedings and the trial are vitiated.",
      "supporting_facts": [
        "f11",
        "f17",
        "f18",
        "f24"
      ],
      "legal_basis": "ss. 173(4), 207A(3) CrPC"
    },
    {
      "id": "pa2",
      "text": "The omission had the effect of vitiating the entire proceedings ending in the trial of the accused, and that, therefore, ipso facto, a fresh trial became necessary irrespective of whether or not the accused had shown any prejudice.",
      "supporting_facts": [
        "f24",
        "f25"
      ],
      "legal_basis": "ss. 173(4), 207A(3) CrPC mandatory"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The omission was not sufficient to vitiate the trial unless the accused succeeded in showing that they had been prejudiced in their defence.",
      "supporting_facts": [
        "f24",
        "f25"
      ],
      "legal_basis": "s.537 CrPC"
    },
    {
      "id": "ra2",
      "text": "When the accused got the copies in the Sessions Court before the recording of the statement of the witnesses, it could not be said that the accused had been so prejudiced.",
      "supporting_facts": [
        "f25"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The courts below have relied upon the evidence of the eye-witnesses, corroborated by the incriminating circumstances, and have agreed in convicting and sentencing the accused. No reason to differ on merits.",
      "addresses_issue": "i1",
      "key_observation": "No ground for interference with conclusions of courts below on merits of the case."
    },
    {
      "id": "cr2",
      "text": "Non-compliance with ss.173(4) and 207A(3) is an irregularity curable under s.537 CrPC, not mandatory provision vitiating trial unless prejudice shown.",
      "addresses_issue": "i1",
      "key_observation": "Word 'shall' in sub-s.4 of s.173 and sub-s.3 of s.207A is not mandatory but only directory."
    },
    {
      "id": "cr3",
      "text": "No attempt made to show prejudice caused to accused. Accused had copies in Sessions Court, cross-examined at length, no request for adjournment.",
      "addresses_issue": "i1",
      "key_observation": "Accused failed to show any prejudice."
    },
    {
      "id": "cr4",
      "text": "Provisions introduced to simplify procedure and safeguard accused, but omission should not render proceedings wholly ineffective.",
      "addresses_issue": "i1",
      "key_observation": "If prejudice shown, court may reopen, but not here."
    },
    {
      "id": "cr5",
      "text": "Facts simple: daylight murder by four in concert, two eyewitnesses, FIR prompt naming all accused, no scope for prejudice in defence.",
      "addresses_issue": "i1",
      "key_observation": "Straightforward case which accused failed to meet."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Non-compliance with ss.173(4) and 207A(3) CrPC is mere irregularity curable under s.537 unless prejudice shown to accused.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No prejudice shown; conviction and death sentence upheld.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Abdul Rahman v. The King-Emperor",
      "citation": "1929 L.R. 55 I.A. 96",
      "treatment": "followed",
      "relevance": "Failure to comply with s.360 CrPC is irregularity cured by ss.535 and 537."
    },
    {
      "case_name": "Pulukuri Kotayya and others v. King-Emperor",
      "citation": "1947 L.R. 74 I.A. 65",
      "treatment": "followed",
      "relevance": "Breach of s.162 CrPC is irregularity cured under s.537 if trial conducted substantially as prescribed."
    },
    {
      "case_name": "N. A. Subramania Iyer's case",
      "citation": "1901 L.R. 28 I.A. 257",
      "treatment": "distinguished",
      "relevance": "Trial conducted in manner different from Code is bad; not applicable here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "34",
        "109"
      ],
      "relevance": "Charges framed for murder and participation."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "173(4)",
        "207A(3)",
        "207A(4)",
        "537",
        "162",
        "164",
        "360",
        "154",
        "161"
      ],
      "relevance": "Non-compliance with document supply provisions; curable irregularity unless prejudice."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed. Supreme Court upheld the conviction under s.302 IPC and death sentence by Sessions Judge, affirmed by High Court, finding no merit in challenge to evidence and holding non-compliance with ss.173(4) and 207A(3) CrPC as curable irregularity without prejudice to accused.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The word shall occurring both in sub-s. 4 of s. 173 and sub-s. 3 of s. 207A is not mandatory but only directory.",
      "speaker": "court",
      "significance": "Core holding on nature of provisions."
    },
    {
      "text": "When a trial is conducted in a manner different from that prescribed by the Code... the trial is bad... but if the trial is conducted substantially in the manner prescribed by the Code, but some irregularity occurs... the irregularity can be cured under s. 537.",
      "speaker": "court",
      "significance": "Adopts Judicial Committee test distinguishing illegality from irregularity."
    },
    {
      "text": "We have been taken through the evidence in this case and after having heard counsel for the appellant, we do not see any reasons to differ from the courts below in their estimate of the evidence.",
      "speaker": "court",
      "significance": "Rejects challenge to factual findings."
    }
  ],
  "_case_id": "1957_20",
  "_label": 0,
  "_text_length": 24518,
  "_extracted_at": "2026-02-08T22:35:55.695267"
}