{
  "metadata": {
    "case_name": "Council of the Institute of Chartered Accountants of India v. Respondent",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 170 of 1956",
    "date_of_judgment": "1957-09-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On July 17, 1933, the respondent was enrolled as a registered accountant under the Auditors Certificate Rules, 1932.",
      "type": "background",
      "date": "1933-07-17",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "When the Chartered Accountants Act, 1949, came into operation, the respondent's name was entered as a Member of the Institute of Chartered Accountants of India on July 1, 1949.",
      "type": "background",
      "date": "1949-07-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On September 13, 1950, the respondent was appointed a Liquidator of three companies.",
      "type": "material",
      "date": "1950-09-13",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The respondent obtained refund of the sums and securities deposited on behalf of the three companies with the Reserve Bank of India.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The respondent made no report about the progress of liquidation of the said three companies. Repeated requests made to him by the Assistant Controller of Insurance found no response.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "As Liquidator the respondent gave a cheque to Shri S. K. Mandal, Solicitor to the Central Government at Calcutta, towards payment of the taxed costs in the winding-up proceedings of one of the companies. The said cheque was returned dishonoured on the ground that the payment had not been arranged for.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Assistant Controller of Insurance cancelled the appointment of the respondent as Liquidator by his letter dated October 29, 1952.",
      "type": "material",
      "date": "1952-10-29",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The respondent was called upon to hand over all books of account, records, documents, etc., to Shri N. N. Das, who was appointed Liquidator in his place.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Shri Das as well as the Assistant Controller of Insurance made repeated demands on the respondent to deliver to Shri Das the assets and records of the three companies.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The respondent had with him securities of the value of Rs. 11,950 and a cash sum of Rs. 642 on account of the United Common Provident Insurance Co. Ltd.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "He had also with him securities to the value of Rs. 12,100 on account of the Asiatic Provident Co. Ltd., and securities and cash on account of the Citizens of India Provident Insurance Co. Ltd.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Out of these amounts the respondent returned only securities of the face value of Rs. 10,000 and Rs. 350 of Asiatic Provident Co. Ltd., and United Common Provident Insurance Co. Ltd., respectively. He failed to send any further securities or cash held by him on account of the said three companies.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "A complaint was lodged against the respondent with the Council of the Institute of Chartered Accountants of India in Calcutta.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The disciplinary committee of the Council inquired into the matter as required by the Act. Notice was served on the respondent but he filed no written statements within the time fixed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On August 1, 1953, a letter was received from the respondent that he was ill and was unable to attend personally. The respondent requested adjournment. Proceedings were adjourned to August 29, 1953.",
      "type": "procedural",
      "date": "1953-08-01",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "On August 29, 1953, the respondent was represented by counsel who filed the respondent's affidavit stating that he was prepared to hand over the entire cash, books of account, etc., to the newly appointed Liquidator without rendering the necessary accounts.",
      "type": "procedural",
      "date": "1953-08-29",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Shri Das gave evidence before the disciplinary committee.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "The respondent failed to appear or take part in the proceedings despite several opportunities.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "The committee made its report on September 13, 1953, finding the respondent guilty of gross negligence in the conduct of his professional duty in not handing over charge of the assets and the books of account to the newly appointed Liquidator.",
      "type": "procedural",
      "date": "1953-09-13",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "The Council agreed with the finding in substance but took the view that the acts and omissions were more serious than gross negligence.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "The Council's finding was forwarded to the High Court of Judicature at Calcutta under section 21(1) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "By judgment dated January 12, 1955, the Calcutta High Court (Chief Justice and Mr. Justice Lahiri) rejected the reference on the ground that no action could be taken against the respondent under the Act though the facts showed grossly improper conduct if not dishonesty.",
      "type": "procedural",
      "date": "1955-01-12",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "What is the nature, scope and extent of the disciplinary jurisdiction which can be exercised under the provisions of the Chartered Accountants Act, 1949 against the respondent.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the respondent's conduct as Liquidator amounts to professional misconduct under sections 21 and 22 of the Act.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the High Court has power under section 21(2),(3),(4) to take action even if it adopts a broader interpretation than the Council's finding.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The learned Judges of the Calcutta High Court have put an unduly restricted and narrow construction on the provisions of s. 21 and s. 22 in holding that the respondent's conduct does not amount to professional misconduct.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6",
        "f7",
        "f8",
        "f9",
        "f10",
        "f11",
        "f12"
      ],
      "legal_basis": "Sections 2(2)(iv), 21, 22, Regulation 78 of the Chartered Accountants Act, 1949"
    },
    {
      "id": "pa2",
      "text": "The technical reason given by the High Court in not taking action even if broader interpretation accepted proceeds on a misconception about the nature and extent of the powers of the High Court under s. 21(2),(3),(4).",
      "supporting_facts": [
        "f21",
        "f22"
      ],
      "legal_basis": "Section 21(2),(3),(4) of the Chartered Accountants Act, 1949"
    },
    {
      "id": "pa3",
      "text": "Disciplinary jurisdiction extends beyond narrow professional misconduct to any conduct rendering unfit, per s.21(1) and inclusive definition in s.22.",
      "supporting_facts": [],
      "legal_basis": "Sections 8(v),(vi), 21(1), 22 of the Chartered Accountants Act, 1949"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The conduct proved cannot be said to be professional misconduct properly so-called and cannot attract ss.21 and 22; misconduct not connected with exercise of profession unless involving moral turpitude.",
      "supporting_facts": [
        "f22"
      ],
      "legal_basis": "Sections 21, 22 of the Chartered Accountants Act, 1949"
    },
    {
      "id": "ra2",
      "text": "Even if broader view, High Court cannot act as Council's finding was only gross negligence (professional), not broader misconduct.",
      "supporting_facts": [
        "f19",
        "f20",
        "f22"
      ],
      "legal_basis": "Sections 21, 22 of the Chartered Accountants Act, 1949"
    },
    {
      "id": "ra3",
      "text": "Reliance on precedents: G.M. Oka In re (false evidence not professional misconduct unless conviction); Haseldine v. Hosken.",
      "supporting_facts": [],
      "legal_basis": "G.M. Oka In re; Haseldine v. Hosken"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Acting as liquidator falls under s.2(2)(iv) and Regulation 78, so deemed 'in practice'; thus conduct as liquidator is professional misconduct.",
      "addresses_issue": "i2",
      "key_observation": "Chartered accountants rendering services under cl.(iv) are in practice; object is to bring such conduct within disciplinary jurisdiction."
    },
    {
      "id": "cr2",
      "text": "S.21(1) allows inquiry into any conduct rendering unfit; s.22 inclusive definition does not limit powers; schedule not exhaustive.",
      "addresses_issue": "i1",
      "key_observation": "Disciplinary jurisdiction not confined to schedule or narrow professional misconduct."
    },
    {
      "id": "cr3",
      "text": "High Court under s.21(2),(3) can examine correctness of findings, refer back, or pass final orders; not bound by Council's specific finding if facts allow broader view.",
      "addresses_issue": "i3",
      "key_observation": "Powers wide to do complete justice; facts not disputed."
    },
    {
      "id": "cr4",
      "text": "Precedents distinguished: G.M. Oka obiter and overlooked s.2(2)(iv); Haseldine inapplicable to Act interpretation.",
      "addresses_issue": "i1",
      "key_observation": "Decisions do not assist respondent."
    },
    {
      "id": "cr5",
      "text": "Respondent's conduct wholly unworthy: refusal to reply, failure to return assets suggest delaying tactics; grossly improper, calls for deterrent order.",
      "addresses_issue": "i2",
      "key_observation": "Guilty of professional misconduct."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Respondent guilty of professional misconduct as liquidator duties deemed 'in practice' under s.2(2)(iv).",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Disciplinary jurisdiction under s.21(1) extends to any conduct rendering unfit, not limited by s.22 schedule.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "High Court has wide powers under s.21(2),(3),(4) to pass appropriate orders based on proved facts.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "G. M. Oka, In re",
      "citation": "1952 22 Comp. Cas. 168",
      "treatment": "distinguished",
      "relevance": "Observations on non-professional misconduct obiter and overlooked s.2(2)(iv); conviction attracts s.8(vi)."
    },
    {
      "case_name": "Haseldine v. Hosken",
      "citation": "1933 1 K.B. 822",
      "treatment": "distinguished",
      "relevance": "Inapplicable to interpreting Chartered Accountants Act provisions on professional capacity."
    },
    {
      "case_name": "Krishnaswamy v. The Council of the Institute of Chartered Accountants",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Concerned whether s.21(2) orders are civil proceedings; inapplicable."
    }
  ],
  "statutes_cited": [
    {
      "name": "Chartered Accountants Act, 1949",
      "sections": [
        "Section 2(1)(b)",
        "Section 2(2)",
        "Section 2(2)(iv)",
        "Section 4",
        "Section 5",
        "Section 6",
        "Section 7",
        "Section 8(v)",
        "Section 8(vi)",
        "Section 20",
        "Section 21",
        "Section 22",
        "Section 30",
        "Regulation 78"
      ],
      "relevance": "Defines chartered accountant, practice including liquidator services; disciplinary jurisdiction for misconduct rendering unfit; High Court powers on reference."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court reverses Calcutta High Court judgment, holds respondent guilty of professional misconduct under the Act, and states it is necessary to deal with him on that basis and make appropriate order under s.21(3); calls for deterrent order given grossly improper conduct.",
    "relief_granted": "Appeal allowed; respondent to face disciplinary action as guilty of professional misconduct.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the respondent is clearly guilty of professional misconduct.\"",
      "speaker": "court",
      "significance": "Core holding on liability."
    },
    {
      "text": "\"His refusal to give prompt replies... leave no room for doubt that he was unable to return the said amount... merely employing delaying tactics.\"",
      "speaker": "court",
      "significance": "Assesses severity of misconduct."
    },
    {
      "text": "\"It is not conduct which is only technically improper or unworthy it is conduct which is grossly improper and unworthy and as such it calls for a deterrent order.\"",
      "speaker": "court",
      "significance": "Justifies strong sanction."
    },
    {
      "text": "\"A member of the Institute... shall be deemed to be in practice when he renders such other services as in the opinion of the Council are or may be rendered by a chartered accountant.\"",
      "speaker": "court",
      "significance": "Interprets s.2(2)(iv) to include liquidator role."
    }
  ],
  "_case_id": "1957_101",
  "_label": 1,
  "_text_length": 30445,
  "_extracted_at": "2026-02-10T19:23:48.509295"
}