{
  "metadata": {
    "case_name": "Appellant v. State of West Bengal",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha J."
    ],
    "case_number": "Criminal Appeal No. 52 of 1955",
    "date_of_judgment": "1957-10-24"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was honorary secretary of Nari Kalyan Ashram, an institution for young girls and women without homes or who had gone astray, located in Calcutta.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant used to come to Ashram daily at about 7 p.m. and stay till midnight or past, occupying bed in office room and requisitioning services of girls like Sudharani, Narmaya, Kalyani for massage.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Between January and April 1954, appellant committed rape on girls including Sudharani, Narmaya, Kalyani.",
      "type": "disputed",
      "date": "1954-01 to 1954-04",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "On night of April 20, 1954, appellant first called Narmaya then Sudharani to his room, committed rape on Narmaya then Sudharani in presence of both, against their will, using rubber sheath, had tea with black pill in between, paid each eight annas, warned not to disclose.",
      "type": "material",
      "date": "1954-04-20",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Sudharani Roy about 14-15 years old; Ashram register and medical evidence (X-ray ossification on May 19, 1954) estimated age 13-14 years.",
      "type": "material",
      "date": "1954-05-19",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "On April 29, 1954 at 10 p.m., officer-in-charge Maniktala PS and SI Nirmal Chandra Kar visited Ashram re escape of girls; Narmaya and Sudharani gave info of rape, pointed to steel locker in secretary's room containing rubber sheaths; key obtained from appellant, leather bag with rubber sheath found.",
      "type": "procedural",
      "date": "1954-04-29",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Police investigated, submitted charge-sheet; after magistrate inquiry, committed to Sessions Court on charge u/s 376 IPC for rape on two girls.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Defence: case false, concocted by police with inmates and Asst. Secretary Tarun Kumar Sarkar (PW).",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Prosecution examined 23 witnesses including victims Sudharani (PW2), Narmaya (PW5), Kalyani (PW19, deaf-dumb, feeble-minded, evidence by signs interpreted).",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Kalyani (PW19) corroborated rape on Sudharani on April 20, 1954.",
      "type": "material",
      "date": "1954-04-20",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Woman employee stated appellant asked her to keep rubber sheaths, buried underground, recovered by police.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Victims complained to Asst. Secretary next day.",
      "type": "material",
      "date": "1954-04-21",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Jury unanimous guilty u/s 376 IPC on Sudharani; unanimous not guilty on Narmaya ('Not guilty as we found with consent and she is above 16 years of age').",
      "type": "procedural",
      "date": "1955-01-22",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Sessions Judge accepted jury verdict, imposed 5 years RI, considering position in loco parentis.",
      "type": "procedural",
      "date": "1955-01-22",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Calcutta HC Division Bench summarily dismissed appeal on Feb 15, 1955 without reasons.",
      "type": "procedural",
      "date": "1955-02-15",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "On certificate application, Chakravarty CJ and Lahiri J read charge and records, granted certificate on March 18, 1955, noting arguable points though unlikely to succeed, to ensure appearance of justice.",
      "type": "procedural",
      "date": "1955-03-18",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether certificate granted by Calcutta High Court under Art. 134(1)(c) Constitution is valid, or bad on face as one Bench criticised another and granted on grounds of appearance of justice rather than fit case involving law.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Sessions Judge erred in refusing to read out appellant's written statement to jury.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether misdirection in charge re corroboration of victims' testimony, treating them as accomplices.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether direction on age of Sudharani incomplete or erroneous.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Learned judge refused permission to read out written statement filed by appellant at Sessions stage.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "CrPC s. 256(2)"
    },
    {
      "id": "pa2",
      "text": "Serious misdirection re corroboration of victims' testimony.",
      "supporting_facts": [
        "f9",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Direction as to age of Sudharani incomplete.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Case false, concocted by police, inmates, Asst. Secretary.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Certificate granted by HC Bench bad on face, as criticised summary dismissal by another Bench, condemned practice, granted not on fit case but appearance of justice.",
      "supporting_facts": [
        "f15",
        "f16"
      ],
      "legal_basis": "Art. 134(1)(c) Constitution; Haripada Dey v. State of West Bengal"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Certificate invalid as one HC Bench cannot sit in judgment on another; observations criticise summary dismissal practice sanctioned by CrPC; certificate must certify fit case on law, not facts or appearance of justice.",
      "addresses_issue": "i1",
      "key_observation": "Preliminary objection upheld; certificate not proper."
    },
    {
      "id": "cr2",
      "text": "No provision in CrPC for written statement at Sessions stage like in magistrates; in jury trial, inadmissible to prevent irrelevant matter; s.342 statement suffices.",
      "addresses_issue": "i2",
      "key_observation": "Refusal correct."
    },
    {
      "id": "cr3",
      "text": "Charge correctly warned on prudence of corroboration for prosecutrix (not strictly accomplice); open to convict on uncorroborated if satisfied; here corroboration from Kalyani, circumstances; cited Rameshwar v. State of Rajasthan.",
      "addresses_issue": "i3",
      "key_observation": "No misdirection; error if any favoured accused."
    },
    {
      "id": "cr4",
      "text": "Charge fairly put all age evidence (register, ossification, etc.); no birth certificate; benefit of doubt but jury could conclude under 16; medical 13-14.",
      "addresses_issue": "i4",
      "key_observation": "No error."
    },
    {
      "id": "cr5",
      "text": "Charge fair, full; jury took commonsense view distinguishing ages; no merit in appeal even if special leave considered.",
      "addresses_issue": "i1",
      "key_observation": "Conviction proper."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court certificate under Art.134(1)(c) invalid if granted critiquing another Bench or for appearance of justice without legal complexities.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No CrPC provision requires Sessions Court to read accused's written statement to jury; refusal proper to avoid inadmissible matter.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Corroboration of prosecutrix advisable as prudence but not compulsory rule of law; jury may convict on uncorroborated if satisfied.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Age proved by circumstances, medical, register where no birth certificate.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Haripada Dey v. The State of West Bengal",
      "citation": null,
      "treatment": "followed",
      "relevance": "Certificate under Art.134(1)(c) must be for fit case on law, not facts; High Court erred in granting on improper grounds."
    },
    {
      "case_name": "Rameshwar v. The State of Rajasthan",
      "citation": "1952 S.C.R. 386",
      "treatment": "followed",
      "relevance": "Rule of prudence for corroboration of prosecutrix present to jury's mind; not compulsory in every case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "376"
      ],
      "relevance": "Charge and conviction for rape."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "342",
        "256(2)"
      ],
      "relevance": "Statement of accused; no provision for written statement at Sessions like magistrates."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "134(1)(c)",
        "136"
      ],
      "relevance": "Certificate for appeal to SC; special leave."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Preliminary objection upheld, certificate invalid; on merits under Art.136, no substance in contentions, charge fair, jury verdict proper; appeal dismissed confirming conviction and 5 years RI.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"We are oppressed by the feeling that there were arguable points, although they might not bear examination and the accused has not had the satisfaction of feeling that he has been fully heard by the Court of appeal.\"",
      "speaker": "court",
      "significance": "Reason given by HC CJ for granting certificate, held improper by SC."
    },
    {
      "text": "\"The only rule of law is that this rule of prudence must be present to the mind of the judge or the jury as the case may be and be understood and appreciated by him or them. There is no rule of practice that there must, in every case, be corroboration before a conviction can be allowed to stand.\"",
      "speaker": "court",
      "significance": "From Rameshwar, affirming no compulsion for corroboration."
    },
    {
      "text": "\"In our opinion, the learned Sessions Judge placed the evidence pro and con very fairly and fully, and left it to the jury to come to their own conclusion.\"",
      "speaker": "court",
      "significance": "SC approval of charge."
    }
  ],
  "_case_id": "1957_86",
  "_label": 0,
  "_text_length": 23504,
  "_extracted_at": "2026-02-10T19:23:42.267920"
}