{
  "metadata": {
    "case_name": "Appellants v. Respondent",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "IMAM, J."
    ],
    "case_number": "Civil Appeal No. 100 of 1957",
    "date_of_judgment": "1957-09-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was appointed in temporary capacity to Subordinate Agricultural Service (Group II) from November 16, 1936 to March 18, 1937; April 1, 1937 to June 29, 1937; August 9, 1937 to December 31, 1937; January 6, 1938 to February 22, 1943.",
      "type": "background",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f2",
      "text": "Appellant appointed in temporary capacity to Subordinate Agricultural Service (Group I) from February 23, 1943 to April 24, 1944.",
      "type": "background",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "Appellant appointed to officiate in United Provinces Agricultural Service Class II as Divisional Superintendent of Agriculture from April 25, 1944, with approval of Public Service Commission, served temporarily for about ten years.",
      "type": "background",
      "date": "1944-04-25",
      "source": "appellant"
    },
    {
      "id": "f4",
      "text": "Appellant reverted to original appointment in Subordinate Agricultural Service by order of Uttar Pradesh Government dated May 3, 1954.",
      "type": "procedural",
      "date": "1954-05-03",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Appellant protested reversion, handed over charge on May 16, 1954, and went on leave until October 2, 1954.",
      "type": "procedural",
      "date": "1954-05-16",
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "Notice dated September 13, 1954, issued by Director of Agriculture terminating appellant's services in Subordinate Agricultural Service under r. 25 cl. 4 of Subordinate Agriculture Service Rules, services not required after expiry of one month.",
      "type": "material",
      "date": "1954-09-13",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Appellant filed application under Art. 226 of Constitution in Allahabad High Court challenging reversion and termination orders.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f8",
      "text": "Allahabad High Court dismissed application on October 21, 1955, holding appellant not dismissed or removed, Art. 311 not applicable; dismissed certificate for appeal.",
      "type": "procedural",
      "date": "1955-10-21",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellant shown in Gradation List as on probation in Subordinate Agricultural Service.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant never confirmed in any post in Subordinate Agricultural Service or United Provinces Agricultural Service Class II; not permanently appointed to either service; always temporarily employed.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant's contention of absorption in permanent cadre of United Provinces Agricultural Service not substantiated.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the orders terminating the appellant's services and reverting him to his original appointment in the Subordinate Agricultural Service amount to removal, dismissal or reduction in rank within the meaning of Art. 311 of the Constitution.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Art. 311 applies to temporary employees holding civil posts under the Government.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Art. 311 of the Constitution applied even to a temporary appointment because the appellant held a civil post under the Government of the State of Uttar Pradesh although he may not have been a member of a Civil Service of that State.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Article 311 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "The order terminating his services amounted to dismissal or removal from the post as it conveyed an imputation of inefficiency and unsatisfactory work.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Article 311 of the Constitution"
    },
    {
      "id": "pa3",
      "text": "The order reverting him from the post held by him in the United Provinces Agricultural Service to his original appointment in the Subordinate Agricultural Service amounted to a reduction in his rank, as it was by way of penalty.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Article 311 of the Constitution"
    },
    {
      "id": "pa4",
      "text": "The mandatory provisions of Art. 311 not having been complied with, the aforesaid orders passed against the appellant were illegal.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "Article 311 of the Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant had not been dismissed or removed from service and Art. 311 did not apply.",
      "supporting_facts": [
        "f8",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Appellant failed to establish confirmation as member of Subordinate Agricultural Service or absorption in permanent cadre of United Provinces Agricultural Service.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Finding of High Court that appellant failed to establish confirmation in Subordinate Agricultural Service correct; contention of absorption in permanent cadre of United Provinces Agricultural Service not substantiated; at no time permanently appointed, always temporarily employed.",
      "addresses_issue": "i1",
      "key_observation": "Proceed on basis appellant always temporarily employed."
    },
    {
      "id": "cr2",
      "text": "Termination of services of temporary employee on probation under r. 25 cl. 4 of Subordinate Agriculture Service Rules (one month's notice if not made sufficient use of opportunities or failed to give satisfaction) does not amount to dismissal or removal under Art. 311, as in accordance with conditions of service.",
      "addresses_issue": "i1",
      "key_observation": "No distinction between termination under contract and under conditions of service."
    },
    {
      "id": "cr3",
      "text": "Reversion from temporary post does not per se amount to reduction in rank because temporary post not substantive rank; appellant failed to establish reversion by way of penalty.",
      "addresses_issue": "i1",
      "key_observation": "Reversion order did not contravene Art. 311."
    },
    {
      "id": "cr4",
      "text": "Decisions in Satish Chandra Anand v. Union of India and Shyam Lal v. State of Uttar Pradesh establish termination of services does not in all cases amount to dismissal or removal under Art. 311.",
      "addresses_issue": "i1",
      "key_observation": "Applied to facts here."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Termination of appellant's services under r. 25 cl. 4 does not amount to dismissal or removal from service within Art. 311 as in accordance with terms of conditions of service.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Order of reversion from temporary post does not amount to reduction in rank under Art. 311, absent proof it was by way of penalty.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Orders terminating services and reverting appellant valid, did not contravene Art. 311.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Satish Chandra Anand v. Union of India",
      "citation": "1953 S.C.R. 655",
      "treatment": "followed",
      "relevance": "Termination in accordance with terms of contract does not amount to dismissal or removal under Art. 311."
    },
    {
      "case_name": "Shyam Lal v. State of Uttar Pradesh",
      "citation": "1955 1 S.C.R. 26",
      "treatment": "followed",
      "relevance": "Compulsory retirement under Art. 465A Civil Service Regulations does not amount to dismissal or removal under Art. 311."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 311"
      ],
      "relevance": "Application under Art. 226 filed; Art. 311 held not contravened by termination or reversion of temporary employee."
    },
    {
      "name": "Subordinate Agriculture Service Rules",
      "sections": [
        "Rule 25 cl. 4"
      ],
      "relevance": "Permits termination of probationer with one month's notice; termination valid thereunder."
    },
    {
      "name": "Civil Service Regulations",
      "sections": [
        "Article 465A"
      ],
      "relevance": "Cited in Shyam Lal precedent for compulsory retirement not being dismissal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave against Allahabad High Court dismissal of Art. 226 application dismissed. High Court findings upheld; reversion and termination orders held valid, not amounting to dismissal, removal or reduction in rank under Art. 311.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The termination of the appellants services under r. 25 4 does not amount to dismissal or removal from service within the meaning of Art. 311 as it was in accordance with the terms of the conditions of service applicable to the appellant.",
      "speaker": "court",
      "significance": "Core holding on validity of termination for temporary employee."
    },
    {
      "text": "Reversion from a temporary post held by a person does not per se amount to reduction in rank because the temporary post held by him is not his substantive rank.",
      "speaker": "court",
      "significance": "Explains why reversion not penalized under Art. 311."
    }
  ],
  "_case_id": "1957_123",
  "_label": 0,
  "_text_length": 7510,
  "_extracted_at": "2026-02-10T19:24:17.605572"
}