{
  "metadata": {
    "case_name": "Appellant v. Respondent (Scheduled Bank)",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar J."
    ],
    "case_number": "Civil Appeal No. 357 of 1957",
    "date_of_judgment": "1958-01-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, a scheduled bank, sued the appellant in the court of the Civil Judge, Sitapur in Uttar Pradesh, for the recovery of money due under an instrument of mortgage.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant contested the suit on several grounds, one of which was that he was entitled to relief under the Uttar Pradesh Zamindars Debt Reduction Act, U.P. XV of 1953, which reduced the amount recoverable on a debt as defined in it.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Debt is defined in the Act as 'an advance in cash or in kind and includes any transaction which is in substance a debt but does not include an advance as aforesaid made on or after the first day of July, 1952 or a debt due to the Central Government or Government of any State, a local authority, a scheduled bank, a co-operative society, a waqf, trust or endowment for a charitable or religious purpose only, a person, where the debt was advanced on his behalf by the Court of Wards to a ward.'",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "As the respondent was a scheduled bank, the debt due to it from the appellant was not a debt within this definition and consequently no relief would appear to be available to the appellant under the Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellant contended that the definition insofar as it excluded certain debts offended Art. 14 of the Constitution as it made an arbitrary distinction between several classes of debtors and denied the excluded debtors the equal protection of the law, and that hence that portion should be struck out and the rest left operative.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The appellant made an application to the Civil Judge, Sitapur, under the proviso to s. 113 of the Code of Civil Procedure asking him to state a case for the opinion of the High Court at Allahabad as to the invalidity of the impugned portion of the definition.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The Civil Judge took the view that the impugned portion infringed Art. 14 as it made an arbitrary distinction between several classes of debtors and was invalid, but held that it was not necessary for disposal of the case to decide such question because even if decided in favour of appellant, the result would exclude the entire definition as the offending portion was not severable, and dismissed the application.",
      "type": "procedural",
      "date": "1955-08-06",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The appellant made an application to the High Court at Allahabad for revision of the Civil Judge's order and another under Art. 228 of the Constitution praying withdrawal of the case.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The High Court held there was no dispute as to the constitutional principle of equal protection, that the only dispute was severability which was a question of construction of the Act not interpretation of Constitution, and even if constitutional question arose it was not necessary for disposal, and dismissed both applications.",
      "type": "procedural",
      "date": "1956-02-28",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appeal by special leave to Supreme Court from High Court judgment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the proviso to s. 113 CPC applies, requiring the Civil Judge to state a case to the High Court on the validity of the impugned portion of the definition of 'debt' in the U.P. Zamindars Debt Reduction Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Art. 228 of the Constitution applies, requiring the High Court to withdraw the case involving a substantial question of law as to the interpretation of the Constitution.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether it is necessary for the disposal of the case to decide the question of the validity of the impugned portion of the definition of 'debt' under Art. 14.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether the impugned exclusion in the definition of 'debt' violates Art. 14 of the Constitution.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The definition of 'debt' insofar as it excludes debts due to scheduled banks etc. offends Art. 14 as it makes an arbitrary distinction between classes of debtors and denies equal protection; hence strike out the exclusion and leave the rest operative.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Art. 14 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "The Civil Judge should state a case under proviso to s.113 CPC as the case involves validity of provision necessary for disposal.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Proviso to s.113 CPC"
    },
    {
      "id": "pa3",
      "text": "High Court should withdraw case under Art.228 as it involves substantial question of constitutional interpretation necessary for disposal.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Art. 228 Constitution"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The question raised comes within proviso to s.113 CPC and Art.228, as it is about validity of provision challenged on ground it contravenes Constitution, which is also interpretation of Constitution.",
      "addresses_issue": "i1",
      "key_observation": "Validity question is one of interpretation of Constitution."
    },
    {
      "id": "cr2",
      "text": "The point is whether it is necessary to decide validity of impugned portion for disposal of case; all other conditions for s.113 proviso and Art.228 exist.",
      "addresses_issue": "i3",
      "key_observation": "Question raised and pressed must be decided."
    },
    {
      "id": "cr3",
      "text": "Courts below erred in holding not necessary because impugned part not severable; severability arises only after invalidity decided, so validity must first be decided.",
      "addresses_issue": "i3",
      "key_observation": "Cannot presuppose invalidity to assess severability without deciding validity."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "It is necessary to decide the question of the validity of the impugned part of the definition to dispose of the case.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Proviso to s.113 CPC and Art.228 apply.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Uttar Pradesh Zamindars Debt Reduction Act, 1953 (U.P. XV of 1953)",
      "sections": [
        "Definition of 'debt'"
      ],
      "relevance": "Impugned exclusion of debts to scheduled banks etc. challenged as violating Art.14; validity necessary to decide for relief."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 14",
        "Art. 228"
      ],
      "relevance": "Art.14 for equal protection challenge to definition; Art.228 for High Court withdrawal on constitutional question."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Proviso to s. 113"
      ],
      "relevance": "Requires stating case to High Court on validity of Act provision necessary for disposal."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed as the courts below erred in holding that it was not necessary to decide the validity of the impugned portion of the definition of 'debt'; such decision is required for disposal of the case.",
    "relief_granted": "Appeal allowed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The question as to the severability of the impugned part of the definition from the rest would arise only after it had been decided that the impugned part was invalid and so to be able to say that the impugned part of the definition was not severable from the rest, it had first to be held that that part was invalid.",
      "speaker": "court",
      "significance": "Core reasoning why validity must be decided first."
    },
    {
      "text": "Without a decision of that question the case could not be disposed of.",
      "speaker": "court",
      "significance": "Establishes necessity for deciding constitutional issue."
    }
  ],
  "_case_id": "1957_117",
  "_label": 1,
  "_text_length": 9258,
  "_extracted_at": "2026-02-10T19:24:20.996917"
}