{
  "metadata": {
    "case_name": "Assessee Company v. Commissioner of Income-tax",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "KAPUR J."
    ],
    "case_number": "Civil Appeal No. 153 of 1954",
    "date_of_judgment": "1957-05-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee company was incorporated on July 29, 1924, as an investment company, the objects of which are set out in cl. III of the memorandum of association and more particularly in sub-cls. 1, 2, 15 and 16 of that clause.",
      "type": "background",
      "date": "1924-07-29",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "The assessment years under review are 1943-44 to 1948-49, excepting the year 1947-48.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Petitioner Company purchased during the period 1st July 1925 to 30th June 1928 shares of the value of Rs. 1,86,47,789/- major portion of which comprised of shares in the Sassoon Group of Mills.",
      "type": "material",
      "date": "1925-07-01 to 1928-06-30",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "During the year ended 30th June 1929 the Petitioner Company promoted two companies known as Loyal Mills Ltd. and Hamilton Studios Ltd. and took over all their shares of the value of Rs. 10 1/2 lacs.",
      "type": "material",
      "date": "1928-07-01 to 1929-06-30",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "In the year 1930, the Petitioner Company purchased shares of Rs. 1,33,930.",
      "type": "material",
      "date": "1930",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "During the period of 9 years from 1st July 1930 to 30th July 1939 number purchases were made with the exception of a few shares of Loyal Mills Ltd., taken over from the staff of E. D. Sassoon Co. Ltd., who retired from service.",
      "type": "material",
      "date": "1930-07-01 to 1939-07-30",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "In the year ended 30th June 1940 reconstruction scheme of the Apollo Mills Ltd., took place under which debentures held by the Petitioner Company in the Apollo Mills Ltd., were redeemed and the proceeds were reinvested in the new issue of shares made by the Apollo Mills Ltd.",
      "type": "material",
      "date": "1939-07-01 to 1940-06-30",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Out of the purchases of the value of Rs. 2,794 made by the Petitioner Company during the year ended 30th June 1941 Rs. 2,000/- was the value of shares of the Loyal Mills Ltd., taken over from the retiring staff.",
      "type": "material",
      "date": "1940-07-01 to 1941-06-30",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "In the year ended 30th June 1943 the Petitioner Company took over from the David Mills Co. Ltd., shares of The Associated Building Co., of the value of Rs. 56,700/-.",
      "type": "material",
      "date": "1942-07-01 to 1943-06-30",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "After this there were no purchases at all to this date excepting purchases of the value of Rs. 34,954 during the year ended 30th June, 1946.",
      "type": "material",
      "date": "1945-07-01 to 1946-06-30",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "In relation to the purchases made by the Petitioner Company as stated above no appreciable sales of shares were made during the period 29th July 1924 to 30th June 1942, the sales made in the year ended 30th June 1929 of the value of Rs. 1,29,333 included shares of the value of Rs. 45,000 in the Loyal Mills Ltd., sold to the members of the staff and shares of the value of Rs. 83,833 representing sterling investments handed over to the creditors of the Petitioner Company in part repayment of the loan taken from them.",
      "type": "material",
      "date": "1924-07-29 to 1942-06-30",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "In the year ended 30th June 1931, shares of the value of Rs. 7,48,356 were handed over to the creditors in payment of the loan granted by them.",
      "type": "material",
      "date": "1930-07-01 to 1931-06-30",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "From the year ended 30th June 1943 E. Sassoon Co. Ltd., started relinquishing the managing agencies of the various Mills under their agency and the shares held by the Petitioner Company in the Sassoon Group of Mills were handed over to the respective purchasers of the Mills agencies.",
      "type": "material",
      "date": "1942-07-01 to 1943-06-30",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Prior to 1940 the assessee company made a claim every year for being treated as a dealer in investments and properties but this contention was consistently repelled and upto the assessment year 1939-40 the assessee company was assessed on the basis of being an investor.",
      "type": "procedural",
      "date": "pre-1940",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "For the assessment year 1940-41 and the two following years 1941-42 and 1942-43 the Department accepting the plea of the assessee company treated it as a dealer in shares, securities and immovable properties and assessed it on that basis.",
      "type": "procedural",
      "date": "1940-41 to 1942-43",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "For these years and for the assessment year 1943-44 the company made its Return on that basis. But after the Return had been filed for the year 1943-44 the assessee company withdrew its Return and filed a revised Return on March 7, 1944, contending that it was not a dealer but merely an investor.",
      "type": "procedural",
      "date": "1944-03-07",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Along with the Return it filed a letter dated March 6, 1944, stating that the previous Return was prepared in conformity with the ruling of the Income-tax Officer in the 1940-41 assessment that the company was to be assessed as a dealer in investments; since then Central Board of Revenue has decided that the Company is an Investment Holding Company; amended Return submitted under Section 22(1); cannot have one status for Excess Profits Tax and another for Income-tax.",
      "type": "procedural",
      "date": "1944-03-06",
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "It was also contended that it never carried on any business in the purchase or sale of shares, securities or properties and therefore prayed that in view of the order of the Central Board of Revenue made on its application under s. 26(1) of the Excess Profits Tax Act it should be assessed for income-tax purpose as an investor and not as a dealer.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f19",
      "text": "The Income-tax Officer rejected this plea and held the investments as the stock-in-trade of its business therein which it carried on during the previous year also.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "The company took an appeal to the Appellate Assistant Commissioner which was dismissed and the order of the Income-tax Officer upheld.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "It then appealed to the Income-tax Appellate Tribunal, Bombay, where the same contentions were raised but were repelled.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f22",
      "text": "The Tribunal held that the company having itself raised the point in all the prior years that it was a dealer in investments and properties, it would appear to be difficult to understand why the company now seeks to get the position changed; the present contention was raised because it made substantial profits; according to the company's memorandum of association and its own assertions made all along in the past, the assessee company is a dealer in investments and properties and the income arising to it on the sale thereof has been rightly held by the Income-tax Officer to be business profits liable to tax under the ordinary provisions of the Income-tax Act.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f23",
      "text": "The company then applied to the Appellate Tribunal under s. 66(1) of the Indian Income-tax Act for a reference of the following questions: Whether on the facts and in the circumstances of the case the assessee company can rightly be treated as a dealer in investments and properties and Whether the profits and losses arising from the sale of shares, securities and immovable properties of the assessee company can be taxed as business profits. This prayer was rejected because in the opinion of the Tribunal no question of law arose out of its order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f24",
      "text": "The assessee company then made an application under s. 66(2) of the Indian Income-tax Act for requiring the Appellate Tribunal to state the case and refer it to the High Court but this application was dismissed by the Bombay High Court on January 15, 1952, in Income-Tax Application No. 54 of 1951.",
      "type": "procedural",
      "date": "1952-01-15",
      "source": "lower_court"
    },
    {
      "id": "f25",
      "text": "The company obtained special leave to appeal to this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether questions of law, if any, arise out of the order of the Appellate Tribunal.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether on the facts and in the circumstances of the case the assessee company can rightly be treated as a dealer in investments and properties.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the profits and losses arising from the sale of shares, securities and immovable properties of the assessee company can be taxed as business profits.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The questions of law arise out of the order of the Tribunal because the Tribunal has ignored the documentary evidence produced before it, has based its decision on irrelevant matters, has failed to consider crucial facts and has misdirected itself by assuming that the petitioner was a dealer from the very beginning which was contrary to the documents produced before it.",
      "supporting_facts": [
        "f1",
        "f3",
        "f4",
        "f5",
        "f6",
        "f7",
        "f8",
        "f9",
        "f10",
        "f11",
        "f12",
        "f13",
        "f14",
        "f16",
        "f17",
        "f18"
      ],
      "legal_basis": "Section 66(1) of the Income-tax Act"
    },
    {
      "id": "pa2",
      "text": "It never carried on any business in the purchase or sale of shares, securities or properties.",
      "supporting_facts": [
        "f11",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The Tribunal relied upon an irrelevant circumstance, namely the powers in the memorandum of association.",
      "supporting_facts": [
        "f1",
        "f22"
      ],
      "legal_basis": "Kishan Prasad Co., Ltd. v. Commissioner of Income-tax, Punjab"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Tribunal did not decide merely because of the memorandum but because the company had actually dealt in investments and properties throughout and had also all along in the past asserted that it was a dealer.",
      "supporting_facts": [
        "f14",
        "f15",
        "f22"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The objects of an incorporated company are not conclusive but relevant for determining the nature and scope of its activities.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Lakshminarayan Ram Gopal v. Government of Hyderabad"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The primary requirement for reference under s.66(1) is that there must be a question of law arising out of the order.",
      "addresses_issue": "i1",
      "key_observation": "To draw a line between what is a question of law and what is a question of fact is not always easy."
    },
    {
      "id": "cr2",
      "text": "Review of English authorities: Findings of fact not open to question unless no evidence; if evidence stated, court can see if justified; matters of degree are questions of fact; inference from facts can be law if no evidence or misdirection.",
      "addresses_issue": "i1",
      "key_observation": "A finding of fact without evidence to support it or based on relevant and irrelevant matters is not unassailable."
    },
    {
      "id": "cr3",
      "text": "Indian authorities: Question of law if no material or insufficient; if Tribunal takes irrelevant materials or conjectures; mixed questions involve facts then legal effect.",
      "addresses_issue": "i1",
      "key_observation": "When the point for determination is a mixed question of law and fact, while the finding of the Tribunal on the facts found is final its decision as to the legal effect of that finding is a question of law."
    },
    {
      "id": "cr4",
      "text": "In the instant case, the Tribunal based findings on objects in memorandum and previous assertions by assessee.",
      "addresses_issue": "i2",
      "key_observation": "Merely because the company has within its objects the dealing in investment in shares does not give to it the characteristics of a dealer in shares. But if other circumstances are proved it may be a relevant consideration."
    },
    {
      "id": "cr5",
      "text": "As to what are the characteristics of the business of dealing in shares or that of an investor is a mixed question of fact and law. What is the legal effect of the facts found by the Tribunal and whether as a result the assessee can be termed a dealer or an investor is itself a question of law.",
      "addresses_issue": "i1",
      "key_observation": "The legal effect of the facts found is a question of law."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Inference from facts would be a question of fact or of law according as the point for determination is one of pure fact or a mixed question of law and fact and that a finding of fact without evidence to support it or if based on relevant and irrelevant matters is not unassailable.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Whether the assessee can be termed a dealer or an investor based on facts found is a mixed question of law and fact, and the legal effect thereof is a question of law.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Stanley v. Gramophone and Typewriter, Limited",
      "citation": "1908 5 T.C. 358",
      "treatment": "referred",
      "relevance": "If Commissioners state evidence, court can say whether evidence justified the holding."
    },
    {
      "case_name": "The American Thread Co. v. Joyce",
      "citation": "1911 6 T.C. 1",
      "treatment": "referred",
      "relevance": "Courts have no jurisdiction over conclusions of fact except to see evidence and proper principles."
    },
    {
      "case_name": "Californian Copper Syndicate v. Harris",
      "citation": "1904 5 T.C. 159",
      "treatment": "followed",
      "relevance": "Test: Is the gain a mere enhancement of value or gain in operation of business for profit-making."
    },
    {
      "case_name": "Cayzer, Irvine Co., Ltd. v. Commissioners of Inland Revenue",
      "citation": "1942 24 T.C. 491",
      "treatment": "referred",
      "relevance": "Court can review if no evidence to support finding."
    },
    {
      "case_name": "Farmer v. Trustees of the Late William Cotton",
      "citation": "1915 A.C. 922",
      "treatment": "referred",
      "relevance": "If all facts found, whether within statutory provisions is question of law."
    },
    {
      "case_name": "Inland Revenue Commissioners v. Lysaght",
      "citation": "1928 A.C. 234",
      "treatment": "distinguished",
      "relevance": "Question of degree is question of fact."
    },
    {
      "case_name": "The Commissioners of Inland Revenue v. The Korean Syndicate, Ltd.",
      "citation": "1921 12 T.C. 181",
      "treatment": "referred",
      "relevance": "Memorandum shows purpose but actual activities determine if carrying on business."
    },
    {
      "case_name": "Great Western Railway Company v. Bater",
      "citation": "1922 8 T.C. 231",
      "treatment": "referred",
      "relevance": "Finding on mixed question styled as fact not unassailable."
    },
    {
      "case_name": "Lysaght v. The Commissioners of Inland Revenue",
      "citation": "1928 13 T.C. 511",
      "treatment": "referred",
      "relevance": "If circumstances might constitute residence, matter of degree for Commissioners."
    },
    {
      "case_name": "Jones v. Leeming",
      "citation": "1930 A.C. 415",
      "treatment": "referred",
      "relevance": "Acquisition with intent to resell at profit not necessarily trade."
    },
    {
      "case_name": "Cameron v. Prendergast",
      "citation": "1940 2 All E.R. 35",
      "treatment": "referred",
      "relevance": "Inferences from facts and construction of documents are law."
    },
    {
      "case_name": "Bomford v. Osborne",
      "citation": "1941 2 All E.R. 426",
      "treatment": "referred",
      "relevance": "Commissioners may deduce further facts from proved facts; determination if evidence supports."
    },
    {
      "case_name": "J. H. Bean v. Doncaster Amalgamated Collieries Ltd.",
      "citation": "1944 2 All E.R. 279",
      "treatment": "referred",
      "relevance": "Conclusion without evidence or not logically following is error in law."
    },
    {
      "case_name": "Edward v. Bairstow",
      "citation": "1955 3 All E.R. 48",
      "treatment": "followed",
      "relevance": "What constitutes trade is question of law; if facts such no reasonable person could conclude otherwise, error in law."
    },
    {
      "case_name": "Cooper v. Stubbs",
      "citation": "1925 2 K.B. 753",
      "treatment": "referred",
      "relevance": "Intervention if no evidence or misdirection."
    },
    {
      "case_name": "Commissioner of Income-tax v. Laxminarain Badridas",
      "citation": "1937 5 I.T.R. 170",
      "treatment": "referred",
      "relevance": "Cannot turn fact into law by asking if conclusion correct."
    },
    {
      "case_name": "Seth Suwallal Chhogalal v. Commissioner of Income-tax",
      "citation": "1949 17 I.T.R. 269",
      "treatment": "referred",
      "relevance": "Question of law if no or insufficient material."
    },
    {
      "case_name": "Dhirajlal Girdharilal v. Commissioner of Income-tax, Bombay",
      "citation": "1954 26 I.T.R. 736",
      "treatment": "referred",
      "relevance": "If irrelevant materials or conjectures, question of law."
    },
    {
      "case_name": "Meenakshi Mills, Madurai v. Commissioner of Income-tax, Madras",
      "citation": "1956 S.C.R. 691",
      "treatment": "followed",
      "relevance": "Mixed questions: facts final, but legal effect reviewable; perverse or no evidence open to attack."
    },
    {
      "case_name": "Kishan Prasad Co., Ltd. v. Commissioner of Income-tax, Punjab",
      "citation": "1955 27 I.T.R. 49",
      "treatment": "referred",
      "relevance": "Company powers have no bearing on whether transaction capital or revenue."
    },
    {
      "case_name": "Lakshminarayan Ram Gopal v. Government of Hyderabad",
      "citation": null,
      "treatment": "referred",
      "relevance": "Objects not conclusive but relevant for nature of activities."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "Section 22(1)",
        "Section 66(1)",
        "Section 66(2)"
      ],
      "relevance": "Basis for filing revised return, requiring reference to High Court if question of law arises."
    },
    {
      "name": "Excess Profits Tax Act",
      "sections": [
        "Section 26(1)"
      ],
      "relevance": "Central Board order on application treating company as investment holding company."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Court held that questions of law arise out of the Tribunal's order as the determination of whether the assessee is a dealer or investor involves mixed question of law and fact, and the legal effect of facts found is a question of law.",
    "relief_granted": "Special leave appeal allowed implying questions of law arise warranting reference.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the question to be determined being-Is the sum of gain that has been made a mere enhancement of value by realising a security, or is it a gain made in an operation of business in carrying out a scheme for profit-making.\"",
      "speaker": "court",
      "significance": "Test for distinguishing investment from business profits from Californian Copper Syndicate."
    },
    {
      "text": "\"When the point for determination is a mixed question of law and fact, while the finding of the Tribunal on the facts found is final its decision as to the legal effect of that finding is a question of law which can be reviewed by the court.\"",
      "speaker": "court",
      "significance": "Key holding on when question of law arises from Meenakshi Mills."
    },
    {
      "text": "\"What is the legal effect of the facts found by the Tribunal and whether as a result the assessee can be termed a dealer or an investor is itself a question of law.\"",
      "speaker": "court",
      "significance": "Conclusion that questions of law arise in this case."
    }
  ],
  "_case_id": "1957_14",
  "_label": 1,
  "_text_length": 29382,
  "_extracted_at": "2026-02-10T19:23:14.122822"
}