{
  "metadata": {
    "case_name": "Sashi Mohan Debnath & Ors. v. State",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "IMAM J."
    ],
    "case_number": "Criminal Appeal No. 114 of 1954",
    "date_of_judgment": "1957-11-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Eight accused tried in Court of Session by Additional Sessions Judge, 24 Parganas at Alipore in Sessions Trial No. 2 of May 1954, charged under ss. 147 and 304/149 IPC; accused Nos. 1,2,3,6 further charged under s. 201 IPC.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Trial Judge delivered charge to jury favourable to accused; jury returned unanimous verdict of not guilty under s. 304/149 IPC, which Judge accepted and acquitted all accused of this offence.",
      "type": "procedural",
      "date": "1954-06-07",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Jury returned unanimous verdict of guilty under ss. 147 and 201 IPC against accused charged with these offences; trial Judge disagreed with this verdict.",
      "type": "procedural",
      "date": "1954-06-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Trial Judge made reference under s. 307 CrPC to Calcutta High Court (Reference No. 6 of 1954) on charges under ss. 147 and 201, opining accused not guilty of these offences, dated June 7, 1954.",
      "type": "procedural",
      "date": "1954-06-07",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Calcutta High Court accepted reference in part, convicted Sashi Mohan Debnath, Rajendra Debnath, Sudhanshu Kumar Debnath, Dinesh Chandra Debnath and Bonomali Das under s. 147 IPC (1 year RI each); Sashi Mohan Debnath and Rajendra Debnath under s. 201 IPC (3 years RI, concurrent); acquitted Manindra Debnath, Gouranga Debnath under s. 147, Manindra and Rohini Kumar Debnath under s. 201.",
      "type": "procedural",
      "date": "1954-07-21",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appeal by special leave to Supreme Court by accused Sashi Mohan Debnath, Rajendra Debnath, Sudhanshu Kumar Debnath and Bonomali Das.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On September 12, 1956, Supreme Court issued notices to accused Nos. 3,6,8 (Manindra Debnath, Rohini Kumar Debnath, Gouranga Debnath); served on Manindra and Gouranga; Rohini untraceable; none appeared.",
      "type": "procedural",
      "date": "1956-09-12",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Occurrence took place on October 21, 1953.",
      "type": "background",
      "date": "1953-10-21",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the reference made to the Calcutta High Court by the Additional Sessions Judge under s. 307 CrPC was competent, given that the Judge accepted jury verdict and acquitted on s. 304/149 IPC but referred only on ss. 147 and 201 IPC; and if not, whether High Court had jurisdiction to convict or acquit any accused.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Reference under s. 307 CrPC must be of the whole case against the accused and not a part of it; Sessions Judge's acceptance of jury verdict and recording acquittal on s. 304/149 IPC rendered reference incompetent; High Court could not exercise powers under s. 307(3); cited Calcutta and Allahabad High Court decisions.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "s. 307 CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No submissions made on facts; on law, supported view that High Court could deal with reference even if partial, citing certain Calcutta and Allahabad High Court decisions.",
      "supporting_facts": [],
      "legal_basis": "s. 307 CrPC; cases like King Emperor v. Ananda Charan Ray, Emperor v. Nawal Behari"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Scheme of CrPC ss. 306-307 requires trial by jury in Sessions Court; Judge may disagree with verdict but cannot record judgment; must submit whole case to High Court if disagrees and necessary for ends of justice; s. 307(2) prohibits recording judgment of acquittal/conviction on any charges when submitting reference.",
      "addresses_issue": "i1",
      "key_observation": "Case to be submitted is the whole case against the accused and not a part of it."
    },
    {
      "id": "cr2",
      "text": "High Court, on valid reference, considers entire evidence, gives due weight to Judge and jury opinions, acquits/convicts of offences jury could have convicted on; but invalid reference (partial) prevents this; Sessions Judge's acquittal on s. 304/149 took case out of High Court's hands for entire consideration.",
      "addresses_issue": "i1",
      "key_observation": "Competent reference is condition precedent for High Court's powers under s. 307(3)."
    },
    {
      "id": "cr3",
      "text": "Amendments to s. 307 in 1923 and 1955 confirm whole case must be referred: 1923 allowed accepting verdict for some accused while referring others; 1955 on divided jury requires submission of whole case.",
      "addresses_issue": "i1",
      "key_observation": "Parliament thought it was the whole case which must be submitted."
    },
    {
      "id": "cr4",
      "text": "Patna HC in Hazari Lal and Ramjanam Tewari, Calcutta HC in Emperor v. Bishnu Chandra Das held partial reference incompetent; other cases like Ananda Charan Ray effectively same view; Allahabad cases erroneous if allowed High Court to proceed despite incompetence.",
      "addresses_issue": "i1",
      "key_observation": "Reference incompetent; High Court should reject it."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Reference under s. 307 CrPC by Additional Sessions Judge incompetent as it was only part of case after recording acquittal on other charges; High Court lacked jurisdiction to convict/acquit.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hazari Lal",
      "citation": "1932 I.L.R. Pat. 395",
      "treatment": "followed",
      "relevance": "Reference under s. 307 must be whole case, not part; partial reference incompetent."
    },
    {
      "case_name": "Ramjanam Tewari",
      "citation": "1935 I.L.R. Pat. 717",
      "treatment": "followed",
      "relevance": "Reaffirmed whole case must be referred under s. 307."
    },
    {
      "case_name": "The Emperor v. Bishnu Chandra Das",
      "citation": "1933 37 C.W.N. 1180",
      "treatment": "followed",
      "relevance": "Sessions Judge disabled from valid reference by accepting jury verdict on some charges."
    },
    {
      "case_name": "King Emperor v. Ananda Charan Ray",
      "citation": "1916 21 C.W.N. 435",
      "treatment": "referred",
      "relevance": "Sessions Judge should refer whole case; partial reference precludes full consideration; rejected reference and acquitted."
    },
    {
      "case_name": "Emperor v. Nawal Behari",
      "citation": "1930 I.L.R. All. 881",
      "treatment": "distinguished",
      "relevance": "Held must refer whole case; but proceeded to consider evidence despite partial reference (SC views erroneous)."
    },
    {
      "case_name": "Emperor v. Jagmohan",
      "citation": "I.L.R. 1947 All. 240",
      "treatment": "doubted",
      "relevance": "Partial reference irregular but High Court can consider whole case (SC holds erroneous)."
    },
    {
      "case_name": "Emperor v. Muktar",
      "citation": "1943 48 C.W.N. 547",
      "treatment": "distinguished",
      "relevance": "Defect in partial reference not fatal, High Court may entertain (SC holds unsustainable)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 307",
        "s. 306",
        "s. 310",
        "s. 282"
      ],
      "relevance": "Governs jury trials, disagreement with verdict, requirement to refer whole case to High Court; powers of High Court on reference."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 147",
        "s. 304/149",
        "s. 201"
      ],
      "relevance": "Charges framed against accused; jury verdicts and Judge's actions on these offences."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment of Calcutta High Court set aside; held reference under s. 307 CrPC incompetent; no order remitting case to Sessions Judge due to lapse of time since occurrence (1953), retirement of referring Judge, and avoidance of further complications.",
    "relief_granted": "Convictions and sentences by High Court quashed as reference incompetent.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the case to be submitted to the High Court is the whole case against the accused and not a part of it.",
      "speaker": "court",
      "significance": "Core holding on interpretation of s. 307 CrPC."
    },
    {
      "text": "Section 307(2) specifically prohibits the Judge... from recording any judgment of acquittal or of conviction on any of the charges on which the accused had been tried.",
      "speaker": "court",
      "significance": "Explains mandatory prohibition rendering partial reference illegal."
    },
    {
      "text": "a reference made in the circumstances of the present case, was incompetent and the High Court should have rejected it and not proceeded to record any judgment of acquittal or conviction.",
      "speaker": "court",
      "significance": "Directs proper procedure on incompetent reference."
    }
  ],
  "_case_id": "1957_64",
  "_label": 1,
  "_text_length": 21307,
  "_extracted_at": "2026-02-10T19:23:42.194295"
}