{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Bombay v. Provident Investment Co., Ltd., Bombay",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "K. DAS J."
    ],
    "case_number": "Civil Appeal No. 179 of 1954",
    "date_of_judgment": "1957-05-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee company is a private limited company, the shares of which were held by the then Maharaja Scindia of Gwalior and his nominees.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "At the material time, the assessee company was the managing agent of Madhowji Dharamsi Manufacturing Co., Ltd. (Dharamsi Company) and Sir Shapurji Broacha Mills Ltd. (Shapurji Broacha Company).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The assessee company held all the ordinary shares of the Dharamsi Company and a substantial majority of the ordinary shares of the Shapurji Broacha Company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Dalmia Investment Company Limited (Dalmia Company) wrote two letters to the assessee company on September 14, 1946, offering to purchase 28,328 ordinary shares of the Dharamsi Company at Rs. 500 per share together with the managing agency, and 75,212 ordinary shares of the Shapurji Broacha Company, together with the managing agency. The Dalmia Company made it clear that it would purchase both the mills or neither, with a time limit till September 23, 1946, 3 p.m., later extended to September 30, 1946.",
      "type": "material",
      "date": "1946-09-14",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On accepting the offer, the Dalmia Company would pay Rs. 20 lakhs for Dharamsi Company and Rs. 30 lakhs for Shapurji Broacha Company as earnest money. The assessee company was to arrange transfer of managing agency sanctioned by general body within 40 days, after which balance purchase price would be paid.",
      "type": "material",
      "date": "1946-09-14",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On September 26, 1946, the Board of Directors of the assessee company met, considered the offers, resolved to accept them, and stated that out of the total amount received from the sale of shares, Rs. 1 crore should be paid to the assessee company as compensation for the loss of the managing agency of the two mills.",
      "type": "material",
      "date": "1946-09-26",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On September 30, 1946, the assessee company wrote to the Dalmia Company accepting the offers subject to a condition not material. On the same date, Dalmia Company received acceptance and sent drafts for Rs. 20 lakhs and Rs. 30 lakhs.",
      "type": "material",
      "date": "1946-09-30",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On October 7, 1946, the Dalmia Company wrote to the assessee company modifying the arrangement: instead of transferring managing agency to Dalmia or nominees, assessee to resign managing agency so it ends at delivery of shares and payment. No need for general meeting sanction. New directors (Mr. Shriyans Prasad Jain, Mr. Jaidayal Dalmia, Mr. Shanti Prasad Jain, Mr. Vishnu Hari Dalmia) to be appointed, present directors resign. Qualification shares transferred, balance shares delivered against payment. Circular to shareholders about resignation and offer for deferred shares.",
      "type": "material",
      "date": "1946-10-07",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The assessee company accepted the modified arrangement. On October 19, 1946, it wrote to the Dharamsi Company and Shapurji Broacha Company resigning the office of managing agency.",
      "type": "material",
      "date": "1946-10-19",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Balance consideration money paid to assessee company. Value of managing agency computed at Rs. 1 crore, no dispute. Out of this, Income-tax Officer computed capital gains at Rs. 81,81,900.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellate Assistant Commissioner held assessee sold managing agency, profits capital gains under s. 12B.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Income-tax Appellate Tribunal held no sale but transfer of managing agency by handing back to managed companies, s. 12B applied. Referred question to High Court under s. 66(1).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Bombay High Court answered question in negative: neither sale nor transfer of managing agency under s. 12B.",
      "type": "procedural",
      "date": "1953-03-12",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "High Court granted certificate under s. 66A(2) for appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the assessee company made a capital gain amounting to Rs. 81,81,900 within the meaning of s. 12B of the Indian Income-tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There was a concluded contract of sale as a result of letters dated September 14, 1946, and September 30, 1946. The letter of October 7, 1946 merely changed the mode of performance, did not affect the true legal character of the transaction which was a sale of the managing agency.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "s. 12B of the Indian Income-tax Act"
    },
    {
      "id": "pa2",
      "text": "There was one indivisible consideration for the whole transaction including sale of shares and managing agency. Sale of shares took place, entire consideration paid, so capital gains under s. 12B.",
      "supporting_facts": [
        "f4",
        "f10"
      ],
      "legal_basis": "s. 12B of the Indian Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Letter of October 7, 1946 substituted a different contract for the original; true legal position is that assessee resigned/relinquished the managing agency, neither sale nor transfer.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "s. 12B of the Indian Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Letters of September 14 and 30, 1946 constituted agreement to sell shares and managing agency, not actual sale/transfer. Modified by October 7 letter to resignation/relinquishment instead of transfer/sale.",
      "addresses_issue": "i1",
      "key_observation": "Letter of October 7, 1946 substituted new contract of relinquishment rather than sale."
    },
    {
      "id": "cr2",
      "text": "Indivisible consideration argument not available; proceedings and agreed statement treated Rs. 1 crore as consideration for managing agency separately, dispute only on character (sale/transfer vs relinquishment).",
      "addresses_issue": "i1",
      "key_observation": "Cannot go behind agreed statement of case."
    },
    {
      "id": "cr3",
      "text": "Strict construction of fiscal statutes required; transaction must strictly fall within sale, exchange or transfer of capital asset after March 31, 1946. Managing agency was capital asset, but relinquishment not covered.",
      "addresses_issue": "i1",
      "key_observation": "No tax if not within four corners of statute."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Transaction was relinquishment of managing agency, neither sale, exchange nor transfer within s. 12B; no capital gains.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "A. V. Fernandez v. The State of Kerala",
      "citation": "1957 S.C.R. 837",
      "treatment": "referred",
      "relevance": "Strict letter of law in fiscal statutes; no tax by analogy or inference."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s. 12B",
        "s. 66(1)",
        "s. 66A(2)"
      ],
      "relevance": "Capital gains from sale, exchange or transfer of capital asset after March 31, 1946; reference and certificate provisions."
    },
    {
      "name": "Income-tax and Excess Profits Tax (Amendment) Act, 1947",
      "sections": [],
      "relevance": "Inserted s. 12B for first time."
    },
    {
      "name": "Indian Finance Act, 1949",
      "sections": [],
      "relevance": "Confined s. 12B to gains before April 1, 1948."
    },
    {
      "name": "Finance (No. 3) Act, 1956 (Act 77 of 1956)",
      "sections": [],
      "relevance": "Re-introduced s. 12B in wider terms after March 31, 1956; not applicable here."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, holding that the High Court correctly answered the question in the negative. The transaction resulted in relinquishment of the managing agency, not a sale, exchange or transfer under s. 12B, hence no capital gains taxable.",
    "relief_granted": "None; appeal dismissed in favour of assessee.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"If the Revenue satisfies the Court that the case falls strictly within the provisions of the law, the subject can be taxed. If, on the other hand, the case is not covered within the four corners of the provisions of the taxing statute, no tax can be imposed by inference or by analogy...\"",
      "speaker": "court",
      "significance": "Principle of strict construction in fiscal statutes, cited from Fernandez case."
    },
    {
      "text": "\"The transaction in its true legal character was a relinquishment of the managing agency and was neither a sale nor a transfer thereof.\"",
      "speaker": "court",
      "significance": "Core holding on nature of transaction."
    }
  ],
  "_case_id": "1957_139",
  "_label": 0,
  "_text_length": 18555,
  "_extracted_at": "2026-02-10T19:24:25.734220"
}