{
  "metadata": {
    "case_name": "M/s. Crown Aluminium Works, Belur represented by Jeewanlal (1929) Ltd. v. Workmen represented by Bengal Aluminium Workers Union",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 235 of 1956",
    "date_of_judgment": "1957-10-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In 1947, first Omnibus Engineering Tribunal constituted for engineering industry in West Bengal, including disputes on basic wages, dearness allowance and leave; award published June 30, 1948; appellant bound by it.",
      "type": "background",
      "date": "1948-06-30",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Industrial disputes arose again; second tribunal award published September 21, 1950, increasing dearness allowance due to rise in cost of living and modifying leave rules per Factories Act, 1948; appellant not party as no dispute raised.",
      "type": "background",
      "date": "1950-09-21",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant revised facility bonus from time to time to keep pace with cost of living; no grievance by workmen on dearness allowance.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Minor dispute referred to Shri G. Palit on November 24, 1950, including increment for 1950; appellant denied liability claiming handsome remuneration via special allowance, bonus, dearness allowance; Palit allowed 1 anna per day increment, directed arrears payment, cautioned for fixed wage structure.",
      "type": "procedural",
      "date": "1950-11-24",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Appellant issued notice March 28, 1952, proposing reduction of hours from 47 to 40, facility bonus by 3 as. per day, temporary dearness allowance by 10%; effective June 1, 1952, due to financial setback.",
      "type": "material",
      "date": "1952-03-28",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Further notice May 30, 1952: further facility bonus reduction by 6 as., withdraw two hours concession, discharge rolling mills workers.",
      "type": "material",
      "date": "1952-05-30",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Union agreed only to hours reduction to 42-1/2; joint discussions June 2 and 26, 1952 failed.",
      "type": "procedural",
      "date": "1952-06-02",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Company notice June 27, 1952: implemented March 28 reductions from June 1, withdraw two hours from July 1, discharge rolling mills from August 1.",
      "type": "material",
      "date": "1952-06-27",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Dispute to Labour Commissioner; conference July 4, 1952 failed.",
      "type": "procedural",
      "date": "1952-07-04",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant discharged 52 rolling mills workers July 15, 1952, retrenched 227 others from July 26, 1952, with notice pay.",
      "type": "material",
      "date": "1952-07-15",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Government referred 13 matters to Sixth Industrial Tribunal (Shri S.K. Niyogi) on July 31, 1952 under s.10 Industrial Disputes Act.",
      "type": "procedural",
      "date": "1952-07-31",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Sixth Tribunal award October 9, 1953: revised wage structure per 1948/1950 awards, held two hours concession, facility bonus, food concession as bounty withdrawable; allowed abolition post-revision.",
      "type": "procedural",
      "date": "1953-10-09",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Cross-appeals to Labour Appellate Tribunal; disposed July 11/29, 1955: modified wage structure, incorporated concessions into basic wages/dearness allowance for existing workmen; no reduction of existing emoluments.",
      "type": "procedural",
      "date": "1955-07-29",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appellant took over unit August 9, 1951; manufactures aluminium utensils from imported circles; rolling mills started during war for scrap, closed February 1952 due to losses as better circles available.",
      "type": "background",
      "date": "1951-08-09",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Financials 1947-Sept 1952: sales fall, manufacturing cost > sale price in 1952; original tribunal no improvement prospect, Appellate saw improvement post-retrenchment.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Two hours concession introduced August 1946 to compensate post-Factories Act hour reduction; facility bonus April 1945 revised upward to 6-12 as./day; food concession pre-1951.",
      "type": "background",
      "date": "1946-08-00",
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Appellant's Labour Officer Shah: facility bonus for high cost of living like DA; two hours as special bonus on demand when possible.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "Appellant's pleading: pre-June 1952 wage structure had basic wage, DA, special bonus, facility bonus, food concession.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there is a convention in industrial adjudication not to reduce existing emoluments/wage structure to prejudice of workmen, and if wage structure can be revised downward if employer's finances deteriorate.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "True character of two hours concession, facility bonus, food concession: bounty or integral part of wage structure.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Labour Appellate Tribunal erred in assuming convention against reducing emoluments to workmen's prejudice; wage structure revisable downward like upward for financial deterioration/other factors.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Concessional payments (two hours, facility bonus, food) are bounty, withdrawable; Shri Palit held so.",
      "supporting_facts": [
        "f12",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Financial losses justify reductions; post-retrenchment improvement insufficient.",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Concessional payments enjoyed long as of right, part of basic wages/DA, terms of service; convention against reduction.",
      "supporting_facts": [
        "f16",
        "f17",
        "f18"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Industrial adjudication aims social/economic justice, harmony; considers comparable wages, productivity, cost of living, ability to pay; categories: living/fair/minimum wage.",
      "addresses_issue": "i1",
      "key_observation": "No industry right to exist below bare minimum wage."
    },
    {
      "id": "cr2",
      "text": "Wage structure revisable to prejudice workmen if above minimum and merits shown (e.g., finances, duration of hardship, retrenchment adequacy); no rigid convention, but balance discontent vs. industry survival.",
      "addresses_issue": "i1",
      "key_observation": "Answer in abstract favors employer, subject to considerations."
    },
    {
      "id": "cr3",
      "text": "Appellate Tribunal considered finances, retrenchment improvement, cost of living data insufficiency; wages at minimum/fair level; decision not vitiated.",
      "addresses_issue": "i1",
      "key_observation": "Not solely on convention."
    },
    {
      "id": "cr4",
      "text": "Payments not bounty: introduced to compensate, revised with cost of living, pleaded as wage structure components, no dispute raised due to them; part of basic/DA.",
      "addresses_issue": "i2",
      "key_observation": "Genesis, evidence, conduct support integration."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Wage structure can be revised downward to prejudice workmen if above bare minimum wage and case made on merits, considering finances, retrenchment, etc.; no inexorable convention against.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Appellate Tribunal's wage structure modification and incorporation of concessions valid, based on evidence/facts.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Two hours concession, facility bonus, food concession form part of basic wages/dearness allowance.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "Section 10"
      ],
      "relevance": "Reference of disputes for adjudication"
    },
    {
      "name": "Factories Act, 1948",
      "sections": [],
      "relevance": "Modified leave rules; reduced working hours leading to concessions"
    },
    {
      "name": "Minimum Wages Act",
      "sections": [],
      "relevance": "Labour welfare legislation enabling wage fixation"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Both contentions of appellant fail; Appellate Tribunal's wage structure upheld, including integration of concessional payments for existing workmen; no interference warranted.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"No industry has a right to exist unless it is able to pay its workmen at least a bare minimum wage.\"",
      "speaker": "court",
      "significance": "Core principle limiting downward revision"
    },
    {
      "text": "\"Can the wage structure fixed in a given industry be never revised to the prejudice of its workmen? Considered as a general question in the abstract it must be answered in favour of Mr. Sen.\"",
      "speaker": "court",
      "significance": "Rejects absolute convention against reduction"
    },
    {
      "text": "\"It would not be right to hold that there is a rigid and inexorable convention that the wage structure once fixed by industrial tribunals can never be changed to the prejudice of workmen.\"",
      "speaker": "court",
      "significance": "Key holding on flexibility of wage structures"
    }
  ],
  "_case_id": "1957_114",
  "_label": 0,
  "_text_length": 30509,
  "_extracted_at": "2026-02-10T19:23:40.585449"
}