{
  "metadata": {
    "case_name": "Sohan Lal v. Jagan Nath",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Imam, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Government of India devised schemes for rehabilitation of refugees, including sale of box-type tenements in West Patel Nagar to displaced persons registered before August 15, 1948, gainfully employed, and who had been allotted agricultural land in East Punjab.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Procedure: Eligible applicants submit form, deposit sale price after prima facie eligibility, produce proof later; list prepared, excess refunded; final list pays ground rent; allotment by drawing lots.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Jagan Nath registered as refugee on December 31, 1947.",
      "type": "admitted",
      "date": "1947-12-31",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Jagan Nath applied in prescribed form, deposited Rs. 5,600 sale price after prima facie eligibility, deposited ground rent, informed of allotment of two-roomed enclosed verandah box-type house.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Allotment by drawing lots on February 15, 1952 at 3 p.m., house No. 35 West Patel Nagar allotted to Jagan Nath.",
      "type": "material",
      "date": "1952-02-15",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "On May 10, 1952, Accommodation Officer removed Jagan Nath's family and belongings to house No. 35 in his absence, entering possession.",
      "type": "material",
      "date": "1952-05-10",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Jagan Nath evicted on September 27, 1952 by warrant dated September 11, 1952 under s. 25 of Ordinance III of 1952.",
      "type": "material",
      "date": "1952-09-27",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Possession given to Sohan Lal on October 3, 1952.",
      "type": "material",
      "date": "1952-10-03",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Sohan Lal, displaced person, applied February 27, 1952, deposited Rs. 5,600, complied with conditions, allotted house No. 35 on July 31, 1952.",
      "type": "material",
      "date": "1952-02-27",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Sohan Lal in possession since October 3, 1952.",
      "type": "admitted",
      "date": "1952-10-03",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Jagan Nath ineligible as allotted agricultural land in Hissar district prior to application.",
      "type": "disputed",
      "date": null,
      "source": "union_of_india"
    },
    {
      "id": "f12",
      "text": "No letter of allotment issued to Jagan Nath; informed property could not be allotted due to ineligibility.",
      "type": "material",
      "date": null,
      "source": "union_of_india"
    },
    {
      "id": "f13",
      "text": "Jagan Nath filed petition under Art. 226 in Punjab High Court, allowed, ordering Union of India and Sohan Lal to restore possession of house No. 35.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Sohan Lal obtained special leave to appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether writ under Art. 226 appropriate where serious factual disputes on title exist, requiring declaration of title and restoration of possession.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether mandamus can issue against private individual (Sohan Lal) in possession without evidence of collusion with Union of India.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Jagan Nath acquired title or rights in property despite no letter of allotment and subsequent discovery of ineligibility.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Legality of Jagan Nath's eviction without compliance with s. 3 Public Premises Eviction Act, 1950.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Serious dispute on facts and whether Jagan Nath acquired title; writ proceedings inappropriate as decision would declare title and order restoration; proper remedy is civil suit.",
      "supporting_facts": [
        "f10",
        "f11",
        "f12"
      ],
      "legal_basis": "Art. 226 of Constitution"
    },
    {
      "id": "pa2",
      "text": "Mandamus cannot issue against private individual; Sohan Lal in lawful possession, no evidence or finding of collusion with Union of India.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Entered possession not as trespasser but inducted by Accommodation Officer; evicted illegally without notice under s. 3 Public Premises Eviction Act, 1950; Union of India and Sohan Lal ordered to restore possession.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "s. 3 Public Premises Eviction Act, 1950 (Act No. XXVII of 1950)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Will not enquire into merits of rival title claims; questions of fact and law disputed, appropriate for civil court suit, not Art. 226 writ proceedings which cannot declare title and decree possession.",
      "addresses_issue": "i1",
      "key_observation": "Writ court should not enter field of title investigation."
    },
    {
      "id": "cr2",
      "text": "Eviction contravened s. 3 Public Premises Eviction Act, illegal; mandamus could issue against Union of India if property still in its possession, but property with appellant.",
      "addresses_issue": "i4",
      "key_observation": "Illegal eviction but remedy limited."
    },
    {
      "id": "cr3",
      "text": "No evidence or finding of collusion between Union of India and appellant; mandamus does not issue against private individual without public duty or collusion; appellant entered bona fide.",
      "addresses_issue": "i2",
      "key_observation": "Mandamus against person for public duty; analogy to election cases where quo warranto needed."
    },
    {
      "id": "cr4",
      "text": "Questions like rights acquired by Jagan Nath, whether possession under allotment or misapprehension, appellant's legal right, to be decided in civil suit.",
      "addresses_issue": "i3",
      "key_observation": "All disputed issues require civil court adjudication."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court erred in allowing Art. 226 petition and ordering restoration against Union of India and private individual without resolving title disputes or finding collusion.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Mandamus does not lie against bona fide possessor without collusion or knowledge of illegal eviction.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Khushal Singh v. Shri Rameshwar Dayal, Deputy Commissioner, Delhi",
      "citation": "I.L.R. 1954 Punjab 211",
      "treatment": "referred",
      "relevance": "Support for restoration after illegal eviction."
    },
    {
      "case_name": "G. Kistareddy v. Commr. of City Police, Hyderabad",
      "citation": "A.I.R. 1952 Hyderabad 36",
      "treatment": "referred",
      "relevance": "Support for restoration after illegal eviction."
    },
    {
      "case_name": "Mohinder Singh v. State of Pepsu",
      "citation": "A.I.R. 1955 Pepsu 60",
      "treatment": "referred",
      "relevance": "Support for restoration after illegal eviction."
    },
    {
      "case_name": "Wazir Chand v. The State of Himachal Pradesh",
      "citation": null,
      "treatment": "referred",
      "relevance": "Observations supporting restoration after illegal eviction."
    },
    {
      "case_name": "R. v. Chester Corporation",
      "citation": "1855 25 L.J.Q.B. 61; Regina v. Chester, Mayor, etc.",
      "treatment": "followed",
      "relevance": "Mandamus not granted if office/property in bona fide possession; quo warranto or other proceedings needed."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Writ petition filed; court held inappropriate for title disputes."
    },
    {
      "name": "Public Premises Eviction Act, 1950",
      "sections": [
        "s. 3"
      ],
      "relevance": "Required notice before eviction; non-compliance made eviction illegal."
    },
    {
      "name": "Ordinance III of 1952",
      "sections": [
        "s. 25"
      ],
      "relevance": "Purported basis for eviction warrant."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, High Court order set aside; Jagan Nath's Art. 226 petition not maintainable due to title disputes requiring civil suit; no mandamus against appellant.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We do number propose to enquire into the merits of the rival claims of title to the property in dispute set up by the appellant and Jagan Nath.",
      "speaker": "court",
      "significance": "Declines to resolve factual title disputes in writ proceedings."
    },
    {
      "text": "Normally, a writ of mandamus does number issue to or an order in the nature of mandamus is number made against a private individual.",
      "speaker": "court",
      "significance": "Limits scope of mandamus to public duties, not private possessors."
    },
    {
      "text": "The eviction of Jagan Nath was in companytravention of the express provisions of s. 3 of the Public Premises Eviction Act. His eviction, therefore, was illegal.",
      "speaker": "court",
      "significance": "Acknowledges illegality of eviction but denies writ remedy."
    }
  ],
  "_case_id": "1957_154",
  "_label": 1,
  "_text_length": 12833,
  "_extracted_at": "2026-02-10T19:24:23.816754"
}