{
  "metadata": {
    "case_name": "Jaswant Singh v. State",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur J."
    ],
    "case_number": "Criminal Appeal No. 66 of 1954",
    "date_of_judgment": "1957-10-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Jaswant Singh employed as Patwari, Fatehpur Rajputan.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant prosecuted for receiving illegal gratification; charge: habitually accepted or obtained illegal gratification, specifically received Rs. 50 on 19-3-1953 at Subzi Mandi Amritsar from Pal Singh as reward for forwarding application Es. A. with recommendation for helping Santa Singh (father of Pal Singh) in allotment of Ahata No. 10 at village Fatehpur Rajputan.",
      "type": "material",
      "date": "1953-03-19",
      "source": "charge"
    },
    {
      "id": "f3",
      "text": "Special Judge found appellant accepted illegal gratification from Pal Singh, Hazara Singh, Harnam Singh, Joginder Singh, Atma Singh, Hari Singh and Ganda Singh; specifically Rs. 50 from Pal Singh on 19-3-1953.",
      "type": "disputed",
      "date": "1953-03-19",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Special Judge held charge under section 5(1)(a) established beyond reasonable doubt; guilty under sub-section (2) of section 5.",
      "type": "procedural",
      "date": "1953-09-14",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Appeal to Punjab High Court; judgment dated 31-12-1953 by Dulat J.: sanction valid qua Rs. 50 from Pal Singh; conviction upheld but sentence reduced to period undergone, fine maintained.",
      "type": "procedural",
      "date": "1953-12-31",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Sanction by N.N. Kashyap, I.C.S., Deputy Commissioner, Amritsar: satisfied Jaswant Singh accepted Rs. 50 in 5 currency notes of Rs. 10 from Pal Singh son of Santa Singh for making favorable report on application for allotment of ahata to Santa Singh; evidence discloses offence under Section 5; sanctions prosecution under section 5.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Validity and effect of the sanction given under s.6(1) of the Prevention of Corruption Act, 1947; whether trial without jurisdiction and conviction void where sanction confined to single illegal gratification of Rs. 50 from Pal Singh but charge was for habitually accepting illegal gratification under s.5(1)(a).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether evidence of habitual receipt caused prejudice to defence.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sanction confined to illegal gratification of Rs. 50 from Pal Singh (offence under s.5(1)(d)); charge for habitually accepting (s.5(1)(a)); trial without jurisdiction and conviction void even for offence in sanction.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "Section 6(1) Prevention of Corruption Act; Basudeo Agarwala v. King Emperor"
    },
    {
      "id": "pa2",
      "text": "Evidence in support of habitual receiving caused serious prejudice to defence.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sanction valid qua charge of accepting Rs. 50 from Pal Singh; appellant could not be convicted of habitual offence but conviction for single act upheld.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Section 6(1) Prevention of Corruption Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sanction under Act not automatic formality; must observe strictness; authority must consider evidence; facts should be referred in sanction to show application of mind.",
      "addresses_issue": "i1",
      "key_observation": "Sanction valid for single act of Rs. 50 from Pal Singh (s.5(1)(d)); lack of sanction for habitual (s.5(1)(a)) does not void trial for sanctioned offence."
    },
    {
      "id": "cr2",
      "text": "Trial for two offences requiring sanction not wholly void if sanction for one; bar under s.6(1) only for unsanctioned offence; proceedings for sanctioned offence valid.",
      "addresses_issue": "i1",
      "key_observation": "Cites Hori Ram Singh v. Crown, Basir-ul-Huq v. State of West Bengal."
    },
    {
      "id": "cr3",
      "text": "No prejudice shown from evidence of habitual receipt; High Court proceeded on Pal Singh evidence; no failure of justice.",
      "addresses_issue": "i2",
      "key_observation": "Conviction for Rs. 50 well founded."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sanction valid only for offence of receiving Rs. 50 illegal gratification from Pal Singh under s.5(1)(d); prosecution/trial for habitual under s.5(1)(a) void for want of sanction.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Lack of sanction for one offence does not vitiate trial for distinct offence covered by valid sanction.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No prejudice to defence; conviction for single bribe upheld.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Basudeo Agarwala v. King Emperor",
      "citation": "1945 F.C.R. 93, 98",
      "treatment": "followed",
      "relevance": "Sanction provisions observed with complete strictness."
    },
    {
      "case_name": "Gokulchand Dwarkadas Morarka v. The King",
      "citation": "1948 L.R. 75 I.A. 30, 37",
      "treatment": "followed",
      "relevance": "Sanction must be in respect of facts constituting offence charged; facts referred on face desirable."
    },
    {
      "case_name": "Yusofalli Mulla Noorbhoy v. The King",
      "citation": null,
      "treatment": "followed",
      "relevance": "Valid sanction essential for jurisdiction; without it prosecution nullity."
    },
    {
      "case_name": "Hori Ram Singh v. The Crown",
      "citation": "1939 F.C.R. 159",
      "treatment": "followed",
      "relevance": "Want of sanction for one offence not bar to trial for other not requiring sanction."
    },
    {
      "case_name": "Basir-ul-Huq v. The State of West Bengal",
      "citation": "1953 S.C.R. 836",
      "treatment": "followed",
      "relevance": "S.195 CrPC not bar to distinct offence not requiring sanction."
    }
  ],
  "statutes_cited": [
    {
      "name": "Prevention of Corruption Act, 1947",
      "sections": [
        "Section 5(1)(a)",
        "Section 5(1)(d)",
        "Section 5(2)",
        "Section 6(1)"
      ],
      "relevance": "Defines criminal misconduct; requires previous sanction for cognizance of offences."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 161",
        "Section 165",
        "Section 409",
        "Section 477A"
      ],
      "relevance": "Offences requiring sanction under s.6(1) of Act; examples in precedents."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "Section 195"
      ],
      "relevance": "Not bar to trial for distinct offence not requiring sanction."
    },
    {
      "name": "Government of India Act",
      "sections": [
        "Section 270(1)"
      ],
      "relevance": "Sanction requirement in precedent."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding Punjab High Court's decision: conviction and sentence for receiving Rs. 50 illegal gratification from Pal Singh under s.5(1)(d) affirmed; set aside conviction for habitual offence under s.5(1)(a) for want of sanction.",
    "relief_granted": "Sentence reduced by High Court to period undergone, fine maintained; upheld by Supreme Court.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The sanction under the Act is not intended to be nor is an automatic formality and it is essential that the provisions in regard to sanction should be observed with complete strictness.",
      "speaker": "court",
      "significance": "Emphasizes strict compliance for sanction validity."
    },
    {
      "text": "In their Lordships view, to comply with the provisions of cl. 23 it must be proved that the sanction was given in respect of the facts constituting the offence charged.",
      "speaker": "court",
      "significance": "From Gokulchand; requirement for sanction to cover charged facts."
    },
    {
      "text": "The want of sanction for the offence of habitually accepting bribes therefore does not make the taking of cognizance of the offence of taking a bribe of Rs. 50 from Pal Singh void nor the trial for that offence illegal.",
      "speaker": "court",
      "significance": "Core holding on partial validity of trial."
    }
  ],
  "_case_id": "1957_29",
  "_label": 0,
  "_text_length": 11301,
  "_extracted_at": "2026-02-08T22:35:48.918239"
}