{
  "metadata": {
    "case_name": "Trustees of J.K. Trust, Bombay v. Commissioner of Income-tax",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "V. Venkatarama Aiyar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On June 15, 1945, three brothers Sir Padampat Singhania, Lala Kailashpat Singhania and Lala Lakshmipat Singhania who were carrying on business under the name of Juggilal Kamlapat, executed a deed of trust, Ex. A, whereby they settled a sum of Rs. 1,00,000 on various charities specified therein and called the J.K. Trust, Bombay, and appointed themselves and two other persons Lala Ramdeo Podar and Sir Chunnilal Mehta as its trustees.",
      "type": "background",
      "date": "1945-06-15",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The trust deed provided inter alia that the trustees may with the help of the trust fund, for and on behalf of and for the benefit of the trust, carry on such business including the taking up and conducting the managing agency or selling agency of any company in such name or names as they in their absolute discretion may think fit and proper and may close and re-start such business and utilise the profits for all or any of the objects aforesaid. Large powers were conferred on them in the conduct of the business, and they were also authorised to raise or borrow money required for the purpose of the trust.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "At this time, Messrs. E. D. Sassoon and Co., Ltd. were the managing agents of a public Company called the Raymond Woollen Mills Ltd. The firm of Juggilal Kamlapat of which the three Singhania brothers were the partners, acquired controlling interest in the said Mills by purchase of the shares of Messrs. E. D. Sassoon and Co. therein.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Following on this, the share-holders passed a special resolution on September 3, 1945, appointing the trustees of the J.K. Trust as managing agents of the Company in the place of Messrs. E. D. Sassoon and Co., Ltd., who resigned.",
      "type": "material",
      "date": "1945-09-03",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On September 10, 1945, a memorandum of agreement, Ex. B, was duly executed by the Company constituting the trustees of the J.K. Trust, Bombay, as its managing agents on the terms and conditions set out therein. It is to be noted that the five persons named as trustees under Ex. A were appointed as managing agents in their character as trustees, and it is expressly provided therein that the expression managing agents, unless excluded by or repugnant to the context shall include the Trustees for the time being of the said Trust or any other Trust with which the same may be amalgamated.",
      "type": "material",
      "date": "1945-09-10",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The agency was to be for a period of 20 years but it was open to the trustees to throw it up on giving three months notice. The managing agents were to get a remuneration of 10 per cent. of the net annual profits subject to a minimum of Rs. 50,000 and an office allowance of Rs. 1,000 per mensem.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Clause 7 of the agreement provided that, During the continuance of this agreement, the Managing Agents shall maintain with the Company a deposit of Rs. 1,00,000 (Rupees one lac only) in cash by way of security for due fulfilment of their obligations as specified therein and shall be entitled to charge interest at 3 1/2 per cent. per annum on the amount of such deposit in addition to their remuneration.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Clause 8 laid an obligation on the managing agents to arrange loans and advances to the Company as and when required up to and not exceeding Rs. 10 lacs at any time and if necessary to guarantee such loans or advances from time to time.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Under clause 14, Notwithstanding anything herein contained, all the terms and conditions of this Agreement including the period of appointment of the Managing Agents may be varied or abrogated by mutual agreement.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The trustees entered on their duties as managing agents under this agreement, and by an agreement dated May 14, 1946, they appointed one Tej Narain Khaitan, son-in-law of one of the three Singhania brothers as their representative to carry on the managing agency work on a remuneration of 30 per cent. of the annual income which would be payable to them under Ex. B.",
      "type": "material",
      "date": "1946-05-14",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The dispute between the parties relates to the assessment of income-tax for the assessment years 1946-47, 1947-48 and 1948-49 and of excess profits tax for the chargeable accounting periods, September 3, 1945, to March 31, 1946, April 1, 1946, to March 31, 1947 and April 1, 1947, to March 31, 1948.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Before the Income-tax authorities, the appellant claimed that the income derived from the managing agency was income derived from property held under trust to be applied wholly for charitable purposes, and was, in consequence, exempt from taxation under s. 4(3)(i) of the Act.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "The Income-tax authorities held that the income in question was remuneration for services rendered, and was not derived from any property, and that, therefore, it did not fall within s. 4(3)(i) of the Act. They further held that even if the managing agency business could be regarded as property within s. 4(3)(i), it was governed by the special provision contained in s. 4(3)(ia), and as the conditions laid down therein had not been satisfied, no exemption could be claimed.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "In this view, they allowed a sum of Rs. 30,000 per annum for remuneration of Mr. Khaitan as a deduction under s. 10(2)(x) of the Act, and held that the balance of the income, Rs. 23,287 in 1946-47, Rs. 36,786 in 1947-48 and Rs. 2,16,460 in 1948-49 was liable to be taxed under the provisions of the taxing statutes.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "On applications made by the assessee under s. 66(1) of the Act and the corresponding provisions in the Excess Profits Tax Act and the Business Profits Tax Act, the Tribunal referred the following questions for the decision of the High Court of Bombay.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "The reference was heard by Chagla, C.J., and Tendolkar, J., who held that no part of the sum of Rs. 1,00,000 which was the only property settled on trust under Ex. A was actually invested in the managing agency business, which could not, therefore, be regarded as trust property, and that the income received from that business was not within the exemption enacted in s. 4(3)(i). They accordingly answered the first question against the appellant.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "As regards the second question, the learned Judges held that it was unnecessary to express any opinion thereon, as it was common ground that even if s. 4(3)(ia) applied, neither of the conditions laid down in sub-clause (a) or (b) had been fulfilled, and that accordingly no relief could be granted thereunder.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "This is an appeal by special leave against the judgment of the Bombay High Court passed in a reference under s. 66(1) of the Indian Income-tax Act, 1922 hereinafter referred to as the Act and ss. 21 and 19 of the Excess Profits Tax Act, 1940, and of the Business Profits Tax Act, 1947, respectively read with s. 66(1) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the income received by the trustees of J.K. Trust, Bombay, as managing agents of Raymond Woollen Mills, Ltd., is income derived from property held on trust or on an obligation in the nature of trust",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the claim for exemption in respect of such income is to be determined under s. 4(3)(i) or s. 4(3)(ia) of the Income-tax Act, 1922",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Managing agency is business and therefore it is property, and that it is property held on trust because it is conducted by the trustees on behalf of the trust with the help of trust properties and in accordance with the directions contained in the trust deed.",
      "supporting_facts": [
        "f2",
        "f5",
        "f7"
      ],
      "legal_basis": "s. 4(3)(i) Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "Even if the business is not held on trust, it is at least held, on the principle laid down in s. 88 of the Trusts Act, on an obligation in the nature of trust, and that s. 4(3)(ii) is, in consequence, attracted.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "s. 88 Indian Trusts Act; s. 4(3)(ii) Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Managing agency is to be regarded as business, but there can be no trust of such agency, because it really involves rendering of services and cannot be said to be property in respect of which alone trust can be created, and further because managing agency is an office, and that again is not property.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "ss. 2(9A), 87A and 87B Indian Companies Act"
    },
    {
      "id": "ra2",
      "text": "In any event, the managing agency created under Ex. B could not be held to be trust property, because it could be terminated at any time, if the trustees so desired, on three months notice and that there could be no trust of such a precarious, ephemeral or evanescent kind of property, if indeed it could be held to be property.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "s. 88 was inapplicable, as there was no property which was held on an obligation in the nature of a trust.",
      "supporting_facts": [],
      "legal_basis": "s. 88 Indian Trusts Act"
    },
    {
      "id": "ra4",
      "text": "Even if the managing agency business could be regarded as property within s. 4(3)(i), it was governed by the special provision contained in s. 4(3)(ia), and as the conditions laid down therein had not been satisfied, no exemption could be claimed.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "s. 4(3)(ia) Income-tax Act, 1922"
    },
    {
      "id": "ra5",
      "text": "No part of the sum of Rs. 1,00,000 which was the only property settled on trust under Ex. A was actually invested in the managing agency business, which could not, therefore, be regarded as trust property.",
      "supporting_facts": [
        "f1",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Managing agency is business, as settled in Lakshminarayan Ram Gopal and Son Ltd. v. The Government of Hyderabad. Property is a term of the widest import... Business would undoubtedly be property, unless there is something to the contrary in the enactment.",
      "addresses_issue": "i1",
      "key_observation": "There is nothing in s. 4(3)(i) which restricts... the normal and accepted meaning of the word property, and excludes business from its connotation."
    },
    {
      "id": "cr2",
      "text": "Cites In re The Tribune and All India Spinners Association v. Commissioner of Income-tax, Bombay as authority that business is property within s. 4(3)(i). Distinguished Eggar v. Commissioner of Income-tax.",
      "addresses_issue": "i1",
      "key_observation": "The weight of authority is therefore clearly in favour of the view that business would be property for purposes of s. 4(3)(i) of the Act."
    },
    {
      "id": "cr3",
      "text": "Even if business could in general be held to be property within s. 4(3)(i), managing agency cannot be so regarded? Rejected, citing Angurbala Mullick v. Debabrata Mullick and Shirur Mutt cases; office of managing agency is property.",
      "addresses_issue": "i1",
      "key_observation": "Nor is it an accurate statement... to describe trust of the managing agency as a trust of an obligation. It is in truth a trust of property, which carries with it certain obligations."
    },
    {
      "id": "cr4",
      "text": "Fact that trustees have option to terminate on 3 months notice is no legal impediment; public charity perpetual but properties subject to incidents like lease termination.",
      "addresses_issue": "i1",
      "key_observation": "This is to confuse charity with properties devoted to charity."
    },
    {
      "id": "cr5",
      "text": "Rs. 1,00,000 deposit under Ex. B impresses managing agency with trust character; clause 3 of Ex. A contemplates acquisition of managing agency business with trust fund; Exs. A and B part of integral scheme.",
      "addresses_issue": "i1",
      "key_observation": "When trustees carry on business with the aid of trust fund, the position in law is the same as if they actually employed it in the business."
    },
    {
      "id": "cr6",
      "text": "Word 'property' in s. 4(3)(i) includes business; managing agency under Ex. B is property held on trust within s. 4(3)(i). But s. 4(3)(ia) is special provision for business; whether it restricts s. 4(3)(i) needs consideration.",
      "addresses_issue": "i2",
      "key_observation": "Even if under the general law, the word property is wide enough... in its context in s. 4(3)(i) read along with s. 4(3)(ia) it bears a more restricted sense as meaning only property other than business."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The word property in s. 4(3)(i) of the Act is of sufficient amplitude to comprehend business, and... the managing agency constituted under Ex. B must be treated as property held on trust within s. 4(3)(i) of the Act.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Whether claim for exemption governed by s. 4(3)(i) or s. 4(3)(ia) remitted to High Court.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Lakshminarayan Ram Gopal and Son Ltd. v. The Government of Hyderabad",
      "citation": null,
      "treatment": "followed",
      "relevance": "Managing agency is business."
    },
    {
      "case_name": "In re The Tribune",
      "citation": "1935 3 I.T.R. 246",
      "treatment": "referred",
      "relevance": "Property in s. 4(3)(i) includes business; contention repelled."
    },
    {
      "case_name": "In re The Trustees of the Tribune",
      "citation": "1939 7 I.T.R. 415 L.R. 66 I.A. 241",
      "treatment": "referred",
      "relevance": "Object charitable; no issue on business as property."
    },
    {
      "case_name": "All India Spinners Association v. Commissioner of Income-tax, Bombay",
      "citation": "1944 12 I.T.R. 482 L.R. 71 I.A. 159",
      "treatment": "followed",
      "relevance": "Direct authority that business (organisation, undertaking, stock) is property under s. 4(3)(i)."
    },
    {
      "case_name": "Eggar v. Commissioner of Income-tax",
      "citation": "1926 2 I.T.C. 286",
      "treatment": "distinguished",
      "relevance": "No dedication to trust; remuneration for services private income."
    },
    {
      "case_name": "Angurbala Mullick v. Debabrata Mullick",
      "citation": "1951 S.C.R. 1125",
      "treatment": "followed",
      "relevance": "Office of trusteeship is property."
    },
    {
      "case_name": "The Commissioner, Hindu Religious Endowments, Madras v. Sri Lakshmindra Thirtha Swamiar of Sri Shirur Mutt",
      "citation": "1954 S.C.R. 1005, 1019",
      "treatment": "followed",
      "relevance": "Office with emoluments is property."
    },
    {
      "case_name": "Commissioner of Income-tax, Madras v. Arunachalam Chettiar",
      "citation": "I.L.R. 1926 49 Mad. 833",
      "treatment": "referred",
      "relevance": "Profits from business for trust not exempt under original s. 4(3)(i)."
    },
    {
      "case_name": "Coman v. Governors of the Rotunda Hospital, Dublin",
      "citation": "1921 A.C. 1",
      "treatment": "followed",
      "relevance": "Profits from business for trust not exempt."
    },
    {
      "case_name": "Lachhman Das Narain Das, In re",
      "citation": "I.L.R. 1925 47 All. 68",
      "treatment": "referred",
      "relevance": "Profits from business for trust not exempt."
    },
    {
      "case_name": "Charitable Gadodia Swadeshi Stores v. Commissioner of Income-tax, Punjab",
      "citation": null,
      "treatment": "referred",
      "relevance": "s. 4(3)(ia) failure does not bar s. 4(3)(i) if business is property."
    },
    {
      "case_name": "Rocke v. Hart",
      "citation": "1805 11 Ves. Jun. 58 32 E.R. 1009, 1010",
      "treatment": "referred",
      "relevance": "Trust fund aiding business treated as employed in business."
    },
    {
      "case_name": "Moons v. De Bernales",
      "citation": "1826 1 Russ. 301 38 E.R. 117",
      "treatment": "referred",
      "relevance": "Similar to Rocke v. Hart."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 4(3)(i)",
        "s. 4(3)(ia)",
        "s. 4(3)(ii)",
        "s. 10(2)(x)",
        "s. 66(1)"
      ],
      "relevance": "Exemption for income from property held under trust for charitable purposes; special rule for business; reference to HC."
    },
    {
      "name": "Excess Profits Tax Act, 1940",
      "sections": [
        "s. 21",
        "s. 19"
      ],
      "relevance": "Read with s. 66(1) of Income-tax Act for reference."
    },
    {
      "name": "Business Profits Tax Act, 1947",
      "sections": [
        "s. 19"
      ],
      "relevance": "Read with s. 66(1) of Income-tax Act for reference."
    },
    {
      "name": "Indian Trusts Act, 1882",
      "sections": [
        "s. 88",
        "s. 77(c)"
      ],
      "relevance": "Obligation in nature of trust; extinction of trust if no property left."
    },
    {
      "name": "Indian Companies Act",
      "sections": [
        "s. 2(9A)",
        "s. 87A",
        "s. 87B"
      ],
      "relevance": "Nature of managing agency as office."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Supreme Court held that managing agency is property held under trust within s. 4(3)(i) and answered first question in favour of appellant. Remanded second question on whether exemption under s. 4(3)(i) or s. 4(3)(ia) to Bombay High Court for fresh disposal.",
    "relief_granted": "Remand to High Court for consideration of second question",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Property is a term of the widest import, and subject to any limitation or qualification which the context might require, it signifies every possible interest which a person can acquire, hold and enjoy.\"",
      "speaker": "court",
      "significance": "Defines scope of 'property' under s. 4(3)(i) to include business."
    },
    {
      "text": "\"The weight of authority is therefore clearly in favour of the view that business would be property for purposes of s. 4(3)(i) of the Act.\"",
      "speaker": "court",
      "significance": "Concludes business qualifies as property for exemption."
    },
    {
      "text": "\"This is to confuse charity with properties devoted to charity.\"",
      "speaker": "court",
      "significance": "Rejects argument that terminable agency cannot be trust property."
    },
    {
      "text": "\"In the result, we remand the case to the High Court of Bombay for a fresh disposal of the reference on a consideration of the second question.\"",
      "speaker": "court",
      "significance": "Final order remanding case."
    }
  ],
  "_case_id": "1957_50",
  "_label": 1,
  "_text_length": 25882,
  "_extracted_at": "2026-02-10T19:22:55.587557"
}