{
  "metadata": {
    "case_name": "Petitions Nos. 63 and 64 of 1957 under Article 71 of the Constitution (In re Election of President)",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "DAS C.J."
    ],
    "case_number": "Petitions Nos. 63 and 64 of 1957",
    "date_of_judgment": "1957-05-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "After the general elections in all the States and Union territories of India, except in the Union territory of Himachal Pradesh, which is to return four members to the Lok Sabha and in two constituencies in the State of Punjab, the old Lok Sabha was dissolved on April 4, 1957 and the New Lok Sabha was constituted on April 5, 1957, under s. 73 of the Representation of the People Act, XLIII of 1951.",
      "type": "background",
      "date": "1957-04-04",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "As required by s. 4 of the Presidential and Vice-Presidential Election Act, 1952 (XXXI of 1952), the Election Commission issued a notification in the official Gazette appointing April 16, 1957, as the last date for making nominations, April 17, 1957, as the date for the scrutiny of the nominations, April 20, 1957, as the last date for the withdrawal of candidatures, May 6, 1957, as the polling date and May 10, 1957, as the date for the counting of the votes and the declaration of the result.",
      "type": "procedural",
      "date": null,
      "source": "Election Commission"
    },
    {
      "id": "f3",
      "text": "The term of office of the present President is due to expire on the mid-night of May 12, 1957.",
      "type": "background",
      "date": "1957-05-12",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After the notification constituting the new Lok Sabha was published in the Press on April 7, 1957, the petitioner in the first petition applied to the Election Commission for the supply of the nomination papers, which he eventually received at Nagpur in the afternoon of April 10, 1957. This left a period of five days for the filing of the nomination paper before the Returning Officer at New Delhi.",
      "type": "procedural",
      "date": "1957-04-10",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "The petitioner in the first petition submits that the time was too short and he was prevented from filing his nomination paper due to want of time. He has filed the petition as a citizen of India and as an intending candidate for the Presidential election.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The petitioner in the second petition is a member of the Hindu Mahasabha and is contesting the election to the Lok Sabha as an independent candidate from Kangra Parliamentary constituency in the State of Punjab. He filed his nomination paper on January 28, 1957, as originally the polling was scheduled to commence in that constituency on February 24, 1957. The polling, however, has since been postponed and fixed for June 2, 1957.",
      "type": "background",
      "date": "1957-06-02",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The petitioner in the second petition contends that if the Presidential election is held on May 6, 1957, he will be deprived of his right to vote for the election of the President of the Union. He has also complained of discrimination offending against Art. 14 of the Constitution.",
      "type": "disputed",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The first main petition was presented on April 26, 1957, and the second on April 29, 1957. Along with each of the said petitions has been filed a Civil Miscellaneous Petition asking for a stay of the polling for the Presidential election fixed for May 6, 1957.",
      "type": "procedural",
      "date": "1957-04-26",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "There is no dispute as to the material facts.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Elections have not taken place at all in Himachal Pradesh and in two constituencies of the State of Punjab.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there is a grave doubt in connection with the election of the President requiring inquiry under Article 71(1) before the completion of the election process, particularly whether the electoral college under Article 54 must consist of all elected members after elections in all States and Union territories are completed.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Supreme Court can inquire into and decide doubts and disputes under Article 71(1) prior to the completion of the entire election process.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the Election Commission has discriminated against certain constituencies in violation of Article 14 by fixing Presidential polling before completion of all Lok Sabha elections.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The electoral college must consist of all the elected members falling within both categories of Article 54 after elections in all States and Union territories are completed, and since elections have not taken place in Himachal Pradesh and two Punjab constituencies, the electoral college cannot be constituted until those members are elected.",
      "supporting_facts": [
        "f1",
        "f10"
      ],
      "legal_basis": "Article 54, Article 62(1)"
    },
    {
      "id": "pa2",
      "text": "A grave doubt has arisen in connection with the election of the President and under Article 71, this Court must inquire into and decide the same, regardless of whether the doubt is well-founded.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Article 71(1)"
    },
    {
      "id": "pa3",
      "text": "Holding Presidential election before completion of all elections allows ruling party to manipulate by postponing elections in unfavorable States.",
      "supporting_facts": [
        "f1",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Petitioner in second petition deprived of right to vote as prospective Lok Sabha member, and discrimination under Article 14.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Article 14"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The electoral college consists of elected members at the crucial date of the election, and vacancies do not hold up the Presidential election required by Article 62(1) before expiry of term.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Article 54, Article 62(1), (2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Article 71(1) confers jurisdiction on the Court to inquire into doubts and disputes arising out of or in connection with the election of President, but the word 'election' means the entire process culminating in a candidate being declared elected, so inquiry must be after completion.",
      "addresses_issue": "i2",
      "key_observation": "Election in wide sense embraces entire process; premature interference would violate Article 62."
    },
    {
      "id": "cr2",
      "text": "Following N.P. Ponnuswami, election disputes under Article 329(b) and similar provisions must be by election petition after entire process.",
      "addresses_issue": "i2",
      "key_observation": "Same meaning applies to 'election' in Article 71."
    },
    {
      "id": "cr3",
      "text": "Presidential and Vice-Presidential Election Act, 1952, s.14 and s.18 provide for election petitions to Supreme Court after election, covering all stages including nomination and voting issues.",
      "addresses_issue": "i2",
      "key_observation": "Parliament understood election process as complete before challenge."
    },
    {
      "id": "cr4",
      "text": "No discrimination under Article 14; different polling dates due to exigencies, and any non-compliance can be raised post-election under s.18.",
      "addresses_issue": "i3",
      "key_observation": "No arbitrary deprivation shown."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The word 'election' in Article 71 means the entire election process culminating in declaration of elected candidate; doubts and disputes must be inquired after completion.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Present petitions are premature and cannot be entertained at this stage.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "N.P. Ponnuswami v. Returning Officer, Namakkal Constituency",
      "citation": "1952 S.C.R. 218",
      "treatment": "followed",
      "relevance": "Held that 'election' means entire process; challenges only by election petition after completion, not under Article 226."
    },
    {
      "case_name": "Srinivasalu v. Kuppuswami",
      "citation": "A.I.R. 1928 Mad. 253, 255",
      "treatment": "referred",
      "relevance": "On wide meaning of 'election' encompassing entire process."
    },
    {
      "case_name": "Sat Narain v. Hanuman Prasad",
      "citation": "A.I.R. 1945 Lah. 85",
      "treatment": "referred",
      "relevance": "On meaning of 'election'."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 54",
        "Article 56",
        "Article 62",
        "Article 71",
        "Article 14",
        "Article 324",
        "Article 327",
        "Article 329",
        "Article 145",
        "Article 226"
      ],
      "relevance": "Article 71 for jurisdiction on presidential election disputes; Article 62 mandates completion before term expiry; 'election' interpreted consistently; Article 329(b) bars pre-completion challenges."
    },
    {
      "name": "Representation of the People Act, 1951 (XLIII of 1951)",
      "sections": [
        "s. 73",
        "s. 80",
        "s. 4"
      ],
      "relevance": "Constitution of new Lok Sabha; election petitions for disputes."
    },
    {
      "name": "Presidential and Vice-Presidential Election Act, 1952 (XXXI of 1952)",
      "sections": [
        "s. 4",
        "s. 14",
        "s. 18"
      ],
      "relevance": "Election schedule; election called in question only by petition to Supreme Court after process; grounds include improper nomination, non-compliance."
    },
    {
      "name": "Indian Penal Code, 1860 (XLV of 1860)",
      "sections": [
        "Chapter IX-A"
      ],
      "relevance": "Bribery and undue influence at election."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The petitions seeking inquiry under Article 71 into doubts regarding the Presidential election electoral college and stay of polling are premature as 'election' means the entire process, and disputes must be raised by election petition after declaration of result; petitions Nos. 63 and 64 of 1957 and civil miscellaneous petitions dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'That word has by long usage... acquired both a wide and a narrow meaning. In the narrow sense... final selection... In the wide sense, the word is used to connote the entire process culminating in a candidate being declared elected.'",
      "speaker": "court",
      "significance": "Defines 'election' as entire process, key to holding petitions premature."
    },
    {
      "text": "Art. 71 postulates an election and the word election occurring in Art. 71 means the entire election process culminating in a candidate being declared elected and doubts and disputes... have to be inquired into and decided by this Court... after the completion of the entire process.",
      "speaker": "court",
      "significance": "Core holding on timing of Article 71 jurisdiction."
    },
    {
      "text": "The well recognised principle of election law, Indian and English, is that elections should not be held up and that the person aggrieved should not be permitted to ventilate his individual interest in derogation of the general interest of the people.",
      "speaker": "court",
      "significance": "Justifies policy against pre-completion interference."
    }
  ],
  "_case_id": "1957_17",
  "_label": 0,
  "_text_length": 22379,
  "_extracted_at": "2026-02-10T19:22:41.344242"
}