{
  "metadata": {
    "case_name": "Council of the Institute of Chartered Accountants of India v. Respondent",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar J."
    ],
    "case_number": "Civil Appeal No. 170 of 1956",
    "date_of_judgment": "1957-09-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On July 17, 1933, the respondent was enrolled as a registered accountant under the Auditors Certificate Rules, 1932.",
      "type": "background",
      "date": "1933-07-17",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "When the Chartered Accountants Act, 1949, came into operation, the respondent's name was entered as a Member of the Institute of Chartered Accountants of India on July 1, 1949.",
      "type": "background",
      "date": "1949-07-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On September 13, 1950, the respondent was appointed Liquidator of three companies.",
      "type": "background",
      "date": "1950-09-13",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The respondent obtained refund of the sums and securities deposited on behalf of the three companies with the Reserve Bank of India.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The respondent made no report about the progress of liquidation of the said three companies.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Repeated requests made to him by the Assistant Controller of Insurance found no response.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "As Liquidator the respondent gave a cheque to Shri S. K. Mandal, Solicitor to the Central Government at Calcutta, towards payment of the taxed costs in the winding-up proceedings of one of the companies. The said cheque was returned dishonoured on the ground that the payment had not been arranged for.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Assistant Controller of Insurance found that the conduct of the respondent as Liquidator was wholly unsatisfactory and that he would not even show the ordinary courtesy of replying to the letters addressed to him, proceeded to cancel the appointment of the respondent as Liquidator by his letter dated October 29, 1952.",
      "type": "procedural",
      "date": "1952-10-29",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The respondent was called upon to hand over all books of account, records, documents, etc., to Shri N. N. Das, who was appointed Liquidator in his place.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Shri Das as well as the Assistant Controller of Insurance made repeated demands on the respondent to deliver to Shri Das the assets and records of the three companies.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The respondent had with him securities of the value of Rs. 11,950 and a cash sum of Rs. 642 on account of the United Common Provident Insurance Co. Ltd.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "He had also with him securities to the value of Rs. 12,100 on account of the Asiatic Provident Co. Ltd., and securities and cash on account of the Citizens of India Provident Insurance Co. Ltd.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Out of these amounts the respondent returned only securities of the face value of Rs. 10,000 and Rs. 350 of Asiatic Provident Co. Ltd., and United Common Provident Insurance Co. Ltd., respectively.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "He failed to send any further securities or cash held by him on account of the said three companies.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "A complaint was lodged against the respondent with the Council of the Institute of Chartered Accountants of India in Calcutta.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The disciplinary committee of the Council inquired into the matter as required by the provisions of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Notice was served on the respondent but he filed no written statements within the time fixed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "On August 1, 1953, a letter was received from the respondent that he was ill and was unable to attend personally. The respondent had also requested for the adjournment of the case.",
      "type": "procedural",
      "date": "1953-08-01",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Proceedings were adjourned to August 29, 1953, on which date the respondent was represented by counsel who filed the respondent's affidavit stating that he was prepared to hand over the entire cash, books of account, etc., to the newly appointed Liquidator without rendering the necessary accounts.",
      "type": "procedural",
      "date": "1953-08-29",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Shri Das, the subsequently appointed Liquidator, gave evidence before the disciplinary committee.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Though several opportunities were given to the respondent to appear before the disciplinary committee he failed to appear or to take part in the proceedings.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "The committee made its report on September 13, 1953, and found that the respondent was guilty of gross negligence in the conduct of his professional duty in not handing over charge of the assets and the books of account of the said companies to the newly appointed Liquidator.",
      "type": "material",
      "date": "1953-09-13",
      "source": "lower_court"
    },
    {
      "id": "f23",
      "text": "The Council agreed with the finding recorded by the disciplinary committee in substance, but took the view that the acts and omissions of the respondent were more serious than what can be described as gross negligence.",
      "type": "material",
      "date": null,
      "source": "council"
    },
    {
      "id": "f24",
      "text": "The finding of the Council was forwarded to the High Court of Judicature at Calcutta as required by section 21(1) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f25",
      "text": "The matter was heard by the learned Chief Justice and Mr. Justice Lahiri. By their judgment delivered on January 12, 1955, the reference was rejected on the ground that no action could be taken against the respondent under the Act though the facts proved against the respondent showed that he had been guilty of grossly improper conduct if not dishonesty.",
      "type": "procedural",
      "date": "1955-01-12",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "What is the nature, scope and extent of the disciplinary jurisdiction which can be exercised under the provisions of the Chartered Accountants Act, 1949 against the respondent.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the conduct of the respondent as Liquidator amounts to professional misconduct under sections 21 and 22 of the Act.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the High Court, while hearing references under section 21, is bound by the specific finding of the Council or can adopt a broader interpretation and make appropriate orders.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The learned Judges of the Calcutta High Court have put an unduly restricted and narrow construction on the provisions of s. 21 and s. 22 in holding that the respondent's conduct does not amount to professional misconduct.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6",
        "f7",
        "f8",
        "f9",
        "f10",
        "f11",
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": "Chartered Accountants Act, 1949 sections 2(2)(iv), 21, 22; Regulation 78"
    },
    {
      "id": "pa2",
      "text": "The technical reason given by the learned Judges in not taking any action against the respondent even if they had accepted the broader interpretation of the two said sections proceeds on a misconception about the nature and extent of the powers of the High Court while hearing references made to it under the provisions of s. 21, sub-ss. 2, 3 and 4.",
      "supporting_facts": [
        "f22",
        "f23",
        "f24",
        "f25"
      ],
      "legal_basis": "Chartered Accountants Act, 1949 section 21(2), (3), (4)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The conduct of which the respondent is proved to have been guilty cannot be said to be professional misconduct properly so-called and cannot, therefore, attract the provisions of ss. 21 and 22 of the Act.",
      "supporting_facts": [
        "f3",
        "f8",
        "f9",
        "f13",
        "f14"
      ],
      "legal_basis": "Chartered Accountants Act, 1949 ss. 21, 22; G.M. Oka, In re; Haseldine v. Hosken"
    },
    {
      "id": "ra2",
      "text": "Even if the misconduct proved against the respondent attracted the provisions of ss. 21 and 22 of the Act it would not be open to the High Court to take any action against the respondent because the Institute cannot expect the Court to take action on the footing that the respondent had been guilty of misconduct otherwise than in his professional capacity since that is not the finding which the Council arrived at.",
      "supporting_facts": [
        "f22",
        "f23"
      ],
      "legal_basis": "Chartered Accountants Act, 1949 s. 21"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The conduct of the respondent while discharging his duties as liquidator must be characterised as his professional acts and omissions because under s. 2(2)(iv) and Regulation 78, acting as liquidator is a service that may be rendered by a chartered accountant and thus he is deemed to be in practice.",
      "addresses_issue": "i2",
      "key_observation": "Respondent guilty of professional misconduct."
    },
    {
      "id": "cr2",
      "text": "Section 21(1) allows inquiry into conduct which, if proved, will render him unfit to be a member; s.22 provides an inclusive definition and does not limit the power under s.21(1); even conduct not in Schedule can be inquired into if it renders unfit.",
      "addresses_issue": "i1",
      "key_observation": "Disciplinary jurisdiction not confined to professional misconduct in narrow sense."
    },
    {
      "id": "cr3",
      "text": "High Court under s.21(2),(3),(4) has wide powers: can examine correctness of findings, refer back for further inquiry, pass final orders as it thinks fit; not bound by Council's specific finding if facts allow alternative finding.",
      "addresses_issue": "i3",
      "key_observation": "High Court can make appropriate order even on broader construction."
    },
    {
      "id": "cr4",
      "text": "Precedents like G.M. Oka distinguished as obiter and attention not drawn to s.2(2)(iv); Haseldine and Krishnaswamy inapplicable.",
      "addresses_issue": "i1",
      "key_observation": "No support for narrow view from cited cases."
    },
    {
      "id": "cr5",
      "text": "The conduct of the respondent is wholly unworthy of a chartered accountant in practice; refusal to reply, failure to return assets indicate delaying tactics; grossly improper and unworthy, calls for deterrent order.",
      "addresses_issue": "i1",
      "key_observation": "Conduct requires deterrent action under s.21(3)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The respondent is clearly guilty of professional misconduct.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Disciplinary jurisdiction under ss.21 and 22 extends to conduct rendering unfit, even if not strictly professional in narrow sense or listed in Schedule.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "High Court has wide powers under s.21(3) to pass final orders as it thinks fit, including on facts proved even if differing from Council's specific finding.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "G. M. Oka, In re",
      "citation": "1952 22 Comp. Cas. 168",
      "treatment": "distinguished",
      "relevance": "Held false evidence as witness not professional misconduct; obiter, did not consider s.2(2)(iv)"
    },
    {
      "case_name": "Haseldine v. Hosken",
      "citation": "1933 1 K.B. 822",
      "treatment": "distinguished",
      "relevance": "Solicitor's champertous agreement not neglect in professional capacity; inapplicable to interpret Chartered Accountants Act"
    },
    {
      "case_name": "Krishnaswamy v. The Council of the Institute of Chartered Accountants",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Concerned whether orders under s.21(2) are civil proceedings; inapplicable"
    }
  ],
  "statutes_cited": [
    {
      "name": "Chartered Accountants Act, 1949",
      "sections": [
        "2(1)(b)",
        "2(2)",
        "2(2)(iv)",
        "4",
        "5",
        "6",
        "7",
        "8(v)",
        "8(vi)",
        "20",
        "21",
        "21(1)",
        "21(2)",
        "21(3)",
        "21(4)",
        "22",
        "30",
        "Schedule"
      ],
      "relevance": "Defines chartered accountant in practice including liquidator services; empowers disciplinary inquiry into conduct rendering unfit; High Court powers on reference"
    },
    {
      "name": "Auditors Certificate Rules, 1932",
      "sections": [],
      "relevance": "Respondent enrolled as registered accountant thereunder"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court judgment reversed; held respondent guilty of professional misconduct as liquidator deemed in practice under s.2(2)(iv); disciplinary jurisdiction applies; High Court erred in narrow construction and on its powers; case remitted for appropriate order under s.21(3) as deterrent warranted for grossly improper conduct.",
    "relief_granted": "Reverse High Court rejection; declare guilty of professional misconduct; appropriate deterrent order under s.21(3)",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the respondent is clearly guilty of professional misconduct.\"",
      "speaker": "court",
      "significance": "Core holding reversing High Court"
    },
    {
      "text": "\"His refusal to give prompt replies to the letters received from the Assistant Controller of Insurance followed by his failure to return the documents and all securities and cash received by him as liquidator leave no room for doubt that he was unable to return the said amount and the said securities and cash and that he was merely employing delaying tactics\"",
      "speaker": "court",
      "significance": "Assesses gravity of misconduct as grossly improper warranting deterrent order"
    },
    {
      "text": "\"Practice according to Websters New International Dictionary means exercise of any profession or occupation and if the performance of the duties as liquidator attracts the provisions of s. 2, sub-s. 2, whatever the chartered accountant does as a liquidator must be held to be conduct attributable to him in the course of his practice.\"",
      "speaker": "court",
      "significance": "Expands 'professional misconduct' to include liquidator duties"
    }
  ],
  "_case_id": "1957_101",
  "_label": 1,
  "_text_length": 30445,
  "_extracted_at": "2026-02-08T22:37:20.953898"
}