{
  "metadata": {
    "case_name": "Sohan Lal v. Jagan Nath & Union of India",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "IMAM J."
    ],
    "case_number": "Civil Appeal No. 132 of 1954",
    "date_of_judgment": "1957-03-07"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Jagan Nath registered as a refugee on December 31, 1947.",
      "type": "background",
      "date": "1947-12-31",
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "Government of India scheme for sale of box-type tenements in West Patel Nagar to displaced persons registered before August 15, 1948, gainfully employed; intended for those allotted agricultural land in East Punjab.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Procedure: Application, prima facie eligibility, deposit sale price (Rs. 5,600), verify eligibility, prepare list, pay ground rent, allot by lots if excess applicants.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Jagan Nath applied, prima facie eligible, deposited Rs. 5,600 sale price and ground rent, informed of allotment of two-roomed enclosed verandah box-type house, lots drawn February 15, 1952 at 3 p.m., allotted house No. 35 West Patel Nagar.",
      "type": "material",
      "date": "1952-02-15",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "On May 10, 1952, Accommodation Officer removed Jagan Nath's family and belongings to house No. 35 in a truck; Jagan Nath and family entered possession.",
      "type": "material",
      "date": "1952-05-10",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Jagan Nath evicted from house No. 35 on September 27, 1952, by warrant dated September 11, 1952, under s. 25 of Ordinance III of 1952.",
      "type": "material",
      "date": "1952-09-27",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Possession of house No. 35 given to appellant Sohan Lal on October 3, 1952.",
      "type": "material",
      "date": "1952-10-03",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Sohan Lal, a displaced person, applied for allotment on February 27, 1952, deposited Rs. 5,600, complied with conditions, allotted house No. 35 on July 31, 1952; in possession since October 3, 1952.",
      "type": "material",
      "date": "1952-02-27",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Jagan Nath ineligible under scheme as allotted agricultural land in Hissar District; no letter of allotment issued to him; informed property could not be allotted.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Jagan Nath filed petition under Art. 226 in Punjab High Court (Civil Writ Application No. 314 of 1952), allowed by order dated April 30, 1953; ordered Union of India and Sohan Lal to restore possession of house No. 35 to Jagan Nath.",
      "type": "procedural",
      "date": "1953-04-30",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Special leave to appeal granted to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether proceedings under Art. 226 appropriate where serious dispute on questions of fact and title to property.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether writ of mandamus or order in nature of mandamus can issue against private individual like appellant without collusion with Union of India.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Jagan Nath acquired title or rights to house No. 35 entitling restoration of possession.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Effect of illegal eviction under s. 3 Public Premises Eviction Act, 1950, when property now in possession of bona fide allottee.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in ordering restoration via writ as serious dispute on facts and title; proper remedy is civil suit for title declaration.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Art. 226 of Constitution"
    },
    {
      "id": "pa2",
      "text": "No writ of mandamus against private individual; appellant in lawful possession without collusion with Union of India.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Entered possession not as trespasser but inducted by Accommodation Officer; evicted illegally without notice under s. 3 Public Premises Eviction Act, 1950; entitled to restoration.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "s. 3 Public Premises Eviction Act, 1950 (Act No. XXVII of 1950)"
    },
    {
      "id": "ra2",
      "text": "Union of India and appellant should restore possession as eviction at instance of appellant.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Khushal Singh v. Shri Rameshwar Dayal; G. Kistareddy v. Commr. of City Police; Mohinder Singh v. State of Pepsu; Wazir Chand v. State of Himachal Pradesh"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Writ proceedings under Art. 226 not appropriate for disputed facts and title requiring civil suit; High Court should not declare title and order restoration.",
      "addresses_issue": "i1",
      "key_observation": "Questions of fact and law in dispute; prerogative writs not for passing decrees."
    },
    {
      "id": "cr2",
      "text": "Eviction contravened s. 3 Public Premises Eviction Act, illegal; mandamus could issue against Union of India if property still with them.",
      "addresses_issue": "i4",
      "key_observation": "Illegal eviction but property now with appellant."
    },
    {
      "id": "cr3",
      "text": "No evidence or finding of collusion between appellant and Union of India; mandamus does not issue against private individual without public duty or collusion.",
      "addresses_issue": "i2",
      "key_observation": "Appellant bona fide possessor like de facto office holder; quo warranto or suit needed."
    },
    {
      "id": "cr4",
      "text": "Appellant complied with conditions, letter of allotment issued; rights as against Jagan Nath to be decided in civil suit.",
      "addresses_issue": "i3",
      "key_observation": "Jagan Nath no letter of allotment; ineligible due to land in Hissar."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court erred in allowing Art. 226 petition and ordering restoration; such disputes to be resolved in civil court.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No mandamus against private individual in bona fide possession without collusion.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Khushal Singh v. Shri Rameshwar Dayal, Deputy Commissioner, Delhi",
      "citation": "I.L.R. 1954 Punjab 211",
      "treatment": "referred",
      "relevance": "Support for restoration after illegal eviction"
    },
    {
      "case_name": "G. Kistareddy v. Commr. of City Police, Hyderabad",
      "citation": "A.I.R. 1952 Hyderabad 36",
      "treatment": "referred",
      "relevance": "Support for restoration after illegal eviction"
    },
    {
      "case_name": "Mohinder Singh v. State of Pepsu",
      "citation": "A.I.R. 1955 Pepsu 60",
      "treatment": "referred",
      "relevance": "Support for restoration after illegal eviction"
    },
    {
      "case_name": "Wazir Chand v. The State of Himachal Pradesh",
      "citation": "1955 S.C.R. 408",
      "treatment": "referred",
      "relevance": "Observations supporting restoration after illegal eviction"
    },
    {
      "case_name": "R. v. Chester Corporation",
      "citation": null,
      "treatment": "followed",
      "relevance": "Mandamus not against de facto possessor unless colourable; quo warranto needed"
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Writ petition filed; inappropriate for title disputes"
    },
    {
      "name": "Public Premises Eviction Act, 1950",
      "sections": [
        "Section 3"
      ],
      "relevance": "Mandatory notice required before eviction; contravened, eviction illegal"
    },
    {
      "name": "Ordinance III of 1952",
      "sections": [
        "Section 25"
      ],
      "relevance": "Warrant of eviction issued under; but illegal due to non-compliance with 1950 Act"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order dated April 30, 1953, set aside. Disputes on title and facts to be resolved in civil suit; no mandamus against appellant.",
    "relief_granted": "None; High Court order quashed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We do not propose to enquire into the merits of the rival claims of title to the property in dispute set up by the appellant and Jagan Nath.",
      "speaker": "court",
      "significance": "Declines to adjudicate title in writ proceedings"
    },
    {
      "text": "Normally, a writ of mandamus does not issue to or an order in the nature of mandamus is not made against a private individual.",
      "speaker": "court",
      "key_observation": "Limits scope of mandamus"
    },
    {
      "text": "The eviction of Jagan Nath was in contravention of the express provisions of s. 3 of the Public Premises Eviction Act. His eviction, therefore, was illegal.",
      "speaker": "court",
      "significance": "Acknowledges illegality but denies remedy via writ against possessor"
    }
  ],
  "_case_id": "1957_73",
  "_label": 1,
  "_text_length": 13280,
  "_extracted_at": "2026-02-08T22:36:34.865709"
}