{
  "metadata": {
    "case_name": "Sohan Lal v. Jagan Nath & Union of India",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "IMAM J."
    ],
    "case_number": "Civil Appeal No. 132 of 1954",
    "date_of_judgment": "1957-03-07"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Jagan Nath registered as a refugee on December 31, 1947.",
      "type": "background",
      "date": "1947-12-31",
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "Government of India scheme for sale of box-type tenements in West Patel Nagar to displaced persons registered before August 15, 1948, gainfully employed, and who had already been allotted agricultural land in East Punjab.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Procedure: Application in prescribed form; prima facie eligibility check; deposit sale price Rs. 5,600; later verify eligibility; prepare list; if excess, refund later deposits; pay ground rent; allot by drawing lots.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Jagan Nath applied, prima facie eligible, deposited Rs. 5,600 sale price and ground rent, informed of allotment of two-roomed enclosed verandah box-type house, drawing lots on February 15, 1952 at 3 p.m., allotted house No. 35.",
      "type": "material",
      "date": "1952-02-15",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "On May 10, 1952, Accommodation Officer removed Jagan Nath's family and belongings to house No. 35 in West Patel Nagar in a truck; Jagan Nath and family entered possession.",
      "type": "material",
      "date": "1952-05-10",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Jagan Nath evicted from house No. 35 on September 27, 1952, by warrant of eviction dated September 11, 1952, under s. 25 of Ordinance III of 1952.",
      "type": "material",
      "date": "1952-09-27",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Possession of house No. 35 given to appellant Sohan Lal on October 3, 1952.",
      "type": "material",
      "date": "1952-10-03",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Sohan Lal, a displaced person, applied for allotment on February 27, 1952, deposited Rs. 5,600, complied with conditions, allotted house No. 35 on July 31, 1952.",
      "type": "material",
      "date": "1952-02-27",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Jagan Nath allotted agricultural land in District of Hissar previous to his application, making him ineligible under the scheme.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "No letter of allotment issued to Jagan Nath; informed that property could not be allotted as he had land in East Punjab.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Punjab High Court (Circuit Bench at Delhi) allowed Jagan Nath's writ petition under Art. 226 on April 30, 1953, ordering Union of India and Sohan Lal to restore possession of house No. 35 to Jagan Nath.",
      "type": "procedural",
      "date": "1953-04-30",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Special leave to appeal granted to Sohan Lal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether proceedings under Art. 226 appropriate where there are serious disputes on questions of fact and law regarding title to the property.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether writ of mandamus or order in nature of mandamus can be issued against a private individual like the appellant without evidence of collusion with Union of India.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Jagan Nath acquired title or rights to the property entitling restoration of possession.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in issuing order akin to writ of mandamus due to serious factual disputes and title issues; proper remedy is civil suit.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Art. 226 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "Mandamus cannot issue against private individual (appellant) without collusion with Union of India; appellant in lawful possession.",
      "supporting_facts": [
        "f7",
        "f8",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Entered possession lawfully via Accommodation Officer, not as trespasser; evicted illegally without notice under s. 3 Public Premises Eviction Act, 1950; entitled to restoration.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "s. 3 Public Premises Eviction Act, 1950 (Act No. XXVII of 1950)"
    },
    {
      "id": "ra2",
      "text": "Union of India and appellant should restore possession as eviction at instance of appellant.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Khushal Singh v. Shri Rameshwar Dayal; G. Kistareddy v. Commr. of City Police; Mohinder Singh v. State of Pepsu; Wazir Chand v. State of Himachal Pradesh"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Writ proceedings under Art. 226 not appropriate for disputed facts and title issues requiring civil suit; court declines to investigate merits of title claims.",
      "addresses_issue": "i1",
      "key_observation": "Questions of fact and law in dispute; declaring title and restoring possession amounts to civil decree."
    },
    {
      "id": "cr2",
      "text": "Eviction of Jagan Nath illegal as contravened s. 3 Public Premises Eviction Act; mandamus could issue against Union of India if property still in its possession.",
      "addresses_issue": "i2",
      "key_observation": "But property now with appellant."
    },
    {
      "id": "cr3",
      "text": "No evidence or finding of collusion between Union of India and appellant; mandamus does not issue against private individual in bona fide possession.",
      "addresses_issue": "i2",
      "key_observation": "Appellant complied with conditions, received letter of allotment, entered under authority."
    },
    {
      "id": "cr4",
      "text": "Analogy to election cases: cannot mandamus against de facto possessor without proving colourable transaction.",
      "addresses_issue": "i2",
      "key_observation": "R. v. Chester Corporation"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court erred in allowing writ petition under Art. 226 and ordering restoration of possession.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Writ of mandamus or order in nature thereof does not lie against private individual in bona fide possession without collusion.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Khushal Singh v. Shri Rameshwar Dayal, Deputy Commissioner, Delhi",
      "citation": "I.L.R. 1954 Punjab 211",
      "treatment": "referred",
      "relevance": "Support for restoration after illegal eviction"
    },
    {
      "case_name": "G. Kistareddy v. Commr. of City Police, Hyderabad",
      "citation": "A.I.R. 1952 Hyderabad 36",
      "treatment": "referred",
      "relevance": "Support for restoration after illegal eviction"
    },
    {
      "case_name": "Mohinder Singh v. State of Pepsu",
      "citation": "A.I.R. 1955 Pepsu 60",
      "treatment": "referred",
      "relevance": "Support for restoration after illegal eviction"
    },
    {
      "case_name": "Wazir Chand v. The State of Himachal Pradesh",
      "citation": "1955 S.C.R. 408",
      "treatment": "referred",
      "relevance": "Observations supporting restoration after illegal eviction"
    },
    {
      "case_name": "R. v. Chester Corporation",
      "citation": null,
      "treatment": "followed",
      "relevance": "Mandamus not against de facto possessor unless colourable"
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Writ petition filed; court holds inappropriate for title disputes"
    },
    {
      "name": "Public Premises Eviction Act, 1950",
      "sections": [
        "Section 3"
      ],
      "relevance": "Required notice before eviction; contravened, making eviction illegal"
    },
    {
      "name": "Ordinance III of 1952",
      "sections": [
        "Section 25"
      ],
      "relevance": "Warrant of eviction issued under this, but illegal"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; order of Punjab High Court dated April 30, 1953, set aside. Writ proceedings held inappropriate for factual and title disputes; no mandamus against private appellant.",
    "relief_granted": "None; High Court order quashed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We do not propose to enquire into the merits of the rival claims of title to the property in dispute set up by the appellant and Jagan Nath.",
      "speaker": "court",
      "significance": "Declines to resolve title in writ proceedings"
    },
    {
      "text": "Normally, a writ of mandamus does not issue to or an order in the nature of mandamus is not made against a private individual.",
      "speaker": "court",
      "significance": "Key holding against mandamus to appellant"
    },
    {
      "text": "The eviction of Jagan Nath was in contravention of the express provisions of s. 3 of the Public Premises Eviction Act. His eviction, therefore, was illegal.",
      "speaker": "court",
      "significance": "Acknowledges illegality of eviction but limits remedy"
    }
  ],
  "_case_id": "1957_73",
  "_label": 1,
  "_text_length": 13280,
  "_extracted_at": "2026-02-10T19:23:36.918885"
}