{
  "metadata": {
    "case_name": "Appellant (son of Subbiah Chettiar) v. Respondent",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 203 of 1956",
    "date_of_judgment": "1957-11-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is the son of Subbiah Chettiar. Subbiah had been adopted by Lakshmi Achi in 1922. Lakshmi Achi was the widow of the undivided paternal uncle of the respondent.",
      "type": "background",
      "date": "1922",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Subbiah filed a suit for partition of his share and obtained a decree in the trial court. The respondent took an appeal against the said decree in the High Court.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Pending the appeal, the dispute was settled amicably between Subbiah and the respondent. In consideration of payment of a specified sum and delivery of possession of certain sites, Subbiah agreed to release all his claims and those of his son, the present appellant, in respect of the properties then in suit.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Appellant filed Civil Suit No. 311 of 1951 on the Original Side of the Madras High Court claiming partition of the joint family properties and an account in respect of the joint family assets managed by the respondent. Appellant claimed to recover his share ignoring the said transaction between his father and the respondent.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "In the plaint, claim for accounts valued at Rs. 1,000 under s. 7(iv)(f) of the Court Fees Act, court fee of Rs. 112-7-0 paid ad valorem. For partition, fixed court fee of Rs. 100 paid under Art. 17-B Madras of Schedule II. For jurisdiction, value of Rs. 15,00,000 given for his share.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Registry inclined to view that plaint should bear court fee under s. 7(v) for partition. Matter referred to Master, who referred to Judge under s. 5. Chamber Judge Krishnaswamy Naidu J. on October 18, 1951 held appellant not bound to set aside prior compromise decree, plaint governed by Art. 17-B Schedule II, fee in order.",
      "type": "procedural",
      "date": "1951-10-18",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondent filed written statement raising contentions including that the compromise and release deed by appellant's father and subsequent decree were fair and bona fide, binding on appellant.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Ramaswamy Gounder J. tried respondent's contention about binding character of compromise decree as preliminary issue, held fair and bona fide settlement by father as manager, appellant bound, suit dismissed on September 22, 1953.",
      "type": "procedural",
      "date": "1953-09-22",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellant presented memorandum of appeal on December 1, 1953, bore same court fees as plaint.",
      "type": "procedural",
      "date": "1953-12-01",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Registry raised question of sufficiency of fees on appeal memo, viewed as claim for recovery of possession under s. 7(v). Referred to Master, who referred to Taxation Judge under s. 12(2). Chief Justice constituted Division Bench.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Division Bench treated as under s. 5, rejected finality of Krishnaswamy Naidu J. order (no appointment shown), held s. 7(v) not applicable, not Art. 17-B, but s. 7(iv)(b) applies, directed to mention value for partition relief.",
      "type": "procedural",
      "date": "1955-01-25",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellant valued relief at Rs. 50,000, paid deficit Rs. 1,662-7-0, re-presented appeal on May 7, 1954.",
      "type": "procedural",
      "date": "1954-05-07",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Registry objected that valuation can't differ from plaint's jurisdiction value of Rs. 15,00,000 without amendment. Appellant offered application for amendment on October 18, 1954, opposed, rejected. Division Bench held precluded from different value, treat Rs. 15,00,000 as value for fees under s. 7(iv)(b), rejected amendment, under s. 12(2) directed deficit fees on Rs. 15,00,000 on plaint and appeal memo.",
      "type": "procedural",
      "date": "1954-10-18",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appeal by special leave to Supreme Court against Madras High Court Division Bench order dated January 25, 1955.",
      "type": "procedural",
      "date": "1955-01-25",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order passed by Chamber Judge Krishnaswamy Naidu J. on October 18, 1951 under s. 5 of the Court Fees Act is final.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Division Bench could exercise jurisdiction under s. 12(2) of the Court Fees Act to direct additional court fees on the plaint.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether court fees should be paid on the basis of jurisdictional valuation of Rs. 15,00,000 or the valuation of Rs. 50,000 stated under s. 7(iv)(b) for partition relief.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Applicability of s. 7(v), Art. 17-B Schedule II, or s. 7(iv)(b) of the Court Fees Act to the plaint and memorandum of appeal.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Order by Krishnaswamy Naidu J. on October 18, 1951 is final under s. 5 as Chamber Judge on Original Side routinely appointed for such references.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Court Fees Act s. 5"
    },
    {
      "id": "pa2",
      "text": "Division Bench erred in exercising jurisdiction under s. 12(2) as it does not apply to appeals from Original Side suits.",
      "supporting_facts": [
        "f11",
        "f13"
      ],
      "legal_basis": "Court Fees Act s. 3, Chapter III; Madras High Court Fees Rules 1933"
    },
    {
      "id": "pa3",
      "text": "Having held s. 7(iv)(b) applies and allowed valuation at Rs. 50,000, cannot direct fees on Rs. 15,00,000 jurisdictional value; should allow amendment of plaint.",
      "supporting_facts": [
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": "Court Fees Act s. 7(iv)(b); Suits Valuation Act s. 8"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Plaint and appeal should be valued under s. 7(v) as claim for partition is in substance claim for possession based on title.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Court Fees Act s. 7(v)"
    },
    {
      "id": "ra2",
      "text": "Once jurisdictional value of Rs. 15,00,000 given in plaint, cannot change for court fees without amendment, which is precluded.",
      "supporting_facts": [
        "f5",
        "f13"
      ],
      "legal_basis": "Court Fees Act s. 7(iv)(b)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No record shows Krishnaswamy Naidu J. appointed under s. 5 generally or specially, so order not final.",
      "addresses_issue": "i1",
      "key_observation": "Practice assumption insufficient without record evidence."
    },
    {
      "id": "cr2",
      "text": "Madras High Court Fees Rules 1933 O.11 r.1 extends provisions of Court Fees Act including s. 12 to Original Side suits and appeals 'in every other respect', justifying jurisdiction under s. 12(1) and (2).",
      "addresses_issue": "i2",
      "key_observation": "Logical to allow examination of sufficiency where levy provisions apply."
    },
    {
      "id": "cr3",
      "text": "Division Bench order under s. 5 holding s. 7(iv)(b) applies to appeal memo is final, cannot reopen whether s. 7(v) or Art. 17-B applies.",
      "addresses_issue": "i4",
      "key_observation": "s. 5 finality applies to dispute between litigant and Registry."
    },
    {
      "id": "cr4",
      "text": "Under s. 7(iv)(b), plaintiff states value for fees; jurisdictional value follows per Suits Valuation Act s. 8. Rs. 15,00,000 jurisdictional value not binding for fees; liberty to amend plaint to state Rs. 50,000 value.",
      "addresses_issue": "i3",
      "key_observation": "Fees valuation primary, jurisdiction derivative; common to mention jurisdiction value only when claiming fixed fee."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Krishnaswamy Naidu J. order not final under s. 5 absent appointment record.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "s. 12(1) and (2) applicable to Original Side via Madras High Court Fees Rules O.11 r.1.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Division Bench s. 5 order on s. 7(iv)(b) final; fees on valuation stated by plaintiff under s. 7(iv)(b), not jurisdictional value.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "Plaintiff to be allowed to amend plaint to value partition relief at Rs. 50,000 for court fees under s. 7(iv)(b).",
      "resolves_issue": "i4",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Karam Ilahi v. Muhammad Bashir",
      "citation": "A.I.R. 1949 Lah. 116",
      "treatment": "followed",
      "relevance": "Supports allowing amendment to state value for court fees under s. 7(iv) rather than binding by jurisdictional value."
    }
  ],
  "statutes_cited": [
    {
      "name": "Court Fees Act",
      "sections": [
        "s. 3",
        "s. 5",
        "s. 7(iv)(b)",
        "s. 7(iv)(f)",
        "s. 7(v)",
        "s. 12(1)",
        "s. 12(2)",
        "Schedule II Art. 17-B"
      ],
      "relevance": "Determines applicable court fees for partition and accounts claims, finality of orders, appellate power to direct deficit fees."
    },
    {
      "name": "Madras High Court Fees Rules, 1933",
      "sections": [
        "O. 11 r. 1",
        "Order II r. 1"
      ],
      "relevance": "Extends Court Fees Act provisions to Original Side suits and appeals."
    },
    {
      "name": "Suits Valuation Act",
      "sections": [
        "s. 8"
      ],
      "relevance": "Value for jurisdiction same as for court fees under s. 7(iv), but fees valuation primary."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, order under appeal set aside. Appellant permitted to amend plaint valuing partition relief at Rs. 50,000 under s. 7(iv)(b). Directed to pay additional court fees on plaint on Rs. 50,000 basis within two months.",
    "relief_granted": "Liberty to amend plaint valuation for court fees; pay deficit fees on Rs. 50,000.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the amount stated by the plaintiff as the value of his claim for partition has ordinarily to be accepted by the court in computing the court fees payable in respect of the said relief.\"",
      "speaker": "court",
      "significance": "Core holding on plaintiff's option to value under s. 7(iv)(b)."
    },
    {
      "text": "\"the value for court fees stated by the plaintiff that is of primary importance. It is from this value that the value for jurisdiction must be determined.\"",
      "speaker": "court",
      "significance": "Clarifies primacy of fees valuation over jurisdiction in s. 7(iv) suits."
    }
  ],
  "_case_id": "1957_115",
  "_label": 1,
  "_text_length": 30604,
  "_extracted_at": "2026-02-08T22:37:10.900028"
}