{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Assam v. Smt. Jyotikana Chowdhurani & Ors.",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "Bhagwati, J."
    ],
    "case_number": "Civil Appeals Nos. 51, 58, 59, 60, 61, 62 of 1956",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "These six appeals with certificates of fitness under section 66A(2) of the Indian Income-tax Act XI of 1922 are directed against a common judgment and order passed by the Full Bench of the High Court of Judicature in Assam on a consolidated reference by the Income-tax Appellate Tribunal under section 66(1) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The referred question was: Whether on the facts and in the circumstances of this case the receipts from the sale of sal trees can be said to be agricultural income under section 2(1) and exempt from taxation under section 4(3)(viii) of the Income-tax Act?",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f3",
      "text": "Sarjoo Prasad, C.J., and Ram Labhaya, J., answered the referred question in the affirmative; Deka, J., answered it in the negative.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f4",
      "text": "Smt. Jyotikana Chowdhurani, respondent in Civil Appeal No. 51 of 1956, is the widow and legal representative of the late Jyotsna Nath Choudhury, a sharer and proprietor of the Mechpara Estate in Goalpara, Assam.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Mechpara Estate and Parbat Joar Estate are assessed to land revenue payable to the State of Assam and subject to local rates; vast areas of forest tracts covered mainly by sal trees.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Trees in the forests are of spontaneous growth; no planting or sowing or employment of any human agency for tilling the soil.",
      "type": "admitted",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f7",
      "text": "In 1923, late Rai Sourindra Narayan Sinha Chowdhury (sharer of Parbat Joar Estate) assessed on sal tree sales; Assistant Commissioner held receipts from forests were agricultural income on April 28, 1923; Income-tax authorities accepted and ceased assessing for years.",
      "type": "background",
      "date": "1923-04-28",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Jyotsna Nath Chowdhury assessed on December 17, 1946 for 1946-47 on sal tree sales by ITO Gauhati; appeals to Appellate Assistant Commissioner and Tribunal failed; Tribunal referred question.",
      "type": "procedural",
      "date": "1946-12-17",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Birendra Narayana Chowdhury (CA 58/1956), sharer of same estate, assessed December 17, 1946 for 1946-47; appeals dismissed; question referred.",
      "type": "procedural",
      "date": "1946-12-17",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Shrimati Sulochana Chowdhury (CA 59/1956), legal rep of Jagadindra Narayan Chowdhury (sharer of Parbat-Joar and Mechpara), assessed March 24, 1947 for 1946-47; appeal to AAC reduced assessment March 15, 1948; Tribunal dismissed; question referred.",
      "type": "procedural",
      "date": "1947-03-24",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Kamal Krishna Chowdhury (CA 60/1955), sharer of Mechpara, assessed December 17, 1946 for 1946-47; appeals failed; question referred.",
      "type": "procedural",
      "date": "1946-12-17",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Sourindra Narayan Chowdhury (CA 61/1956), sharer of Parbatjoar and Mechpara, assessed July 29, 1947, December 17, 1947 for 1946-47 and 1948-49; appeals failed; question referred.",
      "type": "procedural",
      "date": "1947-07-29",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Smt. Sindhurani Chaudhurani & Ors. (CA 62/1956), legal reps of Jyotirindra Narayan Sinha Choudhury, assessed December 17, 1946, December 17, 1947, November 22, 1948 for 1946-47, 1947-48, 1948-49; appeals failed; question referred.",
      "type": "procedural",
      "date": "1946-12-17",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Assessees claimed employment of human skill and labour: maintenance of forest establishment; activities like reservation of blocks (Jhars), marking trees, creeper cutting, thinning, clearing undergrowth, grazing, burning undergrowth, fire protection, preservation of mother trees.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "No contribution by way of cultivation; trees standing for considerable years, soil untouched.",
      "type": "admitted",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f16",
      "text": "Mechpara Estate: expenses on forest establishment Rs. 15,000/year, gross receipts Rs. 1,70,000.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f17",
      "text": "Parbatjoar Estate: gross receipts Rs. 3,32,414; forest expenses Rs. 14,057 (Forest Officers Rs. 5,219, Guards Rs. 4,838, Head Officers Rs. 4,000).",
      "type": "material",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of this case the receipts from the sale of sal trees can be said to be agricultural income under section 2(1) and exempt from taxation under section 4(3)(viii) of the Income-tax Act?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No planting or sowing of seeds; no human agency for tilling soil; soil untouched; no basic operations; only subsequent forestry operations after spontaneous growth; insignificant expenditure compared to receipts (less than 8% and 4%).",
      "supporting_facts": [
        "f6",
        "f15",
        "f16",
        "f17"
      ],
      "legal_basis": "Section 2(1) of Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Human skill and labour employed for maintenance, preservation, nursing, improving and rearing of forests via operations: reservation of blocks, marking trees, creeper cutting, thinning, clearing, grazing, burning undergrowth, fire protection, preservation of mother trees.",
      "supporting_facts": [
        "f14",
        "f16",
        "f17"
      ],
      "legal_basis": "Section 2(1) and 4(3)(viii) of Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Applying principles from CIT v. Raja Benoy Kumar Sahas Roy: no planting/sowing/tilling; no basic operations on land; only subsequent forestry operations after spontaneous sprouting; operations foster growth but do not convert to agriculture; forests remain spontaneous.",
      "addresses_issue": "i1",
      "key_observation": "Forestry operations insignificant (4-8% of receipts); cannot assimilate to agricultural operations without basic operations."
    },
    {
      "id": "cr2",
      "text": "High Court majority erroneous in holding operations agricultural despite no tilling/planting; Deka J. dissented noting no evidence, but court proceeds assuming facts proved.",
      "addresses_issue": "i1",
      "key_observation": "Subsequent operations cannot be tacked onto non-existent basic operations."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Receipts from sale of sal trees not agricultural income; question answered in negative.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, West Bengal v. Raja Benoy Kumar Sahas Roy",
      "citation": null,
      "treatment": "followed",
      "relevance": "Laid down connotation of agriculture/agricultural purpose; conditions for forestry on spontaneous growth to be agricultural."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "2(1)",
        "4(3)(viii)",
        "66(1)",
        "66A(2)"
      ],
      "relevance": "Definition of agricultural income; exemption; reference to High Court and certificate to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; High Court majority decision set aside; referred question answered in the negative; appellant entitled to one set of costs from respondents.",
    "relief_granted": "Reversal of High Court decision affirming assessments as non-agricultural income.",
    "costs": "Appellant gets from the respondents one set of costs in all the appeals."
  },
  "key_quotes": [
    {
      "text": "The forests continued to be forests of spontaneous growth and the only result of the performance of these operations on the produce of the forests which was the outcome of spontaneous growth unaided by human skill and labour was the maintenance, preservation, nursing, improving and rearing of the forests.",
      "speaker": "court",
      "significance": "Distinguishes subsequent operations from basic agricultural operations."
    },
    {
      "text": "Unless and until there was even one basic operation on the land itself the rest of the operations could not be tacked on to them so as to convert the whole of them into agricultural operations.",
      "speaker": "court",
      "significance": "Core test for agricultural income from spontaneous forests."
    }
  ],
  "_case_id": "1957_18",
  "_label": 1,
  "_text_length": 16453,
  "_extracted_at": "2026-02-10T19:22:33.050247"
}