{
  "metadata": {
    "case_name": "Sree Meenakshi Mills Ltd. & Anr. v. Their Workmen",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal Nos. 217, 218 and 219 of 1956",
    "date_of_judgment": "1957-11-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dispute No. 24 of 1951 between management and workers of Sree Meenakshi Mills Ltd., Madurai, and Dispute No. 26 of 1951 between management and workers of Thiakesar Alai Manapparai, both in respect of bonus claimed by workmen for the year 1950-51.",
      "type": "material",
      "date": "1950-1951",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Workmen alleged two mills constituted one unit and had made profits during relevant year.",
      "type": "disputed",
      "date": "1950-1951",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Appellants contended two mills were two different units and there was trading loss during relevant year, so no bonus payable.",
      "type": "disputed",
      "date": "1950-1951",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Industrial Tribunal rejected appellants' pleas, held two mills part of same unit, surplus of Rs. 2,87,676, awarded three months bonus to workmen.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Appellants preferred appeals Nos. 133 and 134 of 1952 to Labour Appellate Tribunal, Madras; workmen preferred appeal No. 168 of 1952 claiming larger bonus.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Labour Appellate Tribunal confirmed two mills as same unit, net surplus Rs. 2,57,496, disallowed deductions including Rs. 4,43,927 out of Rs. 8,43,927 depreciation claim (only Rs. 4,00,000 allowed), agreed provision for taxation Rs. 1,75,000 adequate; dismissed all appeals.",
      "type": "procedural",
      "date": "1953-12-07",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellants filed review application Misc. Case No. 111-C-387 of 1953 before Labour Appellate Tribunal alleging mistake apparent on face of record; tribunal held no power of review and no case made out.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellants appealed to Supreme Court by special leave: Civil Appeals Nos. 218 and 219 of 1956 against main decision, No. 217 of 1956 against review dismissal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Financial position: Gross total profit Rs. 16,44,838 after additions including depreciation Rs. 8,43,927 and taxation provision Rs. 1,75,000; deductions including allowed depreciation Rs. 4,00,000, taxation Rs. 1,75,000, return on capital Rs. 2,94,500, etc., yielding net surplus Rs. 2,57,496.",
      "type": "material",
      "date": "1950-1951",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Depreciation analysis: Madurai (245 days) Normal Rs. 3,17,331, Extra Rs. 38,465, Initial Rs. 2,87,250; Usilampatti (250 days) Rs. 2,23,206 including extra Rs. 16,077; total Rs. 8,82,329 (but debited Rs. 8,43,927).",
      "type": "material",
      "date": "1950-1951",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Workmen applied for inspection of accounts, allowed; then sought particulars on Rs. 8,44,000 depreciation; appellants promised but stated unable to give details.",
      "type": "procedural",
      "date": "1952-02-28",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appellants filed statement before appellate tribunal that provision for income-tax needed revision to Rs. 4,75,582 if depreciation Rs. 4,43,927 disallowed.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether industrial tribunals are obliged to allow full depreciation (normal, initial, additional) as per Income-tax Act sections in determining net surplus for bonus under Full Bench formula.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Labour Appellate Tribunal has jurisdiction to review its orders under O.47 CPC.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether disallowance of initial and additional depreciation requires proportionate increase in provision for income-tax.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellate tribunal erred in disallowing claim for depreciation Rs. 4,43,927 (initial and additional); tribunals must follow Income-tax Act provisions for depreciation.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Income-tax Act Section 10(vi), (vi-a), (vi-b)"
    },
    {
      "id": "pa2",
      "text": "Labour Appellate Tribunal has power of review under O.47 CPC; mistake apparent on record as tax provision inadequate if depreciation disallowed, should be increased to Rs. 4,75,582.",
      "supporting_facts": [
        "f6",
        "f7",
        "f12"
      ],
      "legal_basis": "CPC O.47; Industrial Disputes Appellate Tribunal Act ss.9,10"
    },
    {
      "id": "pa3",
      "text": "Balancesheet audited; no justification for drastic reduction despite failure to supply details.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Two mills one unit; bonus justified.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Bonus claim justified if living wages short and profits partly due to workmen; determine net surplus after prior charges per Full Bench formula (depreciation, rehabilitation, return on capital, working capital, income-tax).",
      "addresses_issue": "i1",
      "key_observation": "Industrial tribunals not bound to adopt Income-tax Act procedure fully; only normal depreciation (incl. multiple shift) as prior charge, not initial/additional which are abnormal for limited periods."
    },
    {
      "id": "cr2",
      "text": "Following U.P. Electric Supply Full Bench: initial/additional depreciation not fair prior charges as they may leave no surplus despite prosperity; social justice differs from Income-tax considerations.",
      "addresses_issue": "i1",
      "key_observation": "No obligation to follow Income-tax Act for depreciation alone."
    },
    {
      "id": "cr3",
      "text": "Labour Appellate Tribunal erred holding no review power under O.47 CPC, as CPC applies per Martin Burn Ltd.",
      "addresses_issue": "i2",
      "key_observation": "But no mistake apparent; point on tax not argued earlier, and even if, gross profits not taxable profits; appellants get IT exemption on disallowed depreciation."
    },
    {
      "id": "cr4",
      "text": "Disallowing extra depreciation does not require higher tax provision; tax adequacy judged by IT Act; adding fictional tax defeats disallowance purpose.",
      "addresses_issue": "i3",
      "key_observation": "Appellants not liable for tax on initial/additional depreciation items."
    },
    {
      "id": "cr5",
      "text": "Adverse comment on appellants' failure to provide depreciation details justified but not sole basis for disallowance.",
      "addresses_issue": "i1",
      "key_observation": "If not bound to grant initial/additional, disallowance proper."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Industrial tribunals need allow only normal depreciation as prior charge under Full Bench formula, not initial or additional per Income-tax Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Labour Appellate Tribunal has jurisdiction to review under O.47 CPC, but no case made out here.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No increase in tax provision required due to depreciation disallowance.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Muir Mills Co. Ltd. v. Suti Mills Mazdoor Union, Kanpur",
      "citation": "1955 I S.C.R. 991",
      "treatment": "followed",
      "relevance": "Bonus is additional payment representing share in surplus, not bounty or deferred wages; requires shortfall in living wages and profits from labour contribution."
    },
    {
      "case_name": "Mill Owners Association, Bombay v. Rashtriya Mill Mazdoor Sangh, Bombay",
      "citation": "1950 2 L.L.J. 1247",
      "treatment": "followed",
      "relevance": "Full Bench formula for distributable surplus: depreciation, rehabilitation, return on capital/working capital, income-tax."
    },
    {
      "case_name": "U.P. Electric Supply Co. Ltd. v. Their Workmen",
      "citation": "1955 L.A.C. 659",
      "treatment": "followed",
      "relevance": "Only normal depreciation prior charge; initial/additional abnormal, not to be allowed before surplus."
    },
    {
      "case_name": "Mills Martin Burn Ltd. v. R. A. Banerjee",
      "citation": "Civil Appeal No. 92 of 1957",
      "treatment": "followed",
      "relevance": "CPC applies to Labour Appellate Tribunal proceedings."
    },
    {
      "case_name": "Model Mills, etc. Textile Mills Nagpur v. Rashtriya Mill Mazdoor Sangh",
      "citation": "1955 I L.L.J. 534",
      "treatment": "referred",
      "relevance": "Full Bench formula equates capital/labour rights; income-tax on trading profits deductible even if exempted due to past losses."
    },
    {
      "case_name": "Mahalaxmi Woollen Mills Ltd. v. Their Workmen",
      "citation": "1956 I L.L.J. 305",
      "treatment": "referred",
      "relevance": "Income-tax on relevant year profits deductible irrespective of actual payment due to prior losses."
    },
    {
      "case_name": "Bennett Coleman and Company, Ltd. v. Their Workmen",
      "citation": "1955 II L.L.J. 60",
      "treatment": "referred",
      "relevance": "Cannot refuse relief for unabsorbed losses/depreciation while denying tax provision thereon."
    },
    {
      "case_name": "B.E.S.T. Workers Union v. Bombay Suburban Electric Supply Ltd.",
      "citation": "1957 2 L.L.J. 112",
      "treatment": "doubted",
      "relevance": "Supported appellants but held not sound."
    },
    {
      "case_name": "Greaves Cotton and Crompton Parkinson, Ltd. v. Its Workmen",
      "citation": "1956 I L.L.J. 486",
      "treatment": "doubted",
      "relevance": "Supported appellants but held not correct."
    },
    {
      "case_name": "Bengal Chemical Pharmaceutical Works, Ltd. v. Their Workmen",
      "citation": "1954-55 6 F.J.R. 590",
      "treatment": "referred",
      "relevance": "Tax on income of claim year, not prior year paid; examine profit/loss account."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "Section 10(vi)",
        "Section 10(vi-a)",
        "Section 10(vi-b)"
      ],
      "relevance": "Provides normal, initial, additional depreciation allowances; not fully binding on bonus surplus calculation."
    },
    {
      "name": "Industrial Disputes Appellate Tribunal Act, 1950",
      "sections": [
        "Section 9(1)",
        "Section 10"
      ],
      "relevance": "CPC applies to proceedings."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order 47"
      ],
      "relevance": "Labour Appellate Tribunal has review power."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed all three appeals, upholding tribunals' disallowance of initial and additional depreciation, confirming net surplus and bonus award; held review jurisdiction exists but not exercisable here; no adjustment to tax provision needed.",
    "relief_granted": "None to appellants; bonus award upheld.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"Bonus is not, as its etymological meaning would suggest, a mere matter of bounty gratuitously made by the employer to his employees nor is it a matter of deferred wages.\"",
      "speaker": "court",
      "significance": "Defines nature of bonus as share in surplus."
    },
    {
      "text": "\"It would not be fair to the workmen that these two depreciations are rated as prior charges before the available surplus is ascertained.\"",
      "speaker": "court",
      "significance": "Justifies excluding initial/additional depreciation."
    },
    {
      "text": "\"If the Code of Civil Procedure applies to the proceedings before the Labour Appellate Tribunal, it is clear that the provisions of O.47 would apply.\"",
      "speaker": "court",
      "significance": "Confirms review jurisdiction."
    }
  ],
  "_case_id": "1957_63",
  "_label": 0,
  "_text_length": 29999,
  "_extracted_at": "2026-02-10T19:22:42.288339"
}