{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Assam v. Smt. Jyotikana Chowdhurani & Ors.",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "Bhagwati, J."
    ],
    "case_number": "Civil Appeals Nos. 51, 58, 59, 60, 61, 62 of 1956",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Six appeals by Commissioner of Income-tax, Assam against judgment of Full Bench of High Court of Assam on consolidated reference under section 66(1) of Indian Income-tax Act, 1922.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Referred question: Whether on the facts and in the circumstances of this case the receipts from the sale of sal trees can be said to be agricultural income under section 2(1) and exempt from taxation under section 4(3)(viii) of the Income-tax Act?",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Mechpara Estate and Parbat Joar Estate in District of Goalpara, Assam, assessed to land revenue and local rates payable to State of Assam.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Estates have vast areas of forest tracts covered mainly by sal trees of spontaneous growth; no planting or sowing or employment of human agency for tilling the soil.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In 1923, Income-tax Officer assessed receipts from sale of sal trees as income; Assistant Commissioner held them agricultural income, accepted by authorities who ceased assessment for years.",
      "type": "background",
      "date": "1923-04-28",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Jyotsna Nath Chowdhury assessed on 17-12-1946 for 1946-47 on sal tree sales; appeals to Appellate Assistant Commissioner and Tribunal failed; reference to High Court.",
      "type": "procedural",
      "date": "1946-12-17",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Similar assessments for Birendra Narayana Chowdhury, Jagadindra Narayan Chowdhury (died, succeeded by Sulochana Chowdhury), Kamal Krishna Chowdhury, Sourindra Narayan Chowdhury, Jyotirindra Narayan Sinha Choudhury (succeeded by widow and sons) for 1946-47 and some later years.",
      "type": "material",
      "date": "1946-12-17",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Assessees claimed employment of human skill and labour: reservation of blocks (Jhars) by rotation, marking trees for felling, creeper cutting, thinning diseased trees, clearing undergrowth, controlled grazing, burning undergrowth, fire protection, preservation of mother trees.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "No contribution by way of cultivation; soil untouched; trees standing for considerable years.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Expenses: Mechpara Estate Rs.15,000 on forest establishment (gross Rs.1,70,000); Parbatjoar Rs.14,057 (gross Rs.3,32,414).",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "High Court majority (Sarjoo Prasad CJ, Ram Labhaya J) answered affirmative; Deka J negative.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether receipts from sale of sal trees from forests of spontaneous growth, with claimed forestry operations, constitute agricultural income under section 2(1) exempt under section 4(3)(viii) of Income-tax Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No planting, sowing or tilling; trees spontaneous; operations are mere forestry, not agricultural; insignificant costs compared to receipts (less than 8-4%).",
      "supporting_facts": [
        "f4",
        "f9",
        "f10"
      ],
      "legal_basis": "Section 2(1), 4(3)(viii) Income-tax Act; principles from CIT WB v. Raja Benoy Kumar Sahas Roy"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Human skill and labour employed in maintenance, preservation, nursing, improving forests via specific operations (reservation, marking, thinning etc.), making it agricultural.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 2(1), 4(3)(viii) Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No basic operations (planting, sowing, tilling); only subsequent forestry operations after spontaneous sprouting; forests remain of spontaneous growth.",
      "addresses_issue": "i1",
      "key_observation": "Operations foster growth but do not convert spontaneous forests to agricultural land; no human skill on land itself for cultivation."
    },
    {
      "id": "cr2",
      "text": "Applying principles from CIT WB v. Raja Benoy Kumar Sahas Roy: basic operations prerequisite; subsequent operations alone insufficient.",
      "addresses_issue": "i1",
      "key_observation": "None of listed operations are basic; insignificant expenditure reinforces non-agricultural nature."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Receipts from sale of sal trees not agricultural income; referred question answered in negative.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, West Bengal v. Raja Benoy Kumar Sahas Roy",
      "citation": null,
      "treatment": "followed",
      "relevance": "Laid down connotation of agriculture, agricultural purpose; conditions for forestry operations to be agricultural."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "2(1)",
        "4(3)(viii)",
        "66(1)",
        "66A(2)"
      ],
      "relevance": "Definition of agricultural income; exemption; reference and appeal provisions."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeals, set aside High Court majority decision, answered referred question in negative holding receipts not agricultural income.",
    "relief_granted": "Question answered in negative in favour of revenue.",
    "costs": "Appellant gets one set of costs from respondents in all appeals."
  },
  "key_quotes": [
    {
      "text": "The forests continued to be forests of spontaneous growth and the only result of the performance of these operations on the produce of the forests which was the outcome of spontaneous growth unaided by human skill and labour was the maintenance, preservation, nursing, improving and rearing of the forests.",
      "speaker": "court",
      "significance": "Distinguishes forestry operations from agricultural basic operations."
    },
    {
      "text": "Unless and until there was even one basic operation on the land itself the rest of the operations could not be tacked on to them so as to convert the whole of them into agricultural operations.",
      "speaker": "court",
      "significance": "Core test for agricultural income from spontaneous forests."
    }
  ],
  "_case_id": "1957_18",
  "_label": 1,
  "_text_length": 16453,
  "_extracted_at": "2026-02-08T22:35:42.367736"
}