{
  "metadata": {
    "case_name": "Baij Nath Prasad Tripathi v. State (Petition No. 115 of 1956) and Sudhakar Dube v. State (Petition No. 132 of 1956)",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das J."
    ],
    "case_number": "Petition No. 115 of 1956 and Petition No. 132 of 1956",
    "date_of_judgment": "1957-02-13"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Baij Nath Prasad Tripathi was a Sub-inspector of Police in the then State of Bhopal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Baij Nath Prasad Tripathi was prosecuted in the Court of Shri B. K. Puranik, Special Judge, Bhopal, and convicted of offences under s. 161, Indian Penal Code, and s. 5 of the Prevention of Corruption Act, 1947. Sentenced to nine months rigorous imprisonment on each count.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Baij Nath Prasad Tripathi preferred an appeal to the Judicial Commissioner of Bhopal. The Judicial Commissioner by judgment dated March 7, 1956, held that no sanction according to law had been given for the prosecution, the Special Judge had no jurisdiction to take cognizance, trial was ab initio invalid and liable to be quashed. Set aside conviction and quashed entire proceedings. Observed parties relegated to position as if no legal charge-sheet had been submitted.",
      "type": "procedural",
      "date": "1956-03-07",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "On April 4, 1956, the Chief Commissioner of Bhopal passed an order under s. 72 of the Criminal Law Amendment Act, 1952 (No. XLVI of 1952) that Baij Nath Prasad Tripathi shall be tried by Shri S. N. Shrivastava, Special Judge, Bhopal, for certain offences under the Prevention of Corruption Act read with s. 161, Indian Penal Code.",
      "type": "procedural",
      "date": "1956-04-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Sudhakar Dube was a Sub-Inspector of Police in the then State of Bhopal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Sudhakar Dube was prosecuted in the Court of Shri B. K. Puranik, Special Judge, Bhopal, on a charge of having accepted illegal gratification for showing official favour to one Panna Lal.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Special Judge by order dated January 10, 1956, concluded that no legal sanction for prosecution had been given by competent authority, sanction by Inspector General of Police was not valid in law, whole trial null and void, could not take cognizance, quashed proceedings.",
      "type": "procedural",
      "date": "1956-01-10",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "On February 7, 1956, the Chief Secretary to the Government of Bhopal accorded fresh sanction for prosecution of Sudhakar Dube for offences under s. 161, Indian Penal Code, and s. 5 of the Prevention of Corruption Act.",
      "type": "procedural",
      "date": "1956-02-07",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Petitioners filed petitions under Article 32 for writs restraining respondents from prosecuting and trying them on the criminal charges.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the petitioners can be prosecuted and tried again for the same offences after earlier proceedings were quashed for lack of valid sanction, in view of cl. 2 of Art. 20 of the Constitution and s. 403 of the Code of Criminal Procedure.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "By reason of cl. 2 of Art. 20 of the Constitution and s. 403 of the Code of Criminal Procedure, the petitioners cannot be tried for the offences in question.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Article 20(2) Constitution; Section 403 CrPC"
    },
    {
      "id": "pa2",
      "text": "Distinction between jurisdiction and taking cognizance under ss. 190, 191, 192, 529, 530 CrPC; earlier courts had jurisdiction despite lack of sanction.",
      "supporting_facts": [
        "f3",
        "f7"
      ],
      "legal_basis": "Sections 190, 191, 192, 529, 530 CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Earlier proceedings null and void ab initio due to lack of valid sanction; no trial by court of competent jurisdiction; no bar under Art. 20(2) or s. 403 CrPC.",
      "supporting_facts": [
        "f3",
        "f7"
      ],
      "legal_basis": "Section 6 Prevention of Corruption Act, 1947; precedents"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Point concluded by decisions: Yusofalli Mulla v. The King (Privy Council), Basdeo Agarwalla v. King-Emperor (Federal Court), Budha Mal v. State of Delhi (this Court). First trial must be by court competent to hear and determine; without sanction, court not competent.",
      "addresses_issue": "i1",
      "key_observation": "Whole basis of s. 403(1) is that first trial before court competent to record conviction or acquittal; without sanction, irrelevant that court competent for other cases."
    },
    {
      "id": "cr2",
      "text": "Cl. 2 of Art. 20 has no application; petitioners not prosecuted and punished for same offence more than once, earlier proceedings null and void.",
      "addresses_issue": "i1",
      "key_observation": "No conviction or acquittal in force within meaning of s. 403(1)."
    },
    {
      "id": "cr3",
      "text": "Mandatory provisions of s. 6 Prevention of Corruption Act; no court can take cognizance without legal sanction, hence no court of competent jurisdiction.",
      "addresses_issue": "i1",
      "key_observation": "Sections 529(e), 530 CrPC do not aid petitioners; s. 530 states if magistrate not empowered tries offender, proceedings void."
    },
    {
      "id": "cr4",
      "text": "Observations in Basdeo v. Emperor (Allahabad HC) distinguished; different facts, no occasion to consider mandatory sanction provisions.",
      "addresses_issue": "i1",
      "key_observation": "Cannot treat observations as abstract propositions independent of context."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Earlier proceedings held null and void for lack of valid sanction do not bar fresh trial under Art. 20(2) or s. 403 CrPC.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Yusofalli Mulla v. The King",
      "citation": "A.I.R. 1949 P.C. 264",
      "treatment": "followed",
      "relevance": "Held that s. 403(1) requires first trial by court competent to record verdict; without sanction, court not competent."
    },
    {
      "case_name": "Basdeo Agarwalla v. King-Emperor",
      "citation": "1945 F.C.R. 93",
      "treatment": "followed",
      "relevance": "Supports that trial without jurisdiction does not bar retrial."
    },
    {
      "case_name": "Budha Mal v. State of Delhi",
      "citation": "Criminal Appeal No. 17 of 1952, decided on October 3, 1952",
      "treatment": "followed",
      "relevance": "S. 403 CrPC applies only where acquittal by court of competent jurisdiction; without valid sanction, no jurisdiction to take cognizance."
    },
    {
      "case_name": "Basdeo v. Emperor",
      "citation": "A.I.R. 1945 All. 340",
      "treatment": "distinguished",
      "relevance": "Distinction between taking cognizance and jurisdiction in different factual context; not applicable to mandatory sanction cases."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 20(2)"
      ],
      "relevance": "No person shall be prosecuted and punished for the same offence more than once; no application where earlier proceedings null and void."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "Section 403(1)",
        "Section 190",
        "Section 191",
        "Section 192",
        "Section 529",
        "Section 530",
        "Section 236",
        "Section 237"
      ],
      "relevance": "Bar on retrial only if tried by court of competent jurisdiction and convicted/acquitted; no bar if no jurisdiction due to lack of sanction; s.530 voids proceedings by unempowered magistrate."
    },
    {
      "name": "Criminal Law Amendment Act, 1952",
      "sections": [
        "Section 6",
        "Section 7(1)",
        "Section 72"
      ],
      "relevance": "Special Judges for specified offences; offences triable only by special judges notwithstanding CrPC."
    },
    {
      "name": "Prevention of Corruption Act, 1947",
      "sections": [
        "Section 5(2)",
        "Section 6(1)"
      ],
      "relevance": "No court to take cognizance without previous sanction by competent authority."
    },
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "Section 161",
        "Section 165",
        "Section 165A"
      ],
      "relevance": "Offences requiring sanction for public servants."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The petitions under Article 32 for writs restraining prosecution and trial are dismissed. Earlier proceedings quashed for lack of valid sanction do not constitute trial by competent court, hence no bar under Art. 20(2) or s. 403 CrPC to fresh prosecution and trial.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"No person shall be prosecuted and punished for the same offence more than once.\"",
      "speaker": "court",
      "significance": "Quotes cl. 2 of Art. 20 relied on by petitioners, holds inapplicable."
    },
    {
      "text": "\"A person who has once been tried by a Court of competent jurisdiction for an offence and convicted or acquitted of such offence shall... not be liable to be tried again for the same offence.\"",
      "speaker": "court",
      "significance": "Quotes s. 403(1) CrPC; key to holding that no competent jurisdiction without sanction."
    },
    {
      "text": "The whole basis of s. 403(1) was that the first trial should have been before a Court competent to hear and determine the case and to record a verdict of conviction or acquittal.",
      "speaker": "court",
      "significance": "Crux of reasoning from Privy Council precedent."
    },
    {
      "text": "Section 403, Criminal Procedure Code, applies to cases where the acquittal order has been made by a Court of competent jurisdiction but it does not bar a retrial of the accused in cases where such an order has been made by a court which had no jurisdiction to take cognizance of the case.",
      "speaker": "court",
      "significance": "Direct quote from Budha Mal precedent applied."
    }
  ],
  "_case_id": "1957_107",
  "_label": 0,
  "_text_length": 13253,
  "_extracted_at": "2026-02-08T22:37:09.094427"
}