{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Bombay City v. Non-resident Company (Assessee)",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "S. K. Das J.",
      "J. L. Kapur J.",
      "Bhagwati J."
    ],
    "case_number": "Civil Appeal No. 29 of 1955",
    "date_of_judgment": "1957-10-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a non-resident company with head office in London and branches in India. It sells and publishes books and magazines in various parts of the world.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For the assessment year 1944-45, previous year ending 30th May 1943 or April 30, 1943, assessee submitted return adopting fixed percentage of marked price as cost of production for publications sold in India.",
      "type": "material",
      "date": "1943-05-30",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Income-tax Officer accepted the method subject to minor modifications and assessed income at Rs. 82,623.",
      "type": "procedural",
      "date": "1945-03-24",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Assessee appealed to Appellate Assistant Commissioner against disallowance of bad debt of Rs. 3,592.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Appellate Assistant Commissioner allowed bad debt claim but rejected method of accounting as not allowing proper deduction of profits, enhanced assessment to Rs. 1,11,616 using net world profit ratio applied to Indian turnover under proviso to s.13 and R.33.",
      "type": "procedural",
      "date": "1948-11-10",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "On total turnover of Rs. 16,01,973, gross profit 25.5%; world profit 37% on sales.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Assessee appealed to Tribunal; Tribunal remanded to AAC to allow proof of actual cost.",
      "type": "procedural",
      "date": "1950-04-29",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Bombay High Court decided K.F. Vakeel v. CIT; Tribunal held AAC had no jurisdiction to enhance.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Commissioner required Tribunal to refer questions to Bombay High Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Bombay High Court answered first two questions in negative, third did not arise, dated March 4, 1953.",
      "type": "procedural",
      "date": "1953-03-04",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Supreme Court granted special leave to appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether it is open to an Appellate Assistant Commissioner on appeal to reject the assessee's books of account, which have been accepted by the Income-tax Officer, purporting to act under proviso to s.13 when ITO accepted the method.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether it is open to an Appellate Assistant Commissioner on appeal to invoke the provisions of Rule 33 of the Indian Income-tax Rules for computing the income of a non-resident, the Income-tax Officer not having done so.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether it is open to an Appellate Assistant Commissioner on appeal to enhance an assessment in exercise of powers under s.31(3)(a) where as a result of definite information he is of opinion that income has been under-assessed.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "S.31 does not limit power of AAC to exclude power under proviso to s.13; AAC can reject method of accounting first time if income cannot be properly deduced; can use R.33; wide powers under s.31 allow enhancement.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "Sections 13, 31 Indian Income-tax Act 1922; Rule 33"
    },
    {
      "id": "pa2",
      "text": "Opinion of ITO under proviso to s.13 is not final; AAC has seisin of entire assessment on assessee's appeal.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Sections 13, 31"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Power to reject method under proviso to s.13 exclusive to ITO ('in the opinion of the Income-tax Officer'); AAC cannot substitute own opinion if ITO accepted method.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Proviso to s.13"
    },
    {
      "id": "ra2",
      "text": "AAC cannot invoke R.33 as it specifies 'Income-tax Officer'; distinction between objective and subjective determinations.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Rule 33; other sections like s.4A, s.10(2)(vi)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Proviso to s.13 imposes initial duty on ITO, but AAC under s.31 has wide powers to confirm, reduce, enhance or annul assessment; can revise method of accounting even if ITO accepted it.",
      "addresses_issue": "i1",
      "key_observation": "No limitation in s.13 on AAC powers; AAC is revising authority over entire assessment process."
    },
    {
      "id": "cr2",
      "text": "Same reasoning applies to R.33; expression 'Income-tax Officer' does not exclude AAC.",
      "addresses_issue": "i2",
      "key_observation": "AAC exercises same powers as ITO when seised of appeal."
    },
    {
      "id": "cr3",
      "text": "Bhagwati J. (separate judgment): Power under proviso to s.13 exclusive to ITO; AAC cannot exercise it first time.",
      "addresses_issue": "i1",
      "key_observation": "Determination by named authority (ITO) is condition precedent; AAC bound by s.13 main provision if ITO accepts."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "AAC can reject assessee's method of accounting under proviso to s.13 for first time on assessee's appeal, even if ITO accepted it.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "AAC can invoke R.33 to compute non-resident's income even if ITO did not.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "K. F. Vakeel v. Commissioner of Income-tax",
      "citation": "I.T. Reference No. 21 of 1950, Bombay High Court",
      "treatment": "distinguished",
      "relevance": "Held AAC/Tribunal cannot reject method first time; but SC holds decision correct on facts but reasons partly incorrect."
    },
    {
      "case_name": "M/s. Narrondas Manordass v. Commissioner of Income-tax",
      "citation": "1957 31 I.T.R. 909",
      "treatment": "followed",
      "relevance": "AAC has wide revising powers over entire assessment process."
    },
    {
      "case_name": "Commissioner of Income-tax v. Sarangpur Cotton Manufacturing Co. Ltd.",
      "citation": "A.I.R. 1938 P.C. 108",
      "treatment": "followed",
      "relevance": "ITO must examine if true profits deductible from method; failure to do so allows higher authorities to intervene."
    },
    {
      "case_name": "Oriental Building and Furnishing Co. v. Commissioner of Income-tax",
      "citation": "1952 21 I.T.R. 105",
      "treatment": "followed",
      "relevance": "Tribunal has wide powers under s.33."
    },
    {
      "case_name": "Pearey Lal Shukla In re",
      "citation": "1942 10 I.T.R. 239",
      "treatment": "referred",
      "relevance": "AAC can interfere with ITO's computation under proviso to s.13."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 13",
        "Section 31",
        "Section 30",
        "Section 33B",
        "Section 23",
        "Section 5"
      ],
      "relevance": "Governs method of accounting, powers of AAC to enhance/reject method, appellate jurisdiction."
    },
    {
      "name": "Indian Income-tax Rules, 1922",
      "sections": [
        "Rule 33"
      ],
      "relevance": "Computation of non-resident's income by percentage of turnover or world profit ratio."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; Bombay High Court judgment set aside; questions 1 and 2 answered in affirmative in favour of Revenue; parties to bear own costs throughout due to difficulty of interpretation.",
    "relief_granted": "Questions answered for Revenue, restoring AAC's jurisdiction.",
    "costs": "Parties bear their own costs throughout."
  },
  "key_quotes": [
    {
      "text": "\"the Appellate Assistant Commissioner has been constituted a revising authority... once the appeal is before him he can revise not only the ultimate computation arrived at by the Income-tax Officer but he can revise every process which led to the ultimate computation.\"",
      "speaker": "court",
      "significance": "Defines wide powers of AAC under s.31."
    },
    {
      "text": "\"Income, profits and gains shall be computed... in accordance with the method of accounting regularly employed by the assessee Provided that... in the opinion of the Income-tax Officer, the income, profits and gains cannot properly be deduced therefrom...\"",
      "speaker": "court",
      "significance": "Key provision interpreted; proviso not exclusive to ITO."
    },
    {
      "text": "\"It is for the Income-tax Officer, who is the assessing officer, to be dissatisfied with the method of accounting regularly adopted by the assessee.\"",
      "speaker": "lower_court",
      "significance": "Bombay HC view in Vakeel case, distinguished by SC."
    }
  ],
  "_case_id": "1957_146",
  "_label": 1,
  "_text_length": 102344,
  "_extracted_at": "2026-02-10T19:24:27.379740"
}