{
  "metadata": {
    "case_name": "Appellant (Copra Oil Manufacturer) v. Sales Tax Officer, 2nd Circle, Quilon",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI J."
    ],
    "case_number": "Civil Appeal No. 232 of 1955",
    "date_of_judgment": "1957-04-02"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a registered manufacturer of coconut oil and cake who has obtained a certificate of registration in Form VI as per sub-r. (i) of r. 20 of the Travancore-Cochin General Sales Tax Rules, 1950.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The business of the appellant consisted in the purchase of copra, manufacture of coconut oil and cake and sale of the same to parties inside the State of Travancore-Cochin and sale of the oil to parties outside the State.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In the year 1951-52 (1st April, 1951 to 31st March, 1952), the appellant purchased copra of the value of Rs. 7,16,048-1-4.",
      "type": "material",
      "date": "1951-04-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After manufacturing oil therefrom, the appellant sold the oil partly in the State (value Rs. 3,08,902-6-10) and partly outside the State (value Rs. 3,67,816-10-1), total oil sold Rs. 6,76,719-0-11, and the cake entirely within the State (value Rs. 67,155-15-5).",
      "type": "material",
      "date": "1951-04-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The total gross turnover of the appellant was Rs. 14,59,923-1-8.",
      "type": "material",
      "date": "1951-04-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant claimed to deduct the whole purchase price of copra Rs. 7,16,048-1-4 under r. 7(i)(k) read with r. 20, arriving at net turnover of Rs. 7,43,875-0-4, and further deduct Rs. 3,67,816-10-1 (inter-State sales of oil), showing net assessable turnover of Rs. 3,76,058-6-3.",
      "type": "disputed",
      "date": "1951-04-01",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The Sales Tax Officer fixed net assessable turnover at Rs. 7,54,144-8-4 by taking copra purchase Rs. 7,16,048-1-4, adding inside State oil Rs. 3,08,902-6-10 and cake Rs. 67,155-15-5, deducting copra corresponding to inside oil Rs. 3,35,216-0-0, adding gum price Rs. 3,385-0-3, deducting sales tax collected Rs. 6,130-15-6.",
      "type": "disputed",
      "date": "1951-04-01",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Appellant appealed to Assistant Sales Tax Commissioner (S.T.A. No. 1480 of 1953-54), dismissed on May 10, 1954.",
      "type": "procedural",
      "date": "1954-05-10",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Further petition to Government dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant filed Original Petition No. 53 of 1954 in High Court of Travancore-Cochin under Art. 226 for quashing STO order, dismissed on November 24, 1954.",
      "type": "procedural",
      "date": "1954-11-24",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appeal to Supreme Court under Art. 132 with certificate of fitness.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, for calculating net assessable turnover of a registered manufacturer under Travancore-Cochin General Sales Tax Act and Rules, inter-State sales of oil and corresponding copra purchases are to be entirely excluded from gross turnover due to s. 26 incorporating Art. 286, or whether full copra purchase can be deducted against total oil sales followed by deduction of inter-State sales value.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Entitled to include total value of oil sold (inside and outside State) Rs. 6,76,719-0-11 in gross turnover and deduct total copra purchase value Rs. 7,16,048-1-4 under r. 7(i)(k) read with r. 20, then deduct inter-State sales Rs. 3,67,816-10-1 under s. 26.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "r. 7(i)(k), r. 20 Travancore-Cochin General Sales Tax Rules, 1950; s. 26 Travancore-Cochin General Sales Tax Act, 1125; strict letter of fiscal statutes"
    },
    {
      "id": "pa2",
      "text": "In fiscal statutes, regard must be had to strict letter of law, not spirit; taxpayer not liable by analogy.",
      "supporting_facts": [],
      "legal_basis": "Inland Revenue Commissioners v. Duke of Westminster; Partington v. Attorney General; Bank of Chettinad v. Income Tax Commissioner"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Inter-State sales of oil cannot be included in turnover at all, nor can corresponding copra purchase value be deducted; exclude both entirely from calculations due to s. 26 non-obstante clause.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "s. 26 Travancore-Cochin General Sales Tax Act, 1125 (incorporating Art. 286 Constitution)"
    },
    {
      "id": "ra2",
      "text": "Provisions intend taxation at purchase point of copra, avoiding double tax on oil sales; concession under r. 20 only where both purchase and sales tax would otherwise apply.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "s. 2(j), 2(k), r. 4, r. 7, r. 20 Travancore-Cochin General Sales Tax Act and Rules"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Definitions of 'sale' (s. 2(j)) and 'turnover' (s. 2(k)) include all sales inside/outside; gross turnover under r. 4 includes all sales; net under r. 7 deducts copra under cl. (k) r. 20 if oil sales included, without distinction inside/outside.",
      "addresses_issue": "i1",
      "key_observation": "Prima facie, full deduction allowed pre-s. 26."
    },
    {
      "id": "cr2",
      "text": "s. 26 non-obstante clause sets aside inconsistent provisions; takes inter-State sales out of Act's purview entirely, obliterating charging s. 3 and r. 20 for those sales; cannot include in turnover, no deduction for corresponding copra.",
      "addresses_issue": "i1",
      "key_observation": "No liability to tax means exclusion from gross/net turnover calculation."
    },
    {
      "id": "cr3",
      "text": "Distinction between no-liability (exclusion from turnover) and exemption (deduct from taxable turnover); s. 26 enacts no-liability for inter-State sales.",
      "addresses_issue": "i1",
      "key_observation": "Three stages of tax: declaration of liability first; no liability, no assessment."
    },
    {
      "id": "cr4",
      "text": "Strict construction of fiscal statutes required; but provisions clearly exclude inter-State sales from Act.",
      "addresses_issue": "i1",
      "key_observation": "High Court correct in purpose: avoid double tax only where both applicable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s. 26 takes inter-State sales out of purview of Act; value not included in gross turnover; no deduction under r. 20 for corresponding copra; STO's calculation of net assessable turnover correct.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Inland Revenue Commissioners v. Duke of Westminster",
      "citation": "1936 A.C. 1, 24",
      "treatment": "followed",
      "relevance": "Strict letter of fiscal law; no tax by analogy or spirit."
    },
    {
      "case_name": "Partington v. Attorney General",
      "citation": "1869 4 H.L. 100, 122",
      "treatment": "followed",
      "relevance": "Principle of fiscal legislation: within letter, taxed; outside, free."
    },
    {
      "case_name": "Bank of Chettinad v. Income Tax Commissioner",
      "citation": "A.I.R. 1940 P.C. 183",
      "treatment": "followed",
      "relevance": "Protest against substance over strict legal position in revenue cases."
    },
    {
      "case_name": "F. L. Smidth Co. v. F. Greenwood",
      "citation": "VIII T.C. 193, 206",
      "treatment": "referred",
      "relevance": "Strict construction in fiscal statutes."
    },
    {
      "case_name": "Aswani Kumar Ghosh v. Arabinda Bose",
      "citation": "1953 S.C.R. 1, 21, 22",
      "treatment": "followed",
      "relevance": "Construction of non-obstante clause: sets aside inconsistent prior provisions."
    },
    {
      "case_name": "Chatturam Horilram Ltd. v. Commissioner of Income-Tax",
      "citation": "1955 2 S.C.R. 290, 297",
      "treatment": "distinguished",
      "relevance": "Three stages of tax imposition; but requires prior liability declaration."
    }
  ],
  "statutes_cited": [
    {
      "name": "Travancore-Cochin General Sales Tax Act, 1125 (Act XI of 1125 M.E.)",
      "sections": [
        "s. 2(j)",
        "s. 2(k)",
        "s. 3",
        "s. 4",
        "s. 24",
        "s. 26"
      ],
      "relevance": "Definition of sale/turnover; charging section; rules power; non-obstante barring tax on inter-State sales per Art. 286."
    },
    {
      "name": "Travancore-Cochin General Sales Tax Rules, 1950",
      "sections": [
        "r. 4",
        "r. 7(i)(k)",
        "r. 20"
      ],
      "relevance": "Gross turnover as sales/purchases; net turnover deductions; copra deduction for registered manufacturers if oil sales included."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 132",
        "Art. 226",
        "Art. 286"
      ],
      "relevance": "Appeal certificate; writ petition; restrictions on State sales tax for inter-State etc."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed, upholding the High Court's order dismissing the writ petition and affirming the Sales Tax Officer's assessment of net assessable turnover at Rs. 7,54,144-8-4 by excluding inter-State oil sales and corresponding copra purchases from turnover calculations.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"I confess that I view with disfavour the doctrine that in taxation cases the subject is to be taxed if in accordance with a Courts view of what it considers the substance of the transaction, the Court thinks that the case falls within the contemplation or spirit of the statute.\"",
      "speaker": "court",
      "significance": "Emphasizes strict literal construction of fiscal statutes."
    },
    {
      "text": " \"Notwithstanding anything contained in this Act - ... a tax on the sale or purchase of goods shall not be imposed under this Act ... where such sale or purchase takes place in the course of inter-State trade or commerce...\"",
      "speaker": "court",
      "significance": "Key non-obstante provision excluding inter-State sales from Act."
    },
    {
      "text": "\"s. 26 of the Act, in cases falling within the categories specified under Art. 286 of the Constitution has the effect of setting at naught and of obliterating in regard thereto the provisions contained in the Act relating to the imposition of tax...\"",
      "speaker": "court",
      "significance": "Court's holding on effect of s. 26."
    }
  ],
  "_case_id": "1957_9",
  "_label": 0,
  "_text_length": 33067,
  "_extracted_at": "2026-02-08T22:35:06.766726"
}