{
  "metadata": {
    "case_name": "Head Clerk, Civil Surgeon's Office, Almora v. State of Uttar Pradesh",
    "case_year": 1955,
    "court": "Supreme Court of India",
    "judges": [
      "Govinda Menon, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Police charge sheet dated November 13, 1949, alleged that appellant, Head Clerk of Civil Surgeon's office at Almora, misappropriated Rs. 1,118-10-9 entrusted to him between September 26, 1947, and February 11, 1948, under s. 409 IPC.",
      "type": "material",
      "date": "1949-11-13",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Trial court acquitted accused due to improper and unsatisfactory state of accounts in Civil Surgeon's office, for which accused and two successive Civil Surgeons were responsible.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "State appealed to High Court of Allahabad, which by judgment dated June 7, 1954, set aside acquittal, convicted accused under s. 409 IPC, sentenced to 3 months rigorous imprisonment.",
      "type": "procedural",
      "date": "1954-06-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Special leave to appeal granted by Supreme Court on July 30, 1954 under Article 136 of Constitution.",
      "type": "procedural",
      "date": "1954-07-30",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Alleged misappropriation detected in March 1948 when Messrs May Baker Ltd. sent reminder for unpaid bills to Civil Surgeon, Almora.",
      "type": "material",
      "date": "1948-03",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Civil Surgeon Dr. Kar enquired; appellant was on leave; appellant sent letter Exhibit P-8 on March 5, 1948, containing statements alleged to show guilt.",
      "type": "material",
      "date": "1948-03-05",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Money alleged misappropriated recovered from appellant and paid in March 1948 to firms whose bills were shown as paid in accounts.",
      "type": "material",
      "date": "1948-03",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Deputy Commissioner Almora ordered police investigation in June 1949; charge-sheet filed November 13, 1949.",
      "type": "procedural",
      "date": "1949-06",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Case registered in court of S.D.M. Almora on August 7, 1950 under s. 409 IPC.",
      "type": "procedural",
      "date": "1950-08-07",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Multiple adjournments; on November 30, 1950, Magistrate dismissed case under s. 249 CrPC to record room pending documents from Accountant-General.",
      "type": "procedural",
      "date": "1950-11-30",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "District Government Counsel applied June 4, 1951 to summon witnesses; proceedings transferred to Judicial Officer Almora; witnesses examined from June 16, 1951 onwards: PW1 Shib Lal Tewari (June 16), PW2 Bishun Singh and PW3 Mohan Singh (Aug 21), PW4 Shiv Lal Sah and PW5 D.N. Pandey (Oct 25), PW6 Hira Lal (Nov 10).",
      "type": "procedural",
      "date": "1951-06-04",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Prosecution applied September 1, 1951 for commission to examine Dr. D.M. Kar, R.P. Kapoor, D.N. Pandey; letters from Civil Surgeon and Accountant-General on summons issues; applications for interrogatories from October-November 1951; accused objected to leading questions; Magistrate ordered modifications.",
      "type": "procedural",
      "date": "1951-09-01",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Defence: undisbursed amounts kept in office safe and disbursed later, though cash books showed earlier disbursements; no dominion over money by appellant.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Key witnesses (two Civil Surgeons, auditor R.P. Kapoor) examined on commission via interrogatories, despite prosecution and accused desiring court examination.",
      "type": "procedural",
      "date": "1951-10-26",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Magistrate issued commissions himself on November 19, 1951 without application to District Magistrate as per s.503(2) CrPC; forwarded via District Magistrate Almora who merely forwarded without judicial order.",
      "type": "procedural",
      "date": "1951-11-19",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the examination of important prosecution witnesses on commission by interrogatories, without following procedure under s.503 CrPC and without sufficient justification, vitiates the trial and renders it unfair.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Magistrate properly issued commissions without applying to District Magistrate under s.503(2) CrPC, and whether there was unreasonable delay, expense or inconvenience justifying departure from examining witnesses in open court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Defence that undisbursed amounts were kept in safe and disbursed later, so no misappropriation; case protracted since 1948 causing harassment; important witnesses should be examined in court, not on commission.",
      "supporting_facts": [
        "f13",
        "f10",
        "f12",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Objection to leading questions in interrogatories for Dr. Kar; requested personal appearance and cross-examination in court.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Criminal Procedure Code"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Prosecution relied on Ex. P-8 showing guilt; applied for commissions due to case delay; insisted presence of key witnesses necessary but proceeded with interrogatories.",
      "supporting_facts": [
        "f6",
        "f7",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Cardinal principle that evidence against accused must be recorded in presence and open court to challenge, observe demeanour, effective cross-examination; commission only in exceptional cases of unreasonable delay/expense/inconvenience.",
      "addresses_issue": "i1",
      "key_observation": "No justification shown for commissions; key witnesses (Civil Surgeons, auditor) foundational, should have been examined in court."
    },
    {
      "id": "cr2",
      "text": "s.503 CrPC (pre-1955) required subordinate Magistrate to apply to District Magistrate for commission; here Magistrate issued himself without application; District Magistrate merely forwarded, no judicial order.",
      "addresses_issue": "i2",
      "key_observation": "Non-compliance with s.503(2) goes to root, vitiates proceedings; evidence on commission inadmissible."
    },
    {
      "id": "cr3",
      "text": "No attempt to summon witnesses first; mere delay in case not ground for commission; interrogatories especially improper for key witnesses.",
      "addresses_issue": "i1",
      "key_observation": "Accused denied fair trial."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Important witnesses must be examined in court; commissions via interrogatories only in extreme cases; procedure under s.503 CrPC mandatory.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Issuance of commission without District Magistrate's judicial order vitiates evidence taken thereon.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Entire proceedings vitiated; evidence of witnesses on commission completely eschewed.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Queen-Empress v. T. Burke",
      "citation": "I.L.R. 1884 6 All. 224",
      "treatment": "followed",
      "relevance": "Not proper to take evidence of important prosecution witness on commission merely for witness inconvenience."
    },
    {
      "case_name": "Mohammad Shafi v. Emperor",
      "citation": "A.I.R. 1932 Patna 242",
      "treatment": "followed",
      "relevance": "ss.503 and 506 CrPC to be used sparingly and only in clearest cases."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "409"
      ],
      "relevance": "Charge of criminal breach of trust by public servant."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "249",
        "503",
        "506",
        "507"
      ],
      "relevance": "Dismissal of case; procedure for commissions and interrogatories; improperly followed."
    },
    {
      "name": "Code of Criminal Procedure (Amendment) Act, 1955",
      "sections": [
        "97"
      ],
      "relevance": "Amended s.503 to allow any Magistrate to issue commission, but pre-amendment rules applied."
    },
    {
      "name": "Evidence Act",
      "sections": [
        "33",
        "123"
      ],
      "relevance": "Mentioned in letters re: medical officers and unpublished records privilege."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "136"
      ],
      "relevance": "Special leave to appeal."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court held trial vitiated due to improper issuance of commissions for key witnesses without following s.503(2) CrPC; evidence thereon inadmissible; set aside High Court conviction and trial court proceedings.",
    "relief_granted": "Appeal allowed; conviction set aside; proceedings vitiated.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is an established cardinal principle of Criminal jurisprudence... that in criminal proceedings the evidence against the accused should be recorded in his presence and in open court...",
      "speaker": "court",
      "significance": "Core principle justifying quashing trial for lack of open court evidence."
    },
    {
      "text": "The entire proceedings are vitiated and the evidence of the witnesses taken on commission will have to be completely eschewed from the record.",
      "speaker": "court",
      "significance": "Final holding on procedural defect rendering trial invalid."
    },
    {
      "text": "Important witnesses on whose testimony the case against the accused person has to be established, must be examined in court...",
      "speaker": "court",
      "significance": "Rule limiting commissions to non-essential witnesses."
    }
  ],
  "_case_id": "1957_1",
  "_label": 1,
  "_text_length": 27051,
  "_extracted_at": "2026-02-10T19:21:51.660787"
}