{
  "metadata": {
    "case_name": "Appellant (Owner of Bankura and Kharagpur Forests) v. Commissioner of Income-tax",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant was the owner of the Bankura forest in West Bengal and the Kharagpur forest in the Monghyr District in Bihar during the assessment years 1943-44 to 1948-49.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Bankura forest was leased out by auction on short terms for lump sums. Lessee entitled to cut down and remove all sal trees but not those more than three feet in girth and three feet from the ground, and all other jungle trees other than fruit bearing trees and valuable timber trees. Lessee to cut stumps not higher than five inches over ground so new shoots may grow, refrain from entering forests during rains, guard from trespassing by men and cattle. On conclusion of period, lessee loses all rights.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant received specific receipts from Bankura forest: Rs. 7,436 (1349 Fasli), Rs. 23,581 (1350 Fasli), Rs. 20,582 (1351 Fasli), Rs. 14,750 (1352 Fasli), Rs. 13,836 (1353 Fasli), Rs. 22,211 (1354 Fasli); and from Kharagpur forest: Rs. 11,468 (1349 Fasli), Rs. 17,027 (1350 Fasli), Rs. 59,514 (1351 Fasli), Rs. 98,969 (1352 Fasli), Rs. 1,17,173 (1353 Fasli), Rs. 73,449 (1354 Fasli).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Kharagpur forest income from bamboos, sabai grass, and timber, all grown wild and spontaneously.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f5",
      "text": "For bamboos in Kharagpur: 1944 working plan for felling mature bamboo trees in rotation from sub-divided compartments. No human agency responsible for plantation or growth.",
      "type": "material",
      "date": "1944",
      "source": "tribunal"
    },
    {
      "id": "f6",
      "text": "Sabai grass in Kharagpur position similar to bamboos, spontaneous growth.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f7",
      "text": "For timber in Kharagpur: Scheme conserving sal and ebony trees by allowing each a circle of 15 feet, clearing jungle within. Wells sunk for drinking water for cartmen and bullocks, not for trees.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f8",
      "text": "Evidence of coppice work: Government report dated 5th October 1882 suggesting private owners take up coppice forests; letter No. 170 dated 14th April 1883 to Manager, Darbhanga Raj; 1944 correspondence proposing coppice types of sal trees on rocky hills worked in 7 years. No human agency for production from soil, some assistance to growth.",
      "type": "material",
      "date": "1882-10-05",
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "Assessment orders made under section 23 of Indian Income-tax Act on 15th March 1944, 9th March 1945, 27th March 1946, 12th March 1947, 13th March 1948, 24th February 1946, rejecting contentions that receipts were capital receipts or agricultural income.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeals to Appellate Assistant Commissioner or Additional AAC, Patna, dismissed, assessments confirmed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Further appeals to Income-tax Appellate Tribunal, Calcutta Bench, rejected, assessments confirmed.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f12",
      "text": "Tribunal refused reference under section 66(1) to High Court, holding no question of law arose.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f13",
      "text": "High Court directed Tribunal under section 66(2) to state case on the questions.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f14",
      "text": "Tribunal stated case to High Court.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f15",
      "text": "High Court answered questions in negative against appellant.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f16",
      "text": "Appellant obtained certificates under section 66A for appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in the facts and circumstances of the case, the receipts of Bankura forest lease are capital receipts or, in the alternative, constitute agricultural income?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether in the facts and circumstances of the case, the receipts from Kharagpur forest are agricultural income?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The receipts from Bankura and Kharagpur forests were not taxable as they were either capital receipts or agricultural income.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Section 2(1) of the Indian Income-tax Act (definition of agricultural income)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The receipts were taxable income, not capital receipts and not agricultural income, as there was no expenditure of human skill and labour upon the land.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Section 2(1) of the Indian Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court right that no material to hold expenditure of human skill and labour upon the land to constitute agricultural income. Conservation by 15 feet circles, clearing jungle, conservancy staff not sufficient per Privy Council in Raja Mustafa Ali Khan.",
      "addresses_issue": "i1",
      "key_observation": "No basic operations in agriculture performed on soil."
    },
    {
      "id": "cr2",
      "text": "Principles from CIT WB v. Raja Benoy Kumar Sahas Roy: Forest trees of spontaneous growth, unaided by human skill/labour, no basic agricultural operations on soil. Only subsequent forestry operations for conservation/growth, not basic operations essential to agriculture.",
      "addresses_issue": "i2",
      "key_observation": "Operations had nothing in common with basic agricultural operations, did not convert spontaneous produce to agricultural produce."
    },
    {
      "id": "cr3",
      "text": "Operations performed by assessee had nothing in common with basic agricultural operations and did not have effect of converting forest produce of spontaneous growth into produce raised by agriculture.",
      "addresses_issue": "i1",
      "key_observation": "Subsequent operations nursing growth but not part of basic operations."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Receipts from Bankura forest lease are neither capital receipts nor agricultural income.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Receipts from Kharagpur forest are not agricultural income.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Raja Mustafa Ali Khan v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "referred",
      "relevance": "Dictum on expenditure of human skill and labour upon land for agricultural income."
    },
    {
      "case_name": "Commissioner of Income-tax, West Bengal v. Raja Benoy Kumar Sahas Roy",
      "citation": null,
      "treatment": "followed",
      "relevance": "Principles governing forestry operations on spontaneous growth trees: no cultivation without basic operations on soil; subsequent operations not agricultural."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 2(1)",
        "Section 23",
        "Section 66(1)",
        "Section 66(2)",
        "Section 66A"
      ],
      "relevance": "Definition of agricultural income; assessment orders; references to High Court and Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the six consolidated appeals, confirming the High Court's answers to the referred questions in the negative and against the appellant, holding the receipts neither capital nor agricultural income.",
    "relief_granted": null,
    "costs": "with costs"
  },
  "key_quotes": [
    {
      "text": "in regard to the forest trees of spontaneous growth, which grow on the soil unaided by any human skill and labour and where no basic operations in agriculture are performed upon the soil itself by the assessee, there is no cultivation of the soil at all.",
      "speaker": "court",
      "significance": "Defines when forest produce is not agricultural income."
    },
    {
      "text": "These subsequent operations though they may have the effect of nursing and fostering the growth of such forest trees have nothing in common with the basic operations which are the efficient cause of raising these products from the soil.",
      "speaker": "court",
      "significance": "Distinguishes basic vs. subsequent operations in agriculture."
    }
  ],
  "_case_id": "1957_82",
  "_label": 0,
  "_text_length": 9696,
  "_extracted_at": "2026-02-08T22:36:43.241983"
}