{
  "metadata": {
    "case_name": "State and Mahesh Desai v. Patna High Court",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Jagannadhadas, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Murder of Nand Kumar Chaubey, a peon of Bagdigi colliery, committed in the course of a serious riot on February 20, 1954, resulting from differences between two rival labour-unions in connection with a strike.",
      "type": "material",
      "date": "1954-02-20",
      "source": "first_information"
    },
    {
      "id": "f2",
      "text": "Prosecution launched on first information of Ram Naresh Pandey against 28 persons, including Mahesh Desai under s. 302/109 IPC for abetting the murder by speeches and exhortations at meetings or group-talks the day previous to the murder.",
      "type": "background",
      "date": null,
      "source": "first_information"
    },
    {
      "id": "f3",
      "text": "Mahesh Desai held meetings advocating closing Bagdigi cable plant and colliery plant and assaulting dalals; on Friday morning told labourers to stop work; evening meeting at 6:30 p.m. exhorted 120-125 labourers to prevent work resumption and remain prepared; near pit No. 10 said 'It is necessary for us to finish the dalals for achieving victory. You remain prepared for this.' and to Phagu, Jalo and Haricharan Dusadh 'Finish all. What will happen will be seen.'",
      "type": "disputed",
      "date": "1954-02-19",
      "source": "first_information"
    },
    {
      "id": "f4",
      "text": "Phagu Dusadh, Jalo Dusadh, Haricharan Dusadh and others chased Nand Kumar Chaubey, Phagu gave pharsa blow, Haricharan lathi blow, causing death.",
      "type": "material",
      "date": "1954-02-20",
      "source": "first_information"
    },
    {
      "id": "f5",
      "text": "Application for withdrawal by Public Prosecutor against Mahesh Desai only on December 6, 1954, when matter pending before Subordinate Judge-Magistrate of Dhanbad in commitment stage, before any evidence taken.",
      "type": "procedural",
      "date": "1954-12-06",
      "source": "public_prosecutor"
    },
    {
      "id": "f6",
      "text": "Ground for withdrawal: evidence available not just and expedient to proceed, evidence regarding complicity meagre, only single item of dubious nature unlikely to establish prima facie case.",
      "type": "procedural",
      "date": null,
      "source": "public_prosecutor"
    },
    {
      "id": "f7",
      "text": "Magistrate granted consent, discharged Mahesh Desai.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Order upheld by Sessions Judge on revision petition by first informant Ram Naresh Pandey and widow of deceased.",
      "type": "procedural",
      "date": null,
      "source": "sessions_judge"
    },
    {
      "id": "f9",
      "text": "High Court Chief Justice set aside order in revision, directed Magistrate to record evidence and consider if prima facie case against Mahesh Desai.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f10",
      "text": "Appeals to Supreme Court by Advocate-General of State and Mahesh Desai by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, where application for withdrawal under s.494 CrPC made on ground of insufficiency or meagreness of reliable evidence, it is improper exercise of discretion for Court to grant consent before evidence taken, if reasonably satisfied that evidence unlikely to result in conviction.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether s.494 CrPC applicable in commitment stage of Sessions case triable by Court of Session.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "View of High Court Chief Justice based on erroneous appreciation of legally permissible approach under s.494 CrPC; likely to have repercussions beyond this case.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "s.494 CrPC"
    },
    {
      "id": "pa2",
      "text": "s.494 gives general executive discretion to Public Prosecutor to withdraw subject to Court consent, determined on many possible grounds; Court satisfies itself that executive function not improperly exercised or attempt to interfere with normal course of justice for illegitimate reasons.",
      "supporting_facts": [],
      "legal_basis": "s.494 CrPC; Bawa Faqir Singh v. The King Emperor (1938) L.R. 65 I.A. 388"
    },
    {
      "id": "pa3",
      "text": "Public Prosecutor bound to assist Court with fairly-considered view; primary responsibility for prosecution on executive.",
      "supporting_facts": [],
      "legal_basis": "s.494 CrPC"
    },
    {
      "id": "pa4",
      "text": "Court discretion under s.494 not requiring prima facie determination on judicial evidence; not to hold preliminary inquiry; wide language not to be narrowed.",
      "supporting_facts": [],
      "legal_basis": "s.494 CrPC; ss.202, 209, 253 CrPC"
    },
    {
      "id": "pa5",
      "text": "Withdrawal possible for reasons not confined to judicial prospects of prosecution.",
      "supporting_facts": [],
      "legal_basis": "The King v. Moule Bux AIR 1949 Pat 233 (FB); The King v. Parmanand AIR 1949 Pat 222 (FB)"
    },
    {
      "id": "pa6",
      "text": "s.494 applicable at commitment stage in Sessions cases; no discrimination between jury and non-jury cases; historical evolution confirms wide scope.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "s.494 CrPC; history from 1872, 1882, 1898 Codes"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Evidence requires judicial consideration; procedure followed tantamount to considering sufficiency before evidence heard; function surrendered to Public Prosecutor; s.494 does not justify such procedure.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "s.494 CrPC"
    },
    {
      "id": "ra2",
      "text": "Where withdrawal on ground of no/insufficient evidence, Court must exercise judicial function on judicially recorded evidence or hold preliminary inquiry; cannot grant consent without.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.494 CrPC; s.202 CrPC"
    },
    {
      "id": "ra3",
      "text": "In Sessions case, withdrawal under s.494 not lie in commitment stage; only after reaches trial stage, as per wording 'tried by jury before return of verdict' and 'in other cases before judgment'; 'tried' excludes inquiry.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "s.494 CrPC; s.4(k) CrPC; English nolle prosequi"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.494 enabling section vesting discretion in Public Prosecutor to apply for consent; Court exercises judicial discretion but not only on material gathered by judicial method; initiative with Prosecutor, Court gives consent not determine judicially.",
      "addresses_issue": "i1",
      "key_observation": "General executive discretion subject to consent on many grounds; Court checks if improperly exercised or abuse of justice."
    },
    {
      "id": "cr2",
      "text": "Public Prosecutor officer of Court bound to assist with fair view; executive responsibility for investigation and prosecution; Magistrate's role supplementary to prevent abuse.",
      "addresses_issue": "i1",
      "key_observation": "s.494 in line with scheme, not requiring prima facie determination like ss.209,253."
    },
    {
      "id": "cr3",
      "text": "Consent not lightly given; scrutinize grounds; but where on insufficiency of evidence, Court can grant before recording if satisfied on available material unlikely to convict; no need for preliminary inquiry.",
      "addresses_issue": "i1",
      "key_observation": "Available evidence (FIR, police statements) to be considered to check impropriety."
    },
    {
      "id": "cr4",
      "text": "s.494 applies to commitment stage in Sessions cases; wide wording covers all stages before judgment/verdict; no limitation to post-inquiry; history confirms.",
      "addresses_issue": "i2",
      "key_observation": "'Tried' and 'judgment' not limited; applies to inquiry stages."
    },
    {
      "id": "cr5",
      "text": "On merits, material (FIR) shows exhortations not clearly personal knowledge; depends on Jadubans Tiwary etc., meagre; no better material shown; no impropriety in Prosecutor's view.",
      "addresses_issue": "i1",
      "key_observation": "High Court should not have interfered."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Court may grant consent under s.494 CrPC before evidence on ground of insufficient evidence if reasonably satisfied on available material that unlikely to result in conviction.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "s.494 CrPC applicable at commitment/inquiry stage in Sessions cases.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bawa Faqir Singh v. The King Emperor",
      "citation": "(1938) L.R. 65 I.A. 388, 395",
      "treatment": "followed",
      "relevance": "s.494 gives general executive discretion to Public Prosecutor subject to Court consent on many grounds."
    },
    {
      "case_name": "The King v. Moule Bux",
      "citation": "A.I.R. 1949 Pat. 233 (F.B.)",
      "treatment": "referred",
      "relevance": "Withdrawal legitimately for reasons not confined to judicial prospects."
    },
    {
      "case_name": "The King v. Parmanand",
      "citation": "A.I.R. 1949 Pat. 222, 226 (F.B.)",
      "treatment": "referred",
      "relevance": "Withdrawal legitimately for reasons not confined to judicial prospects."
    },
    {
      "case_name": "Giribala Dasee v. Madar Gazi",
      "citation": "1932 I.L.R. 60 Cal. 233",
      "treatment": "followed",
      "relevance": "s.494 covers inquiry stages."
    },
    {
      "case_name": "Viswanadham v. Madan Singh",
      "citation": "I.L.R. 1949 Mad. 64",
      "treatment": "followed",
      "relevance": "s.494 covers inquiry stages."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "494",
        "435",
        "436",
        "439",
        "417",
        "61",
        "167",
        "96",
        "164",
        "155(2)",
        "202",
        "209(1)",
        "209(2)",
        "253(1)",
        "253(2)",
        "333",
        "4(k)"
      ],
      "relevance": "Governs withdrawal by Public Prosecutor with Court consent, resulting in discharge/acquittal; judicial discretion without full trial; applicable at all pre-judgment stages including commitment."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "302/109"
      ],
      "relevance": "Prosecution for murder and abetment thereof."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed appeals by State and Mahesh Desai, set aside Patna High Court Chief Justice's order, restored Magistrate's order granting consent to withdrawal and discharging Mahesh Desai.",
    "relief_granted": "Discharge of Mahesh Desai restored.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Section 494 of the Code of Criminal Procedure gives a general executive discretion to the Public Prosecutor to withdraw from the prosecution subject to the consent of the Court, which may be determined on many possible grounds.\"",
      "speaker": "court",
      "significance": "Defines scope of s.494 as executive discretion checked judicially."
    },
    {
      "text": "\"This is not a case where there is no evidence on the contrary, this is a case where there is evidence which requires judicial consideration.\"",
      "speaker": "high_court",
      "significance": "High Court's erroneous view overturned by Supreme Court."
    },
    {
      "text": "\"The judicial function, therefore implicit in the exercise of the judicial discretion for granting the consent would normally mean that the Court has to satisfy itself that the executive function of the Public Prosecutor has not been improperly exercised.\"",
      "speaker": "court",
      "significance": "Court's role in granting consent under s.494."
    }
  ],
  "_case_id": "1957_0",
  "_label": 1,
  "_text_length": 30587,
  "_extracted_at": "2026-02-10T19:21:57.684351"
}