{
  "metadata": {
    "case_name": "Appellants v. Respondent (State of Uttar Pradesh)",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "IMAM, J."
    ],
    "case_number": "Civil Appeal No. 100 of 1957",
    "date_of_judgment": "1957-09-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant appointed in temporary capacity to Subordinate Agricultural Service, Group II, from November 16, 1936 to March 18, 1937.",
      "type": "background",
      "date": "1936-11-16",
      "source": "appellant"
    },
    {
      "id": "f2",
      "text": "Appellant appointed in temporary capacity to Subordinate Agricultural Service, Group II, from April 1, 1937 to June 29, 1937.",
      "type": "background",
      "date": "1937-04-01",
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "Appellant appointed in temporary capacity to Subordinate Agricultural Service, Group II, from August 9, 1937 to December 31, 1937.",
      "type": "background",
      "date": "1937-08-09",
      "source": "appellant"
    },
    {
      "id": "f4",
      "text": "Appellant appointed in temporary capacity to Subordinate Agricultural Service, Group II, from January 6, 1938 to February 22, 1943.",
      "type": "background",
      "date": "1938-01-06",
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "Appellant appointed in temporary capacity to Subordinate Agricultural Service, Group I, from February 23, 1943 to April 24, 1944.",
      "type": "background",
      "date": "1943-02-23",
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "Appellant appointed to officiate in United Provinces Agricultural Service Class II as Divisional Superintendent of Agriculture from April 25, 1944, with approval of Public Service Commission, served in temporary capacity for about ten years.",
      "type": "background",
      "date": "1944-04-25",
      "source": "appellant"
    },
    {
      "id": "f7",
      "text": "Appellant reverted to original appointment in Subordinate Agricultural Service by order of Uttar Pradesh Government dated May 3, 1954.",
      "type": "procedural",
      "date": "1954-05-03",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Appellant protested reversion, handed over charge on May 16, 1954, and went on leave until October 2, 1954.",
      "type": "procedural",
      "date": "1954-05-16",
      "source": "appellant"
    },
    {
      "id": "f9",
      "text": "Notice dated September 13, 1954, issued by Director of Agriculture terminating appellant's services in Subordinate Agricultural Service under r. 25 cl. 4 of Subordinate Agriculture Service Rules, services not required after one month.",
      "type": "material",
      "date": "1954-09-13",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Appellant was at no time confirmed in any post in Subordinate Agricultural Service or United Provinces Agricultural Service Class II.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant shown in Gradation List as on probation in Subordinate Agricultural Service.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Allahabad High Court dismissed appellant's application under Art. 226 on October 21, 1955, holding no dismissal/removal and Art. 311 not applicable; dismissed certificate for appeal.",
      "type": "procedural",
      "date": "1955-10-21",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the orders terminating the appellant's services and reverting him to his original appointment amount to removal, dismissal or reduction in rank within the meaning of Art. 311 of the Constitution.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Art. 311 applies to a temporary appointee holding a civil post under the State Government.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Art. 311 applies even to temporary appointment as appellant held civil post under Government of Uttar Pradesh.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Article 311 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "Order terminating services amounted to dismissal or removal as it conveyed imputation of inefficiency and unsatisfactory work.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Article 311 of the Constitution"
    },
    {
      "id": "pa3",
      "text": "Order reverting from United Provinces Agricultural Service to Subordinate Agricultural Service amounted to reduction in rank by way of penalty.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Article 311 of the Constitution"
    },
    {
      "id": "pa4",
      "text": "Appellant had been absorbed in permanent cadre of United Provinces Agricultural Service.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant not confirmed in service; termination under r. 25 cl. 4 not dismissal/removal.",
      "supporting_facts": [
        "f10",
        "f11",
        "f9"
      ],
      "legal_basis": "Subordinate Agriculture Service Rules, r. 25 cl. 4"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court finding that appellant not confirmed in Subordinate Agricultural Service correct based on materials.",
      "addresses_issue": "i1",
      "key_observation": "Appellant failed to establish confirmation."
    },
    {
      "id": "cr2",
      "text": "Appellant's contention of absorption in permanent cadre of United Provinces Agricultural Service not substantiated.",
      "addresses_issue": "i1",
      "key_observation": "No permanent appointment at any time."
    },
    {
      "id": "cr3",
      "text": "Termination of services of temporary employee on probation under r. 25 cl. 4 does not amount to dismissal/removal under Art. 311 as per terms of conditions of service.",
      "addresses_issue": "i1",
      "key_observation": "In accordance with conditions of service, akin to contract termination."
    },
    {
      "id": "cr4",
      "text": "Reversion from temporary post does not per se amount to reduction in rank; appellant failed to establish it was by way of penalty.",
      "addresses_issue": "i1",
      "key_observation": "Temporary post not substantive rank."
    },
    {
      "id": "cr5",
      "text": "Cites Satish Chandra Anand v. Union of India and Shyam Lal v. State of Uttar Pradesh to hold termination not always dismissal/removal.",
      "addresses_issue": "i1",
      "key_observation": "Termination per contract/CSR not under Art. 311."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Termination of services of temporary employee under r. 25 cl. 4 of Subordinate Agriculture Service Rules does not amount to dismissal or removal under Art. 311.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Reversion from temporary post not amounting to reduction in rank under Art. 311 absent proof of penalty.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Satish Chandra Anand v. Union of India",
      "citation": "1953 S.C.R. 655",
      "treatment": "followed",
      "relevance": "Termination per contract terms not dismissal under Art. 311"
    },
    {
      "case_name": "Shyam Lal v. State of Uttar Pradesh",
      "citation": "1955 1 S.C.R. 26",
      "treatment": "followed",
      "relevance": "Compulsory retirement under CSR not dismissal under Art. 311"
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 311"
      ],
      "relevance": "Art. 226 for High Court application; Art. 311 for dismissal/removal/reduction in rank protections not applicable here"
    },
    {
      "name": "Subordinate Agriculture Service Rules",
      "sections": [
        "Rule 25 cl. 4"
      ],
      "relevance": "Permits termination of probationer with one month's notice if not satisfactory; governs conditions of service"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; High Court order upheld; reversion and termination orders valid as not contravening Art. 311 for temporary employee.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "termination of the services of a person employed by the Government does not amount in all cases to dismissal or removal from service.",
      "speaker": "court",
      "significance": "Core principle distinguishing simple termination from Art. 311 dismissal"
    },
    {
      "text": "The termination of the appellants services under r. 25 4 does not amount to dismissal or removal from service within the meaning of Art. 311",
      "speaker": "court",
      "significance": "Direct holding on applicability to probationer under service rules"
    },
    {
      "text": "Reversion from a temporary post held by a person does not per se amount to reduction in rank because the temporary post held by him is not his substantive rank.",
      "speaker": "court",
      "significance": "Clarifies no automatic reduction in rank for temporary posts"
    }
  ],
  "_case_id": "1957_123",
  "_label": 0,
  "_text_length": 7510,
  "_extracted_at": "2026-02-08T22:37:00.926769"
}