{
  "metadata": {
    "case_name": "Appellant (Employer) v. Respondents (Workmen)",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI J."
    ],
    "case_number": "Civil Appeal No. 142 of 1956",
    "date_of_judgment": "1957-11-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents were in the employ of the appellant and were staying in a two storeyed house in the city of Patna which had been rented by the appellant for housing its workmen.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On November 20, 1952, an occurrence took place in the said house wherein the respondents were involved.",
      "type": "material",
      "date": "1952-11-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Written reports of the said occurrence were sent on November 21, 1952, to the appellants Chief Engineer and the respondents were placed under suspension the same day.",
      "type": "procedural",
      "date": "1952-11-21",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "An industrial dispute was then pending between the parties i.e., the appellant and its workmen before the Industrial Tribunal, Bihar.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant made an application to the Industrial Tribunal, Bihar under s. 33 of the Industrial Disputes Act, 1947 for permission to dismiss the respondents on the ground of misconduct as per cl. 17 b viii of the appellants Standing Orders.",
      "type": "procedural",
      "date": "1952-11-21",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On November 27, 1952, the respondents made an application before the Industrial Tribunal under s. 33A of the Act inter alia on the ground that their suspension by the appellant was a breach of s. 33 of the Act.",
      "type": "procedural",
      "date": "1952-11-27",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On December 6, 1952, the appellant made an application before the Industrial Tribunal stating that on a reconsideration of the facts the original prayer for permission to dismiss the respondents was not being pressed, and permission to discharge the respondents under cl. 14 a of the Standing Orders instead.",
      "type": "procedural",
      "date": "1952-12-06",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Industrial Tribunal made its award on May 14, 1953, dismissing the respondents application under s. 33A and granting the appellant permission to discharge the respondents from its employ with effect from the date of the order on payment of one months pay in lieu of notice within 15 days therefrom.",
      "type": "procedural",
      "date": "1953-05-14",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Respondents carried an appeal against the said order to the Labour Appellate Tribunal of India, Calcutta Bench in Appeal No. Cal-87 of 1953.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Labour Appellate Tribunal overruled preliminary objection on maintainability, held appellant could not change from dismissal for misconduct to discharge, set aside Industrial Tribunal's permission to discharge, but expressed inability to grant reinstatement or compensation as notice of discharge already given.",
      "type": "procedural",
      "date": "1954-09-13",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant filed appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Industrial Tribunal expressly recorded finding that the application for leave to discharge was bona fide and actuated by honest motive.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether an appeal lay from the order of the Industrial Tribunal under s.33 to the Labour Appellate Tribunal under s.7 of the Industrial Disputes (Appellate Tribunal) Act, 1950, involving substantial question of law or matters in sub-s.(1)(b).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the appellant could substitute its application from seeking permission to dismiss under cl.17(b)(viii) to discharge under cl.14(a) of Standing Orders without it being punitive or evasion.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the discharge was simpliciter under cl.14(a) or punitive equivalent to dismissal under cl.17(b)(viii).",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether the discharge amounted to retrenchment under s.2(oo) of the Industrial Disputes Act, 1947.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No appeal lay to Labour Appellate Tribunal as the order of Industrial Tribunal was not a decision involving substantial question of law or specified matters under s.7 of Industrial Disputes (Appellate Tribunal) Act, 1950.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s.7 Industrial Disputes (Appellate Tribunal) Act, 1950"
    },
    {
      "id": "pa2",
      "text": "Application dated December 6, 1952 was a new application for bona fide discharge simpliciter under cl.14(a), not punitive, and Industrial Tribunal found no unfair labour practice or victimization.",
      "supporting_facts": [
        "f7",
        "f12"
      ],
      "legal_basis": "cl.14(a) and cl.17(b)(viii) Standing Orders; s.33 Industrial Disputes Act, 1947"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Termination was punitive discharge for alleged misconduct under cl.17(b)(viii), appellant could not evade enquiry by changing to discharge under cl.14(a) without charge-sheet and proper enquiry; substantial question of law.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5",
        "f7"
      ],
      "legal_basis": "cl.17(b)(viii) and cl.14(a) Standing Orders"
    },
    {
      "id": "ra2",
      "text": "Discharge amounted to retrenchment under s.2(oo), appealable under s.7(1)(b) Industrial Disputes (Appellate Tribunal) Act, 1950.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s.2(oo) Industrial Disputes Act, 1947; s.7(1)(b) Industrial Disputes (Appellate Tribunal) Act, 1950"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Application of December 6, 1952 was in substance a new application substituting discharge under cl.14(a) for dismissal under cl.17(b)(viii), bona fide as found by Industrial Tribunal, not oblique motive to evade enquiry.",
      "addresses_issue": "i2",
      "key_observation": "Discharge was simpliciter in exercise of employer rights under cl.14(a), not punitive."
    },
    {
      "id": "cr2",
      "text": "Industrial Tribunal to consider only if unfair labour practice or victimization; since not found, no substantial question of law arose, Labour Appellate Tribunal erred in entertaining appeal.",
      "addresses_issue": "i1",
      "key_observation": "No jurisdiction for Labour Appellate Tribunal to interfere."
    },
    {
      "id": "cr3",
      "text": "Definition of retrenchment in s.2(oo) introduced by Ordinance October 1953 and Act 43 of 1953 published December 23, 1953, not applicable to Industrial Tribunal order of May 14, 1953; discharge simpliciter not retrenchment at relevant time.",
      "addresses_issue": "i4",
      "key_observation": "No appeal on retrenchment ground."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No appeal lay to Labour Appellate Tribunal; its decision set aside, Industrial Tribunal order of May 14, 1953 restored.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Employer entitled to bona fide discharge simpliciter under cl.14(a) without permission being refused under s.33 if no unfair practice.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 33",
        "s. 33A",
        "s. 2(oo)"
      ],
      "relevance": "Permission for discharge during pendency of dispute; complaint for breach; definition of retrenchment not applicable."
    },
    {
      "name": "Industrial Disputes (Appellate Tribunal) Act, 1950",
      "sections": [
        "s. 7",
        "s. 7(1)(b)"
      ],
      "relevance": "Appeal lies only on substantial question of law or specified matters like retrenchment."
    },
    {
      "name": "Standing Orders",
      "sections": [
        "cl. 14(a)",
        "cl. 17(b)(viii)"
      ],
      "relevance": "cl.14(a) for discharge simpliciter; cl.17(b)(viii) for dismissal for misconduct."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; decision of Labour Appellate Tribunal set aside; order of Industrial Tribunal, Bihar dated May 14, 1953 restored, granting appellant permission to discharge respondents on payment of one month's pay in lieu of notice.",
    "relief_granted": "Restoration of permission to discharge respondents under cl.14(a) Standing Orders.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The discharge of the respondents was a discharge simpliciter in exercise of the rights of the employer under cl. 14 a of the Standing Orders and was not a punitive discharge under cl. 17 b viii thereof.",
      "speaker": "court",
      "significance": "Core finding distinguishing discharge from punitive action."
    },
    {
      "text": "Once the Industrial Tribunal was of opinion that the application dated December 6, 1952, and the discharge... were in the honest exercise of the appellants rights, no question of law, much less a substantial question of law could arise.",
      "speaker": "court",
      "significance": "Reason for Labour Appellate Tribunal lacking jurisdiction."
    }
  ],
  "_case_id": "1957_104",
  "_label": 1,
  "_text_length": 12656,
  "_extracted_at": "2026-02-08T22:37:06.007903"
}