{
  "metadata": {
    "case_name": "Dr. N. B. Khare v. Election of Shri Rajendra Prasad",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "VENKATARAMA AIYAR J."
    ],
    "case_number": "Civil Miscellaneous Petition No. 915 of 1957",
    "date_of_judgment": "1957-10-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On May 6, 1957, there was an election to the office of the President and Shri Rajendra Prasad was declared elected.",
      "type": "material",
      "date": "1957-05-06",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Dr. N. B. Khare filed the present petition describing himself as an intending candidate and alleging that there had been violations of the provisions of the Constitution and that the election was invalid.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The prayers in the petition are that grave doubts that exist in connection with the Presidential election be enquired into, resolved and decided and the entire proceedings of the Presidential election be quashed as void.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The Registrar of this Court returned the petition as not being in conformity with the provisions of the Presidential and Vice-Presidential Elections Act, 1952 (XXXI of 1952), and as not satisfying the requirements of the Rules of this Court contained in O. XXXVII-A.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Section 14 of Act XXXI of 1952 provides that no election shall be called in question except by an election petition presented to the Supreme Court in accordance with the provisions of the Act and of the Rules made by the Supreme Court under Art. 145 of the Constitution and it further provides that it should be presented by any candidate at such election or by ten or more electors.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Rule 3 of O. XXXVII-A prescribes that a court-fee of the value of Rs. 250 should be paid on the petition and r. 12 requires the petitioner to deposit a sum of Rs. 2,000 in cash as security for the payment of costs that may become payable by him.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The petitioner is not a person entitled to apply under s. 14 of the Act and his petition was also defective as it did not comply with the requirements of rr. 3 and 12.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Against the order of the Registrar returning the petition, the present appeal has been brought under Order V, rule 3 of the Supreme Court Rules.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the present petition is outside the purview of Act XXXI of 1952 and of O. XXXVII-A of the Supreme Court Rules, as it is founded upon doubts as to the validity of the election rather than a dispute.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether Act XXXI of 1952 and the Rules in O. XXXVII-A are void on the ground that they derogate from the jurisdiction of the Supreme Court to enquire into and decide all disputes and doubts arising out of or in connection with the election of the President under Art. 71(1).",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the petitioner has a right as a citizen to approach this Court under Art. 71(1) whenever an election has been held in breach of the constitutional provisions, independent of Act XXXI of 1952.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The present petition is outside the purview of Act XXXI of 1952 and of O. XXXVII-A of the Supreme Court Rules. The Supreme Court is invested with jurisdiction to enquire into and decide all doubts and disputes arising out of or in connection with the election of the President, but Act XXXI of 1952 and O. XXXVII-A apply only when there is a dispute as to the election, not where the petition is founded upon doubts as to the validity of the election.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Art. 71(1) of the Constitution"
    },
    {
      "id": "pa2",
      "text": "The Act and the Rules in question are void on the ground that they derogate from the jurisdiction of the Supreme Court to enquire into and decide all disputes and doubts arising out of or in connection with the election of the President or the Vice-President. Under s. 18, the election could be set aside only on certain grounds and under clause (b) it could be done only if the result of the election is shown to have been materially affected, and these are restrictions on the jurisdiction conferred by Art. 71(1) and are ultra vires.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Art. 71(1); s.18 of Act XXXI of 1952"
    },
    {
      "id": "pa3",
      "text": "The petitioner has a right as a citizen to approach this Court under Art. 71(1) whenever an election has been held in breach of the constitutional provisions.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Art. 71(1)"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "When once an election has been held, any doubt concerning its validity is material only as a ground for setting aside the election and that in fact is the prayer in the petition itself. In substance the petition is one calling the election in question and it must satisfy the requirements of Act XXXI of 1952 and of the Rules in O. XXXVII-A.",
      "addresses_issue": "i1",
      "key_observation": "Petition calls election in question and must comply with Act and Rules."
    },
    {
      "id": "cr2",
      "text": "Article 71(1) merely prescribes the forum in which disputes in connection with the election of the President and Vice-President would be enquired into. It does not prescribe the conditions under which the petition for setting aside an election could be presented. Under Art. 71(3), it is Parliament that is authorised to make law for regulating any matter relating to or connected with the election of the President or Vice President, and Act XXXI of 1952 has been passed by Parliament in accordance with this provision.",
      "addresses_issue": "i2",
      "key_observation": "Act XXXI of 1952 validly passed under Art. 71(3); does not derogate from Art. 71(1)."
    },
    {
      "id": "cr3",
      "text": "The right to stand for election and the right to move for setting aside an election are not common law rights. They must be conferred by statute and can be enforced only in accordance with the conditions laid down therein. The contention that the Act and the Rules derogate from the jurisdiction of the Supreme Court under Art. 71(1) must accordingly be rejected. The petitioner has, therefore, no right to move for setting aside the election except in accordance with the provisions of Act XXXI of 1952.",
      "addresses_issue": "i2",
      "key_observation": "Rights statutory, not inherent; must follow Act XXXI of 1952."
    },
    {
      "id": "cr4",
      "text": "The right of a person to file an application for setting aside an election must be determined by the statute which gives it, and that statute is Act XXXI of 1952 passed under Art. 71(3). The petitioner must strictly bring himself within the four corners of that statute and has no rights apart from it.",
      "addresses_issue": "i3",
      "key_observation": "No independent right under Art. 71(1); must comply with statute."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The petition is one calling the election in question and must satisfy the requirements of Act XXXI of 1952 and of the Rules in O. XXXVII-A.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Act XXXI of 1952 and O. XXXVII-A do not derogate from the jurisdiction under Art. 71(1), as Art. 71(1) prescribes forum and Art. 71(3) authorizes Parliament to regulate elections.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Petitioner has no right apart from Act XXXI of 1952 to challenge the election.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 71(1)",
        "Article 71(3)",
        "Article 145"
      ],
      "relevance": "Art. 71(1) prescribes forum for disputes; Art. 71(3) authorizes Parliament to make laws; Art. 145 for Supreme Court Rules."
    },
    {
      "name": "Presidential and Vice-Presidential Elections Act, 1952 (XXXI of 1952)",
      "sections": [
        "Section 14",
        "Section 18"
      ],
      "relevance": "Regulates presentation of election petitions; s.14 specifies who can present and requirements; s.18 grounds for setting aside election."
    },
    {
      "name": "Supreme Court Rules",
      "sections": [
        "Order XXXVII-A Rule 3",
        "Order XXXVII-A Rule 12",
        "Order V rule 3"
      ],
      "relevance": "Prescribe court-fee, security deposit, and appeal procedure for election petitions."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the Registrar's order returning the petition for non-compliance with Act XXXI of 1952 and Supreme Court Rules O. XXXVII-A is dismissed. The petition is not maintainable as petitioner is not entitled under s.14 and did not comply with rules on fee and security.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "When once an election has been held, any doubt concerning its validity is material only as a ground for setting aside the election and that in fact is the prayer in the petition itself.",
      "speaker": "court",
      "significance": "Clarifies that doubts as to validity are grounds to challenge election under the Act."
    },
    {
      "text": "Article 71(1) merely prescribes the forum in which disputes in connection with the election of the President and Vice-President would be enquired into. It does not prescribe the conditions under which the petition for setting aside an election could be presented.",
      "speaker": "court",
      "significance": "Defines scope of Art. 71(1) and upholds parliamentary regulation."
    },
    {
      "text": "The right to stand for election and the right to move for setting aside an election are not common law rights. They must be conferred by statute.",
      "speaker": "court",
      "significance": "Establishes that election challenge rights are statutory only."
    }
  ],
  "_case_id": "1957_151",
  "_label": 0,
  "_text_length": 5411,
  "_extracted_at": "2026-02-10T19:24:21.000603"
}