{
  "metadata": {
    "case_name": "Bakshish Singh v. State of Punjab",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur J."
    ],
    "case_number": "Criminal Appeal No. 205 of 1956",
    "date_of_judgment": "1957-09-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On August 1, 1954, sometime between 7 and 8 p.m., Bachhinder Singh son of Bhagwan Singh of village Kairon was shot in the lane in front of their house and died the next day in hospital at Amritsar from bullet injuries.",
      "type": "material",
      "date": "1954-08-01",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Bachhinder Singh was accompanied by his younger brother Narvel Singh, a boy of 13, who was an eye-witness to the occurrence.",
      "type": "material",
      "date": "1954-08-01",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "After shooting, Bachhinder Singh and Narvel Singh returned to the house; Bachhinder Singh informed father Bhagwan Singh of the identity of assailants Bakshish Singh (appellant) and Gurbakshi Singh.",
      "type": "material",
      "date": "1954-08-01",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Bachhinder Singh carried to hospital at Kairon; doctor rendered first aid and advised transfer to V.J. Hospital at Amritsar.",
      "type": "procedural",
      "date": "1954-08-01",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Bhagwan Singh went to Police Post at Kairon to report but Assistant Sub-Inspector was away; took son by train leaving Kairon at 9:47 p.m., accompanied by Narvel Singh, Shamir Singh, Inder Singh and Narinjan Singh.",
      "type": "procedural",
      "date": "1954-08-01",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "At Amritsar hospital, Bachhinder Singh examined by Dr. Kanwal Kishore at 11:45 p.m.; information sent to police; Head Constable Maya Ram recorded dying declaration Ex. P-H in presence of Dr. Mahavir Sud after fitness certificate.",
      "type": "procedural",
      "date": "1954-08-01/02",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Dying declaration Ex. P-H basis of First Information Report Ex. P-H/1 recorded on August 2, 1954 at 7:50 a.m. at Police Station Sarhali.",
      "type": "procedural",
      "date": "1954-08-02",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Dr. K.C. Saronwala performed operation early morning Aug 2, extracted bullet from left abdominal wall handed to police.",
      "type": "material",
      "date": "1954-08-02",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Bachhinder Singh died at 1:35 p.m. on August 2, 1954; inquest report Ex. P-K prepared at 2:30 p.m. by Head Constable Maya Ram.",
      "type": "material",
      "date": "1954-08-02",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Appellant Bakshish Singh and brother Gurbakshi Singh tried for offence under ss. 302/34 IPC; acquitted by Additional Sessions Judge, Amritsar on Feb 15, 1955 in Sessions Case No. 64 of Trial No. 6 of 1955.",
      "type": "procedural",
      "date": "1955-02-15",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "State appealed to Punjab High Court in Criminal Appeal No. 282 of 1955; appeal against appellant alone heard as Gurbakshi Singh absconding; High Court reversed acquittal on Nov 30, 1955.",
      "type": "procedural",
      "date": "1955-11-30",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": "1956",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Extra-judicial confession to Teja Singh rejected by both courts below.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Sucha Singh mentioned as witness in dying declaration and Narvel Singh's statement but not produced; Public Prosecutor stated won over.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Reliability and admissibility of the dying declaration Ex. P-H, including whether it was voluntary, unaided, without prompting, and properly recorded in Urdu despite Punjabi narration.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether corroboration is essential for dying declaration and sufficiency of Narvel Singh's eye-witness testimony and Bhagwan Singh's statement.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Admissibility of Dr. Mahavir Sud's statement under s.33 Evidence Act.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Propriety of High Court reversing acquittal by Sessions Judge.",
      "framed_by": "court"
    },
    {
      "id": "i5",
      "text": "Non-production of Sucha Singh and whether adverse inference under s.114 Evidence Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Dying declaration not genuine as only Bhagwan Singh and Narvel Singh present; police enquired from them first; detailed narrative not product of deceased alone but touched up; cited 1954 Lahore 805.",
      "supporting_facts": [
        "f6",
        "f13"
      ],
      "legal_basis": "Dying declaration value disappears if supplied by others"
    },
    {
      "id": "pa2",
      "text": "Deceased spoke in Punjabi but recorded in Urdu; infirmity.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Dr. Mahavir Sud's statement inadmissible under s.33 Evidence Act as conditions not complied.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.33 Evidence Act"
    },
    {
      "id": "pa4",
      "text": "Corroboration essential for dying declaration; Narvel Singh unreliable due to discrepancies between commitment and trial statements.",
      "supporting_facts": [
        "f2",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Non-production of Sucha Singh serious omission warranting adverse inference.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "s.114 Evidence Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Dying declaration voluntary and genuine; recorded by disinterested Head Constable Maya Ram from Amritsar; Dr. Mahavir Sud present, certified fitness, no prompting; standard practice to record in Urdu.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Narvel Singh's statement corroborates dying declaration; discrepancies due to inaccurate English record vs. Urdu.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Bhagwan Singh's testimony of immediate disclosure by deceased natural and reliable.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Sucha Singh won over; no obligation to produce; would cause confusion.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Cited Abdul Mohammad v. Attorney General of Palestine; Stephen Servaratne v. The King; Habeeb Mohammad v. State of Hyderabad"
    },
    {
      "id": "ra5",
      "text": "Dr. Mahavir Sud unavailable; statement admissible under s.33 due to unreasonable delay/expense.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.33 Evidence Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court correctly appreciated evidence; dying declaration authentic as recorded by disinterested Head Constable, certified by Dr. Mahavir Sud who confirmed voluntary, no prompting; Urdu recording standard in Punjab, not infirmity.",
      "addresses_issue": "i1",
      "key_observation": "No reason to doubt correctness; supported by Dr. Mahavir Sud's testimony."
    },
    {
      "id": "cr2",
      "text": "Narvel Singh's discrepancies overstated due to inaccurate English record; High Court correctly accepted testimony.",
      "addresses_issue": "i2",
      "key_observation": "Bhagwan Singh's immediate statement natural and reliable."
    },
    {
      "id": "cr3",
      "text": "Dr. Mahavir Sud's statement admissible under s.33; unavailable without unreasonable delay/expense; no prior objection.",
      "addresses_issue": "i3",
      "key_observation": "Trial judge's order valid."
    },
    {
      "id": "cr4",
      "text": "Long narrative in dying declaration undesirable but does not affect authenticity here; suggest rules for recording.",
      "addresses_issue": "i1",
      "key_observation": "Object is cause/circumstances of death per s.32(1) Evidence Act."
    },
    {
      "id": "cr5",
      "text": "No obligation to produce Sucha Singh; won over, no adverse inference.",
      "addresses_issue": "i5",
      "key_observation": "Prosecutorial discretion."
    },
    {
      "id": "cr6",
      "text": "High Court applied correct principles in appeals against acquittal; Sessions Judge's errors compelling for reversal.",
      "addresses_issue": "i4",
      "key_observation": "Erroneous view of dying declaration and oral evidence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Dying declaration voluntary, unaided, authentic; Urdu recording not infirmity in Punjab practice.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Corroboration by eye-witness Narvel Singh and Bhagwan Singh sufficient; not essential but present.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Dr. Mahavir Sud's statement admissible under s.33 Evidence Act.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "High Court rightly reversed acquittal.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "No adverse inference from non-production of Sucha Singh.",
      "resolves_issue": "i5",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Unnamed case (1954 Lahore 805)",
      "citation": "1954 Lahore 805",
      "treatment": "followed",
      "relevance": "Dying declaration valuable if unassisted; value disappears if supplied by others."
    },
    {
      "case_name": "Abdul Mohammad v. Attorney General of Palestine",
      "citation": "A.I.R. 1945 P.C. 42",
      "treatment": "followed",
      "relevance": "No obligation to examine all witnesses mentioned."
    },
    {
      "case_name": "Stephen Servaratne v. The King",
      "citation": "A.I.R. 1936 P.C. 289",
      "treatment": "followed",
      "relevance": "No obligation to examine all witnesses mentioned."
    },
    {
      "case_name": "Habeeb Mohammad v. The State of Hyderabad",
      "citation": "1954 S.C.R. 475",
      "treatment": "followed",
      "relevance": "No obligation to examine all witnesses mentioned."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302/34"
      ],
      "relevance": "Offence for which accused tried."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "32(1)",
        "33",
        "114"
      ],
      "relevance": "Dying declaration admissibility; transfer of evidence; adverse inference."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal against Punjab High Court's reversal of acquittal, upholding the conviction of appellant Bakshish Singh under ss.302/34 IPC based on reliable dying declaration corroborated by eye-witness and other evidence.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The statement was recorded by Head Constable Maya Ram who was posted in Amritsar and was not posted in village Kairon and therefore had no knowledge of the parties nor had any interest in them.\"",
      "speaker": "court",
      "significance": "Supports disinterested recording of dying declaration."
    },
    {
      "text": "\"I have no doubt in my mind that the dying declaration recorded in the present case is a voluntary one and was made without any prompting from anybody.\"",
      "speaker": "court",
      "significance": "High Court (Birhan Narain J.) acceptance affirmed by SC."
    },
    {
      "text": "\"The recording of the dying declaration in Urdu cannot be a ground for saying that the statement does not correctly reproduce what was stated by the declarant.\"",
      "speaker": "court",
      "significance": "Rejects language objection as standard Punjab practice."
    },
    {
      "text": "\"The object of a dying declaration is to get from the person making the statement the cause of death or the circumstances of the transaction which resulted in death.\"",
      "speaker": "court",
      "significance": "Guidance on scope under s.32(1) Evidence Act."
    }
  ],
  "_case_id": "1957_131",
  "_label": 0,
  "_text_length": 17114,
  "_extracted_at": "2026-02-10T19:24:28.302998"
}