{
  "metadata": {
    "case_name": "Rambandhu and Ors. v. Sumitra Devi and Anr.",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das J."
    ],
    "case_number": "Civil Appeal No. 158 of 1953",
    "date_of_judgment": "1957-01-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Ram Kishori Lal Sao died in September 1927 leaving extensive properties worth several lakhs, including houses in Asansol, businesses at Howrah and Asansol, and money in banks or loans.",
      "type": "background",
      "date": "1927-09",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Sumitra Devi, widow of Ram Kishori Lal, brought Title Suit No. 664 of 1927 against step-sons for partition.",
      "type": "procedural",
      "date": "1927",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Preliminary decree in partition suit passed on July 22, 1933; final decree on June 29, 1936. Each son got one-sixth share. Sumitra Devi got one-third share (one-sixth as widow, one-sixth as mother of pre-deceased son Lachmi Narain who died January 1, 1936). Her share included four houses on Municipal Holdings Nos. 116, 17, 26, 27 worth about Rs. 19,000.",
      "type": "material",
      "date": "1933-07-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Partition decree provided Rs. 10,000 for marriage expenses of minor daughter Kamala Devi and Rs. 50/month maintenance until marriage.",
      "type": "material",
      "date": "1936-06-29",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Marriage of Kamala Devi settled at Deoghar on Shivratri day in 1938 with Bijoy Kumar Sao, son of Nand Lal Sao. Performed on May 10, 1938. Dwiragaman/Gowna ceremony in December 1938.",
      "type": "material",
      "date": "1938",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellants' case: Marriage terms included promise of gift of four Asansol houses (Rs. 20,000) as dowry. Sankalpa made at marriage, accepted by Nand Lal, confirmed at Gowna, possession given soon after. Deed executed March 10, 1940 due to illness.",
      "type": "disputed",
      "date": "1940-03-10",
      "source": "appellants"
    },
    {
      "id": "f7",
      "text": "Respondents' case: Negotiations at Asansol, no promise of houses; only ornaments Rs. 5,000, Rs. 800 travel, movables from Rs. 10,000. Gift collusive, fraudulent, without consideration, beyond life interest, no legal necessity.",
      "type": "disputed",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f8",
      "text": "Title Suit No. 2 of 1942 filed by four sons (Kalicharan died during pendency, heirs substituted) for declaration that gift deed dated March 10, 1940 by Sumitra Devi to Kamala Devi void beyond Sumitra's lifetime, not binding on reversion.",
      "type": "procedural",
      "date": "1942",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Subordinate Judge, Asansol decreed suit June 30, 1943: No promise/sankalpa/possession; interest ordinary maintenance grant; gift not at marriage/Gowna, not binding beyond life.",
      "type": "procedural",
      "date": "1943-06-30",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Calcutta High Court affirmed April 6, 1950: Settlement at Deoghar included promise of four houses; no sankalpa/possession; gift not at/on occasion of marriage/Gowna; reasonable portion but invalid under T.P. Act s.123.",
      "type": "procedural",
      "date": "1950-04-06",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "SC appeal by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Is defendant No. 1 competent to make any gift of the properties mentioned in the plaint beyond her lifetime to defendant No. 2?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Is the deed of gift executed by defendant No. 1 in favour of defendant No. 2 void and inoperative against the plaintiffs beyond the lifetime of defendant No. 1?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Sumitra Devi's share on partition was absolute or limited estate under Mitakshara (Benares school).",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether gift of reasonable portion as marriage dowry in fulfilment of ante-nuptial promise, executed two years later, valid under Hindu law.",
      "framed_by": "court"
    },
    {
      "id": "i5",
      "text": "Applicability of Hindu Succession Act, 1956 s.14 to the properties.",
      "framed_by": "appellants"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Marriage settled at Deoghar with promise of four houses as dowry; sankalpa at marriage accepted by Nand Lal, confirmed at Gowna, possession given; deed 1940 due to illness. High Court erred in facts (confused witnesses).",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Even accepting findings, gift reasonable, in fulfilment of ante-nuptial agreement for spiritual benefit, valid under Hindu law; lapse of time immaterial.",
      "supporting_facts": [
        "f3",
        "f6",
        "f10"
      ],
      "legal_basis": "Hindu law texts (Mitakshara, Manu); precedents like Churaman Sahu v. Gopi Sahu"
    },
    {
      "id": "pa3",
      "text": "Sumitra Devi had absolute right in partition share.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Mitakshara law"
    },
    {
      "id": "pa4",
      "text": "Under Hindu Succession Act s.14, Sumitra/Kamala full owners.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "Hindu Succession Act, 1956 s.14"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No ante-nuptial promise of houses; only ornaments Rs.5000, travel Rs.800, movables from Rs.10,000. No sankalpa/possession. Gift collusive to deprive reversioners.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Sumitra had limited estate (maintenance-like); gift not at/on occasion of marriage/Gowna; unreasonable; barred by T.P. Act s.123.",
      "supporting_facts": [
        "f3",
        "f9",
        "f10"
      ],
      "legal_basis": "Transfer of Property Act s.123; Debi Mangal Prasad Singh v. Mahadeo Prasad Singh; Mitakshara law"
    },
    {
      "id": "ra3",
      "text": "Hindu Succession Act s.14(2) excludes restricted estates; donee cannot get larger than donor.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Hindu Succession Act s.14(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Upheld High Court findings: Ante-nuptial promise at Deoghar for four houses; no sankalpa at marriage, no possession pre-deed, no confirmation at Gowna. Mistake in witnesses not sufficient to reverse.",
      "addresses_issue": "i1",
      "key_observation": "Findings of fact by courts below concurrent and not vitiated."
    },
    {
      "id": "cr2",
      "text": "Partition share not stridhan, same as inherited property; limited estate, no absolute disposal right.",
      "addresses_issue": "i3",
      "key_observation": "Debi Mangal Prasad Singh v. Mahadeo Prasad Singh; partition decree protected corpus."
    },
    {
      "id": "cr3",
      "text": "Under Hindu law, widow competent to gift reasonable portion as marriage dowry in fulfilment of ante-nuptial promise, even years later; moral/religious obligation for spiritual benefit.",
      "addresses_issue": "i4",
      "key_observation": "Gift valid; T.P. Act s.123 effects transfer but does not limit Hindu law power. Reasonable (Rs.19,000 vs share Rs.73,000)."
    },
    {
      "id": "cr4",
      "text": "No need to decide Hindu Succession Act s.14 as gift valid under pre-1956 Hindu law.",
      "addresses_issue": "i5",
      "key_observation": "Unnecessary given prior holding."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Gift deed dated March 10, 1940 by Sumitra Devi to Kamala Devi valid and binding on reversioners.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Ante-nuptial promise fulfilled by gift two years post-marriage valid under Hindu law as reasonable dowry for spiritual benefit.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Debi Mangal Prasad Singh v. Mahadeo Prasad Singh",
      "citation": "1912 L.R. 39 I.A. 121",
      "treatment": "followed",
      "relevance": "Partition share stands on same footing as inherited property, not stridhan."
    },
    {
      "case_name": "Churaman Sahu v. Gopi Sahu",
      "citation": "1909 I.L.R. 37 Cal. 1",
      "treatment": "followed",
      "relevance": "Widow can gift reasonable portion to daughter at/on occasion of marriage/Gowna."
    },
    {
      "case_name": "Bhugwandeen Doobey v. Myna Baee",
      "citation": "1863 M.I.A. 487",
      "treatment": "referred",
      "relevance": "Left open whether partition share is stridhan under Mitakshara."
    },
    {
      "case_name": "Sardar Singh v. Kunj Behari Lal",
      "citation": "1922 L.R. 49 I.A. 383",
      "treatment": "followed",
      "relevance": "Distinction between essential religious acts and pious observances; dowry pious."
    },
    {
      "case_name": "Cossi Naut Bysack v. Hurroo Soondry Dossee",
      "citation": "2 Morleys Digest 198",
      "treatment": "followed",
      "relevance": "Widow can dispose for religious purposes including daughter dowry."
    },
    {
      "case_name": "Ram Sumran Prasad v. Gobind Das",
      "citation": "1926 I.L.R. 5 Pat. 646",
      "treatment": "followed",
      "relevance": "Gift post-marriage in fulfilment of promise valid."
    },
    {
      "case_name": "Kudutamma v. Narasimha Charyulu",
      "citation": "1907 17 M.L.J. 528",
      "treatment": "followed",
      "relevance": "Gift post-marriage to fulfil moral obligation valid."
    },
    {
      "case_name": "Sundararamayya v. Sitamma",
      "citation": "1911 I.L.R. 35 Mad. 628",
      "treatment": "followed",
      "relevance": "Moral obligation continues post-marriage."
    },
    {
      "case_name": "Ganga Bisheshar v. Pirthi Pal",
      "citation": "1880 I.L.R. 2 All. 635",
      "treatment": "distinguished",
      "relevance": "Dissentient; did not consider religious duty aspect."
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act",
      "sections": [
        "Section 123"
      ],
      "relevance": "Requires registered deed for gift of immovable property; effects transfer but does not limit Hindu widow's power to alienate for dowry."
    },
    {
      "name": "Hindu Succession Act, 1956",
      "sections": [
        "Section 14"
      ],
      "relevance": "Converts limited estate to full ownership; retrospective but unnecessary to apply as gift valid under prior law."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgments and decrees of Subordinate Judge and Calcutta High Court set aside. Gift deed held valid and binding on reversioners.",
    "relief_granted": "Declaration that deed of gift dated March 10, 1940 is valid beyond lifetime of Sumitra Devi and binding on reversion.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is the imperative, religious duty and a moral obligation of a father, mother or other guardian to give a girl in marriage to a suitable husband it is a duty which must be fulfilled to prevent degradation, and direct spiritual benefit is conferred upon the father by such a marriage.\"",
      "speaker": "court",
      "significance": "Core principle justifying widow's power to gift dowry."
    },
    {
      "text": "\"Section 123 does not deal with nor does it affect the power of a Hindu widow to make an alienation of a reasonable portion of her husbands estate in favour of the daughter as marriage dowry.\"",
      "speaker": "court",
      "significance": "Clarifies T.P. Act does not override Hindu law power."
    },
    {
      "text": "\"The finding of the final Court of fact is that there was an antenuptial agreement by Sumitra Devi that she would give four houses at Asansol, of the value of Rs. 20,000, to her daughter as marriage dowry.\"",
      "speaker": "court",
      "significance": "Accepts key fact enabling validity of gift."
    }
  ],
  "_case_id": "1957_92",
  "_label": 1,
  "_text_length": 53666,
  "_extracted_at": "2026-02-10T19:23:39.971663"
}