{
  "metadata": {
    "case_name": "Steel Bros. Co. Ltd. and Ellermans Arracan Rice and Trading Co. Ltd. v. Commissioner of Income-tax, West Bengal",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Bhagwati, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Prior to November 29, 1928, Steel Bros. Co. Ltd. (Steels), Ellermans Arracan Rice and Trading Co. Ltd. (Ellermans) and Burma Co. Ltd. (Burma) carried on trade in Burma rice and its by-products in Burma, London and elsewhere.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Burma never purchased paddy or sold rice. All shares of Burma held by Steels, who were also its managing agents.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Agreement dated November 29, 1928, entered into between Steels, Burma and Ellermans for amalgamated working of Burma rice business under management of Steels, referred to as the Combination.",
      "type": "material",
      "date": "1928-11-29",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Entire business of Ellermans in Burma taken over by Steels from December 1, 1928, conducted from Steels' offices in Steels' name in conjunction with rice business of Steels and Burma.",
      "type": "material",
      "date": "1928-12-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Profit or loss of Combination shared between Steels/Burma (68/68/68/72 in Rangoon/Bassein/Akyab/Moulmein) and Ellermans (32/32/32/28).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Burma's rice mills to be worked by Steels for Combination.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Agreement effective from December 1, 1928, terminable on November 30, 1930 or subsequent by notice by August 1 preceding.",
      "type": "material",
      "date": "1928-12-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Agreement signed by Steels and Ellermans, and by James Kilgour Michie for Burma.",
      "type": "material",
      "date": "1928-11-29",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "For assessment years 1943-44 and 1944-45, assessee (Combination) applied under section 26A for registration of partnership constituted of Steels and Ellermans, supported by copy of 1928 agreement. Applications signed by Steels and Ellermans only.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Income-tax Officer refused registration on March 19, 1948 and March 31, 1949: partnership of three parties, shares not specified for three, loss not allocated properly.",
      "type": "procedural",
      "date": "1948-03-19",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellate Assistant Commissioner upheld ITO orders: application signed by two partners but deed shows three, shares of Steels and Burma not separate.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Tribunal on February 20, 1951 held partnership between Steels and Ellermans, Burma subsidiary with little involvement, deed proper for registration.",
      "type": "procedural",
      "date": "1951-02-20",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Commissioner applied for reference under s66(1); Tribunal referred question: whether Tribunal right in holding partnership between Steels and Ellermans only.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "High Court answered question in negative: partnership of three companies, applications not by three, shares not specified.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "High Court refused certificate under s66A(2); assessee obtained special leave under Article 136.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "No share of profits of Combination ever paid to or received by Burma; Burma's earnings only milling hire from Steels.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Profit and loss accounts of Burma for years ending November 1941, 1942, 1943 considered by Tribunal.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on a proper construction of the deed of agreement dated 29th November, 1928, and having regard to the relevant facts and circumstances of the case, the partnership was really between Steels and Ellermans and that, therefore, registration should have been allowed under section 26A of the Indian Income-tax Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Partnership constituted of Steels and Ellermans only; Burma 100% subsidiary of Steels, hardly anything to do with Combination; surrounding circumstances under s6 Partnership Act show real relation between Steels and Ellermans.",
      "supporting_facts": [
        "f2",
        "f16",
        "f17"
      ],
      "legal_basis": "Section 6 of Indian Partnership Act, 1932"
    },
    {
      "id": "pa2",
      "text": "Agreement confers specific rights on Ellermans not on Burma, e.g., right to advice, audit accounts, inspect, superintending engineers' rights, etc.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Burma never purchased paddy or sold rice; no profits paid to Burma; only milling hire received.",
      "supporting_facts": [
        "f2",
        "f16"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Agreement between three parties; recital and clauses 1, 3a, 12, 14 show partnership of three companies; applications not made by three, deed does not specify respective shares.",
      "supporting_facts": [
        "f3",
        "f5",
        "f7",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Agreement entered between three parties for amalgamated business; profit/loss shared between Steels/Burma joint and Ellermans; accounts binding on all three; restrictions on all three; terminable by any party; disputes by arbitration; intent to work jointly.",
      "addresses_issue": "i1",
      "key_observation": "Clauses spell out partnership between Steels, Burma and Ellermans; all ingredients of partnership satisfied."
    },
    {
      "id": "cr2",
      "text": "Rights conferred on Ellermans but not Burma explained by Burma being wholly-owned subsidiary and managing agent of Steels; no conflict of interest; superfluous to give Burma separate rights.",
      "addresses_issue": "i1",
      "key_observation": "Steels/Burma bracketed jointly for shares; profits to joint share received by Steels, internal matter."
    },
    {
      "id": "cr3",
      "text": "Facts like ownership of shares, no separate paddy purchase/sale by Burma, no profits paid to Burma, milling hire: do not detract; explain why no separate rights needed; internal arrangements between Steels and Burma.",
      "addresses_issue": "i1",
      "key_observation": "Burma contributed properties, had joint share, right to terminate, arbitrate."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "On true construction, Burma was a partner along with Steels and Ellermans; applications signed only by two, no individual share for Burma specified, hence not in accordance with s26A and Rule 2.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 26A",
        "Section 66(1)",
        "Section 66A(2)"
      ],
      "relevance": "Governs application for registration of firm specifying individual shares, signed by all partners; reference to High Court; certificate for appeal."
    },
    {
      "name": "Indian Income-tax Rules, 1922",
      "sections": [
        "Rule 2"
      ],
      "relevance": "Application for registration to be signed by all partners."
    },
    {
      "name": "Indian Partnership Act, 1932",
      "sections": [
        "Section 4",
        "Section 6"
      ],
      "relevance": "Definition of partnership; real relation shown by all relevant facts."
    },
    {
      "name": "Indian Contract Act, 1872",
      "sections": [
        "Section 239"
      ],
      "relevance": "Definition of partnership at relevant date."
    },
    {
      "name": "Arbitration Act, 1889",
      "sections": [],
      "relevance": "Disputes under agreement to be decided by arbitration."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 136"
      ],
      "relevance": "Special leave to appeal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's view that the partnership consisted of three partners (Steels, Burma, and Ellermans), and since the applications for registration under section 26A were signed only by Steels and Ellermans without specifying Burma's individual share, registration was rightly refused.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "On a true construction of the agreement dated 29th November, 1928, we have, therefore come to the conclusion that Burma was a partner along with Steels and Ellermans in the Combination.",
      "speaker": "court",
      "significance": "Core holding on partnership constitution."
    },
    {
      "text": "The relationship which has been brought into existence between the three parties is a relationship between partners who have agreed to share the profits of a business carried on by all or any of them acting for all.",
      "speaker": "court",
      "significance": "Applies definition of partnership."
    },
    {
      "text": "There is not the slightest doubt whatever that Burma was a partner with Steels and Ellermans in the business of the Combination.",
      "speaker": "court",
      "significance": "Emphatic rejection of two-partner argument."
    }
  ],
  "_case_id": "1957_80",
  "_label": 0,
  "_text_length": 28644,
  "_extracted_at": "2026-02-08T22:36:36.738936"
}