{
  "metadata": {
    "case_name": "Defendants 47 and 48 v. Respondent No. 4",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 185 of 1952",
    "date_of_judgment": "1957-05-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Purushottam had been earning and purchasing large properties and endowing and dedicating them for public charitable purposes since 1896.",
      "type": "background",
      "date": null,
      "source": "plaintiffs"
    },
    {
      "id": "f2",
      "text": "In about 1919, Purushottam, having become old, executed and registered a deed of trust on March 17, 1919, creating a trust in respect of his properties and appointing three trustees including himself, Mr. Reballa Subbarayudu and Mr. Viswanadha Rao.",
      "type": "material",
      "date": "1919-03-17",
      "source": "plaintiffs"
    },
    {
      "id": "f3",
      "text": "Purushottam's son Ramakrishnayya disapproved of the trust arrangement and obstructed its administration.",
      "type": "material",
      "date": null,
      "source": "plaintiffs"
    },
    {
      "id": "f4",
      "text": "Two suits filed by trustees against Ramakrishnayya and associates: O.S. No. 599 of 1919 and O.S. No. 68 of 1920 (District Munsiff's Court, Kavali and District Court, Nellore), transferred to Sub-Court, Nellore as O.S. No. 39 of 1921 and O.S. No. 67 of 1921.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Advocate-trustees withdrew from the suits, leaving Purushottam in sole charge; suits ended in a compromise decree.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Compromise decree divided properties: Schedule 1 properties allotted to Purushottam as sole trustee till lifetime for conducting charities from 1919 deed, to utilize income according to necessity, enjoy without gift/sale; after death, pass to grandson Ramalingeswara Rao subject to charities; guardian if minor.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Plaintiffs alleged compromise decree was fraudulent and collusive to efface trust character and create individual rights.",
      "type": "disputed",
      "date": null,
      "source": "plaintiffs"
    },
    {
      "id": "f8",
      "text": "Suit filed with Collector's sanction under s.92 CPC: Original Suit No. 132 of 1944, claiming properties in Sch. A as trust properties from 1919 deed, seeking scheme.",
      "type": "procedural",
      "date": null,
      "source": "plaintiffs"
    },
    {
      "id": "f9",
      "text": "At suit date, Purushottam and Ramakrishnayya dead; Ramalingeswara Rao impleaded as defendant No.1; numerous alienees including defendants 47 and 48.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Agreement of sale by defendant No.1 to defendants 47 and 48 on June 7, 1942; specific performance decree passed; impleaded January 3, 1944.",
      "type": "procedural",
      "date": "1942-06-07",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Trial court decree October 27, 1945: suit competent; compromise not collusive/fraudulent but created trust re Purushottam's share; scheme to be framed.",
      "type": "procedural",
      "date": "1945-10-27",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Madras High Court Appeal No. 155 of 1946 dismissed December 15, 1948: confirmed trial decree, held compromise created public charitable trust re Purushottam's properties.",
      "type": "procedural",
      "date": "1948-12-15",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Supreme Court interlocutory judgment March 30, 1955: remanded to High Court of Andhra for findings on whether obligation annexed to property and whether decree collusive.",
      "type": "procedural",
      "date": "1955-03-30",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "High Court of Andhra found: obligation annexed to Purushottam's share; compromise not collusive, binding on trust.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Charities specified in 1919 deed: nine charities including choultry drinks/food, offerings to temples, school fees to poor Brahmin boys, etc.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the properties in suit are the subject matter of public charitable trust or are merely burdened or charged with the obligation in favour of the specified charities.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the obligation arising out of the trust is annexed to the property that fell to the share of Purushottam under the compromise decree.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the compromise decree was collusive and not binding on the trust.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The properties in their hands were subject to the charge in favour of the charities but denied that the said properties were the subject-matter of a charitable trust; compromise decree was fair and bona fide family settlement, binding; not fraudulent or collusive.",
      "supporting_facts": [
        "f6",
        "f10",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The view of courts below about the character of the properties is based upon a misconstruction of the compromise decree.",
      "supporting_facts": [
        "f6",
        "f11",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Properties in suit were subject-matter of public charitable trust created by 1919 deed; compromise decree fraudulent and collusive to efface trust; scheme to be framed for 1919 trust.",
      "supporting_facts": [
        "f2",
        "f5",
        "f7"
      ],
      "legal_basis": "s.92 Code of Civil Procedure"
    },
    {
      "id": "ra2",
      "text": "Even if compromise decree does not create public trust, 1919 trust validly created cannot be effaced by subsequent compromise; Purushottam guilty of breach of trust.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Compromise decree itself created a trust in favour of public charities re Purushottam's share.",
      "supporting_facts": [
        "f6",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Principles of Hindu Law: dedication to charity can be complete (creates trust, extinguishes private title) or partial (charge attached, property retains private character); intention from document as whole, not mere words like 'trustee'.",
      "addresses_issue": "i1",
      "key_observation": "Dedication complete if private title extinguished and title transferred to charity; partial if substantial income for charity vs minor for private."
    },
    {
      "id": "cr2",
      "text": "Clause 1 of compromise decree: Purushottam sole trustee till death, enjoy property without alienation, utilize income 'according to necessity' for charities; then pass to grandson subject to charities, no alienation bar on grandson.",
      "addresses_issue": "i1",
      "key_observation": "Inconsistent with complete dedication: enjoyment suggests private right; devolution to grandson preserves private title burdened by charge; contrasts with 1919 deed's full dedication."
    },
    {
      "id": "cr3",
      "text": "1919 trust effaced by compromise as per findings below (not collusive, binding); plaintiffs acquiesced, did not appeal on original trust.",
      "addresses_issue": "i1",
      "key_observation": "Too late to argue original trust survives; plaintiffs accepted substitution."
    },
    {
      "id": "cr4",
      "text": "High Court erred in assuming clause 1 confirmed 1919 trust; words differ sharply.",
      "addresses_issue": "i1",
      "key_observation": "Guardian for minor grandson inconsistent with trust property."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Properties allotted to Purushottam under compromise decree not completely dedicated as public charitable trust but remain private property burdened/charged with obligation for specified charities.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Compromise decree not collusive/fraudulent, binding on trust; obligation annexed to property.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "1919 trust effaced by binding compromise decree.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Maharani Hemanta Kumari Debi v. Gauri Shankar Tewari",
      "citation": "1940 L.R. 68 I.A. 53",
      "treatment": "referred",
      "relevance": "Complete dedication vests property in idol; partial dedication allows owner to continue uses not interfering with dedicated use; property alienable with charge."
    },
    {
      "case_name": "Chairman of the Howrah Municipality v. Khetra Krishna Mitra",
      "citation": "1906 4 Cal. L.J. 343",
      "treatment": "referred",
      "relevance": "Partial dedication: property descends alienable with charge."
    },
    {
      "case_name": "Jadu Nath Singh v. Thakur Sita Ramji",
      "citation": "1917 L.R. 44 I.A. 187",
      "treatment": "followed",
      "relevance": "Deed showed complete dedication despite managers enjoying minor income; initial intention to dedicate whole."
    },
    {
      "case_name": "Pande Har Narayan v. Surja Kunwari",
      "citation": "1921 L.R. I.A. 143",
      "treatment": "followed",
      "relevance": "No fixed rule; construe will as whole; if residue to heirs after minor charge, partial dedication."
    },
    {
      "case_name": "Sonatun Bysack v. Sreemutti Juggutsoondree Dossee",
      "citation": "8 Moo. I.A. 66",
      "treatment": "referred",
      "relevance": "Purported absolute gift but directions show not absolute to idol."
    },
    {
      "case_name": "Gopal Lal Sett v. Purna Chandra Basak",
      "citation": "1921 L.R. 49 I.A. 100",
      "treatment": "referred",
      "relevance": "Will conferred properties on grandson charged with worship, no shebaitship created."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s.92"
      ],
      "relevance": "Suit filed with Collector's sanction for framing scheme of public charitable trust."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; decree of trial court and High Court declaring properties as public trust properties and directing scheme set aside; properties held to be private subject only to charge/obligation for charities from 1919 deed; appellants conceded charge.",
    "relief_granted": "Declaration that properties in hands of appellants subject to charge in favour of charities.",
    "costs": "Parties to bear own costs (inferred from earlier decree, not specified anew)."
  },
  "key_quotes": [
    {
      "text": "Dedication to charity need not necessarily be by instrument or grant. It can be established by clear and satisfactory evidence of conduct of the parties and user of the property which show the extinction of the private secular character of the property and its complete dedication to charity.",
      "speaker": "court",
      "significance": "States principles for determining complete vs partial dedication."
    },
    {
      "text": "Whether or not dedication is complete would naturally be a question of fact to be determined in each case in the light of the material terms used in the document... intention must be gathered on a fair and reasonable construction of the document considered as a whole.",
      "speaker": "court",
      "significance": "Key test for interpreting documents on dedication."
    },
    {
      "text": "We are satisfied that the properties continue to be the properties of Purushottam until his death and on his death they devolved upon his grandson Ramalingeswara Rao subject always to the burden of performing the charities mentioned in the earlier deed of trust.",
      "speaker": "court",
      "significance": "Core holding reversing lower courts."
    },
    {
      "text": "We accordingly declare that the properties in the hands of the appellants are subject to the charge in favour of the said charities.",
      "speaker": "court",
      "significance": "Final relief granted."
    }
  ],
  "_case_id": "1957_97",
  "_label": 1,
  "_text_length": 36235,
  "_extracted_at": "2026-02-10T19:23:52.190862"
}