{
  "metadata": {
    "case_name": "Trustees of J.K. Trust, Bombay v. Commissioner of Income-tax",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar, J."
    ],
    "case_number": "Appeal by special leave",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On June 15, 1945, three brothers Sir Padampat Singhania, Lala Kailashpat Singhania and Lala Lakshmipat Singhania who were carrying on business under the name of Juggilal Kamlapat, executed a deed of trust, Ex. A, whereby they settled a sum of Rs. 1,00,000 on various charities specified therein and called the J.K. Trust, Bombay, and appointed themselves and two other persons Lala Ramdeo Podar and Sir Chunnilal Mehta as its trustees.",
      "type": "background",
      "date": "1945-06-15",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The trust deed provided inter alia that the trustees may with the help of the trust fund, for and on behalf of and for the benefit of the trust, carry on such business including the taking up and conducting the managing agency or selling agency of any company in such name or names as they in their absolute discretion may think fit and proper and may close and re-start such business and utilise the profits for all or any of the objects aforesaid. Large powers were conferred on them in the conduct of the business, and they were also authorised to raise or borrow money required for the purpose of the trust.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "At this time, Messrs. E. D. Sassoon and Co., Ltd. were the managing agents of a public Company called the Raymond Woollen Mills Ltd. The firm of Juggilal Kamlapat of which the three Singhania brothers were the partners, acquired controlling interest in the said Mills by purchase of the shares of Messrs. E. D. Sassoon and Co. therein.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Following on this, the share-holders passed a special resolution on September 3, 1945, appointing the trustees of the J.K. Trust as managing agents of the Company in the place of Messrs. E. D. Sassoon and Co., Ltd., who resigned.",
      "type": "material",
      "date": "1945-09-03",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On September 10, 1945, a memorandum of agreement, Ex. B, was duly executed by the Company constituting the trustees of the J.K. Trust, Bombay, as its managing agents on the terms and conditions set out therein. It is to be noted that the five persons named as trustees under Ex. A were appointed as managing agents in their character as trustees, and it is expressly provided therein that the expression managing agents, unless excluded by or repugnant to the context shall include the Trustees for the time being of the said Trust or any other Trust with which the same may be amalgamated.",
      "type": "material",
      "date": "1945-09-10",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The agency was to be for a period of 20 years but it was open to the trustees to throw it up on giving three months notice. The managing agents were to get a remuneration of 10 per cent. of the net annual profits subject to a minimum of Rs. 50,000 and an office allowance of Rs. 1,000 per mensem.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Clause 7 of the agreement provided that, During the continuance of this agreement, the Managing Agents shall maintain with the Company a deposit of Rs. 1,00,000 (Rupees one lac only) in cash by way of security for due fulfilment of their obligations as specified therein and shall be entitled to charge interest at 3 1/2 per cent. per annum on the amount of such deposit in addition to their remuneration.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Clause 8 laid an obligation on the managing agents to arrange loans and advances to the Company as and when required up to and not exceeding Rs. 10 lacs at any time and if necessary to guarantee such loans or advances from time to time.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Under clause 14, Notwithstanding anything herein contained, all the terms and conditions of this Agreement including the period of appointment of the Managing Agents may be varied or abrogated by mutual agreement.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The trustees entered on their duties as managing agents under this agreement, and by an agreement dated May 14, 1946, they appointed one Tej Narain Khaitan, son-in-law of one of the three Singhania brothers as their representative to carry on the managing agency work on a remuneration of 30 per cent. of the annual income which would be payable to them under Ex. B.",
      "type": "procedural",
      "date": "1946-05-14",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The dispute between the parties relates to the assessment of income-tax for the assessment years 1946-47, 1947-48 and 1948-49 and of excess profits tax for the chargeable accounting periods, September 3, 1945, to March 31, 1946, April 1, 1946, to March 31, 1947 and April 1, 1947, to March 31, 1948.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Before the Income-tax authorities, the appellant claimed that the income derived from the managing agency was income derived from property held under trust to be applied wholly for charitable purposes, and was, in consequence, exempt from taxation under s. 4(3)(i) of the Act.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "The Income-tax authorities held that the income in question was remuneration for services rendered, and was not derived from any property, and that, therefore, it did not fall within s. 4(3)(i) of the Act. They further held that even if the managing agency business could be regarded as property within s. 4(3)(i), it was governed by the special provision contained in s. 4(3)(ia), and as the conditions laid down therein had not been satisfied, no exemption could be claimed.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "In this view, they allowed a sum of Rs. 30,000 per annum for remuneration of Mr. Khaitan as a deduction under s. 10(2)(x) of the Act, and held that the balance of the income, Rs. 23,287 in 1946-47, Rs. 36,786 in 1947-48 and Rs. 2,16,460 in 1948-49 was liable to be taxed under the provisions of the taxing statutes.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "On applications made by the assessee under s. 66(1) of the Act and the corresponding provisions in the Excess Profits Tax Act and the Business Profits Tax Act, the Tribunal referred the following questions for the decision of the High Court of Bombay.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Questions referred: 1. Whether on the facts of the case the commission earned by the managing agents for managing the Raymond Woollen Mills was income earned by the managing agents for services rendered and not income derived from property held under trust or for other legal obligations and therefore not exempt under s. 4(3)(i) of the Income-tax Act? 2. Whether on the facts of the case the business carried on by the Trustees fall to be considered under s. 4(3)(i) or s. 4(3)(ia) of the Income-tax Act?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "The reference was heard by Chagla, C.J., and Tendolkar, J., who held that no part of the sum of Rs. 1,00,000 which was the only property settled on trust under Ex. A was actually invested in the managing agency business, which could not, therefore, be regarded as trust property, and that the income received from that business was not within the exemption enacted in s. 4(3)(i). They accordingly answered the first question against the appellant.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "As regards the second question, the learned Judges held that it was unnecessary to express any opinion thereon, as it was common ground that even if s. 4(3)(ia) applied, neither of the conditions laid down in sub-clause (a) or (b) had been fulfilled, and that accordingly no relief could be granted thereunder.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether the income received by the trustees of J.K. Trust, Bombay, as managing agents of Raymond Woollen Mills, Ltd., is income derived from property held on trust or on an obligation in the nature of trust",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "whether the claim for exemption in respect of such income is to be determined under s. 4(3)(i) or s. 4(3)(ia)",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "managing agency is business and therefore it is property, and that it is property held on trust because it is conducted by the trustees on behalf of the trust with the help of trust properties and in accordance with the directions contained in the trust deed.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "s. 4(3)(i) of the Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "even if the business is not held on trust, it is at least held, on the principle laid down in s. 88 of the Trusts Act, on an obligation in the nature of trust, and that s. 4(3)(ii) is, in consequence, attracted.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "s. 88 Trusts Act; s. 4(3)(ii)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "there can be no trust of such agency, because it really involves rendering of services and cannot be said to be property in respect of which alone trust can be created, and further because managing agency is an office, and that again is not property.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "ss. 2(9A), 87A and 87B of the Indian Companies Act"
    },
    {
      "id": "ra2",
      "text": "in any event, the managing agency created under Ex. B could not be held to be trust property, because it could be terminated at any time, if the trustees so desired, on three months notice and that there could be no trust of such a precarious, ephemeral or evanescent kind of property, if indeed it could be held to be property.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "s. 88 was inapplicable, as there was no property which was held on an obligation in the nature of a trust.",
      "supporting_facts": [],
      "legal_basis": "s. 88 Trusts Act"
    },
    {
      "id": "ra4",
      "text": "even if under the general law, the word property is wide enough in its significance to include business, in its context in s. 4(3)(i) read along with s. 4(3)(ia) it bears a more restricted sense as meaning only property other than business.",
      "supporting_facts": [],
      "legal_basis": "s. 4(3)(i) and s. 4(3)(ia) Income-tax Act; Generalia specialibus non derogant"
    },
    {
      "id": "ra5",
      "text": "on the terms of Ex. A, the properties which the trustees are to hold and stand possessed of are the sum of Rupees One Lac and any donations or contributions received by the Trustees and all accretions thereto and thereof and the investments in securities for the time being and from time to time representing the same, that on the terms aforesaid, the managing agency cannot be held to be property held in trust, as no part of the sum of Rs. 1,00,000 was utilised in the acquisition of the business so as to impress it with the character of accretion.",
      "supporting_facts": [
        "f1",
        "f7"
      ],
      "legal_basis": "Ex. A clause 3"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Whether a managing agency could be regarded as business was considered by this Court in Lakshminarayan Ram Gopal and Son Ltd. v. The Government of Hyderabad, where ... it was held that it was business, and that the profits therefrom were rightly assessed to tax under the Act. The law must therefore be taken to be settled beyond controversy that managing agency is itself business.",
      "addresses_issue": "i1",
      "key_observation": "managing agency is business"
    },
    {
      "id": "cr2",
      "text": "property is a term of the widest import, and subject to any limitation or qualification which the context might require, it signifies every possible interest which a person can acquire, hold and enjoy. Business would undoubtedly be property, unless there is something to the contrary in the enactment.",
      "addresses_issue": "i1",
      "key_observation": "property includes business"
    },
    {
      "id": "cr3",
      "text": "confining ourselves solely to the language of s. 4(3)(i), there is nothing in it which restricts in any manner the normal and accepted meaning of the word property, and excludes business from its connotation.",
      "addresses_issue": "i1",
      "key_observation": "s. 4(3)(i) includes business as property"
    },
    {
      "id": "cr4",
      "text": "This is direct authority in support of the contention of the appellant [All India Spinners Association v. CIT].",
      "addresses_issue": "i1",
      "key_observation": "business held under trust exempt u/s 4(3)(i)"
    },
    {
      "id": "cr5",
      "text": "even an office of trusteeship was held to be property especially when emoluments were attached to it, and that must a fortiori be the position in the case of office of managing agency, which is clearly one of profit and even alienable under certain circumstances.",
      "addresses_issue": "i1",
      "key_observation": "managing agency office is property"
    },
    {
      "id": "cr6",
      "text": "the fact that the trustees have the option at any time to throw up the managing agency is no legal impediment to its being property which could be held on trust.",
      "addresses_issue": "i1",
      "key_observation": "precarious nature no bar to trust"
    },
    {
      "id": "cr7",
      "text": "clause 3 of the trust deed expressly provides for the acquisition of the business of managing agency on behalf of the trust and with the help of the trust fund, and that precisely is what has happened and indeed, reading together Exs. A and B, it is impossible to resist the conclusion that both the documents formed part of an integral scheme, and that what the settlors had in view in clause 3 of Ex. A is the very managing agency, which was acquired under Ex. B.",
      "addresses_issue": "i1",
      "key_observation": "Rs. 1 lac impressed on managing agency business per trust scheme"
    },
    {
      "id": "cr8",
      "text": "In the result, we are of opinion that the word property in s. 4(3)(i) of the Act is of sufficient amplitude to comprehend business, and if the question fell to be decided solely on the terms of that sub-section, the managing agency constituted under Ex. B must be treated as property held on trust within s. 4(3)(i) of the Act.",
      "addresses_issue": "i1",
      "key_observation": "managing agency income derived from property held under trust u/s 4(3)(i)"
    },
    {
      "id": "cr9",
      "text": "This conclusion, however, is not sufficient to dispose of the appeal in favour of the appellant, because there is still the question raised by the respondent that even if under the general law, the word property is wide enough ... in its context in s. 4(3)(i) read along with s. 4(3)(ia) it bears a more restricted sense as meaning only property other than business.",
      "addresses_issue": "i2",
      "key_observation": "s. 4(3)(ia) may restrict s. 4(3)(i) for business"
    },
    {
      "id": "cr10",
      "text": "Learned counsel on both sides agree that it would be more satisfactory that this question should be remitted to the High Court for determination.",
      "addresses_issue": "i2",
      "key_observation": "remit second question to High Court"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "the word property in s. 4(3)(i) of the Act is of sufficient amplitude to comprehend business, and ... the managing agency constituted under Ex. B must be treated as property held on trust within s. 4(3)(i) of the Act.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "remand the case to the High Court of Bombay for a fresh disposal of the reference on a consideration of the second question.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Lakshminarayan Ram Gopal and Son Ltd. v. The Government of Hyderabad",
      "citation": null,
      "treatment": "followed",
      "relevance": "managing agency is business"
    },
    {
      "case_name": "In re The Tribune",
      "citation": "1935 3 I.T.R. 246",
      "treatment": "referred",
      "relevance": "property in s. 4(3)(i) includes business"
    },
    {
      "case_name": "In re The Trustees of the Tribune",
      "citation": "1939 7 I.T.R. 415 L.R. 66 I.A. 241",
      "treatment": "followed",
      "relevance": "property held under trust for charitable purposes"
    },
    {
      "case_name": "All India Spinners Association v. Commissioner of Income-tax, Bombay",
      "citation": "1944 12 I.T.R. 482 L.R. 71 I.A. 159",
      "treatment": "followed",
      "relevance": "business is property u/s 4(3)(i); organisation and undertaking as property"
    },
    {
      "case_name": "Eggar v. Commissioner of Income-tax",
      "citation": "1926 2 I.T.C. 286",
      "treatment": "distinguished",
      "relevance": "remuneration for services not dedicated to trust"
    },
    {
      "case_name": "Angurbala Mullick v. Debabrata Mullick",
      "citation": "1951 S.C.R. 1125",
      "treatment": "followed",
      "relevance": "office of trusteeship is property"
    },
    {
      "case_name": "The Commissioner, Hindu Religious Endowments, Madras v. Sri Lakshmindra Thirtha Swamiar of Sri Shirur Mutt",
      "citation": "1954 S.C.R. 1005, 1019",
      "treatment": "followed",
      "relevance": "office with emoluments is property"
    },
    {
      "case_name": "Rocke v. Hart",
      "citation": "1805 11 Ves. Jun. 58 32 E.R. 1009, 1010",
      "treatment": "referred",
      "relevance": "trust fund aiding business impresses business as trust property"
    },
    {
      "case_name": "Moons v. De Bernales",
      "citation": "1826 1 Russ. 301 38 E.R. 117",
      "treatment": "referred",
      "relevance": "trust fund aiding business impresses business as trust property"
    },
    {
      "case_name": "Commissioner of Income-tax, Madras v. Arunachalam Chettiar",
      "citation": "I.L.R. 1926 49 Mad. 833",
      "treatment": "referred",
      "relevance": "business profits not exempt pre-s.4(3)(ia)"
    },
    {
      "case_name": "Coman v. Governors of the Rotunda Hospital, Dublin",
      "citation": "1921 A.C. 1",
      "treatment": "followed",
      "relevance": "business profits not exempt pre-s.4(3)(ia)"
    },
    {
      "case_name": "Lachhman Das Narain Das, In re",
      "citation": "I.L.R. 1925 47 All. 68",
      "treatment": "referred",
      "relevance": "business profits not exempt pre-s.4(3)(ia)"
    },
    {
      "case_name": "Charitable Gadodia Swadeshi Stores v. Commissioner of Income-tax, Punjab",
      "citation": null,
      "treatment": "referred",
      "relevance": "s.4(3)(i) and s.4(3)(ia) distinct; business may fall under s.4(3)(i)"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 4(3)(i)",
        "s. 4(3)(ia)",
        "s. 4(3)(ii)",
        "s. 10(2)(x)",
        "s. 66(1)"
      ],
      "relevance": "exemption for income from property held under trust for charitable purposes; special provision for business income of trusts; deduction for remuneration; reference to HC"
    },
    {
      "name": "Excess Profits Tax Act, 1940",
      "sections": [
        "ss. 21",
        "19"
      ],
      "relevance": "read with s.66(1) IT Act for reference"
    },
    {
      "name": "Business Profits Tax Act, 1947",
      "sections": [
        "s. 19"
      ],
      "relevance": "read with s.66(1) IT Act for reference"
    },
    {
      "name": "Indian Trusts Act, 1882",
      "sections": [
        "s. 88",
        "s. 77(c)"
      ],
      "relevance": "obligation in nature of trust; extinction of trust if no property left"
    },
    {
      "name": "Indian Companies Act",
      "sections": [
        "s. 2(9A)",
        "s. 87A",
        "s. 87B"
      ],
      "relevance": "managing agency as office"
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "The Supreme Court held that managing agency is business and constitutes property held under trust within s.4(3)(i) of the Income-tax Act, 1922, answering the first question in favour of the appellant. However, the second question regarding whether exemption is under s.4(3)(i) or the special provision s.4(3)(ia) was remitted to the Bombay High Court for fresh determination, as counsel agreed it was more satisfactory.",
    "relief_granted": "First question answered in favour of appellant; case remanded for second question",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "property is a term of the widest import, and subject to any limitation or qualification which the context might require, it signifies every possible interest which a person can acquire, hold and enjoy.",
      "speaker": "court",
      "significance": "Defines scope of 'property' u/s 4(3)(i)"
    },
    {
      "text": "the word property in s. 4(3)(i) of the Act is of sufficient amplitude to comprehend business",
      "speaker": "court",
      "significance": "Holds business including managing agency as 'property' for exemption"
    },
    {
      "text": "In the result, we remand the case to the High Court of Bombay for a fresh disposal of the reference on a consideration of the second question.",
      "speaker": "court",
      "significance": "Final disposition remanding case"
    }
  ],
  "_case_id": "1957_50",
  "_label": 1,
  "_text_length": 25882,
  "_extracted_at": "2026-02-08T22:36:16.793442"
}