{
  "metadata": {
    "case_name": "Appellant v. State of Uttar Pradesh",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "SINHA J."
    ],
    "case_number": "Criminal Appeal No. 82 of 1957",
    "date_of_judgment": "1957-10-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant charged under ss. 408 and 477A of the Indian Penal Code for criminal breach of trust in respect of valuable securities amounting to Rs. 7,410 odd of the Imperial Bank at Allahabad while employed as a clerk, and falsified accounts and papers during January to July 1946.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Trial by jury of 5 in Sessions Trial No. 22 of 1949 before Additional Sessions Judge at Allahabad.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Jury returned unanimous verdict of not guilty; Additional Sessions Judge accepted verdict and acquitted appellant on July 31, 1950.",
      "type": "procedural",
      "date": "1950-07-31",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Government of Uttar Pradesh appealed to Allahabad High Court in Criminal Appeal No. 114 of 1951.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Allahabad High Court (Desai and Beg JJ.) set aside acquittal on August 12, 1953, convicted appellant under ss. 408 and 477A IPC, sentenced to 4 years RI and fine of Rs. 10,000 (Rs. 7,000 as compensation to Imperial Bank) under s. 408, and 4 years RI under s. 477A, sentences consecutive.",
      "type": "procedural",
      "date": "1953-08-12",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "High Court refused certificate for appeal to Supreme Court; special leave granted by Supreme Court on December 15, 1953.",
      "type": "procedural",
      "date": "1953-12-15",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Case involved large volume of documentary evidence in English; oral evidence to connect documents and explain bearing on charges.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Prosecution witness No. 26 (Mr. Ganguli, Agent of Bank) examined over 12 days, evidence in English spanning 45 typed pages.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "High Court found case complicated, mass of English documents, decision rested on authorship; not fit for ordinary jury.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Of five jurors: three had sufficient English knowledge; fourth knew very little and could not read documents; fifth could understand letter with difficulty, could not read English newspapers.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Jurors Shri Sheik Ashique Ali and Shri Farman Ali not in position to decide authorship of forged documents satisfactorily.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the State appeal to High Court was maintainable as memorandum of appeal did not comply with ss. 418 and 419 CrPC, specifying no particular error of law.",
      "framed_by": "appellant"
    },
    {
      "id": "i2",
      "text": "Whether the Sessions Court trial was a valid trial, given jury's insufficient knowledge of English to understand documents and decide authorship.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "State appeal memorandum inadequate, only bald ground that acquittal against weight of evidence and contrary to law; under s. 418 CrPC for jury trials, appeal lies only on matter of law, no specific error set out, so no valid petition of appeal.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "ss. 418, 419 CrPC"
    },
    {
      "id": "pa2",
      "text": "Trial not a trial at all (coram non judice) because jurors lacked sufficient English to understand proceedings and documents.",
      "supporting_facts": [
        "f2",
        "f7",
        "f8",
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Incompetence of jury raised by State in High Court but no prejudice to accused as jury returned unanimous verdict of not guilty.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Memorandum of appeal inadequate but not null and void; High Court correct it complied with s. 419 CrPC requirements; disapprove practice of bald grounds as unhelpful, wastes time.",
      "addresses_issue": "i1",
      "key_observation": "Defect not fatal to entertain appeal."
    },
    {
      "id": "cr2",
      "text": "Case complicated with English documents; two jurors (Sheik Ashique Ali, Farman Ali) lacked sufficient English to decide authorship satisfactorily; not mere irregularity but no trial at all (coram non judice), miscarriage of justice irrespective of verdict.",
      "addresses_issue": "i2",
      "key_observation": "Effect of incompetent juror denies essential protection to accused."
    },
    {
      "id": "cr3",
      "text": "Analogous to Ras Behari Lal v. King Emperor where Privy Council held no trial due to juror incompetence, convictions set aside.",
      "addresses_issue": "i2",
      "key_observation": "Question of prejudice does not arise in case of mis-trial."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appeal to Supreme Court succeeds on second ground; High Court convictions and sentences set aside as no valid trial due to jury incompetence.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "State appeal memorandum defect not fatal.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ras Behari Lal v. The King Emperor",
      "citation": "1933 L.R. 60 I.A. 354",
      "treatment": "followed",
      "relevance": "Analogous: jury incompetence due to lack of English led to no trial, miscarriage of justice, convictions set aside."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "408",
        "477A"
      ],
      "relevance": "Sections under which appellant charged and convicted by High Court."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "418",
        "419",
        "367",
        "269(2)"
      ],
      "relevance": "s.418 limits jury trial appeals to law; s.419 on petition of appeal; s.367 on charge heads; s.269(2) on special jury."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, set aside High Court convictions and sentences, holding the Sessions trial invalid due to jury incompetence in understanding English documents; open to State for retrial if advised.",
    "relief_granted": "Convictions and sentences set aside",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"We consider that the instant case was not fit to be tried by a jury at least by any ordinary jury. It was a very complicated case in which a mass of documents was produced.\"",
      "speaker": "court",
      "significance": "High Court observation on case complexity and jury unsuitability."
    },
    {
      "text": "\"Out of the five jurors... two jurors, Shri Sheik Ashique Ali and Shri Farman Ali, were not in a position to decide the question of authorship of the forged documents satisfactorily.\"",
      "speaker": "court",
      "significance": "High Court finding on specific jurors' incompetence, basis for mis-trial."
    },
    {
      "text": "\"the effect of the incompetence of a juror is to deny to the accused an essential part of the protection accorded to him by law and that the result of the trial in the present case was a clear miscarriage of justice.\"",
      "speaker": "court",
      "significance": "Quoting Privy Council in Ras Behari Lal, applied to instant case."
    }
  ],
  "_case_id": "1957_87",
  "_label": 1,
  "_text_length": 14215,
  "_extracted_at": "2026-02-08T22:36:32.783053"
}