{
  "metadata": {
    "case_name": "Ratepayers of Shegaon Municipal Committee v. Municipal Committee of Shegaon & State of Bombay",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Civil Appeal No. 234 of 1959",
    "date_of_judgment": "1961-03-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are ratepayers of the Municipal Committee of Shegaon (respondent No. 1) carrying on trade and business involving bringing goods within the limits of the Municipal Committee. Respondent No. 2 is the State of Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On July 25, 1954, the Municipal Committee passed a resolution for the purpose of levying an octroi duty instead of terminal tax.",
      "type": "procedural",
      "date": "1954-07-25",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The resolution was published in the State Gazette on June 29, 1956, along with rules for assessment.",
      "type": "procedural",
      "date": "1956-06-29",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On August 4, 1956, objections were invited to the proposed tax.",
      "type": "procedural",
      "date": "1956-08-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Objections by the first appellant were filed on August 4, 1956, and by some others (appellants Nos. 2 to 6) on August 5 and 6.",
      "type": "procedural",
      "date": "1956-08-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "At a meeting of the Municipal Committee dated August 16, 1956, the objections of the other appellants were rejected as being time barred and those by the first appellant were rejected because it was the only objector whose objections were within time.",
      "type": "procedural",
      "date": "1956-08-16",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Some representations were made by the first appellant to the Government and a few days later the other objectors also made similar representations.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Government issued the notification sanctioning the imposition of the tax and the Draft Rules on October 27, 1956.",
      "type": "procedural",
      "date": "1956-10-27",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Gazette Notifications were published on October 30 and October 31, 1956.",
      "type": "procedural",
      "date": "1956-10-30",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellants filed a petition under Art. 226 in the High Court of Bombay at Nagpur challenging the legality of the imposition of the tax.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "High Court rejected the ground that notification was ultra vires due to non-compliance with s.67 but accepted the objection that the rate of tax in regard to certain articles was unauthorised exceeding the maximum, and gave relief accordingly. Order dated February 15, 1957.",
      "type": "procedural",
      "date": "1957-02-15",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellants Nos. 2 to 6 have not taken steps for the prosecution of the appeal and the appeal, in so far as it relates to them, is dismissed for non-prosecution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the notification was ultra vires because s. 67 of the C. P. Berar Municipalities Act, 1922 had not been complied with, as objections raised by appellant No. 1 were not considered on their merits and were rejected merely on the ground that there was only one objector.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether there was no notification imposing an octroi duty.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the rate of tax in regard to certain articles was unauthorised in that it was more than the maximum which could be levied under the law.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The notification was ultra vires because s. 67 had not been complied with as the objections raised by appellant No. 1, though within time, were not considered on their merits and were rejected merely on the ground that there was only one objector, which was one of the essential steps.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Section 67 of the C. P. Berar Municipalities Act, 1922"
    },
    {
      "id": "pa2",
      "text": "As a matter of fact there was no notification imposing an octroi duty and therefore the question of conclusive evidence does not arise.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Section 67(8) of the C. P. Berar Municipalities Act, 1922"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The High Court rejected the plea of non-compliance with s.67 because of s.67(8), which provides that the issuance of the notification imposing a tax shall be conclusive evidence that the tax had been imposed in accordance with the provisions of the Act, although it found that non-consideration of the objections was an error in procedure.",
      "addresses_issue": "i1",
      "key_observation": "Language of sub-s. (8) lends support to this view."
    },
    {
      "id": "cr2",
      "text": "There were two notifications issued by the Government on October 27, 1956, published on October 30 and 31. The second notification is under sub-s. (2) of s.67 but appears to be a mistake and should have been under sub-s. (7) of s.67. It confirms the draft rules for the imposition of the octroi tax, with Rule 1 stating octroi shall be levied on commodities at specified rates, and includes schedules. This notification directs imposition of octroi and falls within sub-s. (7) of s.67.",
      "addresses_issue": "i2",
      "key_observation": "Having been notified in the Gazette it is conclusive evidence of the tax having been imposed in accordance with the provisions of the Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The notification imposing the octroi duty is conclusive evidence under s.67(8) that the tax has been imposed in accordance with the Act, and cannot be challenged on the ground that all necessary steps had not been taken.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The second notification dated October 27, 1956 directs the imposition of octroi duty under s.67(7).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "C. P. Berar Municipalities Act, 1922 (Act II of 1922)",
      "sections": [
        "Section 66",
        "Section 67",
        "Section 71",
        "Section 76",
        "Section 85"
      ],
      "relevance": "Governs imposition, assessment, collection of taxes including procedure for octroi duty; s.67(7) and (8) provide for government notification directing imposition and it being conclusive evidence of compliance."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for the petition filed in the High Court challenging the imposition."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed for non-prosecution insofar as it relates to appellants Nos. 2 to 6. For appellant No. 1, the challenge to the vires of the octroi imposition on grounds of non-compliance with s.67 and absence of notification rejected; notifications held valid and conclusive evidence of proper imposition.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A notification of the imposition of a tax under this section shall be conclusive evidence that the tax has been imposed in accordance with the provision of this Act.",
      "speaker": "court",
      "significance": "Quotes s.67(8) which upholds the validity of the imposition despite procedural irregularities."
    },
    {
      "text": "This notification therefore clearly is one which directs imposition of octroi and falls within sub-s. (7) of s. 67 and having been notified in the Gazette it is conclusive evidence of the tax having been imposed in accordance with the provisions of the Act.",
      "speaker": "court",
      "significance": "Court's key holding on the effect of the notifications."
    }
  ],
  "_case_id": "1957_72",
  "_label": 0,
  "_text_length": 9351,
  "_extracted_at": "2026-02-08T22:36:35.322653"
}