{
  "metadata": {
    "case_name": "Newspapers Ltd., Allahabad v. State of U.P. & Ors.",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur J."
    ],
    "case_number": "Civil Appeal No. 213 of 1956",
    "date_of_judgment": "1957-03-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Tajammul Hussain, respondent No. 3, was employed as a linotypist by the appellant company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Tajammul Hussain was dismissed on May 8, 1952, on allegations of incompetence under r. 12(ii) of the Standing Orders of the appellant company.",
      "type": "material",
      "date": "1952-05-08",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Dismissal of respondent No. 3 was welcomed by his co-workers and other workmen; they made no grievance of it and did not espouse his cause.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Case of respondent No. 3 was not taken up by any union of workers of the appellant company or by any unions of workmen in similar or allied trades.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "P. Working Journalists Union, Lucknow, with which respondent No. 3 had no connection, took the matter to the Conciliation Board, Allahabad.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "U.P. Government made a reference to the Industrial Tribunal on June 3, 1953, by notification stating an industrial dispute exists between Newspapers Ltd., Allahabad and its workmen; one question referred: Whether the services of Sri Tajammul Hussain Lino Operator were wrongfully terminated by the Management.",
      "type": "procedural",
      "date": "1953-06-03",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "State Industrial Tribunal at Allahabad decided in favour of respondent No. 3 on February 13, 1954, ordering reinstatement without break of continuity of service and payment of wages for the period he remained dismissed.",
      "type": "procedural",
      "date": "1954-02-13",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant company appealed to the Labour Appellate Tribunal, which affirmed the Tribunal's order with costs on February 24, 1954.",
      "type": "procedural",
      "date": "1954-02-24",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant company filed petition in Allahabad High Court under Art. 226 of the Constitution, dismissed by Bhargava J. on January 6, 1954.",
      "type": "procedural",
      "date": "1954-01-06",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Special Appeal No. 8 of 1954 against High Court judgment dismissed on September 22, 1954.",
      "type": "procedural",
      "date": "1954-09-22",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant company appealed to Supreme Court with certificate under Art. 133(1)(c) of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a dispute between an employer and a single workman falls within the definition of 'industrial dispute' as used in the U.P. Industrial Disputes Act, 1947.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No industrial dispute existed within the meaning of the U.P. Industrial Disputes Act, 1947, and consequently the U.P. Government had no power to make the reference in question.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Section 2(k) of Industrial Disputes Act, 1947; definition in U.P. Act"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The scheme of the U.P. Act is to maintain industrial peace through collective amity via conciliation, mediation and adjudication; it is not to replace ordinary tribunals for individual contracts.",
      "addresses_issue": "i1",
      "key_observation": "Provisions lead to conclusion that applicability to individual dispute excluded unless it acquires characteristics of industrial dispute by workmen as a body or considerable section making common cause."
    },
    {
      "id": "cr2",
      "text": "Rules 4, 5, 15 do not support inclusion of individual disputes; singular/plural under General Clauses Act s.13(2) does not alter; r.26 and s.18 Central Act indicate collective disputes.",
      "addresses_issue": "i1",
      "key_observation": "Executive cannot enlarge scope of 'industrial dispute' via rules."
    },
    {
      "id": "cr3",
      "text": "Awards bind all workmen and future entrants, supporting collectiveness; prohibition on changes during pendency ensures industrial truce.",
      "addresses_issue": "i1",
      "key_observation": "Individual dispute not industrial dispute unless espoused by trade union or number of workmen."
    },
    {
      "id": "cr4",
      "text": "Notification assumed dispute between employer and 'workmen' but was only about single workman; Government under misapprehension.",
      "addresses_issue": "i1",
      "key_observation": "Party can challenge lack of industrial dispute even if reference is administrative act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A dispute between an employer and a single workman does not fall within the definition of 'industrial dispute' under the U.P. Industrial Disputes Act, 1947, unless taken up by a trade union or a number of workmen.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Central Provinces Transport Services Ltd. v. Raghunath Gopal Patwardhan",
      "citation": "1956 S.C.R. 956",
      "treatment": "followed",
      "relevance": "Discussed scope of industrial dispute; individual dispute not intended unless taken up by union or number of workmen."
    },
    {
      "case_name": "D.N. Banerji v. P.R. Mukherjee",
      "citation": "1953 S.C.R. 302",
      "treatment": "followed",
      "relevance": "Industrial dispute affects large groups; single case may become one if taken up by trade union."
    },
    {
      "case_name": "State of Madras v. C.P. Sarathy",
      "citation": null,
      "treatment": "referred",
      "relevance": "Right to challenge absence of industrial dispute despite administrative reference."
    },
    {
      "case_name": "Kandan Textile Ltd. v. Industrial Tribunal, Madras",
      "citation": "A.I.R. 1951 Madras 616",
      "treatment": "followed",
      "relevance": "Individual dispute not industrial dispute despite wide definition, considering s.18."
    },
    {
      "case_name": "Swadeshi Cotton Mills Co. Ltd. v. Their Workmen",
      "citation": "1953 1 L.L.J. 757",
      "treatment": "distinguished",
      "relevance": "Held individual dispute is industrial; overruled as incorrect."
    },
    {
      "case_name": "Chowdhury v. M.C. Bannerjee",
      "citation": "1935 55 C.W.N. 256",
      "treatment": "followed",
      "relevance": "Individual dismissal not industrial dispute under Central Act."
    },
    {
      "case_name": "Metal Trades Employers Association v. Amalgamated Engineering Union",
      "citation": "1935 54 C.L.R. 387",
      "treatment": "referred",
      "relevance": "Industrial disputes are group contests."
    }
  ],
  "statutes_cited": [
    {
      "name": "U.P. Industrial Disputes Act, 1947",
      "sections": [
        "s.2",
        "s.3",
        "s.8",
        "s.23",
        "Rules 4,5,7-11A,15,26,28"
      ],
      "relevance": "Defines industrial dispute; empowers reference only for collective disputes to maintain industrial peace."
    },
    {
      "name": "Industrial Disputes Act, 1947 (Central)",
      "sections": [
        "s.2(k)",
        "s.10",
        "s.18",
        "s.33",
        "s.33A",
        "s.36(1)"
      ],
      "relevance": "Definition adopted by U.P. Act; scheme contemplates collective disputes; awards bind all workmen."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226",
        "Art. 133(1)(c)"
      ],
      "relevance": "Basis for High Court writ and SC appeal."
    },
    {
      "name": "General Clauses Act",
      "sections": [
        "s.13(2)"
      ],
      "relevance": "Singular includes plural, but does not alter collective nature."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court held no industrial dispute existed as it was solely between employer and single workman not espoused by body of workmen; orders of Tribunal, Appellate Tribunal, and High Court set aside; reference invalid.",
    "relief_granted": "Order of Industrial Tribunal set aside",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The provisions of the U.P. Act show that the machinery of the Act has been devised with the object of maintaining industrial peace so as to prevent interference with public safety or public order...\"",
      "speaker": "court",
      "significance": "Explains purpose of Act limited to collective disputes."
    },
    {
      "text": "\"...its applicability to an individual dispute as opposed to dispute involving a group of workmen is excluded unless it acquires the general characteristics of an industrial dispute...\"",
      "speaker": "court",
      "significance": "Core holding on when individual dispute becomes industrial."
    },
    {
      "text": "\"...a single employee's case might develop into an industrial dispute, when... it is taken up by the trade union of which he is a member...\"",
      "speaker": "court",
      "significance": "Condition for individual dispute to qualify."
    }
  ],
  "_case_id": "1957_94",
  "_label": 1,
  "_text_length": 28305,
  "_extracted_at": "2026-02-10T19:23:38.159698"
}