{
  "metadata": {
    "case_name": "Amar Singh and four others v. Custodian-General of Evacuee Property",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Jagannadhadas, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioners are displaced persons who owned land in Chak No. 159-RB, Tahsil Jaranwala, District Lyallpur in Pakistan and were co-sharers in a joint khata owned by evacuees in village Sultanwind, suburb of Amritsar in East Punjab.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "On displacement, petitioners were temporarily allotted agricultural land in Sultanwind and in 1949 allotted total 38 standard acres and 13 units of agricultural land on quasi-permanent basis.",
      "type": "material",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Director-General of Relief and Rehabilitation Additional Custodian directed on January 7, 1950, allotment of 142 standard acres and 5 units of suburban land of Amritsar to allottees of Provincial Gardens, necessitating readjustment of allotments in Sultanwind.",
      "type": "material",
      "date": "1950-01-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Deputy Custodian, Amritsar proposed cancellation of petitioners' allotment on July 31, 1951, approved by Custodian Financial Commissioner, Relief and Rehabilitation on February 6, 1952; passed without notice to petitioners.",
      "type": "procedural",
      "date": "1951-07-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Petitioners filed revision under s. 27 of Administration of Evacuee Property Act, 1950 before Custodian-General, dismissed by Deputy Custodian-General on May 1, 1954 after hearing parties.",
      "type": "procedural",
      "date": "1954-05-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Partition of India on August 15, 1947 led to mass migrations: about 5 million Non-Muslims from West Punjab to East Punjab; displaced persons left 67 lakh acres in Pakistan, evacuees left 47 lakh acres in East Punjab and Pepsu.",
      "type": "background",
      "date": "1947-08-15",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Government introduced quasi-permanent allotments via Press Communique dated February 7, 1948; allotments not conferring ownership or permanent occupancy but maintaining possession.",
      "type": "background",
      "date": "1948-02-07",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Petitioners' allotment was on quasi-permanent basis; cancellation undisputedly under Administration of Evacuee Property Act, 1950 and rules.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Petitioners have not obtained sanad under Displaced Persons Compensation and Rehabilitation Rules, 1955.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the rights of a quasi-permanent allottee constitute property within the meaning of Arts. 19(1)(f), 31(1) and 31(2) of the Constitution.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the orders of the Custodian and Deputy Custodian-General canceling the quasi-permanent allotment amount to violation of fundamental rights under Arts. 19(1)(f), 31(1) and 31(2).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Allotment to petitioners was on quasi-permanent basis acquiring rights constituting property; orders of Custodian and Deputy Custodian-General violate fundamental rights to property under Arts. 19(1)(f), 31(1) and 31(2).",
      "supporting_facts": [
        "f2",
        "f4",
        "f5"
      ],
      "legal_basis": "Arts. 19(1)(f), 31(1), 31(2) of Constitution"
    },
    {
      "id": "pa2",
      "text": "Quasi-permanent allottee entitled to right to possession which is property; treated as owner for various purposes under Punjab laws.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Press Communique Feb 7, 1948; various Punjab Acts and rules"
    },
    {
      "id": "pa3",
      "text": "Under Displaced Persons (Compensation and Rehabilitation) Act, 1954, entitled to continue in possession and obtain transfer via sanad.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": "s.10, Displaced Persons (Compensation and Rehabilitation) Act, 1954; r.72(2) Rules 1955; Julius v. Lord Bishop of Oxford"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Quasi-permanent allotment does not constitute property; subject to cancellation under Act and rules.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Administration of Evacuee Property Act, 1950 ss.10,12; rules including July 8, 1949 notification"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Detailed historical review of evacuee property laws from 1947 ordinances to 1950 Act shows allotments are grants of use/occupation, initially temporary, later quasi-permanent but subject to wide cancellation powers.",
      "addresses_issue": "i1",
      "key_observation": "Allottee's interest is provisional, analogous to jus in re aliena, not property itself."
    },
    {
      "id": "cr2",
      "text": "Incidents of quasi-permanent allotment under July 8, 1949 notification: heritable, quiet enjoyment, improvements compensable, exchange/sub-lease allowed but no sale/mortgage; subject to resumption on administrative grounds.",
      "addresses_issue": "i1",
      "key_observation": "Sum total does not constitute ownership or property protected by fundamental rights."
    },
    {
      "id": "cr3",
      "text": "Even post-1952 amendments restrict but do not negate cancellation powers; Displaced Persons Act 1954 allows continued possession but subject to variation/cancellation under s.19.",
      "addresses_issue": "i1",
      "key_observation": "No indefeasible right to sanad or permanent ownership."
    },
    {
      "id": "cr4",
      "text": "Cancellation was under authority of law creating the rights; ss.28,46 bar challenge; not deprivation without authority of law.",
      "addresses_issue": "i2",
      "key_observation": "Exercise of resumption power inherent in the grant."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rights of quasi-permanent allottee do not constitute property within Arts. 19(1)(f), 31(1), 31(2); no violation of fundamental rights.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Cancellation orders do not infringe fundamental rights.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dunichand Hakim v. Deputy Commissioner, Deputy Custodian, Evacuee Property, Karnal",
      "citation": "1954 S.C.R. 578",
      "treatment": "referred",
      "relevance": "Refers to Land Resettlement Manual as authoritative on background."
    },
    {
      "case_name": "State of West Bengal v. Subodh Gopal Bose",
      "citation": "1954 S.C.R. 587",
      "treatment": "referred",
      "relevance": "Observation on wider sense of 'property' under Art. 31(1) not shared by court."
    },
    {
      "case_name": "Julius v. Lord Bishop of Oxford",
      "citation": "(1880) 5 App. Cas. 214",
      "treatment": "distinguished",
      "relevance": "Principle of mandatory exercise of discretionary power not applicable due to overriding cancellation powers."
    },
    {
      "case_name": "Suraj Parkash Kapur v. The State of Punjab",
      "citation": "(1957) LIX P.L.R. 103",
      "treatment": "doubted",
      "relevance": "Disagrees that quasi-permanent interest constitutes protected property."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 32",
        "Art. 19(1)(f)",
        "Art. 31(1)",
        "Art. 31(2)"
      ],
      "relevance": "Basis for petition; court holds no violation as no property right."
    },
    {
      "name": "Administration of Evacuee Property Act, 1950 (XXXI of 1950)",
      "sections": [
        "s.2(a),(d),(f)",
        "s.5",
        "s.6",
        "s.7",
        "s.8",
        "s.9",
        "s.10",
        "s.12",
        "s.15",
        "s.16",
        "s.24-27",
        "s.28",
        "s.46",
        "s.53",
        "s.55",
        "s.56",
        "s.58"
      ],
      "relevance": "Vests evacuee property in Custodian; powers of management, allotment, cancellation; bars jurisdiction."
    },
    {
      "name": "Displaced Persons (Compensation and Rehabilitation) Act, 1954 (XLIV of 1954)",
      "sections": [
        "s.10",
        "s.12",
        "s.13",
        "s.14",
        "s.16",
        "s.19",
        "s.40"
      ],
      "relevance": "Acquisition of evacuee property; allottee continues possession subject to cancellation; compensation pool."
    },
    {
      "name": "East Punjab Evacuees (Administration of Property) Act, 1947 (XIV of 1947)",
      "sections": [
        "s.9-A",
        "s.12",
        "s.18-B",
        "s.22"
      ],
      "relevance": "Early vesting, restoration, cancellation powers."
    },
    {
      "name": "East Punjab Displaced Persons (Land Resettlement) Act, 1949 (XXXVI of 1949)",
      "relevance": "Allotment rights to possession."
    },
    {
      "name": "East Punjab Refugees (Registration of Land Claims) Act, 1948 (XII of 1948)",
      "sections": [
        "s.8"
      ],
      "relevance": "Land claims registration."
    },
    {
      "name": "Punjab Land Revenue Act, 1887",
      "relevance": "Quasi-permanent allottee eligible as zaildar."
    },
    {
      "name": "East Punjab Holdings (Consolidation and Prevention of Fragmentation) Act, 1948 (L of 1948)",
      "relevance": "Liable for consolidation costs."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Petition under Art. 32 dismissed holding that quasi-permanent allotment does not constitute property protected by fundamental rights; cancellation lawful under evacuee property laws.",
    "relief_granted": "None",
    "costs": "Without costs"
  },
  "key_quotes": [
    {
      "text": "The two substantial questions that arise, therefore, for consideration are (1) whether the rights of a quasi-permanent allottee constitute property within the meaning of the articles above referred to, and (2) whether the orders of the Custodian and Deputy Custodian-General canceling the quasi-permanent allotment amount to violation fundamental rights contemplated by the above articles.",
      "speaker": "court",
      "significance": "Frames the core legal issues."
    },
    {
      "text": "Having given our best consideration, we are unable to hold that the interest of a quasi-permanent allottee is property within the concept of that word so as to attract the protection of fundamental rights.",
      "speaker": "court",
      "significance": "Key holding on nature of quasi-permanent rights."
    },
    {
      "text": "In holding that quasi-permanent allotment does not carry with it a fundamental right to property under the Constitution we are not to be supposed as denying or weakening the scope of the rights of the allottee.",
      "speaker": "court",
      "significance": "Clarifies statutory rights remain important despite no constitutional protection."
    }
  ],
  "_case_id": "1957_42",
  "_label": 0,
  "_text_length": 68254,
  "_extracted_at": "2026-02-08T22:35:52.406797"
}