{
  "metadata": {
    "case_name": "Appellant v. State",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur J."
    ],
    "case_number": "Criminal Appeal No. 150 of 1956",
    "date_of_judgment": "1957-02-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Sabir was murdered on the 11th May 1951, at about 6-30 p.m.",
      "type": "material",
      "date": "1951-05-11",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "First Information Report was made by Qudrat Ullah the other accused at 6-45 p.m. the same day, i.e., within about 15 minutes of the occurrence.",
      "type": "procedural",
      "date": "1951-05-11",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "There was an exchange of abuses between the deceased and the appellant near the shop of the First Informant, Qudrat Ullah. The cause of the quarrel was that on the evening of the occurrence while Qudrat Ullah was sitting in his shop and the deceased was sitting just below the shop, the appellant came out of his house and on seeing him, the deceased asked him as to why he was in such a dishevelled condition, which annoyed the appellant.",
      "type": "material",
      "date": "1951-05-11",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "On hearing this noise, the prosecution witnesses arrived at the spot and saw the appellant and the deceased grappling with each other. The appellant is stated to have asked Qudrat Ullah to hand over a knife to him which Qudrat Ullah did this knife is Ex. I II, with which the appellant stabbed the deceased and then fled away.",
      "type": "material",
      "date": "1951-05-11",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "As a result of the injuries the deceased fell down in front of Qudrat Ullah's shop some witnesses have stated that he fell on the wooden plank in front of the shop.",
      "type": "material",
      "date": "1951-05-11",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Qudrat Ullah picked up the knife which had been dropped by the appellant, put the deceased in a rickshaw and took him to the hospital from where he went to the Police Station and made the First Information Report.",
      "type": "material",
      "date": "1951-05-11",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "A First Information Report is not a substantive piece of evidence and can only be used to corroborate the statement of the maker under s. 157 of the Evidence Act or to contradict it under s. 145 of that Act. It cannot be used as evidence against the maker at the trial if he himself becomes an accused, not to corroborate or contradict other witnesses. In this case, therefore, it is not evidence.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Sub-Inspector went to the spot, started investigation and arrested the appellant the same evening at his house.",
      "type": "procedural",
      "date": "1951-05-11",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "The postmortem examination of the deceased showed injuries on the person of the deceased and, according to the doctor, death was due to shock and haemorrhage on account of the punctured wound in the chest, causing injuries to the lungs and these injuries could be caused with a sharp-edged weapon.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "The appellant and the deceased both belong to a sect of Jogis. Evidence discloses that the deceased and the appellant were quite friendly with each other, and so were the deceased and Qudrat Ullah, who is a butcher and had a shop which is a part of his house. Adjacent to the shop is the house of the appellant.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Eye witnesses of the occurrence were Yad Ali, P.W. 1, Banne, P.W. 2 and Mohd. Ahmed, P.W. 3.",
      "type": "material",
      "date": "1951-05-11",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Having been told by the sister of the deceased as to the occurrence, Ashraft, P.W. 4 came to the spot later and found the deceased lying unconscious.",
      "type": "material",
      "date": "1951-05-11",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Shakir, P.W. 5, younger brother of the deceased, on arriving near the shop of Qudrat Ullah heard the appellant and the deceased exchanging abuses, but was not a witness of the assault as just at that time he had gone, at the request of Qudrat Ullah, to fill his Chillum for the hookah and when he came back he found the deceased lying unconscious and the appellant running away towards his house.",
      "type": "material",
      "date": "1951-05-11",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "The evidence of Yad Ali P.W. 1, is that he heard an exchange of abuses between the deceased and the appellant and when he moved about 4 or 5 paces he saw them grappling with each other. The appellant had the deceased in his grip, he asked Qudrat Ullah to hand over a knife to him which the latter did and with it the appellant stabbed the deceased and then went away to his house.",
      "type": "material",
      "date": "1951-05-11",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "The statement of Banne is similar and so is the statement of Mohd. Ahmed, P.W. 3.",
      "type": "material",
      "date": "1951-05-11",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "This evidence was not accepted by the learned Sessions Judge and he acquitted both the accused.",
      "type": "procedural",
      "date": "1952-07-08",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "The State took an appeal to the Allahabad High Court against the appellant only and the judgment of acquittal in his case was reversed and he was convicted under s. 302 I.P.C. and sentenced to transportation for life.",
      "type": "procedural",
      "date": "1955-10-18",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Against the judgment of the High Court the appellant has brought this appeal by Special Leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the First Information Report made by Qudrat Ullah is admissible as substantive evidence against the appellant.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the eyewitness testimony should be rejected in toto against the appellant because the witnesses falsely implicated Qudrat Ullah, invoking falsus in uno falsus in omnibus.",
      "framed_by": "appellant"
    },
    {
      "id": "i3",
      "text": "Whether the High Court erred in reversing the Sessions Judge's acquittal and convicting the appellant under s. 302 IPC.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether the High Court placed the burden of proof on the accused.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Objection has been taken to the admissibility of this report as it was made by a person who was a co-accused.",
      "supporting_facts": [
        "f2",
        "f7"
      ],
      "legal_basis": "s. 157 and s. 145 of the Evidence Act"
    },
    {
      "id": "pa2",
      "text": "The witnesses had falsely implicated Qudrat Ullah and because of that the Court should have rejected the testimony of these witnesses as against the appellant also. The well-known maxim falsus in uno falsus in omnibus was relied upon.",
      "supporting_facts": [
        "f11",
        "f14",
        "f15"
      ],
      "legal_basis": "falsus in uno falsus in omnibus"
    },
    {
      "id": "pa3",
      "text": "The respondent himself did not have the courage to say that he did not find them at the spot. If he were innocent, he must have come out of his house immediately on hearing the noise.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "We may concede that the eye-witnesses have falsely implicated Qudrat Ullah by deposing that he handed over his knife to the respondent on his demand. There was no enmity between him and Sabir and he had no motive to get him killed by the respondent. It does not at all appear probable that after abetting the murder of Sabir he at once took him on a rickshaw to the hospital and from there went at once to the police station and lodged a report against the respondent.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "We are satisfied that the prosecution has fully established the case against the respondent. There is not the slightest doubt about his guilt. The presumption of innocence has been fully rebutted by the prosecution.",
      "supporting_facts": [
        "f1",
        "f3",
        "f4",
        "f9",
        "f11",
        "f14",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "A First Information Report is not a substantive piece of evidence and can only be used to corroborate the statement of the maker under s. 157 of the Evidence Act or to contradict it under s. 145 of that Act. -It cannot be used as evidence against the maker at the trial if he himself becomes an accused, not to corroborate or contradict other witnesses. In this case, therefore, it is not evidence.",
      "addresses_issue": "i1",
      "key_observation": "FIR inadmissible as substantive evidence."
    },
    {
      "id": "cr2",
      "text": "There is a passage in the Judgment of the High Court which appears to us to be disconsolate and indicative of a wrong approach in deciding the guilt of an accused person... it comes perilously near to putting the burden on the accused if it does not actually do so... it is the duty of the prosecution to prove the prisoners guilt subject to any statutory exception.",
      "addresses_issue": "i4",
      "key_observation": "Reiterates presumption of innocence and burden on prosecution."
    },
    {
      "id": "cr3",
      "text": "This maxim [falsus in uno falsus in omnibus] has not received general acceptance in different jurisdictions in India nor has this maxim come to occupy the status of a rule of law. It is merely a rule of caution... it is not what may be called a mandatory rule of evidence.",
      "addresses_issue": "i2",
      "key_observation": "Maxim is not mandatory; question of weight of evidence."
    },
    {
      "id": "cr4",
      "text": "The High Court was not unmindful of what the witnesses stated as to Qudrat Ullah's part in the commission of the offence and having taken that into consideration... While the learned Sessions Judge was right in acquitting Qudrat Ullah, he was completely wrong in acquitting the respondent of whose guilt there was not the slightest doubt.",
      "addresses_issue": "i2",
      "key_observation": "Eyewitness testimony reliable against appellant despite Qudrat's acquittal."
    },
    {
      "id": "cr5",
      "text": "Upon a review of the evidence of the prosecution witnesses we have come to the conclusion that the appellant was rightly convicted.",
      "addresses_issue": "i3",
      "key_observation": "Supreme Court satisfied with conviction; trial judge's view erroneous."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The appellant was rightly convicted under s. 302 IPC.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Falsus in uno falsus in omnibus is merely a rule of caution, not a mandatory rule of evidence.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Burden of proof remains on prosecution; presumption of innocence till guilt proved.",
      "resolves_issue": "i4",
      "in_favor_of": "court"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Woolmington v. Director of Public Prosecutions",
      "citation": "1935 A.C. 462",
      "treatment": "followed",
      "relevance": "Duty of prosecution to prove guilt subject to statutory exception."
    },
    {
      "case_name": "Chaubiraja Singh v. Bhuneshwari Prasad Pal",
      "citation": null,
      "treatment": "referred",
      "relevance": "Unreported Privy Council judgment; discussed but slender foundation for falsus in uno as rule of law."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "302 read with 114"
      ],
      "relevance": "Appellant convicted under s. 302; Qudrat tried under s. 302 r/w 114 for abetment."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "157",
        "145"
      ],
      "relevance": "FIR used only to corroborate or contradict maker, not substantive evidence against co-accused maker."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave, upheld the Allahabad High Court's reversal of the Sessions Judge's acquittal, and confirmed the appellant's conviction under s. 302 IPC and sentence to transportation for life.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "it is the duty of the prosecution to prove the prisoners guilt subject to any statutory exception.",
      "speaker": "court",
      "significance": "Reiterates cardinal principle of criminal jurisprudence on burden of proof."
    },
    {
      "text": "This maxim has not received general acceptance in different jurisdictions in India nor has this maxim come to occupy the status of a rule of law. It is merely a rule of caution.",
      "speaker": "court",
      "significance": "Clarifies status of falsus in uno falsus in omnibus."
    },
    {
      "text": "Upon a review of the evidence of the prosecution witnesses we have come to the conclusion that the appellant was rightly convicted.",
      "speaker": "court",
      "significance": "Final holding upholding conviction."
    }
  ],
  "_case_id": "1957_127",
  "_label": 0,
  "_text_length": 11505,
  "_extracted_at": "2026-02-10T19:24:23.173253"
}