{
  "metadata": {
    "case_name": "Appellant v. Respondent No. 1 & Ors.",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI J."
    ],
    "case_number": "Civil Appeal No. 374 of 1956",
    "date_of_judgment": "1957-01-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The State of Assam, respondent No. 3, had settled the Charduar Brahmaputra Fishery with the respondent No. 1 for a period of three years, viz., from April 1, 1954, to March 31, 1957, at an annual zama of Rs. 19,600 under r. 12 of the Fishery Rules.",
      "type": "material",
      "date": "1954-04-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Deputy Commissioner of Darrang, respondent No. 2, received some reports against the respondent No. 1 alleging violation of cl. VI of the Fishery lease and also of certain other conditions of the lease.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "The Deputy Commissioner obtained reports from the Sub-Deputy Collector and the Extra Assistant Commissioner in regard to these allegations and came to the conclusion that respondent No. 1 had created under-lease in favour of certain persons and cancelled the settlement of the fishery.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "After such cancellation, respondent No. 3, purporting to act again under r. 12, settled the said fishery with the appellant with effect from May 4, 1955, and respondent No. 1 was directed to give up possession thereof with effect from that date.",
      "type": "material",
      "date": "1955-05-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondent No. 1 thereupon obtained a Rule from the Assam High Court alleging that the said settlement was absolutely illegal and the fishery had to be settled properly according to the rules under which these settlements are usually made.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "A Revenue Appeal was also filed against the order of respondent No. 2 under rule 11 of section I of the Fishery Rules and both the Rule and the Revenue Appeal were heard together by the Assam High Court.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "The Assam High Court had already on August 31, 1955, delivered a judgment in Civil Rule No. 56 of 1955, Nuruddin Ahmed v. State of Assam, declaring r. 12 of the Fishery Rules ultra vires the State Government and therefore invalid and unenforceable.",
      "type": "background",
      "date": "1955-08-31",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The High Court followed that judgment and held that the respondent No. 3 had no jurisdiction to make a settlement under r. 12 of the Fishery Rules with the respondent No. 1 and the order of cancellation should be upheld on that ground alone. The appeal of respondent No. 1 was accordingly dismissed.",
      "type": "procedural",
      "date": "1955-12-19",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "In regard to the appellant also the High Court came to the same conclusion and held that the settlement made by respondent No. 3 in his favour was entirely without jurisdiction. The Rule obtained by respondent No. 1 was accordingly made absolute.",
      "type": "procedural",
      "date": "1955-12-19",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The result was that the settlements made by respondent No. 3 with respondent No. 1 and the appellant were both set aside and the authorities were directed to make a fresh settlement of the fishery in question according to the existing Fishery Rules.",
      "type": "procedural",
      "date": "1955-12-19",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The State of Assam had not obtained any leave to appeal against the decision of the High Court in Nuruddin Ahmed v. State of Assam.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The appellant obtained special leave to appeal against the decision of the High Court which set aside the settlement of the Fishery made by respondent No. 3 along with him and impleaded the State of Assam as respondent No. 3 along with respondent No. 1.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "No more than 21 months were left for the lease to run at the time of the allegations.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether r. 12 of the Fishery Rules is intra vires and empowers the State Government to settle fisheries otherwise than by sale, e.g., by individual settlements without auction or tender system.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether r. 12 is repugnant to s. 16 of the Assam Land and Revenue Regulation, 1886.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "r. 12 of the Fishery Rules specifically empowers the State Government to settle fishery rights otherwise than by sale, including by individual settlements without following the auction system or the tender system.",
      "supporting_facts": [
        "f1",
        "f4",
        "f10"
      ],
      "legal_basis": "r. 12 of the Fishery Rules; context of rules 1 to 11 of Section I"
    },
    {
      "id": "pa2",
      "text": "The prohibition in r. 12 against settlement otherwise than by sale is general but carves out an exception in favour of the State Government without limitation, allowing discretion in circumstances like cancellation before expiry.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "r. 12 proviso; s. 155 Assam Land and Revenue Regulation"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "r. 12 of the Fishery Rules is ultra vires and repugnant to s. 16 of the Assam Land and Revenue Regulation, 1886.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "s. 16 Assam Land and Revenue Regulation; Nuruddin Ahmed v. State of Assam"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The normal procedure for settlement of fisheries is by auction sales under r. 3 of s. I, but power is given to the State Government under r. 12 to settle otherwise than by sale, including tender system or individual settlements when necessary.",
      "addresses_issue": "i1",
      "key_observation": "r. 12 invests State Government with power to settle otherwise than by sale without fetter on discretion."
    },
    {
      "id": "cr2",
      "text": "s. 16 leaves rule-making for fishery rights to s. 155, and there is nothing in s. 16 indicating principles or policy restricting r. 12; no conflict between s. 16 and r. 12.",
      "addresses_issue": "i2",
      "key_observation": "State bound by rules under s. 155; r. 12 validly enacted thereunder."
    },
    {
      "id": "cr3",
      "text": "High Court judgment in Nuruddin Ahmed v. State of Assam wrongly held r. 12 ultra vires based on misconception; State of Assam v. Keshab Prasad Singh did not touch the controversy.",
      "addresses_issue": "i1",
      "key_observation": "Decision turns on construction of r. 12; ultra vires argument unsustainable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "r. 12 of the Fishery Rules is intra vires and specifically empowers the State Government to settle fishery rights otherwise than by sale.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "There is no conflict between s. 16 of the Assam Land and Revenue Regulation, 1886, and r. 12 of the Fishery Rules.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "The settlement of the fishery by respondent No. 3 with the appellant is valid and operative.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Nuruddin Ahmed v. State of Assam",
      "citation": "A.I.R. 1956 Assam 48",
      "treatment": "overruled",
      "relevance": "High Court declared r. 12 ultra vires; Supreme Court holds it wrong and based on misconception."
    },
    {
      "case_name": "State of Assam v. Keshab Prasad Singh",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Did not touch the present controversy regarding r. 12."
    }
  ],
  "statutes_cited": [
    {
      "name": "Assam Land and Revenue Regulation, 1886 (Regulation I of 1886)",
      "sections": [
        "Section 16",
        "Section 155"
      ],
      "relevance": "s. 16 on right of fishery and proclamation; s. 155 empowers rules on granting licences or farming right to fish; r. 12 held consistent."
    },
    {
      "name": "Fishery Rules (in Assam Land Revenue Manual, Vol. I)",
      "sections": [
        "r. 12",
        "r. 3",
        "r. 11",
        "r. 42",
        "Chapter X Sections I, IV"
      ],
      "relevance": "r. 12 empowers State Government to settle fisheries otherwise than by sale; normal procedure auction, alternative tender or individual."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed. The settlement of fishery rights by respondent No. 3 with the appellant is declared valid and operative. No relief to respondent No. 1 as it did not appeal the cancellation order and disclaimed benefits by contending r. 12 ultra vires. Various questions of fact on cancellation not addressed.",
    "relief_granted": "Settlement with appellant upheld as valid.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"No fishery shall be settled otherwise than by sale except by the State Government.\"",
      "speaker": "court",
      "significance": "Text of r. 12 central to construction empowering State settlements outside auction."
    },
    {
      "text": "We are, therefore, of opinion that r. 12 specifically empowers the State Government to settle the fishery rights otherwise than by sale and there is no conflict at all between the provisions of s. 16... and r. 12 of the Fishery Rules.",
      "speaker": "court",
      "significance": "Core holding on validity and scope of r. 12."
    },
    {
      "text": "The decision of this appeal turns on the construction of r. 12 and we fail to understand how the question of the intra vires or the ultra vires character of r. 12 at all arises.",
      "speaker": "court",
      "significance": "Rejects ultra vires argument as misconceived."
    }
  ],
  "_case_id": "1957_38",
  "_label": 1,
  "_text_length": 16523,
  "_extracted_at": "2026-02-08T22:35:55.063359"
}