{
  "metadata": {
    "case_name": "Crown Aluminium Works, Belur, represented by Jeewanlal (1929) Ltd. v. Workmen represented by Bengal Aluminium Workers Union",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 235 of 1956",
    "date_of_judgment": "1957-10-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In 1947, the first Omnibus Engineering Tribunal was constituted to adjudicate industrial disputes for the engineering industry in West Bengal, including basic wages, dearness allowance and leave. Award published on June 30, 1948. Appellant was party and governed by it.",
      "type": "background",
      "date": "1948-06-30",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Industrial disputes arose again, referred to another tribunal. Award published on September 21, 1950, increasing dearness allowance due to rise in cost of living index and modifying leave rules per Indian Factories Act, 1948. Appellant and workmen not parties as no dispute raised on dearness allowance.",
      "type": "background",
      "date": "1950-09-21",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant revised facility bonus from time to time to keep pace with cost of living index. Wage structure included several components leaving no cause for grievance on dearness allowance.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Minor industrial dispute referred to Shri G. Palit on November 24, 1950, including increment for 1950. Appellant denied liability, claiming handsome remuneration via special allowance, bonus, dearness allowance. Shri Palit allowed one anna per day increment, directed arrears payment, cautioned to fix wage structure.",
      "type": "procedural",
      "date": "1950-11-24",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Appellant issued notice on March 28, 1952, proposing reduction of factory hours from 47 to 40, facility bonus by 3 as. per day, temporary dearness allowance by 10% due to financial setback, effective June 1, 1952.",
      "type": "material",
      "date": "1952-03-28",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Union opposed changes. Joint discussions on June 2 and 26, 1952. Further notice May 30, 1952, for more reductions: facility bonus by 6 as., withdraw two hours concession, discharge rolling mills workers.",
      "type": "material",
      "date": "1952-05-30",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Union agreed only to hours reduction to 42-1/2. Appellant notice June 27, 1952, implemented March 28 changes from June 1, withdrew two hours from July 1, discharged rolling mills from August 1.",
      "type": "material",
      "date": "1952-06-27",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Workers resisted, took dispute to Labour Commissioner. Conference July 4, 1952, failed. Appellant discharged 52 rolling mills workers July 15, 1952, retrenched 227 others July 26, 1952.",
      "type": "material",
      "date": "1952-07-15",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Government of West Bengal referred 13 matters to Sixth Industrial Tribunal (Shri S. K. Niyogi) on July 31, 1952, under s.10 Industrial Disputes Act, 1947.",
      "type": "procedural",
      "date": "1952-07-31",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Sixth Tribunal award October 9, 1953: Revised wage structure per 1948/1950 awards, held two hours concession, facility bonus, food concession as bounty withdrawable. Allowed abolition post-revision.",
      "type": "procedural",
      "date": "1953-10-09",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Cross-appeals to Labour Appellate Tribunal, disposed July 29, 1955: Modified wage structure, incorporated concessions into basic wages/dearness allowance for existing workmen, no reduction of existing emoluments.",
      "type": "procedural",
      "date": "1955-07-29",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellant took over unit August 9, 1951. Rolling mills closed February 1952 due to losses from inferior quality circles post-war.",
      "type": "background",
      "date": "1951-08-09",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Financial position: Accounts 1947-Sept 1952 showed not bright, manufacturing cost exceeded sale price in 1952, fall in sales. Original tribunal saw no improvement; Appellate saw improvement post-retrenchment.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Two hours concession introduced August 1946 to compensate reduced hours post-Factories Act. Facility bonus April 1945, revised upward to 6-12 as. Food concession pre-1951.",
      "type": "background",
      "date": "1946-08-00",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appellant's Labour Officer testified facility bonus as additional for high cost of living like DA; two hours as special bonus demanded and possible then. Pleadings listed as part of pay structure.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Labour Appellate Tribunal erred in assuming a convention that existing emoluments of workmen cannot be reduced to their prejudice in wage structure revisions, and whether wage structure can ever be revised to prejudice workmen.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the two hours concession, facility bonus, and food concession were bounties or part of basic wages and dearness allowance as terms of service.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Labour Appellate Tribunal erred in assuming convention against reducing existing emoluments to workmen's prejudice. Wage structure revisable in employer's favor if financial position deteriorates, like upward revisions for workmen.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Concessional payments (two hours, facility bonus, food) were bounties, as held by Shri Palit and Sixth Tribunal, withdrawable at pleasure.",
      "supporting_facts": [
        "f4",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Financial difficulties justify reductions; substantial retrenchment already effected.",
      "supporting_facts": [
        "f5",
        "f8",
        "f12",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Concessional payments enjoyed as of right for long time, part of basic wages and DA, terms of service. Convention against reducing emoluments.",
      "supporting_facts": [
        "f3",
        "f14",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Industrial adjudication aims at social/economic justice, harmony between labour/capital. Considers comparable wages, productivity, cost of living, ability to pay. Categories: living/fair/minimum wage.",
      "addresses_issue": "i1",
      "key_observation": "No industry right to exist without paying bare minimum wage."
    },
    {
      "id": "cr2",
      "text": "Wage structure can be revised to prejudice workmen if above minimum and case made out on merits (financials, duration of difficulties, retrenchment effects). No rigid convention against reduction.",
      "addresses_issue": "i1",
      "key_observation": "Answer in favor of employer in principle, subject to considerations."
    },
    {
      "id": "cr3",
      "text": "Appellate Tribunal not solely based on convention; considered retrenchment improvement, insufficient evidence on cost of living fall, wages at minimum/fair level.",
      "addresses_issue": "i1",
      "key_observation": "Conclusion not vitiated."
    },
    {
      "id": "cr4",
      "text": "Concessions part of wage structure: genesis to compensate reductions, revised upward, listed in pleadings, no dispute raised earlier, testimony supports as right.",
      "addresses_issue": "i2",
      "key_observation": "Not bounties but integral to basic wage/DA."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Wage structure fixed by industrial adjudication can be revised downward if above bare minimum wage and merits justify (financial deterioration, etc.), no absolute convention against prejudice to workmen.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Appellate Tribunal's wage structure modifications and incorporation of concessions valid, based on evidence.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Two hours concession, facility bonus, food concession form part of basic wages/dearness allowance.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "Section 10"
      ],
      "relevance": "Reference of disputes for adjudication"
    },
    {
      "name": "Indian Factories Act, 1948",
      "sections": [],
      "relevance": "Modified leave rules; reduced working hours leading to concessions"
    },
    {
      "name": "Minimum Wages Act",
      "sections": [],
      "relevance": "Mentioned in context of labour welfare legislation"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Both contentions of appellant fail. Appellate Tribunal's award upheld, including modifications to wage structure incorporating concessions for existing workmen without reduction of emoluments.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "No industry has a right to exist unless it is able to pay its workmen at least a bare minimum wage.",
      "speaker": "court",
      "significance": "Core principle limiting downward wage revisions"
    },
    {
      "text": "Can the wage structure fixed in a given industry be never revised to the prejudice of its workmen? Considered as a general question in the abstract it must be answered in favour of Mr. Sen.",
      "speaker": "court",
      "significance": "Rejects absolute convention against reductions"
    },
    {
      "text": "It was prudent... for the company to have a hide bound wage structure instead of having so many flexible component parts of the wage which merely will create unrest.",
      "speaker": "lower_court",
      "significance": "Shri Palit's caution on wage structure"
    }
  ],
  "_case_id": "1957_114",
  "_label": 0,
  "_text_length": 30509,
  "_extracted_at": "2026-02-08T22:37:03.502556"
}