{
  "metadata": {
    "case_name": "Vadivelu Thevar & Anr. v. State",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha J."
    ],
    "case_number": "Criminal Appeals Nos. 24 and 25 of 1957",
    "date_of_judgment": "1957-04-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The occurrence took place at about 11-30 p.m. on November 10, 1955, at Muthupet, in front of the tea stall of Kannuswami.",
      "type": "background",
      "date": "1955-11-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Kannuswami was called for dinner by his wife (PW1, Shrimati Dhanabagyam) when an old man asked for tea; the two appellants rushed in, old man ran away, accused dragged Kannuswami out and first appellant (A-2, Vadivelu) gave several blows on chest with aruval; Kannuswami fell down crying for help.",
      "type": "material",
      "date": "1955-11-10",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "PW1 put Kannuswami's head in her lap after accused left momentarily; accused returned, PW1 placed head on ground and stood on steps; first appellant made body face downwards and gave cuts on head, neck and back causing instantaneous death; second appellant (A-1, Chinniah) stood nearby.",
      "type": "material",
      "date": "1955-11-10",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "PW3 Shunmuga Thevar (cinema proprietor) came and remonstrated but to no purpose.",
      "type": "material",
      "date": "1955-11-10",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Two electric lights in tea shop, Panchayat Board light on road, light on pathway to cinema-house were burning.",
      "type": "background",
      "date": "1955-11-10",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "PW1 informed PW4 Ganapathi (tea stall opposite), who advised lodging FIR; PW1 went to shut police station, then to Sub-Inspector's house; Sub-Inspector recorded FIR (Exhibit P-1), went to scene, held inquest next morning.",
      "type": "procedural",
      "date": "1955-11-10",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Sessions Court convicted A-2 under s.302 IPC (death), A-1 under s.302 r/w s.109 IPC; Madras High Court on July 25, 1956 confirmed death for A-2, modified A-1 to s.326 IPC with 5 years RI.",
      "type": "procedural",
      "date": "1956-07-25",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "PW2 (Singaram, assistant at PW4's stall) saw Vadivelu cut and Chinniah standing by but denied accused in dock were those persons; cross-examined, admitted lights burning, did not tell police accused not involved.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "PW3 admitted examined by police 2 days later but denied telling police he saw A-2 cutting and A-1 standing by; treated hostile though not recorded as such.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "PW4 stated PW1 said Chinniah and Vadivelu Thevar cut husband but denied accused in court were those persons.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "PW14 (Investigating Sub-Inspector) stated PW3 told him he saw A-2 cutting head/neck with aruval, A-1 by side.",
      "type": "admitted",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "PW1's statement to committing Magistrate (Exhibit D-2) recorded as A-1 cutting even after PW3 protested, but Sessions Judge held recording mistake (meant A-2); PW1 consistently said A-2 used weapon, A-1 aided by presence.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "PW1 admitted husband transported for life for murder, jailed twice post-release for cut injuries.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether conviction can be based solely on testimony of PW1 (wife of deceased), given alleged discrepancies and hostility of other witnesses.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there is material discrepancy in PW1's statements between committing court and sessions court.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether rule of prudence requires corroboration for single witness testimony in murder case.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether death sentence appropriate given nature of proof.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Conviction rests solely on PW1's testimony, which is not free from blemish; discrepancy in Exhibit D-2 where she allegedly said A-1 cut even after PW3 protested.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "PW1's testimony contradicted by PW3 who denied seeing assault; assumes PW3 truthful.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Not safe to convict on single witness in murder case as rule of prudence; cited Privy Council and this Court's cases requiring corroboration.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Mohamed Sugal Esa v. King; Vemireddy Satyanarayan Reddy v. State of Hyderabad"
    },
    {
      "id": "pa4",
      "text": "Reduce sentence to lesser punishment as proof is single witness testimony.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "PW1's testimony consistent and reliable; other PWs hostile but their prior statements corroborate; discrepancy in Exhibit D-2 is recording error by Magistrate, not challenged earlier.",
      "supporting_facts": [
        "f11",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "No legal requirement for corroboration of single witness unless statute or prudence demands (e.g., child, accomplice).",
      "supporting_facts": [],
      "legal_basis": "Section 134 Evidence Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Discrepancy in Exhibit D-2 is recording mistake (A-1 instead of A-2); PW1 consistent throughout that A-2 wielded aruval, A-1 aided; not challenged in Sessions appeal, High Court or leave petition.",
      "addresses_issue": "i2",
      "key_observation": "Finding of Sessions Judge on mistake not challenged below."
    },
    {
      "id": "cr2",
      "text": "PW2-4 hostile in court but prior statements (esp. PW3 to PW14) support PW1; their court evidence unreliable as contradictory to priors.",
      "addresses_issue": "i1",
      "key_observation": "PW3's court denial not true version as contradicts police statement."
    },
    {
      "id": "cr3",
      "text": "PW1 severely cross-examined, frank admissions on husband's past; evidence rings true, consistent with FIR (within hour) and medical evidence of double attack (front then back wounds).",
      "addresses_issue": "i1",
      "key_observation": "Reliable single witness outweighs indifferent multiple witnesses."
    },
    {
      "id": "cr4",
      "text": "No rule of law requiring corroboration for single witness in murder; only prudence in cases like child or accomplice; s.134 Evidence Act: no particular number required; quality over quantity.",
      "addresses_issue": "i3",
      "key_observation": "Court can act on wholly reliable single witness testimony."
    },
    {
      "id": "cr5",
      "text": "Cold-blooded murder, no extenuating circumstances; proof nature irrelevant to sentence once guilt proved.",
      "addresses_issue": "i4",
      "key_observation": "Death sentence justified."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Conviction solely on reliable testimony of single eyewitness PW1 permissible; no legal bar.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No material discrepancy in PW1's testimony.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Corroboration not required for credible single witness unless prudence demands (not here).",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Death sentence upheld for first appellant under s.302 IPC; 5 years RI for second appellant under s.326 IPC.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mohamed Sugal Esa Mamasan Rer Alalah v. The King",
      "citation": "AIR 1946 PC 3",
      "treatment": "followed",
      "relevance": "Corroboration rule of prudence for child witness, not law; Indian Evidence Act admits single witness."
    },
    {
      "case_name": "Vemireddy Satyanarayan Reddy v. State of Hyderabad",
      "citation": "1956 SCR 247",
      "treatment": "distinguished",
      "relevance": "Corroboration required due to witness position analogous to accomplice, not general rule."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "109",
        "326"
      ],
      "relevance": "Conviction under 302 for A-2 (murder), modified for A-1 to 326 (grievous hurt)."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "134"
      ],
      "relevance": "No particular number of witnesses required; evidence weighed by quality, not quantity."
    },
    {
      "name": "Indian Oaths Act",
      "sections": [
        "X of 1873"
      ],
      "relevance": "Mentioned in context of Privy Council case admissibility."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals by special leave dismissed; death sentence under s.302 IPC confirmed against first appellant (A-2); conviction/sentence under s.326 IPC with 5 years RI confirmed against second appellant (A-1).",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "As a general rule, a court can and may act on the testimony of a single witness though uncorroborated. One credible witness outweighs the testimony of a number of other witnesses of indifferent character.",
      "speaker": "court",
      "significance": "Core holding on single witness rule."
    },
    {
      "text": "Section 134 of the Indian Evidence Act has categorically laid it down that no particular number of witnesses shall in any case be required for the proof of any fact.",
      "speaker": "court",
      "significance": "Statutory basis rejecting plurality requirement."
    },
    {
      "text": "The court is concerned with the quality and not with the quantity of the evidence.",
      "speaker": "court",
      "significance": "Principle for evaluating testimony."
    }
  ],
  "_case_id": "1957_108",
  "_label": 0,
  "_text_length": 29164,
  "_extracted_at": "2026-02-08T22:37:03.747918"
}