{
  "metadata": {
    "case_name": "Appellant (Thika Tenant) v. Respondent (Landlord)",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 291 of 1955",
    "date_of_judgment": "1957-09-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a thika tenant in respect of a portion of the premises No. 28, R. G. Kar Road in Calcutta.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In Suit No. 46 of 1948, a decree for ejectment was passed against the appellant and in favour of the respondent on March 16, 1949.",
      "type": "material",
      "date": "1949-03-16",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant preferred an appeal before the District Court and a second appeal before the Calcutta High Court, but both appeals failed and the decree for ejectment was confirmed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On May 22, 1953, the respondent filed an execution case before the First Additional Court, Sealdah (Title Execution Case No. 34 of 1953) claiming delivery of possession of the property covered by the decree.",
      "type": "procedural",
      "date": "1953-05-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant filed Miscellaneous Judicial Case No. 96 of 1953 under s. 47 of the Code of Civil Procedure raising objections to the decree-holder's claim for execution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Executing court dismissed Misc. Judicial Case No. 96 of 1953 on February 2, 1954.",
      "type": "procedural",
      "date": "1954-02-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant preferred Misc. Appeal No. 87 of 1954 before the District Judge, 24-Parganas, which was dismissed on July 29, 1954.",
      "type": "procedural",
      "date": "1954-07-29",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant preferred appeal before Calcutta High Court (Appellate Order No. 134 of 1954), affirmed on March 29, 1955.",
      "type": "procedural",
      "date": "1955-03-29",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant's application for leave to appeal under Letters Patent rejected by Mr. Justice Renupada Mukherjee.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant filed petition for special leave to appeal to Supreme Court on May 10, 1955; special leave granted on May 18, 1955.",
      "type": "procedural",
      "date": "1955-05-18",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Courts below held that decree-holder's execution application can be entertained by civil courts and ordered appellant to vacate premises before end of Jaistha 1362 B.S. (5th June, 1955), failing which execution to proceed according to law.",
      "type": "procedural",
      "date": "1955-06-05",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, under s. 5(1) of the Calcutta Thika Tenancy Act, 1949 as amended by the Calcutta Thika Tenancy Amendment Act, 1953, execution proceedings taken out by the decree-holder against the thika tenant could be entertained only by the Controller and not by the civil courts.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Civil courts lack competence to entertain the decree-holder's execution application due to misconstruction of s. 5(1); execution proceedings can only be entertained by the Controller.",
      "supporting_facts": [
        "f1",
        "f2",
        "f4",
        "f11"
      ],
      "legal_basis": "s. 5(1) Calcutta Thika Tenancy Act, 1949 (WB II of 1949) as amended by WB VI of 1953; history of legislation including ss. 3, 5, 28, 29"
    },
    {
      "id": "pa2",
      "text": "Thika Tenancy Acts are welfare legislation; provisions should receive beneficent construction to afford full protection to thika tenants; no class of thika tenants should be excluded.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Heydon's case (1584) 3 Co. Rep. 8; ss. 5, 28, 29 of original Act II of 1949"
    },
    {
      "id": "pa3",
      "text": "Effect of ss. 5, 28, 29 was to subject all claims for ejectment (merged in decree, pending, or post-commencement) to scrutiny under s. 3; amendments do not alter this.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "ss. 3, 5, 28, 29 Calcutta Thika Tenancy Act, 1949"
    },
    {
      "id": "pa4",
      "text": "Deletion of words 'subject to s. 28' in s. 5(1) indicates Controller has jurisdiction over original applications and decrees already passed.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s. 5(1) as amended"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Civil courts can and ought to entertain the decree-holder's execution application.",
      "supporting_facts": [
        "f2",
        "f4",
        "f11"
      ],
      "legal_basis": "s. 5(1) does not apply to execution of existing decrees"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s. 5(1) requires landlord wishing to eject thika tenant on grounds in s. 3 to apply to Controller; does not apply to execution of existing decree as decree-holder relies on decree, not grounds in s. 3.",
      "addresses_issue": "i1",
      "key_observation": "Description in s. 5(1) wholly inapplicable to decree-holder; provides self-contained procedure for original applications."
    },
    {
      "id": "cr2",
      "text": "Deletion of 'subject to s. 28' from s. 5(1) and omission of ss. 28, 29 does not enlarge Controller's jurisdiction to execution of decrees; s. 5(1) inapplicable to such cases.",
      "addresses_issue": "i1",
      "key_observation": "Landlords with decrees not required to apply under s. 5(1)."
    },
    {
      "id": "cr3",
      "text": "Primary rule of construction: intention from words used; words not capable of construction favoring appellant without strain.",
      "addresses_issue": "i1",
      "key_observation": "Even for welfare legislation, plain grammatical meaning governs unless ambiguous."
    },
    {
      "id": "cr4",
      "text": "Decree falls under s. 5(2) of 1952 Ordinance; appellant failed to apply within 3 months to challenge status; cannot now rely on s. 5(1).",
      "addresses_issue": "i1",
      "key_observation": "Limited protection via time-bound application; deletion of s. 28 revises policy."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Civil courts have jurisdiction to entertain execution petition; s. 5(1) does not apply to execution of ejectment decrees against thika tenants.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Heydon's case",
      "citation": "1584 3 Co. Rep. 8",
      "treatment": "followed",
      "relevance": "Observations on construction of statutes to suppress mischief and advance remedy, applied to welfare legislation but subject to plain meaning of words."
    }
  ],
  "statutes_cited": [
    {
      "name": "Calcutta Thika Tenancy Act, 1949 (West Bengal Act II of 1949)",
      "sections": [
        "s. 2(5)",
        "s. 3",
        "s. 5(1)",
        "s. 10",
        "s. 27",
        "s. 28",
        "s. 29"
      ],
      "relevance": "Defines thika tenant, grounds for ejectment, procedure before Controller for ejectment, treatment of pre-existing and pending decrees/orders."
    },
    {
      "name": "Calcutta Thika Tenancy Amendment Act, 1953 (West Bengal Act VI of 1953)",
      "sections": [
        "s. 1(2) proviso",
        "s. 2",
        "s. 4",
        "s. 8",
        "s. 9"
      ],
      "relevance": "Amends definition, s. 5(1), omits ss. 28-29, continues proceedings under 1952 Ordinance."
    },
    {
      "name": "Calcutta Thika Tenancy Ordinance, 1948 (XI of 1948)",
      "sections": [
        "s. 2",
        "s. 3"
      ],
      "relevance": "Temporary stay of ejectment decrees/orders against thika tenants."
    },
    {
      "name": "Calcutta Thika Tenancy (Amendment) Ordinance, 1952 (West Bengal XV of 1952)",
      "sections": [
        "s. 2(5)",
        "s. 5(1)",
        "s. 5(2)",
        "s. 5(3)"
      ],
      "relevance": "Amends definition; deals with pending cases and decrees between 1949 Act and Ordinance; allows judgment-debtor to apply within 3 months on status."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s. 47"
      ],
      "relevance": "Basis for appellant's miscellaneous judicial case objecting to execution."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, holding that civil courts have jurisdiction to entertain the execution proceedings under the decree for ejectment, rejecting the appellant's contention based on s. 5(1) of the Calcutta Thika Tenancy Act, 1949 as amended.",
    "relief_granted": "None to appellant; execution to proceed as ordered by lower courts.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"under s. 5(1) of the Calcutta Thika Tenancy Act, 1949 as amended by the Calcutta Thika Tenancy Amendment Act, 1953, execution proceedings taken out by the decree-holder against him could be entertained only by the Controller and not by the civil courts.\"",
      "speaker": "court",
      "significance": "States the short point raised by appellant."
    },
    {
      "text": "\"landlords who have obtained decrees of ejectment against their thika tenants cannot be required to apply under the provisions of s. 5(1) of the Act.\"",
      "speaker": "court",
      "significance": "Core holding on inapplicability of s. 5(1) to execution of decrees."
    },
    {
      "text": "\"the first and primary rule of construction is that the intention of the Legislature must be found in the words used by the Legislature itself.\"",
      "speaker": "court",
      "significance": "Principle applied to reject strained interpretation favoring thika tenants."
    }
  ],
  "_case_id": "1957_100",
  "_label": 0,
  "_text_length": 23563,
  "_extracted_at": "2026-02-08T22:37:03.801182"
}