{
  "metadata": {
    "case_name": "Appellant Company v. Scheduled Bank",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar J."
    ],
    "case_number": "Civil Appeal No. 357 of 1957",
    "date_of_judgment": "1958-01-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, a scheduled bank, sued the appellant in the court of the Civil Judge, Sitapur in Uttar Pradesh, for the recovery of money due under an instrument of mortgage.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant contested the suit on several grounds, one of which was that he was entitled to relief under the Uttar Pradesh Zamindars Debt Reduction Act, U.P. XV of 1953, which reduced the amount recoverable on a debt as defined in it.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Debt is defined in the Act as 'an advance in cash or in kind and includes any transaction which is in substance a debt but does not include an advance as aforesaid made on or after the first day of July, 1952 or a debt due to the Central Government or Government of any State, a local authority, a scheduled bank, a co-operative society, a waqf, trust or endowment for a charitable or religious purpose only, a person, where the debt was advanced on his behalf by the Court of Wards to a ward.'",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "As the respondent was a scheduled bank, the debt due to it from the appellant was not a debt within this definition and consequently no relief would appear to be available to the appellant under the Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellant contended that the definition insofar as it excluded certain debts offended Art. 14 of the Constitution as it made an arbitrary distinction between several classes of debtors and denied the excluded debtors the equal protection of the law, hence that portion should be struck out and the rest left operative.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The appellant made an application to the Civil Judge, Sitapur, under the proviso to s. 113 of the Code of Civil Procedure asking him to state a case for the opinion of the High Court at Allahabad on the invalidity of the impugned portion of the definition.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The Civil Judge held that the impugned portion infringed Art. 14 as it made an arbitrary distinction, but it was not necessary to decide as even if invalid, the offending portion was not severable from the rest, excluding the entire definition, so appellant without protection; dismissed the application.",
      "type": "procedural",
      "date": "1955-08-06",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The appellant filed Civil Revision No. 189 of 1955 and Misc. Case No. 4 of 1955 in Allahabad High Court Lucknow Bench, and also an application under Art. 228 of the Constitution to withdraw the case.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The High Court held no dispute on constitutional principle of equal protection, but only on severability which is construction of the Act, not interpretation of Constitution; even if so, not necessary for disposal; dismissed both applications.",
      "type": "procedural",
      "date": "1956-02-28",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the impugned portion of the definition of 'debt' in U.P. Zamindars Debt Reduction Act excluding debts to scheduled banks etc. is invalid under Art. 14 of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether it is necessary for the disposal of the case to decide the question of validity of the impugned portion of the definition.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the proviso to s. 113 CPC applies requiring the Civil Judge to state a case to the High Court.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether Art. 228 of the Constitution applies requiring the High Court to withdraw the case.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The definition excluding debts to scheduled banks etc. offends Art. 14 as arbitrary distinction denying equal protection; portion invalid and severable, so rest operative, entitling appellant to relief under the Act.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Art. 14 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "Civil Judge should state case under proviso to s.113 CPC; High Court should withdraw under Art.228 as substantial question of constitutional validity necessary for disposal.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Proviso to s.113 CPC; Art.228 Constitution"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Question of validity of provision in Zamindars Act is within proviso to s.113 CPC and also Art.228 as it involves interpretation of Constitution (Art.14).",
      "addresses_issue": "i3",
      "key_observation": "Validity challenged on ground it contravenes Constitution article."
    },
    {
      "id": "cr2",
      "text": "Point is whether necessary for disposal of case to decide validity of impugned portion; all other conditions for s.113 proviso and Art.228 satisfied.",
      "addresses_issue": "i2",
      "key_observation": "Courts below erred; validity must be decided first, then severability."
    },
    {
      "id": "cr3",
      "text": "Question raised and pressed by appellant must be decided; without it, case cannot be disposed. Severability arises only after invalidity held; cannot presuppose non-severability to avoid deciding validity.",
      "addresses_issue": "i2",
      "key_observation": "Impugned part not severable view does not negate necessity to decide validity."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "It is necessary to decide the question of the validity of the impugned part of the definition to dispose of the case.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Proviso to s.113 CPC and Art.228 apply.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Uttar Pradesh Zamindars Debt Reduction Act, 1953",
      "sections": [
        "Definition of 'debt' (Section 2(f))"
      ],
      "relevance": "Impugned exclusion of debts to scheduled banks etc. challenged as violating Art.14; validity necessary to determine applicability for relief."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14",
        "Article 228"
      ],
      "relevance": "Art.14 for equal protection challenge; Art.228 for High Court withdrawal on substantial constitutional question."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Proviso to Section 113"
      ],
      "relevance": "Requires subordinate court to state case to High Court on validity of Act provision if necessary for disposal."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; held that it is necessary to decide the validity of the impugned portion of the definition of 'debt' for disposal of the case, reversing High Court and Civil Judge orders.",
    "relief_granted": "Appeal allowed; case to proceed with decision on validity question.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The question as to the severability of the impugned part of the definition from the rest would arise only after it had been decided that the impugned part was invalid.\"",
      "speaker": "court",
      "significance": "Core reasoning why validity must be decided first."
    },
    {
      "text": "\"Without a decision of that question the case could not be disposed of.\"",
      "speaker": "court",
      "significance": "Establishes necessity for invoking s.113 proviso and Art.228."
    }
  ],
  "_case_id": "1957_117",
  "_label": 1,
  "_text_length": 9258,
  "_extracted_at": "2026-02-08T22:37:04.392640"
}