{
  "metadata": {
    "case_name": "Vadivelu Thevar & Anr. v. State of Madras",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha J."
    ],
    "case_number": "Criminal Appeals Nos. 24 and 25 of 1957",
    "date_of_judgment": "1957-04-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The occurrence took place at about 11-30 p.m. on November 10, 1955, at Muthupet, in front of the tea stall of Kannuswami.",
      "type": "material",
      "date": "1955-11-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Kannuswami was about to attend to the call for dinner when an old man came into the shop and asked for a cup of tea. When Kannuswami got busy preparing the tea, the two appellants rushed into the premises. The old man ran away, and the two accused dragged Kannuswami out of the shop on to the road-side.",
      "type": "material",
      "date": "1955-11-10",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "The first appellant gave him several blows on the front part of his body in the region of the chest with an aruval-a cutting instrument about 2 feet long including the handle. Kannuswami fell down on his back and cried out for help.",
      "type": "material",
      "date": "1955-11-10",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "His wife (PW1) tried to come to his rescue by raising and putting his head into her lap after the two accused had left him.",
      "type": "material",
      "date": "1955-11-10",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Both the accused returned. PW1 placed his head on the ground and went and stood on the steps of the tea stall. The first appellant made the body of Kannuswami lie with face downwards and gave a number of cuts in the region of the head, the neck and back. These injuries were such as to cause instantaneous death.",
      "type": "material",
      "date": "1955-11-10",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "At the time of the second assault, Shunmuga Thevar (PW3) came and remonstrated with the accused but to no purpose. After inflicting the injuries, both the accused ran away.",
      "type": "material",
      "date": "1955-11-10",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "It was the first appellant (A-2) who inflicted cutting injuries with the aruval. The second appellant (A-1) was standing nearby.",
      "type": "material",
      "date": "1955-11-10",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "There were two electric lights burning in the tea shop, a Panchayat Board light burning on the road, as also a light burning on the pathway leading to the cinema-house.",
      "type": "background",
      "date": "1955-11-10",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "PW1 went and told Ganapathi (PW4) who had a tea stall on the other side of the road, and informed him as to what had taken place. He asked her to lodge information at the Police Station.",
      "type": "procedural",
      "date": "1955-11-10",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "PW1 went to the Muthupet Police Station, found it shut, went to the house of the Sub-Inspector of Police, who took her to the Police Station, and recorded her statement as the first information report (Exhibit P-1).",
      "type": "procedural",
      "date": "1955-11-10",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Sub-Inspector held an inquest early in the morning.",
      "type": "procedural",
      "date": "1955-11-11",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Prosecution examined PW1 (widow), PW2 (assistant in Ganapathi Thevar's tea shop), PW3 (proprietor of cinema-house), PW4 (Ganapathi, tea stall near cinema-house).",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "PW2 testified to seeing Vadivelu cut Kannuswami and Chinniah standing by, but stated accused in dock were not those persons. Cross-examined by PP, admitted not telling police earlier.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "PW3 admitted examined by police two days after, did not tell police he saw accused assaulting. Treated hostile.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "PW4 stated PW1 came weeping saying Chinniah and Vadivelu Thevar cut her husband, but accused in court were not those persons.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "PW14 (Investigating SI) stated PW3 told him he saw A2 cutting deceased on head and neck, A1 standing by.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f17",
      "text": "PW1's statement in committing court (Ex D-2) recorded as A1 cutting even after PW3 asked not to, but Sessions Judge held recording mistake, actually A2.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "PW1 admitted deceased transported for life for murder, jailed twice after for cut injuries.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f19",
      "text": "Medical evidence consistent with double attack: first on front, then on back, head, neck. Dozen incised gaping wounds.",
      "type": "material",
      "date": "1955-11-11",
      "source": "prosecution"
    },
    {
      "id": "f20",
      "text": "Sessions Court convicted A2 (first appellant) u/s 302 IPC death; A1 (second appellant) u/s 302 r/w 109 IPC life, modified to 326 IPC 5 years by High Court.",
      "type": "procedural",
      "date": "1956-03-28",
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "High Court confirmed death for A2, modified for A1 on July 25, 1956.",
      "type": "procedural",
      "date": "1956-07-25",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the conviction can be sustained solely on the uncorroborated testimony of PW1, the wife of the deceased.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there is a rule of law or prudence requiring corroboration of a single witness in a murder case.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the sentence of death is appropriate or lesser sentence should be imposed.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Conviction and sentences should not be upheld as they rest solely on testimony of PW1, which is not free from blemish, particularly discrepancy in her committing court statement (Ex D-2) where A1 recorded as cutting.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "PW3's court evidence contradicts PW1, as PW1 said PW3 saw assault but PW3 denied.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Not safe to convict on testimony of single witness in murder case, as rule of prudence; cited Mohamed Sugal Esa and Vemireddy cases requiring corroboration.",
      "supporting_facts": [
        "f12",
        "f13",
        "f14",
        "f15"
      ],
      "legal_basis": "Mohamed Sugal Esa Mamasan v. The King; Vemireddy Satyanarayan Reddy v. State of Hyderabad"
    },
    {
      "id": "pa4",
      "text": "Even if conviction, not impose death penalty, lesser punishment meets ends of justice.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Discrepancy in Ex D-2 is recording mistake by committing Magistrate; PW1 consistently stated A2 used weapon, A1 aided.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "PW2-4 unreliable, turned hostile, made inconsistent statements; PW3 told police opposite of court statement.",
      "supporting_facts": [
        "f13",
        "f14",
        "f15",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "PW1's testimony reliable, consistent with FIR, medical evidence; frank admissions about husband's past.",
      "supporting_facts": [
        "f10",
        "f19",
        "f18"
      ],
      "legal_basis": "Section 134 Indian Evidence Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sessions Judge correct that Ex D-2 recording defective, A1 recorded instead of A2; consistent throughout PW1 deposition; not challenged in High Court appeals or leave petitions.",
      "addresses_issue": "i1",
      "key_observation": "No doubt recording mistake."
    },
    {
      "id": "cr2",
      "text": "PW3's court evidence not true version as contradicts his police statement; cannot contradict PW1.",
      "addresses_issue": "i1",
      "key_observation": "Both PW3 statements cannot be true."
    },
    {
      "id": "cr3",
      "text": "PW1 severely cross-examined, frank admissions, evidence rings true; consistent with FIR and medical; other PWs unreliable.",
      "addresses_issue": "i1",
      "key_observation": "PW1 entirely reliable."
    },
    {
      "id": "cr4",
      "text": "No rule of law requiring corroboration for single witness in murder; rule of prudence only in cases like child or accomplice; here PW1 reliable, court can act on it; S.134 Evidence Act: no particular number of witnesses required.",
      "addresses_issue": "i2",
      "key_observation": "Evidence weighed, not counted; quality over quantity."
    },
    {
      "id": "cr5",
      "text": "Cold-blooded murder, no extenuating circumstances; nature of proof irrelevant to sentence.",
      "addresses_issue": "i3",
      "key_observation": "Death sentence appropriate."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Court can act on uncorroborated testimony of single witness if reliable.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Conviction of first appellant under s.302 IPC upheld; second under s.326 IPC upheld.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Death sentence for first appellant upheld; no mitigation.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mohamed Sugal Esa Mamasan v. The King",
      "citation": "A.I.R. 1946 P.C. 3",
      "treatment": "referred",
      "relevance": "Unsworn child witness; corroboration rule of prudence not law; applicable to Indian Evidence Act."
    },
    {
      "case_name": "Vemireddy Satyanarayan Reddy v. State of Hyderabad",
      "citation": "1956 S.C.R. 247",
      "treatment": "distinguished",
      "relevance": "Corroboration required due to witness position analogous to accomplice, not general rule."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "109",
        "326"
      ],
      "relevance": "Conviction and sentence under these sections; death or life for 302, 5 years RI for 326."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "134"
      ],
      "relevance": "No particular number of witnesses required for proof of any fact."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals dismissed. Supreme Court upheld Madras High Court judgment confirming Sessions Court: death sentence under s.302 IPC for first appellant (A-2) for murder of Kannuswami; conviction of second appellant (A-1) modified to s.326 IPC with 5 years RI.",
    "relief_granted": "None to appellants.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is a sound rule in practice not to act on the uncorroborated evidence of a child, whether sworn or unsworn, but this is a rule of prudence and not of law.\"",
      "speaker": "court",
      "significance": "Distinguishes prudence from law on single witness corroboration."
    },
    {
      "text": "\"As a general rule, a court can and may act on the testimony of a single witness though uncorroborated. One credible witness outweighs the testimony of a number of other witnesses of indifferent character.\"",
      "speaker": "court",
      "significance": "Core holding on reliability over quantity."
    },
    {
      "text": "\"Section 134 of the Indian Evidence Act has categorically laid it down that no particular number of witnesses shall in any case be required for the proof of any fact.\"",
      "speaker": "court",
      "significance": "Statutory basis rejecting plurality requirement."
    }
  ],
  "_case_id": "1957_108",
  "_label": 0,
  "_text_length": 29164,
  "_extracted_at": "2026-02-10T19:23:45.142836"
}