{
  "metadata": {
    "case_name": "Subramania Goundan v. State",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "GOVINDA MENON J."
    ],
    "case_number": "Criminal Appeal No. 127 of 1957",
    "date_of_judgment": "1957-09-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Village of Vengakalpalayam was faction-ridden; appellant, his father (A2 Marappa Goundan), and others on one side; deceased Marappa Goundan, Muthu Goundan, Munia Goundan (PW5) and others on rival faction.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant's father was leading man of village, assigned by consent of villagers; dignity offended by rival faction actions; apprehended prestige undermined.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "About three days prior to occurrence (night of 6-7 June 1956), Munia Goundan stated to hearing of appellant that he would wipe out appellant's father and partisans, or shave his moustache; deceased also proclaimed similar.",
      "type": "disputed",
      "date": "1956-06-03",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Appellant armed with aruval (sickle), spear, knife; went to Chettithottam near his garden; deceased Marappa Goundan sleeping in field-shed; cut him on neck with aruval, inflicted other injuries.",
      "type": "material",
      "date": "1956-06-06",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "While going to Munia Goundan's house, met deceased Muthu Goundan coming opposite; thinking he would catch him, stabbed Muthu with spear; aruval fell there.",
      "type": "material",
      "date": "1956-06-06",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Went to Munia Goundan (PW5) house, stabbed him.",
      "type": "material",
      "date": "1956-06-06",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Set fire to shed of Sennimalai Goundan (PW4), partisan of rival faction, at distance of four furlongs.",
      "type": "material",
      "date": "1956-06-06",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Returned to own garden, lay down; wrapped in blood-stained bed-sheet MO12 from rafter.",
      "type": "material",
      "date": "1956-06-06",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Karuppa Goundan (PW1) heard cries from Munia house, ran there with Sennimalai (PW4); found Munia injured, saw PW4's shed aflame.",
      "type": "procedural",
      "date": "1956-06-07",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "PW4 and PW5 went to burning shed; on way saw Natarajan (W10, son of deceased Marappa) weeping; found Marappa dead in shed with injuries.",
      "type": "material",
      "date": "1956-06-07",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "PW1 and PW4 went to village Munsif (4 miles away), gave report at 5 a.m. on 7-6-1956 (Ex P1).",
      "type": "procedural",
      "date": "1956-06-07",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Info reached Sub-Inspector Avanashi (PW17) at 8:30 a.m.; reached scene at 11 a.m.; started investigation.",
      "type": "procedural",
      "date": "1956-06-07",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "At 12 noon near temple, arrested appellant; appellant made statement (admissible Ex P13); seized bloodstained drawer MO10, baniyan MO11.",
      "type": "procedural",
      "date": "1956-06-07",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Appellant took police to garden, produced blood-stained bed-sheet MO12 from rafter.",
      "type": "material",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Statements from Natarajan (W10), Nachimuthu (PW11, son of Muthu), Munia (PW5), others.",
      "type": "procedural",
      "date": "1956-06-07",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "9 June 1956, 3:50 p.m., appellant produced before Sub-Magistrate (PW7); warnings under Criminal Rules; given 2 days reflection till 11 June.",
      "type": "procedural",
      "date": "1956-06-09",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "11 June 1956, 3:50 p.m., warnings repeated; recorded voluntary confession Ex P3/A in own words; confessed murders of Marappa and Muthu, injury to Munia.",
      "type": "material",
      "date": "1956-06-11",
      "source": "prosecution"
    },
    {
      "id": "f18",
      "text": "Sessions Court: Charges framed - 1: appellant murder Marappa with aruval; 2: murder Muthu with spear; 3: appellant+A2 attempt murder Munia with spear/knife; 4: A3+A4 abetment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Sessions Judge acquitted A2,A3,A4; convicted appellant on 1,2 (death), 3 (RI 2 years); relied on PW10 Natarajan (eyewitness Marappa), PW11 Nachimuthu, PW12 Subbanna (Muthu), PW5 Munia, PW6; confession voluntary/true.",
      "type": "procedural",
      "date": "1956-10-23",
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "High Court (Somasundaram J.): Disbelieved oral testimony PW5,10,11,12,6; but upheld conviction on voluntary/true retracted confession corroborated by MO12 recovery, blood on MO10,11.",
      "type": "procedural",
      "date": "1957-02-12",
      "source": "high_court"
    },
    {
      "id": "f21",
      "text": "Appellant denied offence; retracted confession claiming police threatened to implicate father A2 and 5 others unless he confessed.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f22",
      "text": "Postmortem Ex P4: Marappa had 13 injuries, including 3 on neck.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f23",
      "text": "PW5 Munia and PW6 deposed 3 persons coming northward when stabbed; PW5 earlier Ex D2 said more than one attacked.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f24",
      "text": "Chemical Examiner: MO10,11,12 stained with human blood; no explanation by appellant.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court erred in upholding conviction based on retracted confession Ex P3/A, without relying on oral eyewitness testimony.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the confession was voluntary, true, and sufficiently corroborated to sustain conviction.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Confession not voluntary: police influence persisted despite magistrate procedure; produced in court hall cleared of police but constable in charge; gateway between PS and court/sub-jail; threats by SI/CI to implicate father A2 and 5 others unless confessed.",
      "supporting_facts": [
        "f16",
        "f17",
        "f21"
      ],
      "legal_basis": "ss. 164, 364 CrPC; Madras Criminal Rules of Practice"
    },
    {
      "id": "pa2",
      "text": "Confession not true: mentions only one cut on Marappa neck but postmortem 13 injuries inc. 3 neck; no mention of others present when stabbing Munia but PW5/PW6 say 3 persons; PW5 Ex D2 more than one; no reference to MO12 recovery from his statement.",
      "supporting_facts": [
        "f4",
        "f22",
        "f23",
        "f17"
      ],
      "legal_basis": "Sarwan Singh v. State of Punjab (compare confession with prosecution evidence)"
    },
    {
      "id": "pa3",
      "text": "Retracted confession unsafe without corroboration; retracted as soon as opportunity; blood on MO10-12 only 'stains' not large patches expected; chemical report insufficient.",
      "supporting_facts": [
        "f24",
        "f21"
      ],
      "legal_basis": "Rule of prudence: retracted confession needs corroboration (Balbir Singh v. State of Punjab)"
    },
    {
      "id": "pa4",
      "text": "No s.342 CrPC question before committing magistrate re confession; no opportunity to complain earlier.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "s.342 CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Confession voluntary: magistrate followed procedure ss.164/364 CrPC, warnings, time for reflection; endorsement confirms voluntary; PW17 denied threats.",
      "supporting_facts": [
        "f16",
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Confession true: general trend matches prosecution case; absence of details doesn't falsify; no contrary statements.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Corroborated: human blood on MO10,11 (clothes), MO12 (bedsheet recovered per statement); no explanation by appellant; reasons for retraction false.",
      "supporting_facts": [
        "f13",
        "f14",
        "f24",
        "f21"
      ],
      "legal_basis": "General corroboration sufficient for retracted confession, unlike accomplice evidence"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Even assuming oral testimony of PW5,10,11 insufficient, proceed on basis of confession alone.",
      "addresses_issue": "i1",
      "key_observation": "Testimony not inherently unbelievable but not necessary to rely on."
    },
    {
      "id": "cr2",
      "text": "Confession voluntary: magistrate cleared court of police, warnings, reflection time; procedure per ss.164/364 CrPC, Madras Rules; cross-exam no material defect; questions standard, not inducement; PW17 denied threats; s.342 omission irrelevant as accused had copy earlier per s.207A/173(4).",
      "addresses_issue": "i2",
      "key_observation": "No police influence; appellant's reason (save father) unconvincing."
    },
    {
      "id": "cr3",
      "text": "Confession true: compare with evidence/probabilities; details absence doesn't falsify; matches general case; discrepancies (injuries, others present) not fatal.",
      "addresses_issue": "i2",
      "key_observation": "No contrary statements."
    },
    {
      "id": "cr4",
      "text": "Retracted confession basis for conviction if voluntary/true + corroborated; no absolute rule needing material corroboration if retraction reasons false; general corroboration sufficient (unlike accomplice needing material particulars); here blood on MO10-12 (no explanation), recovery MO12; retraction reasons false; 'stains' not minimal.",
      "addresses_issue": "i2",
      "key_observation": "Distinction from accomplice evidence; general trend substantiated."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Retracted confession can be sole basis of conviction if court satisfied voluntary/true and corroborated in general trend by circumstances (e.g. recoveries, bloodstains); not equated to accomplice evidence.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Confession Ex P3/A voluntary, true, corroborated; appellant guilty beyond reasonable doubt of murders and attempt to murder.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sarwan Singh and Harbans Singh v. The State of Punjab",
      "citation": null,
      "treatment": "followed",
      "relevance": "To test truth of confession by comparing with prosecution evidence and probabilities."
    },
    {
      "case_name": "Balbir Singh v. State of Punjab",
      "citation": "A.I.R. 1957 S.C. 216",
      "treatment": "followed",
      "relevance": "Retracted confession needs corroboration as prudence rule."
    },
    {
      "case_name": "Kesava Pillai alias Koralan and another and Kesava Pillai alias Thillai Kannu Pillai",
      "citation": "I.L.R. 53 Mad. 160",
      "treatment": "referred",
      "relevance": "If retraction reasons false on face, confession actable without corroboration."
    }
  ],
  "statutes_cited": [
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "164",
        "364",
        "342",
        "207-A(3)",
        "173(4)",
        "154"
      ],
      "relevance": "Recording confession; furnishing documents to accused; examination of accused."
    },
    {
      "name": "Evidence Act",
      "sections": [
        "133",
        "114(b)"
      ],
      "relevance": "Conviction on uncorroborated accomplice testimony possible but court presumes unworthy without material corroboration; distinction from retracted confession."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court confirmation of Sessions Court conviction and death sentences on charges 1 and 2, and RI 2 years on charge 3; appeal by special leave dismissed as confession proved guilt beyond doubt.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"a retracted confession cannot be made solely the basis of conviction unless the same is corroborated\"",
      "speaker": "court",
      "significance": "States rule of prudence but clarifies general corroboration suffices."
    },
    {
      "text": "\"the standards of corroboration in the two are quite different. In the case of the person confessing who has resiled from his statement, general corroboration is sufficient while an accomplice's evidence should be corroborated in material particulars.\"",
      "speaker": "court",
      "significance": "Distinguishes retracted confession from accomplice evidence."
    },
    {
      "text": "\"when the appellant has given no satisfactory explanation for the presence of human-blood on material objects Nos. 10, 11 & 12, it follows that the blood of the murdered was on these material objects.\"",
      "speaker": "court",
      "significance": "Key corroboration finding upholding conviction."
    }
  ],
  "_case_id": "1957_140",
  "_label": 0,
  "_text_length": 28875,
  "_extracted_at": "2026-02-10T19:24:34.582477"
}