{
  "metadata": {
    "case_name": "Petitions Nos. 63 and 64 of 1957",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "DAS C.J."
    ],
    "case_number": "Petitions Nos. 63 and 64 of 1957",
    "date_of_judgment": "1957-05-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "After the general elections in all the States and Union territories of India, except in the Union territory of Himachal Pradesh, which is to return four members to the Lok Sabha and in two constituencies in the State of Punjab, the old Lok Sabha was dissolved on April 4, 1957 and the New Lok Sabha was constituted on April 5, 1957, under s. 73 of the Representation of the People Act, 1951.",
      "type": "background",
      "date": "1957-04-04",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "As required by s. 4 of the Presidential and Vice-Presidential Election Act, 1952, the Election Commission issued a notification in the official Gazette appointing April 16, 1957, as the last date for making nominations, April 17, 1957, as the date for the scrutiny of the nominations, April 20, 1957, as the last date for the withdrawal of candidatures, May 6, 1957, as the polling date and May 10, 1957, as the date for the counting of the votes and the declaration of the result.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The term of office of the present President is due to expire on the mid-night of May 12, 1957.",
      "type": "background",
      "date": "1957-05-12",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After the notification constituting the new Lok Sabha was published in the Press on April 7, 1957, the petitioner in the first petition applied to the Election Commission for the supply of the nomination papers, which he eventually received at Nagpur in the afternoon of April 10, 1957. This left a period of five days for the filing of the nomination paper before the Returning Officer at New Delhi.",
      "type": "procedural",
      "date": "1957-04-10",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "The petitioner in the first petition submits that the time was too short and he was prevented from filing his nomination paper due to want of time. He has filed the petition as a citizen of India and as an intending candidate for the Presidential election.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The petitioner in the second petition is a member of the Hindu Mahasabha and is contesting the election to the Lok Sabha as an independent candidate from Kangra Parliamentary constituency in the State of Punjab. He filed his nomination paper on January 28, 1957, as originally the polling was scheduled to commence in that constituency on February 24, 1957. The polling, however, has since been postponed and fixed for June 2, 1957.",
      "type": "background",
      "date": "1957-06-02",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The petitioner in the second petition has filed the petition as a citizen of India and as a prospective member of Lok Sabha and contends that if the Presidential election is held on May 6, 1957, he will be deprived of his right to vote for the election of the President of the Union.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The first main petition was presented on April 26, 1957, and the second on April 29, 1957. Along with each of the said petitions has been filed a Civil Miscellaneous Petition asking for a stay of the polling for the Presidential election fixed for May 6, 1957.",
      "type": "procedural",
      "date": "1957-04-26",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On March 28, 1957 some members of the then Lok Sabha had raised a question as to the danger and impropriety of holding the election of the President before the completion of the elections throughout the territory of India.",
      "type": "background",
      "date": "1957-03-28",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the electoral college for the election of the President under Article 54 consists of members elected at the crucial date of polling or must include all elected members after completion of elections in all States and Union territories.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether doubts and disputes under Article 71(1) can be inquired into and decided by the Supreme Court before the completion of the entire election process.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether holding the Presidential election before completion of all Lok Sabha elections discriminates against candidates from unfinished constituencies, offending Article 14.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The electoral college must consist of all the elected members falling within both categories of Article 54 after elections in all States and Union territories are completed. Inasmuch as elections have not taken place at all in Himachal Pradesh and in two constituencies of the State of Punjab, the electoral college cannot be constituted until after those members are also elected.",
      "supporting_facts": [
        "f1",
        "f6"
      ],
      "legal_basis": "Article 54, Article 62(1)"
    },
    {
      "id": "pa2",
      "text": "A grave doubt has arisen in connection with the election of the President and such a doubt must, under Article 71, be inquired into and decided by this Court before polling.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Article 71(1)"
    },
    {
      "id": "pa3",
      "text": "If the Presidential election is held on May 6, 1957, the petitioner in the second petition will be deprived of his right to vote, and there is discrimination offending against Article 14.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Article 14"
    },
    {
      "id": "pa4",
      "text": "The time left for filing nomination was too short due to late receipt of papers.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The electoral college consists of those members falling under clauses (a) and (b) of Article 54 who are elected at the crucial date, that is to say, the date when the election is to take place. Vacancies do not hold up the election.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Article 54, Article 62(1), (2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The word 'election' in Article 71(1) and related provisions means the entire process culminating in a candidate being declared elected, following the interpretation in N.P. Ponnuswami v. Returning Officer. Doubts and disputes must be inquired into after completion of the entire process.",
      "addresses_issue": "i2",
      "key_observation": "Art. 71 postulates an election and the inquiry is after such completed election."
    },
    {
      "id": "cr2",
      "text": "The Presidential and Vice-Presidential Election Act, 1952, particularly sections 14 and 18, provides that election shall be called in question only by election petition after the process, covering all stages including nomination and voting issues.",
      "addresses_issue": "i2",
      "key_observation": "Parliament understood 'election' in Art. 71 as the entire process."
    },
    {
      "id": "cr3",
      "text": "Allowing interference before completion would hold up the election beyond Art. 62(1) deadline, against election law principles that elections should not be held up.",
      "addresses_issue": "i2",
      "key_observation": "In consonance with Art. 62 and good sense."
    },
    {
      "id": "cr4",
      "text": "No discrimination under Art. 14 established; different polling dates due to exigencies are normal.",
      "addresses_issue": "i3",
      "key_observation": "No good ground for holding discrimination."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The word 'election' in Article 71 means the entire election process culminating in declaration of elected candidate; doubts and disputes inquired into after completion.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Present petitions are premature and cannot be entertained at this stage.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "N.P. Ponnuswami v. Returning Officer, Namakkal Constituency",
      "citation": "1952 S.C.R. 218",
      "treatment": "followed",
      "relevance": "Interpreted 'election' as entire process; no interference mid-process under Art. 329(b)."
    },
    {
      "case_name": "Srinivasalu v. Kuppuswami",
      "citation": "A.I.R. 1928 Mad. 253, 255",
      "treatment": "referred",
      "relevance": "Usage of 'election' in wide sense."
    },
    {
      "case_name": "Sat Narain v. Hanuman Prasad",
      "citation": "A.I.R. 1945 Lah. 85",
      "treatment": "referred",
      "relevance": "Usage of 'election' in wide sense."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 54",
        "Article 56",
        "Article 62",
        "Article 71",
        "Article 14",
        "Article 324",
        "Article 327",
        "Article 329",
        "Article 145"
      ],
      "relevance": "Defines electoral college, term, mandatory completion before expiry, jurisdiction for doubts, bars questioning except by election petition, election superintendence."
    },
    {
      "name": "Presidential and Vice-Presidential Elections Act, 1952",
      "sections": [
        "Section 4",
        "Section 14",
        "Section 18"
      ],
      "relevance": "Timeline notification, election called in question only by petition to Supreme Court after process, grounds for voiding election including non-compliance."
    },
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "Section 73",
        "Section 80"
      ],
      "relevance": "Constitution of new Lok Sabha, election petition forum."
    },
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "Chapter IX-A"
      ],
      "relevance": "Defines bribery and undue influence for election offences."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The petitions seeking inquiry under Article 71 into doubts regarding the Presidential election electoral college and stay of polling on May 6, 1957, are premature as Article 71 contemplates inquiry after completion of the entire election process via election petition; petitions Nos. 63 and 64 of 1957 and civil miscellaneous petitions dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the word election could be and had been properly used with respect to the entire process which consisted of several stages\"",
      "speaker": "court",
      "significance": "Defines scope of 'election' following Ponnuswami."
    },
    {
      "text": "\"Art. 71 postulates an election and the word election occurring in Art. 71 means the entire election process culminating in a candidate being declared elected\"",
      "speaker": "court",
      "significance": "Core holding on timing of Art. 71 inquiry."
    },
    {
      "text": "\"the present petitions are premature and cannot be entertained at this stage\"",
      "speaker": "court",
      "significance": "Basis for dismissal."
    }
  ],
  "_case_id": "1957_17",
  "_label": 0,
  "_text_length": 22379,
  "_extracted_at": "2026-02-08T22:34:52.014290"
}