{
  "metadata": {
    "case_name": "Steel Bros. Co. Ltd. & Ellermans Arracan Rice and Trading Co. Ltd. (assessee) v. Commissioner of Income-tax, West Bengal",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Bhagwati, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Prior to November 29, 1928, Steel Bros. Co. Ltd. (Steels) and Ellermans Arracan Rice and Trading Co. Ltd. (Ellermans) carried on trade in Burma rice and its by-products in Burma, London and elsewhere through Burma and London Bullenger Rice Pool and the New General Rice Co. Ltd.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Steels and Ellermans had rice milling machines and produced rice from paddy. Burma Co. Ltd. (Burma) also had a few rice mills, never purchased paddy or sold rice. All shares of Burma held by Steels, who were also its managing agents.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On or about November 29, 1928, agreement entered into between Steels, Burma and Ellermans for amalgamated working of Burma rice business in Burma and London under management of Steels. Combined business referred to as the Combination.",
      "type": "material",
      "date": "1928-11-29",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "All stocks of Burma rice and by-products at 30th November 1928 excluded and remained property of individual owners. Entire business in Burma hitherto carried on by Ellermans taken over and managed by Steels from 1st December 1928, conducted from Steels offices in Steels name solely in conjunction with rice business of Steels and Burma.",
      "type": "material",
      "date": "1928-12-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Profit or loss of Combination at Rangoon, Bassein, Akyab, Moulmein shared: Steels/Burma 68/68/68/72, Ellermans 32/32/32/28.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Rice mills of Burma (Burma Upper Kanungtoe Mill in Rangoon, Burma Mill in Bassein, Burmas Martaban Mill in Moulmein) worked by Steels for Combination.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Agreement effective from 1st December 1928, terminable on 30th November 1930 or subsequent by notice not later than preceding 1st August.",
      "type": "material",
      "date": "1928-12-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Agreement signed by Steels and Ellermans (common seals affixed), and by James Kilgour Michie for and on behalf of Burma.",
      "type": "material",
      "date": "1928-11-29",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "For assessment years 1943-44 and 1944-45, Combination (assessee) applied to ITO under s26A for registration of partnership constituted of Steels and Ellermans, supported by copy of 1928 agreement. Applications signed by Steels and Ellermans only.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "ITO refused registration on March 19, 1948 and March 31, 1949: (i) partnership constituted of three parties (Steels, Ellermans, Burma), deed did not specify shares of three; (ii) loss not properly allocated, whole loss of Steels and Burma borne by Steels.",
      "type": "procedural",
      "date": "1948-03-19",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Second Additional Appellate Assistant Commissioner upheld ITO orders: application signed by two partners, deed showed three, shares of Steels and Burma not shown separately.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Tribunal on 20th February 1951 held partnership really between Steels and Ellermans, Burma 100% subsidiary of Steels had hardly anything to do; deed proper, should be registered.",
      "type": "procedural",
      "date": "1951-02-20",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "CIT applied, Tribunal referred question under s66(1): Whether on proper construction of deed dated 29th November 1928 and relevant facts, Tribunal right in holding partnership between Steels and Ellermans, registration allowed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "High Court answered question in negative: partnership of three companies, applications not by three, deed did not specify shares.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "High Court refused certificate u/s66A(2), assessee obtained special leave from Supreme Court u/art 136.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "No share of profits of Combination ever paid to or received by Burma; only earnings of Burma by way of milling hire paid by Steels.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Profit and loss account of Burma for years ending November 1941, 1942, 1943 considered by Tribunal.",
      "type": "background",
      "date": null,
      "source": "tribunal"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on a proper construction of the agreement dated 29th November, 1928, and having regard to the relevant facts and circumstances of the case, the partnership was really between Steels and Ellermans only (such that applications signed only by them specifying their shares were valid for registration u/s 26A), or included Burma as third partner.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Partnership really between Steels and Ellermans; Burma 100% subsidiary of Steels, hardly anything to do with Combination; surrounding circumstances u/s 6 Partnership Act show real relation between parties.",
      "supporting_facts": [
        "f2",
        "f12",
        "f16",
        "f17"
      ],
      "legal_basis": "Section 6 Indian Partnership Act, 1932"
    },
    {
      "id": "pa2",
      "text": "Burma never purchased paddy or sold rice; no share of profits paid to Burma; only milling hire from Steels; Steels owned all shares, managing agents, no conflict of interests.",
      "supporting_facts": [
        "f2",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Agreement hybrid: tripartite for business, but partnership only between Steels and Ellermans; Burma confirming party for assets thrown in.",
      "supporting_facts": [
        "f3",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Ellermans had specific rights not given to Burma (e.g., advice on progress, audit, inspection, superintending engineers rights, finance, bankers), so Burma not partner.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "On true construction of agreement, particularly recital, clauses 1, 3a, 12, 14: partnership of three companies; applications not made by three, deed did not specify respective shares, registration rightly refused.",
      "supporting_facts": [
        "f3",
        "f5",
        "f7",
        "f8"
      ],
      "legal_basis": "Section 26A Indian Income-tax Act, 1922; Rule 2 Indian Income-tax Rules, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Agreement between three parties for amalgamated working under Steels management; business conducted by Steels for all; profit/loss shared Steels/Burma jointly vs Ellermans; accounts binding on all three; restrictions on all three; termination by any party; disputes by arbitration; intent to work jointly.",
      "addresses_issue": "i1",
      "key_observation": "Clauses spell out partnership between Steels, Burma, Ellermans; relationship of partners sharing profits of business carried on by all."
    },
    {
      "id": "cr2",
      "text": "Specific rights to Ellermans (not Burma) explained by Burma being 100% subsidiary of Steels (managing agents), no conflict, Steels protect Burma interests; superfluous to give Burma separate rights.",
      "addresses_issue": "i1",
      "key_observation": "Steels/Burma bracketed jointly in profit sharing (roughly 2:1 with Ellermans); Steels receive joint share, internal matter thereafter."
    },
    {
      "id": "cr3",
      "text": "Burma contributed properties/mills; entitled to terminate, arbitrate disputes; all ingredients of partnership satisfied (sharing profit/loss, agency by Steels).",
      "addresses_issue": "i1",
      "key_observation": "Not hybrid; Burma partner with joint share."
    },
    {
      "id": "cr4",
      "text": "Facts (Steels own Burma shares, no paddy/rice by Burma post-agreement, no direct profits to Burma, milling hire internal) do not detract; explain why no separate protections needed; internal arrangements between Steels/Burma irrelevant.",
      "addresses_issue": "i1",
      "key_observation": "Real relation confirms three partners."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "On true construction, Burma was partner with Steels and Ellermans; joint share with Steels; applications signed only by Steels/Ellermans without Burma's signature or individual share rightly refused u/s 26A and Rule 2.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 26A",
        "Section 66(1)",
        "Section 66A(2)"
      ],
      "relevance": "Governs application for firm registration specifying shares, signed by all partners; Tribunal reference; certificate for appeal."
    },
    {
      "name": "Indian Income-tax Rules, 1922",
      "sections": [
        "Rule 2"
      ],
      "relevance": "Application for registration to be signed by all partners (not minors)."
    },
    {
      "name": "Indian Partnership Act, 1932",
      "sections": [
        "Section 4",
        "Section 6"
      ],
      "relevance": "Definition of partnership; determining existence by real relation from all relevant facts."
    },
    {
      "name": "Indian Contract Act, 1872",
      "sections": [
        "Section 239"
      ],
      "relevance": "Earlier definition of partnership (relevant at time of agreement)."
    },
    {
      "name": "Arbitration Act, 1889",
      "sections": [],
      "relevance": "Governs arbitration for disputes under agreement."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 136"
      ],
      "relevance": "Special leave to appeal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court holds that the partnership under the 1928 agreement was between three parties: Steels, Burma, and Ellermans. Applications for registration under s26A signed only by Steels and Ellermans, without Burma's signature or specification of its individual share, were rightly refused by ITO. High Court correctly answered reference in negative. Appeal dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the clauses of the agreement hereinabove set out would, if there was nothing more, spell out a partnership between the Steels, Burma and Ellermans.\"",
      "speaker": "court",
      "significance": "Core finding on agreement construction establishing three-partner partnership."
    },
    {
      "text": "\"On a true construction of the agreement dated 29th November, 1928, we have, therefore come to the conclusion that Burma was a partner along with Steels and Ellermans in the Combination.\"",
      "speaker": "court",
      "significance": "Direct holding resolving the key issue against appellant."
    },
    {
      "text": "\"There is not the slightest doubt whatever that Burma was a partner with Steels and Ellermans in the business of the combination.\"",
      "speaker": "court",
      "significance": "Emphatic rejection of two-partner argument."
    }
  ],
  "_case_id": "1957_80",
  "_label": 0,
  "_text_length": 28644,
  "_extracted_at": "2026-02-10T19:23:39.147752"
}