{
  "metadata": {
    "case_name": "Appellant (Defendant No. 1) v. Respondents Nos. 1, 2 & 3 (Heirs of Original Plaintiff and Defendant No. 2)",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das J."
    ],
    "case_number": "Civil Appeal No. 228 of 1953",
    "date_of_judgment": "1957-02-07"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Bhagirathibai, wife of Shivagonda Patil and Navwali warchi Vatandar of Police Patil family, died in 1936. Plaintiff acquired heirship-ownership over suit properties as near heir.",
      "type": "background",
      "date": "1936",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Suit properties were in possession of defendant No. 2 without right.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Original plaintiff filed Suit No. 3/1942 against respondent No. 3 (defendant No. 2, Pirgonda Annappa) for declaration of ownership and possession of suit properties. Decree in ejectment obtained on March 28, 1944.",
      "type": "material",
      "date": "1942-03-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Decree confirmed in appeal on July 9, 1945.",
      "type": "procedural",
      "date": "1945-07-09",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Supreme Court of Kolhapur affirmed decree on April 2, 1946.",
      "type": "procedural",
      "date": "1946-04-02",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Original plaintiff applied for execution of decree but resisted by appellant (defendant No. 1). Application under O. XXI, r. 97 CPC complaining of resistance, dismissed under O. XXI, r. 99 on April 12, 1947.",
      "type": "procedural",
      "date": "1947-04-12",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Original plaintiff instituted suit (Civil Suit No. 23/1949) on March 12, 1948 under O. XXI, r. 103 CPC against appellant (defendant No. 1) and defendant No. 2 for declaration of right to recover possession.",
      "type": "procedural",
      "date": "1948-03-12",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Plaint prior to amendment stated defendant No. 2 in collusion with defendant No. 1 caused objection in execution; plaintiff filed misc. suit No. 5/1946 which was decided against plaintiff.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Appellant filed application on November 20, 1948 pointing out plaint defect: no title averred against appellant who was not party to earlier decree; requested no permission for amendment.",
      "type": "procedural",
      "date": "1948-11-20",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Plaintiff's pleader noted suit under O. XXI, r. 103 CPC, relief as per provision.",
      "type": "procedural",
      "date": "1948-11-20",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Appellant filed written statement on December 20, 1949 objecting suit not maintainable, no cause of action against him.",
      "type": "procedural",
      "date": "1949-12-20",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Preliminary issue framed on January 19, 1950: whether suit tenable against appellant.",
      "type": "procedural",
      "date": "1950-01-19",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Original plaintiff applied on March 29, 1950 to amend plaint by inserting para 1A detailing title from Bhagirathibai's death, heirship, earlier suit success; additions to para 3 stating defendant No. 1 from different Patil family.",
      "type": "procedural",
      "date": "1950-03-29",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Civil Judge, Senior Division, Kolhapur rejected amendment application and dismissed suit on March 31, 1950: no title case against defendant No. 1.",
      "type": "procedural",
      "date": "1950-03-31",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Appeal to Bombay High Court (Appeal No. 496 of 1950), judgment September 6, 1951: set aside trial court decree, allowed amendment subject to costs.",
      "type": "procedural",
      "date": "1951-09-06",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Appellant obtained special leave; present appeal filed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court was wrong in allowing amendment of the plaint at appellate stage in circumstances where limitation for suit under O. XXI, r. 103 CPC had expired and defect pointed out earlier.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in allowing amendment at late stage despite power existing; circumstances: limitation expired before March 29, 1950 application; defect drawn to notice on November 20, 1948 without amendment sought.",
      "supporting_facts": [
        "f9",
        "f10",
        "f13"
      ],
      "legal_basis": "O. XXI, r. 103 CPC; Kisandas Bupchand v. Rachappa Vithoba (tests: same relief without amendment? compensable by costs?)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Amendment necessary for substantial justice; defect due to pleader's mistake; does not alter nature of relief; compensable by costs.",
      "supporting_facts": [
        "f7",
        "f8",
        "f13"
      ],
      "legal_basis": "O. XXI, r. 103 CPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appellate court has power to allow amendment; discretion not exercised on wrong principle; limitation expiry factor to consider but does not affect power if justice requires; appellant's 1948 application post-limitation, sought to bar amendment.",
      "addresses_issue": "i1",
      "key_observation": "No injustice to appellant; amendment removes defect without changing relief quantity/quality."
    },
    {
      "id": "cr2",
      "text": "Cites L.J. Leach: courts decline amendments if fresh suit barred, but factor only for discretion.",
      "addresses_issue": "i1",
      "key_observation": "Follows Charan Das: power exists unless takes away accrued right, outweighed by special circumstances."
    },
    {
      "id": "cr3",
      "text": "Similar to Privy Council case: amendment allowed despite limitation as no bad faith, no change in relief nature.",
      "addresses_issue": "i1",
      "key_observation": "Mistake of trial court pleader; amendment does not introduce new case."
    },
    {
      "id": "cr4",
      "text": "Rejects Kisandas strict tests; no inflexible formula; follows Batchelor J.: amend unless injustice not compensable by costs.",
      "addresses_issue": "i1",
      "key_observation": "Amendments do not introduce new claim; appellant not surprised."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court properly exercised discretion in allowing plaint amendment at appellate stage.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "L. J. Leach & Co. v. Jardine Skinner & Co.",
      "citation": "1957 S.C.R. 438",
      "treatment": "followed",
      "relevance": "Amendment power exists despite limitation bar on fresh suit; factor for discretion only."
    },
    {
      "case_name": "Charan Das v. Amir Khan",
      "citation": "1920 L.R. 47 I.A. 255",
      "treatment": "followed",
      "relevance": "Amendment should not take away defendant's accrued limitation right unless special circumstances outweigh."
    },
    {
      "case_name": "Kisandas Bupchand v. Rachappa Vithoba",
      "citation": "1900 I.L.R. 33 Bom. 644",
      "treatment": "distinguished",
      "relevance": "Beaman J.'s tests rejected as inflexible; Batchelor J.'s principles followed: amend unless irremediable injustice."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order XXI Rule 97",
        "Order XXI Rule 99",
        "Order XXI Rule 103"
      ],
      "relevance": "Basis for execution resistance application, dismissal, and suit for declaration of possession right; limitation one year from r.99 order."
    },
    {
      "name": "Specific Relief Act, 1877",
      "sections": [
        "Section 42 (proviso)"
      ],
      "relevance": "Cited in analogous Privy Council case for suit form defect."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding Bombay High Court's order allowing amendment of the plaint at appellate stage subject to costs, finding no error in discretion exercised for substantial justice without injustice to appellant.",
    "relief_granted": "None to appellant; amendment allowed to respondents.",
    "costs": "High Court imposed costs on plaintiff in favor of first defendant."
  },
  "key_quotes": [
    {
      "text": "\"We realise that by doing what we propose to do we may deprive the first defendant of a very valuable right which he claims he has acquired, namely, that of pleading a bar of limitation against the amended plaint, but we are guided more in this matter by regard to the principles of substantial justice\"",
      "speaker": "court",
      "significance": "Bombay HC rationale for allowing amendment despite limitation."
    },
    {
      "text": "\"It is not doubt true that courts would, as a rule, decline to allow amendments, if a fresh suit on the amended claim would be barred by limitation on the date of the application. But that is a factor to be taken into account in exercise of the discretion\"",
      "speaker": "court",
      "significance": "SC on amendment power vs. limitation discretion from Leach case."
    },
    {
      "text": "\"All amendments ought to be allowed which satisfy the two conditions (a) of not working injustice to the other side, and (b) of being necessary for the purpose of determining the real questions in controversy\"",
      "speaker": "court",
      "significance": "Batchelor J.'s test adopted by SC for amendments."
    }
  ],
  "_case_id": "1957_39",
  "_label": 0,
  "_text_length": 18344,
  "_extracted_at": "2026-02-08T22:35:55.012916"
}