{
  "metadata": {
    "case_name": "Management of Sree Meenakshi Mills Ltd. & Anr. v. Their Workmen",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal Nos. 217, 218 and 219 of 1956",
    "date_of_judgment": "1957-11-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dispute No. 24 of 1951 arisen between management and workers of Sree Meenakshi Mills Ltd., Madurai, and Dispute No. 26 of 1951 between management and workers of Thiakesar Alai Manapparai, both in respect of bonus claimed by workmen for the year 1950-51.",
      "type": "background",
      "date": "1951",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Workmen claimed bonus on allegation that two mills constituted one unit and had made profits during relevant year.",
      "type": "disputed",
      "date": "1950-51",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Appellants contended two mills were two different units and claims for bonus should not be considered together; during relevant year there was trading loss and no bonus payable.",
      "type": "disputed",
      "date": "1950-51",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Industrial Tribunal rejected appellants' pleas, held two mills formed part of same unit, surplus of Rs. 2,87,676, awarded three months bonus to workmen.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Appellants preferred appeals Nos. 133 and 134 of 1952 to Labour Appellate Tribunal, Madras; workmen preferred appeal No. 168 of 1952 claiming larger bonus.",
      "type": "procedural",
      "date": "1952",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Labour Appellate Tribunal confirmed finding that two mills one unit, net surplus Rs. 2,57,496; disallowed deductions including Rs. 4,43,927 out of Rs. 8,43,927 depreciation claim; agreed provision for taxation Rs. 1,75,000 adequate; dismissed all appeals.",
      "type": "procedural",
      "date": "1953-12-07",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellants filed review application Misc. Case No. 111-C-387 of 1953 before Labour Appellate Tribunal alleging mistake apparent on record; tribunal held no power of review and no case made out; decision dated December 7, 1953.",
      "type": "procedural",
      "date": "1953-12-07",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Gross total profit Rs. 16,44,838 after additions including depreciation Rs. 8,43,927 and taxation provision Rs. 1,75,000; deductions including allowed depreciation Rs. 4,00,000 led to net surplus Rs. 2,57,496.",
      "type": "material",
      "date": "1950-51",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Depreciation analysis: Madurai (245 days) Normal Rs. 3,17,331, Extra Rs. 38,465, Initial Rs. 2,87,250; Usilampatti (250 days) Rs. 2,23,206 including extra Rs. 16,077; total Rs. 8,82,329 but claimed Rs. 8,43,927.",
      "type": "material",
      "date": "1950-51",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Workmen applied for inspection of accounts, allowed; then sought particulars on Rs. 8,44,000 depreciation; appellants promised but stated unable to give details.",
      "type": "procedural",
      "date": "1952-02-28",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "In statement before appellate tribunal, appellants claimed revised taxation provision Rs. 4,75,582 if depreciation Rs. 4,43,927 disallowed, as it adds to gross profits.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether appellate tribunal erred in disallowing appellants' claim for depreciation to extent of Rs. 4,43,927 (initial and additional depreciation) in determining net surplus for bonus.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether Labour Appellate Tribunal has jurisdiction to review its orders under O.47 CPC.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether there was mistake apparent on record in not increasing provision for taxation if depreciation disallowed, requiring review.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Two mills separate units with trading loss, no bonus payable.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "In determining net surplus, full depreciation under Income-tax Act including initial and additional must be allowed as prior charge.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Income-tax Act, Section 10(vi), (vi-a), (vi-b)"
    },
    {
      "id": "pa3",
      "text": "Labour Appellate Tribunal has power of review under O.47 CPC; mistake apparent as disallowing depreciation increases gross profits, requiring higher taxation provision from Rs.1,75,000 to Rs.4,75,582.",
      "supporting_facts": [
        "f6",
        "f11"
      ],
      "legal_basis": "CPC O.47; cited B.E.S.T. Workers Union, Greaves Cotton"
    },
    {
      "id": "pa4",
      "text": "Balance-sheet audited, no justification for drastic reduction despite failure to supply details.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Two mills one unit with surplus justifying bonus; claimed larger bonus than awarded.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Bonus not bounty or deferred wages but share in surplus after prior charges per Full Bench formula; only normal depreciation (not initial/additional) as prior charge, following U.P. Electric Supply Full Bench; no obligation to follow Income-tax Act fully for depreciation.",
      "addresses_issue": "i1",
      "key_observation": "Initial and additional depreciations abnormal, for limited contingencies; social justice differs from Income-tax considerations."
    },
    {
      "id": "cr2",
      "text": "Labour Appellate Tribunal erred holding no review power under O.47 CPC, as CPC applies per Martin Burn Ltd.",
      "addresses_issue": "i2",
      "key_observation": "CPC provisions including O.47 apply to LAT proceedings."
    },
    {
      "id": "cr3",
      "text": "No mistake apparent for review: gross profits by tribunal not taxable profits; taxation provision Rs.1,75,000 adequate as appellants get IT exemptions on disallowed depreciations; increasing tax provision would defeat disallowing depreciation.",
      "addresses_issue": "i3",
      "key_observation": "Adequacy of tax provision judged by Income-tax Act; tribunal profits not same as IT profits."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Only normal depreciation ranks as prior charge under Full Bench formula; initial and additional not allowable.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Labour Appellate Tribunal has jurisdiction to review under O.47 CPC.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "No case for review as no mistake apparent on record regarding taxation provision.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Muir Mills Co. Ltd. v. Suti Mills Mazdoor Union, Kanpur",
      "citation": "1955 1 S.C.R. 991",
      "treatment": "followed",
      "relevance": "Nature of bonus as cash incentive representing share in surplus."
    },
    {
      "case_name": "Mill Owners Association, Bombay v. Rashtriya Mill Mazdoor Sangh, Bombay",
      "citation": "1950 2 L.L.J. 1247",
      "treatment": "followed",
      "relevance": "Full Bench formula for prior charges including depreciation, return on capital, tax."
    },
    {
      "case_name": "U.P. Electric Supply Co. Ltd. v. Their Workmen",
      "citation": "1955 L.A.C. 659",
      "treatment": "followed",
      "relevance": "Only normal depreciation as prior charge, not initial or additional."
    },
    {
      "case_name": "Mills, Martin Burn Ltd. v. R. A. Banerjee",
      "citation": "Civil Appeal No. 92 of 1957",
      "treatment": "followed",
      "relevance": "CPC applies to Labour Appellate Tribunal proceedings."
    },
    {
      "case_name": "Model Mills, etc. Textile Mills Nagpur v. Rashtriya Mill Mazdoor Sangh",
      "citation": "1955 I L.L.J. 534",
      "treatment": "referred",
      "relevance": "Full Bench formula equates capital and labour rights."
    },
    {
      "case_name": "Mahalaxmi Wollen Mills Ltd. v. Their Workmen",
      "citation": "1956 I L.L.J. 305",
      "treatment": "referred",
      "relevance": "Deduct income-tax on trading profits despite exemptions."
    },
    {
      "case_name": "Bennett Coleman and Company, Ltd. v. Their Workmen",
      "citation": "1955 II L.L.J. 60",
      "treatment": "referred",
      "relevance": "Adjust unabsorbed depreciation/losses consistently."
    },
    {
      "case_name": "B.E.S.T. Workers Union v. Bombay Suburban Electric Supply Ltd.",
      "citation": "1957 2 L.L.J. 112",
      "treatment": "doubted",
      "relevance": "Supported appellants but held not sound."
    },
    {
      "case_name": "Greaves Cotton and Crompton Parkinson, Ltd. v. Its Workmen",
      "citation": "1956 1 L.L.J. 486",
      "treatment": "doubted",
      "relevance": "Supported appellants but held not correct."
    },
    {
      "case_name": "Bengal Chemical Pharmaceutical Works, Ltd. v. Their Workmen",
      "citation": "1954-55 6 F.J.R. 590",
      "treatment": "distinguished",
      "relevance": "Tax on income of claim year, not prior year."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "Section 10(vi)",
        "Section 10(vi-a)",
        "Section 10(vi-b)"
      ],
      "relevance": "Provisions for normal, initial, additional depreciation; no obligation to allow full in bonus computation."
    },
    {
      "name": "Industrial Disputes Appellate Tribunal Act, 1950",
      "sections": [
        "Section 9(1)",
        "Section 10"
      ],
      "relevance": "CPC applies to proceedings."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order 47"
      ],
      "relevance": "Labour Appellate Tribunal has review power."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "All three appeals dismissed; upheld tribunals' disallowance of initial and additional depreciation; confirmed no review warranted despite tribunal's power; bonus award stands.",
    "relief_granted": "None to appellants",
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "Bonus is not, as its etymological meaning would suggest, a mere matter of bounty gratuitously made by the employer to his employees nor is it a matter of deferred wages.",
      "speaker": "court",
      "significance": "Defines nature of bonus claim."
    },
    {
      "text": "Only normal depreciation including multiple shift depreciation, but not initial or additional depreciation, should rank as prior charge in applying the Full Bench formula.",
      "speaker": "court",
      "significance": "Core holding on depreciation in bonus computation."
    },
    {
      "text": "If the Code of Civil Procedure applies to the proceedings before the Labour Appellate Tribunal, it is clear that the provisions of O.47 would apply.",
      "speaker": "court",
      "significance": "Confirms review jurisdiction."
    }
  ],
  "_case_id": "1957_63",
  "_label": 0,
  "_text_length": 29999,
  "_extracted_at": "2026-02-08T22:36:45.703329"
}