{
  "metadata": {
    "case_name": "Appellants v. State",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha J."
    ],
    "case_number": "Criminal Appeal No. 165 of 1957",
    "date_of_judgment": "1957-10-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The occurrence of dacoity took place on the night between July 1 and 2, 1952, in the house of Ranjit Bahadur, a minor.",
      "type": "material",
      "date": "1952-07-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "After midnight, 16 or 17 dacoits, fully armed with various deadly weapons, broke open the main entrance door of the house with an axe.",
      "type": "material",
      "date": "1952-07-02",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Dacoits broke open boxes and tampered with the iron safe, and removed articles worth twenty thousand rupees.",
      "type": "material",
      "date": "1952-07-02",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Inmates of the house were over-powered. Some slipped out and raised a big fire as customary alarm.",
      "type": "material",
      "date": "1952-07-02",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Villagers turned up on alarm but lacked courage to face dacoits for fear of being shot, contented with using brickbats; dacoits escaped with booty.",
      "type": "material",
      "date": "1952-07-02",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellants along with others tried before Assistant Sessions Judge, Second Court Chapra, Trial No. 70 of 1953, for offence of dacoity under s. 395 IPC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Assistant Sessions Judge by judgment dated December 12, 1953, convicted appellants and two others under s. 395 IPC, sentenced to 5 years rigorous imprisonment; others acquitted.",
      "type": "procedural",
      "date": "1953-12-12",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Convicted persons appealed to Patna High Court: Criminal Appeal No. 699 of 1953 with Criminal Revision No. 205 of 1954.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "High Court while admitting appeal, called upon appellants to show cause why sentence should not be enhanced if convictions maintained.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Patna High Court by judgment dated August 4, 1955, allowed appeal of two appellants and acquitted them, maintained conviction of remaining six, enhanced sentence to 10 years rigorous imprisonment.",
      "type": "procedural",
      "date": "1955-08-04",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "High Court observed offence of dacoity has increased tremendously, very heinous as innocent persons attacked while sleeping, belongings taken by force; 5 years sentence inadequate.",
      "type": "background",
      "date": "1955-08-04",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Supreme Court granted special leave to appeal limited to question of sentence.",
      "type": "procedural",
      "date": "1957-10-28",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court in its revisional jurisdiction has the power to enhance the sentence beyond the limit of the maximum sentence that could have been imposed by the trial court on the accused persons.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court exceeded its powers in enhancing sentence from 5 to 10 years as trial court itself could not have inflicted more than 7 years.",
      "supporting_facts": [
        "f7",
        "f10"
      ],
      "legal_basis": "s. 31(3) Code of Criminal Procedure"
    },
    {
      "id": "pa2",
      "text": "High Court did not keep in view the dictum of this Court in Bed Raj v. State of Uttar Pradesh while enhancing sentence.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Bed Raj v. State of Uttar Pradesh (1955) 2 SCR 583"
    },
    {
      "id": "pa3",
      "text": "Sentence of 10 years rigorous imprisonment too severe in circumstances of case.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4",
        "f5",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Power of High Court to enhance sentence contained in sub-s. (1) of s. 439 CrPC, which clothes HC with powers of Court of Appeal including power to enhance; no words of limitation in sub-s. (1); HC can impose up to maximum under IPC.",
      "addresses_issue": "i1",
      "key_observation": "Fact that trial entrusted to court with limited sentencing jurisdiction does not limit HC power."
    },
    {
      "id": "cr2",
      "text": "Sub-s. (3) of s. 439 CrPC limits HC only in cases by Magistrates acting otherwise than under s. 34; no limit for Sessions Courts or Magistrates under s. 30/34; powers of Assistant Sessions Judge under s. 31(3) analogous to such Magistrates.",
      "addresses_issue": "i1",
      "key_observation": "No provision limits HC to enhance beyond trial court's maximum in Sessions trials."
    },
    {
      "id": "cr3",
      "text": "Enhancement is judicial act per Bed Raj; sentence not lightly interfered unless inadequate on entire circumstances.",
      "addresses_issue": "i1",
      "key_observation": "HC justified in enhancing due to rising dacoity, serious nature; 10 years not excessive."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court in revisional jurisdiction under s. 439 CrPC has power to enhance sentence to maximum prescribed by IPC, not limited by trial court's sentencing power.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Sentence enhancement must be judicial discretion, not lightly done unless inadequate.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bed Raj v. State of Uttar Pradesh",
      "citation": "1955 2 S.C.R. 583",
      "treatment": "followed",
      "relevance": "Enhancement of sentence is judicial act to be exercised along judicial lines; not lightly interfered unless inadequate."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 395"
      ],
      "relevance": "Offence of dacoity punishable up to life imprisonment; HC can impose maximum."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 439",
        "s. 31(3)",
        "s. 30",
        "s. 34",
        "s. 32"
      ],
      "relevance": "HC powers in revision to enhance sentence under s.439(1); limits only for certain Magistrates under s.439(3); trial court limits under s.31(3)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, holding no substance in contentions; upheld High Court's enhancement of sentence to 10 years RI as within jurisdiction and justified by circumstances.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The only question for determination in this appeal is whether the High Court in its revisional jurisdiction, has the power to enhance the sentence, as it has done in the instant case, beyond the limit of the maximum sentence that could have been imposed by the trial court.",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "Sub-s. (1) itself, does not contain any words of limitation on the power to enhance the sentence. Hence, the High Court could impose any sentence up to the maximum limit prescribed by the Indian Penal Code.",
      "speaker": "court",
      "significance": "Key holding on HC's unlimited enhancement power under s.439(1) CrPC."
    },
    {
      "text": "In our opinion, there is no substance in any one of these contentions.",
      "speaker": "court",
      "significance": "Dismisses all appellant arguments."
    }
  ],
  "_case_id": "1957_61",
  "_label": 0,
  "_text_length": 11450,
  "_extracted_at": "2026-02-08T22:36:34.545613"
}