{
  "metadata": {
    "case_name": "Defendants 47 and 48 v. Respondent No. 4",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 185 of 1952",
    "date_of_judgment": "1957-05-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Purushottam had been earning and purchasing large properties and endowing and dedicating them for public charitable purpose since 1896.",
      "type": "background",
      "date": null,
      "source": "plaintiffs"
    },
    {
      "id": "f2",
      "text": "In about 1919, Purushottam executed and registered a deed of trust on March 17, 1919, creating a trust in respect of his properties and appointing three trustees: himself, Mr. Reballa Subbarayudu, and Mr. Viswanadha Rao.",
      "type": "material",
      "date": "1919-03-17",
      "source": "plaintiffs"
    },
    {
      "id": "f3",
      "text": "Purushottam's son Ramakrishnayya disapproved of the trust arrangement and obstructed its administration.",
      "type": "material",
      "date": null,
      "source": "plaintiffs"
    },
    {
      "id": "f4",
      "text": "Two suits filed by trustees against Ramakrishnayya: O.S. No. 599 of 1919 and O.S. No. 68 of 1920, transferred to Sub-Court, Nellore as O.S. No. 39 of 1921 and O.S. No. 67 of 1921.",
      "type": "procedural",
      "date": null,
      "source": "plaintiffs"
    },
    {
      "id": "f5",
      "text": "The two suits ended in a compromise decree.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Compromise decree divided properties; properties in Schedule 1 allotted to Purushottam as sole trustee till his lifetime, to utilize income for charities per 1919 deed 'according to necessity', enjoy without gift/sale; after death to grandson Ramalingeswara Rao subject to performance of charities; guardian if minor.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Plaintiffs filed suit O.S. No. 132 of 1944 with sanction of Collector under s.92 CPC, alleging properties in Sch. A (covered by 1919 trust) are trust properties, compromise decree fraudulent and collusive, seek scheme for administration.",
      "type": "procedural",
      "date": null,
      "source": "plaintiffs"
    },
    {
      "id": "f8",
      "text": "At suit date, Purushottam and Ramakrishnayya dead; Ramalingeswara Rao impleaded as defendant No.1; numerous alienees including defendants 47 and 48.",
      "type": "background",
      "date": null,
      "source": "plaintiffs"
    },
    {
      "id": "f9",
      "text": "Agreement of sale by defendant No.1 to defendants 47 and 48 on June 7, 1942; decree for specific performance; impleaded January 3, 1944.",
      "type": "procedural",
      "date": "1942-06-07",
      "source": "appellants"
    },
    {
      "id": "f10",
      "text": "Trial judge (Oct 27, 1945): suit competent; compromise not collusive/fraudulent, binding on trust; but compromise created trust re Purushottam's share; decree for scheme.",
      "type": "procedural",
      "date": "1945-10-27",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Madras High Court (Dec 15, 1948): dismissed appeal by defendants 47 and 48, confirmed decree, held compromise created public charitable trust re Purushottam's properties.",
      "type": "procedural",
      "date": "1948-12-15",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Supreme Court interlocutory judgment March 30, 1955: remanded to High Court of Andhra for findings on whether obligation annexed to property and whether compromise collusive.",
      "type": "procedural",
      "date": "1955-03-30",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "High Court of Andhra: obligation annexed to Purushottam's share; compromise not collusive, binding on trust.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Charities specified in 1919 deed: nine charities including choultry drinks/food, offerings to temples, school fees to poor Brahmin boys, etc.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the properties in suit are the subject matter of public charitable trust or are merely burdened or charged with the obligation in favour of the specified charities.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the obligation arising out of the trust is annexed to the property that fell to the share of Purushottam under the compromise decree.",
      "framed_by": "high_court"
    },
    {
      "id": "i3",
      "text": "Whether the compromise decree was collusive and not binding on the trust.",
      "framed_by": "high_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The properties in their hands were subject to the charge in favour of the charities but denied that the said properties were the subject-matter of a charitable trust; compromise decree not fraudulent or collusive, represented fair family settlement binding on Purushottam and alleged 1919 trust; clause 1 of compromise decree does not create public trust but only burden/charge.",
      "supporting_facts": [
        "f6",
        "f9",
        "f13"
      ],
      "legal_basis": "Principles of Hindu law on complete vs partial dedication"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Properties subject-matter of public charitable trust created by 1919 deed; compromise decree fraudulent, collusive, null/void, cannot affect original trust; alternatively, compromise decree itself created public trust re Purushottam's share.",
      "supporting_facts": [
        "f2",
        "f5",
        "f7",
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Even if compromise decree does not create public trust, original 1919 trust validly created cannot be effaced by compromise; Purushottam guilty of breach of trust.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Principles of Hindu law: dedication complete (trust) or partial (charge); intent from document as whole; use of 'trustee' not decisive; if substantial income for charity vs minor for private, complete; analyzed clause 1 of compromise: Purushottam sole trustee enjoys till death without alienation, then to grandson subject to charities 'according to necessity' - inconsistent with complete dedication as title devolves privately, income only per need not whole.",
      "addresses_issue": "i1",
      "key_observation": "Clause 1 shows private title retained, burdened with charge for charities, not complete dedication to charity."
    },
    {
      "id": "cr2",
      "text": "1919 deed created public trust unequivocally (whole income for charity only, multiple trustees); contrast with compromise clause 1.",
      "addresses_issue": "i1",
      "key_observation": "Compromise substituted properties but only imposed charge."
    },
    {
      "id": "cr3",
      "text": "Too late for respondents to argue original trust survives compromise; plaintiffs acquiesced in findings that compromise binding/not collusive, got decree on substituted trust basis; no cross-appeal.",
      "addresses_issue": "i2",
      "key_observation": "Plaintiffs' conduct admits compromise effaced original trust re properties."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Properties allotted to Purushottam under compromise decree not subject of public charitable trust but continue as his private properties devolving to grandson subject to burden/charge to perform specified charities.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Compromise decree not collusive/fraudulent, binding; obligation annexed to property.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Declare properties in hands of appellants subject to charge in favour of charities mentioned in 1919 deed.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Maharani Hemanta Kumari Debi v. Gauri Shankar Tewari",
      "citation": "1940 L.R. 68 I.A. 53",
      "treatment": "referred",
      "relevance": "Complete dedication vests property in idol; partial dedication retains private character with charge."
    },
    {
      "case_name": "Chairman of the Howrah Municipality v. Khetra Krishna Mitra",
      "citation": "1906 4 Cal. L.J. 343",
      "treatment": "referred",
      "relevance": "Partial dedication: property alienable with charge."
    },
    {
      "case_name": "Jadu Nath Singh v. Thakur Sita Ramji",
      "citation": "1917 L.R. 44 I.A. 187",
      "treatment": "followed",
      "relevance": "Deed showed complete dedication despite minor provision for managers; intent from whole document."
    },
    {
      "case_name": "Pande Har Narayan v. Surja Kunwari",
      "citation": "1921 L.R. I.A. 143",
      "treatment": "followed",
      "relevance": "No fixed rule; construe will as whole; if residue to heirs, only charge not gift to idol."
    },
    {
      "case_name": "Sonatun Bysack v. Sreemutti Juggutsoondree Dossee",
      "citation": "8 Moo. I.A. 66",
      "treatment": "referred",
      "relevance": "Absolute gift not intended if distribution contemplated."
    },
    {
      "case_name": "Gopal Lal Sett v. Purna Chandra Basak",
      "citation": "1921 L.R. 49 I.A. 100",
      "treatment": "referred",
      "relevance": "Will conferred properties on grandson charged with worship, no shebaitship created."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s. 92"
      ],
      "relevance": "Suit filed with Collector's sanction for scheme of administration of public trust."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; decree of courts below declaring properties as trust properties and directing scheme set aside; declared that properties in appellants' hands subject only to charge/obligation for specified charities, not public trust.",
    "relief_granted": "Declaration that properties burdened with charge for charities; no scheme for trust.",
    "costs": "Not specified"
  },
  "key_quotes": [
    {
      "text": "Dedication of a property to religious or charitable purposes may be either complete or partial. If the dedication is complete, a trust in favour of public religious charity is created. If the dedication is partial, a trust in favour of the charity is not created but a charge in favour of the charity is attached to, and follows, the property which retains its original private and secular character.",
      "speaker": "court",
      "significance": "Core legal principle applied to distinguish trust from charge."
    },
    {
      "text": "We are satisfied that the properties continue to be the properties of Purushottam until his death and on his death they devolved upon his grandson Ramalingeswara Rao subject always to the burden of performing the charities mentioned in the earlier deed of trust.",
      "speaker": "court",
      "significance": "Key holding on construction of compromise decree."
    },
    {
      "text": "We accordingly declare that the properties in the hands of the appellants are subject to the charge in favour of the said charities.",
      "speaker": "court",
      "significance": "Final relief granted."
    }
  ],
  "_case_id": "1957_97",
  "_label": 1,
  "_text_length": 36235,
  "_extracted_at": "2026-02-08T22:36:43.446877"
}