{
  "metadata": {
    "case_name": "Appellant v. Respondents",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI J."
    ],
    "case_number": "Civil Appeal No. 142 of 1956",
    "date_of_judgment": "1957-11-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents were in the employ of the appellant and were staying in a two storeyed house in the city of Patna which had been rented by the appellant for housing its workmen.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On November 20, 1952, an occurrence took place in the said house wherein the respondents were involved.",
      "type": "material",
      "date": "1952-11-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Written reports of the said occurrence were sent on November 21, 1952, to the appellants Chief Engineer and the respondents were placed under suspension the same day.",
      "type": "procedural",
      "date": "1952-11-21",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "An industrial dispute was then pending between the parties i.e., the appellant and its workmen before the Industrial Tribunal, Bihar.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant made an application to the Industrial Tribunal, Bihar under s. 33 of the Industrial Disputes Act, 1947 for permission to dismiss the respondents on the ground of misconduct as per cl. 17 b viii of the appellants Standing Orders.",
      "type": "procedural",
      "date": "1952-11-21",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On November 27, 1952, the respondents made an application before the said Tribunal under s. 33A of the Act inter alia on the ground that their suspension by the appellant was a breach of s. 33 of the Act.",
      "type": "procedural",
      "date": "1952-11-27",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On December 6, 1952, the appellant made an application before the said Tribunal stating that on a reconsideration of the facts the original prayer for permission to dismiss the respondents was not being pressed, and for the ends of justice it would be sufficient if the appellant was granted permission to discharge the respondents under cl. 14 a of the Standing Orders instead.",
      "type": "procedural",
      "date": "1952-12-06",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Industrial Tribunal entertained the application dated December 6, 1952 and after hearing the parties made its award on May 14, 1953, dismissing the respondents application under s. 33A and granting the appellant permission to discharge the respondents from its employ with effect from the date of the order on payment to the respondents of one months pay in lieu of notice within 15 days therefrom.",
      "type": "procedural",
      "date": "1953-05-14",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The respondents carried an appeal against the said order of the Industrial Tribunal before the Labour Appellate Tribunal of India, Calcutta.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Labour Appellate Tribunal order dated September 13, 1954: entertained appeal, held appellant could not switch to discharge under cl.14(a), set aside permission to discharge, but no reinstatement as notice already given.",
      "type": "procedural",
      "date": "1954-09-13",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant appeals to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Industrial Tribunal expressly recorded the finding that the application for leave to discharge the respondents was bona fide.",
      "type": "admitted",
      "date": "1953-05-14",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Labour Appellate Tribunal had jurisdiction to entertain the appeal from the order of the Industrial Tribunal under s. 7 of the Industrial Disputes (Appellate Tribunal) Act, 1950, as no substantial question of law was involved.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the appellant could amend its application under s.33 from seeking dismissal under cl.17(b)(viii) to discharge under cl.14(a) of Standing Orders, and whether such discharge was simpliciter or punitive.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the order under s.33 was a 'decision' appealable under s.7, and whether it involved retrenchment under s.2(oo) of the Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No appeal lay to the Labour Appellate Tribunal under s.7 of the Industrial Disputes (Appellate Tribunal) Act, 1950 as the order was not a decision involving substantial question of law or specified matters.",
      "supporting_facts": [
        "f8",
        "f10"
      ],
      "legal_basis": "s.7 Industrial Disputes (Appellate Tribunal) Act, 1950"
    },
    {
      "id": "pa2",
      "text": "The application dated December 6, 1952 was a new application for discharge simpliciter under cl.14(a), bona fide, not punitive.",
      "supporting_facts": [
        "f7",
        "f12"
      ],
      "legal_basis": "cl.14(a) Standing Orders"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Action of appellant punitive in character; discharge sought was punitive due to alleged misconduct under cl.17(b)(viii), not cl.14(a); cannot terminate without charge-sheet and enquiry.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5"
      ],
      "legal_basis": "cl.17(b)(viii), cl.14(a) Standing Orders"
    },
    {
      "id": "ra2",
      "text": "Discharge amounted to retrenchment under s.2(oo), appealable under s.7(1)(b).",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s.2(oo), s.33 Industrial Disputes Act, 1947; s.7 Industrial Disputes (Appellate Tribunal) Act, 1950"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Application of Dec 6, 1952 was in substance a new application substituting discharge under cl.14(a) for dismissal under cl.17(b)(viii), abandoning original prayer; Industrial Tribunal competent to allow as bona fide discharge simpliciter, not punitive; no unfair labour practice or victimization.",
      "addresses_issue": "i2",
      "key_observation": "Industrial Tribunal finding that application bona fide and honest exercise of rights under cl.14(a)."
    },
    {
      "id": "cr2",
      "text": "No substantial question of law arose; hence Labour Appellate Tribunal erred in entertaining appeal.",
      "addresses_issue": "i1",
      "key_observation": "Once Tribunal satisfied no unfair practice, no question of law."
    },
    {
      "id": "cr3",
      "text": "s.2(oo) definition of retrenchment came via Act 43 of 1953 published Dec 23, 1953; not applicable to Tribunal order of May 14, 1953; discharge simpliciter not retrenchment then.",
      "addresses_issue": "i3",
      "key_observation": "Definition not retrospective."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No appeal lay to Labour Appellate Tribunal; it had no jurisdiction to interfere.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Appellant entitled to permission for bona fide discharge simpliciter under cl.14(a).",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Order under s.33 not appealable as not involving retrenchment at relevant time.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 33",
        "s. 33A",
        "s. 2(oo)"
      ],
      "relevance": "Permission for discharge during pendency of dispute; complaint of contravention; definition of retrenchment not applicable."
    },
    {
      "name": "Industrial Disputes (Appellate Tribunal) Act, 1950",
      "sections": [
        "s. 7",
        "s. 7(1)(b)"
      ],
      "relevance": "Appeal lies only on substantial question of law or specified matters like retrenchment."
    },
    {
      "name": "Standing Orders",
      "sections": [
        "cl. 14(a)",
        "cl. 17(b)(viii)"
      ],
      "relevance": "cl.14(a) for discharge simpliciter; cl.17(b)(viii) for dismissal for misconduct."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; decision of Labour Appellate Tribunal set aside; order of Industrial Tribunal dated May 14, 1953 restored, granting permission to discharge respondents on payment of one month's pay in lieu of notice.",
    "relief_granted": "Permission to discharge restored",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The discharge of the respondents was a discharge simpliciter in exercise of the rights of the employer under cl. 14 a of the Standing Orders and was not a punitive discharge under cl. 17 b viii thereof.",
      "speaker": "court",
      "significance": "Core finding distinguishing discharge from punishment."
    },
    {
      "text": "the Labour Appellate Tribunal had no jurisdiction to interfere with the order made by the Industrial Tribunal granting the appellant permission to discharge the respondents under s. 33 of the Act",
      "speaker": "court",
      "significance": "Basis for allowing the appeal."
    }
  ],
  "_case_id": "1957_104",
  "_label": 1,
  "_text_length": 12656,
  "_extracted_at": "2026-02-10T19:23:39.290350"
}