{
  "metadata": {
    "case_name": "Scheduled Bank (Respondent) v. Appellant Company",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, a scheduled bank, sued the appellant in the court of the Civil Judge, Sitapur in Uttar Pradesh, for the recovery of money due under an instrument of mortgage.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant contested the suit on several grounds, one of which was that he was entitled to relief under the Uttar Pradesh Zamindars Debt Reduction Act, U.P. XV of 1953, which reduced the amount recoverable on a debt as defined in it.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Debt is defined in section 2(f) of the Act as 'an advance in cash or in kind and includes any transaction which is in substance a debt but does not include an advance as aforesaid made on or after the first day of July, 1952 or a debt due to the Central Government or Government of any State, a local authority, a scheduled bank, a co-operative society and a waqf, trust or endowment for a charitable or religious purpose only, a person, where the debt was advanced on his behalf by the Court of Wards to a ward.'",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "As the respondent was a scheduled bank, the debt due to it from the appellant was not a debt within this definition and consequently no relief would appear to be available to the appellant under the Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellant contended that the definition insofar as it excluded certain debts offended Article 14 of the Constitution as it made an arbitrary distinction between several classes of creditors and denied the excluded debtors the equal protection of the law, hence that portion should be struck out and the rest left operative.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The appellant made an application to the Civil Judge, Sitapur, under the proviso to section 113 of the Code of Civil Procedure asking him to state a case for the opinion of the High Court at Allahabad on the invalidity of the impugned portion of the definition.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The Civil Judge took the view that the impugned portion infringed Article 14 as it made an arbitrary distinction, but held it was not necessary for disposal as even if invalid, the offending portion was not severable and the entire definition would be excluded, leaving appellant without protection; dismissed the application.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The appellant made an application to the High Court at Allahabad for revision of the Civil Judge's order and another under Article 228 of the Constitution to withdraw the case.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The High Court held there was no dispute on the constitutional principle of equal protection, but the issue of severability was one of construction of the Act, not interpretation of the Constitution, and even if so, not necessary for disposal; dismissed both applications.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the proviso to section 113 CPC and Article 228 Constitution apply to refer/withdraw the case on the question of validity of the exclusionary portion of the definition of 'debt' in UP Zamindars Debt Reduction Act under Article 14.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether it is necessary for disposal of the case to decide the validity of the impugned portion of the definition of debt, or whether severability renders it unnecessary.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the exclusion of debts due to scheduled banks etc. in section 2(f) violates Article 14.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The definition excluding debts to scheduled banks etc. offends Article 14 by making arbitrary distinction between classes of creditors, denying equal protection; portion invalid and severable, so strike it out and apply rest of Act.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5"
      ],
      "legal_basis": "Article 14 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "Civil Judge should have referred under proviso to s.113 CPC; High Court should withdraw under Art.228 as involves substantial question of constitutional interpretation necessary for disposal.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "Proviso to s.113 CPC; Article 228 Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Impugned portion not severable; even if invalid, entire definition falls, no relief to appellant.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "No question of constitutional interpretation; severability is statutory construction, not necessary for disposal.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Question of validity of provision challenged under Constitution is both under proviso s.113 CPC and Art.228 as interpretation of Constitution.",
      "addresses_issue": "i1",
      "key_observation": "Validity challenge on constitutional ground falls within both provisions."
    },
    {
      "id": "cr2",
      "text": "It is necessary to decide validity first; severability arises only after invalidity found; cannot assume non-severability to avoid deciding validity.",
      "addresses_issue": "i2",
      "key_observation": "Question raised and pressed must be decided for disposal; lower courts erred."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Proviso to s.113 CPC and Art.228 apply; necessary to decide validity of impugned part of definition for disposal.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Severability question arises only after holding impugned part invalid.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Uttar Pradesh Zamindars' Debt Reduction Act, 1953",
      "sections": [
        "Section 2(f)"
      ],
      "relevance": "Definition of 'debt' excludes debts to scheduled banks; validity challenged under Art.14"
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Proviso to Section 113"
      ],
      "relevance": "Requires subordinate court to refer constitutional validity question to High Court if necessary for disposal"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14",
        "Article 228"
      ],
      "relevance": "Art.14: equal protection challenged; Art.228: High Court to withdraw cases involving substantial constitutional questions necessary for disposal"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court directed to withdraw the case under Article 228, either dispose itself or determine validity of definition of debt in the Act and return to Civil Judge, Sitapur for disposal accordingly.",
    "relief_granted": "Case to be withdrawn by High Court under Art.228 for decision on constitutional validity",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The question as to the severability of the impugned part of the definition from the rest would arise only after it had been decided that the impugned part was invalid.\"",
      "speaker": "court",
      "significance": "Core reasoning why validity must be decided first"
    },
    {
      "text": "\"Without a decision of that question the case could not be disposed of.\"",
      "speaker": "court",
      "significance": "Holds necessity for Art.228 and s.113 proviso"
    }
  ],
  "_case_id": "1958_41",
  "_label": 1,
  "_text_length": 9013,
  "_extracted_at": "2026-02-08T22:17:03.798834"
}