{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Respondent (Assessee)",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar J."
    ],
    "case_number": "Civil Appeal No. 109 of 1954",
    "date_of_judgment": "1958-10-07"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent is a businessman engaged in multiple activities: railway contractor, runs rice mill and sugar factory, supplier of limestone and dolomite.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent acquired quarry at Paraghat and worked it, selling limestone to Bengal Iron Company Ltd. among others.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Agreement dated January 5, 1935, between Bengal Iron Company Ltd. and respondent for purchase of all requirements of limestone and dolomite at specified rates.",
      "type": "material",
      "date": "1935-01-05",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Rates modified by agreement dated December 21, 1935.",
      "type": "material",
      "date": "1935-12-21",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In 1936, Bengal Iron Company went into liquidation; assets and liabilities taken over by Indian Iron and Steel Company Ltd. under scheme dated September 8, 1936.",
      "type": "material",
      "date": "1936-09-08",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Indian Iron and Steel Company continued purchasing but later terminated due to uneconomic rates, by notice dated May 29, 1939.",
      "type": "material",
      "date": "1939-05-29",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondent filed Suit No. 211 of 1940 in High Court of Calcutta for specific performance of 1935 contracts and injunction; injunction issued on March 13, 1940.",
      "type": "procedural",
      "date": "1940-03-13",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Settlement agreement dated May 9, 1940: respondent to work Company's quarry at Gangapur for 25 years, supply limestone; monthly payment Rs. 4,000 for 18 months, then Rs. 2-9-0 per ton; respondent handles all operations; cl. 6 allows supply of other quantities; cl. 13 restricts other quarry contracts within 20 miles except own quarries.",
      "type": "material",
      "date": "1940-05-09",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Railway authorities did not permit siding at Gangapur, making agreement impossible to perform as contemplated.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "New agreement dated August 2, 1941: termination of May 9, 1940 contract; Company pays Rs. 2,50,000 as solatium plus balance monthly instalments; new 12-year contracts for limestone supply to Kulti furnaces and loading iron ore at Monoharpore.",
      "type": "material",
      "date": "1941-08-02",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Rs. 2,50,000 paid to respondent pursuant to August 2, 1941 agreement; balance monthly payments also paid; new agreements executed.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Income-tax Officer and Appellate Assistant Commissioner held Rs. 2,50,000 as trading receipt liable to tax.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appellate Tribunal affirmed ITO and AAC, held amount is trading receipt and income.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "On respondent's application, Tribunal referred question under s. 66(1) of Indian Income-tax Act 1922: whether Rs. 2,50,000 received as damages/compensation for premature termination of contract of May 9, 1940 is income assessable.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Nagpur High Court (Sen and Deo JJ.) held sum is capital receipt not liable to tax, dated April 21, 1950.",
      "type": "procedural",
      "date": "1950-04-21",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Appellant's application under s. 66A(2) for certificate to appeal to Supreme Court dismissed by High Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Supreme Court granted special leave under Art. 136.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Respondent stated before ITO that amount was consideration for termination of 1935 contract, not substantiated; no evidence of capital expenses over Rs. 4 lakhs for 1935 contract.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sum of Rs. 2,50,000 received by the respondent on August 2, 1941, as solatium for premature termination of the contract dated May 9, 1940, is a revenue receipt liable to income-tax or a capital receipt not liable to tax.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The contract dated May 9, 1940, was entered into in ordinary course of respondent's business of supplying limestone; Rs. 2,50,000 is solatium for cancellation, representing profits that would have been made, hence trading/revenue receipt.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f8",
        "f10"
      ],
      "legal_basis": "Short Bros. Ltd. v. Commissioners of Inland Revenue; Commissioners of Inland Revenue v. Northfleet Coal and Ballast Co. Ltd.; Jessee Robinson Sons v. Commissioners of Inland Revenue"
    },
    {
      "id": "pa2",
      "text": "Agreements of 1935, 1940, and 1941 are adjustments in ordinary course of business.",
      "supporting_facts": [
        "f3",
        "f4",
        "f8",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Rs. 2,50,000 reimburses capital expenses exceeding Rs. 4 lakhs incurred for 1935 contract (quarters, etc.) thrown away upon abandonment of Paraghat quarry.",
      "supporting_facts": [
        "f2",
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Contract of May 9, 1940 for 25 years (23 years unexpired) is enduring capital asset; compensation for termination is capital receipt.",
      "supporting_facts": [
        "f8",
        "f10"
      ],
      "legal_basis": "Commissioner of Income-tax v. Shaw Wallace Co.; Barr, Crombie Co. Ltd. v. Commissioners of Inland Revenue; Kelsall Parsons Co. v. Commissioners of Inland Revenue"
    },
    {
      "id": "ra3",
      "text": "Contract created framework to carry on business, not the business itself; payment for termination is capital.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Van Den Berghs Ltd. v. Clark"
    },
    {
      "id": "ra4",
      "text": "Contract formed practically entire business of respondent; specialized, no general market; termination sterilizes capital asset.",
      "supporting_facts": [
        "f1",
        "f8"
      ],
      "legal_basis": "Glenboig Union Fireclay Co. Ltd. v. Commissioners of Inland Revenue"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No evidence that Rs. 2,50,000 reimburses capital expenses for 1935 contract; Paraghat quarry abandoned before 1940 contract; respondent's statement unsubstantiated.",
      "addresses_issue": "i1",
      "key_observation": "Amount not compensation for thrown-away capital expenses."
    },
    {
      "id": "cr2",
      "text": "Respondent carried on limestone supply business since 1920; 1935, 1940 contracts part of that business; 1940 contract in settlement of prior rights; secured new 12-year supply contract in 1941.",
      "addresses_issue": "i1",
      "key_observation": "Contract entered in ordinary course of business; supplier/dealer distinction immaterial."
    },
    {
      "id": "cr3",
      "text": "Compensation for termination of trading contract in ordinary course is revenue receipt, even for long-term (distinguishing agency cases like Shaw Wallace, Barr Crombie where agency is capital apparatus).",
      "addresses_issue": "i1",
      "key_observation": "Trading contracts part of business itself, not capital asset like agency; length immaterial (Northfleet 10 years)."
    },
    {
      "id": "cr4",
      "text": "1940 contract not mere framework but the business (quarrying/supply); differs from Van Den Berghs (collateral profit-sharing).",
      "addresses_issue": "i1",
      "key_observation": "No separate profit-making apparatus."
    },
    {
      "id": "cr5",
      "text": "Not sterilization by external authority (Glenboig); settlement of trading contract rights; no bar to other business (cl.6, new contracts).",
      "addresses_issue": "i1",
      "key_observation": "Payment adjustment of trading profits, not injury to capital asset."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sum of Rs. 2,50,000 is revenue receipt, chargeable to income-tax as trading receipt for termination of contract in ordinary course of business.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Van Den Berghs Ltd. v. Clark",
      "citation": "1935 A.C. 431",
      "treatment": "followed",
      "relevance": "Questions of capital vs income depend on facts; no single infallible test."
    },
    {
      "case_name": "Davies v. H. M. Inspector of Taxes The Shell Company of China Ltd.",
      "citation": "1951 32 Tax Cas. 133",
      "treatment": "referred",
      "relevance": "Distinction capital/income involves conclusion of law."
    },
    {
      "case_name": "Rustproof Metal Window Co., Ltd. v. Commissioners of Inland Revenue",
      "citation": "1947 29 Tax Cas. 243",
      "treatment": "referred",
      "relevance": "Questions of capital vs income involve conclusion of law."
    },
    {
      "case_name": "Short Bros. Ltd. v. Commissioners of Inland Revenue",
      "citation": "1927 12 Tax Cas. 955",
      "treatment": "followed",
      "relevance": "Cancellation payment for shipbuilding contract in ordinary business is revenue."
    },
    {
      "case_name": "Commissioners of Inland Revenue v. Northfleet Coal and Ballast Co., Ltd.",
      "citation": "1927 12 Tax Cas. 1102",
      "treatment": "followed",
      "relevance": "Compensation for terminating 10-year supply contract is revenue, representing commuted profits."
    },
    {
      "case_name": "John Smith Son v. Moore",
      "citation": "1921 12 Tax Cas. 266",
      "treatment": "distinguished",
      "relevance": "Sale/assignment of contracts by stranger is capital; not applicable to cancellation between parties."
    },
    {
      "case_name": "Jessee Robinson Sons v. Commissioners of Inland Revenue",
      "citation": "1929 12 Tax Cas. 1241",
      "treatment": "followed",
      "relevance": "Damages for buyer breach on yarn sale contracts is trading receipt."
    },
    {
      "case_name": "Commissioner of Income-tax v. Shaw Wallace Co.",
      "citation": "1932 L.R. 59 I.A. 206",
      "treatment": "distinguished",
      "relevance": "Agency termination compensation is capital (cessation of business)."
    },
    {
      "case_name": "Barr, Crombie Co. Ltd. v. Commissioners of Inland Revenue",
      "citation": "1945 26 Tax Cas. 406",
      "treatment": "distinguished",
      "relevance": "Managing agency sole asset; termination payment capital."
    },
    {
      "case_name": "Kelsall Parsons Co. v. Commissioners of Inland Revenue",
      "citation": "1938 21 Tax Cas. 608",
      "treatment": "followed",
      "relevance": "Agency termination (one year left, one of many) is revenue."
    },
    {
      "case_name": "Commissioner of Income-tax and Excess Profits Tax, Madras v. South India Pictures Ltd., Karaikudi",
      "citation": "1956 S.C.R. 223",
      "treatment": "followed",
      "relevance": "Film distribution contracts termination compensation revenue (not sole asset)."
    },
    {
      "case_name": "Shove v. Dura Manufacturing Co. Ltd.",
      "citation": "1941 23 Tax Cas. 779",
      "treatment": "followed",
      "relevance": "Commission agreement termination payment revenue."
    },
    {
      "case_name": "Golden Horse Shoe New Ltd. v. Thurgood",
      "citation": "1933 18 Tax Cas. 280",
      "treatment": "referred",
      "relevance": "Nature depends on trade: fixed vs circulating capital."
    },
    {
      "case_name": "Glenboig Union Fireclay Co. Ltd. v. Commissioners of Inland Revenue",
      "citation": "1922 12 Tax Cas. 427",
      "treatment": "distinguished",
      "relevance": "Statutory sterilization of capital asset (lease) is capital; not trading contract settlement."
    },
    {
      "case_name": "Beak v. Robson",
      "citation": "1942 25 Tax Cas. 33",
      "treatment": "referred",
      "relevance": "Post-contract non-compete payment capital."
    },
    {
      "case_name": "Thompson v. Magnesium Elektron, Ltd.",
      "citation": "1943 26 Tax Cas. 1",
      "treatment": "referred",
      "relevance": "Intra-contract non-compete revenue."
    },
    {
      "case_name": "Commissioners of Inland Revenue v. Newcastle Breweries Ltd.",
      "citation": "1927 12 Tax Cas. 927",
      "treatment": "referred",
      "relevance": "Compensation for stock-in-trade injury revenue."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 66(1)",
        "s. 66A(2)"
      ],
      "relevance": "Reference to High Court; certificate for appeal."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment of Nagpur High Court dated April 21, 1950 set aside; order of Appellate Tribunal restored holding Rs. 2,50,000 as revenue receipt chargeable to tax.",
    "relief_granted": "Tax department's position upheld; amount taxable.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the question whether a receipt is capital or income has frequently come up for determination before the courts... it is not possible to lay down any single test as infallible\".",
      "speaker": "court",
      "significance": "Establishes fact-specific nature of capital vs revenue distinction."
    },
    {
      "text": "\"Such a contract as the one before him was liable in the ordinary course of business to be altered or terminated on terms and the payment... was an adjustment made... in the ordinary course of business.\"",
      "speaker": "court",
      "significance": "From Short Bros.; applies to trading contract cancellations."
    },
    {
      "text": "\"compensation received on account of such a contract must be held to be a revenue receipt.\"",
      "speaker": "court",
      "significance": "Core holding on trading contracts vs agency."
    }
  ],
  "_case_id": "1958_88",
  "_label": 1,
  "_text_length": 46512,
  "_extracted_at": "2026-02-08T22:33:25.123980"
}