{
  "metadata": {
    "case_name": "Complainant (Appellant) v. Respondents (Accused)",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha J."
    ],
    "case_number": "Criminal Appeal No. 49 of 1956",
    "date_of_judgment": "1958-08-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant, a Saivite, filed petition of complaint dated June 5, 1953, in Court of Additional First-Class Magistrate, Tiruchirappalli, against three respondents.",
      "type": "procedural",
      "date": "1953-06-05",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "First accused is leader of Dravida Kazakam, a community professing to be religious reformers carrying on propaganda against idol worship, vilifying Hindu community through meetings and articles.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "First accused announced intention on May 27, 1953, in public meeting at Town Hall, to break image of God Ganesa, sacred to Saiva Section of Hindu Community, causing terror and commotion among Saivites.",
      "type": "material",
      "date": "1953-05-27",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "On May 27, 1953, at about 5:30 p.m., first accused broke mud idol of God Ganesa in public at Town Hall Maidan, after making speech expressly stating intention to insult feelings of Hindu community; act abetted by instigation and aid from other two accused who also made speeches.",
      "type": "material",
      "date": "1953-05-27",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Act done with intention of insulting religious feelings of sections of Hindu community holding God Ganesa in veneration; alleged offences under ss. 295 and 295A IPC.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Magistrate examined complainant on oath on June 5, 1953; statements supported allegations; directed petition sent to Circle Inspector of Police, Trichy, for inquiry and report under s. 202 CrPC.",
      "type": "procedural",
      "date": "1953-06-05",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Police report dated June 26, 1953, confirmed occurrence took place but raised point of law if act amounted to offence.",
      "type": "procedural",
      "date": "1953-06-26",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Magistrate dismissed complaint under s. 203 CrPC: mud figure of Ganesa not an object held sacred; speeches may fall under s. 295A but require government sanction.",
      "type": "procedural",
      "date": "1953-06-26",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Complainant filed revision petition on July 9, 1953, to Sessions Judge, Tiruchirapalli, under ss. 435 and 436 CrPC, confined to offence under s. 295 IPC.",
      "type": "procedural",
      "date": "1953-07-09",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Sessions Judge dismissed revision on January 12, 1954: image was private property of accused, not held sacred; idol breaking by non-believer not insult to religion.",
      "type": "procedural",
      "date": "1954-01-12",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Complainant filed revision to Madras High Court under s. 439 CrPC; single Judge dismissed on October 13, 1954: mud image not 'object held sacred'; only idols in temples or processions qualify.",
      "type": "procedural",
      "date": "1954-10-13",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court refused certificate under Art. 134(1)(c) Constitution; Supreme Court granted special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "No one appeared for respondents in Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the petition of complaint disclosed a prima facie offence under s. 295 IPC, particularly if a mud image of God Ganesa broken in public is 'any object held sacred by any class of persons'.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Courts below unduly restricted meaning of 'any object held sacred by any class of persons' in s. 295 IPC; words used in fullest amplitude to include any consecrated or otherwise sacred object held sacred by any class, not limited to temple idols or processions.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "s. 295 IPC"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Whether object held sacred depends on evidence; image of Ganesa held sacred by classes of Hindus even if not consecrated; courts below erred by restricting to idols in temples or processions; idols illustrative; sacred books like Bible, Koran also covered; any trivial object regarded sacred qualifies; not necessary to have been worshipped.",
      "addresses_issue": "i1",
      "key_observation": "Courts must respect religious susceptibilities; lower courts cynical in brushing aside feelings."
    },
    {
      "id": "cr2",
      "text": "Though disagree with lower courts' interpretation, case stale (5 years); action foolish if true, but no direction for further inquiry.",
      "addresses_issue": "i1",
      "key_observation": "No further inquiry despite error in law."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Lower courts erred in interpreting s. 295 IPC by unduly restricting 'any object held sacred by any class of persons' to only temple idols or those in processions; provision covers any object regarded sacred, even mud images of deities like Ganesa.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Queen Empress v. Imam Ali",
      "citation": "1887 I.L.R. 10 All. 150",
      "treatment": "referred",
      "relevance": "'Object' in s. 295 IPC does not include animate objects; observation that 'object' ejusdem generis with place of worship, e.g., idol, not against complainant."
    },
    {
      "case_name": "Romesh Chunder Sannyal v. Hiru Mondal",
      "citation": "1890 I.L.R. 17 Cal. 852",
      "treatment": "referred",
      "relevance": "Dealt with dedicated bull; not directly in point but lower court inferred narrow scope."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "295",
        "295A"
      ],
      "relevance": "s. 295 punishes destruction etc. of place of worship or object held sacred with intent to insult religion; s. 295A requires sanction for deliberate acts outraging religious feelings via words etc."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "202",
        "203",
        "435",
        "436",
        "439"
      ],
      "relevance": "s. 202: inquiry before issuing process; s. 203: dismissal if no sufficient ground; ss. 435/436/439: revisional jurisdiction."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 134(1)(c)"
      ],
      "relevance": "Certificate for appeal to Supreme Court refused by High Court."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court held lower courts erred in interpreting s. 295 IPC but, considering the case had become stale after about 5 years, did not direct further inquiry into the complaint.",
    "relief_granted": "None; no direction for further inquiry or issuance of process.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The only question for determination in this appeal by special leave, is whether the petition of complaint, disclosed a prima facie offence under s. 295 of the Indian Penal Code.",
      "speaker": "court",
      "significance": "Frames the sole issue."
    },
    {
      "text": "Any object however trivial or destitute of real value in itself, if regarded as sacred by any class of persons would come within the meaning of the penal section.",
      "speaker": "court",
      "significance": "Broad interpretation of 'object held sacred' under s. 295 IPC."
    },
    {
      "text": "Courts have got to be very circumspect in such matters, and to pay due regard to the feelings and religious emotions of different classes of persons with different beliefs.",
      "speaker": "court",
      "significance": "Duty of courts to respect religious susceptibilities."
    }
  ],
  "_case_id": "1958_22",
  "_label": 0,
  "_text_length": 14733,
  "_extracted_at": "2026-02-10T19:19:40.780305"
}