{
  "metadata": {
    "case_name": "Appellant (Returned Candidate) v. Kandaswami",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar J."
    ],
    "case_number": "Civil Appeal No.130 of 1958",
    "date_of_judgment": "1958-05-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In the 1957 general elections, nine persons filed nomination papers for election to the Madras Legislative Assembly from the Sathankulam constituency, all found valid on scrutiny.",
      "type": "background",
      "date": "1957",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Candidates included the appellant (returned candidate), respondent Kandaswami, R. Meganathan, and G. E. Muthu.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Meganathan, Muthu, and three others dropped out of the election before the poll.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Election contested by appellant, Kandaswami, and two other candidates.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant successful at poll, declared elected on March 6, 1957.",
      "type": "material",
      "date": "1957-03-06",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On April 15, 1957, respondent Kandaswami filed election petition under Representation of the People Act, 1951, for declaration that appellant's election void; appellant as first respondent, Meganathan and Muthu not made parties.",
      "type": "procedural",
      "date": "1957-04-15",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Petition referred to Election Tribunal for trial; some other candidates made parties.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant filed I.A. No. 1 of 1957 before Tribunal for dismissal of petition under s.90(3) for non-compliance with s.82, contending allegations of corrupt practice against Meganathan and Muthu requiring them as parties.",
      "type": "procedural",
      "date": "1957",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Tribunal dismissed appellant's application, accepting respondent's contention that no allegations of corrupt practice against Meganathan or Muthu.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant filed applications in Madras High Court for writ of certiorari quashing Tribunal's order and writ of prohibition against proceeding with petition.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Madras High Court dismissed both applications on November 1, 1957, agreeing with Tribunal.",
      "type": "procedural",
      "date": "1957-11-01",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appeal to Supreme Court by certificate granted by Madras High Court in W. Nos. 623 and 624 of 1957.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Election petition para IV-A alleges: returned candidate (appellant) and election agent paid gift of Rs.10,000 to Meganathan to induce withdrawal from Sathankulam, and he withdrew; paid gratification of Rs.5,000 to Muthu to retire from contest, and he retired.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Meganathan and Muthu were candidates as defined in s.79 of Representation of the People Act, 1951, duly nominated.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether allegations in the election petition that Meganathan and Muthu accepted money from appellant to induce them to withdraw candidature constitute allegations of corrupt practice against them, requiring them to be joined as respondents under s.82(b) of the Representation of the People Act, 1951.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Petition liable to dismissal for non-joinder of Muthu and Meganathan, who were candidates; allegation that Meganathan accepted gift of Rs.10,000 and withdrew candidature, Muthu accepted Rs.5,000 gratification and retired, constitutes corrupt practice under s.123(1).",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": "Representation of the People Act, 1951 ss.79(b), 82(b), 98, 99, 123(1); Transfer of Property Act (gift bilateral)"
    },
    {
      "id": "pa2",
      "text": "Words 'by a candidate or his agent or by any other person' in s.123(1) read with 'offer or promise' not 'gift'; gift includes acceptance; s.99 requires finding on corrupt practice with consent of candidate, so acceptance implies consent making them liable to be named.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Representation of the People Act, 1951 s.99; Transfer of Property Act"
    },
    {
      "id": "pa3",
      "text": "Gratification in s.123 wide, includes withdrawal of candidature by candidate to induce another to stand.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Representation of the People Act, 1951 s.123"
    },
    {
      "id": "pa4",
      "text": "S.82(b) contemplates any allegation relating to or concerning a corrupt practice.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Representation of the People Act, 1951 s.82(b)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Candidate accepting gift from returned candidate does not commit corrupt practice under s.123(1); not necessary party under s.82(b); section defines bribery as gift/offer/promise by candidate/agent/other, contemplates making of gift, not acceptance.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Representation of the People Act, 1951 ss.82(b), 123(1), 124(3) (deleted by Act XXVII of 1956)"
    },
    {
      "id": "ra2",
      "text": "S.124(3) previously made receipt of gratification minor corrupt practice, omitted by amendment without change to s.123(1), so acceptance no longer corrupt practice; s.99 does not define corrupt practice.",
      "supporting_facts": [],
      "legal_basis": "Representation of the People Act, 1951 ss.99, 123(1), 124(3)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Allegations against Meganathan and Muthu are that they accepted money to drop out and did so; question is whether this is allegation of corrupt practice against them.",
      "addresses_issue": "i1",
      "key_observation": "Only giving of gift/offer/promise is corrupt practice under s.123(1), not acceptance."
    },
    {
      "id": "cr2",
      "text": "S.123(1) defines bribery as 'gift, offer or promise by a candidate or his agent or by any other person' with object of inducing withdrawal etc.; words contemplate making of gift, not acceptance; object is of giver, not receiver.",
      "addresses_issue": "i1",
      "key_observation": "Acceptance of bribe not corrupt practice within definition."
    },
    {
      "id": "cr3",
      "text": "S.124(3) previously covered receipt/agreement to receive gratification as corrupt practice, deleted by Act XXVII of 1956 without amending s.123(1) to include it; legislature intended exclusion of acceptance as corrupt practice.",
      "addresses_issue": "i1",
      "key_observation": "Omission deliberate; cannot read acceptance into s.123(1)."
    },
    {
      "id": "cr4",
      "text": "Gift under Transfer of Property Act bilateral, but legislature can attach consequences to giving alone, not acceptance.",
      "addresses_issue": "i1",
      "key_observation": "S.123(1) makes only giving corrupt practice."
    },
    {
      "id": "cr5",
      "text": "S.99 requires finding on corrupt practice committed by/with consent of candidate, but consent not itself corrupt practice; definition in s.123; allegation of consent not allegation that candidate committed corrupt practice.",
      "addresses_issue": "i1",
      "key_observation": "S.82(b) requires allegation that candidate committed corrupt practice."
    },
    {
      "id": "cr6",
      "text": "Withdrawal of candidature to induce another not gratification under s.123; no such allegation anyway.",
      "addresses_issue": "i1",
      "key_observation": "No allegation of corrupt practice by them."
    },
    {
      "id": "cr7",
      "text": "S.82(b) means allegations imputing corrupt practice to candidate, i.e., that candidate guilty of it; acceptance does not relate to corrupt practice (which is giving).",
      "addresses_issue": "i1",
      "key_observation": "No need to join Meganathan and Muthu."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Acceptance of a gift/gratification by a candidate to induce withdrawal from contest is not a corrupt practice under s.123(1) of Representation of the People Act, 1951.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Allegations in petition do not constitute allegations of corrupt practice against Meganathan and Muthu; no requirement to join them as parties under s.82(b).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Non-compliance with s.82 not established; election petition not liable to dismissal under s.90(3).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "s.79",
        "s.81",
        "s.82",
        "s.82(b)",
        "s.90(3)",
        "s.98",
        "s.99",
        "s.117",
        "s.123(1)",
        "s.124(3)"
      ],
      "relevance": "Defines corrupt practices (bribery as giving gift etc., not acceptance); parties to petition; dismissal for non-compliance; findings on corrupt practices."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [],
      "relevance": "Gift is bilateral act involving giving and acceptance, but legislature can penalize only giving."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Madras High Court and Election Tribunal orders; held that allegations of acceptance of bribe by Meganathan and Muthu do not amount to allegations of corrupt practice against them under s.82(b); no non-joinder; election petition not to be dismissed under s.90(3); appeal dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Is an acceptance of a bribe... a corrupt practice within this definition? We do not think it is.\"",
      "speaker": "court",
      "significance": "Core holding that acceptance not corrupt practice under s.123(1)."
    },
    {
      "text": "\"The words 'gift, offer or promise by a candidate or his agent or by any other person' clearly show that what is contemplated is the making of a gift.\"",
      "speaker": "court",
      "significance": "Interprets language of s.123(1) to exclude acceptance."
    },
    {
      "text": "\"By omitting s.124(3) from the Act therefore the legislature intended that acceptance of a bribe was no longer to be treated as a corrupt practice.\"",
      "speaker": "court",
      "significance": "Explains legislative intent from amendment."
    },
    {
      "text": "\"Allegations of corrupt practice against a candidate must mean that the candidate was guilty of corrupt practice.\"",
      "speaker": "court",
      "significance": "Defines what triggers s.82(b)."
    }
  ],
  "_case_id": "1958_132",
  "_label": 0,
  "_text_length": 20556,
  "_extracted_at": "2026-02-10T19:21:57.798452"
}