{
  "metadata": {
    "case_name": "Galfu Sah v. State",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Justice K. Das"
    ],
    "case_number": "Criminal Appeal No. 183 of 1957",
    "date_of_judgment": "1958-05-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On May 16, 1954, in village Dharhara, district Darbhanga, a mob of about 40-50 persons, including 22 accused and appellant Galfu Sah/Gallu Sah, formed an unlawful assembly with common objects to dismantle the hut of Mst. Rasmani, set fire to it, and commit assault if resisted.",
      "type": "material",
      "date": "1954-05-16",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Tetar Mian, chaukidar of village Dharhara, arrived near Mst. Rasmani's hut at about 10 a.m. to ascertain births and deaths, found mob dismantling the hut, protested, and was hit by appellant with a lathi on the left thigh.",
      "type": "material",
      "date": "1954-05-16",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Tetar raised alarm; Ramji, Nebi, and Munga Lal arrived; appellant ordered Budi to set fire to the hut and ordered assault on Ramji and Nebi; Budi set fire to the hut, which was burnt; some members chased and assaulted Ramji and Nebi.",
      "type": "material",
      "date": "1954-05-16",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Sessions Judge (2nd Assistant Sessions Judge, Darbhanga, Sessions Trial No. 52 of 1955) found unlawful assembly armed with weapons, common object to dismantle hut and assault on remonstrance; offences of rioting and hurt committed; arson isolated act, not common object, but appellant abetted Budi who set fire; convicted appellant under s.436 r/w s.109 IPC, Budi under s.436 IPC, and others under ss.147,148,323 etc.",
      "type": "procedural",
      "date": "1956-01-23",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Patna High Court (Criminal Appeal No. 34 of 1956) acquitted Budi under s.436 IPC as evidence not satisfactory; affirmed appellant's conviction under s.436 r/w s.109 IPC as he ordered fire and hut was set on fire by some member; affirmed convictions under ss.147,323; set aside under s.324 r/w s.149; sentence of 4 years RI.",
      "type": "procedural",
      "date": "1957-01-21",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Witnesses Tetar, Ramji, Nebi, Munga Lal: Tetar and Ramji did not mention Budi setting fire in first information; Nebi died before cross-examination; Munga Lal did not tell villagers Budi set fire; but consistent against appellant re order to set fire.",
      "type": "disputed",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant released on bail after serving sentence for ss.147 and 323 IPC.",
      "type": "background",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Correctness of conviction of appellant under s.436 read with s.109 IPC and propriety of sentence.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Evidence same as against Budi who was acquitted by High Court, so should not be believed against appellant.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No evidence that whoever set fire did so in consequence of appellant's order; essential ingredient of abetment under s.109 IPC that act committed in consequence of abetment.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Sections 107, 108, 109 IPC; Raja Khan v. Emperor"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court gave good reasons why evidence against Budi not accepted (infirmities in witnesses' statements re Budi) but consistent and accepted re appellant's order to set fire.",
      "addresses_issue": "i1",
      "key_observation": "No violation of law or prudence in accepting testimony against appellant but rejecting for Budi."
    },
    {
      "id": "cr2",
      "text": "High Court satisfied appellant gave order to set fire and hut was set fire by some member of unlawful assembly; person who set fire must have done so in consequence of appellant's instigation/order; unrealistic to hold otherwise.",
      "addresses_issue": "i1",
      "key_observation": "Act committed in consequence of abetment as per s.109 IPC explanation."
    },
    {
      "id": "cr3",
      "text": "Raja Khan v. Emperor general rule not absolute; exceptions where evidence shows offence committed in consequence of abetment, as in Umadasi Dasi v. Emperor.",
      "addresses_issue": "i1",
      "key_observation": "Conviction for abetment sustainable even if principal acquitted, if abetment proved."
    },
    {
      "id": "cr4",
      "text": "Sentence of 4 years RI does not err on side of severity.",
      "addresses_issue": "i1",
      "key_observation": "Appellant already served sentence for other offences and released on bail."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Conviction under s.436 r/w s.109 IPC correct as abetment by instigation proved and arson committed in consequence thereof, even if principal offender unidentified or acquitted.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Raja Khan v. Emperor",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "General rule that if principal acquitted, no abetment conviction; but not absolute."
    },
    {
      "case_name": "Umadasi Dasi v. Emperor",
      "citation": null,
      "treatment": "followed",
      "relevance": "Exceptions to general rule where evidence establishes offence committed in consequence of abetment."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "436",
        "109",
        "107",
        "108",
        "147",
        "148",
        "323",
        "324",
        "149"
      ],
      "relevance": "Conviction under s.436 r/w s.109 for abetment of arson by instigation; s.107 defines abetment including instigation; s.109 punishes abetment if act committed in consequence."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave against conviction under s.436 r/w s.109 IPC dismissed; conviction and sentence of 4 years RI affirmed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It seems to us, on the findings given in the case, that the person who set fire to the hut of Mst. Rasmani must be one of the persons who were members of the unlawful assembly and he must have done so in consequence of the order of the present appellant.\"",
      "speaker": "court",
      "significance": "Core reasoning upholding abetment despite principal's acquittal."
    },
    {
      "text": "\"We accordingly hold that the conviction of the appellant for the offence under s. 436 read with s. 109, Indian Penal Code, is not bad in law.\"",
      "speaker": "court",
      "significance": "Direct holding on legal validity of conviction."
    }
  ],
  "_case_id": "1958_83",
  "_label": 0,
  "_text_length": 12898,
  "_extracted_at": "2026-02-10T19:21:08.320466"
}