{
  "metadata": {
    "case_name": "Managing Agents of Janardana Mills Ltd. v. Commissioner of Income-tax",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 709 of 1957",
    "date_of_judgment": "1958-11-24"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a firm acting as managing agents of Janardana Mills Ltd., Coimbatore.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant purchased four contiguous plots of land admeasuring 5 acres 26 cents under four sale deeds: October 25, 1941 (Rs. 521 for 28 1/4 cents in name of V.G. Raja, benamidar), November 15, 1941 (Rs. 1,250 for 2 acres 79 1/2 cents), June 29, 1942 (Rs. 1,942 for 28 1/4 cents with a six-room house renting Rs.100 annually, net Rs.80), November 19, 1942 (Rs. 5,000 for 1 acre 90 cents). Total purchase price Rs. 8,712-15-6.",
      "type": "material",
      "date": "1941-10-25",
      "source": "tribunal"
    },
    {
      "id": "f3",
      "text": "Plots are contiguous and adjoin the Janardana Mills.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f4",
      "text": "During possession, appellant made no effort to build structures or cultivate the plots except receiving net rent Rs.80 from one house.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f5",
      "text": "Appellant sold the plots in two lots to Janardana Mills Ltd.: September 1, 1947 (three plots for Rs.49,775), November 10, 1947 (first plot for Rs.2,825). Total sale price Rs.52,600, profit Rs.43,887-0-6.",
      "type": "material",
      "date": "1947-09-01",
      "source": "tribunal"
    },
    {
      "id": "f6",
      "text": "Income-tax Officer assessed Rs.43,887 as business income for assessment year 1948-49, holding it an adventure in the nature of trade due to proximity to mills and intent to sell at profit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellate Assistant Commissioner set aside the assessment, holding it not assessable as profit-making scheme.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Income-tax Appellate Tribunal restored the assessment, holding it a gain from adventure in nature of business, rejecting appellant's explanations of investment or tenements for labourers.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "Tribunal referred question to Madras High Court: whether material for assessing Rs.43,887 as income from adventure in nature of trade.",
      "type": "procedural",
      "date": "1955-04-18",
      "source": "tribunal"
    },
    {
      "id": "f10",
      "text": "Madras High Court (Rajagopalan and Rajagopala Ayyangar JJ.) answered against appellant, upholding tax under business head.",
      "type": "procedural",
      "date": "1955-04-18",
      "source": "high_court"
    },
    {
      "id": "f11",
      "text": "Appellant obtained special leave to appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Industrial tribunal award in June 1947 recommended mills provide tenements for labourers.",
      "type": "disputed",
      "date": "1947-06",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts and circumstances proved, the transaction in question is an adventure in the nature of trade justifying assessment as business income.",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether the question of whether a transaction is an adventure in the nature of trade is a pure question of fact, mixed question of law and fact, or question of law.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Properties purchased as investment.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Purchased plots for building tenements for mill labourers; mills bought due to industrial tribunal award in June 1947 recommending tenements.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Transaction is isolated, not adventure in nature of trade; jurisdiction under s.66(1) allows challenge to tribunal's inference as perverse or based on misapplication of law.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "Income-tax Act s.66(1); precedents like Edwards v. Bairstow"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant purchased plots solely to sell to mills at profit; as managing agent, could influence purchase; no evidence of agricultural use or investment.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Income-tax Act s.2(4), s.10"
    },
    {
      "id": "ra2",
      "text": "Question is mixed law and fact; tribunal applied correct principles.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Precedents like Meenakshi Mills; Edwards v. Bairstow"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Question whether transaction is adventure in nature of trade is mixed question of law and fact, open to challenge under s.66(1) if legal principles misapplied.",
      "addresses_issue": "i2",
      "key_observation": "Final conclusion based on primary facts plus application of legal principles in 'adventure in the nature of trade'."
    },
    {
      "id": "cr2",
      "text": "No single test or formula; consider factors like nature of commodity (land usually investment), purchaser's business, quantity, improvements, incidents of purchase/sale, repetition, pride of possession, initial intention to resell.",
      "addresses_issue": "i1",
      "key_observation": "Initial intention to resell at profit raises strong presumption of adventure in trade, rebuttable by other factors."
    },
    {
      "id": "cr3",
      "text": "Here, appellant not in land business but bought piecemeal contiguous plots adjoining mills it manages, no development/cultivation, sold after consolidating to mills it could influence; sole intention to resell at profit, no rebutting factors.",
      "addresses_issue": "i1",
      "key_observation": "Series of purchases per scheme; presumption not rebutted, corroborated by circumstances."
    },
    {
      "id": "cr4",
      "text": "Reviews numerous precedents distinguishing/affirming adventures in trade vs investments.",
      "addresses_issue": "i1",
      "key_observation": "Facts align with cases like Californian Copper, Rutledge; distinguished Reinhold as borderline not laying general rule."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Transaction is an adventure in the nature of trade; High Court right in upholding assessment as business income.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Character of transaction as adventure in nature of trade is mixed question of law and fact.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Inland Revenue v. Livingston",
      "citation": "1926 11 Tax Cas. 538",
      "treatment": "followed",
      "relevance": "Profit from converting ship to drifter via repairs; operations characteristic of trade."
    },
    {
      "case_name": "Martin v. Lowry",
      "citation": "1926 11 Tax Cas 297",
      "treatment": "followed",
      "relevance": "Merchant buying/selling surplus linen stock with advertising; constituted trade."
    },
    {
      "case_name": "Rutledge v. Commissioners of Inland Revenue",
      "citation": "1929 14 Tax Cas. 490",
      "treatment": "followed",
      "relevance": "Moneylender buying large paper quantity cheaply to resell at profit; intention key."
    },
    {
      "case_name": "Balgownie Land Trust, Ltd. v. Commissioners of Inland Revenue",
      "citation": "1929 14 Tax Cas. 684",
      "treatment": "followed",
      "relevance": "Company formed to deal in property, bought/developed estate; launching into trade."
    },
    {
      "case_name": "F.A. Lindsay, A.E. Woodward and W. Hiscox v. Commissioners of Inland Revenue",
      "citation": "1932 18 Tax Cas. 43",
      "treatment": "followed",
      "relevance": "Joint venture shipping whisky for resale; commercial disposal over time."
    },
    {
      "case_name": "Cayzer, Irvine and Co., Ltd. v. Commissioners of Inland Revenue",
      "citation": "1942 24 Tax Cas. 491",
      "treatment": "followed",
      "relevance": "Land developed (roads/sewers) to make saleable; trading asset not investment."
    },
    {
      "case_name": "Commissioners of Inland Revenue v. Reinhold",
      "citation": "1953 34 Tax Cas. 389",
      "treatment": "distinguished",
      "relevance": "Director buying houses to resell; borderline, onus not discharged; not general proposition."
    },
    {
      "case_name": "Meenakshi Mills, Madurai v. Commissioner of Income-tax, Madras",
      "citation": "1958 S.C.R. 49",
      "treatment": "followed",
      "relevance": "Limits on s.66(1) jurisdiction; benami pure fact."
    },
    {
      "case_name": "Oriental Investment Co. Ltd. v. Commissioner of Income-tax, Bombay",
      "citation": "1956 S.C.R. 691",
      "treatment": "followed",
      "relevance": "Dealing in shares/properties vs investment is mixed law/fact."
    },
    {
      "case_name": "Edwards v. Bairstow",
      "citation": "1956 A.C. 14; 36 Tax Cas. 207",
      "treatment": "referred",
      "relevance": "Transaction character mixed; court examines if perverse or misdirected on law."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "s.2(4)",
        "s.10",
        "s.66(1)"
      ],
      "relevance": "Defines 'business' to include adventure in nature of trade; tax on business profits; High Court reference jurisdiction."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court holds the transaction an adventure in the nature of trade, upholds Madras High Court and Tribunal, assessment of Rs.43,887 as business income justified.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "If the purchase is made solely and exclusively with the intention to resell at a profit and the purchaser has no intention of holding the property for himself or otherwise enjoying or using it. The presence of such an intention is undoubtedly a relevant factor and unless it is offset by the presence of other factors it would raise a strong presumption that the transaction is an adventure in the nature of trade.",
      "speaker": "court",
      "significance": "Core test for intention in isolated transactions."
    },
    {
      "text": "To say that a transaction is or is not an adventure in the nature of trade, is to say that it has or has not the characteristics which distinguish such an adventure but it is a question of law not of fact what are those characteristics.",
      "speaker": "court",
      "significance": "From Edwards; clarifies mixed law/fact nature."
    },
    {
      "text": "The appellant purchased the four plots during two years with the sole intention to sell them to the mills at a profit and this intention raises a strong presumption in favour of the view taken by the tribunal.",
      "speaker": "court",
      "significance": "Application to facts; presumption not rebutted."
    }
  ],
  "_case_id": "1958_65",
  "_label": 0,
  "_text_length": 76962,
  "_extracted_at": "2026-02-08T22:33:23.099092"
}