{
  "metadata": {
    "case_name": "Scheduled Bank (Respondent) v. Appellant Company",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, a scheduled bank, sued the appellant in the court of the Civil Judge, Sitapur in Uttar Pradesh, for the recovery of money due under an instrument of mortgage.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant contested the suit on several grounds one of which was that he was entitled to relief under the Uttar Pradesh Zamindars Debt Reduction Act U.P. XV of 1953 which reduced the amount recoverable on a debt as defined in it.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Debt was defined in the Act in these terms: 'debt means an advance in cash or in kind and includes any transaction which is in substance a debt but does not include an advance as aforesaid made on or after the first day of July, 1952 or a debt due to - the Central Government or Government of any State a local authority a scheduled bank a co-operative society and a waqf, trust or endowment for a charitable or religious purpose only. a person, where the debt was advanced on his behalf by the Court of Wards to a ward.'",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "As the respondent was a scheduled bank the debt due to it from the appellant was not a debt within this definition and consequently, no relief would appear to be available to the appellant under the Act in respect of that debt.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellant contended that the definition in so far as it excluded certain debts offended Art. 14 of the Constitution in as much as it made an arbitrary distinction between several classes of debtors and denied the excluded debtors, the equal protection of the law and that hence that portion of the definition which excluded certain debts was invalid and should be struck out and the rest of the definition should be left as operative.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The appellant made an application to the Civil Judge, Sitapur, under the proviso to s. 113 of the Code of Civil Procedure asking him to state a case for the opinion of the High Court at Allahabad to which he was subordinate as to the invalidity of the impugned portion of the definition.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The learned Civil Judge took the view that the impugned portion of the definition infringed art. 14 of the Constitution as it made an arbitrary distinction between several classes of debtors and was therefore invalid, but he held that it was not necessary for the disposal of the case to decide such question of invalidity because even if it was decided in favour of the appellant, the result would be to exclude the entire definition from the Act as the offending portion was not severable from the rest and the appellant would, therefore, be in any event left without the protection of the Act. In this view of the matter he held that the proviso to s. 113 of the Code did not apply and dismissed the application under it.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The appellant then made an application to the High Court at Allahabad for a revision of the order of the learned Civil Judge. He at the same time made another application to the High Court under Art. 228 of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The High Court disposed of both the applications by one judgment. It held that there was no dispute as to the constitutional principle which was clear, namely, that every citizen was entitled to the equal protection of the laws and that any enactment which infringed that principle, is to that extent void, and that the only dispute was whether the impugned portion of the definition of a debt in the Act was severable from the rest and that was not a question of the interpretation of any provision of the Constitution but one of the construction of the Act itself. The High Court also held that even if any question of the interpretation of the Constitution arose, a determination of that question was not necessary for the disposal of case. In this view of the matter the High Court dismissed the application in revision and also that under Art. 228.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the portion of the definition of 'debt' in the Uttar Pradesh Zamindars Debt Reduction Act, 1953 excluding debts due to scheduled banks etc. is invalid as offending Article 14 of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether it is necessary for the disposal of the case to decide the question of the validity of the impugned portion of the definition of a debt in the Act.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the conditions for reference under proviso to s. 113 CPC and withdrawal under Art. 228 Constitution are satisfied.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The definition in so far as it excluded certain debts offended Art. 14 of the Constitution in as much as it made an arbitrary distinction between several classes of debtors and denied the excluded debtors, the equal protection of the law and that hence that portion of the definition which excluded certain debts was invalid and should be struck out and the rest of the definition should be left as operative.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Article 14 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "The question of validity raised a question as to the validity of a provision in the Act, necessitating reference under proviso to s.113 CPC and withdrawal under Art.228.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "Proviso to s.113 CPC; Article 228 Constitution"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The question raised by the appellant in this case comes within the proviso to s. 113 of the Code as also art. 228 of the Constitution. The question contemplated by the proviso to s. 113 of the Code is as to the validity of an Act or of a provision in it while Art. 228 of the Constitution has in view a question as to the interpretation of the Constitution. Now the question raised in the present case is as to the validity of a provision in the Zamindars Debt Reduction Act. This question is, however also a question as to the interpretation of the Constitution, for the validity of the provision is challenged on the ground that it contravenes an article of the Constitution.",
      "addresses_issue": "i3",
      "key_observation": "Validity challenge under Constitution is also interpretation of Constitution."
    },
    {
      "id": "cr2",
      "text": "The point that really arises in this appeal is whether it is necessary for the disposal of the case to decide the question of the validity of a portion of the definition of a debt in the Act. All other conditions necessary for an order being made under the proviso to s. 113 of the Code or Art. 228 of the Constitution exist.",
      "addresses_issue": "i2",
      "key_observation": "Other conditions satisfied."
    },
    {
      "id": "cr3",
      "text": "The courts below held that in either view of the question of the validity of the impugned portion of the definition of a debt, the appellant would be without the remedy which he sought, because that portion of the definition was not severable from the rest, and therefore it was not necessary to decide that question to dispose of the case. We are unable to agree with this view. The question of the validity of the definition in so far as it excluded certain debts having been raised and pressed by the appellant, it had to be decided by the court. Without a decision of that question the case could not be disposed of. The fact that in the view of the court the impugned part of the definition was not severable from the rest and therefore in any view of the question as to the validity of the impugned part, the appellant would not get any relief, did not alter the position. The question as to the severability of the impugned part of the definition from the rest would arise only after it had been decided that the impugned part was invalid and so to be able to say that the impugned part of the definition was not severable from the rest, it had first to be held that that part was invalid. It could not be said that as the impugned part was not severable from the rest it was not necessary for the disposal of the case to decide the question of the validity of the impugned part.",
      "addresses_issue": "i2",
      "key_observation": "Validity must be decided first; severability only after invalidity found."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "It is necessary to decide the question of the validity of the impugned part of the definition to dispose of the case.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "The question comes within proviso to s.113 CPC and Art.228 Constitution.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Uttar Pradesh Zamindars Debt Reduction Act, 1953 (U.P. XV of 1953)",
      "sections": [
        "Section 2(f)"
      ],
      "relevance": "Definition of 'debt' excludes debts to scheduled banks; challenged as violating Art.14"
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Proviso to s. 113"
      ],
      "relevance": "Requires subordinate court to refer case to High Court if validity question necessary for disposal"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14",
        "Article 228"
      ],
      "relevance": "Art.14: Equal protection challenged; Art.228: High Court to withdraw cases involving substantial constitutional questions necessary for disposal"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed. High Court directed to withdraw the case under Art.228 and either dispose of it itself or determine the question of validity of definition of 'debt' in the Act and return to Civil Judge, Sitapur for disposal accordingly.",
    "relief_granted": "High Court to withdraw case and decide constitutional validity question",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The question of the validity of the definition in so far as it excluded certain debts having been raised and pressed by the appellant, it had to be decided by the court. Without a decision of that question the case could not be disposed of.",
      "speaker": "court",
      "significance": "Core reasoning why validity decision is necessary before severability"
    },
    {
      "text": "The question as to the severability of the impugned part of the definition from the rest would arise only after it had been decided that the impugned part was invalid.",
      "speaker": "court",
      "significance": "Rejects lower courts' assumption of non-severability without prior invalidity finding"
    }
  ],
  "_case_id": "1958_41",
  "_label": 1,
  "_text_length": 9013,
  "_extracted_at": "2026-02-10T19:20:28.760057"
}