{
  "metadata": {
    "case_name": "Narrondass Manordass v. Respondents",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "BHAGWATI J."
    ],
    "case_number": "Civil Appeal No. 398 of 1956",
    "date_of_judgment": "1958-03-31"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Since the year 1932 the first appellant has been a member of the East India Cotton Association Ltd., as the sole proprietor of the firm of Messrs. Narrondass Manordass (member firm).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The first appellant along with other partners carried on business in partnership in Bombay inter alia as Cotton Merchants and Commission Agents in the name and style of Messrs. Narrondass Manordass, the 2nd appellant (partnership firm).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The respondents are a partnership firm and also a member of the Association.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Between September 23, 1947, and December 10, 1947, the member firm sold to the respondents 2,300 bales of Broach Vijay Fine 3/4 Navsari and or Bardoli 7/8 Cotton for March April 1948 Delivery.",
      "type": "material",
      "date": "1947-09-23 to 1947-12-10",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Out of these 2,300 bales, 1,100 bales were disposed of by means of Havalas and in respect of the remaining 1,200 bales, there were cross-contracts.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "When the time for Delivery arrived, sales in respect of 700 bales remained outstanding and the member firm was liable to give delivery of 700 bales to the respondents.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The member firm failed to give delivery of the said 700 bales to the respondents.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Under the relevant by-laws of the Association, the respondents Invoiced Back these 700 bales to the member firm on May 3, 1948.",
      "type": "material",
      "date": "1948-05-03",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "As a result of this Invoicing Back a sum of Rs. 1,07,530-8-0 became due and payable by the member firm to the respondents and with regard to the transactions of all the 2,300 bales taken together an aggregate sum of Rs. 1,79,749-8-0 became due and payable by the member firm to the respondents.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The contract numbers in respect of these transactions had been signed by one Ramanlal Nagindas who had been employed as a salesman in the Ready Cotton Department of the partnership firm.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellants contended that the said Ramanlal Nagindas had no authority to enter into the said transactions or to sign contract numbers in respect thereof on behalf of the appellants and also that the said contracts were not in accordance with the by-laws of the Association and they therefore denied their liability.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "The partnership firm, as the beneficiary under the said contracts decided to pay the amounts claimed by the respondents without prejudice to the rights and contentions of both the parties.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On May 7, 1948, the said sum of Rs. 1,79,748-8-0 was paid by the partnership firm and was received by the respondents in terms of the letter: 'The payment is made by you and accepted by us without prejudice to the rights and contentions of both the parties in respect thereof.'",
      "type": "material",
      "date": "1948-05-07",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "A further sum of Rs. 350 being the amount of penalty for the alleged failure to tender the aforesaid 700 bales, was also paid by the partnership firm to the respondents on June 6, 1948, without prejudice to their aforesaid contentions.",
      "type": "material",
      "date": "1948-06-06",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The said Ramanlal Nagindas had entered into similar transactions with several other merchants and some of them claimed arbitration under by-law 38-A of the Association.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Petitions were filed by the member firm in the High Court at Bombay being Petitions Nos. A/51, A/52, A/55 and A/56 of 1949 under s. 33 of the Indian Arbitration Act inter alia for a declaration that there existed no valid and enforceable arbitration agreement between the parties.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Mr. Justice Shah delivered judgment in the said petitions on August 20, 1950, holding inter alia that the said contracts were void as being not in accordance with the by-laws of the Association and allowed those petitions.",
      "type": "procedural",
      "date": "1950-08-20",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "The respondents to the petitions filed petitions under Art. 136 of the Constitution for special leave to appeal to this Court against the said judgment of Mr. Justice Shah. These petitions were dismissed by this Court on or about April 6, 1951.",
      "type": "procedural",
      "date": "1951-04-06",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Appellants by their attorneys letter dated May 2, 1951, called upon the respondents to return the said sum of Rs. 1,80,099-8-0 with interest thereon at 6 per cent. per annum.",
      "type": "procedural",
      "date": "1951-05-02",
      "source": "petitioner"
    },
    {
      "id": "f20",
      "text": "Respondents failed to pay, resulting in suit filed on May 7, 1951, Suit No. 468 of 1951 for repayment with interest and costs.",
      "type": "procedural",
      "date": "1951-05-07",
      "source": "court"
    },
    {
      "id": "f21",
      "text": "In the plaint, appellants averred contracts void under Bombay Cotton Contracts Act, 1932, as not in accordance with by-laws: (1) contract notes omitted to state difference above/below settlement rate of hedge contracts per by-laws 139 and 141; (2) no provision for measurement of bales per by-law 80.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f22",
      "text": "Respondents in written statement contended no by-law required agreement on difference above/below settlement rate; provisions obsolete as no hedge contracts with different numbers and contracts not put through periodical settlements; no by-law required specific measurements as by-law 101 suspended since November 30, 1942.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f23",
      "text": "Appellants amended plaint averring implied agreement due to payments without prejudice that respondents would repay if appellants not bound.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f24",
      "text": "Trial Judge (single Judge Bombay HC) followed Justice Shah, held omission of measurement did not alter contracts; omission of difference rendered void; no implied agreement, payment voluntary; dismissed suit.",
      "type": "procedural",
      "date": "1956-03-23",
      "source": "lower_court"
    },
    {
      "id": "f25",
      "text": "Appellate Court (Bombay HC Appeal No. 45 of 1955) confirmed dismissal on different grounds: omission of measurement immaterial; no obligation to agree on difference, omission no consequence; differed on implied agreement (held existed if contracts void) but contracts not void.",
      "type": "procedural",
      "date": "1956-03-19",
      "source": "lower_court"
    },
    {
      "id": "f26",
      "text": "Board suspended operation of by-law 101 as regards measurements on November 30, 1942.",
      "type": "background",
      "date": "1942-11-30",
      "source": "court"
    },
    {
      "id": "f27",
      "text": "Delivery contracts not put through periodical settlements in practice.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f28",
      "text": "Hedge contracts changed from Nos. I to 5 to I.C.C.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the contracts between the parties were not in accordance with the by-laws of the Association and therefore void under Section 8 of the Bombay Cotton Contracts Act, 1932.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Ramanlal Nagindas had no authority to enter into transactions or sign contract notes; contracts not in accordance with by-laws.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": "By-laws of Association; Bombay Cotton Contracts Act, 1932"
    },
    {
      "id": "pa2",
      "text": "Contract notes omitted to state difference of Rs above or below the settlement rate of hedge contracts for periodical settlements as required by by-laws 139 and 141.",
      "supporting_facts": [
        "f21"
      ],
      "legal_basis": "By-laws 139, 141; By-law 80"
    },
    {
      "id": "pa3",
      "text": "No provision made in contract notes with regard to measurement of bales as required by official form in by-law 80.",
      "supporting_facts": [
        "f21"
      ],
      "legal_basis": "By-law 80; By-law 101"
    },
    {
      "id": "pa4",
      "text": "Payments made and accepted without prejudice implies agreement to repay if contracts void and no liability.",
      "supporting_facts": [
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Strict compliance with official form required; omissions are material departures changing legal effect.",
      "supporting_facts": [
        "f24"
      ],
      "legal_basis": "Radhakisson Gopikisson v. Balmukund (distinguished); Burchell v. Thompson etc."
    },
    {
      "id": "pa6",
      "text": "Measurement essential part of description; suspension of by-law 101 makes it necessary to specify agreed measurement.",
      "supporting_facts": null,
      "legal_basis": "By-law 101"
    },
    {
      "id": "pa7",
      "text": "Parties bound to agree and fill in difference above/below hedge rate or state nil; otherwise large payments on settlement.",
      "supporting_facts": null,
      "legal_basis": "By-laws 139, 141"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No by-law required stating difference above/below settlement rate; provisions obsolete, no hedge contracts with different numbers, contracts not through periodical settlements.",
      "supporting_facts": [
        "f22"
      ],
      "legal_basis": "By-laws 139, 141"
    },
    {
      "id": "ra2",
      "text": "No by-law required specific measurements; by-law 101 suspended since November 30, 1942.",
      "supporting_facts": [
        "f22",
        "f26"
      ],
      "legal_basis": "By-law 101"
    },
    {
      "id": "ra3",
      "text": "No obligation to fill in difference term; if no agreement, by-law 141 applies directly using hedge settlement rate.",
      "supporting_facts": null,
      "legal_basis": "By-law 141"
    },
    {
      "id": "ra4",
      "text": "No implied agreement to repay; traversed plea.",
      "supporting_facts": [
        "f23"
      ],
      "legal_basis": null
    },
    {
      "id": "ra5",
      "text": "Substantial compliance sufficient; form not stereotyped.",
      "supporting_facts": null,
      "legal_basis": "Radhakisson Gopikisson v. Balmukund"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "All contracts subject to by-laws; 'not in accordance with' means lack of substantial compliance, not literal; form must contain all terms/conditions.",
      "addresses_issue": "i1",
      "key_observation": "Radhakisson Gopikisson v. Balmukund: substantial compliance enough."
    },
    {
      "id": "cr2",
      "text": "Omission of measurement term: by-law 101 suspended Nov 30, 1942; no necessity to mention as basis disappeared; by-laws 96/119 amended for rope-bound bales; parties factor in extra charges in price.",
      "addresses_issue": "i1",
      "key_observation": "No departure from essential part; legal effect unchanged."
    },
    {
      "id": "cr3",
      "text": "Omission to fill difference above/below hedge rate: no obligation to agree/fill if no agreement (equivalent to nil); by-law 141 applies directly; practice suspended periodical settlements for delivery contracts; term obsolete.",
      "addresses_issue": "i1",
      "key_observation": "No need to fill blanks; substantial compliance; form outdated (e.g., 'Hedge Contract No.' after I.C.C. substitution)."
    },
    {
      "id": "cr4",
      "text": "Immaterial if parties intended not to comply with 139/141 as not pleaded in plaint.",
      "addresses_issue": "i1",
      "key_observation": "Not considered."
    },
    {
      "id": "cr5",
      "text": "Contracts valid; appellants not entitled to recover Rs. 1,80,099-8-0.",
      "addresses_issue": "i1",
      "key_observation": "Both grounds fail."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The contracts entered into between the appellants and the respondents were not void as alleged under s.8 Bombay Cotton Contracts Act, 1932.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Radhakisson Gopikisson v. Balmukund Ramchandra",
      "citation": "1932 L.R. 60 I.A. 63",
      "treatment": "followed",
      "relevance": "Substantial compliance with form sufficient; literal not essential; contracts contain all terms/conditions."
    },
    {
      "case_name": "Burchell v. Thompson",
      "citation": "1920 2 K.B. 80",
      "treatment": "referred",
      "relevance": "Departure from characteristic part or change in legal effect voids contract."
    },
    {
      "case_name": "Ex-parte Stanford, In re Barber",
      "citation": "1886 17 Q.B.D. 259",
      "treatment": "referred",
      "relevance": "Departure from characteristic part or change in legal effect voids contract."
    },
    {
      "case_name": "Thomas v. Kelly",
      "citation": "1888 13 App. Cas. 506",
      "treatment": "referred",
      "relevance": "Departure from characteristic part or change in legal effect voids contract."
    },
    {
      "case_name": "Parsons v. Brand Cols v. Dickson",
      "citation": "1890 25 Q.B.D. 110",
      "treatment": "referred",
      "relevance": "Departure from characteristic part or change in legal effect voids contract."
    },
    {
      "case_name": "Judgment of Mr. Justice Shah (Petitions A/51 etc. 1949)",
      "citation": null,
      "treatment": "referred",
      "relevance": "Held contracts void for non-compliance; followed by trial judge."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Cotton Contracts Act, 1932",
      "sections": [
        "Section 8"
      ],
      "relevance": "Any contract not in accordance with by-laws of recognized cotton association is void."
    },
    {
      "name": "Indian Arbitration Act",
      "sections": [
        "s. 33"
      ],
      "relevance": "Petitions filed for declaration no arbitration agreement."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 136"
      ],
      "relevance": "Petitions for special leave dismissed."
    },
    {
      "name": "By-laws of East India Cotton Association Ltd.",
      "sections": [
        "By-law 80",
        "By-law 101",
        "By-law 139",
        "By-law 141",
        "By-law 38-A",
        "By-laws 149-163",
        "By-laws 96",
        "By-laws 119",
        "By-laws 136"
      ],
      "relevance": "Govern form and validity of contracts, measurements, settlements; some suspended or obsolete."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The contracts were in substantial compliance with the by-laws despite omissions, as terms were obsolete or suspended. Appellants not entitled to recover Rs. 1,80,099-8-0 paid under the contracts. Appellate High Court judgment confirmed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The only question for our determination in this appeal is whether the contracts between the parties were not in accordance with the by-laws of the Association and therefore void.",
      "speaker": "court",
      "significance": "Frames the sole issue."
    },
    {
      "text": "Their Lordships of the Privy Council there held that the form prescribed was not a stereotyped one and that literal compliance with it was not essential. The only thing required was that the contract notes must contain all the terms and conditions set out in the form.",
      "speaker": "court",
      "significance": "Explains 'not in accordance with' as substantial compliance."
    },
    {
      "text": "We are therefore of the opinion that the omission to fill in those blanks in the contract notes did not spell any departure from an essential or a characteristic part of the contract form nor was the legal effect of the contracts in any manner changed thereby rendering the contracts void.",
      "speaker": "court",
      "significance": "Key holding on settlement difference omission."
    },
    {
      "text": "The whole difficulty has been created by reason of the Association not having made the necessary alterations in the contract form in accordance with the situation as it obtained from time to time.",
      "speaker": "court",
      "significance": "Critique of Association's outdated forms."
    }
  ],
  "_case_id": "1958_141",
  "_label": 0,
  "_text_length": 42400,
  "_extracted_at": "2026-02-08T22:34:57.760002"
}