{
  "metadata": {
    "case_name": "Shriniwas Ramchandra Jakati & Anr. v. S. N. Borkar & Ors.",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur J.",
      "Imam J.",
      "Sinha J."
    ],
    "case_number": "Civil Appeal No. 233 of 1954",
    "date_of_judgment": "1958-09-24"
  },
  "facts": [
    {
      "id": "f1",
      "text": "M. B. Jakati, defendant No. 1, was the Managing Director of Dharwar Urban Co-operative Bank Limited which went into liquidation, and in that capacity he was receiving a yearly remuneration of Rs. 1,000.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "As a result of certain proceedings taken against defendant No. 1, M. B. Jakati, by the liquidator of the Bank, a payment order for Rs. 15,100 was made by the Deputy Registrar of Co-operative Societies on April 21, 1942.",
      "type": "material",
      "date": "1942-04-21",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In execution of this payment order a bungalow belonging to M. B. Jakati, defendant No. 1, was attached by the Collector under the Bombay Land Revenue Code on July 27, 1942.",
      "type": "procedural",
      "date": "1942-07-27",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Notice for sale was issued on November 24, 1942, and the proclamation on December 24, 1942. The sale was fixed for February 2, 1943.",
      "type": "procedural",
      "date": "1942-11-24",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On January 16, 1943, B. Jakati defendant No. 1 applied for postponing the sale which was rejected.",
      "type": "procedural",
      "date": "1943-01-16",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The auction sale was held on February 2, 1943, and was confirmed on June 23, 1943 - the purchaser was S. N. Borkar, defendant No. 7, respondent No. 1.",
      "type": "material",
      "date": "1943-02-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On February 10, 1944, respondent No. 1 sold the property to defendants 8 to 10 who are respondents 2 to 4.",
      "type": "material",
      "date": "1944-02-10",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Pedigree: Madhavarao Balakrishan Jakati (Deft. 1), Bhimabai (2), Krishnaji (son, original plaintiff), Shriniwas (son, appellant No. 1), Shantibai (Deft. No. 3, daughter), Indumati (Deft. No. 4, daughter).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On January 15, 1943, Krishnaji a son of defendant No. 1 brought a suit for partition of the joint family property and possession of his separate share alleging inter alia that the purchase by respondent No. 1 of the bungalow was not binding on the joint family as it was not liable to be sold for the illegal and immoral acts on the part of defendant No. 1 which were characterised as misfeasance that the auction sale was under s. 155 of the Bombay Land Revenue Code under which only the right, title and interest of the defaulter could be sold and therefore the right, title and interest of only the father, defendant No. 1 was sold and not that of the other members.",
      "type": "procedural",
      "date": "1943-01-15",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "The plaintiff claimed 1/4 share of the property and also alleged that he was not on good terms with his father who had neglected his interest that he was staying with his mothers sister and was not being maintained by his father and mother.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "On January 12, 1944, appellant No. 1 filed his written statement supporting the claim for partition and claiming his own share. He supported the claim of the then plaintiff that the sale in favour of respondent No. 1 was not binding on the joint family.",
      "type": "procedural",
      "date": "1944-01-12",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Defendant No. 2, appellant No. 2, the mother, also supported the plaintiffs claim and on the death of Krishnaji, she claimed his share as his heir.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "After the death of the original plaintiff Krishnaji, Shriniwas appellant No. 1 was substituted as plaintiff on June 28, 1944.",
      "type": "procedural",
      "date": "1944-06-28",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The learned Civil Judge held that the suit was not collusive that the liability which defendant No. 1 incurred was avyavaharika and was therefore not binding on the sons and thus appellant No. 1 would have 1/3 share in the joint family property, defendant No. 1 1/3 and appellant No. 2 also 1/3. He therefore declared the shares as above in the whole of the joint family property including the bungalow.",
      "type": "procedural",
      "date": "1945-10-19",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "On appeal the High Court held that the debt was not avyavaharika as there was no evidence to support the finding of the trial Court, the order of the Deputy Registrar being in the nature of a judgment to which neither the sons nor the auction purchasers were parties and therefore it was not evidence of anything except the historical fact that it was delivered. In regard to the question as to what interest passed to the auction purchaser on a sale under s. 155 of the Bombay Land Revenue Code, it held that the whole estate including the share of the sons was sold in execution of the payment order and therefore qua that property the sons had no interest left. The High Court varied the decree dated August 22, 1950.",
      "type": "procedural",
      "date": "1950-08-22",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the debt of the father was avyavaharika.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the institution of the suit for partition operated as severance of status between the members of the family and therefore the fathers power of disposition over the sons share had come to an end and consequently in the auction sale the share of the sons did not pass to the auction-purchaser.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "What could legally be sold under s. 155 of the Bombay Land Revenue Code was the right, title and interest of the defaulter i.e. of the father alone which could not include the share of the other members of the joint family.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The debt was avyavaharika and therefore in an auction sale the interest of the sons and other members of the joint family did not pass to the auction-purchaser.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": "Hindu law on avyavaharika debts"
    },
    {
      "id": "pa2",
      "text": "Even if the debt was not avyavaharika the institution of the suit for partition operated as severance of status between the members of the family and therefore the fathers power of disposition over the sons share had come to an end and consequently in the auction sale the share of the sons did not pass to the auction-purchaser.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Hindu law on severance of joint status"
    },
    {
      "id": "pa3",
      "text": "What could legally be sold under s. 155 of the Bombay Land Revenue Code was the right, title and interest of the defaulter i.e. of the father alone which could not include the share of the other members of the joint family.",
      "supporting_facts": [
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": "Section 155, Bombay Land Revenue Code"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Plaintiffs suit for partition was collusive having been brought at the instance of the defendant No. 1, M. B. Jakati, and it was not bona fide.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Defendant No. 1 was made liable at the instance of the liquidator of the Dharwar Urban Co-operative Bank Ltd., for misfeasance because he acted negligently in the discharge of his duties as managing director of the Bank that the debt was binding on the family as defendant No. 1, M. B. Jakati, had been receiving a yearly remuneration from the Bank and the properties were sold in payment of a debt binding on the family and therefore the sale in execution of the payment order could not be challenged as the sons were under a pious obligation under the Hindu law to discharge the debts of their father that the sale could only be challenged on proof of the debt of defendant No. 1 being for an immoral or illegal purpose.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Pious obligation under Hindu law"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Any opinion given in the order of the Deputy Registrar as to the nature of the liability of defendant No.1, M. B. Jakati, cannot be used as evidence in the present case to determine whether the debt was avyavaharika or otherwise. The order is not admissible to prove the truth of the facts therein stated and except that it may be relevant to prove the existence of the judgment itself, it will not be admissible in evidence under Section 43 of the Indian Evidence Act.",
      "addresses_issue": "i1",
      "key_observation": "Deputy Registrar's order not evidence of avyavaharika nature."
    },
    {
      "id": "cr2",
      "text": "The managing director of a Bank of the position of defendant No. 1 who should have been more vigilant in investing the monies of the Bank cannot be said to have incurred the liability for a cause repugnant to good morals. We are unable to subscribe to the proposition that in the modern age with its complex institutions of Banks and Joint Stock Companies governed by many technicalities and complex system of laws the liability such as has arisen in the present case could be called avyavaharika. The debt was therefore binding on the sons.",
      "addresses_issue": "i1",
      "key_observation": "Negligence as managing director not repugnant to good morals; debt not avyavaharika."
    },
    {
      "id": "cr3",
      "text": "The liability of the sons is thus unaffected by partition because the pious duty of the sons to pay the debt of the father, unless it is for an immoral or illegal purpose, continues till the debt is paid off and the pious obligation incumbent on the sons to see that their fathers debts are paid, prevents the sons from asserting that the family estate so far as their interest is concerned is not liable to purge that debt.",
      "addresses_issue": "i2",
      "key_observation": "Pious obligation continues post-partition; creditor can seize whole estate."
    },
    {
      "id": "cr4",
      "text": "There is little doubt therefore that what was put up for auction sale was the whole bungalow and what the auction-purchaser purported to buy and paid for was also the whole bungalow and not any fractional share in it.",
      "addresses_issue": "i3",
      "key_observation": "Documents show whole property sold: notice, proclamation, confirmation, certificate."
    },
    {
      "id": "cr5",
      "text": "The words 'right, title and interest' occurring in s. 155 of the Bombay Land Revenue Code have the same connotation as they had in the corresponding words used in the Code of Civil Procedure existing at the time the Bombay Land Revenue Code was enacted.",
      "addresses_issue": "i3",
      "key_observation": "Sale under BLRC s155 same effect as CPC sale."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The liability of the sons to discharge the debts of the father which are not tainted with immorality or illegality is based on the pious obligation of the sons which continues to exist in the lifetime and after the death of the father and which does not come to an end as a result of partition of the joint family property. All that results from partition is that the right of the father to make an alienation comes to an end.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Where the right, title and interest of a judgment-debtor are set up for sale as to what passes to the auction-purchaser is a question of fact in each case dependent upon what was the estate put up for sale, what the Court intended to sell and what the purchaser intended to buy and did buy and what he paid for.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "The words 'right, title and interest occurring in s. 155 of the Bombay Land Revenue Code have the same connotation as they had in the corresponding words used in the Code of Civil Procedure existing at the time the Bombay Land Revenue Code was enacted.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "In execution proceedings it is not necessary to implead the sons or to bring another suit if severance of status takes place pending the execution proceedings because the pious duty of the sons continues and consequently there is merely a difference in the mode of enjoyment of the property.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "The liability of a father, who is a managing director and who draws a salary or a remuneration, incurred as a result of negligence in the discharge of his duties is not an avyavaharika debt as it cannot be termed as repugnant to good morals.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hem Raj alias Babu Lal v. Khem Chand",
      "citation": "1943 L.R. 70 I.A. 171, 176",
      "treatment": "followed",
      "relevance": "Translation of avyavaharika as debt for a cause repugnant to good morals."
    },
    {
      "case_name": "Toshanpal Singh v. District Judge of Agra",
      "citation": "1934 L.R. 61 I.A. 350",
      "treatment": "followed",
      "relevance": "Criminal breach of trust avyavaharika, but civil debt for unaccounted monies not."
    },
    {
      "case_name": "Masit Ullah v. Damodar Prasad",
      "citation": "1926 L.R. 53 I.A. 204",
      "treatment": "followed",
      "relevance": "Pious duty legal character, not irrespective of inheritance."
    },
    {
      "case_name": "Panna Lal v. Mst. Naraini",
      "citation": "1952 S.C.R. 544",
      "treatment": "followed",
      "relevance": "Sons liable post-partition for pre-partition just debts; approved dicta on pious obligation."
    },
    {
      "case_name": "Girdharee Lal v. Kantoo Lal",
      "citation": "1874 L.R. 1 I.A. 321, 333",
      "treatment": "followed",
      "relevance": "Creditor can sell whole coparcenary estate."
    },
    {
      "case_name": "Suraj Bansi Koer v. Sheo Prasad Singh",
      "citation": "1878 L.R. 6 I.A. 88, 101",
      "treatment": "followed",
      "relevance": "Father can alienate whole estate for antecedent debt."
    },
    {
      "case_name": "Brij Narain v. Mangla Prasad",
      "citation": "1923 L.R. 51 I.A. 129, 136",
      "treatment": "followed",
      "relevance": "Sons cannot set up rights against father's alienation for antecedent debt not immoral."
    },
    {
      "case_name": "Nanomi Babuasin v. Modun Mohan",
      "citation": "1885 L.R. 13 I.A. 1, 17, 18",
      "treatment": "followed",
      "relevance": "Creditor can sell sons' interest; purchaser defends title if whole estate sold."
    },
    {
      "case_name": "Sidheshwar Mukherji v. Bhubneshwar Prasad Narain Singh",
      "citation": "1954 S.C.R. 177",
      "treatment": "followed",
      "relevance": "Pious obligation basis of liability; continues post-partition."
    },
    {
      "case_name": "Sripat Singh v. Tagore",
      "citation": "1916 L.R. 44 I.A.1",
      "treatment": "followed",
      "relevance": "Creditor can seize whole coparcenary property."
    },
    {
      "case_name": "Kishan Sarup v. Brijraj Singh",
      "citation": "1929 I.L.R. 51 All. 932",
      "treatment": "followed",
      "relevance": "Decree against father binds sons as represented by him."
    },
    {
      "case_name": "Ganpatrao v. Bhimrao",
      "citation": "I.L.R. 1950 Bom. 114",
      "treatment": "distinguished",
      "relevance": "Confined to facts; sons need not be impleaded post-partition."
    },
    {
      "case_name": "Kameshwaramma v. Venkatasubba Row",
      "citation": "1914 I.L.R. 38 Mad. 1120",
      "treatment": "distinguished",
      "relevance": "Confined to facts; no need for separate suit against sons."
    },
    {
      "case_name": "Khiarajmal v. Daim",
      "citation": "1904 L.R. 32 I.A. 23",
      "treatment": "distinguished",
      "relevance": "No decree against non-parties; inapplicable to sons represented by father."
    },
    {
      "case_name": "Malkarjun Bin Shidramappa Pasare v. Narhari Bin Shivappa",
      "citation": "1900 L.R. 27 I.A. 216, 225",
      "treatment": "followed",
      "relevance": "Purchaser not to inquire into court's conduct."
    },
    {
      "case_name": "Shambu Nath Pandey v. Golab Singh",
      "citation": "1887 L.R. 14 I.A. 77",
      "treatment": "distinguished",
      "relevance": "Fathers share alone passed where documents so indicated."
    },
    {
      "case_name": "Meenakshi Naidu v. Immudi Kanaka Rammaya Kounden",
      "citation": "1888 L.R. 16 I.A. 1",
      "treatment": "followed",
      "relevance": "Whole coparcenary interest sold where court intended so."
    },
    {
      "case_name": "Rai Babu Mahabir Persad v. Rai Markunda Nath Sahai",
      "citation": "1889 L.R. 17 I.A. 11, 16",
      "treatment": "followed",
      "relevance": "Question of fact what was sold."
    },
    {
      "case_name": "Hurdey Narain v. Rooder Perkash",
      "citation": "1883 L.R. 11 I.A. 26, 29",
      "treatment": "distinguished",
      "relevance": "Only fathers share sold where documents indicated so."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Land Revenue Code",
      "sections": [
        "Section 155",
        "Section 165",
        "Section 166"
      ],
      "relevance": "Governs attachment and sale; 'right, title and interest of defaulter' sold, whole estate passed as per facts."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "Section 43"
      ],
      "relevance": "Judgments not evidence except to prove existence."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 405"
      ],
      "relevance": "Criminal breach of trust mentioned but distinguished from civil debt."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 64"
      ],
      "relevance": "Attachment not affected by partition; guide for liability."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the judgment and decree of the Bombay High Court varying the trial court's decree is dismissed. The High Court correctly held the debt not avyavaharika and the whole joint family property including sons' shares passed in the auction sale under s.155 Bombay Land Revenue Code due to pious obligation.",
    "relief_granted": "None; respondents retain property.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"The managing director of a Bank of the position of defendant No. 1 who should have been more vigilant in investing the monies of the Bank cannot be said to have incurred the liability for a cause repugnant to good morals.\"",
      "speaker": "court",
      "significance": "Debt from negligence not avyavaharika."
    },
    {
      "text": "\"The liability of the sons is thus unaffected by partition because the pious duty of the sons to pay the debt of the father, unless it is for an immoral or illegal purpose, continues till the debt is paid off.\"",
      "speaker": "court",
      "significance": "Pious obligation survives partition."
    },
    {
      "text": "\"It is a question of fact in each case as to what was sold in execution of the decree.\"",
      "speaker": "court",
      "significance": "Determines what interest passed in sale."
    }
  ],
  "_case_id": "1958_59",
  "_label": 0,
  "_text_length": 37543,
  "_extracted_at": "2026-02-10T19:20:45.477004"
}