{
  "metadata": {
    "case_name": "Petitioners (Building Contractors) v. Respondents (State Authorities)",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar J."
    ],
    "case_number": "Petition No. 128 of 1957",
    "date_of_judgment": "1958-04-07"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petition under Article 32 of the Constitution for enforcement of Fundamental Rights challenging validity of provisions of East Punjab General Sales Tax Act, 1948 imposing tax on supply of materials in construction works treating it as a sale.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Petitioners are a firm of building contractors.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In December 1956, petitioners entered into a contract with Military Engineering Services Department of the Government for construction of certain buildings known as Married accommodation at Ambala Cantonment.",
      "type": "material",
      "date": "1956-12",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Petitioners received a sum of Rs. 32,000 on January 31, 1957, as advance.",
      "type": "material",
      "date": "1957-01-31",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "On February 14, 1957, assessing authority, Jullundur District issued notice intimating petitioners that as they failed to apply for registration under s.7 of the Act, assessment would be made under s.18 sub-s.(2) for periods commencing from April 1, 1955 onwards, calling upon them to produce account books and attend hearing on February 16, 1957.",
      "type": "procedural",
      "date": "1957-02-14",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Tenders called for and received were for executing works for a lump sum; acceptance of petitioners' tender dated December 15, 1956 by Deputy Chief Engineer for lump sum of Rs. 9,74,961 on behalf of President of India.",
      "type": "material",
      "date": "1956-12-15",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Contract comprised construction of nine blocks, amounts worked out treating each block as one unit.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Rule 33 of General Conditions of Contracts: All stores and materials brought to the site shall become and remain property of Government and shall not be removed without prior approval; upon completion, contractor to remove surplus materials at own expense, which then revert to contractor.",
      "type": "background",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Validity of provisions of East Punjab General Sales Tax Act, 1948 imposing tax on supply of materials in construction works treating it as a sale, and whether Provincial Legislature had power under Entry 48 List II Sch. VII Government of India Act, 1935.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the building contract was one indivisible lump sum contract for construction or comprised distinct agreement for sale of materials and agreement for work and labour.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Legislature of Province of Punjab had no power under Entry 48 List II Sch. VII Government of India Act, 1935 to impose tax on supply of materials in construction works as there was no sale in fact or in law; provisions ultra vires.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "State of Madras v. Gannon Dunkerley Co. (Madras) Ltd.; Entry 48 List II Govt of India Act 1935"
    },
    {
      "id": "pa2",
      "text": "Definition of turnover in s.2(j) cl.(ii) has no reference to sale of goods.",
      "supporting_facts": [],
      "legal_basis": "East Punjab General Sales Tax Act s.2(j)"
    },
    {
      "id": "pa3",
      "text": "Petitioners as building contractors not engaged in business of selling or supplying goods but of constructing buildings, hence not dealers under s.2(d).",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "East Punjab General Sales Tax Act s.2(d), s.4"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Building contract entered by petitioners with Government comprised distinct agreement for sale of materials.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "Rule 33 General Conditions of Contracts"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Question concluded by decision in State of Madras v. Gannon Dunkerley: expression 'sale of goods' in Entry 48 has same meaning as in Indian Sale of Goods Act 1930; in building contract no sale of materials as such; Provincial Legislature no power to tax.",
      "addresses_issue": "i1",
      "key_observation": "No sale of materials used by petitioners in constructions."
    },
    {
      "id": "cr2",
      "text": "Evidence shows contract was lump sum for executing works; tenders for lump sum; acceptance for lump sum Rs.9,74,961 for nine blocks; impossible to hold agreement for sale of materials as such.",
      "addresses_issue": "i2",
      "key_observation": "Contract one and indivisible."
    },
    {
      "id": "cr3",
      "text": "Rule 33 does not effect sale: materials must be approved, can be condemned if inferior; terms ensure right materials used, not purchase; surplus materials revert without resale intention.",
      "addresses_issue": "i2",
      "key_observation": "Rule 33 has no effect of converting lump sum construction contract into contract for sale of materials."
    },
    {
      "id": "cr4",
      "text": "Analogous to Tripp v. Armitage and Reid v. Macbeth Gray: approval does not pass property until fixed in performance of larger contract.",
      "addresses_issue": "i2",
      "key_observation": "Title to materials does not pass as such to Government."
    },
    {
      "id": "cr5",
      "text": "S.4(1) charging section taxes gross turnover on sales; intention to include supply of materials in works contracts as taxable turnover.",
      "addresses_issue": "i1",
      "key_observation": "Definition of turnover includes it."
    },
    {
      "id": "cr6",
      "text": "If supply regarded as sale, building contractors engaged in sale of materials, within definition of dealers.",
      "addresses_issue": "i1",
      "key_observation": "Petitioners are dealers if sale exists."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No sale of materials used in construction works under building contract; provisions of Act seeking to tax supply as sale ultra vires.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Building contract is one indivisible lump sum contract for construction, not comprising separate sale of materials.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Madras v. Gannon Dunkerley Co. (Madras) Ltd.",
      "citation": "1959 S.C.R. 379",
      "treatment": "followed",
      "relevance": "Held no sale of goods in building contract under Entry 48; Provincial Legislature no power to tax materials supplied."
    },
    {
      "case_name": "Tripp v. Armitage",
      "citation": "1839 4 M. & W. 687; 150 E.R. 1597, 1603",
      "treatment": "referred",
      "relevance": "Approval of materials by surveyor does not constitute acceptance or pass property until fixed in larger contract."
    },
    {
      "case_name": "Reid v. Macbeth Gray",
      "citation": "1904 A.C. 223",
      "treatment": "referred",
      "relevance": "Approval and marking of materials does not establish separate contract of sale or pass title apart from main construction contract."
    }
  ],
  "statutes_cited": [
    {
      "name": "East Punjab General Sales Tax Act, 1948",
      "sections": [
        "s.2(c)",
        "s.2(d)",
        "s.2(h)",
        "s.2(j)",
        "s.4(1)",
        "s.5",
        "s.7",
        "s.18(2)",
        "Rule 28"
      ],
      "relevance": "Defines contract, dealer, sale, turnover; imposes tax on dealers' taxable turnover including contracts; challenged as ultra vires for taxing non-sales."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Basis for petition enforcing fundamental rights."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Entry 48 List II Sch. VII"
      ],
      "relevance": "Limits provincial power to tax sales of goods."
    },
    {
      "name": "Indian Sale of Goods Act, 1930",
      "sections": [],
      "relevance": "Defines 'sale of goods' for interpreting Entry 48."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Petition under Art.32 allowed; held provisions of East Punjab General Sales Tax Act, 1948 ultra vires for taxing supply of materials in construction contracts as there is no sale; assessment proceedings illegal.",
    "relief_granted": "Challenge to assessment proceedings upheld; no tax leviable.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"in a building contract there is no sale of materials as such, and that accordingly the Provincial Legislature had no power to impose a tax thereon under Entry 48.\"",
      "speaker": "court",
      "significance": "Core holding following Gannon Dunkerley, declaring provisions ultra vires."
    },
    {
      "text": "\"The evidence placed before us leaves us in no doubt as to the true character of the contract.\"",
      "speaker": "court",
      "significance": "Confirms contract is lump sum for works, not sale of materials."
    },
    {
      "text": "\"It is impossible on this evidence to hold that there was any agreement for sale of the materials as such by the petitioners to the Government.\"",
      "speaker": "court",
      "significance": "Rejects respondent's construction of contract."
    }
  ],
  "_case_id": "1958_102",
  "_label": 1,
  "_text_length": 11567,
  "_extracted_at": "2026-02-10T19:21:09.682448"
}