{
  "metadata": {
    "case_name": "Amritsar Distillery Company v. Income Tax Authorities",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "SARKAR, J."
    ],
    "case_number": "Civil Appeal No. 119 of 1955",
    "date_of_judgment": "1958-11-24"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a company incorporated in May 1945 as reconstruction of previously existing Amritsar Distillery Co. Ltd. under Companies Act, carrying on business as distiller of country liquor, selling produce to licensed wholesalers.",
      "type": "background",
      "date": "1945-05",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Wholesalers sell liquor to licensed retailers, who sell to consumers; entire trade controlled by Government regulations.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "After war started, demand for country liquor increased but bottle scarcity; Government devised buy-back scheme in 1940: distiller charges wholesaler fixed price for bottles, refundable on return; similar for wholesaler-retailer and retailer-consumer.",
      "type": "background",
      "date": "1940",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Price refundable under scheme later increased.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Sometime in 1944, Amritsar Distillery Co. Ltd. insisted wholesalers pay additional amounts described as security deposits, calculated at varying rates per bottle, promising refund per bottle returned and full amount when 90% of bottles covered by transaction returned.",
      "type": "material",
      "date": "1944",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant continued demanding and taking these additional sums after taking over business; no time limit for return to entitle refund; no refund ever refused.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Object of additional sums: additional inducement for return of bottles to not hamper trade for want of bottles.",
      "type": "material",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Buy-back scheme price entered in general trading account; additional sums in 'Empty Bottles Return Security Deposit Account'.",
      "type": "material",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Additional amounts taken without Government's sanction, as condition imposed by appellant for sale of liquor.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant assessed to income-tax, business profits tax, excess profits tax on balance of additional sums after refunds.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appeals to Appellate Assistant Commissioner and Tribunal failed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Reference to Punjab High Court in Civil Reference No. 1 of 1953; question reframed: Whether collections described as empty bottle return security deposits were income assessable under section 10 of Income-tax Act.",
      "type": "procedural",
      "date": "1953-06-16",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "High Court answered question in affirmative.",
      "type": "procedural",
      "date": "1953-06-16",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appeal to Supreme Court against High Court decision relating to all three taxes.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Sale terms: price of liquor + govt-fixed bottle price + security deposit; no sale unless all paid; bottle price refunded on return; deposit refunded fully when 90% bottles returned.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of the case the collections by the assessee company described in its accounts as empty bottle return security deposits were income assessable under section 10 of the Income-tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Additional amounts could not be regarded as price hence not trading receipts; price of bottles separately fixed under buy-back scheme, deposit different and exclusive.",
      "supporting_facts": [
        "f3",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Amounts were security deposits for return of bottles, not trading receipts.",
      "supporting_facts": [
        "f5",
        "f6",
        "f15"
      ],
      "legal_basis": "Davies v. The Shell Company of China Ltd.; Morley v. Tattersall; third arrangement in K.M.S. Lakshmanier Sons v. CIT"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Even if amounts were securities deposited for return of bottles, they would still be trading receipts as part of trading transactions; return of bottles necessary to carry on trade.",
      "supporting_facts": [
        "f7",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appellant's trade consisted of selling bottled liquor to wholesalers; consideration included liquor price, bottle price, security deposit; all essential, no sale without them; deposit part of price/consideration, trading receipt.",
      "addresses_issue": "i1",
      "key_observation": "Amount called security deposit actually part of consideration for sale; entry in separate account does not change nature."
    },
    {
      "id": "cr2",
      "text": "No obligation on wholesalers to return bottles; no right to bottles' return, hence no true security; words 'security deposit' alone insufficient to create obligation.",
      "addresses_issue": "i1",
      "key_observation": "Substance: sold bottles, agreed to take back and repay amounts."
    },
    {
      "id": "cr3",
      "text": "Distinguished Davies v. Shell: deposits anterior to trading, trading structure; here part of each trading transaction.",
      "addresses_issue": "i1",
      "key_observation": "Amounts essential to sales, profit-making quality."
    },
    {
      "id": "cr4",
      "text": "Amounts integral part of commercial transaction (sale of liquor in bottles), like dollars in Imperial Tobacco.",
      "addresses_issue": "i1",
      "key_observation": "Refundability does not alter trading receipt nature, as bottle price also refundable."
    },
    {
      "id": "cr5",
      "text": "Followed second arrangement in K.M.S. Lakshmanier Sons: trading receipts, not loans; distinguished third arrangement (one-time deposit anterior to contracts, with interest).",
      "addresses_issue": "i1",
      "key_observation": "Here, deposit per transaction, related to price, refundable per transaction."
    },
    {
      "id": "cr6",
      "text": "Distinguished Morley v. Tattersall: moneys received on behalf of others, never firm's; here appellant's moneys, profit potential.",
      "addresses_issue": "i1",
      "key_observation": "Receipts had profit-making quality as condition for supply."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Amounts paid to appellant described as Empty Bottles Return Security Deposit were trading receipts and income assessable to tax under section 10 of Income-tax Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Davies v. The Shell Company of China Ltd.",
      "citation": "1951 32 Tax Cas. 133",
      "treatment": "distinguished",
      "relevance": "Deposits anterior to trading transactions, trading structure; unlike here where part of each sale."
    },
    {
      "case_name": "Imperial Tobacco Co. v. Kelly",
      "citation": "1943 25 Tax Cas. 292",
      "treatment": "referred",
      "relevance": "Profit on dollars bought for commercial transaction (tobacco purchase) was trading receipt; analogous to amounts here integral to sale."
    },
    {
      "case_name": "K. M. S. Lakshmanier Sons v. Commissioner of Income-tax and Excess Profits Tax, Madras",
      "citation": "1953 S.C.R. 1057",
      "treatment": "followed",
      "relevance": "Initial payments under second arrangement were trading receipts (advance payments adjusted on completion); similar to present case; distinguished third arrangement as loans."
    },
    {
      "case_name": "Landes Bros. v. Simpson",
      "citation": "1934 19 Tax Cas. 62",
      "treatment": "referred",
      "relevance": "Mentioned in Shell case; advance payments for goods could be trading receipts."
    },
    {
      "case_name": "Morley v. Tattersall",
      "citation": "1938 22 Tax Cas. 51",
      "treatment": "distinguished",
      "relevance": "Moneys received on behalf of others never became firm's income; here appellant's own receipts with profit potential."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "Section 10"
      ],
      "relevance": "Whether security deposits assessable as income thereunder."
    },
    {
      "name": "Companies Act",
      "sections": [],
      "relevance": "Appellant reconstructed under its provisions."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the Punjab High Court's affirmative answer to the reference question is dismissed; additional sums described as empty bottle return security deposits held to be trading receipts assessable to income-tax, business profits tax, and excess profits tax.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "So the amount which was called security deposit was actually a part of the consideration for the sale and therefore part of the price of what was sold.",
      "speaker": "court",
      "significance": "Core reasoning that deposit is trading receipt."
    },
    {
      "text": "There could be no security given for the return of the bottles unless there was a right to their return for if there was no such right, there would be nothing to secure.",
      "speaker": "court",
      "significance": "Rejects true security deposit nature."
    },
    {
      "text": "Having given the matter our anxious consideration which the difficulties involved in it require, we think that the correct view to take is that the amounts paid to the appellant and described as Empty Bottles Return Security Deposit were trading receipts and therefore income of the appellant assessable to tax.",
      "speaker": "court",
      "significance": "Concluding holding."
    }
  ],
  "_case_id": "1958_36",
  "_label": 0,
  "_text_length": 30630,
  "_extracted_at": "2026-02-10T19:20:27.196323"
}