{
  "metadata": {
    "case_name": "Appellant v. Union of India",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "K. DAS, J."
    ],
    "case_number": "Civil Appeal No. 288 of 1958",
    "date_of_judgment": "1958-12-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant joined permanent Government service on April 4, 1924.",
      "type": "background",
      "date": "1924-04-04",
      "source": "appellant"
    },
    {
      "id": "f2",
      "text": "In 1947, before partition, appellant was employed as Assistant Secretary, Frontier Corps of Militia and Scouts in the then North-Western Frontier Province, under the administrative control of the External Affairs Department of the Government of India. The post was a post in the Central Service, Class II.",
      "type": "background",
      "date": "1947",
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "After partition, the appellant opted for service in India and was posted to an office under the Ministry of Commerce in the Government of India in October, 1947.",
      "type": "background",
      "date": "1947-10",
      "source": "appellant"
    },
    {
      "id": "f4",
      "text": "In December, 1949, appellant was transferred to the office of the Chief Controller of Imports, New Delhi, to clear off certain arrears of work.",
      "type": "background",
      "date": "1949-12",
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "In August, 1951, appellant was posted as Deputy Chief Controller of Imports, Calcutta, and continued to work in that post till September, 1952.",
      "type": "background",
      "date": "1951-08 to 1952-09",
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "Appellant took four months leave on average pay, expiring on January 24, 1953, and was then transferred as Section Officer in the Development Wing of the Ministry of Commerce.",
      "type": "procedural",
      "date": "1953-01-24",
      "source": "appellant"
    },
    {
      "id": "f7",
      "text": "Appellant thought the transfer amounted to a reduction of his rank and made representations which bore no fruit.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f8",
      "text": "On February 6, 1953, appellant applied for leave preparatory to retirement, stating he was due to retire in April 1956 but found it difficult to reconcile to new conditions of service, praying to retire from May 1, 1953.",
      "type": "procedural",
      "date": "1953-02-06",
      "source": "appellant"
    },
    {
      "id": "f9",
      "text": "On February 14, 1953, appellant amended his leave application, requesting leave on full average pay for four months from February 15, 1953, or up to the date permitted to retire, whichever earlier, due to difficulty regarding inclusion of service period as Assistant Secretary.",
      "type": "procedural",
      "date": "1953-02-14",
      "source": "appellant"
    },
    {
      "id": "f10",
      "text": "On March 10, 1953, appellant was informed he could not be allowed to retire at that stage, but was granted leave from February 16, 1953, to April 30, 1953.",
      "type": "procedural",
      "date": "1953-03-10",
      "source": "government"
    },
    {
      "id": "f11",
      "text": "On February 25, 1953, while on leave, appellant wrote to Government contemplating joining service of Messrs. Albert David Co. Ltd., Calcutta, and accepting a course of training there for two months.",
      "type": "material",
      "date": "1953-02-25",
      "source": "appellant"
    },
    {
      "id": "f12",
      "text": "In April, 1953, appellant accepted service under Messrs. Albert David Co. Ltd., and wrote to Government on April 6, 1953.",
      "type": "material",
      "date": "1953-04",
      "source": "appellant"
    },
    {
      "id": "f13",
      "text": "On June 16, 1953, appellant was charged with having violated Rule 15 of the Government Servants Conduct Rules and Fundamental Rule 11 by accepting private employment without previous sanction.",
      "type": "procedural",
      "date": "1953-06-16",
      "source": "government"
    },
    {
      "id": "f14",
      "text": "A.P. Mathur, Joint Chief Controller of Imports, held an enquiry against the appellant.",
      "type": "procedural",
      "date": null,
      "source": "government"
    },
    {
      "id": "f15",
      "text": "Enquiring Officer submitted report on September 12, 1953, finding that appellant accepted private employment without previous sanction while still in Government service.",
      "type": "procedural",
      "date": "1953-09-12",
      "source": "enquiring_officer"
    },
    {
      "id": "f16",
      "text": "On April 14, 1954, appellant was asked to show cause under Art. 311(2), stating President provisionally of opinion that a major penalty, viz., dismissal, removal or reduction should be enforced.",
      "type": "procedural",
      "date": "1954-04-14",
      "source": "government"
    },
    {
      "id": "f17",
      "text": "Appellant showed cause against the notice.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f18",
      "text": "On October 1, 1954, President passed order removing appellant from service with effect from that date, after considering Enquiring Officer's report and in consultation with Public Service Commission, finding charge proved.",
      "type": "material",
      "date": "1954-10-01",
      "source": "president"
    },
    {
      "id": "f19",
      "text": "Appellant filed petition under Art. 226 in Punjab High Court, contending no opportunity under Art. 311(2) and bona fide belief in accepting employment.",
      "type": "procedural",
      "date": "1955",
      "source": "appellant"
    },
    {
      "id": "f20",
      "text": "Dulat, J. dismissed the writ petition on both points on April 9, 1956.",
      "type": "procedural",
      "date": "1956-04-09",
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "Letters Patent Appeal No. 25-D of 1956 dismissed by Punjab High Court Circuit Bench at Delhi on December 3, 1956.",
      "type": "procedural",
      "date": "1956-12-03",
      "source": "lower_court"
    },
    {
      "id": "f22",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order of the President dated October 1, 1954, removing the appellant from service is invalid by reason of contravention of the provisions of Art. 311(2) of the Constitution, specifically because the show cause notice dated April 14, 1954, mentioned three major penalties (dismissal, removal or reduction) without particularising the exact punishment proposed.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The show cause notice dated April 14, 1954, stated all three punishments mentioned in Art. 311(2) and did not particularise the actual or exact punishment proposed, thus not complying with essential requirements of Art. 311(2). Relied on observations in Khem Chand v. Union of India emphasising 'one of the three punishments' and 'actual punishment' from I.M. Lall case.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "Art. 311(2) Constitution; Khem Chand v. Union of India (1958 S.C.R. 1080); High Commissioner for India v. I.M. Lall (1948 L.R. 75 I.A. 225); Jatindra Nath Biswas v. R. Gupta; Dayanidhi Rath v. B.S. Mohanty; Lakshmi Narain Gupta v. A.N. Puri"
    },
    {
      "id": "pa2",
      "text": "Mistakes in the final order of October 1, 1954, referring to wrong rule (r.13 instead of r.15) and inapplicable government order on commercial employment post-retirement.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Appellant had asked for leave preparatory to retirement and accepted service under Albert David Co. Ltd. in bona fide belief that Government had no objection.",
      "supporting_facts": [
        "f8",
        "f9",
        "f10",
        "f11",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The show cause notice complied with Art. 311(2) as it gave reasonable opportunity after enquiry, and mentioning three punishments provided fuller opportunity.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "Art. 311(2) Constitution; Khem Chand v. Union of India"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Art. 311(2) requires reasonable opportunity including showing cause against proposed punishment after enquiry and tentative proposal by competent authority. Opportunities (a) and (b) not disputed; issue is (c). Show cause notice gave reasonable opportunity as President provisionally opined major penalty (any of three) merited.",
      "addresses_issue": "i1",
      "key_observation": "Mentioning three punishments in alternative does not invalidate notice; it gives better opportunity than specifying only severest."
    },
    {
      "id": "cr2",
      "text": "Observations in Khem Chand and I.M. Lall about 'one of the three' or 'actual punishment' must be read in context; real point is opportunity after charges proved and mind applied to gravity, tentatively proposing punishment.",
      "addresses_issue": "i1",
      "key_observation": "Requiring exact punishment would necessitate third notice if lesser imposed, defeating purpose."
    },
    {
      "id": "cr3",
      "text": "Other cases (Jatindra Nath, Dayanidhi, Lakshmi Narain) distinguished: no second notice, or vague, or juxtaposed punishments inconsistently; not laying down rule that multiple punishments invalidate notice.",
      "addresses_issue": "i1",
      "key_observation": "Notice here not vague; President applied mind."
    },
    {
      "id": "cr4",
      "text": "Inaccurate references in final order not vital; substance based on violation of r.15 and F.R.11 by accepting employment without sanction.",
      "addresses_issue": "i1",
      "key_observation": "Second point on bona fides no longer survives."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Show cause notice dated April 14, 1954, complied with Art. 311(2); mentioning three major penalties in alternative valid and provided reasonable opportunity.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Khem Chand v. Union of India",
      "citation": "1958 S.C.R. 1080",
      "treatment": "followed",
      "relevance": "Explained scope of Art. 311(2); reasonable opportunity includes showing cause against tentatively proposed punishment after enquiry."
    },
    {
      "case_name": "High Commissioner for India and High Commissioner for Pakistan v. I. M. Lall",
      "citation": "1948 L.R. 75 I.A. 225",
      "treatment": "referred",
      "relevance": "Quoted with approval in Khem Chand; no second notice after enquiry invalidates; 'actual punishment' in context of definite conclusion post-enquiry."
    },
    {
      "case_name": "Jatindra Nath Biswas v. R. Gupta",
      "citation": "1953 58 C.W.N. 128",
      "treatment": "distinguished",
      "relevance": "No second show cause notice given."
    },
    {
      "case_name": "Dayanidhi Rath v. B. S. Mohanty",
      "citation": "A.I.R. 1955 Orissa 33",
      "treatment": "distinguished",
      "relevance": "Notice juxtaposed removal and dismissal inconsistently."
    },
    {
      "case_name": "Lakshmi Narain Gupta v. A. N. Puri",
      "citation": "A.I.R. 1954 Cal. 335",
      "treatment": "distinguished",
      "relevance": "Vague notice listing multiple penalties without tentative conclusion."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 311(2)",
        "Article 226"
      ],
      "relevance": "Art. 311(2) requires reasonable opportunity to show cause against proposed punishment post-enquiry; complied with here. Art. 226 for writ petition."
    },
    {
      "name": "Government Servants Conduct Rules",
      "sections": [
        "Rule 15"
      ],
      "relevance": "Prohibits engaging in trade or employment without previous sanction; violated by appellant."
    },
    {
      "name": "Fundamental Rules",
      "sections": [
        "Rule 11"
      ],
      "relevance": "Whole time of Government servant at disposal of Government; violated."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The order of removal dated October 1, 1954, is valid and does not contravene Art. 311(2). The show cause notice provided reasonable opportunity.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the President is provisionally of opinion that a major penalty, viz., dismissal, removal or reduction should be enforced on you.\"",
      "speaker": "government",
      "significance": "The show cause notice in question, held valid under Art. 311(2)."
    },
    {
      "text": "\"To specify more than one punishment in the alternative does not necessarily make the proposed action any the less definite on the contrary, it gives the Government servant better opportunity to show cause against each of those punishments being inflicted on him.\"",
      "speaker": "court",
      "significance": "Core holding justifying multiple punishments in notice."
    },
    {
      "text": "\"the reasonable opportunity envisaged by Art. 311(2) of the Constitution included (a) an opportunity to the Government servant to deny his guilt and establish his innocence, (b) an opportunity to defend himself, and finally (c) an opportunity to make his representation as to why the proposed punishment should not be inflicted on him.\"",
      "speaker": "court",
      "significance": "Explanation from Khem Chand, applied here."
    }
  ],
  "_case_id": "1958_93",
  "_label": 0,
  "_text_length": 22955,
  "_extracted_at": "2026-02-08T22:33:24.208685"
}