{
  "metadata": {
    "case_name": "Criminal Appeal No. 118 of 1958",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "VENKATARAMA AIYAR, J."
    ],
    "case_number": "Criminal Appeal No. 118 of 1958",
    "date_of_judgment": "1958-11-24"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On April 26, 1954, the appellant was arrested by the Sisamau Police for offences under ss. 420, 482, 483, 485 and 486 of the Indian Penal Code on the allegation that he was in possession of 25 packets of Chand Chhap Biri, which were alleged to bear counterfeit trade marks.",
      "type": "material",
      "date": "1954-04-26",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On May 26, 1954, one Harish Chandra Jain acting on behalf of Messrs. Mohan Lal Hargovind Das filed a complaint charging that the appellant was in possession of counterfeit bidis, wrappers and labels and praying that a case under the sections above mentioned be registered and investigated.",
      "type": "procedural",
      "date": "1954-05-26",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "On that, the Magistrate passed the following order: 'O. Sisamau. Please investigate and register a case.'",
      "type": "procedural",
      "date": "1954-05-26",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "After investigation, the police submitted their chargesheet on September 30, 1954.",
      "type": "procedural",
      "date": "1954-09-30",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Summons was ordered to the appellant on July 22, 1955.",
      "type": "procedural",
      "date": "1955-07-22",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "On September 17, 1955, the appellant filed an application before the Magistrate raising a preliminary objection that the proceedings were barred by s. 15 of the Indian Merchandise Marks Act, 1889.",
      "type": "procedural",
      "date": "1955-09-17",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The Magistrate rejected this contention.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "A Revision Petition preferred against this order to the Additional Sessions Judge, Kanpur, in Criminal Revision No. 13 of 1956, shared the same fate.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The appellant then filed a further Revision Petition to the High Court of Allahabad, being Criminal Revision No. 1594 of 1956, heard by James and Takru, JJ.",
      "type": "procedural",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "By their judgment dated May 14, 1958, the learned Judges held that the prosecution commenced when the complaint was presented on May 26, 1954, and that as the discovery was on April 26, 1954, the proceedings were within time under s. 15 of the Act. Granted leave to appeal to this Court under Art. 134(1)(c) of the Constitution.",
      "type": "procedural",
      "date": "1958-05-14",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "When does a prosecution commence for purposes of s. 15 of the Indian Merchandise Marks Act, 1889, whether on the date when the complaint is preferred, or when the process is issued thereon?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The proceedings were barred by s. 15 of the Act as the offence was discovered on April 26, 1954, when arrested and goods seized, and the issue of process on July 22, 1955, was beyond the period of one year provided under s. 15.",
      "supporting_facts": [
        "f1",
        "f5"
      ],
      "legal_basis": "s. 15 Indian Merchandise Marks Act, 1889; Sheik Meeran Sahib v. Ratnavelu Mudali; De Rozario v. Gulab Chand Anundjee; Golap Jan v. Bholanath Khettry; R. R. Chari v. The State of Uttar Pradesh"
    },
    {
      "id": "pa2",
      "text": "Prosecution commences only when process is issued, not when complaint is filed.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Cited decisions showing prosecution requires process issuance for malicious prosecution actions"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Prosecution commenced when the complaint was presented on May 26, 1954, and as the discovery was on April 26, 1954, the proceedings were within time under s. 15 of the Act.",
      "supporting_facts": [
        "f2",
        "f1"
      ],
      "legal_basis": "s. 15 Indian Merchandise Marks Act, 1889"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under the law and apart from statutory prescriptions, a prosecution commences, where it is at the instance of a private prosecutor, when the complaint is preferred. Unless there is something to the contrary in the statute, when a private complaint is presented it is the date of presentation thereof that marks the commencement of the prosecution.",
      "addresses_issue": "i1",
      "key_observation": "Cites Halsbury's Laws of England; explains purpose of ss. 13 and 14 of the Act to provide speedy criminal remedy for trademark infringement."
    },
    {
      "id": "cr2",
      "text": "The period of limitation under s. 15 is intended to operate against the complainant to ensure diligence, not against the Court. Holding that process must issue within one year would defeat the object of the enactment.",
      "addresses_issue": "i1",
      "key_observation": "Cites Ruppell v. Ponnuswami Tevan; distinguishes malicious prosecution cases as they concern whether prosecution occurred, not when it commenced."
    },
    {
      "id": "cr3",
      "text": "R. R. Chari v. State of UP and Gopal Marwari v. King-Emperor do not assist appellant as they deal with different contexts; here s. 190(1)(a) CrPC applies to private complaints, cognizance taken when complaint received.",
      "addresses_issue": "i1",
      "key_observation": "Private complaint within one year satisfies s. 15."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Prosecution under s. 15 of the Indian Merchandise Marks Act, 1889 commences on the date the private complaint is preferred, not when process is issued. Proceedings not barred by limitation.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ruppell v. Ponnuswami Tevan",
      "citation": "1899 I.L.R. 22 Mad. 488",
      "treatment": "followed",
      "relevance": "Prosecution must commence within one year of discovery by complainant; limitation ensures diligence."
    },
    {
      "case_name": "Sheik Meeran Sahib v. Ratnavelu Mudali",
      "citation": "1912 I.L.R. 37 Mad. 181",
      "treatment": "distinguished",
      "relevance": "Concerns malicious prosecution actions where process issuance needed to establish prosecution occurred."
    },
    {
      "case_name": "De Rozario v. Gulab Chand Anundjee",
      "citation": "1910 I.L.R. 37 Cal. 358",
      "treatment": "distinguished",
      "relevance": "Concerns malicious prosecution actions where process issuance needed to establish prosecution occurred."
    },
    {
      "case_name": "Golap Jan v. Bholanath Khettry",
      "citation": "1911 I.L.R. 38 Cal. 890",
      "treatment": "distinguished",
      "relevance": "Concerns malicious prosecution actions where process issuance needed; prosecution commences on complaint filing."
    },
    {
      "case_name": "Mohamed Amin v. Jogendra Kumar Bannerjee",
      "citation": "1947 A.C. 322",
      "treatment": "referred",
      "relevance": "Test for malicious prosecution is when proceedings cause damage, not mere filing."
    },
    {
      "case_name": "R. R. Chari v. The State of Uttar Pradesh",
      "citation": "1951 S.C.R. 312",
      "treatment": "distinguished",
      "relevance": "Deals with Prevention of Corruption Act; no prosecution until cognizance under private complaint via s.190(1)(a) CrPC."
    },
    {
      "case_name": "Gopal Marwari v. King-Emperor",
      "citation": "1943 I.L.R. 22 Pat. 433",
      "treatment": "distinguished",
      "relevance": "Distinction between initiation and cognizance under CrPC ss.200,202 not relevant to s.15 language."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "420",
        "482",
        "483",
        "485",
        "486"
      ],
      "relevance": "Offences alleged against appellant for possession of counterfeit trade marks."
    },
    {
      "name": "Indian Merchandise Marks Act, 1889",
      "sections": [
        "13",
        "14",
        "15"
      ],
      "relevance": "s.15 provides limitation for prosecution; ss.13,14 context for protecting trade mark rights via criminal proceedings."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "190(1)(a)",
        "200",
        "202"
      ],
      "relevance": "Cognizance on receipt of private complaint; distinction from police investigations."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "134(1)(c)"
      ],
      "relevance": "Leave to appeal to Supreme Court granted by High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The Supreme Court agrees with the High Court and lower courts that the proceedings are not barred by s. 15 of the Indian Merchandise Marks Act, 1889, as prosecution commenced on May 26, 1954, within one year of discovery on April 26, 1954.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"unless there is something to the contrary in the statute, when a private complaint is presented it is the date of presentation thereof that marks the commencement of the prosecution.\"",
      "speaker": "court",
      "significance": "Core holding on when prosecution commences under s.15."
    },
    {
      "text": "No prosecution as is mentioned in the last foregoing section shall be commenced after the expiration of three years next after the commission of the offence, or one year after the first discovery thereof by the prosecutor, whichever expiration first happens.",
      "speaker": "court",
      "significance": "Verbatim s.15 defining limitation period."
    },
    {
      "text": "The period of limitation, it should be remembered, is intended to operate against the complainant and to ensure diligence on his part in prosecuting his rights, and not against the Court.",
      "speaker": "court",
      "significance": "Explains purpose of limitation, rejecting process issuance as trigger."
    }
  ],
  "_case_id": "1958_138",
  "_label": 0,
  "_text_length": 13723,
  "_extracted_at": "2026-02-08T22:33:55.922473"
}