{
  "metadata": {
    "case_name": "Plaintiff-Appellant v. Sahebzadi Anwar Begum & Ors.",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "B. P. Sinha",
      "J. L. Kapur",
      "Jafer Imam"
    ],
    "case_number": "Civil Appeal No. 695 of 1957",
    "date_of_judgment": "1958-05-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plaintiff instituted suit on April 12, 1957 against third respondent (Prince, second son of Nizam of Hyderabad) alleging she is his lawfully married wife via Shia Nikah on October 19, 1948, with three daughters aged 8, 7, 5; prenuptial agreement for Rs. 2,000 per month Kharch-e-pandan stopped since January 1953.",
      "type": "material",
      "date": "1957-04-12",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Plaintiff prayed for declarations: (1) she is legally-wedded wife Mankuwa of defendant; (2) entitled to Rs. 2,000 per month Kharch-e-pandan. No claim for arrears.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Prince filed written statement on April 22, 1957, admitting entire claim of plaintiff including marriage, children, and entitlement to allowance.",
      "type": "admitted",
      "date": "1957-04-22",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "On April 22, 1957, Sahebzadi Anwar Begum (respondent 1, claiming lawful wife married December 1952) and her minor son Prince Shahainat Ali Khan (respondent 2) applied under O.1 r.10 CPC to be added as defendants 2 and 3.",
      "type": "procedural",
      "date": "1957-04-22",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Interveners alleged plaintiff stated defendant suppressing marriage facts so family concludes she is not Nikah wife; interveners interested in denying plaintiff's marriage and rights; suit result of collusion to affect their relationship and deprive estate interests.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Plaintiff opposed intervention on June 15, 1957: rights of interveners remote/contingent; no serious controversy due to defendant's admission; interveners not necessary/proper parties; judgment not conclusive against them due to collusion allegation; application mala fide inspired by strong force.",
      "type": "procedural",
      "date": "1957-06-15",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Prince opposed intervention: admitted respondent 1 as wife (married Dec 1952 after plaintiff), respondent 2 as son; knew of plaintiff's prior marriage/children; Muslim right to four wives; no effect on their rights; denied collusion; application to prolong litigation, inspired by Nizam (defendant's father).",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Trial court (Second Additional Judge, City Civil Court, Hyderabad) on July 6, 1957 allowed intervention, added respondents 1 and 2 as defendants; noted possible collusion, discretionary relief under S.42 Specific Relief Act, s.43 binding on interveners, necessary for effectual adjudication.",
      "type": "procedural",
      "date": "1957-07-06",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Plaintiff filed Civil Revision Petition No. 1112 of 1957 in Andhra Pradesh High Court; dismissed on September 17, 1957; HC held interveners interested in denying status, proper parties to avoid multiplicity, necessary under O.1 r.10(2).",
      "type": "procedural",
      "date": "1957-09-17",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Supreme Court granted special leave to appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On April 27, 1957, Barkat Ali (Mujtahid who solemnized marriage) examined, supported plaintiff's claim, proved documents; not cross-examined by defendant.",
      "type": "background",
      "date": "1957-04-27",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "True construction of sub-rule 2 of rule 10 of Order 1 of the Code of Civil Procedure, and its application: whether presence of respondents 1 and 2 necessary to effectually and completely adjudicate the suit.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether courts below exceeded jurisdiction or improperly exercised discretion in adding interveners as parties.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Effect of declaration under S.42 Specific Relief Act and binding nature under S.43 on non-parties like wife and son.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Interveners not necessary or proper parties; no present interest in estate (mere expectancy); no direct interest, only indirect/commercial; suit no controversy due to admission; judgment not binding on interveners alleging collusion; remote prejudice.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "O.1 r.10(2) CPC (narrower view: Moser v. Marsden); no jurisdiction to add."
    },
    {
      "id": "pa2",
      "text": "Court not bound to grant declaration on admission; but no need for interveners as plaintiff chooses defendants.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "S.42 Specific Relief Act (discretionary); O.12 r.6 CPC proviso; S.58 Evidence Act."
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Interveners directly interested in denying plaintiff's status as wife (affects family, estate shares); suit clears cloud on status affecting children; collusion between plaintiff and Prince; necessary to unravel mysteries, avoid multiplicity.",
      "supporting_facts": [
        "f1",
        "f5",
        "f7"
      ],
      "legal_basis": "O.1 r.10(2) CPC (wider view); S.42,43 Specific Relief Act (declaration binding on them as claiming through Prince); S.41 Evidence Act."
    },
    {
      "id": "ra2",
      "text": "Muslim law allows 4 wives but status declaration affects inheritance shares of wife/son.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Mohammedan law."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Addition of parties under O.1 r.10(2) is matter of judicial discretion, not initial jurisdiction; in status declaration suits, relax direct interest rule if aids adjudication; S.43 binds parties and those claiming through them (including privies in blood/estate).",
      "addresses_issue": "i1",
      "key_observation": "Declaration of status affects generations; interveners proper parties as interested to deny."
    },
    {
      "id": "cr2",
      "text": "Court not bound by admission in discretionary declaration; must ensure real controversy.",
      "addresses_issue": "i3",
      "key_observation": "Status adjudication serious, affects family beyond parties."
    },
    {
      "id": "cr3",
      "text": "Dissent (Imam J.): No cause of action against interveners; mere expectancy no direct interest; no locus standi to allege collusion; adding alters suit, introduces inheritance issues prematurely; speculative prejudice.",
      "addresses_issue": "i1",
      "key_observation": "Plaintiff entitled to choose defendants; no necessity under O.1 r.10(2)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Courts below did not exceed power or improperly exercise discretion in adding respondents 1 and 2; appeal dismissed (majority).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "In status declaration suits, presence of family members interested to deny may be necessary for effectual adjudication.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "S.43 Specific Relief Act binds parties and those claiming through them (privies in estate/blood), distinct from res judicata.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Moser v. Marsden",
      "citation": "1892 1 Ch. 487",
      "treatment": "followed",
      "relevance": "Narrower view: only direct legal interest, not indirect/commercial."
    },
    {
      "case_name": "McCheane v. Gyles",
      "citation": "1902 1 Ch. 911",
      "treatment": "followed",
      "relevance": "Narrower view on adding parties."
    },
    {
      "case_name": "Sri Mahant Prayaga Doss Jee Varu v. Board of Commissioners for Hindu Religious Endowments, Madras",
      "citation": "1926 I.L.R. 50 Mad. 34",
      "treatment": "referred",
      "relevance": "Narrower view in India."
    },
    {
      "case_name": "Dollfus Mieg Et Compagnie S.A. v. Bank of England",
      "citation": "1950 2 All E.R. 605",
      "treatment": "referred",
      "relevance": "Wider view."
    },
    {
      "case_name": "Vydianadayyan v. Sitaramayyan",
      "citation": "1881 I.L.R. 5 Mad. 52",
      "treatment": "referred",
      "relevance": "Wider view: avoid conflicting decisions."
    },
    {
      "case_name": "Secy. of State v. M. Murugesa Mudaliar",
      "citation": "A.I.R. 1929 Mad. 443",
      "treatment": "referred",
      "relevance": "Adding government in constitutional challenge."
    },
    {
      "case_name": "United Provinces v. Mst. Atiqa Begum",
      "citation": "1940 F.C.R. 110",
      "treatment": "referred",
      "relevance": "Jurisdiction to add state."
    },
    {
      "case_name": "Syed Ashgar Reza Khan v. Syed Mahomed Mehdi Hossein Khan",
      "citation": "1903 L.R. 30 I.A. 71",
      "treatment": "distinguished",
      "relevance": "Res judicata not binding non-privies."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order 1 Rule 10",
        "Order 1 Rule 1",
        "Order 1 Rule 3",
        "Order 12 Rule 6",
        "Order 8 Rule 5",
        "Section 115"
      ],
      "relevance": "Addition/substitution of parties necessary for effectual adjudication; admissions not conclusive."
    },
    {
      "name": "Specific Relief Act",
      "sections": [
        "Section 42",
        "Section 43"
      ],
      "relevance": "Discretionary declaration of status/legal character; binding on parties and those claiming through them."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "Section 41",
        "Section 58"
      ],
      "relevance": "Judgments in rem; admitted facts need not be proved unless court requires."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against orders allowing intervention of respondents 1 and 2 as defendants dismissed by majority (Sinha and Kapur JJ.); Imam J. dissented, would allow appeal and set aside orders. Costs to abide ultimate result of litigation.",
    "relief_granted": "None; intervention upheld.",
    "costs": "Costs abide the ultimate result of the litigation, to be disposed by trial court."
  },
  "key_quotes": [
    {
      "text": "\"the presence of the interveners would help the court in unravelling the mysteries of the litigation\"",
      "speaker": "lower_court",
      "significance": "Trial court's reason for allowing intervention."
    },
    {
      "text": "\"When so much sanctity is attached to the status of marriage, it would indeed be strange that persons who are so intimately related... should be denied the opportunity of contesting the status\"",
      "speaker": "lower_court",
      "significance": "High Court's view on proper parties."
    },
    {
      "text": "\"a declaration granted in respect of a legal character or status in favour of a person is meant to bind not only persons actually parties to the litigation, but also persons claiming through them\"",
      "speaker": "court",
      "significance": "Majority's interpretation of S.43 Specific Relief Act."
    },
    {
      "text": "\"the plaintiff is entitled to choose as defendants against whom he has a cause of action and he should not be burdened with the task of meeting a party against whom he has no cause of action\"",
      "speaker": "court",
      "significance": "Dissenting opinion on locus standi."
    }
  ],
  "_case_id": "1958_103",
  "_label": 0,
  "_text_length": 61936,
  "_extracted_at": "2026-02-08T22:34:03.481541"
}