{
  "metadata": {
    "case_name": "Landlord (Appellant) v. Tenant (Respondent)",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Civil Appeal No. 153 of 1955",
    "date_of_judgment": "1958-12-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In 1938 the respondent took on rent the accommodation in dispute which is termed a tal on a monthly agreed rent of Rs. 21-4 as. and was using the same for the purpose of stacking timber. A portion of it was a companned godown which had three walls and a kucha roof.",
      "type": "background",
      "date": "1938",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In January 1949 the appellant constructed anew a big godown 80 x 25 x 11 feet according to the instructions of the respondent and expended a fairly large sum of money on it.",
      "type": "disputed",
      "date": "1949-01",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "On January 28, 1950, the appellant made an application to the House Allotment Officer under s. 3-A of the United Provinces Temporary Control of Rent and Eviction Act, 1947 (U.P. III of 1947) for the fixation of reasonable annual rent of the accommodation in dispute, alleging entitlement to a monthly rent of Rs. 165.",
      "type": "procedural",
      "date": "1950-01-28",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The House Allotment Officer fixed the rent at Rs. 35 per mensem on February 18, 1950, which on review was raised on May 25, 1950, to Rs. 40 per mensem. He held that the accommodation was not a newly constructed accommodation as the respondent had been a tenant from 1938 and determined the increase on the basis of the building added by the new construction.",
      "type": "procedural",
      "date": "1950-02-18",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "The appellant instituted Suit No. 19 of 1950 on the ground of inadequacy of the reasonable annual rent under s. 5(4) of the Act, alleging construction of ferro-concrete roof 80 x 25 feet at the request of the respondent who agreed to pay enhanced rent, claiming proper rent not less than Rs. 115 per mensem.",
      "type": "procedural",
      "date": "1950",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Defence: No construction at the request of the respondent but undertaken to put up another storey; no new construction of accommodation in possession after June 30, 1946; ferro-concrete roof did not benefit, space diminished due to pillars and lowering of roof; suit not maintainable under the Act and no suit could be filed after order of House Allotment Officer.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Relevant issues: Whether the suit is not maintainable in view of provisions of Act No. 3 of 1947; whether suit after fixation by House Allotment Officer is not maintainable; what should be reasonable rent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Additional Civil Judge, Mathura, on March 31, 1951: Suit not barred; maintainable against HAO order; newly constructed accommodation bigger and more spacious; increased rent to Rs. 55-8-0.",
      "type": "procedural",
      "date": "1951-03-31",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Allahabad High Court in Civil Revision No. 540 of 1951 dated August 30, 1954: If new construction after June 30, 1946, suit maintainable; construction on upper storey new but not for respondent's accommodation; s.3A not applicable; no suit for enhancement of agreed rent; revision allowed, suit dismissed.",
      "type": "procedural",
      "date": "1954-08-30",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court could, in revision under s.115 CPC, interfere with the trial court's decision on the date of construction of the accommodation, which determines the jurisdiction to entertain the suit under s.5(4) of the Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the accommodation was newly constructed after June 30, 1946, so as to allow fixation of reasonable annual rent under s.3A and suit under s.5(4).",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Scheme of the U.P. Temporary Control of Rent and Eviction Act, 1947, particularly definitions of reasonable annual rent in s.2(f), determination under s.3A, and suits under s.5(4).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "It was within the jurisdiction of the Additional Civil Judge to decide the question of the date of construction and the High Court had no power to interfere merely because in its opinion the decision was erroneous; question merely one of facts unconnected with jurisdiction.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s.115 CPC"
    },
    {
      "id": "pa2",
      "text": "House Allotment Officer having decided in favour the question of date of construction under s.3A, right to bring suit established; High Court could not go into correctness in revision.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s.3A of the Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Decision of the court as to date of construction was a jurisdictional fact; unless accommodation held newly constructed after June 30, 1946, appellant bound by agreed rent, no right of suit under s.5(4), court no jurisdiction.",
      "supporting_facts": [
        "f1",
        "f6",
        "f9"
      ],
      "legal_basis": "s.5(4), s.2(f), s.3A of the Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Explained scheme of the Act: Reasonable annual rent for pre-July 1, 1946 construction based on specific formulas; for post-June 30, 1946 or certain unassessed, determined under s.3A by District Magistrate (House Allotment Officer). Rent fixed under s.3A subject to suit under s.5(4). Landlord can sue only for inadequacy of reasonable rent, not to enhance agreed rent.",
      "addresses_issue": "i3",
      "key_observation": "Maintainability of suit depends on jurisdictional fact of date of construction after June 30, 1946."
    },
    {
      "id": "cr2",
      "text": "Trial court aware maintainability depended on date; held portion newly replaced as new accommodation, no question of agreed rent.",
      "addresses_issue": "i2",
      "key_observation": "Wrong decision on jurisdictional fact confers jurisdiction not possessed."
    },
    {
      "id": "cr3",
      "text": "High Court correctly held: If constructed before June 30, 1946, suit incompetent; post that date, maintainable. For respondent's occupation, not new construction.",
      "addresses_issue": "i1",
      "key_observation": "Jurisdictional error allows revision under s.115 CPC."
    },
    {
      "id": "cr4",
      "text": "Distinguished cases: Tribunals with jurisdiction to decide preliminary facts vs. where facts must exist independently. Here, civil court jurisdiction depends on existence of reasonable rent as defined, including post-1946 construction.",
      "addresses_issue": "i1",
      "key_observation": "Erroneous finding on jurisdictional fact allows High Court interference per Privy Council precedents."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court could interfere in revision under s.115 CPC where trial court erroneously decided jurisdictional fact (date of construction), assuming jurisdiction not vested.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Landlord's suit under s.5(4) maintainable only if challenging inadequacy of reasonable annual rent for post-June 30, 1946 construction; cannot enhance agreed rent for pre-1946.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Queen v. Commissioner for Special Purposes of the Income Tax",
      "citation": "1888 21 Q.B.D. 313",
      "treatment": "followed",
      "relevance": "Distinction between tribunals entrusted to decide preliminary jurisdictional facts vs. where facts must independently exist."
    },
    {
      "case_name": "Joy Chand Lal Babu v. Kamalaksha Chaudhury",
      "citation": "1949 L.R. 76 I.A. 131",
      "treatment": "followed",
      "relevance": "High Court can interfere in revision if subordinate court exercises jurisdiction not vested due to erroneous decision."
    },
    {
      "case_name": "Keshardeo Chamria v. Radha Kissen Chamria",
      "citation": "1953 S.C.R. 136",
      "treatment": "followed",
      "relevance": "s.115 CPC applies to jurisdictional matters: irregular/non-exercise or illegal assumption of jurisdiction."
    },
    {
      "case_name": "Venkatagiri Ayyangar v. Hindu Religious Endowment Board, Madras",
      "citation": "1949 L.R. 76 I.A. 67",
      "treatment": "referred",
      "relevance": "Scope of s.115(c) CPC: illegal exercise or material irregularity."
    },
    {
      "case_name": "Rai Brij Raj Krishna v. S.K. Shaw and Bros.",
      "citation": "1951 S.C.R. 145",
      "treatment": "distinguished",
      "relevance": "Adjudication by judge with jurisdiction conclusive if no defect on face; inapplicable here due to statutory limits on civil court jurisdiction."
    }
  ],
  "statutes_cited": [
    {
      "name": "United Provinces Temporary Control of Rent and Eviction Act, 1947 (U.P. Act III of 1947)",
      "sections": [
        "s.2(a)",
        "s.2(f)",
        "s.3A",
        "s.5(1)",
        "s.5(4)",
        "s.6"
      ],
      "relevance": "Defines accommodation, reasonable annual rent (distinguishing pre/post 1946 construction), procedure for fixation by DM/HAO, suits for inadequacy/excess."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "s.115"
      ],
      "relevance": "High Court's revisional jurisdiction to correct jurisdictional errors, illegal assumption/non-exercise of jurisdiction."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld the Allahabad High Court's decision allowing the revision and dismissing the suit, holding that the High Court correctly interfered under s.115 CPC as the trial court erroneously assumed jurisdiction by wrongly deciding the jurisdictional fact of new construction after June 30, 1946.",
    "relief_granted": "None; suit dismissed, tenant liable only for agreed rent.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"if the erroneous decision results in the subordinate court exercising a jurisdiction not vested in it by law, or failing to exercise a jurisdiction so vested, a case for revision arises under sub-s. (a) or sub-s. (b)\"",
      "speaker": "court",
      "significance": "Explains scope of High Court's revisional power under s.115 CPC."
    },
    {
      "text": "\"the question for determination was whether the accommodation had been constructed before or after June 30, 1946, and that if it was constructed before that date the suit was incompetent and if after, the suit would lie.\"",
      "speaker": "court",
      "significance": "High Court's correct approach to jurisdictional fact."
    },
    {
      "text": "\"portion of the building in suit which has been newly replaced must be treated as a new accommodation, and hence this Court can determine its rent under the provisions of s. 5(4).\"",
      "speaker": "lower_court",
      "significance": "Trial court's erroneous assumption of jurisdiction."
    }
  ],
  "_case_id": "1958_37",
  "_label": 0,
  "_text_length": 26661,
  "_extracted_at": "2026-02-08T22:17:01.975156"
}