{
  "metadata": {
    "case_name": "Assessee v. Income-tax Authorities",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar, J."
    ],
    "case_number": "Appeals by special leave against I.T.A. Nos. 3489, 3490 and 3491 of 1952-53",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant carries on business in arrack and runs a lorry.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For assessment year 1945-46, Income-tax Officer found income chargeable to tax as Rs. 54,600.",
      "type": "material",
      "date": "1945-46",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "For assessment year 1946-47, Income-tax Officer found income chargeable as Rs. 27,500.",
      "type": "material",
      "date": "1946-47",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "For assessment year 1947-48, Income-tax Officer found income chargeable as Rs. 54,500.",
      "type": "material",
      "date": "1947-48",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "These amounts appear in the account books of a firm of which the appellant is a partner as credits from him.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant's explanation: Father's profits of about Rs. 80,000 in arrack business; father died in 1936, entrusted amount to assessee's aunt; aunt died in 1944 and handed amount to appellant.",
      "type": "disputed",
      "date": "1936 / 1944",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Balance of about Rs. 42,000 represented profits earned in partnership concern in arrack business during 1938-39 to 1944-45; partners: Ediga Thayappa (benamidar for appellant) and M. Govindaswamy Mudaliar.",
      "type": "disputed",
      "date": "1938-39 to 1944-45",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Income-tax Officer rejected both explanations and held amounts represented concealed income, imposed tax thereon.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellate Assistant Commissioner agreed with Income-tax Officer after investigation.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Income-tax Appellate Tribunal by judgment dated January 29, 1953, confirmed decision: rejected gift of Rs. 80,000 as untrue; no evidence Ediga Thayappa was benamidar, firm registered under section 26A with Thayappa's name only, no proof of profit shares paid to assessee over six years, no remuneration to Thayappa, rejected evidence of Ediga Narashiah and Govindaswamy Mudaliar.",
      "type": "procedural",
      "date": "1953-01-29",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Tribunal held amounts as undisclosed income.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellant applied for reference to High Court under section 66(2), dismissed; no appeal against High Court order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Assuming assessee failed to establish explanations for source of amounts, does it follow as a matter of law that amounts were income received or accrued during previous year, or was it duty of Department to adduce evidence showing source and why treated as concealed income?",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether Income-tax Officer entitled to infer amounts are assessable income upon rejection of assessee's explanations.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Even if explanations failed, it does not follow amounts were income of previous year; Department must prove source and why concealed income; absence of such evidence makes finding erroneous.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7",
        "f10",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Whether receipt is income depends on facts and circumstances; here receipts in firm account books where appellant partner; upon rejection of explanations (gift Rs.80,000 and business profits Rs.42,000), Income-tax Officer entitled to hold concealed income.",
      "addresses_issue": "i1",
      "key_observation": "Ample authority that where assessee fails to prove source and nature of cash received, Income-tax Officer may infer assessable nature."
    },
    {
      "id": "cr2",
      "text": "Tribunal's conclusion amply warranted by facts; no ground to interfere.",
      "addresses_issue": "i2",
      "key_observation": "Points urged already taken in section 66(2) reference dismissed by High Court, final; not open to question Tribunal decision afresh under Article 136."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Income-tax Officer entitled to treat amounts as concealed income upon rejection of assessee's explanations for source.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No interference with Tribunal's finding; appeals dismissed.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dhakeswari Cotton Mills Ltd. v. Commissioner of Income-tax, West Bengal",
      "citation": null,
      "treatment": "referred",
      "relevance": "Court has decided that appeal under Article 136 against Tribunal decision possible, but here High Court reference already final."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "Section 26A",
        "Section 66(2)"
      ],
      "relevance": "Firm registered under 26A with Thayappa's name; reference application under 66(2) dismissed."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals by special leave against Income-tax Appellate Tribunal's decision dated January 29, 1953, dismissed; Tribunal's finding that amounts are undisclosed income upheld as explanations rejected and inference of concealed income warranted.",
    "relief_granted": null,
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"When both these explanations were rejected, as they have been it was clearly open to the Income-tax Officer to hold that the income must be concealed income.\"",
      "speaker": "court",
      "significance": "Core reasoning justifying inference of concealed income."
    },
    {
      "text": "\"There is ample authority for the position that where an assessee fails to prove satisfactorily the source and nature of certain amount of cash received during the accounting year, the Income-tax Officer is entitled to draw the inference that the receipts are of an assessable nature.\"",
      "speaker": "court",
      "significance": "Legal principle applied to uphold Tribunal."
    }
  ],
  "_case_id": "1958_135",
  "_label": 0,
  "_text_length": 6542,
  "_extracted_at": "2026-02-08T22:33:53.817023"
}