{
  "metadata": {
    "case_name": "Heirs of Deokinand v. Successors of Mahant Tokhnarain Puri",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO J."
    ],
    "case_number": "Civil Appeal No. 239 of 1954",
    "date_of_judgment": "1958-05-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Deokinand, common ancestor of plaintiff-respondents 1 to 4 and proforma respondents 6 to 12, executed a document dated August 20, 1923, in favour of Mahant Tokhnarain Puri of Nadra, predecessor-in-interest of defendant 1, hypothecating eight annas milkiat share in mauza Lodipur, Mahimabigha, Tauze No. 4246 for Rs. 31,701 debt.",
      "type": "material",
      "date": "1923-08-20",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "There was a pre-existing thika lease dated April 21, 1922, in favour of Munshi Dodraj Lal alias Munshi Jatadhari Lal, for 9 years, under which Rs. 2,205 was taken as peshgi money without interest and rent fixed at Rs. 2,205.",
      "type": "background",
      "date": "1922-04-21",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Document provided for peshgi money of Rs. 31,701 (Rs. 29,496 at 1/2% per month interest + Rs. 2,205 without interest), annual rental Rs. 2,205 including revenue and cesses, for 15 years from 1331 Fasli to 1345 Fasli.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "During thikadari period, ijaradar to realize rent from thikadars, set off Rs. 1,769-12-0 towards interest, pay Rs. 435-4-0 as reserved rent to executant.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After thikadari expiry (1338 Fasli), ijaradar to take sir possession, appropriate produce towards interest, pay Rs. 435-4-0 rent to executant, no claim on increase in produce.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Previous mortgage bonds discharged by endorsement, amount set off against peshgi.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Term ends Jeth 1345 Fasli, executant to repay Rs. 31,701 in lump sum for redemption; if not, deed continues intact.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Plaintiff-respondents instituted Title Suit No. 4 of 1945 for redemption, rendition of accounts, recovery of surplus profits, claiming document as usufructuary mortgage.",
      "type": "procedural",
      "date": "1945",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Appellant pleaded document was lease, not mortgage; if mortgage, anomalous, no statutory accounts; if usufructuary, s.77 TPA applies exempting accounts.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Subordinate Judge, Gaya (judgment/decree Dec 18, 1945): document usufructuary mortgage, s.77 TPA applies, no accounts; conditional decree for possession on deposit Rs. 26,839-7-0 within 6 months.",
      "type": "procedural",
      "date": "1945-12-18",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Patna High Court (Appeal from Original Decree No. 188 of 1945, judgment/decree Dec 12, 1950): agreed usufructuary mortgage but s.77 not apply; set aside lower decree, preliminary decree for redemption/sale, directed accounts.",
      "type": "procedural",
      "date": "1950-12-12",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appeal to Supreme Court by certificate under Art. 133(1)(a) Constitution by second defendant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the document dated August 20, 1923 is a lease or a mortgage.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If a mortgage, whether it is a usufructuary mortgage or an anomalous mortgage.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether s.77 of the Transfer of Property Act applies, exempting the mortgagee from liability to render accounts under s.76(g) and (h).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The document was a lease, not a mortgage, so suit for redemption not maintainable.",
      "supporting_facts": [
        "f1",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Intention of parties; Ghosh on Mortgages"
    },
    {
      "id": "pa2",
      "text": "If mortgage, it is anomalous, governed by contract terms under s.98 TPA, no statutory accounts under s.76.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f7"
      ],
      "legal_basis": "Section 98 Transfer of Property Act"
    },
    {
      "id": "pa3",
      "text": "Even if usufructuary mortgage, s.77 TPA applies as mortgagee authorized to take receipts in lieu of interest, no liability for accounts.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Sections 76(g)(h), 77 Transfer of Property Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Document is usufructuary mortgage, not lease.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "s.77 TPA does not apply because mortgagee had to pay Rs. 435-4-0 rent to mortgagor, so not authorized to take entire receipts in lieu of interest; part receipts to mortgagor means must account.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Sections 76(g)(h), 77 Transfer of Property Act"
    },
    {
      "id": "ra3",
      "text": "Mention of specified interest rate indicates mortgagee to take only part receipts sufficient for interest, balance to mortgagor.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Intention of parties determines nature: debt with land security for redemption makes it mortgage whatever called. Document terms show debt, security, interest appropriation, redemption on repayment.",
      "addresses_issue": "i1",
      "key_observation": "Executant requested 'usufructuary mortgage deed'; explicitly mortgaged property in security of peshgi; not mere lease."
    },
    {
      "id": "cr2",
      "text": "Document creates usufructuary mortgage; even if anomalous, no difference as contract terms govern.",
      "addresses_issue": "i2",
      "key_observation": "Relationship creditor-debtor with property security."
    },
    {
      "id": "cr3",
      "text": "s.77 TPA applies: contract allows mortgagee to appropriate entire receipts in lieu of interest; fixed Rs.435-4-0 is personal unconditional obligation, not dependent on receipts; mortgagor no claim on produce increase.",
      "addresses_issue": "i3",
      "key_observation": "Not division of receipts, but full appropriation vs. fixed payment."
    },
    {
      "id": "cr4",
      "text": "Mention of interest rate does not negate s.77; for estimation; Privy Council in Pandit Bachchu Lal held similar deed under s.77 despite rate mentioned.",
      "addresses_issue": "i3",
      "key_observation": "Clear intention overrides."
    },
    {
      "id": "cr5",
      "text": "Even under s.98 for anomalous mortgage, contract terms exempt accounts as mortgagor agreed no claim on excess produce.",
      "addresses_issue": "i3",
      "key_observation": "Same result."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The document is a mortgage and not a lease.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "s.77 Transfer of Property Act applies; mortgagee not liable to render accounts under s.76(g)(h).",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pandit Bachchu Lal v. Chaudhri Syed Mohammad Mah",
      "citation": "(1933) 37 C.W.N. 457",
      "treatment": "followed",
      "relevance": "Privy Council held mortgage deed with interest rate mentioned contained contract under s.77 TPA for receipts in lieu of interest."
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act",
      "sections": [
        "76(g)",
        "76(h)",
        "77",
        "98"
      ],
      "relevance": "s.76(g)(h) requires accounts and surplus debit; s.77 excepts where contract for receipts in lieu of interest; s.98 governs anomalous mortgages by contract."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(a)"
      ],
      "relevance": "Certificate for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, set aside Patna High Court decree, restored Subordinate Judge's decree granting conditional possession on deposit without accounts.",
    "relief_granted": "Restoration of Subordinate Judge's conditional decree for possession on deposit of Rs. 26,839-7-0 within six months.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the intention of the parties must be looked into and that once you get a debt with security of land for its redemption, then the arrangement is a mortgage by whatever name it is called\"",
      "speaker": "court",
      "significance": "Guiding rule to determine mortgage vs lease."
    },
    {
      "text": "\"In security of the payment of the peshgi money with or without interest mentioned in this ijara deed, I, the executant, have mortgaged, hypothecated, encumbered and made liable the ijara property.\"",
      "speaker": "court",
      "significance": "Unambiguous declaration of mortgage nature in document."
    },
    {
      "text": "\"the mortgagee was under a personal obligation to pay Rs. 435-4-0 to the mortgagor and had a right to take the entire receipts from the land in lieu of interest.\"",
      "speaker": "court",
      "significance": "Key to applying s.77 TPA."
    }
  ],
  "_case_id": "1958_121",
  "_label": 1,
  "_text_length": 27591,
  "_extracted_at": "2026-02-08T22:33:58.717397"
}