{
  "metadata": {
    "case_name": "Appellant v. State of Punjab",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 426 of 1958",
    "date_of_judgment": "1958-12-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was appointed to the Indian Police Service on October 1, 1949, and posted to the State of Punjab.",
      "type": "background",
      "date": "1949-10-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant held charge as Superintendent of Police in various districts but was reverted as Assistant Superintendent of Police in August 1957.",
      "type": "background",
      "date": "1957-08",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant was posted to Dharamsala in March 1958.",
      "type": "background",
      "date": "1958-03",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In March 1958, appellant was informed that it was proposed to take action against him under r. 5 of the All-India Services (Discipline and Appeal) Rules, 1955.",
      "type": "procedural",
      "date": "1958-03",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant was placed under suspension under r. 7 of the Rules pending disciplinary proceedings.",
      "type": "procedural",
      "date": "1958",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Shri K. L. Bhudiraja was appointed enquiry officer to hold the departmental enquiry against appellant.",
      "type": "procedural",
      "date": "1958",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Notice was issued to appellant by the Enquiry Officer in July 1958.",
      "type": "procedural",
      "date": "1958-07",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant made an application under Art. 226 of the Constitution before the Punjab High Court challenging the constitutionality of the All-India Services Act, 1951 and the legality of the enquiry.",
      "type": "procedural",
      "date": "1958-07",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Punjab High Court dismissed the application on July 30, 1958, in Civil Writ Application No. 732 of 1958.",
      "type": "procedural",
      "date": "1958-07-30",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Punjab High Court dismissed appellant's application for certificate to appeal to Supreme Court on July 31, 1958.",
      "type": "procedural",
      "date": "1958-07-31",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Supreme Court granted special leave to appeal.",
      "type": "procedural",
      "date": "1958",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "President passed Constitution (Removal of Difficulties) Order No. II on January 26, 1950, adapting Art. 312 by omitting the clause requiring Council of States resolution.",
      "type": "background",
      "date": "1950-01-26",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Order No. II continued until both Houses of Parliament constituted and summoned for first session.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "All-India Services Act, 1951 (LXI of 1951) enacted by provisional Parliament.",
      "type": "background",
      "date": "1951",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "All-India Services (Discipline and Appeal) Rules, 1955 framed under s.3 of the Act.",
      "type": "background",
      "date": "1955",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the President's adaptation in Art. 312 by Constitution (Removal of Difficulties) Order No. II of 1950 was in excess of power under Art. 392.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether provisional Parliament was competent to enact the All-India Services Act, 1951 without compliance with condition precedent under Art. 312.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the Rules of 1955 were repugnant to Art. 312 as originally enacted after the Order ceased.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether Art. 312 mandates Parliament to regulate recruitment and conditions of service without delegation to Central Government, making s.3 invalid.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether delegation under s.3 of the Act was excessive.",
      "framed_by": "petitioner"
    },
    {
      "id": "i6",
      "text": "Whether Punjab Government had authority to institute proceedings under the Rules.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Amendment by President in Art. 312 under Art. 392 excessive as it omitted clause requiring Council of States resolution; proper adaptation would substitute 'provisional Parliament'.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Art. 392, Sankari Prasad Singh Deo v. Union of India"
    },
    {
      "id": "pa2",
      "text": "Provisional Parliament not competent to enact Act in 1951 without condition precedent of resolution under Art. 312.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Art. 312"
    },
    {
      "id": "pa3",
      "text": "Rules promulgated in 1955 bad as repugnant to Art. 312 which reverted to original form without Council of States resolution.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Art. 312"
    },
    {
      "id": "pa4",
      "text": "Art. 312 lays mandate on Parliament to make law itself; cannot delegate to Central Government under s.3.",
      "supporting_facts": [],
      "legal_basis": "Art. 312"
    },
    {
      "id": "pa5",
      "text": "Delegation under s.3 excessive as Act lays no policy or standard.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Delhi Laws Act case; words in Arts. 138, 139, 148 vs. 173, 293"
    },
    {
      "id": "pa6",
      "text": "Punjab Government has no authority to institute proceedings as charges serious, likely leading to dismissal etc., which only Central Government can impose.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Rules 3,4,5"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "President's power under Art. 392 wide, allows adaptation by omission; omission of clause in Art. 312 valid as necessary for transition.",
      "addresses_issue": "i1",
      "key_observation": "Adaptation left to President's discretion whether by modification, addition or omission."
    },
    {
      "id": "cr2",
      "text": "Once adaptation valid, provisional Parliament competent to pass Act without resolution; Rules valid as deriving from Act, unaffected by Art. 312 reverting.",
      "addresses_issue": "i2",
      "key_observation": "Reappearance of words in Art. 312 has nothing to do with vires of Rules."
    },
    {
      "id": "cr3",
      "text": "Art. 312 does not prohibit delegation; regulation requires numerous rules changeable per exigencies, not all by Parliament.",
      "addresses_issue": "i4",
      "key_observation": "Words 'Parliament may by law provide' do not exclude delegation."
    },
    {
      "id": "cr4",
      "text": "No excessive delegation: s.4 adopts existing rules as policy/standard; s.3 requires consultation with States, laying before Parliament with modification power.",
      "addresses_issue": "i5",
      "key_observation": "Parliament keeps vigilance and control over delegate."
    },
    {
      "id": "cr5",
      "text": "Punjab Government, as government under which appellant serving, authorized to institute enquiry under r.5; Central Government enters post-enquiry if major penalty proposed.",
      "addresses_issue": "i6",
      "key_observation": "Cannot postulate punishment at outset; r.5 contemplates State Government instituting for officers serving in connection with State affairs."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "President's adaptation of Art. 312 under Art. 392 valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Provisional Parliament competent to enact All-India Services Act, 1951.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Rules of 1955 valid and not repugnant to Art. 312.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Delegation under s.3 of Act permitted by Art. 312.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "No excessive delegation in s.3; s.4 incorporates existing rules as policy.",
      "resolves_issue": "i5",
      "in_favor_of": "respondent"
    },
    {
      "id": "h6",
      "text": "Punjab Government has authority to institute enquiry under Rules.",
      "resolves_issue": "i6",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sankari Prasad Singh Deo v. Union of India and State of Bihar",
      "citation": "1952 S.C.R. 89",
      "treatment": "followed",
      "relevance": "Art. 392 widely expressed; adaptation in Art. 368 left special majority untouched, but does not limit President's power."
    },
    {
      "case_name": "Re The Delhi Laws Act, 1912",
      "citation": "1951 S.C.R. 747",
      "treatment": "followed",
      "relevance": "Legislature competent to delegate rule-making; essential function is policy determination."
    },
    {
      "case_name": "Rajnarain Singh v. The Chairman, Patna Administration Committee, Patna",
      "citation": "1955 1 S.C.R. 290",
      "treatment": "followed",
      "relevance": "Delegation can authorize executive to modify law but not essential features."
    }
  ],
  "statutes_cited": [
    {
      "name": "All-India Services Act, 1951 (LXI of 1951)",
      "sections": [
        "s. 3",
        "s. 4"
      ],
      "relevance": "Empowers Central Government to make rules after consultation; adopts existing rules; rules laid before Parliament."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 312",
        "Art. 392",
        "Art. 379",
        "Art. 226",
        "Art. 311",
        "Art. 245",
        "Art. 138",
        "Art. 139",
        "Art. 148",
        "Art. 173",
        "Art. 293"
      ],
      "relevance": "Art. 312 enables law for all-India services; Art. 392 for adaptations; others compared for delegation scope."
    },
    {
      "name": "All-India Services (Discipline and Appeal) Rules, 1955",
      "sections": [
        "r. 3",
        "r. 4",
        "r. 5",
        "r. 7",
        "r. 2(b)"
      ],
      "relevance": "Govern penalties, authorities, procedure for enquiry and imposition; State Government institutes for serving officers."
    },
    {
      "name": "Constitution (Removal of Difficulties) Order No. II",
      "sections": [],
      "relevance": "Adapted Art. 312 by omitting Council of States resolution clause until Parliament constituted."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. All contentions challenging constitutionality of All-India Services Act, 1951, validity of Rules 1955, and authority of Punjab Government rejected. Disciplinary proceedings upheld.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The power given to the President under Art. 392 was very wide and it cannot be said that he could make the adaptation in one way and not in another.",
      "speaker": "court",
      "significance": "Upholds validity of President's omission in Art. 312."
    },
    {
      "text": "Regulation of recruitment and conditions of service requires numerous and varied rules, which may have to be changed from time to time as the exigencies of public service require.",
      "speaker": "court",
      "significance": "Justifies delegation under Art. 312."
    },
    {
      "text": "Parliament has in no way abdicated its authority, but is keeping strict vigilance and control over its delegate.",
      "speaker": "court",
      "significance": "Rejects excessive delegation argument."
    }
  ],
  "_case_id": "1958_127",
  "_label": 0,
  "_text_length": 25800,
  "_extracted_at": "2026-02-08T22:33:56.891499"
}