{
  "metadata": {
    "case_name": "Superintendent of Police (Retd.), Travancore v. Income Tax Officer",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar J."
    ],
    "case_number": "Civil Appeal No. 401 of 1956",
    "date_of_judgment": "1958-10-07"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant was a Superintendent of Police in the service of the former Travancore State and retired sometime in 1940.",
      "type": "background",
      "date": "1940",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "After retirement, the appellant spent his time studying Vedanta philosophy and expounding the same to disciples, including J. Levy of London, U.K., who visited Travancore regularly from England, stayed for months, and attended discourses.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On December 13, 1941, Levy transferred Rs. 2,41,103-11-3 from his Lloyds Bank account in Bombay to an account opened in the appellant's name in the same bank.",
      "type": "material",
      "date": "1941-12-13",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Levy made further deposits into the appellant's Lloyds Bank account in Bombay, totaling about Rs. 4,50,000 up to August 19, 1951.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellant transferred moneys from his Bombay account to his account in a bank at Trivandrum in Travancore from time to time.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Assessment years: 1122, 1123, 1124 Malayalam Era (Gregorian: August 17, 1945 to August 16, 1946; August 17, 1946 to August 16, 1947; August 17, 1947 to August 16, 1948).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "During relevant periods, Levy deposited Rs. 13,304, Rs. 29,948, and Rs. 19,983 respectively into appellant's Bombay account.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "During same periods, appellant obtained transfers of Rs. 81,200, Rs. 47,000, and Rs. 37,251 from Bombay to Trivandrum account.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Income-tax Officer, Trivandrum, assessed appellant on the transferred amounts (Rs. 81,200; 47,000; 37,251) as foreign income brought into Travancore.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellant appealed to Appellate Assistant Commissioner, who dismissed the consolidated appeal and confirmed ITO orders.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant appealed to Appellate Tribunal, which dismissed the appeal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Tribunal referred two questions to Travancore-Cochin High Court: (1) Whether receipts from John H. Levy constitute income taxable under Travancore Income-tax Act, 1121? (2) Whether materials for Tribunal to hold deposits by Levy represented income accrued outside Travancore?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court answered first question affirmatively (taxable); second in favor of appellant (income arose in Travancore from vocation there).",
      "type": "procedural",
      "date": "1956-03-08",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appellant obtained special leave to appeal to Supreme Court against High Court's answer to first question.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "No evidence that appellant conditioned teaching on payment.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Levy's affidavit: sums were gifts to mark esteem and affection; he benefited from appellant's teachings on Vedanta.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant was carrying on a vocation by teaching Vedanta philosophy.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the payments by Levy constitute profits or gains of the vocation and thus income taxable under the Travancore Income-tax Act, 1121.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the receipts from John H. Levy constitute income taxable under the Travancore Income-tax Act, 1121?",
      "framed_by": "lower_court"
    },
    {
      "id": "i4",
      "text": "Whether there are materials for the Tribunal to hold that the deposits into the assessee's bank account in Bombay by John H. Levy from 1941 represented income that accrued to the assessee outside Travancore State?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellant was not carrying on a vocation as teaching Vedanta was not organised, systematic, or with profit motive; it was religious practice without condition of payment.",
      "supporting_facts": [
        "f2",
        "f15"
      ],
      "legal_basis": "Section 10 of Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "Payments by Levy were purely personal gifts, not connected to teaching, as per Levy's affidavit stating they marked esteem and affection for no other reason.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "Principle on voluntary payments: taxable only if made because of office/vocation, not personal reasons"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant was carrying on vocation of teaching Vedanta, which produced income; deposits represent income from that vocation arising in Travancore.",
      "supporting_facts": [
        "f2",
        "f7",
        "f13"
      ],
      "legal_basis": "Travancore Income-tax Act, 1121 (identical to Indian Income-tax Act, 1922, s.10)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Teaching Vedanta is a vocation, akin to any teaching; no requirement for profit motive or organisation beyond continuity/system, both present here (regular disciples, Levy's visits).",
      "addresses_issue": "i1",
      "key_observation": "Motive of profit not essential; if activity produces income, it is taxable regardless of intention."
    },
    {
      "id": "cr2",
      "text": "Payments received by virtue of vocation: test is from recipient's standpoint, whether accrued by virtue of office/vocation; here, causa causans was teaching, as Levy benefited and visited regularly for it.",
      "addresses_issue": "i2",
      "key_observation": "Gifts prompted by esteem from teaching are remuneration, not personal; repeated payments align with visits."
    },
    {
      "id": "cr3",
      "text": "No exemption under s.4(3)(vii) as payments arose from exercise of vocation.",
      "addresses_issue": "i2",
      "key_observation": "Payments are income from vocation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant was carrying on a vocation of teaching Vedanta.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Payments by Levy constitute income (profits/gains) from the vocation, taxable under Travancore Income-tax Act, 1121.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Inland Revenue v. Incorporated Council of Law Reporting",
      "citation": "1888 3 Tax Cas. 105",
      "treatment": "followed",
      "relevance": "Profit motive not essential to carrying on trade/business/vocation; taxable if produces income."
    },
    {
      "case_name": "Stedeford v. Beloe",
      "citation": "1930 16 Tax Cas. 505; 1932 A.C. 388",
      "treatment": "distinguished",
      "relevance": "Pension not taxable absent office; not applicable as no profit motive required."
    },
    {
      "case_name": "Herbert v. McQuade",
      "citation": "1902 2 K.B. 631",
      "treatment": "followed",
      "relevance": "Test for voluntary payments: from recipient's standpoint, if by virtue of office/vocation."
    },
    {
      "case_name": "Inland Revenue v. Strong",
      "citation": "1878 1 Tax Cas. 207",
      "treatment": "referred",
      "relevance": "Voluntary payment taxable if accrues by virtue of office."
    },
    {
      "case_name": "Reed v. Seymour",
      "citation": "1926 1 K.B. 588; Seymour v. Reed 1927 A.C. 554",
      "treatment": "followed",
      "relevance": "Real question: personal gift or remuneration? If latter, taxable."
    },
    {
      "case_name": "Blakiston v. Cooper",
      "citation": "1909 A.C. 104",
      "treatment": "followed",
      "relevance": "Offerings to vicar as vicar (not personal) part of profits from office; causa causans is office."
    }
  ],
  "statutes_cited": [
    {
      "name": "Travancore Income-tax Act, 1121 (Malayalam Era)",
      "sections": [
        "Equivalent to Indian Income-tax Act, 1922 ss. 10, 4(3)(vii)"
      ],
      "relevance": "Tax on profits/gains of vocation; exemption if not from exercise of vocation"
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 10",
        "s. 4(3)(vii)"
      ],
      "relevance": "Provisions identical for purpose; tax on vocation profits; no exemption here"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upholds High Court's answer that receipts from Levy constitute taxable income from appellant's vocation of teaching Vedanta; no appeal on second question favoring appellant.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"it is not the motive of the person doing an act which decides whether the act done by him is the carrying on of a business, profession or vocation. If any business, profession or vocation in fact produces an income, that is taxable income\"",
      "speaker": "court",
      "significance": "Core principle: profit motive irrelevant if income produced"
    },
    {
      "text": "\"the test is whether, from the standpoint of the person who receives it, it accrues to him in virtue of his office if it does, it does not matter whether it was voluntary\"",
      "speaker": "court",
      "significance": "Test for taxability of voluntary payments"
    },
    {
      "text": "\"But is it in the nature of a personal gift or is it a remuneration? If the latter, it is subject to the tax if the former, it is not\"",
      "speaker": "court",
      "significance": "Distinguishes gifts from remuneration from vocation"
    },
    {
      "text": "\"the imparting of the teaching was the causa causans of the making of the gift it was not merely a causa sine qua non\"",
      "speaker": "court",
      "significance": "Links payments directly to teaching activity"
    }
  ],
  "_case_id": "1958_29",
  "_label": 0,
  "_text_length": 15902,
  "_extracted_at": "2026-02-10T19:20:30.881169"
}