{
  "metadata": {
    "case_name": "Galfu Sah v. State",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Justice K. Das"
    ],
    "case_number": "Criminal Appeal No. 183 of 1957",
    "date_of_judgment": "1958-05-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On May 16, 1954, in village Dharhara, district Darbhanga, a mob of about 40-50 persons, including 22 accused persons of whom appellant Galfu Sah (Gallu Sah) was one, formed an unlawful assembly with common objects to dismantle the hut of Mst. Rasmani, set fire to it, and commit assault if resisted.",
      "type": "material",
      "date": "1954-05-16",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Tetar Mian, chaukidar of village Dharhara, came to the village at about 10 a.m. to ascertain births and deaths, reached near Mst. Rasmani's hut, found the mob dismantling it, protested, and was hit by appellant with a lathi on the left thigh.",
      "type": "material",
      "date": "1954-05-16",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Tetar Mian raised alarm; Ramji, Nebi, and Munga Lal came there.",
      "type": "material",
      "date": "1954-05-16",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Appellant ordered Budi, another member of the unlawful assembly, to set fire to the hut of Mst. Rasmani and ordered assault on Ramji and Nebi; Budi set fire to the hut and it was burnt; some members chased and assaulted Ramji and Nebi.",
      "type": "disputed",
      "date": "1954-05-16",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Sessions Judge (2nd Assistant Sessions Judge, Darbhanga, Sessions Trial No. 52 of 1955, judgment Jan 23, 1956) found all accused formed unlawful assembly armed with weapons, came to hut with common object of dismantling it and committing assault on remonstrance; offences of rioting and hurt committed in prosecution thereof; arson was isolated act of some members, not common object of entire assembly; accepted evidence that appellant ordered Budi to set fire and Budi did so in consequence; convicted accused u/ss. 147, 148, 323 etc.; Budi u/s 436 IPC; appellant u/s 436 r/w s. 109 IPC.",
      "type": "procedural",
      "date": "1956-01-23",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Patna High Court (Criminal Appeal No. 34 of 1956, judgment Jan 21, 1957) found evidence against Budi for setting fire not satisfactory, acquitted Budi u/s 436 IPC; evidence established appellant gave order to set fire and hut was set on fire by one member or another of unlawful assembly; affirmed appellant's conviction and sentence u/s 436 r/w s. 109 IPC (4 years RI); affirmed convictions u/ss. 147, 323; set aside u/s 324 r/w s. 149 IPC.",
      "type": "procedural",
      "date": "1957-01-21",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Evidence against appellant from witnesses Tetar, Ramji, Nebi, Munga Lal: Tetar and Ramji did not mention Budi setting fire in first information; Nebi died before cross-examination; Munga Lal did not mention Budi to villagers; but consistent against appellant.",
      "type": "disputed",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant released on bail after serving sentence for u/ss. 147 and 323 IPC.",
      "type": "procedural",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Correctness of conviction of appellant Galfu Sah under s. 436 read with s. 109 IPC and propriety of sentence.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Evidence on which conviction based is same as given against Budi Sah, disbelieved for Budi, should not be believed against appellant.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No evidence that whoever set fire to hut did so in consequence of appellant's order, assuming order given; essential ingredient of abetment under s. 109 IPC is act committed in consequence of abetment.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "Sections 107, 109 IPC; Raja Khan v. Emperor"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Evidence against appellant reliable despite issues with evidence against Budi; hut set on fire in consequence of appellant's instigation by member of unlawful assembly.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Sections 107, 108, 109 IPC; Umadasi Dasi v. Emperor"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court gave good reasons why evidence not accepted for Budi (infirmities in witnesses' statements re Budi) but accepted for appellant (consistent against appellant); no violation of law or prudence.",
      "addresses_issue": "i1",
      "key_observation": "Witnesses Tetar, Ramji did not mention Budi in first info; Nebi not cross-examined; Munga Lal did not mention Budi; but no such infirmity re appellant."
    },
    {
      "id": "cr2",
      "text": "High Court satisfied: (1) appellant gave order to set fire; (2) hut set fire to by one member or another of unlawful assembly (though not common object). Person who set fire must have done so in consequence of appellant's order; unrealistic to hold otherwise.",
      "addresses_issue": "i1",
      "key_observation": "Findings imply act committed in consequence of instigation."
    },
    {
      "id": "cr3",
      "text": "Explains abetment: s. 107 (instigation etc.); s. 108 (abettor when offence committed); s. 109 (punished if act committed in consequence of abetment).",
      "addresses_issue": "i1",
      "key_observation": "Explanation to s. 109: committed in consequence of instigation."
    },
    {
      "id": "cr4",
      "text": "Distinguishes Raja Khan v. Emperor (general rule where principal acquitted, no abetment conviction; but exceptions per Umadasi Dasi v. Emperor where evidence shows offence committed in consequence of abetment).",
      "addresses_issue": "i1",
      "key_observation": "Here, evidence establishes offence committed in consequence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Conviction under s. 436 r/w s. 109 IPC not bad in law even if principal (Budi) acquitted, as evidence shows hut set on fire in consequence of appellant's instigation by member of unlawful assembly.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Sentence of 4 years RI does not err on side of severity.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Raja Khan v. Emperor",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "General rule: if principal offence not substantiated, no conviction for abetment; but exceptions exist."
    },
    {
      "case_name": "Umadasi Dasi v. Emperor",
      "citation": null,
      "treatment": "followed",
      "relevance": "Exceptions to general rule where evidence establishes offence abetted committed in consequence of abetment."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "436",
        "109",
        "107",
        "108",
        "147",
        "148",
        "323",
        "324",
        "149"
      ],
      "relevance": "Conviction under s. 436 r/w s. 109 for abetment of mischief by fire; definitions of abetment in ss. 107-109; other rioting/hurt offences."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave limited to conviction under s. 436 r/w s. 109 IPC dismissed; conviction and sentence of 4 years RI affirmed as evidence establishes abetment and act committed in consequence.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It seems to us, on the findings given in the case, that the person who set fire to the hut of Mst. Rasmani must be one of the persons who were members of the unlawful assembly and he must have done so in consequence of the order of the present appellant.\"",
      "speaker": "court",
      "significance": "Core reasoning upholding abetment conviction despite principal's acquittal."
    },
    {
      "text": "\"We accordingly hold that the conviction of the appellant for the offence under s. 436 read with s. 109, Indian Penal Code, is not bad in law.\"",
      "speaker": "court",
      "significance": "Direct holding on the legal issue."
    }
  ],
  "_case_id": "1958_83",
  "_label": 0,
  "_text_length": 12898,
  "_extracted_at": "2026-02-08T22:33:22.504916"
}