{
  "metadata": {
    "case_name": "Appellants (Contractors) v. Respondents (Sales Tax Authorities)",
    "case_year": 1955,
    "court": "Supreme Court of India",
    "judges": [
      "S. R. Das C.J.",
      "Venkatarama Aiyar J.",
      "S. K. Das J.",
      "A. K. Sarkar J.",
      "Bose J."
    ],
    "case_number": "Civil Appeals Nos. 253 to 255 of 1955",
    "date_of_judgment": "1958-04-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant in Civil Appeal No. 253 of 1955 is a contractor doing business in the construction of buildings and roads for the Military and Public Works Department in the State of Madhya Pradesh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant filed M.P. No. 245 of 1954 challenging proposed sales tax assessment under Central Provinces and Berar Sales Tax Act, 1947 on two grounds: (1) no authority under Entry 48 List II Sch. VII Government of India Act, 1935 to tax supply of materials in works contracts as sale of goods; (2) entitled to exemption under item 33 Sch. II as per Act XVI of 1949, and notification dated September 18, 1950 withdrawing exemption unconstitutional.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Appellants in Civil Appeal No. 254 of 1955 are Jabalpur Contractors Association and certain contractors, filed M.P. No. 279 of 1954 questioning validity of proposed assessment on same grounds as M.P. No. 245 of 1954.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Appellant in Civil Appeal No. 255 of 1955 is Madhya Pradesh Contractors Association, Nagpur, filed M.P. No. 308 of 1954 challenging legality of assessment proceedings on same grounds.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Nagpur High Court by judgment dated November 30, 1954 held: expression 'sale of goods' in Entry 48 covers transactions where property in movables passes for money, including materials in building contracts; provisions valid except definition of sale price in s.2(h)(ii) and Rule 4 ultra vires; notification September 18, 1950 valid.",
      "type": "procedural",
      "date": "1954-11-30",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appeals preferred to Supreme Court on certificate under Art. 132(1) Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Item 33 Sch. II originally 'Goods sold by the Crown'; amended by Act XVI of 1949 to 'Goods sold to or by the Crown'; Adaptation Order 1950 substituted 'State Government'; notification September 18, 1950 under s.6(2) amended to 'Goods sold by the State Government'.",
      "type": "background",
      "date": "1950-09-18",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Sales tax authorities called upon contractors to furnish returns for assessment on receipts from contract works.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Provincial Legislature has authority under Entry 48 List II Sch. VII Government of India Act, 1935 to impose tax on supply of materials in works contracts treating it as sale of goods.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether notification dated September 18, 1950 amending item 33 Sch. II under s.6(2) is unconstitutional delegation of legislative power.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Supply of materials in works contracts is not a sale of goods within Entry 48; provisions of Act seeking to impose tax thereon ultra vires.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Entry 48 List II Sch. VII Government of India Act, 1935; State of Madras v. Gannon Dunkerley Co. (Madras) Ltd."
    },
    {
      "id": "pa2",
      "text": "Notification September 18, 1950 ultra vires as unconstitutional delegation; matter of policy whether exemption granted cannot be left to executive; power to repeal/modify legislative provision invalid.",
      "supporting_facts": [
        "f2",
        "f7"
      ],
      "legal_basis": "s.6(2) Central Provinces and Berar Sales Tax Act, 1947; Rajnarain Singh v. Chairman Patna Administration Committee; In re Delhi Laws Act, 1912; US cases: Hampton J.R. Co. v. United States, Panama Refining Co. v. Ryan, Schechter v. United States"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Even construing 'sale of goods' narrowly per Sale of Goods Act, some contracts consist of distinct agreements for sale of materials and for work/labour; tax competent on sale part after investigation.",
      "supporting_facts": [
        "f5",
        "f8"
      ],
      "legal_basis": "State of Madras v. Gannon Dunkerley Co. (Madras) Ltd.; Indian Sale of Goods Act, 1930"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Expression 'sale of goods' in Entry 48 has meaning per Indian Sale of Goods Act, 1930; in building contract there is no sale of materials as such; Provincial Legislature lacks power to tax supply of materials in works contracts.",
      "addresses_issue": "i1",
      "key_observation": "Question concluded by State of Madras v. Gannon Dunkerley Co. (Madras) Ltd."
    },
    {
      "id": "cr2",
      "text": "Sales tax authorities to determine if particular works contract is single indivisible or combination of distinct sale and works agreements; tax only on sale part if separable.",
      "addresses_issue": "i1",
      "key_observation": "Per observations in Gannon Dunkerley."
    },
    {
      "id": "cr3",
      "text": "Power under s.6(2) to amend schedule on exemptions in consonance with legislative practice on taxation details; not unconstitutional delegation.",
      "addresses_issue": "i2",
      "key_observation": "Legislature retains control; supported by Powell v. Apollo Candle Co., Syed Mohamed Co. v. State of Madras, Hampton J.R. Co. v. United States."
    },
    {
      "id": "cr4",
      "text": "s.6(1) and s.6(2) integral; exemption conditional and subject to modification under s.6(2); notification intra vires.",
      "addresses_issue": "i2",
      "key_observation": "No independent operation of s.6(1)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Provisions of Central Provinces and Berar Sales Tax Act, 1947 imposing tax on supply of materials in construction works ultra vires powers under Entry 48.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Notification dated September 18, 1950 under s.6(2) valid and intra vires.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Prohibition on tax imposition only for single indivisible works contracts; sales tax authorities may investigate and tax separable sale agreements.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Madras v. Gannon Dunkerley Co. (Madras) Ltd.",
      "citation": "1959 S.C.R. 379",
      "treatment": "followed",
      "relevance": "Holds no sale of materials in building contract; defines 'sale of goods' per Sale of Goods Act."
    },
    {
      "case_name": "In re The Delhi Laws Act, 1912 etc.",
      "citation": "1951 S.C.R. 747",
      "treatment": "referred",
      "relevance": "On delegation of legislative power."
    },
    {
      "case_name": "Rajnarain Singh v. Chairman, Patna Administration Committee",
      "citation": "1955 1 S.C.R. 290",
      "treatment": "distinguished",
      "relevance": "Executive cannot modify essential features or change policy; notification not such."
    },
    {
      "case_name": "Powell v. Apollo Candle Company Limited",
      "citation": "1885 10 A.C. 282",
      "treatment": "followed",
      "relevance": "Delegation for taxation details valid; legislature retains control."
    },
    {
      "case_name": "Syed Mohamed Co. v. State of Madras",
      "citation": "1952 3 S.T.C. 367",
      "treatment": "followed",
      "relevance": "Delegation to decide point of levy in sales tax valid."
    },
    {
      "case_name": "Hampton J.R. Co. v. United States",
      "citation": "276 U.S. 394",
      "treatment": "followed",
      "relevance": "Delegation to approve rates not unconstitutional."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Provinces and Berar Sales Tax Act, 1947",
      "sections": [
        "2(b)",
        "2(c)",
        "2(d)",
        "2(g)",
        "2(h)",
        "2(j)",
        "4(a)",
        "6"
      ],
      "relevance": "Defines contract, dealer, goods, sale, sale price, turnover; charging section; exemption provisions applied and held partly ultra vires for works contracts."
    },
    {
      "name": "Sales Tax Rules, 1947",
      "sections": [
        "Rule 4"
      ],
      "relevance": "Method for calculating sale price by deducting labour percentages; noted as per High Court but not addressed in SC."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Entry 48 List II Sch. VII"
      ],
      "relevance": "Limits provincial power to tax sales of goods."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 132(1)"
      ],
      "relevance": "Certificate for appeal."
    },
    {
      "name": "Indian Sale of Goods Act, 1930",
      "sections": [],
      "relevance": "Meaning of 'sale of goods'."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeals allowed; provisions of Act held ultra vires insofar as imposing tax on construction works contracts that are single and indivisible; respondents restrained from enforcing such; clarified separable contracts taxable on sale portion; notification on exemption valid; parties bear own costs throughout.",
    "relief_granted": "Writ restraining enforcement of Act on indivisible works contracts; High Court judgment set aside.",
    "costs": "Parties to bear their own costs throughout."
  },
  "key_quotes": [
    {
      "text": "\"in a building contract there is no sale of materials as such, and that it is therefore ultra vires the powers of the Provincial Legislature to impose tax on the supply of materials.\"",
      "speaker": "court",
      "significance": "Core holding following Gannon Dunkerley on legislative competence."
    },
    {
      "text": "\"the power conferred on the State Government by s.6(2) to amend the schedule relating to exemption is in consonance with the accepted legislative practice relating to the topic, and is not unconstitutional.\"",
      "speaker": "court",
      "significance": "Rejects delegation challenge."
    },
    {
      "text": "\"it cannot include a change of policy.\" (citing Bose J. in Rajnarain Singh)",
      "speaker": "petitioner_counsel",
      "significance": "Argued as basis for invalidity of notification; distinguished by court."
    }
  ],
  "_case_id": "1958_11",
  "_label": 1,
  "_text_length": 19523,
  "_extracted_at": "2026-02-08T22:16:19.559667"
}