{
  "metadata": {
    "case_name": "Amritsar Distillery Co. (Appellant) v. Income Tax Authorities (Respondent)",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "SARKAR, J."
    ],
    "case_number": "Civil Appeal No. 119 of 1955",
    "date_of_judgment": "1958-11-24"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a company carrying on business as a distiller of country liquor, incorporated in May 1945 as a reconstruction of previously existing Amritsar Distillery Co. Ltd.",
      "type": "background",
      "date": "1945-05",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant carried on the same business as predecessor: sale of produce of distillery to licensed wholesalers, who sold to retailers, then to consumers; entire trade controlled by Government regulations.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "After war started, demand for country liquor increased but bottle scarcity; Government devised buy-back scheme in 1940: distiller charges wholesaler fixed price for bottles supplied with liquor, refundable on return of bottles.",
      "type": "background",
      "date": "1940",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Similar buy-back arrangement between wholesaler-retailer and retailer-consumer at different rates; price later increased.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In 1944, Amritsar Distillery Co. Ltd. insisted wholesalers pay additional amounts described as security deposits per bottle (varying rates by size), promising refund per returned bottle and full amount when 90% of bottles covered by transaction returned.",
      "type": "material",
      "date": "1944",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant continued demanding and taking these additional sums after taking over business; object to induce bottle returns to avoid hampering trade.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "No time limit fixed for bottle returns to entitle refund; no refund ever refused.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Buy-back scheme bottle prices entered in general trading account; additional sums in 'Empty Bottles Return Security Deposit Account'.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Additional amounts taken without Government's sanction, as condition imposed by appellant for sale of liquor.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant assessed to income-tax, business profits tax, excess profits tax on balance of additional sums after refunds.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appeals to Appellate Assistant Commissioner and Tribunal failed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Reference to Punjab High Court: 'Whether on the facts and circumstances of the case the collections by the assessee company described in its accounts as empty bottle return security deposits were income assessable under section 10 of the Income-tax Act?' High Court answered affirmatively.",
      "type": "procedural",
      "date": "1953-06-16",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appeal to Supreme Court against High Court decision relating to all three taxes.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Appellant's trade: selling bottled liquor to wholesalers; consideration included liquor price, govt-fixed bottle price, security deposit; no sale without all sums paid.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Bottle price refunded as returned; security deposit refunded in full when 90% bottles returned per transaction.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of the case the collections by the assessee company described in its accounts as empty bottle return security deposits were income assessable under section 10 of the Income-tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Additional sums not price (separate from govt-fixed bottle price), but security deposits for return of bottles; hence not trading receipts.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Davies v. The Shell Company of China Ltd.; Morley v. Tattersall"
    },
    {
      "id": "pa2",
      "text": "No obligation on wholesalers to return bottles; words 'security deposit' alone insufficient to create obligation.",
      "supporting_facts": [
        "f7",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Amounts akin to third period deposits in K.M.S. Lakshmanier Sons case, treated as loans.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "K. M. S. Lakshmanier Sons v. Commissioner of Income-tax"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Even if securities for return of bottles, they are trading receipts as part of trading transactions essential for carrying on trade.",
      "supporting_facts": [
        "f2",
        "f14",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Additional sums part of consideration for sale of bottled liquor; unless paid, no sale; entered differently in accounts irrelevant; refundable nature does not alter as bottle price also refundable.",
      "addresses_issue": "i1",
      "key_observation": "Trade consisted of sale of bottled liquor; consideration constituted by liquor price, bottle price, security deposit."
    },
    {
      "id": "cr2",
      "text": "No right to return bottles or obligation on wholesalers; no time limit indicates no obligation; substance: sold bottles, agreed to take back and repay.",
      "addresses_issue": "i1",
      "key_observation": "Words 'security deposit' alone insufficient to create obligation."
    },
    {
      "id": "cr3",
      "text": "Distinguished Davies v. Shell: deposits anterior to trading, not part of transactions; here integral to each sale.",
      "addresses_issue": "i1",
      "key_observation": "Amounts essential parts of trading transactions."
    },
    {
      "id": "cr4",
      "text": "Amounts akin to second period in Lakshmanier Sons: advance payments/deposits part of each contract, refundable on events; not third period (ongoing security unrelated to specific transactions).",
      "addresses_issue": "i1",
      "key_observation": "Payment made as part of trading transaction, refundable on certain events."
    },
    {
      "id": "cr5",
      "text": "Distinguished Morley v. Tattersall: moneys received on behalf of others, never firm's; here appellant's moneys with profit-making quality.",
      "addresses_issue": "i1",
      "key_observation": "Quality of receipt fixed on receipt; here trading receipts with profit potential."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Amounts described as Empty Bottles Return Security Deposits were trading receipts and income assessable to tax under section 10 of Income-tax Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Davies v. The Shell Company of China Ltd.",
      "citation": "1951 32 Tax Cas. 133",
      "treatment": "distinguished",
      "relevance": "Deposits anterior to trading transactions, part of trading structure; unlike here where part of each sale."
    },
    {
      "case_name": "Landes Bros. v. Simpson",
      "citation": "1934 19 Tax Cas. 62",
      "treatment": "referred",
      "relevance": "Mentioned in Shell case as example where advance payments for goods are trading receipts."
    },
    {
      "case_name": "Imperial Tobacco Co. v. Kelly",
      "citation": "1943 25 Tax Cas. 292",
      "treatment": "followed",
      "relevance": "Profit from dollars bought for commercial transaction (tobacco purchase) is trading receipt; analogous to amounts here integral to sale."
    },
    {
      "case_name": "K. M. S. Lakshmanier Sons v. Commissioner of Income-tax and Excess Profits Tax, Madras",
      "citation": "1953 S.C.R. 1057",
      "treatment": "followed",
      "relevance": "Initial payments/deposits under certain arrangements were trading receipts, not loans; present case like second period."
    },
    {
      "case_name": "Morley v. Tattersall",
      "citation": "1938 22 Tax Cas. 51",
      "treatment": "distinguished",
      "relevance": "Amounts received on behalf of clients never trading receipts; quality fixed on receipt; unlike here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "Section 10"
      ],
      "relevance": "Whether security deposits income assessable under this section."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against Punjab High Court decision upholding assessment to income-tax, business profits tax and excess profits tax on balance of security deposits after refunds dismissed; question answered in affirmative.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Such being the nature of the appellants trade and the manner in which it was conducted, these additional sums appear to us to be its trading receipts.\"",
      "speaker": "court",
      "significance": "Core holding on nature of deposits."
    },
    {
      "text": "\"Unless all these sums were paid the appellant would not have sold the liquor. So the amount which was called security deposit was actually a part of the consideration for the sale and therefore part of the price of what was sold.\"",
      "speaker": "court",
      "significance": "Explains why deposits part of price despite nomenclature."
    },
    {
      "text": "\"There could be no security given for the return of the bottles unless there was a right to their return for if there was no such right, there would be nothing to secure.\"",
      "speaker": "court",
      "significance": "Rejects security deposit characterization due to lack of obligation."
    },
    {
      "text": "\"The quality and nature of a receipt for Income Tax purposes is fixed once and for all when it is received.\"",
      "speaker": "court",
      "significance": "Quoting Morley v. Tattersall to affirm trading receipt status on receipt."
    }
  ],
  "_case_id": "1958_36",
  "_label": 0,
  "_text_length": 30630,
  "_extracted_at": "2026-02-08T22:17:11.038419"
}