{
  "metadata": {
    "case_name": "Chintamanrao and Kantilal v. State",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao J."
    ],
    "case_number": "Criminal Appeal No. 93 of 1955",
    "date_of_judgment": "1958-02-18"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Messrs. Brijlal Manilal and Company is a bidi factory situated in Sagar. The 1st Appellant, Chintamanrao, is the Managing-Partner of the firm while the 2nd appellant, Kantilal, is its active Manager.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Company manufactures bidis. The process of manufacture is carried out in two stages. First stage: Management enters into contract with independent contractors, known as Sattedars, for the supply of bidis locally. Management supplies tobacco to the Sattedars and in some cases bidi leaves.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Some Sattedars maintain a small factory where they get bidis manufactured by engaging coolies. Others give tobacco and bidi leaves to outsiders who prepare bidis in their houses. Sattedars collect the bidis and take them to the factory where they are sorted and checked by workers in the factory.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Selected bidis are packed in bundles of 10 and 25 and taken by Sattedars or coolies to tandul and left there. Rejected bidis (chhant) are rebundled by Sattedars and delivered to the factory. Management pays Sattedars the cost of manufacture after deducting cost of tobacco supplied.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Second stage: Warming of bidis, wrapping in tissue papers, labelling and bundling in Pudas, carried out exclusively by labourers employed in the factory.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Sattedar is an independent contractor who undertakes to supply bidis, directly or indirectly through coolies, by manufacturing them either in his own factory or by entrusting to third parties, at a price after delivery and approval. Sattedars or coolies neither work in appellants' factory nor subject to supervision or control of appellants.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Coolies or third parties employed by Sattedars are paid by them. None works in the factory though they bring bidis for delivery.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Factory employs workers under direct control and supervision of factory management for second part of process.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On December 9, 1952, Sri B. V. Desai, Inspector of Factories, visited factory at 5:30 p.m. and found nine persons: Pirbaksha s/o Amir, Abdul Sagir s/o Sk. Alam, Deviprasad s/o Uddam, Ramshankar s/o Mulchand, Gopal s/o Mulchand, Nirpat s/o Bhagirath, Rameband s/o Gyan, Gotiram s/o Lila, Basodi s/o Gulu.",
      "type": "material",
      "date": "1952-12-09",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Of the nine, Deviprasad, Nirpat and Gotiram are Sattedars; rest are coolies employed by Sattedars. First seven sorting and packing bidis into bundles of 10 and 25; last two bringing bidis in jali for warming.",
      "type": "material",
      "date": "1952-12-09",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Said persons admitted facts and explained they came to deliver bidis manufactured by them.",
      "type": "admitted",
      "date": "1952-12-09",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Chief Inspector filed complaint against appellants for violation of ss. 62 and 63 of Factories Act: failure to maintain register of adult workers and allowing workers to work without entries of attendance.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Judge-Magistrate, Sagar, in Criminal Case No. 146 of 1953, dated August 5, 1953, held contravention, convicted under s.92, fined Rs.50 to 1st appellant and Rs.25 to 2nd.",
      "type": "procedural",
      "date": "1953-08-05",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "On appeal, Second Additional Sessions Judge, Sagar, in Criminal Appeal No. 368 of 1953, dated March 8, 1954: confirmed 2nd appellant's conviction for ss.62 and 63; set aside 1st appellant's for s.62 but confirmed for s.63.",
      "type": "procedural",
      "date": "1954-03-08",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Revision in Nagpur High Court, Criminal Revision No. 295 of 1954, dismissed on September 16, 1954.",
      "type": "procedural",
      "date": "1954-09-16",
      "source": "high_court"
    },
    {
      "id": "f16",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Names of 9 persons not entered in register of adult workers; no notice of periods of work displayed; no entries beforehand.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Sattedars and their coolies found working in the factory are 'workers' within the definition under s.2(l) of the Factories Act, 1948, such that the appellants were required to comply with ss.62 and 63.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sattedar is an independent contractor who undertakes specific job of work without submitting to control of management; neither Sattedar nor his employee is a 'worker' under s.2(l); no duty to comply with ss.62 or 63 in respect of them.",
      "supporting_facts": [
        "f2",
        "f6",
        "f7"
      ],
      "legal_basis": "Section 2(l) Factories Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Definition of 'worker' is comprehensive enough to take in all persons who work in the factory, whether employed by factory or not.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Section 2(l) Factories Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Manager must maintain register of adult workers under s.62; no adult worker to work otherwise than per notice under s.61 and entries in register under s.63; contravention punishable under s.92 against occupier and manager.",
      "addresses_issue": "i1",
      "key_observation": "Appellants contravened if persons were workers as defined."
    },
    {
      "id": "cr2",
      "text": "'Worker' means person employed directly or through agency in manufacturing process etc. Employment involves employer-employee-contract of service with control and supervision.",
      "addresses_issue": "i1",
      "key_observation": "Distinction between contractor (independent, no control over details) and workman (under control)."
    },
    {
      "id": "cr3",
      "text": "Sattedars not under control of factory; can manufacture anywhere; only obligation to deliver bidis. Not employed as workers.",
      "addresses_issue": "i1",
      "key_observation": "Test of control from precedents applies; Sattedars independent contractors."
    },
    {
      "id": "cr4",
      "text": "Coolies employed by Sattedars on their own account, no privity with management; not employed directly or through agency by management.",
      "addresses_issue": "i1",
      "key_observation": "Agency must be employment agency with contract between management and persons."
    },
    {
      "id": "cr5",
      "text": "Scheme of Chapter VI (ss.51-63) indicates workers under direct supervision/control of management; impossible to regulate independent contractors.",
      "addresses_issue": "i1",
      "key_observation": "Reinforces 'worker' excludes independent contractors."
    },
    {
      "id": "cr6",
      "text": "Distinguishes Nagpur HC cases: Provincial Govt v. Robinson (no issue of independent contractor raised); State v. Jiwabhai (overbroad view dissented if ignoring contract).",
      "addresses_issue": "i1",
      "key_observation": "Not authorities on point."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sattedars and coolies not 'workers' under s.2(l) as not employed by management; no offence under ss.62,63,92.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Decision confined to facts; depends on contract terms whether particular Sattedar is worker.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dharangadhara Chemical Works Ltd. v. State of Saurashtra",
      "citation": "1957 S.C.R. 152",
      "treatment": "followed",
      "relevance": "Test of control for employer-employee relationship; applies to 'worker' definition."
    },
    {
      "case_name": "Mersey Docks and Harbour Board v. Coggins & Griffith (Liverpool) Ltd.",
      "citation": "1947 A.C. 1",
      "treatment": "referred",
      "relevance": "Proper test is hirer's authority to control manner of execution."
    },
    {
      "case_name": "Provincial Government, Central Provinces and Berar v. Robinson",
      "citation": "I.L.R. 1947 Nag. 43",
      "treatment": "distinguished",
      "relevance": "Wide definition but independent contractor issue not raised."
    },
    {
      "case_name": "State v. Jiwabhai",
      "citation": "I.L.R. 1953 Nag. 67",
      "treatment": "doubted",
      "relevance": "Overbroad view of 'employed' dissented if ignoring contract."
    },
    {
      "case_name": "State v. Shri Krishna Prasad",
      "citation": "A.I.R. 1954 All. 44",
      "treatment": "followed",
      "relevance": "Accepted interpretation that persons were workers on facts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Factories Act, 1948",
      "sections": [
        "2(l)",
        "2(m)",
        "2(n)",
        "51",
        "52",
        "53",
        "54",
        "55",
        "56",
        "57",
        "58",
        "59",
        "60",
        "61",
        "62",
        "63",
        "92"
      ],
      "relevance": "Definition of worker requires employment with control; ss.62,63 require register/entries for workers; contravention punishable under s.92. Scheme indicates direct control."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; convictions of appellants under ss.62,63,92 set aside as Sattedars and coolies not workers.",
    "relief_granted": "Acquittal of appellants",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The concept of employment involves three ingredients: 1 employer 2 employee and 3 the contract of employment.",
      "speaker": "court",
      "significance": "Defines core of 'employed' under s.2(l)"
    },
    {
      "text": "The identifying mark of the latter [workman] is that he should be under the control and supervision of the employer in respect of the details of the work.",
      "speaker": "court",
      "significance": "Key test distinguishing contractor from worker"
    },
    {
      "text": "We, therefore, hold that the Sattedars in this case were not employed by the management as workers but were only independent contractors.",
      "speaker": "court",
      "significance": "Central holding on Sattedars"
    }
  ],
  "_case_id": "1958_96",
  "_label": 1,
  "_text_length": 27590,
  "_extracted_at": "2026-02-08T22:33:19.281031"
}