{
  "metadata": {
    "case_name": "Raghunath Das v. Gokul Chand and Mst. Daropadi",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "DAS C.J."
    ],
    "case_number": "Civil Appeal No. 251 of 1954",
    "date_of_judgment": "1958-05-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Lala Beni Pershad died in 1910 leaving widow Mst. Daropadi (defendant respondent No. 2) and two sons: Gokul Chand (defendant respondent No. 1) and Raghunath Das (plaintiff appellant, then a minor). Left considerable movable properties including G.P. Notes and immovable properties including agricultural land, gardens and houses.",
      "type": "background",
      "date": "1910",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Family continued joint until disputes arose between brothers in 1934. On November 12, 1934, brothers executed agreement referring disputes on partition to arbitration of Lala Ramji Das.",
      "type": "material",
      "date": "1934-11-12",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Alleged that Gokul Chand disposed of part of G.P. Notes; at arbitration reference, G.P. Notes of Rs. 26,500 held by Gokul Chand as Karta.",
      "type": "disputed",
      "date": "1934",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Arbitrator made award on June 21, 1936, signed by both brothers. Registered on July 28, 1936. Divided immovable properties. For G.P. Notes: Rs. 13,300 to Gokul Chand and Mst. Daropadi; Rs. 13,200 to Raghunath Das and Mst. Daropadi. Mst. Daropadi entitled to interest till death. Gokul Chand to pay Raghunath Das Rs. 20,000 in instalments with interest.",
      "type": "material",
      "date": "1936-06-21",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On August 31, 1936, Gokul Chand applied to District Judge, Ambala under para 20 Sch II CPC to file award. During pendency, brothers entered compromise modifying award (details not material here). District Judge on November 18, 1936, filed modified award and passed decree accordingly.",
      "type": "procedural",
      "date": "1936-11-18",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Raghunath Das applied for execution of decree on November 15, 1939. Transferred to Subordinate Judge, who issued notice. Gokul Chand objected on jurisdiction grounds (no power to pass decree for partition of agricultural lands). Subordinate Judge dismissed execution on December 23, 1942.",
      "type": "procedural",
      "date": "1939-11-15",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Raghunath Das appealed to High Court; Single Judge accepted on April 5, 1944. Gokul Chand's Letters Patent Appeal: Division Bench reversed on March 15, 1945, restored dismissal.",
      "type": "procedural",
      "date": "1945-03-15",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Raghunath Das instituted Suit No. 80 of 1945 on August 21, 1945 for Rs. 7,310-11-3 (balance of Rs. 20,000 with interest). Senior Subordinate Judge decreed in favour on December 22, 1945. No appeal by Gokul Chand; decree final.",
      "type": "procedural",
      "date": "1945-08-21",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Raghunath Das filed Suit No. 239 of 1946 on June 5, 1946 claiming transfer of G.P. Notes Rs. 13,200 to him and Mst. Daropadi, entry in registers, delivery; alternative: pay Rs. 13,200. Particulars of notes in prayer.",
      "type": "material",
      "date": "1946-06-05",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Gokul Chand's written statement raised pleas in bar. 12 issues; Nos. 2 and 3 pressed: (2) Suit within time? (3) Barred by O.2 R.2 CPC?",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Subordinate Judge, Ambala decreed suit on July 1, 1947 in favour of plaintiff: Art. 49 inapplicable, residuary Art. 120; exclude Nov 15,1939-Mar 15,1945 u/s 14 Limitation Act; causes different, no O2 R2 bar.",
      "type": "procedural",
      "date": "1947-07-01",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Gokul Chand appealed (Civil Regular First Appeal No. 1/E of 1947). Division Bench, Punjab High Court reversed on April 22, 1952: Suit for specific movable under Art. 49 (3 yrs); time-barred even excluding period; dismissed suit. Certificate for appeal to SC on Dec 19,1952.",
      "type": "procedural",
      "date": "1952-04-22",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the suit is barred by limitation: governed by Art. 49 (specific movable property, 3 years) or Art. 120 (residuary, 6 years), and applicability of s.14 Limitation Act to exclude execution period Nov 15,1939 to Mar 15,1945.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the suit is barred by O.2 R.2 CPC (res judicata for not claiming in prior Suit No.80/1945).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Suit not for specific movable property under Art.49; decree only declared rights, no actual division of G.P. Notes specifying particular notes; suit for partition/division of joint/tenants-in-common property governed by Art.120. Exclude execution period u/s.14 Limitation Act. Cause of action different from prior suit for Rs.20,000 balance.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7",
        "f9",
        "f11"
      ],
      "legal_basis": "Art.120 Limitation Act; s.14 Limitation Act; O.2 R.2 CPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Suit for recovery of specific movable property (G.P. Notes with particulars of numbers, value, year, interest) governed by Art.49 (3 years from unlawful detention). Time-barred even excluding execution period. Also barred by O.2 R.2 CPC.",
      "supporting_facts": [
        "f9",
        "f12"
      ],
      "legal_basis": "Art.49 Limitation Act; O.2 R.2 CPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court erred: decree only declared rights in G.P. Notes by value, no specification of particular notes; no actual division. Suit not for specific movable in specie (plaintiff cannot claim particular notes); brothers joint/tenants-in-common till division. Gokul Chand's possession not wrongful/unlawful till then. Distinguished Gopal Chandra Bose (defendant had no right there).",
      "addresses_issue": "i1",
      "key_observation": "Suit akin to heir recovering share from joint estate; governed by Art.120 (followed Mohomed Riasat Ali)."
    },
    {
      "id": "cr2",
      "text": "Execution proceedings prosecuted with due diligence/good faith; same cause of action (enforce decree rights); court lacked jurisdiction (defect attached to decree). Entitled to exclude period u/s.14 Limitation Act. Suit within time.",
      "addresses_issue": "i1",
      "key_observation": "Single Judge upheld jurisdiction initially."
    },
    {
      "id": "cr3",
      "text": "High Court did not decide O.2 R.2 issue; remand required.",
      "addresses_issue": "i2",
      "key_observation": "Finding on limitation disposes appeal but other issue pending."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Suit not governed by Art.49 but by Art.120 Limitation Act; time excluded u/s.14; not time-barred.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Remand to High Court for decision on O.2 R.2 issue.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gopal Chandra Bose v. Surendra Nath Dutt",
      "citation": "1908 XII C.W.N. 1010",
      "treatment": "distinguished",
      "relevance": "High Court relied; distinguished as defendant had no right/interest in notes there, unlike joint family here."
    },
    {
      "case_name": "Mohomed Riasat Ali v. Mussumat Hasin Banu",
      "citation": "1893 L.R. 20 I.A. 155",
      "treatment": "followed",
      "relevance": "Suit by heir for share of movable estate not under Art.49 but Art.120; applies to partition of joint/tenants-in-common property."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Limitation Act",
      "sections": [
        "Art. 49",
        "Art. 120",
        "s. 14"
      ],
      "relevance": "Art.49 inapplicable to suit for share/partition; Art.120 residuary applies; s.14 excludes time in prior bona fide proceedings for same cause lacking jurisdiction."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "O. 2 R. 2",
        "Sch. II para 20"
      ],
      "relevance": "O.2 R.2: whether prior suit bars present (not decided); Sch.II para20: filing award."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court allowed appeal, set aside High Court judgment/decree dismissing suit as time-barred, held suit within limitation under Art.120 with s.14 exclusion, remanded to High Court for decision on O.2 R.2 issue.",
    "relief_granted": "Remand to High Court",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Until the G.P. Notes were actually divided... neither of the brothers could claim any particular piece of G.P. Notes as his separate property or ask for delivery of any particular G.P. Notes in specie.\"",
      "speaker": "court",
      "significance": "Core reasoning why not suit for specific movable under Art.49."
    },
    {
      "text": "\"...a suit by an heir against other heirs to recover his share of the moveable estate... is not one for specific moveable property... but is governed by Art. 120.\"",
      "speaker": "court",
      "significance": "Applies precedent principle to facts."
    }
  ],
  "_case_id": "1958_20",
  "_label": 1,
  "_text_length": 17841,
  "_extracted_at": "2026-02-10T19:19:43.406004"
}