{
  "metadata": {
    "case_name": "Appellant (Complainant) v. Respondents (Accused)",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha J."
    ],
    "case_number": "Criminal Appeal No. 49 of 1956",
    "date_of_judgment": "1958-08-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "First accused is leader of Dravida Kazakam, a community professing to be religious reformers carrying on propaganda against idol worship, vilifying Hindu community by holding meetings and writing articles.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "First accused announced intention of breaking image of God Ganesa, sacred to Saiva section of Hindu community, on 27th May 1953 in public meeting at Town Hall, causing terror and commotion in minds of Saivite Hindus.",
      "type": "material",
      "date": "1953-05-27",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "On 27 May 1953 at about 5:30 p.m., first accused broke mud idol of God Ganesa in public at Town Hall Maidan, made speech expressly stating intention to insult feelings of Hindu community by breaking the idol; act abetted by instigation and aid from other two accused who also made speeches.",
      "type": "material",
      "date": "1953-05-27",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Complainant is a Saivite and filed petition of complaint dated 5 June 1953 before Additional First-Class Magistrate, Tiruchirappalli, alleging offences under ss. 295 and 295A IPC, praying for processes against three accused; list of witnesses included officials.",
      "type": "procedural",
      "date": "1953-06-05",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Magistrate examined complainant on oath on 5 June 1953, who supported allegations; directed petition sent to Circle Inspector of Police for inquiry and report under s. 202 CrPC.",
      "type": "procedural",
      "date": "1953-06-05",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Police report dated 26 June 1953 confirmed occurrence took place but raised point of law if it amounted to offence.",
      "type": "procedural",
      "date": "1953-06-26",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Magistrate dismissed complaint under s. 203 CrPC on 26 June 1953, holding mud figure of Ganesa not an object held sacred, and s.295A required government sanction.",
      "type": "procedural",
      "date": "1953-06-26",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Complainant filed revision petition before Sessions Judge, Tiruchirapalli on 9 July 1953 under ss.435 and 436 CrPC, confined to offence under s.295 IPC.",
      "type": "procedural",
      "date": "1953-07-09",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Sessions Judge dismissed revision on 12 January 1954, agreeing acts did not amount to offence under s.295 IPC as image was private property not held sacred.",
      "type": "procedural",
      "date": "1954-01-12",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Complainant filed revisions before Madras High Court under s.439 CrPC (Criminal Revision Case No. 267 of 1954 and Criminal Revision Petition No. 249 of 1954).",
      "type": "procedural",
      "date": "1954",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Madras High Court single Judge dismissed revisions on 13 October 1954, holding mud image not 'any object held sacred by any class of persons' under s.295 IPC.",
      "type": "procedural",
      "date": "1954-10-13",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court refused certificate under Art.134(1)(c) Constitution for appeal to Supreme Court.",
      "type": "procedural",
      "date": "1954",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Supreme Court granted special leave to appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "No one appeared for respondents in Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the petition of complaint disclosed a prima facie offence under s.295 of the Indian Penal Code, particularly whether a mud image of God Ganesa broken in public constitutes 'any object held sacred by any class of persons'.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Courts below unduly restricted meaning of 'any object held sacred by any class of persons' in s.295 IPC; words used in fullest amplitude to include any consecrated or otherwise object held sacred, not limited to idols in temples or processions.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f14"
      ],
      "legal_basis": "Section 295 IPC"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Whether object held sacred depends on evidence; facts in complaint not controverted; image of Lord Ganesa held sacred by certain classes of Hindus even if not consecrated; courts below erred by restricting to idols in temples or processions; idols illustrative; sacred books like Bible, Koran, Granth Saheb also included; courts must respect religious susceptibilities irrespective of rationality.",
      "addresses_issue": "i1",
      "key_observation": "Courts below misdirected by importing limitations not in s.295 IPC; any object regarded sacred by any class, even if trivial or not worshipped, falls within section."
    },
    {
      "id": "cr2",
      "text": "Though courts below erred in interpretation, case stale after about 5 years; action if true was foolish but no direction for further inquiry.",
      "addresses_issue": "i1",
      "key_observation": "Strong disagreement with lower courts but no further proceedings due to lapse of time."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Courts below erred in narrow interpretation of s.295 IPC; 'any object held sacred by any class of persons' includes mud image of God Ganesa held sacred by Saivite Hindus, even if not consecrated or in temple.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Queen Empress v. Imam Ali",
      "citation": "1887 I.L.R. 10 All. 150",
      "treatment": "referred",
      "relevance": "Authority that 'object' in s.295 IPC does not include animate objects; observation on ejusdem generis with place of worship, idol as example, not against complainant."
    },
    {
      "case_name": "Romesh Chunder Sannyal v. Hiru Mondal",
      "citation": "1890 I.L.R. 17 Cal. 852",
      "treatment": "referred",
      "relevance": "Dealt with dedicated bull; not directly in point but High Court inferred narrow scope."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "295",
        "295A"
      ],
      "relevance": "s.295 punishes destruction etc. of place of worship or object held sacred with intent to insult religion; s.295A requires sanction; complaint disclosed prima facie case under s.295."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "202",
        "203",
        "435",
        "436",
        "439"
      ],
      "relevance": "Inquiry and dismissal of complaint; revisional jurisdiction."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 134(1)(c)"
      ],
      "relevance": "Certificate for appeal refused by High Court."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court held that lower courts erred in interpreting s.295 IPC too narrowly and that the complaint disclosed a prima facie offence, as the mud image of God Ganesa qualified as an object held sacred by Saivite Hindus; however, due to the case becoming stale after about 5 years, no direction for further inquiry was issued, effectively upholding the dismissal of the complaint.",
    "relief_granted": "None; no further inquiry directed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'any object held sacred by any class of persons, must depend upon the evidence in the case... image of Lord Ganesa... is held sacred by certain classes of Hindus, even though the image may not have been consecrated.'",
      "speaker": "court",
      "significance": "Core holding expanding scope of s.295 IPC beyond temple idols."
    },
    {
      "text": "The section has been intended to respect the religious susceptibilities of persons of different religious persuasions or creeds. Courts have got to be very circumspect in such matters.",
      "speaker": "court",
      "significance": "Emphasizes judicial duty to protect religious feelings."
    },
    {
      "text": "'The mud figure of Ganesa alleged to have been broken by accused is not an object held sacred or worshipped by any class of persons.'",
      "speaker": "lower_court",
      "significance": "Magistrate's erroneous narrow view overturned by Supreme Court."
    }
  ],
  "_case_id": "1958_22",
  "_label": 0,
  "_text_length": 14733,
  "_extracted_at": "2026-02-08T22:16:23.887940"
}