{
  "metadata": {
    "case_name": "Landlord (Appellants) v. Tenant (Respondent)",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Civil Appeal No. 153 of 1955",
    "date_of_judgment": "1958-12-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In 1938 the respondent took on rent the accommodation in dispute which is termed a tal on a monthly agreed rent of Rs. 21-4 as. and was using the same for the purpose of stacking timber. A portion of it was a covered godown which had three walls and a kucha roof.",
      "type": "background",
      "date": "1938",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In January 1949 the appellant constructed anew a big godown 80 x 25 x 11 feet according to the instructions of the respondent and expended a fairly large sum of money on it.",
      "type": "disputed",
      "date": "1949-01",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "On January 28, 1950, the appellant made an application to the House Allotment Officer under s. 3-A of the United Provinces Temporary Control of Rent and Eviction Act, 1947 (U.P. III of 1947) for the fixation of reasonable annual rent of the accommodation in dispute, alleging entitlement to a monthly rent of Rs. 165.",
      "type": "procedural",
      "date": "1950-01-28",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The House Allotment Officer fixed on February 18, 1950, the rent at Rs. 35 per mensem which on review was raised on May 25, 1950, to Rs. 40 per mensem. He held that the accommodation was not a newly constructed accommodation as the respondent had been a tenant from 1938. He determined the increase of rent on the basis of the building that was added by the new construction.",
      "type": "procedural",
      "date": "1950-02-18",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "The appellant thereupon instituted a suit (Suit No. 19 of 1950) on the ground of inadequacy of the reasonable annual rent under s. 5(4) of the Act alleging that he had constructed the portion of the accommodation anew and put up ferro-concrete roof 80 x 25 feet and that the construction was undertaken at the request of the respondent who had agreed to pay enhanced rent but had refused to do so; proper rent should not be less than Rs. 115 per mensem.",
      "type": "procedural",
      "date": "1950",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Defence: there was no construction at the request of the respondent but it had been undertaken in order to put up another storey on the top of the old building; as far as the accommodation in possession of the respondent was concerned there was no new construction of accommodation after June 30, 1946; the ferro-concrete roof had in no way benefited him, on the other hand the space at his disposal had diminished because of the number of pillars constructed and the lowering of the roof; suit not maintainable under the Act and no suit could be filed after the order of the House Allotment Officer.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Relevant issues: Whether the suit is not maintainable in view of any provisions of the Act No. 3 of 1947? Whether the suit after the fixation of rent by the House Allotment Officer is not maintainable? What should be the reasonable and proper rent of the accommodation in suit?",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The learned Additional Civil Judge (judgment dated March 31, 1951) found that the suit was not barred because of the Act; the suit against the order of the House Allotment Officer was maintainable; newly constructed accommodation on the whole was bigger and more spacious than the old kacha hall and that the accommodation had increased; after taking into consideration the amount spent on the construction increased the reasonable adequate rent to Rs. 55-8-0.",
      "type": "procedural",
      "date": "1951-03-31",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Respondent took revision to the High Court under s. 115 CPC (Civil Revision Application No. 540 of 1951); High Court (judgment dated August 30, 1954) held that construction on the upper storey was a new construction but as far as the accommodation in the occupation of the respondent was concerned the construction could not be called new construction and therefore s. 3-A was not applicable and as no suit lay at the instance of the landlord to have the agreed rent enhanced, the tenant was only liable to pay the agreed rent and no more; revision allowed, suit dismissed.",
      "type": "procedural",
      "date": "1954-08-30",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court could, in revision under s. 115 of the Code of Civil Procedure, interfere with the decision of the trial court on the date of construction of the accommodation, which is a jurisdictional fact determining the maintainability of the suit under s. 5(4) of the U.P. Act III of 1947.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the accommodation was newly constructed after June 30, 1946, so as to allow fixation of reasonable annual rent under s. 3-A and suit under s. 5(4) for inadequacy.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "It was within the jurisdiction of the Additional Civil Judge to decide the question of the date of construction of the accommodation and in doing so he could decide rightly or wrongly as the matter was within his jurisdiction and therefore the High Court had no power to interfere merely because in its opinion the decision was erroneous. This question was merely one of the facts in issue between the parties unconnected with jurisdiction.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s. 115 CPC; Queen v. Commissioner for Special Purposes of the Income Tax"
    },
    {
      "id": "pa2",
      "text": "The House Allotment Officer having decided in his favour the question of the date of construction which s. 3-A of the Act authorises him to decide, his right to bring the suit was established and therefore the High Court could not in revision under s. 115, CPC, go into the correctness of that decision.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s. 3-A U.P. Act III of 1947"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The decision of the court as to the date of construction was in this case a jurisdictional fact i.e. a fact which went to the root of the jurisdiction of the court because unless the accommodation was held to have been a new construction made after June 30, 1946, the appellant would be bound by the agreed rent and would have no right of suit under s. 5(4) and the court would have no jurisdiction to entertain the suit.",
      "supporting_facts": [
        "f1",
        "f6",
        "f9"
      ],
      "legal_basis": "s. 5(4), s. 3-A U.P. Act III of 1947; s. 115 CPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Explained the scheme of the U.P. Temporary Control of Rent and Eviction Act, 1947: Reasonable annual rent defined differently for pre-July 1, 1946 and post-June 30, 1946 constructions; s. 3-A empowers District Magistrate (House Allotment Officer) to determine rent for post-1946 constructions or certain pre-1946 cases; subject to suit u/s 5(4); landlord can sue only for inadequacy of reasonable annual rent, not to enhance agreed rent.",
      "addresses_issue": "i1",
      "key_observation": "Suit maintainability depends on jurisdictional fact of date of construction after June 30, 1946."
    },
    {
      "id": "cr2",
      "text": "Trial court aware that maintainability depended on new construction after June 30, 1946; held portion newly replaced as new accommodation, no question of agreed rent.",
      "addresses_issue": "i2",
      "key_observation": "High Court correctly held that for respondent's occupation, not new construction post-1946."
    },
    {
      "id": "cr3",
      "text": "Under s. 115 CPC, High Court can interfere if subordinate court exercises jurisdiction not vested (erroneous jurisdictional fact), fails to exercise jurisdiction, or acts illegally/with material irregularity.",
      "addresses_issue": "i1",
      "key_observation": "Trial court's erroneous finding on date conferred jurisdiction not possessed; High Court could interfere per Privy Council precedents."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The question of date of construction is a jurisdictional fact; erroneous decision thereon allows High Court interference u/s 115 CPC if it results in assuming jurisdiction not vested.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court correctly interfered as trial court wrongly assumed jurisdiction by holding accommodation as new construction post-June 30, 1946.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Queen v. Commissioner for Special Purposes of the Income Tax",
      "citation": "1888 21 Q.B.D. 313",
      "treatment": "followed",
      "relevance": "Distinguishes two classes of jurisdictional facts for inferior tribunals."
    },
    {
      "case_name": "Venkatagiri Ayyangar v. Hindu Religious Endowment Board, Madras",
      "citation": "1949 L.R. 76 I.A. 67",
      "treatment": "followed",
      "relevance": "High Court revision power u/s 115 CPC on jurisdictional errors."
    },
    {
      "case_name": "Joy Chand Lal Babu v. Kamalaksha Chaudhury",
      "citation": "1949 L.R. 76 I.A. 131",
      "treatment": "followed",
      "relevance": "Erroneous decision leading to non-exercise or illegal exercise of jurisdiction allows revision."
    },
    {
      "case_name": "Keshardeo Chamria v. Radha Kissen Chamria",
      "citation": "1953 S.C.R. 136",
      "treatment": "followed",
      "relevance": "s. 115 CPC applies to jurisdictional matters: irregular/non/illegal assumption."
    },
    {
      "case_name": "Rai Brij Raj Krishna v. S. K. Shaw and Bros.",
      "citation": "1951 S.C.R. 145",
      "treatment": "distinguished",
      "relevance": "Adjudication by judge with jurisdiction conclusive unless jurisdictional defect; inapplicable here."
    }
  ],
  "statutes_cited": [
    {
      "name": "United Provinces Temporary Control of Rent and Eviction Act, 1947 (U.P. Act III of 1947)",
      "sections": [
        "s. 2(a)",
        "s. 2(f)",
        "s. 3-A",
        "s. 5(1)",
        "s. 5(4)",
        "s. 6"
      ],
      "relevance": "Defines accommodation, reasonable annual rent (distinguishing pre/post 1946 constructions), procedure for fixation by HAO and suit for inadequacy/excess; restricts landlord suits."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "s. 115"
      ],
      "relevance": "High Court revisional jurisdiction to correct jurisdictional errors, illegal exercise, or material irregularity."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court held that the High Court correctly interfered in revision u/s 115 CPC with the trial court's erroneous finding on the jurisdictional fact of new construction post-June 30, 1946, as the suit was not maintainable for enhancement of agreed rent; appeal dismissed, upholding High Court's dismissal of the suit.",
    "relief_granted": "None to appellant; tenant liable only for agreed rent.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"if the erroneous decision results in the subordinate court exercising a jurisdiction not vested in it by law, or failing to exercise a jurisdiction so vested, a case for revision arises under sub-s. (a) or sub-s. (b)\"",
      "speaker": "court",
      "significance": "Explains scope of High Court revisional power u/s 115 CPC on jurisdictional errors."
    },
    {
      "text": "\"In the present case the appellant landlords right of suit was restricted to challenging the inadequacy of the reasonable annual rent but he could not sue for varying the agreed rent.\"",
      "speaker": "court",
      "significance": "Clarifies limitation on landlord's suit under s. 5(4) of the Act."
    },
    {
      "text": "\"Two facts therefore stand out clearly in the judgment of the trial court (1) that it was the existence of a newly constructed accommodation which gave jurisdiction to the court to determine its reasonable annual rent and (2) that as it was a newly constructed accommodation, the question of agreed rent did not arise.\"",
      "speaker": "court",
      "significance": "Highlights trial court's recognition of jurisdictional fact."
    }
  ],
  "_case_id": "1958_37",
  "_label": 0,
  "_text_length": 26661,
  "_extracted_at": "2026-02-10T19:20:29.758699"
}