{
  "metadata": {
    "case_name": "Appellant (representative of Purshottamdas) v. Respondents (representatives of Dhanrupmal and Motilal)",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar J."
    ],
    "case_number": "Civil Appeal No. 150 of 1954",
    "date_of_judgment": "1958-04-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The property mortgaged was a four-roomed shop with certain appurtenances, standing on a piece of land measuring 5 yards by 15 yards in Naya Bazar, Ajmere.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The mortgage was created by Purshottamdas who is now dead and was in favour of Dhanrupmal, a respondent in this appeal, dated August 1, 1899.",
      "type": "material",
      "date": "1899-08-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The mortgage instrument stated that the property had been usufructuarily mortgaged in lieu of Rs. 6,300 of which Rs. 5,750 had been left with the mortgagee to redeem a prior mortgage on the same and another property.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On redemption of the prior mortgage, the possession of the shop would be taken over and retained by the mortgagee, Dhanrupmal, who would appropriate its rent in lieu of interest on the money advanced by him and the possession of the other property comprised by the prior mortgage, being a share in a Kacheri would be made over to the mortgagor, Purshottamdas.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The provisions in the mortgage instrument: 'I or my heirs will never be entitled to redeem the property for a period of 85 years. After the expiry of 85 years we shall redeem it within a period of six months. In case we do not redeem within a period of six months, then after the expiry of the stipulated period, I, my heirs, and legal representatives shall have no claim over the mortgaged property, and the mortgagee shall have no claim to get the mortgage money and the lagat i.e., repairs expenses that may be due at the time of default. In such case this very deed will be deemed to be a sale deed. There will be no need of executing a fresh sale deed. The expenses spent in repairs and new constructions will be paid along with the mortgage money at the time of redemption according to account produced by the mortgagee.'",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The mortgagee, Dhanrupmal, duly redeemed the earlier mortgage and went into possession of the shop while possession of the Kacheri was delivered to the mortgagor.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On April 12, 1939, Dhanrupmal assigned his rights under the mortgage to Motilal who died later, and whose estate is now represented by his sons, who are the other respondents in this appeal.",
      "type": "background",
      "date": "1939-04-12",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The estate of Purshottamdas, the original mortgagor, is now represented by his son, the appellant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On January 2, 1947, the appellant filed the suit in the Court of the Sub-Judge, Ajmere, against the respondents for redemption of the mortgage.",
      "type": "procedural",
      "date": "1947-01-02",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The suit was contested by the sons of Motilal, who contended that the suit was premature as under the mortgage contract there was no right of redemption for eighty five years after the date of the mortgage, that is to say, till August 1, 1984.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "The learned Sub-Judge held that the provision postponing redemption for eighty-five years was invalid as it amounted to a clog on the equity of redemption and passed a preliminary decree for redemption on March 30, 1948.",
      "type": "procedural",
      "date": "1948-03-30",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "On appeal, the learned Judicial Commissioner, Ajmer, held that the provision did not amount to a clog on the equity of redemption, allowed the appeal and dismissed the appellant's suit on March 21, 1950.",
      "type": "procedural",
      "date": "1950-03-21",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The suit for redemption was brought over forty-seven years after the date of the mortgage.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "It is admitted that the case is governed by the Transfer of Property Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the term in the mortgage providing that it will not be redeemable for eighty-five years amounts to a clog on the equity of redemption.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the term providing that on failure to redeem within six months after 85 years, the mortgagor forfeits all claim and the deed becomes a sale deed, is valid.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The covenant creating the long term of eighty-five years for the mortgage, taken along with the provision that the mortgagor must redeem within a period of six months thereafter or not at all and the other terms of the mortgage and also the circumstances of the case, is really a clog on the equity of redemption and is therefore invalid.",
      "supporting_facts": [
        "f5",
        "f13"
      ],
      "legal_basis": "Rule against clogs on the equity of redemption; once a mortgage always a mortgage"
    },
    {
      "id": "pa2",
      "text": "In the result the mortgage money had been due all along and the suit was not premature.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Section 60, Transfer of Property Act"
    },
    {
      "id": "pa3",
      "text": "The mortgage instrument itself indicates that the bargain is hard, for while the mortgagor cannot redeem for eighty-five years, the mortgagee is free to demand payment at any time; the mortgagee can spend any amount on repairs and constructions and mortgagor must pay per mortgagee's account.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "All the terms in the deed were for the benefit of the mortgagee and showed a hard bargain; prior mortgage indicates impecunious position of mortgagor.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The suit was premature as under the mortgage contract there was no right of redemption for eighty five years after the date of the mortgage, till August 1, 1984.",
      "supporting_facts": [
        "f2",
        "f5",
        "f10"
      ],
      "legal_basis": "Section 60, Transfer of Property Act; Bakhtawar Begum v. Husaini Khanam"
    },
    {
      "id": "ra2",
      "text": "The suit had been brought as the price of landed property had gone up after the war.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The term that on the failure of the mortgagor to redeem within six months the mortgagor will have no claim and the deed will be deemed a sale cannot be sustained as it takes away the mortgagor's right to redeem; once a mortgage always a mortgage.",
      "addresses_issue": "i2",
      "key_observation": "This term is invalid and ignored; right to redeem continues even after six months."
    },
    {
      "id": "cr2",
      "text": "The term fixing the period at 85 years stands apart and only fixes when principal becomes due; its invalidity does not affect the 85-year term.",
      "addresses_issue": "i1",
      "key_observation": "It does not take away the right to redeem but prevents its accrual for that period."
    },
    {
      "id": "cr3",
      "text": "The rule against clogs relieves from unconscionable bargains where mortgagor was oppressed or imposed upon due to difficulties; depends on facts.",
      "addresses_issue": "i1",
      "key_observation": "Length of term alone does not make it oppressive."
    },
    {
      "id": "cr4",
      "text": "No evidence of unconscionability: suit after 47 years, not soon after; long terms common in India; prior mortgage freed kacheri; smaller security; no high interest; no pressure.",
      "addresses_issue": "i1",
      "key_observation": "Bargain fair, between parties on equal footing; no financial embarrassment."
    },
    {
      "id": "cr5",
      "text": "No provision for mortgagee to demand money anytime; rights co-extensive. Repairs clause for necessary repairs only, per account as safeguard; small property limits large spends.",
      "addresses_issue": "i1",
      "key_observation": "Terms not hard or one-sided."
    },
    {
      "id": "cr6",
      "text": "Prior mortgage does not indicate impecuniosity; mortgagor benefited by freeing kacheri.",
      "addresses_issue": "i1",
      "key_observation": "Bargain freely made."
    },
    {
      "id": "cr7",
      "text": "The eighty-five years term is reasonable and should be enforced; suit premature.",
      "addresses_issue": "i1",
      "key_observation": "Principal not due till 1984."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The term providing failure to redeem in six months makes deed a sale deed is invalid as clog on equity of redemption.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "The term postponing right to redeem for 85 years is valid and not a clog; principal money becomes due after 85 years from August 1, 1899.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Suit for redemption filed in 1947 is premature.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bakhtawar Begum v. Husaini Khanam",
      "citation": "1913 L.R. 41 I.A. 84",
      "treatment": "followed",
      "relevance": "Right of redemption arises only after expiration of specified period in absence of stipulation allowing earlier redemption."
    },
    {
      "case_name": "Santley v. Wilde",
      "citation": "1899 2 Ch. 474",
      "treatment": "followed",
      "relevance": "Principle that mortgage is security redeemable on payment, any provision preventing redemption is clog; once a mortgage always a mortgage."
    },
    {
      "case_name": "Mohammad Sher Khan v. Seth Swami Dayal",
      "citation": "1921 L.R. 49 I.A. 60",
      "treatment": "followed",
      "relevance": "Once right to redeem arises under s.60 TPA, it cannot be taken away; applies to term limiting redemption period."
    },
    {
      "case_name": "Vermon v. Bethell",
      "citation": "1762 2 Eden 110",
      "treatment": "referred",
      "relevance": "Equity jealous of securities converting to purchases; relieves necessitous men from hard terms imposed by crafty lenders."
    },
    {
      "case_name": "G. and C. Kreglinger v. New Patagonia Meat and Cold Storage Company Ltd.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Equity relieves against penalties in mortgages; jurisdiction to prevent unconscientious conduct in lending; ascertain real nature as mortgage."
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act",
      "sections": [
        "s. 60"
      ],
      "relevance": "Mortgagor has right to redeem after principal money due on payment of mortgage money; unqualified, right cannot be taken away once arisen."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The Supreme Court upholds the Judicial Commissioner's decision that the 85-year term is valid and not a clog on equity of redemption, rendering the suit premature. The six-month forfeiture clause is struck down as invalid, but this does not affect the term or prematurity.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"once a mortgage always a mortgage.\"",
      "speaker": "court",
      "significance": "Core principle against clogs on equity of redemption."
    },
    {
      "text": "The rule against clogs on the equity of redemption is that, a mortgage shall always be redeemable and a mortgagors right to redeem shall neither be taken away nor be limited by any contract between the parties.",
      "speaker": "court",
      "significance": "Defines the rule applied to invalidate forfeiture clause."
    },
    {
      "text": "The reason then justifying the Courts power to relieve a mortgagor from the effects of his bargain is its want of conscience.",
      "speaker": "court",
      "significance": "Limits equity's intervention to unconscionable bargains only."
    },
    {
      "text": "We, therefore, think that the bargain was a reasonable one and the eighty-five years term of the mortgage should be enforced.",
      "speaker": "court",
      "significance": "Final determination upholding the long term."
    }
  ],
  "_case_id": "1958_79",
  "_label": 0,
  "_text_length": 21330,
  "_extracted_at": "2026-02-10T19:21:21.937814"
}