{
  "metadata": {
    "case_name": "Nagpur Electric Light and Power Co. Ltd. v. Shreepathi Rao",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "K. DAS J."
    ],
    "case_number": "Civil Appeal No.5 of 1958",
    "date_of_judgment": "1958-04-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, Shreepathi Rao, joined the service of the Company as a typist on a salary of Rs. 30 per month in July, 1936.",
      "type": "background",
      "date": "1936-07",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "He rose in rank from time to time and was appointed Deputy Head Clerk in 1947 in the grade of Rs. 120-10-225. Since 1952 he has been receiving a basic salary of Rs. 245 per month.",
      "type": "background",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On November 28, 1955, an explanation was called for from him with regard to the issue of certain bills to high tension consumers of electricity without having certain numbers for the information of consumers printed at the back of the bills.",
      "type": "material",
      "date": "1955-11-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The respondent submitted his explanation on the next day, marking a copy thereof to one of the directors of the Company.",
      "type": "material",
      "date": "1955-11-29",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On December 2,1955, he was again asked to explain why he marked a copy of his explanation to one of the directors.",
      "type": "material",
      "date": "1955-12-02",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The respondent submitted an explanation in respect of this matter also.",
      "type": "material",
      "date": "1955-12-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On the same date, he was again asked to explain as to how and why certain double adjustments had been made in the accounts of 1954 relating to the consumers department of the Company, the allegation being that a sum of Rs. 1,05,894-7-7 which represented the amount of bills of the Central Railway had been deducted twice in the accounts.",
      "type": "material",
      "date": "1955-12-02",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The respondent submitted an explanation on December 3, 1955, in which he said that the charge was vague and that, after 1949, he was not in any way concerned with the preparation of summaries and annual statements of accounts of the consumers department.",
      "type": "material",
      "date": "1955-12-03",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On December 5, 1955, an order of suspension was made against the respondent which stated that the order was to take immediate effect and to remain in force until further orders, pending some investigation against the respondent.",
      "type": "material",
      "date": "1955-12-05",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Two days later, on December 7, 1955, a memorandum was served on the respondent terminating his services with effect from January 31,1956. The memorandum read: 'We hereby give you notice under Standing Order 16 (1) that your services will stand terminated as from 31st January, 1956. The Company's Managing Director is satisfied that it is not in the interests of the business of the Company to disclose reasons for terminating your services.'",
      "type": "material",
      "date": "1955-12-07",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On December 19, 1955, a notice was served on the Company on behalf of the respondent wherein it was stated that the order of suspension dated December 5, 1955, and the order of termination dated December 7, 1955, were illegal and ultra vires and a request was made to withdraw the said orders and reinstate the respondent within 24 hours.",
      "type": "procedural",
      "date": "1955-12-19",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "On December 26, 1955, the Company sent a reply to the notice denying the allegations.",
      "type": "procedural",
      "date": "1955-12-26",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "On January 2, 1956, the respondent filed a petition under Art. 226 of the Constitution in the High Court at Nagpur praying for quashing the orders of suspension and termination and other reliefs.",
      "type": "procedural",
      "date": "1956-01-02",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "The petition was heard by a learned single Judge on preliminary objections raised by the appellants, and by order dated April 14, 1956, dismissed the petition holding: (1) respondent not an employee within Standing Orders; (2) contractual relationship, remedy suit for damages; (3) for amendment of Standing Orders, approach union under Act.",
      "type": "procedural",
      "date": "1956-04-14",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Respondent preferred Letters Patent Appeal No. 66 of 1956, allowed by Division Bench on September 26, 1956, holding: (1) Standing Orders do not apply though employee under local Act; (2) conditions governed by local Act, right to Art. 226; (3) termination without statutory authority. Quashed orders, declared continuance of service, back wages.",
      "type": "procedural",
      "date": "1956-09-26",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Appellants obtained special leave to appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Standing Orders came into force on November 14, 1951. Respondent is a workman under Central Act and employee under local Act. No ticket issued to respondent.",
      "type": "background",
      "date": "1951-11-14",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Company paid salary to respondent from suspension to Jan 31, 1956.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Standing Orders of the Company apply to the respondent.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the termination of service was in accordance with Standing Order 16(1).",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Scope of Art. 226 jurisdiction in case of termination by private employer under Standing Orders.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Service terminated in accordance with Standing Orders approved under Central Act and local Act. Remedy for grievance is amendment of Standing Orders, not Art. 226. Alternatively, ordinary master-servant law applies, remedy suit for damages.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Industrial Employment (Standing Orders) Act, 1946; Central Provinces and Berar Industrial Disputes Settlement Act, 1947"
    },
    {
      "id": "pa2",
      "text": "Standing Orders apply to respondent. Inclusion of name and ticket number in departmental muster is not essential characteristic of 'employee'. Distinction between 'employee' (larger group) and 'workman' (smaller group with tickets).",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "Standing Order 2(a), 3, 4, 8(b), 16"
    },
    {
      "id": "pa3",
      "text": "Even if Art. 226 applicable, no violation of Standing Orders. No penalty under Standing Order 18 imposed; termination under 16(1) complied with.",
      "supporting_facts": [
        "f10",
        "f18"
      ],
      "legal_basis": "Standing Order 16(1), 18"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Standing Orders do not apply as respondent not 'employee' under SO 2(a) - no ticket, name/ticket number not in departmental muster.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "Standing Order 2(a)"
    },
    {
      "id": "ra2",
      "text": "Company breached s.30 local Act by not making Standing Orders for employees like respondent without tickets. Termination illegal, ultra vires.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Central Provinces and Berar Act s.30"
    },
    {
      "id": "ra3",
      "text": "Suspension and termination violated Standing Order 18(e). Remand for merits.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Standing Order 18"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Standing Orders distinguish 'employee' (all persons employed in specified departments) from 'workman' (declared categories with tickets). Ticket inclusion not essential for 'employee'. SO apply to all employees.",
      "addresses_issue": "i1",
      "key_observation": "Words 'whose names and ticket numbers are included in the departmental musters' apply only where tickets issued; read as 'if any'."
    },
    {
      "id": "cr2",
      "text": "SO consistent across clauses (e.g., probationers no ticket; SO 8(b) distinguishes marking attendance vs presenting ticket). No breach of s.30 local Act.",
      "addresses_issue": "i1",
      "key_observation": "Construe to comply with statutory obligation under s.30."
    },
    {
      "id": "cr3",
      "text": "Termination under SO 16(1) valid: one month notice, reasons not disclosed as per clause. No misconduct penalty under SO 18 imposed; salary paid till termination.",
      "addresses_issue": "i2",
      "key_observation": "Company chose termination, not disciplinary action."
    },
    {
      "id": "cr4",
      "text": "No need to decide Art.226 scope or remand as preliminary issue decisive.",
      "addresses_issue": "i3",
      "key_observation": "Writ fails if SO apply and termination valid."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Standing Orders apply to respondent as 'employee'; ticket not essential.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Termination valid under Standing Order 16(1).",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Courts v. The Kent Waterworks Company",
      "citation": "(1827) 7 B. C. 314",
      "treatment": "followed",
      "relevance": "Principle: In interpreting provisions, apply to capable parties; inapplicable words do not exclude others (e.g., recognizance for corporations)."
    },
    {
      "case_name": "Perumal Goundan v. The Thirumalarayapuram Jananukoola Dhanasekhara Sangha Nidhi",
      "citation": "(1917) I.L.R. 41 Mad. 624",
      "treatment": "followed",
      "relevance": "Explanation to O. XXXIII r.1 CPC applies to companies though 'wearing apparel' inapplicable."
    },
    {
      "case_name": "D. C. Dungore v. S. S. Dandige",
      "citation": "Misc. Petition No. 134 of 1954 (Nagpur High Court, Sep 23, 1955)",
      "treatment": "distinguished",
      "relevance": "Company took different stand earlier, but no estoppel in statutory construction; that person not 'employee' under Act."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Employment (Standing Orders) Act, 1946",
      "sections": [
        "s.2",
        "s.3",
        "s.4-10",
        "Schedule item 8"
      ],
      "relevance": "Approval of Standing Orders; definition of 'workman'; matters like termination."
    },
    {
      "name": "Central Provinces and Berar Industrial Disputes Settlement Act, 1947",
      "sections": [
        "s.2(1)",
        "s.30",
        "s.31",
        "s.32",
        "Schedule I item 8",
        "Ch. IV"
      ],
      "relevance": "Approval, amendment of Standing Orders; definition of 'employee'; statutory obligation to make SO for all employees."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Writ jurisdiction invoked for quashing suspension/termination."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed. Judgment and order of High Court Division Bench dated September 26, 1956 set aside. Respondent's writ petition dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'The essential content of the definition of an employee is employment in the Office, Mains Department, etc., of the Company either at Nagpur or Wardha, and that of a workman the necessary declaration by the Company which would entitle him to a ticket under Standing Order 4.'",
      "speaker": "court",
      "significance": "Core holding on distinction between employee and workman under Standing Orders."
    },
    {
      "text": "'We are of the view that the same rule of construction should apply in the present case, and the words whose names and ticket numbers are included in the departmental musters occurring in Standing Order 2(a) should be read as whose names and ticket numbers, if any, are included...'",
      "speaker": "court",
      "significance": "Interpretive principle applied to make SO applicable to all employees."
    },
    {
      "text": "'The result, therefore, is that the appeal succeeds and is allowed. The judgment and order of the High Court dated September 26, 1956, are set aside and the writ petition of the respondent is dismissed.'",
      "speaker": "court",
      "significance": "Final disposition of the case."
    }
  ],
  "_case_id": "1958_171",
  "_label": 1,
  "_text_length": 31144,
  "_extracted_at": "2026-02-08T22:35:00.745479"
}