{
  "metadata": {
    "case_name": "Seth Badri Prasad and others v. Nagar Mal and others",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "K. DAS, J."
    ],
    "case_number": "Civil Appeal No. 125 of 1955",
    "date_of_judgment": "1958-12-09"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Cloth control came into force in Rewa State; cloth dealers of Budhar formed an Association of 25 members with initial capital of one lac rupees; no formal Articles of Association written nor registered.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Association functioned through a President and a pioneer worker who kept accounts and distributed profits.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Nagar Mal (respondent no. 1) was President from January 1946 to June 26, 1946; Seth Badri Prasad (one of plaintiffs-appellants) was President before and after.",
      "type": "material",
      "date": "1946-01-01 to 1946-06-26",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Association worked till February 1948 when cloth was decontrolled and its work ended.",
      "type": "background",
      "date": "1948-02",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On June 25, 1949, thirteen members out of twenty-five brought suit alleging Nagar Mal gave accounts for Jan-Mar 1946 but not for Apr-Jun 1946; prayed for accounts from April 1, 1946 to June 26, 1946, payment of dues with interest at annas 12 per cent per month, and pendente lite and future interest.",
      "type": "procedural",
      "date": "1949-06-25",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Other eleven members joined as proforma defendants, some later applied to join as plaintiffs.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Real dispute related to sale of Gwalior consignment: In April 1946, 666 bales came from Gwalior; Cloth Control Officer ordered allotment to Nagar Mal who would give Association option; ultimately 390 bales allotted to Association; Nagar Mal gave benefit of sales of 106 bales; dispute on profits from remaining 284 bales.",
      "type": "disputed",
      "date": "1946-04",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Additional District Judge, Umaria, in Civil Original Suit No. 17/19/17 of 1950, passed preliminary decree on June 4, 1951 directing Nagar Mal to render accounts from April 1 to June 26, 1946, excluding 106 bales, for rest of 390 bales profits according to capital shares.",
      "type": "procedural",
      "date": "1951-06-04",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Nagar Mal appealed to Judicial Commissioner, Vindhya Pradesh in Civil First Appeal No. 47 of 1951; on November 20, 1951, reversed District Judge, held other members not entitled to profits on 284 bales, Nagar Mal rendered other accounts, dismissed suit.",
      "type": "procedural",
      "date": "1951-11-20",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Certificate granted by Judicial Commissioner for appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Preliminary objection by respondent no. 1 before Supreme Court that suit not maintainable under s.4 Rewa State Companies Act, 1935 as Association of more than 20 persons not registered.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Appellants' counsel conceded s.4(2) in force in Rewa State at formation of Association and till Indian Companies Act 1950.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the suit for accounts is maintainable given that the Cloth Association was formed by more than 20 persons without registration under s.4(2) Rewa State Companies Act, 1935, rendering it illegal.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether the preliminary objection based on s.4(2) can be raised for the first time in Supreme Court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Preliminary objection should not be allowed at this late stage as not raised in courts below.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Even if in contravention of s.4(2), purpose not illegal; suit maintainable for recovery of contributions and accounts.",
      "supporting_facts": [
        "f1",
        "f5"
      ],
      "legal_basis": "U. Sein Po v. U. Phyu"
    },
    {
      "id": "pa3",
      "text": "By analogy to s.69(3)(a) Indian Partnership Act, 1932, right to sue for accounts of dissolved firm.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "s.69(3)(a) Indian Partnership Act, 1932"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Cloth Association illegal under s.4(2) Rewa State Companies Act, 1935 as more than 20 persons for business acquiring gain, not registered nor under Charter; no remedy for contribution or accounts among members of illegal association.",
      "supporting_facts": [
        "f1",
        "f3",
        "f12"
      ],
      "legal_basis": "s.4(2) Rewa State Companies Act, 1935; Lindley on Partnership"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Preliminary objection raisable at late stage as pure question of law on public prohibitory statute; no court can enforce invalid contract.",
      "addresses_issue": "i2",
      "key_observation": "Objection rests on public statute which court cannot exclude; similar to Surajmull Nargoremull v. Triton and Sri Sri Shiba Prasad Singh v. Maharaja Srish Chandra Nandi."
    },
    {
      "id": "cr2",
      "text": "Association illegal; plaintiffs seek enforcement of illegal contract by demanding accounts implying recognition of association; no relief for accounts of illegal partnership.",
      "addresses_issue": "i1",
      "key_observation": "Members have no remedy against each other for contribution or apportionment in respect of illegal partnership dealings; distinguishes U. Sein Po as that sought refund of subscriptions, not enforcement."
    },
    {
      "id": "cr3",
      "text": "Analogy to s.69(3)(a) Partnership Act inapplicable as unregistered firm not illegal, and suit not for dissolved firm but illegal association.",
      "addresses_issue": "i1",
      "key_observation": "No compulsion to register partnership, unlike companies act prohibition."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Suit not maintainable as Association illegal under s.4(2) Rewa State Companies Act, 1935; no suit lies for accounts among members of illegal association.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Preliminary objection based on prohibitory public statute can be raised at any stage, even first time in Supreme Court.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Surajmull Nargoremull v. Triton Insurance Company Ltd.",
      "citation": "1924 L.R. 52 I.A. 126",
      "treatment": "followed",
      "relevance": "Objection under prohibitory statute like Stamp Act s.7(1) raisable late; no court enforces invalid contract."
    },
    {
      "case_name": "Sri Sri Shiba Prasad Singh v. Maharaja Srish Chandra Nandi",
      "citation": "1949 L.R. 76 I.A. 244",
      "treatment": "followed",
      "relevance": "Provisions of public statute like Contract Act s.72 cannot be excluded even if not argued below."
    },
    {
      "case_name": "U. Sein Po v. U. Phyu",
      "citation": "1929 I.L.R. 7 Ran. 540",
      "treatment": "distinguished",
      "relevance": "Allowed refund of subscriptions for illegal association but not enforcement of accounts."
    },
    {
      "case_name": "Sheppard v. Oxenford",
      "citation": "1855 1 K. J. 491",
      "treatment": "referred",
      "relevance": "Cited in U. Sein Po for subscribers' rights to return subscriptions."
    },
    {
      "case_name": "Butt v. Monteaux",
      "citation": "1854 1 K. J. 98",
      "treatment": "referred",
      "relevance": "Cited in U. Sein Po for subscribers' rights."
    },
    {
      "case_name": "Senaji Kapurchand v. Pannaji Devichand",
      "citation": "A.I.R. 1930 P.C. 300",
      "treatment": "followed",
      "relevance": "Court cannot adjudicate illegal contracts shown on face of plaint."
    },
    {
      "case_name": "Kumaraswami v. Chinnathambi",
      "citation": null,
      "treatment": "followed",
      "relevance": "No relief for illegal partnership contracts."
    },
    {
      "case_name": "Greenberg v. Cooperstein",
      "citation": "1926 1 Ch. 657",
      "treatment": "distinguished",
      "relevance": "Money paid for illegal purpose returnable if not used, unlike claim enforcing illegal association."
    }
  ],
  "statutes_cited": [
    {
      "name": "Rewa State Companies Act, 1935",
      "sections": [
        "s.4(2)"
      ],
      "relevance": "Prohibits association/partnership of more than 20 persons for business acquiring gain unless registered or under Charter; renders Association illegal, barring suit for accounts."
    },
    {
      "name": "Indian Partnership Act, 1932",
      "sections": [
        "s.69(3)(a)"
      ],
      "relevance": "Analogy rejected; unregistered firm not illegal unlike prohibited association."
    },
    {
      "name": "Indian Contract Act",
      "sections": [
        "s.72"
      ],
      "relevance": "Provisions cannot be excluded; cited in precedent."
    },
    {
      "name": "Indian Companies Act",
      "sections": [
        "s.4(2)"
      ],
      "relevance": "Similar provision referenced in U. Sein Po case."
    },
    {
      "name": "Indian Stamp Act, 1899",
      "sections": [
        "s.7(1)"
      ],
      "relevance": "Prohibitory statute objection raisable late, per precedent."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld preliminary objection, held Cloth Association illegal under s.4(2) Rewa State Companies Act, 1935; suit for accounts not maintainable; appeal dismissed without deciding merits.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"No court can enforce as valid that which competent enactments have declared shall not be valid.\"",
      "speaker": "court",
      "significance": "Justifies raising preliminary objection late; from Surajmull precedent."
    },
    {
      "text": "\"The most important consequence... of illegality in a contract of partnership is that the members... have no remedy against each other for contribution or apportionment in respect of the partnership dealings.\"",
      "speaker": "court",
      "significance": "Core principle denying relief for illegal association accounts; from Lindley on Partnership."
    },
    {
      "text": "\"When the association is itself illegal, a court cannot assist the plaintiffs in getting accounts made so that they may have their full share of the profits made by the illegal association.\"",
      "speaker": "court",
      "significance": "Direct holding on why suit fails."
    }
  ],
  "_case_id": "1958_139",
  "_label": 0,
  "_text_length": 17981,
  "_extracted_at": "2026-02-08T22:33:55.124192"
}