{
  "metadata": {
    "case_name": "Legal representatives of Sailendra Sundar Mitra v. State",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "SINHA J."
    ],
    "case_number": "Criminal Appeal No. 116 of 1956",
    "date_of_judgment": "1958-10-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On 2nd December 1946 at Garden Reach, accused Sailendra Sundar Mitra, Establishment Clerk of B.C. II Section in Traffic Accounts Office of B.N. Railway (now Eastern Railway), cheated B.N. Railway Administration by dishonestly inducing it by false representation in pay bill of non-gazetted staff for November 1946 to deliver Rs. 205-13-0 to him and Rs. 33-4-0 to Satish Chandra Das Gupta in excess of legitimate dues.",
      "type": "material",
      "date": "1946-12-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Learned trial Magistrate convicted accused for cheating in respect of Rs. 205-13-0, gave benefit of doubt for Rs. 33-4-0. Sentenced to one day's imprisonment (detention till rising of court), fine of Rs. 500/-, in default rigorous imprisonment for six months. Directed Rs. 333/- out of fine to B.N. Railway (now South Eastern Railway) as compensation. Order dated February 11, 1955.",
      "type": "procedural",
      "date": "1955-02-11",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "On appeal, Additional Sessions Judge at Alipore dismissed appeal and confirmed conviction and sentence by judgment dated May 9, 1955.",
      "type": "procedural",
      "date": "1955-05-09",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Accused filed revision under s.439 CrPC in Calcutta High Court, registered as Criminal Revision No. 714 of 1955. High Court issued Rule and stayed realization of fine.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Accused died on July 8, 1955, leaving widow and five minor children except appellant (son).",
      "type": "background",
      "date": "1955-07-08",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant (son and heir) applied on December 6, 1955 to be added as party to continue criminal revision and challenge conviction and sentence.",
      "type": "procedural",
      "date": "1955-12-06",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "High Court on December 22, 1955 allowed substitution only for sentence of fine applying principle of s.431 CrPC, refused to examine conviction as sentence was composite. Reduced fine to Rs. 205/13/-, directed whole amount to B.N. Railway (now South Eastern Railway).",
      "type": "procedural",
      "date": "1955-12-22",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant obtained certificate of fitness under Art. 134(1)(c) Constitution and filed appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Defence of accused was that he over-charged on account of mistake and was prepared to refund excess amount.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a pending application in revision under s.439 CrPC finally abates on the death of the petitioner, and if so, to what extent.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether High Court in revision can limit examination to sentence of fine only, without going into merits of conviction, when sentence is composite of imprisonment and fine.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Application to be substituted as heir to continue revision challenging conviction and sentence.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "s.439 CrPC"
    },
    {
      "id": "pa2",
      "text": "Dissatisfied with High Court's limitation to fine only and reduction thereof.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.431 CrPC applies only to appeals, not revisions. Revision under s.439 does not abate on death; High Court has discretionary power to pass orders as fit in aid of justice.",
      "addresses_issue": "i1",
      "key_observation": "No statutory provision for abatement in revisions; differs from appeals which are statutory rights."
    },
    {
      "id": "cr2",
      "text": "High Court not bound by principle of s.431 for revisions; complete discretion to deal with pending revision on death according to justice requirements.",
      "addresses_issue": "i1",
      "key_observation": "Revisional powers ensure justice, not create litigant rights."
    },
    {
      "id": "cr3",
      "text": "Once revision entertained post-death, High Court can exercise appellate powers including examining correctness of conviction when fine affects estate of deceased.",
      "addresses_issue": "i2",
      "key_observation": "Cannot examine fine without merits of conviction; heir entitled to challenge conviction if fine payable from estate."
    },
    {
      "id": "cr4",
      "text": "Agrees with Bombay HC majority in Imperatrix v. Dongaji Andaji that no abatement in appeal leading to revision possible, but High Court can exercise revision suo motu or otherwise.",
      "addresses_issue": "i1",
      "key_observation": "Right to appeal/continue is statutory; revision discretionary."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Pending revision under s.439 CrPC does not finally abate on death of petitioner; High Court has discretion to continue and examine conviction and sentence including fine.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court cannot limit revision to fine only in composite sentence cases; must examine conviction merits if entertaining revision post-death.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "In re Nabishah",
      "citation": "1894 I.L.R. 19 Bom. 714",
      "treatment": "referred",
      "relevance": "High Court refused revision post-abatement of appeal of deceased, as depended on evidence appreciation."
    },
    {
      "case_name": "Imperatrix v. Dongaji Andaji",
      "citation": "1878 I.L.R. 2 Bom. 564",
      "treatment": "followed",
      "relevance": "Appeal abates on death; no right for legal rep to continue appeal, but High Court may exercise revision; majority view adopted."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "s.439",
        "s.431",
        "s.435",
        "s.411A(2)",
        "s.417",
        "s.250"
      ],
      "relevance": "s.431 governs abatement of appeals only, not revisions; s.439 vests discretionary revisional powers in High Court."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "s.420"
      ],
      "relevance": "Offence of cheating for which accused convicted."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 134(1)(c)"
      ],
      "relevance": "Certificate for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court held that criminal revision does not abate on petitioner's death unlike appeals under s.431 CrPC; High Court erred in limiting to fine and must examine conviction merits. Appeal allowed, setting aside High Court's restriction.",
    "relief_granted": "Full revisional jurisdiction to challenge conviction restored to appellant as legal representative.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The simple question for determination in this appeal... is whether a pending application in revision made under s.439 of the Code... finally abates on the death of the petitioner in the High Court, and if so, to what extent.",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "In our opinion, in the absence of statutory provisions... the High Court has the power to pass such orders as to it may seem fit and proper, in exercise of its revisional jurisdiction vested in it by s.439 of the Code.",
      "speaker": "court",
      "significance": "Key holding on non-abatement of revisions."
    },
    {
      "text": "Once it is held that the High Courts revisional jurisdiction is attracted to such a case, it is difficult to limit the exercise of such a power in the way the High Court has done.",
      "speaker": "court",
      "significance": "Rejects High Court's limitation to fine only."
    }
  ],
  "_case_id": "1958_124",
  "_label": 1,
  "_text_length": 20313,
  "_extracted_at": "2026-02-08T22:34:04.786066"
}