{
  "metadata": {
    "case_name": "Maharaja Bahadur Rama Rajaya Prasad Singh (through LRs) v. Commissioner of Income Tax",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 297 of 1955",
    "date_of_judgment": "1958-10-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Proceedings taken by Income-tax Officer, Special Circle, Patna, against Maharaja Bahadur Rama Rajaya Prasad Singh for income-tax for year 1945-46. Total income assessed at Rs. 1,60,602 including Rs. 93,604 received as interest on arrears of rent after deduction of collection charges.",
      "type": "procedural",
      "date": "1945-12-31",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Assessee urged before ITO that Rs. 93,604 not liable to tax per Patna High Court decision in Kamakshya Narain Singh v. Commissioner of Income Tax (1946) 14 ITR 673. ITO held matter sub judice due to department's appeal to Privy Council, included amount but stayed realisation till Privy Council decision or March 31, 1947, under s. 23(3).",
      "type": "disputed",
      "date": "1945-12-31",
      "source": "assessee | ito"
    },
    {
      "id": "f3",
      "text": "Assessee appealed to Appellate Assistant Commissioner (AAC), Patna. AAC held ITO bound by Patna HC decision, set aside order re Rs. 93,604, directed fresh assessment under ss. 23(3) and 31, distinguishing interest on agricultural vs non-agricultural rent arrears.",
      "type": "procedural",
      "date": "1946-05-08",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "ITO made fresh assessment pursuant to AAC order, deducting whole Rs. 93,604 and some minor reductions.",
      "type": "procedural",
      "date": "1946-08-20",
      "source": "ito"
    },
    {
      "id": "f5",
      "text": "Department's appeal to Privy Council against Patna HC in Kamakshya Narain Singh case allowed; held interest on arrears of rent re agricultural land is taxable income.",
      "type": "background",
      "date": "1948-07-06",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "ITO issued notice under s. 34 to assessee to file fresh return as part of income for year ending March 31, 1946 escaped assessment.",
      "type": "procedural",
      "date": "1948-09-25",
      "source": "ito"
    },
    {
      "id": "f7",
      "text": "First notice defective; fresh notice under amended s. 34 issued.",
      "type": "procedural",
      "date": "1949-03-18",
      "source": "ito"
    },
    {
      "id": "f8",
      "text": "Proceedings under s. 34 led to revised assessment order under ss. 23(3) and 34 adding back Rs. 93,604 as interest on arrears of rent.",
      "type": "procedural",
      "date": "1949-04-30",
      "source": "ito"
    },
    {
      "id": "f9",
      "text": "Assessee appealed revised order; AAC dismissed appeal, held Privy Council decision was information under s. 34(1)(a) and (b), ITO had reason to believe income escaped assessment.",
      "type": "procedural",
      "date": "1949-07-26",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Assessee appealed to Income-tax Appellate Tribunal; Tribunal confirmed AAC order, held s. 34 as amended in 1948 applied, Privy Council decision within s. 34(1)(b).",
      "type": "procedural",
      "date": "1950-08-21",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Assessee died; appellant (son) succeeded to estate.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appellant applied under s. 66(1) for Tribunal to refer question of law to Patna High Court; rejected.",
      "type": "procedural",
      "date": "1951-02-27",
      "source": "tribunal"
    },
    {
      "id": "f13",
      "text": "Appellant moved Patna High Court under s. 66(2); HC allowed, directed Tribunal to refer question.",
      "type": "procedural",
      "date": "1951-12-15",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Tribunal stated case and referred question: 'Whether in the circumstances of the case the assessment order under s. 34 of the Act of the interest on arrears of rent is legal?'",
      "type": "procedural",
      "date": "1952-07-23",
      "source": "tribunal"
    },
    {
      "id": "f15",
      "text": "Patna HC (V. Ramaswamy and C. P. Sinha JJ.) answered question in favour of department.",
      "type": "procedural",
      "date": "1954-04-07",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Appellant obtained certificate under s. 66A(2) from Patna HC that case raises substantial question of law fit for Supreme Court appeal.",
      "type": "procedural",
      "date": "1954-09-13",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "True construction of s. 34(1)(b) of the Income-tax Act: Whether 'information in his possession' includes judicial decision on point of law like Privy Council reversal.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether, where income was duly returned, considered, and assessment order passed excluding it based on binding HC decision later reversed, such income has 'escaped assessment' under s. 34(1)(b).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Relevant 'information' under s. 34(1)(b) means information as to facts, not decision of Privy Council on point of law; context limits to factual material.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Marginal notes to ss. 19A, 20A; ss. 22(3), 28; ss. 33B, 35 provide for revision/rectification"
    },
    {
      "id": "pa2",
      "text": "Where income duly returned for assessment and assessment order passed, it cannot be said to have 'escaped assessment'; escape implies eluding notice, not erroneous decision on merits.",
      "supporting_facts": [
        "f1",
        "f2",
        "f4"
      ],
      "legal_basis": "Rajendranath Mukherjee v. Income-tax Commissioner (1933) 61 IA 10; dictionary meaning of 'escaped'"
    },
    {
      "id": "pa3",
      "text": "S. 34 inapplicable post final assessment; Privy Council in Rajendranath supports narrow view.",
      "supporting_facts": [
        "f4",
        "f8"
      ],
      "legal_basis": "Chatturam Horilram Ltd. v. CIT (1955) 2 SCR 290; In re Lachhiram Basantlal"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "S. 34 as amended in 1948 applies; Privy Council decision is 'information' leading to belief income escaped assessment.",
      "supporting_facts": [
        "f5",
        "f6",
        "f8"
      ],
      "legal_basis": "S. 34(1)(b)"
    },
    {
      "id": "ra2",
      "text": "Income-tax Officer can act under s. 34 even on change of mind or new legal view without external source (suggested).",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "S. 34 (1948 amendment)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Word 'information' in s. 34(1)(b) depends on context; includes true state of law and judicial decisions, as one case under provision (assessed at too low rate) necessarily involves legal information.",
      "addresses_issue": "i1",
      "key_observation": "Information as to law covered; Privy Council decision qualifies."
    },
    {
      "id": "cr2",
      "text": "Even if return submitted and considered, if ITO erroneously fails to tax assessable income due to binding authority later reversed, it has 'escaped assessment'; not limited to oversight or non-return.",
      "addresses_issue": "i2",
      "key_observation": "Escape not confined to inadvertence; includes erroneous non-taxation."
    },
    {
      "id": "cr3",
      "text": "Rajendranath Mukherjee distinguished: applies where proceedings pending, not post-final order; supports post-assessment escape possible.",
      "addresses_issue": "i2",
      "key_observation": "Pending proceedings differ from completed assessment."
    },
    {
      "id": "cr4",
      "text": "Chatturam supports: chargeable income escaping due to invalid prior assessment qualifies.",
      "addresses_issue": "i2",
      "key_observation": "Not mere under-assessment but escape due to legal change."
    },
    {
      "id": "cr5",
      "text": "Divergent HC views noted; Patna HC right that Privy Council decision is information justifying belief of escape.",
      "addresses_issue": "i1",
      "key_observation": "Upholds broader construction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "'Information' in s. 34(1)(b) includes information as to true and correct state of law, covering relevant judicial decisions like Privy Council.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Income considered but not taxed due to erroneous view later corrected escapes assessment under s. 34(1)(b), even post return and final order.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kamakshya Narain Singh v. Commissioner of Income Tax",
      "citation": "1946 14 ITR 673 (Patna HC); 1948 16 ITR 325 (PC)",
      "treatment": "followed (PC); referred",
      "relevance": "Initial basis for exclusion of interest; PC reversal triggered s.34 action"
    },
    {
      "case_name": "Rajendranath Mukherjee v. Income-tax Commissioner",
      "citation": "1933 61 IA 10",
      "treatment": "distinguished",
      "relevance": "Escape assessment inapplicable during pending proceedings; not post-final order"
    },
    {
      "case_name": "In re Lachhiram Basantlal",
      "citation": "1930 ILR 58 Cal 909",
      "treatment": "followed; referred",
      "relevance": "Income escapes if not included in made assessment; approved in Rajendranath"
    },
    {
      "case_name": "Chatturam Horilram Ltd. v. Commissioner of Income-tax, Bihar and Orissa",
      "citation": "1955 2 SCR 290",
      "treatment": "followed",
      "relevance": "Chargeable income escaping due to invalid prior assessment triggers s.34"
    },
    {
      "case_name": "Madan Lal v. Commissioner of I.T., Punjab",
      "citation": "1935 3 ITR 438 (Lahore FB)",
      "treatment": "referred",
      "relevance": "S.34 applies to returned but unassessed income or cancelled assessments"
    },
    {
      "case_name": "Commissioner of Income-tax v. Raja of Parlakimedi",
      "citation": "1926 49 Mad 22",
      "treatment": "followed",
      "relevance": "Escape includes deliberate erroneous construction of Act"
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay v. Sir Mahomed Yusuf Ismail",
      "citation": "1944 12 ITR 8 (Bom)",
      "treatment": "referred",
      "relevance": "Definite information may include state of law (overruling/repeal); Chagla J. narrower but majority broader"
    },
    {
      "case_name": "Raghavalu Naidu & Sons v. Commissioner of Income-tax, Madras",
      "citation": "1945 13 ITR 194",
      "treatment": "referred",
      "relevance": "Followed Bombay; information not limited to pure fact"
    },
    {
      "case_name": "Maharaja Bikram Kishore of Tripura v. Province of Assam",
      "citation": "1949 17 ITR 220",
      "treatment": "distinguished",
      "relevance": "Returned but unassessed income not escape (narrow view)"
    },
    {
      "case_name": "Raja Benoy Kumar Sahas Roy v. Commissioner of I.T., West Bengal",
      "citation": "1953 24 ITR 70? (text: 1933 24 I.T.R. 70 erratum)",
      "treatment": "followed",
      "relevance": "Information as to true state of law from authoritative source is definite information"
    },
    {
      "case_name": "Anderton and Halstead Ltd. v. Birrell",
      "citation": "1932 1 KB 271",
      "treatment": "doubted",
      "relevance": "Discover not mere change of opinion (English Act; later overruled)"
    },
    {
      "case_name": "Commercial Structures Ltd. v. R. A. Briggs",
      "citation": "1948 17 ITR Suppl 30 (CA)",
      "treatment": "referred",
      "relevance": "Overruled Rowlatt J. on change of opinion"
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "34(1)(b)",
        "34(1)(a)",
        "23(3)",
        "31",
        "66(1)",
        "66(2)",
        "66A(2)",
        "22(2)",
        "33B",
        "35",
        "19A",
        "20A",
        "22(3)",
        "28"
      ],
      "relevance": "Governs escaped assessment; information leading to belief of escape permits reassessment within 4 years; 1948 amendment applies"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding Patna High Court; held Privy Council decision constituted 'information' under s. 34(1)(b) justifying belief that income escaped assessment, validating revised assessment adding Rs. 93,604.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the word information in s. 34(1)(b) includes information as to the true and correct state of the law and so would cover information as to relevant judicial decisions.",
      "speaker": "court",
      "significance": "Core holding on scope of 'information'"
    },
    {
      "text": "even in a case where a return has been submitted, if the Income-tax Officer erroneously fails to tax a part of assessable income, it is a case where the said part of the income has escaped assessment.",
      "speaker": "court",
      "significance": "Defines 'escaped assessment' broadly"
    },
    {
      "text": "income has not escaped assessment if there are pending at the time proceedings for the assessment of the assessee's income which have not yet terminated in a final assessment thereof.",
      "speaker": "court",
      "significance": "Quote from Lachhiram approved in Rajendranath, distinguishing pending vs completed cases"
    }
  ],
  "_case_id": "1958_28",
  "_label": 0,
  "_text_length": 34741,
  "_extracted_at": "2026-02-10T19:20:38.614833"
}