{
  "metadata": {
    "case_name": "C. K. Achuthan v. State",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Petition No. 103 of 1958",
    "date_of_judgment": "1958-12-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner held contracts for supply of milk to Government Hospital at Cannanore, Kerala State, ever since 1946, and his brother held similar contracts from 1936.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "In 1957, uniform procedure for fixing contracts adopted; conditions for acceptance of tenders laid down by notification, including no tender at current market rates accepted, preference to approved Co-operative Milk Supply Unions/Societies if within 5% over market/lowest tendered rate; tenders to be opened by Superintendent in presence of parties; requirement of solvency certificate, tax clearance, deposit.",
      "type": "procedural",
      "date": "1957",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Petitioner and third respondent (Co-operative Milk Supplies Society, Cannanore) submitted tenders.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On January 20, 1958, tenders scrutinised; petitioner's tender for supply of milk accepted, third respondent's rejected.",
      "type": "material",
      "date": "1958-01-20",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Superintendent (respondent No. 2, District Medical Officer) communicated reasons for accepting petitioner's tender and rejecting third respondent's to Director of Public Health.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Correspondence between Director of Health Services and second respondent; petitioner informed that contract cancelled per Government policy to give contracts for supply to medical institutions in Cannanore District to Co-operative Milk Supplies Union on prices fixed by Revenue Department.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Further correspondence; pointed out action should be under Cl. 20 of tender conditions (terminate after one month's notice); notice issued to petitioner, contract cancelled after notice period.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Petitioner applied under Art. 226 to High Court of Kerala (O.P. No. 201 of 1958), rejected by Raman Nayar, J. on June 6, 1958; Letters Patent Appeal (A.S. No. 354 of 1958) dismissed by Koshi, C.J. and Vaidialingam, J. on July 7, 1958; High Court held matter is breach of contract, remedy by civil suit, not Art. 226.",
      "type": "procedural",
      "date": "1958-06-06",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "No special leave to appeal sought from Supreme Court against High Court orders; matter brought directly under Art. 32 as infringement of fundamental rights.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether cancellation of petitioner's contract for supply of milk and award to third respondent violates Articles 14, 16(1), 19(1)(g) and 31 of the Constitution, amounting to discrimination and denial of equal opportunity of employment.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether a contract for supply of goods to Government constitutes 'employment' under Article 16(1).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Entitled to equal treatment in the eye of law; discrimination against petitioner vis-a-vis third respondent; protection under Arts. 14, 16(1), 19(1)(g) and 31.",
      "supporting_facts": [
        "f1",
        "f4",
        "f7"
      ],
      "legal_basis": "Articles 14, 16(1), 19(1)(g), 31"
    },
    {
      "id": "pa2",
      "text": "Contract for supply is employment under Art. 16(1), equal opportunity denied.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Article 16(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Policy of Government to give contracts for supply to medical institutions in Cannanore District to Co-operative Milk Supplies Union on prices fixed by Revenue Department.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Petitioner did not acquire absolute right to continue in contract; power reserved under Cl. 20 to terminate after one month's notice; whether exercise regular/legal is for civil courts.",
      "addresses_issue": "i1",
      "key_observation": "Gist is breach of contract, if any; adjudicate in civil courts."
    },
    {
      "id": "cr2",
      "text": "No discrimination under Art. 14; Government can choose contractor like private party.",
      "addresses_issue": "i1",
      "key_observation": "Choice of person to fulfill contract left to Government."
    },
    {
      "id": "cr3",
      "text": "Breach of government contract does not deprive right under Art. 19(1)(g); remedy damages or specific performance in civil court.",
      "addresses_issue": "i1",
      "key_observation": "Not deprivation of right to practise profession/occupation/trade/business."
    },
    {
      "id": "cr4",
      "text": "Art. 31 not applicable to cancellation under contract terms.",
      "addresses_issue": "i1",
      "key_observation": "Cancellation in exercise of powers conferred by contract terms."
    },
    {
      "id": "cr5",
      "text": "Contract for supply of goods is not 'employment' under Art. 16(1); petitioner is contractor/supplier, not servant/employee.",
      "addresses_issue": "i2",
      "key_observation": "Art. 16(1) confined to employment in service, not contractors."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "None of Articles 14, 16(1), 19(1)(g), 31 applicable; no fundamental right involved.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Contract for supply of goods not employment under Art. 16(1).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 226",
        "Article 14",
        "Article 16(1)",
        "Article 19(1)(g)",
        "Article 31"
      ],
      "relevance": "Petition under Art. 32 for enforcement of fundamental rights under Arts. 14, 16(1), 19(1)(g), 31; previous petition under Art. 226 dismissed."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Petition under Art. 32 held wholly misconceived as no fundamental right involved; at best, remedy in civil court for breach of contract.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "When one person is chosen rather than another, the aggrieved party cannot claim the protection of Art. 14, because the choice of the person to fulfill a particular contract must be left to the Government.",
      "speaker": "court",
      "significance": "Rejects Art. 14 discrimination claim in contract selection."
    },
    {
      "text": "A contract for the supply of goods is not a contract of employment in the sense in which that word has been used in the Article.",
      "speaker": "court",
      "significance": "Clarifies Art. 16(1) applies to service employment, not supply contracts."
    },
    {
      "text": "In our opinion, the petition under Art. 32 of the Constitution is wholly misconceived. No fundamental right is involved.",
      "speaker": "court",
      "significance": "Dismisses petition, directs to civil court if advised."
    }
  ],
  "_case_id": "1958_113",
  "_label": 0,
  "_text_length": 8778,
  "_extracted_at": "2026-02-10T19:21:07.901035"
}