{
  "metadata": {
    "case_name": "Appellant v. Commissioner of Income-tax",
    "case_year": 1953,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant was a resident of Ratangarh in the Princely State of Bikaner outside British India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On November 6, 1945, the appellant started a business in Calcutta, with accounts closing on April 9, 1946 (relevant accounting year).",
      "type": "material",
      "date": "1945-11-06",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On January 19, 1946, the appellant came to Calcutta with 11 ten thousand rupees notes and 158 one thousand rupees notes, which he encashed a few days later through Punjab National Bank under High Denomination Notes Order, total value Rs. 2,68,000.",
      "type": "material",
      "date": "1946-01-19",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant credited Rs. 2,68,000 in books of Calcutta business as capital received from him.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant explained notes came from his father who died in 1942.",
      "type": "disputed",
      "date": "1942",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Income-tax Officer held explanation not supported by books/documents, treated Rs. 2,68,000 as income from undisclosed business, taxable.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellate Assistant Commissioner allowed appeal, held books/documents showed notes part of assets from father's death, deleted Rs. 2,68,000 from assessment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Commissioner appealed to Tribunal, which allowed in part: Rs. 1,28,000 as undisclosed income, Rs. 1,40,000 as capital.",
      "type": "procedural",
      "date": "1953-08-07",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellant's adoptive father Mohanlal was partner in Manekchand Tarachand in Calcutta, left in 1906 with large sum (Rs. 6-7 lakhs), started Kaluram Mohanlal business till 1925-26, then retired to Ratangarh, died April 22, 1942.",
      "type": "background",
      "date": "1906",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Appellant succeeded to father's estate including the notes.",
      "type": "disputed",
      "date": "1942-04-22",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Appellant relied on Ratangarh books of account (father's then continued by appellant) showing numbers of ten thousand notes and existence of one thousand notes.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Tribunal found father wealthy, retired 1906 with Rs. 6-7 lakhs, started own business, had substantial moneys in Bikaner State Savings Bank 1926-1942, but doubted genuineness of Ratangarh books.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Reasons for doubting books: no Calcutta business books 1906-1926 produced; no entries of receipt from closed Calcutta business; books only record bank transactions and accommodation loans to relatives; numbers of ten thousand notes in loan entries; incomplete record 1926-1942.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Tribunal found from 1926-1945, only source of income was bank interest; appellant had Rs. 8-10 lakhs in bank ~1945, impossible to have another 7 lakhs in notes.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Appellant assessed as non-resident British subject for 1946-47.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Denomination Notes of Rs. 2,68,000 encashed were part of assets received from father or undisclosed income.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Tribunal's finding that Ratangarh books not genuine is sustainable, or based on no evidence/unreasonable view.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether even if income, taxable without finding accrued in British India as non-resident.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Tribunal's finding that notes not from father unsustainable; Ratangarh books prove notes existed in father's lifetime; AAC correctly accepted books genuine and father's business history.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "Mehta Parikh & Co. v. Commissioner of Income-tax (court entitled to intervene if no evidence or unreasonable view)"
    },
    {
      "id": "pa2",
      "text": "Tribunal's estimation of uninvested cash and sources speculative.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "As non-resident, cannot be taxed without finding income arisen/accrued in British India.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Notes represent concealed profits liable to tax (ITO view); books not genuine.",
      "supporting_facts": [
        "f6",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Supreme Court does not reassess evidence or come to own conclusion; intervenes only if Tribunal acted without evidence or unreasonable view (per Mehta Parikh).",
      "addresses_issue": "i2",
      "key_observation": "Tribunal's reasons for doubting Ratangarh books (no Calcutta books, no closure entries, limited scope, etc.) are reasonable and supported by evidence."
    },
    {
      "id": "cr2",
      "text": "Tribunal's estimation of cash holdings and sources may be speculative but was a concession to appellant, not affecting core finding that notes not proved from father.",
      "addresses_issue": "i1",
      "key_observation": "Gave benefit of Rs. 1,40,000 as capital though strictly not entitled."
    },
    {
      "id": "cr3",
      "text": "Non-resident point not raised earlier, cannot be allowed now.",
      "addresses_issue": "i3",
      "key_observation": "No mention in prior proceedings."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Tribunal's finding that appellant failed to prove notes from father's estate is reasonably possible and sustained; Rs. 1,28,000 taxable as undisclosed income.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Supreme Court will not interfere with Tribunal's factual findings unless perverse.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mehta Parikh & Co. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Test for Supreme Court intervention in factual findings of Tribunal."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 136"
      ],
      "relevance": "Special leave to appeal from Tribunal judgment."
    },
    {
      "name": "High Denominations Notes Order",
      "sections": null,
      "relevance": "Provisions under which notes were encashed."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against Tribunal's judgment upholding Rs. 1,28,000 as undisclosed income dismissed; Tribunal's findings on evidence sustained as reasonable.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The Court would be entitled to intervene if it appears that the fact finding authority has acted without any evidence or upon a view of the facts, which could not reasonably be entertained...\"",
      "speaker": "court",
      "significance": "Test from Mehta Parikh for interference with Tribunal findings."
    },
    {
      "text": "\"It is not the practice of this Court to do so.\" (reassess evidence)",
      "speaker": "court",
      "significance": "Limits Supreme Court's role in factual appeals."
    },
    {
      "text": "\"We are unable to say that the reasons given by the Tribunal... are unfounded or that there was no evidence to support the view that the Tribunal took.\"",
      "speaker": "court",
      "significance": "Upholds Tribunal's rejection of books' genuineness."
    }
  ],
  "_case_id": "1958_120",
  "_label": 0,
  "_text_length": 12119,
  "_extracted_at": "2026-02-08T22:33:54.792067"
}