{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Bombay v. Respondent Assessee Firm",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar J."
    ],
    "case_number": "Civil Appeal No. 128 of 1955",
    "date_of_judgment": "1958-04-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent assessee had been registered as a firm under s. 26A of the Income-tax Act for the year 1946-47.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For assessment years 1947-48, 1948-49 and 1949-50, the Income-tax Officer made assessments on the respondent on June 7, 1949 (for 1947-48), June 7, 1949 (for 1948-49), and September 23, 1949 (for 1949-50) under s. 23(3), estimating profits at Rs. 95,053, Rs. 93,430 and Rs. 83,752 respectively.",
      "type": "procedural",
      "date": "1949-06-07",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The respondent applied for and obtained renewal of registration of the firm.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Income-tax Officer passed order under s. 23(6) allocating shares.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondent appealed to Appellate Assistant Commissioner (AAC). On November 4, 1950, AAC reduced estimated profit by Rs. 28,250 for 1947-48 and Rs. 19,000 for 1948-49. Appeal for 1949-50 pending before AAC.",
      "type": "procedural",
      "date": "1950-11-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Commissioner of Income-tax noticed that respondent firm had a minor partner and thus could not be registered under the Act.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Commissioner issued notice under s. 33B(1) to show cause why assessments under s. 23(3) and registration under s. 26A should not be cancelled.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On June 5, 1951, Commissioner passed order under s. 33B(1) cancelling registration under s. 26A and directing Income-tax Officer to make fresh assessments as unregistered firm for three years.",
      "type": "procedural",
      "date": "1951-06-05",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Income-tax Officer passed fresh assessment orders as a result.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Respondent preferred five appeals to Tribunal: two against AAC orders under s. 31 for 1947-48 and 1948-49; three against Commissioner's orders under s. 33B(1) for three years.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On January 2, 1952, Tribunal upheld respondent's contentions and allowed appeals against Commissioner's orders.",
      "type": "procedural",
      "date": "1952-01-02",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appellant (Commissioner) moved Tribunal under s. 66(1) for reference to High Court. Tribunal referred three questions.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Bombay High Court on March 5, 1953 held Commissioner's order invalid for all three years, citing merger in AAC orders for first two years and pendency of appeal for third year. Did not answer remaining questions.",
      "type": "procedural",
      "date": "1953-03-05",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "High Court rejected certificate under s. 66A(2). Appellant obtained special leave from Supreme Court on March 22, 1954.",
      "type": "procedural",
      "date": "1954-03-22",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Income-tax Officer passed fresh orders dated 21-6-52 without fresh notices under ss. 22 and 23.",
      "type": "procedural",
      "date": "1952-06-21",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of the case the Commissioner of Income-tax acting under s. 33B(1) can set aside the orders passed by the Appellate Assistant Commissioner, for the assessment years 1947-48 and 1948-49?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether on the facts and circumstances of the case the order passed by the Commissioner of Income-tax dated 5th June, 1951, is bad in law as it directs the Income-tax Officer to pass an order in a particular manner?",
      "framed_by": "tribunal"
    },
    {
      "id": "i3",
      "text": "Whether on the facts and circumstances of the case orders passed by the Income-tax Officer dated 21-6-52 are bad in law, as fresh notices as required by Sections 22 and 23 of the Income-tax Act were not given by the Income-tax Officer to the assessee?",
      "framed_by": "tribunal"
    },
    {
      "id": "i4",
      "text": "Whether the order of the Commissioner acting under s. 33B(1) setting aside the order of the Income-tax Officer where an appeal against that order was pending before the Appellate Assistant Commissioner was valid?",
      "framed_by": "high_court"
    },
    {
      "id": "i5",
      "text": "Does the order passed by the Income-tax Officer granting registration to the assessee firm continue to be an order passed by the Income-tax Officer even after the assessee's appeal against the assessment has been disposed of by the Appellate Assistant Commissioner? In other words, does the order of registration merge in the appellate order?",
      "framed_by": "court"
    },
    {
      "id": "i6",
      "text": "Whether the order of registration in respect of 1949-50 can be revised under s. 33B(1) even though appeal against assessment is pending before AAC?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The view taken by High Court that Commissioner could not exercise revisional power under s.33B is based on misconstruction of s.33B. Order granting registration does not merge in appellate order against assessment, as registration order is independent and not appealable by department.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f8"
      ],
      "legal_basis": "s.33B(1), s.26A, s.30(1), s.31"
    },
    {
      "id": "pa2",
      "text": "Registration order stands outside jurisdiction of AAC; AAC powers under s.31 limited to appealable matters under s.30(1). Department has no right of appeal against registration grant.",
      "supporting_facts": [
        "f5",
        "f10"
      ],
      "legal_basis": "s.30(1), s.31(3), s.23(4), r.6B"
    },
    {
      "id": "pa3",
      "text": "For 1949-50, pendency of appeal does not suspend registration order; Commissioner can revise ITO's order even if appeal pending.",
      "supporting_facts": [
        "f5",
        "f8"
      ],
      "legal_basis": "s.33B(1)"
    },
    {
      "id": "pa4",
      "text": "Commissioner's order did not intend to set aside assessments but direct consequential changes post-cancellation of registration. Fresh notices not required for machinery change.",
      "supporting_facts": [
        "f8",
        "f9",
        "f15"
      ],
      "legal_basis": "s.23(5)(b)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Commissioner not competent to set aside assessment confirmed/modified by AAC due to merger doctrine. Registration order merges in appellate order.",
      "supporting_facts": [
        "f5",
        "f8"
      ],
      "legal_basis": "Commissioner of Income-Tax v. Tejaji Farasram Kharawala; Durgabati v. CIT"
    },
    {
      "id": "ra2",
      "text": "Commissioner's order bad as it directs ITO to pass order in particular manner.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s.33B(1)"
    },
    {
      "id": "ra3",
      "text": "Fresh ITO orders bad without notices under ss.22,23.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "ss.22,23"
    },
    {
      "id": "ra4",
      "text": "AAC has wide powers under s.31 to consider registration validity after hearing ITO.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "s.31(3); Rex v. Special Commissioner ex p. Elmhirst"
    },
    {
      "id": "ra5",
      "text": "Revisional power under s.33B extraordinary, not exercisable where alternative remedy in pending appeal.",
      "supporting_facts": [
        "f5",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Order granting registration is independent, separate from assessment order; does not merge in appellate order as it is not appealable under s.30(1) and department has no appeal right. AAC powers under s.31 limited to appealable matters.",
      "addresses_issue": "i5",
      "key_observation": "Registration affects only machinery of collection under s.23(5), not computation of income."
    },
    {
      "id": "cr2",
      "text": "Income-tax Officer's registration order cannot be challenged before AAC in assessee's assessment appeal; stands outside appellate jurisdiction.",
      "addresses_issue": "i1",
      "key_observation": "Scheme of Act gives assessee appeal right only; no department appeal against registration grant."
    },
    {
      "id": "cr3",
      "text": "s.33B applies only to ITO orders; appellate orders outside purview. Distinguished from s.33A.",
      "addresses_issue": "i1",
      "key_observation": "Erroneous prejudicial registration order revisable by Commissioner."
    },
    {
      "id": "cr4",
      "text": "For 1949-50, pendency of appeal does not suspend registration order; no merger until disposal. No alternative remedy for department before AAC.",
      "addresses_issue": "i6",
      "key_observation": "Revisional power determined by s.33B terms, not policy considerations."
    },
    {
      "id": "cr5",
      "text": "Commissioner's order cancelling registration valid; consequential direction for fresh assessments as unregistered not setting aside appellate assessments but adjusting machinery.",
      "addresses_issue": "i2",
      "key_observation": "ITO accepted appellate income figures, applied s.23(5)(b)."
    },
    {
      "id": "cr6",
      "text": "Question 3 does not arise from proceedings; no need for fresh notices on machinery change post-registration cancellation.",
      "addresses_issue": "i3",
      "key_observation": "Subsequent to Commissioner's order."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Registration order does not merge in appellate assessment order; Commissioner can revise under s.33B(1) even after AAC disposal of assessment appeal.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Commissioner's order under s.33B(1) valid even where assessment appeal pending before AAC.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Commissioner's direction not bad for specifying manner; consequential to registration cancellation.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "Fresh ITO orders valid without new notices.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-Tax, Bombay North v. Tejaji Farasram Kharawala",
      "citation": "1953 23 I.T.R. 412",
      "treatment": "distinguished",
      "relevance": "High Court relied on merger doctrine; SC held inapplicable to registration orders."
    },
    {
      "case_name": "Durgabati and Narmadabala Gupta v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Patna HC followed merger view; SC disagreed for registration."
    },
    {
      "case_name": "Commissioner of Income-tax v. Amritlal Bhogilal",
      "citation": "1953 23 I.T.R. 420",
      "treatment": "referred",
      "relevance": "Cited by High Court on pendency issue."
    },
    {
      "case_name": "Shapurji Pallonji v. Commissioner of Income-Tax, Bombay",
      "citation": "1945 13 I.T.R. 113",
      "treatment": "followed",
      "relevance": "Registration affects machinery, not income computation."
    },
    {
      "case_name": "Rex v. The Special Commissioner of Income-Tax ex parte Elmhirst",
      "citation": "1935 20 Tax Cas. 381",
      "treatment": "distinguished",
      "relevance": "Appellate duty to true assessment; does not expand jurisdiction to non-appealable matters."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "s.33B(1)",
        "s.33B(2)",
        "s.33B(3)",
        "s.33B(4)",
        "s.26A",
        "s.23(3)",
        "s.23(5)(a)",
        "s.23(5)(b)",
        "s.23(6)",
        "s.23(4)",
        "s.31",
        "s.30(1)",
        "s.66(1)",
        "s.66A(2)",
        "s.34",
        "r.6B"
      ],
      "relevance": "Revisional power under s.33B(1) to cancel erroneous registration prejudicial to revenue; registration independent; AAC jurisdiction limited."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, reversed High Court judgment, answered all questions in favour of appellant Commissioner. Commissioner's cancellation of registration valid for all three years; consequential ITO orders valid.",
    "relief_granted": "Questions answered in favour of Commissioner; High Court view reversed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the order granting registration to an assessee firm is an independent and separate order and it merely affects or governs the procedure to be adopted in collecting or recovering the tax found due.\"",
      "speaker": "court",
      "significance": "Core reasoning distinguishing registration from assessment."
    },
    {
      "text": "\"the Income-tax Officers order granting registration to a firm cannot become the subject-matter of an appeal before the Appellate Assistant Commissioner.\"",
      "speaker": "court",
      "significance": "Limits AAC jurisdiction; no merger."
    },
    {
      "text": "\"There can be no doubt that the respondent firm cannot be validly registered in view of the fact that one of its partners is a minor\"",
      "speaker": "court",
      "significance": "Merits of cancellation upheld."
    }
  ],
  "_case_id": "1958_78",
  "_label": 1,
  "_text_length": 29994,
  "_extracted_at": "2026-02-08T22:33:28.690232"
}