{
  "metadata": {
    "case_name": "Assessee v. Commissioner of Income-tax, Punjab",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant had been carrying on a business in cloth in Srinagar for a long time.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1943-44 the appellant started a similar business in Amritsar.",
      "type": "background",
      "date": "1943-1944",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In the relevant previous year, between March 25, 1944, and April 12, 1945, for assessment year 1945-46, the appellant remitted from Srinagar to British India an aggregate sum of Rs. 5,00,850 for the purchase of goods there.",
      "type": "material",
      "date": "1944-03-25 to 1945-04-12",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Income-tax Officer, Amritsar, found Rs. 3,00,000 of the remittances to have been the appellant's income in Kashmir accrued prior to such year and after March 31, 1940, and directed tax on Rs. 3,00,000 under section 4(1)(b)(iii) of the Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Appellate Assistant Commissioner held that the amount remitted out of income in Srinagar was Rs. 1,20,000 and not Rs. 3,00,000, and appellant liable to pay tax on Rs. 1,20,000. Order dated July 23, 1951.",
      "type": "procedural",
      "date": "1951-07-23",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellant contended before Appellate Tribunal that moneys remitted from Srinagar out of working funds there and not out of past accumulated income.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Tribunal found no sufficient opportunity given to appellant to establish profits not mixed up in working funds, remanded to Income-tax Officer for enquiry whether remittances included preceding years' profits.",
      "type": "procedural",
      "date": "1953-05-08",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "On remand, appellant admitted profits in Srinagar mixed up with working funds, not possible to work out from accounts to what extent moneys sent were working funds of current year.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Income-tax Officer, on materials from first assessment, reported Appellate Assistant Commissioner's view of Rs. 1,20,000 justified.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Tribunal held appellant failed to discharge burden of rebutting presumption that remittances out of profits, confirmed AAC order.",
      "type": "procedural",
      "date": "1953-05-08",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant for first time before Tribunal after remand argued no remittances to British India as moneys sent by telegraphic money orders and bank drafts under instructions of sellers, post office agent of sellers, moneys became property of sellers upon despatch from Srinagar.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Tribunal held new contention raised new questions of fact requiring further evidence, refused to allow it, dismissed appeal.",
      "type": "procedural",
      "date": "1953-05-08",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appellant applied to Tribunal under section 66(1) for reference to High Court of Punjab, dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appellant did not apply to High Court under section 66(2) due to attachment of properties and recovery proceedings by Department, sought special leave to appeal to Supreme Court instead.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Supreme Court granted special leave on February 1, 1954, and stayed recovery proceedings.",
      "type": "procedural",
      "date": "1954-02-01",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant is liable under section 4(1)(b)(iii) of the Income-tax Act to pay tax on Rs. 1,20,000 remitted by him from Srinagar in Kashmir to British India as his profits accumulated outside British India and brought by him into British India.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the moneys brought into British India by telegraphic money orders and bank drafts despatched from Srinagar were the appellant's moneys or the moneys of the sellers.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Moneys remitted from Srinagar out of working funds there and not out of past accumulated income.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Profits in Srinagar mixed up with working funds, not possible to distinguish remittances as current year working funds.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "No remittances to British India at all: remittances made by telegraphic money orders and bank drafts sent by post from Srinagar under instructions of sellers; appellant had no control after despatch; post office agent of sellers; moneys became property of sellers upon putting into post office at Srinagar.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Remittances deemed out of profits where profits mixed with working funds; burden on appellant to rebut presumption that remittances made out of profits, which was not discharged.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "section 4(1)(b)(iii) of the Income-tax Act"
    },
    {
      "id": "ra2",
      "text": "Tribunal never asked for affidavits or certificate; even if produced, Tribunal could refuse to accept if not allowing new contention.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Tribunal right in holding new contention could not be decided without further evidence; had full jurisdiction to refuse permission to lead evidence; no reason to interfere with discretion.",
      "addresses_issue": "i2",
      "key_observation": "New contention raised for first time after remand; if raised earlier, remand unnecessary."
    },
    {
      "id": "cr2",
      "text": "No order by Tribunal calling for affidavits or certificate; even if permission given earlier, could refuse if not allowing new contention; affidavits and certificate do not support contention.",
      "addresses_issue": "i2",
      "key_observation": "Tribunal justified in refusing leave to raise new contention."
    },
    {
      "id": "cr3",
      "text": "No valid objection to Tribunal's judgment.",
      "addresses_issue": "i1",
      "key_observation": "Appeal liable to be dismissed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Tribunal was right in refusing to allow appellant to raise new contention without further evidence; no interference with Tribunal's discretion.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No valid objection to Tribunal's judgment confirming tax liability on Rs. 1,20,000 under section 4(1)(b)(iii).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "4(1)(b)(iii)",
        "66(1)",
        "66(2)"
      ],
      "relevance": "Liability to tax on profits accumulated outside British India and brought into British India; provisions for reference to High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal against the Appellate Tribunal's order confirming tax liability on Rs. 1,20,000, upholding the Tribunal's refusal to entertain the new contention without further evidence.",
    "relief_granted": null,
    "costs": "with costs"
  },
  "key_quotes": [
    {
      "text": "the burden which lay on the appellant of rebutting the presumption that remittances were made out of profits had not been discharged.",
      "speaker": "court",
      "significance": "Explains basis for upholding tax liability."
    },
    {
      "text": "The Tribunal refused permission to the appellant to lead further evidence and it had full jurisdiction to do so.",
      "speaker": "court",
      "significance": "Justifies refusal of new contention."
    },
    {
      "text": "We find nothing to throw any doubt on the Tribunals finding that the present contention was raised by the appellant for the first time when the case came back to the Tribunal on the report of the Income-tax Officer.",
      "speaker": "court",
      "significance": "Confirms timing of new argument."
    }
  ],
  "_case_id": "1958_156",
  "_label": 0,
  "_text_length": 9361,
  "_extracted_at": "2026-02-08T22:34:49.292216"
}