{
  "metadata": {
    "case_name": "Kakumanu Ramanna (minor) through next friend v. Kakumanu (first defendant) and others",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar J."
    ],
    "case_number": "Civil Appeal No. 326 of 1955",
    "date_of_judgment": "1958-09-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Suit for partition of joint family properties instituted on April 2, 1942, in Court of District Munsif, Ongole, on behalf of minor Kakumanu Ramanna (age about 2 1/2 years) by maternal grandfather Rangayya as next friend.",
      "type": "procedural",
      "date": "1942-04-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "First defendant is father of plaintiff; second and third defendants are sons of first defendant by deceased first wife; fourth defendant is second wife of first defendant and mother of plaintiff; fifth defendant is daughter of first defendant by fourth defendant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Plaintiff alleged three grounds for partition: (1) ill-treatment and neglect to maintain mother and children (not established by lower courts); (2) sale of family properties to Akkul Venkatasubba Reddi for Rs. 2,300 on May 9, 1939, without necessity, to injure plaintiff; (3) items 2 and 11 purchased on June 1, 1938, and June 14, 1939, with joint family funds but sale deeds taken in names of second and third defendants to diminish assets.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Family in good circumstances with no debts.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Defendants filed written statements on June 20, 1942, claiming purchases of items 2 and 11 made with separate funds of second and third defendants; joint family had debts of Rs. 2,600.",
      "type": "disputed",
      "date": "1942-06-20",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Minor plaintiff born on December 20, 1939.",
      "type": "material",
      "date": "1939-12-20",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Minor plaintiff died in January 1943; mother (fourth defendant) recorded as legal representative and transposed as second plaintiff.",
      "type": "procedural",
      "date": "1943-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "District Munsif, Ongole, in O.S. No. 139 of 1946, on rehearing: sale and purchases anterior to birth of minor, no cause of action; items 2 and 11 not proved separate, belong to joint family; no debts; but no cause of action for partition; suit dismissed on December 23, 1946.",
      "type": "procedural",
      "date": "1946-12-23",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Subordinate Judge, Bapatla, in A.S. No. 188 of 1947: affirmed findings on items 2, 11 joint and no debts; sale/purchases prior to birth, suit not maintainable; appeal dismissed on January 28, 1949.",
      "type": "procedural",
      "date": "1949-01-28",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Madras High Court in Second Appeal No. 1815 of 1949: defendants falsely claimed items 2 and 11 as separate; interest adverse to minor; suit beneficial; preliminary decree for partition on April 10, 1953.",
      "type": "procedural",
      "date": "1953-04-10",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appeal to Supreme Court by special leave under Art. 136.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the courts below concurrently found that the suit was not instituted for the benefit of the minor, and whether the High Court could reverse that in second appeal.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the suit for partition abated upon the death of the minor plaintiff before the court decided if it was for his benefit, preventing continuation by his legal representative.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether institution of suit for partition by minor through next friend effects severance in status from date of suit (conditional on court finding it beneficial), or only upon decree.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Concurrent finding by courts below that suit not instituted for benefit of minor; pure question of fact not liable to interference in second appeal.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Suit abates on minor's death before adjudication on benefit; minor incapable of volition; division in status only when court exercises volition on his behalf via decree; interest survives to coparceners, not heirs.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Mitakshara law; Chelimi Chetty v. Subbamma; Lalta Prasad v. Sri Mahadeoji Birajman Temple; Hari Singh v. Pritam Singh"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Defendants acted adversely by denying minor's title to items 2 and 11 and claiming debts; suit beneficial to minor.",
      "supporting_facts": [
        "f5",
        "f8",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Suit for partition by minor stands on same footing as by adult; severance from date of suit conditional on court holding beneficial; does not abate on minor's death; legal representatives can continue.",
      "supporting_facts": [
        "f1",
        "f7"
      ],
      "legal_basis": "Rangasayi v. Nagarathnamma; Ramsing v. Fakira; Mandliprasad v. Ramcharanlal"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Finding of lower courts was misdirection; transactions showed adverse conduct post-birth via denial of title in written statements and trial; beneficial to minor to partition.",
      "addresses_issue": "i1",
      "key_observation": "Defendants 1-3 combined to deny title to items 2 and 11; persisted in appeal; courts below held against them."
    },
    {
      "id": "cr2",
      "text": "Under Mitakshara, coparcener right to partition arises on birth; unequivocal intention via suit causes severance (Girja Bai); applies to minors via next friend; court checks benefit but severance from suit date.",
      "addresses_issue": "i3",
      "key_observation": "Court does not create volition; recognizes intention expressed by next friend if beneficial."
    },
    {
      "id": "cr3",
      "text": "Chelimi Chetty erroneous; power to partition not exclusively court's; next friend/guardian can effect via suit/out-of-court; suit does not abate on death; actio personalis inapplicable as property suit.",
      "addresses_issue": "i2",
      "key_observation": "Legal representatives can continue and prove benefit; severance relates back to plaint."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court could interfere with lower courts' finding as based on misdirection.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Suit for partition by minor through next friend effects severance in status from date of institution, conditional on court finding beneficial; does not abate on minor's death; continuable by legal representatives.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Chelimi Chetty v. Subbamma and followers erroneous; Rangasayi v. Nagarathnamma etc. correct.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Girja Bai v. Sadashiv Dhundiraj",
      "citation": "1916 L.R. 43 I.A. 151",
      "treatment": "followed",
      "relevance": "Every coparcener can sever status by unequivocal intention; suit for partition constitutes such."
    },
    {
      "case_name": "Kawal Nain v. Prabhu Lal",
      "citation": "1917 L.R. 44 I.A. 159",
      "treatment": "followed",
      "relevance": "Even dismissed suit effects severance; status separate upon assertion."
    },
    {
      "case_name": "Chelimi Chetty v. Subbamma",
      "citation": "1917 I.L.R. 41 Mad. 442",
      "treatment": "overruled",
      "relevance": "Held suit abates on minor's death; erroneous as court does not create severance."
    },
    {
      "case_name": "Lalta Prasad v. Sri Mahadeoji Birajman Temple",
      "citation": "1920 I.L.R. 42 All. 461",
      "treatment": "overruled",
      "relevance": "No alteration of status by minor's suit; only on decree."
    },
    {
      "case_name": "Hari Singh v. Pritam Singh",
      "citation": "A.I.R. 1936 Lah. 504",
      "treatment": "overruled",
      "relevance": "Severance only on decree date for accounting."
    },
    {
      "case_name": "Rangasayi v. Nagarathnamma",
      "citation": "1933 I.L.R. 57 Mad. 95",
      "treatment": "followed",
      "relevance": "Severance from suit date conditional on benefit; no abatement on death."
    },
    {
      "case_name": "Ramsing v. Fakira",
      "citation": "I.L.R. 1939 Bom. 256",
      "treatment": "followed",
      "relevance": "Same as Rangasayi."
    },
    {
      "case_name": "Mandliprasad v. Ramcharanlal",
      "citation": "I.L.R. 1947 Nag. 848",
      "treatment": "followed",
      "relevance": "Same as Rangasayi."
    },
    {
      "case_name": "Suraj Narain v. Iqbal Narain",
      "citation": "1912 L.R. 40 I.A. 40",
      "treatment": "referred",
      "relevance": "Coparcener right to separate at will."
    },
    {
      "case_name": "Balkishen Das v. Ram Narain Sahu",
      "citation": "1903 L.R. 30 I.A. 139",
      "relevance": "Partition by relation binding on minor if beneficial."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 136"
      ],
      "relevance": "Special leave for appeal granted."
    },
    {
      "name": "Mitakshara law (Hindu law)",
      "sections": [],
      "relevance": "Governs coparcenary rights to partition and severance of status."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Madras High Court's preliminary decree for partition; rejected appellants' contentions; held suit did not abate and severance effective from plaint date upon finding of benefit.",
    "relief_granted": "Preliminary decree for partition affirmed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the filing of a suit for partition is a clear expression of such an intention, and that, in consequence, there is a severance in status when the action for partition is filed.\"",
      "speaker": "court",
      "significance": "Affirms Girja Bai principle applies to minors via next friend."
    },
    {
      "text": "\"when a court decides that a suit for partition is beneficial to the minor, it does not itself bring about a division in status. The court is not in the position of a super-guardian.\"",
      "speaker": "court",
      "significance": "Overrules Chelimi Chetty; clarifies court's role."
    },
    {
      "text": "\"the true effect of a decision of a court that the action is beneficial to the minor is not to create in the minor proprio vigore a right which he did not possess before but to recognise the right.\"",
      "speaker": "court",
      "significance": "Explains severance relates back to suit institution."
    }
  ],
  "_case_id": "1958_123",
  "_label": 0,
  "_text_length": 28801,
  "_extracted_at": "2026-02-10T19:21:18.425937"
}