{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar J."
    ],
    "case_number": "Civil Appeal No. 433 of 1957",
    "date_of_judgment": "1958-10-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a resident of what was once the independent State of Udaipur.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "There was in that State a Company called the Mewar Industries, Ltd., registered under the provisions of the law in force in that State, and the appellant held 266 shares in that Company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On January 18, 1950, the Company went into liquidation.",
      "type": "material",
      "date": "1950-01-18",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On April 22, 1950, the liquidator distributed a portion of the assets among the shareholders, and the appellant was paid a sum of Rs. 26,000 under this distribution.",
      "type": "material",
      "date": "1950-04-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "It is common ground that this sum represents the undistributed profits of the Company which had accrued during the six accounting years preceding the liquidation (1943-44 to 1948-49).",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "There was no law imposing tax on income in the State of Udaipur, and it was only under the Indian Finance Act, 1950 that the residents of the State of Rajasthan, in which the State of Udaipur had merged, became liable for the first time to pay tax on their income. That Act came into force on April 1, 1950.",
      "type": "background",
      "date": "1950-04-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Concerned with the assessment of tax for the year 1951-52, and that, under s. 3 of the Act, has to be on the income of the previous year, i.e., 1950-51.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "By his order dated July 3, 1952, the Income-tax Officer held that Rs. 26,000 was dividend as defined in s. 2(6A)(c) of the Act and included it in the taxable income of the appellant in the year of account.",
      "type": "procedural",
      "date": "1952-07-03",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The appellant took this order in appeal to the Appellate Assistant Commissioner who by his order dated January 12, 1953, confirmed the assessment.",
      "type": "procedural",
      "date": "1953-01-12",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "There was a further appeal by the appellant to the Appellate Tribunal, who also dismissed it on November 10, 1953.",
      "type": "procedural",
      "date": "1953-11-10",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "On the application of the appellant, the Appellate Tribunal referred the following question for the decision of the High Court: Whether on the facts and in the circumstances of this case, the aforesaid sum of Rs. 26,000 was liable to be taxed in the assessee's hands as dividend within the meaning of that term in s. 2(6A)(c) of the Indian Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The reference was heard by Wanchoo, C. J. and Modi, J. who by their judgment dated August 24, 1956, answered it in the affirmative.",
      "type": "procedural",
      "date": "1956-08-24",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appeal to Supreme Court preferred on a certificate granted by the High Court under s. 66A(2) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The Indian Companies Act came into operation in the Udaipur territory on April 1, 1951, only by force of the Part B States Laws Act, 1951.",
      "type": "background",
      "date": "1951-04-01",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sum of Rs. 26,000 received by the appellant on April 22, 1950, is dividend as defined in s. 2(6A)(c) of the Indian Income-tax Act, 1922, particularly whether the profits accumulated during 1943-44 to 1948-49 constitute accumulated profits of the six previous years preceding the date of liquidation.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under the definition in s. 2(6A)(c), the assets distributed after liquidation will be dividend only if they represented profits accumulated during the six previous years preceding the date of liquidation, but previous year as defined in s. 2(11) means the year previous to the assessment year, and since there was no year of assessment prior to April 1, 1950 in Udaipur/Rajasthan, the years 1943-44 to 1948-49 cannot be previous years.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "s. 2(6A)(c), s. 2(11) of Indian Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "The definition in s. 2(11) should apply unless repugnant, and words in singular include plural per s. 13(2) General Clauses Act.",
      "supporting_facts": [],
      "legal_basis": "s. 2 Indian Income-tax Act, 1922; s. 13(2) General Clauses Act, 1897"
    },
    {
      "id": "pa3",
      "text": "Mewar Industries Ltd. was not a company as defined in s. 2(6) during relevant period as Indian Companies Act applied only from 1951.",
      "supporting_facts": [
        "f2",
        "f14"
      ],
      "legal_basis": "s. 2(6) Indian Income-tax Act, 1922; Part B States Laws Act, 1951"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The expression 'six previous years' in s. 2(6A)(c) is not used in the technical sense of s. 2(11), but means six consecutive accounting years preceding the liquidation of the company.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "s. 2(6A)(c) Indian Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The definition of 'previous year' in s. 2(11) does not apply to 'six previous years' in s. 2(6A)(c) as it would be repugnant; cannot have six previous years to one assessment year, and singular cannot be pluralized to nullify definition.",
      "addresses_issue": "i1",
      "key_observation": "Expression 'previous year' in s. 2(6A)(c) used in different sense from s. 2(11)."
    },
    {
      "id": "cr2",
      "text": "Policy of s. 2(6A)(c): To treat distribution of accumulated profits in liquidation as dividend, limited to profits of six years prior to liquidation, as cycle of six accounting years preceding liquidation; 'previous years' connotes financial/accounting years of company.",
      "addresses_issue": "i1",
      "key_observation": "Enacted to remove anomaly from Burrell case where liquidation distributions were capital."
    },
    {
      "id": "cr3",
      "text": "Current profits in liquidation not dividend; accumulated profits are those from financial years preceding liquidation year.",
      "addresses_issue": "i1",
      "key_observation": "Six previous years are 1943-44 to 1948-49 excluding current year from April 1, 1949."
    },
    {
      "id": "cr4",
      "text": "Relies on observations in CIT v. K. Srinivasan that 'previous year' can mean completed accounting year preceding a contingency, not always tied to assessment year.",
      "addresses_issue": "i1",
      "key_observation": "'Previous year' substantially means an accounting year preceding the financial year of assessment or a contingency."
    },
    {
      "id": "cr5",
      "text": "Point on company definition not arising from Tribunal order and involves disputed facts; cannot be raised.",
      "addresses_issue": "i1",
      "key_observation": "Mewar Industries Ltd. assessable as company for 1948."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The sum of Rs. 26,000 received by the appellant on April 22, 1950, is dividend as defined in s. 2(6A)(c) of the Act and is chargeable to tax.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioners of Inland Revenue v. Burrell",
      "citation": "(1924) 9 T.C. 27",
      "treatment": "referred",
      "relevance": "Held distribution in liquidation not dividend as capital; anomaly removed by s. 2(6A)(c)."
    },
    {
      "case_name": "Appavu Chettiar v. Commissioner of Income-tax",
      "citation": "1956 29 I.T.R. 768",
      "treatment": "followed",
      "relevance": "Current profits of company in liquidation distributed to shareholders not dividend u/s 2(6A)(c)."
    },
    {
      "case_name": "Girdhardas Co. Ltd. v. Commissioner of Income-tax",
      "citation": "1957 31 I.T.R. 82",
      "treatment": "followed",
      "relevance": "Current profits of company in liquidation distributed to shareholders not dividend u/s 2(6A)(c)."
    },
    {
      "case_name": "Commissioner of Income-tax, Madras v. K. Srinivasan and K. Gopalan",
      "citation": "1953 S.C.R. 486",
      "treatment": "referred",
      "relevance": "Expression 'previous year' can mean accounting year preceding a contingency, not always tied to assessment year."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 2(6A)(a)",
        "s. 2(6A)(c)",
        "s. 2(11)",
        "s. 3",
        "s. 66(1)",
        "s. 66A(2)",
        "s. 2(6)"
      ],
      "relevance": "Definition of dividend includes distribution out of accumulated profits on liquidation from six previous years; previous year definition; assessment on previous year income; reference and certificate; company definition."
    },
    {
      "name": "Indian Finance Act, 1950",
      "sections": [],
      "relevance": "Made residents of Rajasthan liable to income tax from April 1, 1950."
    },
    {
      "name": "General Clauses Act, 1897",
      "sections": [
        "s. 13(2)"
      ],
      "relevance": "Singular includes plural unless repugnant."
    },
    {
      "name": "Part B States Laws Act, 1951",
      "sections": [],
      "relevance": "Brought Indian Companies Act into Udaipur from April 1, 1951."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The Supreme Court holds that the sum of Rs. 26,000 is dividend under s. 2(6A)(c) and chargeable to tax.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'Previous year' means in respect of any separate source of income, profits and gains (a) the twelve months ending on the 31st day of March next preceding the year for which the assessment is to be made.",
      "speaker": "court",
      "significance": "Definition from s. 2(11) central to dispute."
    },
    {
      "text": "When s. 2(6A)(c) speaks of six previous years, it is obvious that it uses the expression previous year in a sense different from that which is given to it in s. 2(11).",
      "speaker": "court",
      "significance": "Key reasoning why definition does not apply."
    },
    {
      "text": "The expression previous year substantially means an accounting year comprised of a full period of twelve months and usually corresponding to a financial year preceding the financial year of assessment... In a certain context it may well mean a completed accounting year immediately preceding the happening of a contingency.",
      "speaker": "court",
      "significance": "From Srinivasan case, supports broad interpretation."
    }
  ],
  "_case_id": "1958_63",
  "_label": 0,
  "_text_length": 17012,
  "_extracted_at": "2026-02-08T22:17:05.845126"
}