{
  "metadata": {
    "case_name": "Assessee v. Income-tax Authorities",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar J."
    ],
    "case_number": "Civil Appeal No. 433 of 1957",
    "date_of_judgment": "1958-10-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a resident of what was once the independent State of Udaipur.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "There was in that State a Company called the Mewar Industries, Ltd., registered under the provisions of the law in force in that State, and the appellant held 266 shares in that Company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On January 18, 1950, the Company went into liquidation.",
      "type": "material",
      "date": "1950-01-18",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On April 22, 1950, the liquidator distributed a portion of the assets among the shareholders, and the appellant was paid a sum of Rs. 26,000 under this distribution.",
      "type": "material",
      "date": "1950-04-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "It is common ground that this sum represents the undistributed profits of the Company which had accrued during the six accounting years preceding the liquidation (1943-44 to 1948-49).",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "There was no law imposing tax on income in the State of Udaipur, and it was only under the Indian Finance Act, 1950 that the residents of the State of Rajasthan, in which the State of Udaipur had merged, became liable for the first time to pay tax on their income. That Act came into force on April 1, 1950.",
      "type": "background",
      "date": "1950-04-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Concerned with the assessment of tax for the year 1951-52, and that, under s. 3 of the Act, has to be on the income of the previous year, i.e., 1950-51.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "By his order dated July 3, 1952, the Income-tax Officer held that this was dividend as defined in s. 2(6A)(c) of the Act and included it in the taxable income of the appellant in the year of account.",
      "type": "procedural",
      "date": "1952-07-03",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The appellant took this order in appeal to the Appellate Assistant Commissioner who by his order dated January 12, 1953, confirmed the assessment.",
      "type": "procedural",
      "date": "1953-01-12",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "There was a further appeal by the appellant to the Appellate Tribunal, who also dismissed it on November 10, 1953.",
      "type": "procedural",
      "date": "1953-11-10",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "On the application of the appellant, the Appellate Tribunal referred the following question for the decision of the High Court: Whether on the facts and in the circumstances of this case, the aforesaid sum of Rs. 26,000 was liable to be taxed in the assessee's hands as dividend within the meaning of that term in s. 2(6A)(c) of the Indian Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The reference was heard by Wanchoo, C. J. and Modi, J. who by their judgment dated August 24, 1956, answered it in the affirmative.",
      "type": "procedural",
      "date": "1956-08-24",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appeal to Supreme Court on a certificate granted by the High Court under s. 66A(2) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sum of Rs. 26,000 received by the appellant on April 22, 1950, is dividend as defined in s. 2(6A)(c) of the Indian Income-tax Act, 1922.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under the definition in s. 2(6A)(c) the assets of a company distributed after it has gone into liquidation will be dividend only if they represented the profits thereof accumulated during the six previous years preceding the date of the liquidation, and those profits had been accumulated during the years 1943-44 to 1948-49, but those years cannot be said to be previous years within s. 2(6A)(c) because previous year as defined in s. 2(11) means the year which is previous to the assessment year, and there was no year of assessment prior to April 1, 1950 in the State of Udaipur/Rajasthan.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "s. 2(6A)(c), s. 2(11) of Indian Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "The Indian Companies Act came into operation in the Udaipur territory on April 1, 1951, only by force of the Part B States Laws Act, 1951, that during the relevant period the Mewar Industries Ltd. was not a company as defined in s. 2(6) of the Act, and therefore the distribution could not be held to be a dividend as defined in s. 2(6A)(c).",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "s. 2(6), s. 2(6A)(c) of Indian Income-tax Act, 1922; Part B States (Laws) Act, 1951"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The expression six previous years is used in s. 2(6A)(c) not in the technical and restricted sense in which the words previous year are used in s. 2(11) of the Act, and that, in the context, it means six consecutive accounting years preceding the liquidation of the company.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "s. 2(6A)(c), s. 2(11) of Indian Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The definitions given in s. 2 of the Act are to govern unless there is anything repugnant in the subject or context. Applying the definition of previous year in s. 2(11) to six previous years in s. 2(6A)(c) is repugnant because previous year is singular and previous to a specific assessment year, making it a contradiction to speak of six previous years.",
      "addresses_issue": "i1",
      "key_observation": "It would be repugnant to the definition of dividend in s. 2(6A)(c) to import into the words six previous years the definition of previous year in s. 2(11) of the Act."
    },
    {
      "id": "cr2",
      "text": "Policy underlying s. 2(6A)(c): To assimilate distribution of accumulated profits by liquidator to distribution by working company, but limited to profits accumulated within six years prior to liquidation; those years must be a cycle of six years preceding the liquidation, meaning accounting years.",
      "addresses_issue": "i1",
      "key_observation": "The reason requires that those years must be a cycle of six years preceding the liquidation, and that is what is meant by the words previous years."
    },
    {
      "id": "cr3",
      "text": "s. 13(2) of General Clauses Act does not apply as it would nullify the definition; cannot have six previous years to one assessment year.",
      "addresses_issue": "i1",
      "key_observation": "To read a previous year in s. 2(11) would be to nullify the previous year enacted therein, and such a construction must therefore be rejected as repugnant to the context."
    },
    {
      "id": "cr4",
      "text": "Cites CIT v. K. Srinivasan: previous year can mean a completed accounting year immediately preceding the happening of a contingency, not necessarily wedded to an assessment year.",
      "addresses_issue": "i1",
      "key_observation": "In a certain context it may well mean a completed accounting year immediately preceding the happening of a contingency."
    },
    {
      "id": "cr5",
      "text": "Second contention not arising out of Tribunal order and involves disputed facts, hence not entertainable.",
      "addresses_issue": "i1",
      "key_observation": "As the point turns on disputed question of fact, it cannot be allowed to be raised at this stage."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The sum of Rs. 26,000 received by the appellant on April 22, 1950, is dividend as defined in s. 2(6A)(c) of the Act and is chargeable to tax.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioners of Inland Revenue v. Burrell",
      "citation": "(1924) 9 T.C. 27",
      "treatment": "followed",
      "relevance": "Held distribution of accumulated profits in liquidation was not dividend; anomaly removed by s. 2(6A); current profits in liquidation also not dividend."
    },
    {
      "case_name": "Appavu Chettiar v. Commissioner of Income-tax",
      "citation": "1956 29 I.T.R. 768",
      "treatment": "followed",
      "relevance": "Current profits of a company in liquidation which are distributed to the shareholders are not dividend within s. 2(6A)(c)."
    },
    {
      "case_name": "Girdhardas Co. Ltd. v. Commissioner of Income-tax",
      "citation": "1957 31 I.T.R. 82",
      "treatment": "followed",
      "relevance": "Current profits of a company in liquidation which are distributed to the shareholders are not dividend within s. 2(6A)(c)."
    },
    {
      "case_name": "Commissioner of Income-tax, Madras v. K. Srinivasan and K. Gopalan",
      "citation": "1953 S.C.R. 486",
      "treatment": "followed",
      "relevance": "Expression previous year means an accounting year preceding the happening of a contingency, not necessarily tied to assessment year."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 66(1)",
        "s. 2(6A)(a)",
        "s. 2(6A)(c)",
        "s. 2(11)",
        "s. 3",
        "s. 66A(2)",
        "s. 2(6)"
      ],
      "relevance": "Definition of dividend includes distribution out of accumulated profits on liquidation from six previous years; previous year defined; assessment on previous year income; reference and appeal provisions; definition of company."
    },
    {
      "name": "Indian Finance Act, 1950",
      "sections": [],
      "relevance": "Made residents of Rajasthan liable to income tax from April 1, 1950."
    },
    {
      "name": "General Clauses Act, 1897",
      "sections": [
        "s. 13(2)"
      ],
      "relevance": "Singular includes plural unless repugnant."
    },
    {
      "name": "Part B States (Laws) Act, 1951",
      "sections": [],
      "relevance": "Brought Indian Companies Act into operation in Udaipur from April 1, 1951."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The Supreme Court holds that the sum of Rs. 26,000 received by the appellant is dividend as defined in s. 2(6A)(c) of the Indian Income-tax Act, 1922, and is chargeable to tax.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We are satisfied that it would be repugnant to the definition of dividend in s. 2(6A)(c) to import into the words six previous years the definition of previous year in s. 2(11) of the Act.",
      "speaker": "court",
      "significance": "Rejects application of s. 2(11) definition to s. 2(6A)(c)."
    },
    {
      "text": "In the result, we hold that the sum of Rs. 26,000 received by the appellant on April 22, 1950, is dividend as defined in s. 2(6A)(c) of the Act and is chargeable to tax.",
      "speaker": "court",
      "significance": "Final holding on the sole issue."
    },
    {
      "text": "The expression previous year substantially means an accounting year comprised of a full period of twelve months and usually corresponding to a financial year preceding the financial year of assessment... In a certain context it may well mean a completed accounting year immediately preceding the happening of a contingency.",
      "speaker": "court",
      "significance": "From cited precedent, supports broad interpretation of previous year."
    }
  ],
  "_case_id": "1958_63",
  "_label": 0,
  "_text_length": 17012,
  "_extracted_at": "2026-02-10T19:20:26.593428"
}