{
  "metadata": {
    "case_name": "Appellant (Reversioner of Kari Veerappa) v. Setra Veeravva & Sesalvada Kotra Basayya",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "IMAM, J."
    ],
    "case_number": "Civil Appeal No. 120 of 1955",
    "date_of_judgment": "1958-12-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Kari Veerappa executed will Exbt. P-2 on October 10, 1920, authorizing his wife Setra Veeravva (first defendant) to adopt a son for continuation of his family, with permission to adopt as many times as necessary if previous adoption unsuccessful, but only a boy approved by respectable persons appointed in paragraph 14 of the will.",
      "type": "material",
      "date": "1920-10-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Kari Veerappa died on October 23, 1920.",
      "type": "background",
      "date": "1920-10-23",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "After Kari Veerappa's death, Veeravva made first adoption attempt in 1939, but the boy died; validity questioned but not pursued as boy died.",
      "type": "procedural",
      "date": "1939",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Veeravva entered registered agreement to adopt second defendant Sesalvada Kotra Basayya (Exbt. D-25) dated September 18, 1942; adoption took place on October 11, 1942; registered deed of adoption dated June 23, 1943 referencing the agreement.",
      "type": "material",
      "date": "1942-09-18",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Agreement Exbt. D-25 stated Veeravva to remain in possession of husband's estate during her lifetime despite adoption.",
      "type": "material",
      "date": "1942-09-18",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant, claiming to be nearest reversioner of Kari Veerappa, filed Original Suit No. 39 of 1943 for declaration that adoption of second defendant was invalid and not binding on reversioners.",
      "type": "procedural",
      "date": "1943",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "District Judge of Bellary dismissed suit on November 26, 1945, granted compensatory costs.",
      "type": "procedural",
      "date": "1945-11-26",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellant appealed to Madras High Court in Appeal No. 55 of 1946; appeal dismissed on March 25, 1949; High Court affirmed District Judge on adoption validity, held appellant was a reversioner but need not prove nearest until seeking possession after Veeravva's death, disallowed compensatory costs.",
      "type": "procedural",
      "date": "1949-03-25",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "High Court granted certificate for appeal to Supreme Court on substantial question of law: whether adoption invalid without approval/consent of five trustees in para 14 of will, and if authority ends if any trustee did not accept, died, or refused approval.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "In written statement, Veeravva and second defendant stated Veeravva came into possession of husband's property, recovered possession via decree in O.S. 20 of 1921, in sole possession up to date, adoption subject to her retention of enjoyment, possession, management during lifetime.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Affidavit by second defendant in Supreme Court admitted Veeravva still in possession of adoptive father's estate per agreement of September 18, 1942.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Appellant's affidavit stated he understands possession with second defendant, not Veeravva; did not assert personal knowledge.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Hindu Succession Act, 1956 came into force on June 17, 1956.",
      "type": "background",
      "date": "1956-06-17",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Is the adoption of the second defendant invalid, as the approval or consent of the five trustees mentioned in paragraph 14 of the will of Kari Veerappa was not obtained and is the authority to adopt at an end if any one of those five persons did not accept the trusteeship or died before the adoption or refused to give their approval.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the suit is maintainable in view of Section 14 of the Hindu Succession Act, 1956, assuming the adoption is invalid, as Veeravva would become full owner of the estate.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Meaning of 'any property possessed by a female Hindu' in Section 14(1) of the Hindu Succession Act, 1956 - whether actual physical possession or broader including constructive possession.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether Section 14(2) applies due to restricted estate under will or agreement to adopt.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Section 14 HSA does not apply as estate was in possession of second defendant, not Veeravva, at commencement of Act; requires actual possession as condition precedent.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Section 14 Hindu Succession Act, 1956"
    },
    {
      "id": "pa2",
      "text": "Veeravva got restricted estate under will Exbt. P-2 and agreement Exbt. D-25, invoking Section 14(2); power of adoption derived from husband's authority or agnates' consent, not ownership; reversioner entitled to challenge invalid adoption bringing stranger during widow's lifetime.",
      "supporting_facts": [
        "f1",
        "f4",
        "f5"
      ],
      "legal_basis": "Section 14(2) Hindu Succession Act, 1956; Section 42 Specific Relief Act"
    },
    {
      "id": "pa3",
      "text": "Appellant should get opportunity to prove actual possession by second defendant via evidence.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Even on respondents' case, Veeravva's estate divested by adoption per ante-adoption agreement.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Suit fails under Section 14 HSA regardless of adoption validity: if valid, suit dismissed; if invalid, Veeravva full owner, suit not maintainable by reversioner.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Section 14 Hindu Succession Act, 1956"
    },
    {
      "id": "ra2",
      "text": "'Possessed by' in Section 14 means ownership and possession in law, not mere physical; includes constructive possession; Veeravva in possession since husband's death, per agreement, written statement, affidavit.",
      "supporting_facts": [
        "f2",
        "f5",
        "f10",
        "f11"
      ],
      "legal_basis": "Section 14 Hindu Succession Act, 1956"
    },
    {
      "id": "ra3",
      "text": "Even if adoption invalid, second defendant's possession permissive, Veeravva in constructive possession.",
      "supporting_facts": [
        "f4",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court question on adoption validity need not be considered due to preliminary objection under Section 14 HSA; appellate court can consider change in law.",
      "addresses_issue": "i1",
      "key_observation": "Assume adoption invalid for objection."
    },
    {
      "id": "cr2",
      "text": "'Any property possessed by a female Hindu' in Section 14(1) means broad sense: state of owning or having in one's hands or power, includes constructive possession, possession in law (e.g., via licensee, agent); not limited to actual physical possession.",
      "addresses_issue": "i3",
      "key_observation": "Follows Andhra Pradesh, Calcutta views; possession on date Act came into force."
    },
    {
      "id": "cr3",
      "text": "Veeravva acquired property before Act; in constructive possession at commencement even if second defendant in actual possession (permissive); affidavits show Veeravva in possession per agreement.",
      "addresses_issue": "i2",
      "key_observation": "No need for remand on possession as broad interpretation applies."
    },
    {
      "id": "cr4",
      "text": "Section 14(2) inapplicable: will para 4 only if trustees and Veeravva disagree (no evidence); para 12 devolves on Veeravva as intestacy if adoption invalid; agreement Exbt. D-25 confers no estate, just possession during life.",
      "addresses_issue": "i4",
      "key_observation": "Veeravva full owner."
    },
    {
      "id": "cr5",
      "text": "Reversioner cannot challenge full owner's acts like adoption/alienation; Section 42 Specific Relief Act Illustration (f) for limited owners only.",
      "addresses_issue": "i2",
      "key_observation": "Suit not maintainable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 14(1) Hindu Succession Act, 1956 enlarges limited estate to absolute if possessed by female Hindu at commencement; 'possessed' includes constructive possession.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Veeravva in possession (constructive) of husband's estate at Act's commencement; became full owner even if adoption invalid; suit by reversioner not maintainable.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No need to decide adoption validity.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Lachmeshwar Prasad Shukul v. Keshwar Lal Chaudhuri",
      "citation": "1940 F.C.R. 84",
      "treatment": "followed",
      "relevance": "Appellate court entitled to consider change in law."
    },
    {
      "case_name": "Rama Ayodhya Missir v. Raghunath Missir",
      "citation": "A.I.R. 1957 Pat. 480",
      "treatment": "distinguished",
      "relevance": "Patna view that reversioners lose rights under ss.14-15; dissented from."
    },
    {
      "case_name": "Mt. Janki Kuer v. Chhathu Prasad",
      "citation": "A.I.R. 1957 Pat. 674",
      "treatment": "distinguished",
      "relevance": "Patna view that reversioners lose rights under ss.14-15; dissented from."
    },
    {
      "case_name": "Mt. Lukai v. Niranjan",
      "citation": "A.I.R. 1958 Madh. Pra. 160",
      "treatment": "followed",
      "relevance": "Dissent from Patna views on s.14."
    },
    {
      "case_name": "Harak Singh v. Kailash Singh",
      "citation": "A.I.R. 1958 Pat. 581",
      "treatment": "followed",
      "relevance": "Patna overrules prior decisions; Act benefits females in possession, not alienees."
    },
    {
      "case_name": "Gaddam Venkayamma v. Gaddam Veerayya",
      "citation": "A.I.R. 1957 Andh. Pra. 280",
      "treatment": "followed",
      "relevance": "'Possessed' in broad sense, includes possession in law."
    },
    {
      "case_name": "Gostha Behari v. Haridas Samanta",
      "citation": "A.I.R. 1957 Cal. 557",
      "treatment": "followed",
      "relevance": "'Possessed' means possession (actual, constructive, or in law) at Act's commencement."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hindu Succession Act, 1956",
      "sections": [
        "Section 14",
        "Section 14(1)",
        "Section 14(2)",
        "Section 15"
      ],
      "relevance": "Enlarges limited estate of female Hindu in possession to absolute ownership; applies if possessed at commencement; sub-s.(2) excludes restricted estates by gift/will etc."
    },
    {
      "name": "Specific Relief Act",
      "sections": [
        "Section 42"
      ],
      "relevance": "Reversioner's right to challenge limited owner's acts for preservation; inapplicable to full owner."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; suit not maintainable as Veeravva became full owner under Section 14 HSA even assuming invalid adoption; no decision on adoption validity needed.",
    "relief_granted": "None",
    "costs": "Not specified"
  },
  "key_quotes": [
    {
      "text": "'possessed in s. 14 is used in a broad sense and in the context possession means the state of owning or having in ones hand or power.'",
      "speaker": "court",
      "significance": "Core interpretation of 'possessed' under Section 14(1) HSA."
    },
    {
      "text": "The opening words in property possessed by a female Hindu obviously mean that to come within the purview of the section the property must be in possession of the female concerned at the date of the commencement of the Act.",
      "speaker": "court",
      "significance": "Adopts Calcutta HC view on timing and scope of possession."
    },
    {
      "text": "under the Act Veeravva becoming a full owner of her husbands estate, the suit could not succeed and the appeal must accordingly fail.",
      "speaker": "court",
      "significance": "Final holding on maintainability."
    }
  ],
  "_case_id": "1958_69",
  "_label": 0,
  "_text_length": 22035,
  "_extracted_at": "2026-02-10T19:20:31.124098"
}