{
  "metadata": {
    "case_name": "Virsa Singh v. State",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "BOSE J."
    ],
    "case_number": "Criminal Appeal No. 90 of 1957",
    "date_of_judgment": "1958-03-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The incident occurred about 8 p.m. on July 13, 1955.",
      "type": "material",
      "date": "1955-07-13",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Khem Singh died about 5 p.m. the following day.",
      "type": "material",
      "date": "1955-07-14",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "There was only one injury on Khem Singh caused by the appellant with a spear thrust.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Doctor who examined Khem Singh while alive described punctured wound 2 x 1/2 transverse in direction on the left side of the abdominal wall in the lower part of the iliac region just above the inguinal canal; three coils of intestines were coming out of the wound.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Postmortem doctor described the injury as an oblique incised stitched wound 2 1/2 on the lower part of left side of belly, 1 3 above the left inguinal ligament; injury through whole thickness of abdominal wall; peritonitis present; digested food in cavity; flakes of pus round small intestines; six cuts at various places on intestines; digested food flowing out from three cuts.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "The doctor said the injury was sufficient to cause death in the ordinary course of nature.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Appellant was 21 or 22 years old.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellant tried with five others under ss. 302/149, 324/149, 323/149 IPC; individually under s.302.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Others acquitted of murder by Sessions Court but convicted under ss. 326, 324, 323/149; all acquitted by High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Sessions Judge convicted appellant under s.302; common object of assembly to cause grievous hurts; appellant gave forceful blow causing death; peritonitis supervened.",
      "type": "procedural",
      "date": "1956-06-26",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court upheld appellant's conviction and sentence under s.302; accepted finding that appellant inflicted the injury and medical testimony that blow was fatal; affair was sudden on chance meeting.",
      "type": "procedural",
      "date": "1956-11-21",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Special leave to appeal granted by Supreme Court limited to question: on the finding accepted by Punjab High Court, what offence is made out.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "On the finding accepted by the Punjab High Court, what offence is made out by the appellant, particularly whether the facts disclose an offence of murder under s.300 thirdly IPC as there was no proved intention to inflict bodily injury sufficient in the ordinary course of nature to cause death.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The facts do not disclose an offence of murder because prosecution has not proved intention to inflict bodily injury sufficient in ordinary course of nature to cause death; intention must relate not only to bodily injury but also to it being sufficient to cause death.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Section 300, thirdly IPC"
    },
    {
      "id": "pa2",
      "text": "Where death caused by single blow, difficult to be certain of degree of bodily injury intended.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Emperor Sardarkhan Jaridkhan"
    },
    {
      "id": "pa3",
      "text": "If on totality of evidence room for more than one view as to intent, prosecution must prove intent; if doubt, entitled to acquittal.",
      "supporting_facts": [],
      "legal_basis": "R v. Steane"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No specific arguments detailed; court notes prosecution proved act with natural consequences.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 300 thirdly requires: (1) objectively, bodily injury present; (2) nature of injury proved; (3) intention to inflict that particular injury; (4) objectively, that injury sufficient to cause death in ordinary course. Intention to cause the injury found is subjective; sufficiency is objective inference. No need for intention to kill or knowledge of seriousness.",
      "addresses_issue": "i1",
      "key_observation": "Once intention to inflict the specific injury is proved (presumed from circumstances absent explanation), and injury sufficient to cause death, it is murder under s.300 thirdly."
    },
    {
      "id": "cr2",
      "text": "Here, no evidence or explanation why spear thrust into abdomen with force penetrating bowels, intestines out, digested food oozing; only possible inference is intention to inflict that injury.",
      "addresses_issue": "i1",
      "key_observation": "Absence of explanation makes perverse to conclude no intention."
    },
    {
      "id": "cr3",
      "text": "Distinguishes cases: intent separate from seriousness; not necessary to prove intent to injure specific organs; broad common sense enquiry whether struck vital spot with sufficient force.",
      "addresses_issue": "i1",
      "key_observation": "No licence to inflict injuries sufficient to cause death claiming lack of intent to kill."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The offence falls under s.300 thirdly IPC; conviction under s.302 upheld as all four elements proved.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "R v. Steane",
      "citation": "1947 1 All E.R. 813",
      "treatment": "referred",
      "relevance": "Particular intent must be proved by prosecution; if totality of evidence leaves doubt on intent, acquittal; but if act's natural consequences proved without explanation, intent inferred."
    },
    {
      "case_name": "Emperor Sardarkhan Jaridkhan",
      "citation": "1917 I.L.R. 41 Bom. 27",
      "treatment": "distinguished",
      "relevance": "Linking intent with seriousness of injury erroneous; intent is to inflict the injury present, separate from its seriousness."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "300 (thirdly)",
        "149",
        "324",
        "323",
        "326",
        "49"
      ],
      "relevance": "Murder conviction under s.302 based on s.300 thirdly; other sections for co-accused charges."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; conviction and life sentence under s.302 IPC for murder of Khem Singh upheld by Supreme Court.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "No one has a licence to run around inflicting injuries that are sufficient to cause death in the ordinary course of nature and claim that they are not guilty of murder.",
      "speaker": "court",
      "significance": "Core holding rejecting defence of lack of murderous intent."
    },
    {
      "text": "To put it shortly, the prosecution must prove the following facts before it can bring a case under s.300, thirdly: First, bodily injury present; Secondly, nature proved; Thirdly, intention to inflict that injury; Fourthly, injury sufficient to cause death.",
      "speaker": "court",
      "significance": "Defines four objective/subjective elements for s.300 thirdly."
    },
    {
      "text": "Whether the wound is serious or otherwise... is a totally separate and distinct question and has nothing to do with the question whether the prisoner intended to inflict the injury in question.",
      "speaker": "court",
      "significance": "Clarifies separation of intent from injury severity."
    }
  ],
  "_case_id": "1958_148",
  "_label": 0,
  "_text_length": 15178,
  "_extracted_at": "2026-02-08T22:34:46.943930"
}