{
  "metadata": {
    "case_name": "M. P. Davis v. Commissioner of Agricultural Income-tax, Coorg",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Prior to assessment year 1952-53, appellant M. P. Davis was registered owner of Kaimabetta Coffee Estate and assessed as individual.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant's brother P. W. Davis managed the estate as agent on basis of principal-agent or master-servant relationship before the deed.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For assessment year 1951-52, P. W. Davis appeared as agent of appellant in assessment proceedings.",
      "type": "background",
      "date": "1951-52",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "For assessment year 1952-53, appellant claimed change of status to partnership with brother under partnership deed Exhibit 12, sought registration under section 26 of Coorg Agricultural Income-tax Act, 1951.",
      "type": "procedural",
      "date": "1952-53",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Partnership purportedly constituted for joint working of Kaimabetta Estate and transacting business of coffee, citrus, pepper and other businesses.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Agricultural Income-tax Officer, Coorg refused registration, holding document does not create partnership relation, brother is servant.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Order confirmed by Deputy Commissioner of Agricultural Income-tax, Coorg.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellant applied to Commissioner under section 54(2) for reference to Mysore High Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Question referred: Whether, upon materials produced by assessee, Agricultural Income-tax Officer justified in rejecting deed as not creating partnership relation.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court answered question against appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant obtained special leave to appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Even after pleading change of status for 1952-53, appellant claimed loss of previous year and full expenses against receipts of 1951-52.",
      "type": "material",
      "date": "1952-53",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Books of account did not show change in management of estate despite agreement.",
      "type": "material",
      "date": "1952-53",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the document (Exhibit 12) created a relation of partnership between appellant M. P. Davis and his brother P. W. Davis.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Partnership deed Exhibit 12 constituted partnership for joint working of estate and other businesses, entitling firm to registration under section 26.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Section 26 of Coorg Agricultural Income-tax Act, 1951"
    },
    {
      "id": "pa2",
      "text": "Even if special powers conferred on one partner, does not negative partnership; estate became capital of firm, liabilities enforceable against it.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "In re Ambalal Sarabhai; Raghunandan Nanu Kothare v. Hormasji Bezonjee Bamjee; Robinson v. Ashton"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Document does not create partnership; brother remains servant/agent; no change in real relationship despite deed; conduct and books show continuity of master-servant relation.",
      "supporting_facts": [
        "f2",
        "f3",
        "f6",
        "f12",
        "f13"
      ],
      "legal_basis": "Section 6 of Partnership Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Regard must be had to real relation between parties as shown by all relevant facts taken together (section 6 Partnership Act); prior master-servant relation, no change in conduct/books, supports no partnership.",
      "addresses_issue": "i1",
      "key_observation": "Findings of fact by tax authorities relevant against appellant."
    },
    {
      "id": "cr2",
      "text": "Document lacks decisive terms for partnership: estate as capital but brother cannot contribute/deal with it, reverts to appellant on dissolution; no interest for brother.",
      "addresses_issue": "i1",
      "key_observation": "Brother to work diligently, maintain accounts (appellant to inspect), submit estimates for appellant's approval; control with appellant."
    },
    {
      "id": "cr3",
      "text": "Brother prevented from advancing moneys; remuneration from profits only (not if loss); no provision for sharing losses; complicated profit sharing.",
      "addresses_issue": "i1",
      "key_observation": "Sharing profits/remuneration contingent on profits does not create partnership (section 6 Partnership Act)."
    },
    {
      "id": "cr4",
      "text": "Powers given to brother akin to those of servant/agent; precedents distinguished as limited utility in construing documents; facts show inferior position of brother, estate never became partnership capital.",
      "addresses_issue": "i1",
      "key_observation": "Not real partnership, but cloak over pre-existing master-servant relation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Document does not create partnership relation between the two brothers.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "In re Ambalal Sarabhai",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Bombay HC held control with one partner and extra rights does not negative partnership; but unusual husband-wife document upheld on construction."
    },
    {
      "case_name": "Raghunandan Nanu Kothare v. Hormasji Bezonjee Bamjee",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Agreement between solicitors upheld as partnership despite no loss liability; conduct over years inconsistent with non-partnership."
    },
    {
      "case_name": "Robinson v. Ashton",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Partner's mill as firm capital, liabilities enforceable; but here estate never became partnership capital."
    }
  ],
  "statutes_cited": [
    {
      "name": "Coorg Agricultural Income-tax Act, 1951",
      "sections": [
        "26",
        "54(2)"
      ],
      "relevance": "Registration of firms; reference to High Court."
    },
    {
      "name": "Partnership Act",
      "sections": [
        "6"
      ],
      "relevance": "Determining partnership by real relation from all facts; profit sharing/remuneration contingent on profits does not create partnership."
    },
    {
      "name": "Indian Income-tax Act",
      "sections": [],
      "relevance": "Provisions correspond to Coorg Act."
    },
    {
      "name": "Indian Contract Act",
      "sections": [
        "239"
      ],
      "relevance": "Mentioned in Ambalal Sarabhai precedent."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; High Court correct in holding no partnership created by document; relation remains master-servant.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In determining whether a group of persons is or is not a firm regard shall be had to the real relation between the parties, as shown by all relevant facts taken together.\"",
      "speaker": "court",
      "significance": "Quotes section 6 Partnership Act, central to analysis."
    },
    {
      "text": "\"These provisions taken along with the conduct of the parties to the instrument earlier mentioned, clearly indicate that it was not the intention of the parties to bring about the relationship of partners but only to continue under the cloak of a partnership the pre-existing and real relationship, namely, that between a master and his servant.\"",
      "speaker": "court",
      "significance": "Core holding on true intention."
    }
  ],
  "_case_id": "1958_92",
  "_label": 0,
  "_text_length": 12861,
  "_extracted_at": "2026-02-08T22:33:13.006774"
}