{
  "metadata": {
    "case_name": "Assessee v. Commissioner of Income-tax, Punjab",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant had been carrying on a business in cloth in Srinagar for a long time.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1943-44 the appellant started a similar business in Amritsar.",
      "type": "background",
      "date": "1943-1944",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In the relevant previous year, between March 25, 1944, and April 12, 1945, the appellant remitted from Srinagar to British India an aggregate sum of Rs. 5,00,850 for the purchase of goods.",
      "type": "material",
      "date": "1944-03-25 to 1945-04-12",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Income-tax Officer, Amritsar, found Rs. 3,00,000 of the remittances to be income in Kashmir accrued prior to such year and after March 31, 1940, and directed tax on it.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Appellate Assistant Commissioner held amount remitted out of income in Srinagar was Rs. 1,20,000 and appellant liable to pay tax on it, dated July 23, 1951.",
      "type": "procedural",
      "date": "1951-07-23",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellate Tribunal confirmed AAC's order, dated May 8, 1953.",
      "type": "procedural",
      "date": "1953-05-08",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellant contended before Tribunal that moneys remitted from Srinagar out of working funds there and not out of past accumulated income.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Tribunal remanded case to Income-tax Officer for enquiry whether moneys sent included preceding years' profits.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "On remand, appellant admitted profits in Srinagar mixed up with working funds and not possible to work out extent from accounts.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Income-tax Officer reported AAC's view of Rs. 1,20,000 justified based on earlier materials.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Tribunal held appellant failed to discharge burden of rebutting presumption that remittances out of profits.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "After ITO report, appellant for first time argued no remittances to British India as moneys sent by telegraphic money orders and bank drafts on instructions of sellers, thus becoming sellers' property upon despatch from Srinagar post office.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Tribunal refused to allow new contention as it raised new questions of fact requiring further evidence.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appellant applied to Tribunal under section 66(1) for reference to High Court, dismissed; did not apply under 66(2) due to attachment of properties.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Supreme Court granted special leave to appeal on February 1, 1954, and stayed recovery proceedings.",
      "type": "procedural",
      "date": "1954-02-01",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant is liable under section 4(1)(b)(iii) of the Income-tax Act to pay tax on Rs. 1,20,000 remitted by him from Srinagar in Kashmir to British India as his profits accumulated outside British India and brought into British India.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the moneys brought into British India by telegraphic money orders and bank drafts despatched from Srinagar were the appellant's moneys or the sellers' moneys.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Moneys had been remitted from Srinagar out of the working funds there and not out of past accumulated income.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Profits in Srinagar were mixed up with working funds, but remittances were not out of profits.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "There were no remittances to British India at all; remittances made on account of price of goods purchased by appellant in British India by telegraphic money orders and bank drafts sent by post from Srinagar under instructions of sellers; once despatched, moneys became property of sellers and post office was agent of sellers; thus moneys brought into India were sellers' moneys, not appellant's.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Tribunal had asked for affidavits and certificate from bank, which were produced.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant failed to show that remittances had not been out of profits; burden lay on appellant to rebut presumption that remittances were made out of profits.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Tribunal never asked for affidavits or certificate.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Tribunal was right in holding that the question whether moneys were appellant's or not could not be decided without taking further evidence; Tribunal had full jurisdiction to refuse permission to lead further evidence.",
      "addresses_issue": "i2",
      "key_observation": "New contention raised for first time after remand; if raised earlier, remand unnecessary."
    },
    {
      "id": "cr2",
      "text": "No reason to interfere with Tribunal's discretion in refusing to allow new contention; affidavits and certificate do not support contention even if produced.",
      "addresses_issue": "i2",
      "key_observation": "Tribunal justified in refusing leave to raise new contention."
    },
    {
      "id": "cr3",
      "text": "No valid objection to Tribunal's judgment.",
      "addresses_issue": "i1",
      "key_observation": "Upholds Tribunal's confirmation of AAC order."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant liable to tax on Rs. 1,20,000 under section 4(1)(b)(iii) as profits accumulated outside British India brought into British India.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Tribunal rightly refused to entertain new contention without further evidence.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "4(1)(b)(iii)",
        "66(1)",
        "66(2)"
      ],
      "relevance": "Liability for tax on remitted profits accumulated outside British India; provisions for reference to High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the Appellate Tribunal's order confirming tax liability on Rs. 1,20,000 is dismissed; Tribunal justified in not allowing new contention without further evidence.",
    "relief_granted": null,
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "the burden which lay on the appellant of rebutting the presumption that remittances were made out of profits had not been discharged.",
      "speaker": "court",
      "significance": "Explains why tax liability upheld"
    },
    {
      "text": "The Tribunal refused permission to the appellant to lead further evidence and it had full jurisdiction to do so.",
      "speaker": "court",
      "significance": "Justifies refusal of new argument"
    }
  ],
  "_case_id": "1958_156",
  "_label": 0,
  "_text_length": 9361,
  "_extracted_at": "2026-02-10T19:21:47.837575"
}