{
  "metadata": {
    "case_name": "Wife and Sons of Daulatram Hukamchand v. Official Assignee",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar J."
    ],
    "case_number": "Civil Appeal No. 197 of 1956",
    "date_of_judgment": "1958-02-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Deed of gift executed by insolvent Daulatram Hukamchand on May 22, 1950, in favour of his wife and three sons who are the appellants.",
      "type": "material",
      "date": "1950-05-22",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Some creditors of Daulatram filed a petition in the High Court of Judicature at Bombay, Insolvency Case No. 74 of 1951, for an order that Daulatram be adjudged insolvent as he had given notice of suspension of payment of debts on August 2, 1951.",
      "type": "procedural",
      "date": "1951-08-02",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Daulatram was adjudicated insolvent on August 21, 1951, with the result that the estate of the insolvent vested in the respondent official assignee under s. 17 of the Presidency Towns Insolvency Act.",
      "type": "procedural",
      "date": "1951-08-21",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On September 26, 1951, the respondent official assignee took out notice of motion under s. 55 of the Presidency Towns Insolvency Act for declaration that the deed of gift was void.",
      "type": "procedural",
      "date": "1951-09-26",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Appellants 1 to 3 filed a joint affidavit setting out facts and circumstances under which the deed of gift was executed; in substance, though purported to be a gift, it was really a transaction supported by valuable consideration and did not fall within mischief of s. 55.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "At hearing before Mr. Justice Coyajee, appellants sought to lead evidence in support of plea; respondent objected under s. 92 Indian Evidence Act; objection overruled, evidence allowed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Justice Coyajee did not accept appellants' contention; by judgment dated January 28, 1954, granted declaration under s. 55.",
      "type": "procedural",
      "date": "1954-01-28",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellants preferred Appeal No. 30 of 1954 heard by Chagla C.J. and Shah J.; held Justice Coyajee erred in allowing oral evidence; gift executed out of natural love and affection, s. 92 barred evidence of valuable consideration; appeal dismissed on August 6, 1954.",
      "type": "procedural",
      "date": "1954-08-06",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Application for certificate rejected by High Court on September 23, 1954; special leave granted by Supreme Court on November 3, 1954.",
      "type": "procedural",
      "date": "1954-11-03",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellants were entitled to lead oral evidence to show the real nature of the impugned transaction evidenced by the deed of gift, i.e., supported by valuable consideration rather than natural love and affection.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "True scope and effect of ss. 91 and 92 of the Indian Evidence Act, particularly whether s. 92 applies to proceedings between official assignee and donees from insolvent under s. 55 Presidency Towns Insolvency Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Though document purported to be a gift, it was really a transaction supported by valuable consideration and as such did not fall within the mischief of s. 55 of the Act.",
      "supporting_facts": [
        "f1",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Evidence sought by appellants inadmissible under s. 92 Indian Evidence Act to show transaction supported by valuable consideration rather than natural love and affection.",
      "supporting_facts": [
        "f1",
        "f6"
      ],
      "legal_basis": "s. 92 Indian Evidence Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "ss. 91 and 92 supplement each other; s. 91 excludes oral evidence of document contents, s. 92 excludes oral agreements contradicting etc. terms between parties or representatives in interest.",
      "addresses_issue": "i2",
      "key_observation": "s. 92 applies only between parties to instrument or representatives in interest; strangers not bound."
    },
    {
      "id": "cr2",
      "text": "Official assignee under s. 55 not representative in interest of insolvent; acts for creditors' benefit, not insolvent; property already transferred out of estate; higher title than insolvent.",
      "addresses_issue": "i2",
      "key_observation": "Proceedings under s. 55 for creditors' benefit; official assignee like creditor who can apply if assignee refuses."
    },
    {
      "id": "cr3",
      "text": "s. 92 inapplicable between official assignee (stranger) and donees (parties); both can lead evidence of oral agreement to contradict etc. terms; rule of mutuality.",
      "addresses_issue": "i1",
      "key_observation": "s. 99 clarifies strangers' rights; no prohibition on parties against strangers."
    },
    {
      "id": "cr4",
      "text": "s. 91 does not exclude oral evidence varying terms; that is s. 92's domain, which does not apply here.",
      "addresses_issue": "i1",
      "key_observation": "Document terms proved by itself; oral evidence admissible as s. 92 inapplicable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s. 92 Indian Evidence Act wholly inapplicable to proceedings between official assignee and donees; appellants entitled to lead oral evidence in support of plea.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Official assignee not representative in interest of insolvent in s. 55 proceedings.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "R. Cheadle",
      "citation": "3 B. and Ad. 833",
      "treatment": "referred",
      "relevance": "Extrinsic evidence excluded only between parties or privies, not between stranger and party due to lack of mutuality."
    }
  ],
  "statutes_cited": [
    {
      "name": "Presidency Towns Insolvency Act",
      "sections": [
        "s. 17",
        "s. 55"
      ],
      "relevance": "Estate vests in official assignee on adjudication; transfers voidable by official assignee if within two years."
    },
    {
      "name": "Provincial Insolvency Act",
      "sections": [
        "s. 53A",
        "s. 54A"
      ],
      "relevance": "Similar provisions for voidable transfers by receiver or creditor."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "s. 91",
        "s. 92",
        "s. 99"
      ],
      "relevance": "Exclusion of oral evidence for document terms and agreements varying them between parties; inapplicable to strangers."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Supreme Court set aside the decree of the Division Bench of Bombay High Court dismissing the appeal and remanded the appeal back to the High Court for disposal on merits in accordance with law, holding that s. 92 Evidence Act inapplicable and oral evidence admissible.",
    "relief_granted": "Appeal allowed; High Court judgment set aside; remanded for decision on merits including oral evidence.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the official assignee also cannot be said to be the representative-in-interest of the insolvent in these proceedings.",
      "speaker": "court",
      "significance": "Core holding on why s. 92 does not apply."
    },
    {
      "text": "s. 92 is wholly inapplicable to the present proceedings and so the appellants are entitled to lead evidence in support of the plea raised by them.",
      "speaker": "court",
      "significance": "Direct resolution of principal issue."
    },
    {
      "text": "in proceedings between a party and a stranger, will the former be estopped, since there would be no mutuality.",
      "speaker": "court",
      "significance": "Explains doctrine allowing evidence against strangers."
    }
  ],
  "_case_id": "1958_2",
  "_label": 1,
  "_text_length": 19824,
  "_extracted_at": "2026-02-10T19:19:39.199652"
}