{
  "metadata": {
    "case_name": "Past Directors of Bank of Commerce Ltd. v. Official Liquidator",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur J."
    ],
    "case_number": "Criminal Appeal No. 28 of 1956",
    "date_of_judgment": "1958-09-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Bank of Commerce Ltd. was ordered to be wound up by the High Court of Calcutta on August 7, 1950, and one G. Dutt, Bar-at-law was appointed its Official Liquidator but on September 7, 1950, the Official Receiver was appointed in place of Dutt.",
      "type": "procedural",
      "date": "1950-08-07",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On January 15, 1951, Bachawat J. made an order under s. 179 which provided that the official liquidator be at liberty to institute or defend any suit or prosecution, or other legal proceedings, civil or criminal in the name and on behalf of the said Bank.",
      "type": "procedural",
      "date": "1951-01-15",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On July 22, 1952, the official liquidator obtained an order from Bannerji J. under s. 237(1) of the Indian Companies Act stating that the applicant be at liberty to take such civil or criminal proceedings as he may think necessary over the report of Jasoda Dulal Adhikary read with affidavits.",
      "type": "procedural",
      "date": "1952-07-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On July 23, 1952, respondent No. 1 filed a complaint in the Court of the Presidency Magistrate against the appellants under ss. 120B, 406, 467, 477A, Indian Penal Code and 182A of the Indian Companies Act, stating he was doing so under the authority of the official liquidator who had obtained directions of the High Court.",
      "type": "procedural",
      "date": "1952-07-23",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Appellant No. 1 is one of the past directors of the Bank of Commerce Ltd., now in liquidation, and appellant No. 2 was its Managing Director.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On May 5, 1953, the appellants applied to the Presidency Magistrate for dismissal of the complaint as being without the sanction of the Company Judge.",
      "type": "procedural",
      "date": "1953-05-05",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "On June 13, 1953, the Presidency Magistrate dismissed the appellants' application.",
      "type": "procedural",
      "date": "1953-06-13",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The appellants applied to the Calcutta High Court for quashing the criminal proceedings on the ground that the prosecution was ab initio void because of absence of prior direction judicially given by the High Court under s. 237(1).",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "During pendency of the complaint, appellants took an appeal against the order of Company Judge dated July 22, 1952, but it was dismissed on objection by liquidator that it was administrative, not judicial.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On August 5, 1953, the official liquidator took out misfeasance proceedings under s. 235 of the Companies Act.",
      "type": "procedural",
      "date": "1953-08-05",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Calcutta High Court on June 21, 1954, in Criminal Revision No. 811 of 1953, found against appellants, discharged the rule, holding provisions of s. 237(1) not a bar, orders valid as relevant facts before Company Judge.",
      "type": "procedural",
      "date": "1954-06-21",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Leave to appeal refused by Calcutta High Court, appellants came to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the prosecution by the official liquidator is void ab initio in the absence of prior judicial direction by the Court under s. 237(1) of the Indian Companies Act, and whether the orders dated January 15, 1951 and July 22, 1952 constitute such valid directions.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether s. 237(1) requires the Court to give the accused an opportunity before directing prosecution, and whether it is a condition precedent to prosecution by liquidator.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Prosecution ab initio void without prior direction judicially given by High Court under s. 237(1); official liquidator incompetent without sanction of Company Judge.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "s. 237 Indian Companies Act; s. 179 requires sanction"
    },
    {
      "id": "pa2",
      "text": "Direction under s. 237(1) requires opportunity to accused to make statement, as per proviso; ex parte order invalid.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "s. 237(1) and proviso; Nazir Ahmad v. Crown"
    },
    {
      "id": "pa3",
      "text": "Court must have complete control; liquidator can only act within statute; no prosecution without Court sanction.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": "ss. 179, 180, 183, 235, 237 Companies Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "s. 237(1) not a bar to prosecution by liquidator; orders of Bachawat J. (s.179) and Bannerji J. (s.237(1)) valid as relevant facts placed before Company Judge via report and affidavits.",
      "supporting_facts": [
        "f2",
        "f3",
        "f12"
      ],
      "legal_basis": "s. 237(1), s. 179 Companies Act"
    },
    {
      "id": "ra2",
      "text": "s. 237 deals with Court powers to direct, not condition precedent; liquidator empowered under s.179(a); no limitation on criminal court under CrPC.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "ss. 179, 237 Companies Act; Jaswantrai Manilal Akhaney v. State of Bombay"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s. 237(1) does not require prior judicial direction as condition precedent; liquidator may prosecute under s.179 with sanction; even absent direction, proceedings valid.",
      "addresses_issue": "i1",
      "key_observation": "Section contains no words indicating prosecution cannot be instituted without sanction; s.179 empowers liquidator, s.237 empowers Court to direct."
    },
    {
      "id": "cr2",
      "text": "No prerequisite to give accused opportunity before Court direction under s.237(1); proviso applies to registrar under sub-s.(6).",
      "addresses_issue": "i2",
      "key_observation": "Opportunity not required before Judge's direction for liquidator to prosecute."
    },
    {
      "id": "cr3",
      "text": "Orders of January 15, 1951 (s.179) and July 22, 1952 (s.237(1)) valid; relevant facts before Company Judge in report and affidavits.",
      "addresses_issue": "i1",
      "key_observation": "High Court rightly held orders proper; all relevant facts placed before Judge."
    },
    {
      "id": "cr4",
      "text": "Precedents confirm no sanction required under s.179 for prosecution; Companies Act nowhere provides prosecution invalid without direction.",
      "addresses_issue": "i1",
      "key_observation": "Supported by Jaswantrai, Emperor v. Bishan Sahai, Mrityunjoy Chakravarti v. Provot Kumar Pal."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Official liquidator can institute criminal complaint without specific prior direction under s.237(1); such direction not condition precedent, proceedings not void ab initio.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Court under s.237(1) need not hear accused before directing liquidator to prosecute.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jaswantrai Manilal Akhaney v. The State of Bombay",
      "citation": "1956 S.C.R. 483",
      "treatment": "followed",
      "relevance": "No sanction under s.179 required for prosecution; no limitation on criminal court."
    },
    {
      "case_name": "Emperor v. Bishan Sahai",
      "citation": "I.L.R. 1937 All. 779",
      "treatment": "followed",
      "relevance": "Companies Act nowhere provides criminal prosecution cannot be instituted without Judge's directions."
    },
    {
      "case_name": "Mrityunjoy Chakravarti v. Provot Kumar Pal",
      "citation": "A.I.R. 1953 Cal. 153",
      "treatment": "followed",
      "relevance": "ss.179, 237 do not invalidate prosecution without Court direction."
    },
    {
      "case_name": "Re London and Globe Finance Corporation",
      "citation": "1903 1 Ch. 728",
      "treatment": "referred",
      "relevance": "Principles for Court directing prosecution: not for vengeance, but enforcement of law."
    },
    {
      "case_name": "Nazir Ahmad v. Crown",
      "citation": "1936 L.R. 63 I.A. 372",
      "treatment": "distinguished",
      "relevance": "Act must be done in authorised way, but s.237 lays no such procedure for directions."
    },
    {
      "case_name": "Re Northern Counties Bank Limited",
      "citation": "1883 31 W.R. 546",
      "treatment": "referred",
      "relevance": "Prosecution not ordered if creditors oppose and insufficient evidence."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Companies Act",
      "sections": [
        "s. 179",
        "s. 180",
        "s. 183",
        "s. 235",
        "s. 237"
      ],
      "relevance": "s.179 empowers liquidator to institute prosecutions with sanction; s.237 empowers Court to direct prosecution of delinquents; no condition precedent."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 120B",
        "s. 406",
        "s. 467",
        "s. 477A"
      ],
      "relevance": "Sections under which complaint filed against appellants."
    },
    {
      "name": "Indian Companies Act",
      "sections": [
        "s. 182A"
      ],
      "relevance": "Section under which complaint filed."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "ss. 196",
        "s. 197"
      ],
      "relevance": "No prohibitory words like in these sections requiring previous sanction."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, holding that the criminal proceedings instituted by the official liquidator were valid and not void ab initio, as no prior specific direction under s.237(1) is a condition precedent, and the existing orders under ss.179 and 237(1) were proper.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"There can be no question in the present case that the relevant facts were all placed before the Company Judge, because they are all set out in the report of Adhikary and the affidavits annexed thereto to which the order expressly refers.\"",
      "speaker": "calcutta_high_court",
      "significance": "Confirms validity of Company Judge's order under s.237(1)."
    },
    {
      "text": "\"Section 237(1) does not lay down any procedure for the giving of directions and the provisions in regard to the action taken by the registrar do not have any relevancy to what the court should do before it gives directions.\"",
      "speaker": "court",
      "significance": "Rejects need for hearing accused before direction."
    },
    {
      "text": "\"It would thus appear that both on the language of s. 237(1) as well as on precedent the complaint made by the liquidator against the appellants suffers from no such infirmity as to make the proceedings null and void.\"",
      "speaker": "court",
      "significance": "Core holding upholding prosecution."
    }
  ],
  "_case_id": "1958_61",
  "_label": 0,
  "_text_length": 25116,
  "_extracted_at": "2026-02-10T19:20:28.599439"
}