{
  "metadata": {
    "case_name": "Appellant v. Respondent No. 1",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "IMAM, J."
    ],
    "case_number": "Civil Appeal No. 480 of 1958",
    "date_of_judgment": "1958-12-18"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant, respondent No. 1, and respondent No. 3 were candidates for the general seat in Daspalla double-member constituency (one seat reserved for scheduled caste) in Orissa Legislative Assembly election held on February 27, 1957.",
      "type": "background",
      "date": "1957-02-27",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant obtained 17,700 votes, respondent No. 1 obtained 15,568 votes, respondent No. 3 obtained 3,589 votes; appellant declared elected on March 5, 1957.",
      "type": "admitted",
      "date": "1957-03-05",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent No. 1 filed election petition questioning appellant's election on various grounds, including improper acceptance of respondent No. 3's nomination as he was Sarbarakar of 10 villages in Nayagarh district (disqualified as office of profit).",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Election Tribunal, Puri, in Election Case No. 1/67 of 1957, dismissed petition on October 26, 1957, holding no grounds established.",
      "type": "procedural",
      "date": "1957-10-26",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Respondent No. 1 appealed to Orissa High Court in Misc. Appeal No. 194 of 1957; High Court on April 15, 1958, held respondent No. 3 disqualified but acceptance of nomination not materially affecting election under cl. d of sub-s. 1 of s. 100 of the Act.",
      "type": "procedural",
      "date": "1958-04-15",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "High Court considered three corrupt practice grounds: bribery (not established), false statements in pamphlet Exbt. 8 (not established), obtaining assistance from Sarpanches of certain Grama Panchayats under s. 123(7)(f) of the Act (held established).",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "High Court set aside appellant's election, but opined fit case for Election Commission to remove 6-year disqualification under s. 144 of the Act.",
      "type": "procedural",
      "date": "1958-04-15",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant granted certificate for appeal to Supreme Court under Art. 133(1)(c), but Supreme Court grants special leave under Art. 136 as point of law of considerable public importance.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a Sarpanch of a Grama Panchayat constituted under the Orissa Grama Panchayats Act, 1948, is a person in the service of the Government and belongs to the class of revenue officers including village accountants specified in cl. f of s. 123(7) of the Representation of the People Act, 1951, such that obtaining assistance from such Sarpanches constitutes corrupt practice.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether acceptance of respondent No. 3's nomination materially affected the election under cl. d of sub-s. 1 of s. 100 of the Representation of the People Act, 1951.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sarpanch under Orissa Grama Panchayats Act, 1948, is not in service of Government: elected by Grama Panchayat (not appointed by Government), acts under authority of Grama Panchayat, receives no remuneration from Government; restricted power of removal not conclusive; akin to Municipality Chairman.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Orissa Grama Panchayats Act, 1948 ss. 8, 10, 16"
    },
    {
      "id": "pa2",
      "text": "Even if in service, Sarpanch not revenue officer or village accountant under cl. f of s. 123(7).",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Representation of the People Act, 1951 s. 123(7)(f)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "\"In service of Government\" wider than \"serving under\"; exercise of governmental functions amounts to being in Government's service; Sarpanch equated to patwari etc.; read \"and\" as \"or\" before classes in s. 123(7); extensive Government control/supervision under Orissa Act.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Orissa Grama Panchayats Act, 1948 various ss. (10,11,14,16,17,22,32,35,36,44,97,98,99,117A); Representation of the People Act, 1951 s. 123(7)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Distinction between \"serving under\" (pre-amendment s.123(8)) and \"in the service of the Government\" (post-amendment s.123(7)); latter imports master-servant relationship with right of control over work.",
      "addresses_issue": "i1",
      "key_observation": "No provisions of Orissa Act indicate Sarpanch in service of Government; elected, no Govt remuneration, acts under Panchayat authority."
    },
    {
      "id": "cr2",
      "text": "Govt control/supervision over Grama Panchayat administrative functions does not make it or Sarpanch in Govt service; akin to Municipalities, Co-op societies, Companies.",
      "addresses_issue": "i1",
      "key_observation": "Grama Panchayat autonomous body corporate exercising statutory functions."
    },
    {
      "id": "cr3",
      "text": "Sarpanch neither revenue officer nor village accountant; s.31 contractual tax collection optional, not obligatory; no positive revenue functions assigned.",
      "addresses_issue": "i1",
      "key_observation": "Cl. f requires both in Govt service AND in specified class."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sarpanch of Grama Panchayat under Orissa Act is neither in service of Government nor revenue officer/village accountant under s.123(7)(f); no corrupt practice established.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Improper acceptance of respondent No. 3's nomination did not materially affect election.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "s. 100(1)(d)",
        "s. 123(7)(f)",
        "s. 123(8) (pre-amendment)",
        "s. 140",
        "s. 144"
      ],
      "relevance": "Governs corrupt practices, material effect on election, disqualification; s.123(7)(f) narrowly applies only to specified classes in Govt service."
    },
    {
      "name": "Orissa Grama Panchayats Act, 1948",
      "sections": [
        "s. 8",
        "s. 10",
        "s. 11",
        "s. 14",
        "s. 16",
        "s. 17",
        "s. 18",
        "s. 21(r)",
        "s. 22",
        "s. 31",
        "s. 32",
        "s. 35",
        "s. 36",
        "s. 44",
        "s. 54(1)(xiv)",
        "s. 97",
        "s. 98",
        "s. 99",
        "s. 117A"
      ],
      "relevance": "Defines Grama Sasan/Panchayat as body corporate, election/appointment/removal of Sarpanch, Govt supervision/control, functions/duties; does not make Sarpanch Govt servant."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 133(1)(c)",
        "Art. 136"
      ],
      "relevance": "Appeal jurisdiction; special leave granted."
    },
    {
      "name": "Indian Companies Act, 1956",
      "sections": [
        "s. 259",
        "s. 269",
        "s. 408",
        "s. 409"
      ],
      "relevance": "Illustrates Govt control over companies does not make them in Govt service."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 161"
      ],
      "relevance": "Grama Panchayat members public servants for legal remuneration definition."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed with costs; High Court order set aside; election petition dismissed as no corrupt practice under s.123(7) established.",
    "relief_granted": "Appellant's election upheld.",
    "costs": "Costs awarded to appellant."
  },
  "key_quotes": [
    {
      "text": "\"There is a distinction between 'serving under the Government' and 'in the service of the Government'... the latter imports the relationship of master and servant.\"",
      "speaker": "court",
      "significance": "Core reasoning distinguishing phrases and defining Govt service."
    },
    {
      "text": "The provisions of s. 123(7) are narrower in scope... apply to any person in the service of the Government belonging to the classes specified in cls. (a) to (g) and none else.",
      "speaker": "court",
      "significance": "Interprets amended s.123(7) limiting corrupt practice scope."
    },
    {
      "text": "We have been unable to find a single provision of the Orissa Act from which we could say that a Sarpanch is a person in the service of the Government.",
      "speaker": "court",
      "significance": "Direct holding on Sarpanch status."
    }
  ],
  "_case_id": "1958_39",
  "_label": 1,
  "_text_length": 31666,
  "_extracted_at": "2026-02-10T19:20:23.991026"
}