{
  "metadata": {
    "case_name": "Appellant (Public Limited Company, Lessee of Cinema Houses) v. Respondent (Poona Municipal Corporation)",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "DAS, C.J."
    ],
    "case_number": "Civil Appeal No. 146 of 1955",
    "date_of_judgment": "1959-01-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a public limited company registered under the Indian Companies Act, 1913.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant is a lessee of four cinema houses situate within the municipal limits of Poona City known respectively as Minerva, The Globe, Sri Krishna and The Nishat.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellant exhibits cinematograph films, both foreign and Indian, in the said four houses.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The respondent, a body corporate, was governed by the Bombay District Municipal Act, 1901 (Bom. III of 1901) up to June 8, 1926, and from then by the Bombay Municipal Boroughs Act, 1925 (Bom. XVIII of 1925) up to December 29, 1949, and thereafter by the Bombay Provincial Municipal Corporation Act, 1949 (Bom. LIX of 1949).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "With effect from October 1, 1920, the respondent, with the sanction of the Government of Bombay levied on the owners and lessees of cinema houses within the limits of the erstwhile province of Bombay a tax of Rs. 2 per day as license fee.",
      "type": "material",
      "date": "1920-10-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Rules for the levy and collection of the said tax were framed by the respondent. Those rules were amended on or about June 3, 1941, enhancing the tax from Rs. 2 per day to Re. 1 per show.",
      "type": "material",
      "date": "1941-06-03",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The rules were again revised on or about June 9, 1948, under which the tax was enhanced from Re. 1 per show to Rs. 5 per show. At all material times the tax was being collected at the last mentioned rate.",
      "type": "material",
      "date": "1948-06-09",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Ever since the appellant became a lessee of the said cinema houses, the appellant has been making payments of the said tax under protest.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "After giving the necessary statutory notice to the respondent, the appellant, on or about March 31, 1950, filed a suit in the Court of the Civil Judge, Senior Division, Poona, being Suit No. 76 of 1950, against the respondent for a declaration that the levy and imposition of the said tax with effect from October 1, 1920, were invalid and illegal, that the enhancement in the rates of the tax with effect first from June 3, 1941, and then June 9, 1948, was invalid and illegal, and that the resolutions passed and rules framed in connection with the levy, imposition, enhancement and collection of the said impugned tax were invalid, illegal and ultra vires, for a permanent injunction restraining the defendants from levying or recovering and/or increasing and enhancing the said tax and for refund to the appellant of the amounts of the tax collected from it and for costs of the suit and interest.",
      "type": "procedural",
      "date": "1950-03-31",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "By its judgment dated November 30, 1951, the trial court held that the said tax was validly levied and imposed, but that the increase and enhancement thereof in 1941 and 1948 were illegal and ultra vires, and that the suit was not time barred under the Acts governing the respondent. The trial court decreed the suit in part by issuing an injunction restraining the respondent from levying, recovering or collecting the tax at the enhanced rate and passing a decree against the respondent for refund of a sum of Rs. 27,072 with interest and costs.",
      "type": "procedural",
      "date": "1951-11-30",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The respondent preferred an appeal and the appellant filed cross objections. But the High Court by its judgment and decree dated February 10, 1953, reversed the judgment of the trial court and dismissed the suit of the appellant with costs throughout. The appellant's cross objections were also dismissed.",
      "type": "procedural",
      "date": "1953-02-10",
      "source": "high_court"
    },
    {
      "id": "f12",
      "text": "On December 10, 1953, the High Court granted leave to the appellant to appeal to this Court from the said judgment.",
      "type": "procedural",
      "date": "1953-12-10",
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the law imposing this tax is covered by entry 50 in List II of the Seventh Schedule to the Government of India Act, 1935, but is really a tax on the appellant's trade or calling referred to in entry 46 and that, therefore, the amount of tax cannot under s. 142-A of the Government of India Act, 1935 exceed Rs. 100 per annum.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether s. 59(1)(xi) of the Bombay District Municipal Act, 1901 is unconstitutional in that the legislature had completely abdicated its functions and had delegated essential legislative power to the Municipality to determine the nature of the tax to be imposed on the rate payers.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether, under cl. (xi) of s. 59(1), the enhancements of the rates of the tax in 1941 and again in 1948 were illegal in that the municipality had no power to do so under the Bombay Municipal Boroughs Act, 1925, particularly s. 60 thereof.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The law imposing this tax is covered by entry 50 in List II but is really a tax on the appellant's trade or calling under entry 46, so tax cannot exceed Rs. 100 per annum under s. 142-A.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5"
      ],
      "legal_basis": "Entries 46 and 50 List II Seventh Schedule, s. 142-A Government of India Act, 1935"
    },
    {
      "id": "pa2",
      "text": "S. 59(1)(xi) is unconstitutional as the legislature completely abdicated its functions and delegated essential legislative power to the Municipality unguided and uncanalised, allowing imposition of any tax like income tax.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "S. 59(1)(xi) Bombay District Municipal Act, 1901; delegation doctrine"
    },
    {
      "id": "pa3",
      "text": "Enhancements of rates in 1941 and 1948 illegal as s. 60 of Bombay Municipal Boroughs Act, 1925 only allows suspend, reduce (modify construed as reduce) or abolish existing tax, not enhance; marginal note indicates progressive diminution; root meaning of modify is to reduce.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "S. 60 Bombay Municipal Boroughs Act, 1925; compared to s. 67 Bombay District Municipal Act, 1901"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The first point is covered by the decision in the appellant's other appeal No. 145 of 1955.",
      "addresses_issue": "i1",
      "key_observation": "Point not to detain long as covered elsewhere."
    },
    {
      "id": "cr2",
      "text": "Rejects contention of unconstitutional delegation under s. 59(1)(xi): (1) Municipality's power cannot exceed provincial legislature's (cannot impose income tax); (2) Taxes only for purposes of the Act (Ch. VII obligations, reasonable relation to duties like lighting s.54 item (i), water item (viii)); (3) Items (i)-(x) indicate kind/nature of taxes; (4) Subject to approval of Governor-in-Council (possibly Legislative Council control). Section lays down principle and standard; no abdication.",
      "addresses_issue": "i2",
      "key_observation": "Delegation not excessive; guided by Act's purposes and superior approval."
    },
    {
      "id": "cr3",
      "text": "Enhancements valid under s. 60 Bombay Municipal Boroughs Act, 1925: Marginal note cannot override clear body language (citing Commissioner of Income Tax, Bombay v. Ahmedbhai Umarbhai Co.); s.67 old Act used 'reduce', deliberately changed to 'modify' in s.60 (marginal inadvertence); 'modify' means change, includes enhancement, not just reduction.",
      "addresses_issue": "i3",
      "key_observation": "Legislature substituted 'reduce' with 'modify' intentionally to allow alteration including increase."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S. 59(1)(xi) Bombay District Municipal Act, 1901 valid; no unconstitutional delegation.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Enhancements of tax rates in 1941 and 1948 valid under s. 60 Bombay Municipal Boroughs Act, 1925 as 'modify' permits increase.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income Tax, Bombay v. Ahmedbhai Umarbhai Co., Bombay",
      "citation": null,
      "treatment": "followed",
      "relevance": "Marginal note cannot affect construction of the language used in the body of the section if it is otherwise clear and unambiguous."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay District Municipal Act, 1901 (Bom. III of 1901)",
      "sections": [
        "s. 59(1)(xi)",
        "s. 54",
        "s. 60",
        "Ch. VII"
      ],
      "relevance": "Authorizes municipality to impose taxes including residuary cl.(xi) subject to Governor-in-Council approval and for Act's purposes; illustrates relation to duties."
    },
    {
      "name": "Bombay Municipal Boroughs Act, 1925 (Bom. XVIII of 1925)",
      "sections": [
        "s. 60",
        "s. 58 proviso (a)(b)",
        "s. 103 proviso (b)"
      ],
      "relevance": "Power to suspend, modify or abolish existing tax; 'modify' interpreted to include enhancement of rates."
    },
    {
      "name": "Bombay Provincial Municipal Corporation Act, 1949 (Bom. LIX of 1949)",
      "sections": [],
      "relevance": "Governed respondent post-1949."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "s. 142-A",
        "List II Entries 46, 50 Seventh Schedule"
      ],
      "relevance": "Tax classification as on professions vs. trade; limit of Rs. 100."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [],
      "relevance": "Appellant registered thereunder."
    },
    {
      "name": "Indian Councils Act, 1861 (24 & 25 Vic. c. 67)",
      "sections": [],
      "relevance": "Meaning of Governor-in-Council possibly including Legislative Council control."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed, upholding the Bombay High Court's reversal of the trial court's partial decree and dismissal of the suit challenging the validity of the cinema tax levy from 1920 and its enhancements in 1941 and 1948.",
    "relief_granted": "None",
    "costs": "Costs throughout in favour of respondent (as per High Court decree upheld)."
  },
  "key_quotes": [
    {
      "text": "the power of the municipality cannot exceed the power of the provincial legislature itself and the municipality cannot impose any tax, e.g., income tax which the provincial legislature could not itself impose.",
      "speaker": "court",
      "significance": "Limits scope of delegated taxing power."
    },
    {
      "text": "Taxes, therefore, can be levied by the municipality only for implementing those purposes and for no other purpose... the tax to be imposed must have some reasonable relation to the duties cast on it by the Act.",
      "speaker": "court",
      "significance": "Establishes standard guiding delegation."
    },
    {
      "text": "the impugned section did lay down a principle and fix a standard which the municipalities had to follow in imposing a tax and the legislature cannot... be said to have abdicated itself.",
      "speaker": "court",
      "significance": "Upholds validity of delegation."
    },
    {
      "text": "If the word modify is to be read as reduce, then there could be no point in the provincial legislature substituting the word reduce by the word modify.",
      "speaker": "court",
      "significance": "Interprets 'modify' to permit enhancement."
    }
  ],
  "_case_id": "1958_72",
  "_label": 0,
  "_text_length": 11892,
  "_extracted_at": "2026-02-10T19:20:42.499931"
}