{
  "metadata": {
    "case_name": "Virsa Singh v. State",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Bose J."
    ],
    "case_number": "Criminal Appeal No. 90 of 1957",
    "date_of_judgment": "1958-03-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Virsa Singh tried with five others under ss. 302/149, 324/149 and 323/149 IPC; individually charged under s. 302.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Other five accused acquitted of murder charge by Sessions Court but convicted under ss. 326, 324 and 323 r/w s. 149 IPC; on appeal to High Court, all acquitted.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Appellant convicted by Sessions Judge under s. 302 IPC; conviction and sentence upheld by Punjab High Court.",
      "type": "procedural",
      "date": "1956-11-21",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Only one injury on Khem Singh, caused by appellant as result of spear thrust.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Doctor who examined Khem Singh alive: punctured wound 2 x 1/2\" transverse on left side of abdominal wall in lower part of iliac region just above inguinal canal; three coils of intestines coming out.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Incident occurred about 8 p.m. on July 13, 1955; Khem Singh died about 5 p.m. next day.",
      "type": "background",
      "date": "1955-07-13",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Postmortem doctor: oblique incised stitched wound 2.5\" on lower part of left side of belly, 1.5\" above left inguinal ligament; through whole thickness of abdominal wall; peritonitis present; digested food in cavity; flakes of pus round small intestines; six cuts at various places, digested food flowing from three cuts.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Injury sufficient to cause death in ordinary course of nature.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Sessions Judge found appellant 21 or 22 years old; common object of assembly to cause grievous hurts only; appellant did not intend death but gave forceful blow causing death; peritonitis supervened hastening death.",
      "type": "disputed",
      "date": "1956-06-26",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court considered affair sudden on chance meeting; accepted appellant inflicted fatal injury.",
      "type": "admitted",
      "date": "1956-11-21",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Special leave to appeal granted by Supreme Court limited to question: on finding accepted by Punjab High Court, what offence made out.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "On the facts accepted by Punjab High Court, what offence is made out by the appellant, particularly whether prosecution proved intention to inflict bodily injury sufficient in ordinary course of nature to cause death under s. 300 thirdly IPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Facts do not disclose offence of murder as prosecution has not proved intention to inflict bodily injury sufficient in ordinary course of nature to cause death; intention must relate not only to bodily injury but also to its sufficiency to cause death.",
      "supporting_facts": [
        "f4",
        "f5",
        "f7",
        "f9"
      ],
      "legal_basis": "s. 300 thirdly IPC"
    },
    {
      "id": "pa2",
      "text": "Cited R v. Steane: particular intent must be proved; if totality of evidence leaves room for doubt on intent, accused entitled to acquittal.",
      "supporting_facts": [],
      "legal_basis": "R v. Steane (1947) 1 All ER 813"
    },
    {
      "id": "pa3",
      "text": "Cited Emperor v. Sardarkhan: single blow makes it difficult to infer degree of intended injury.",
      "supporting_facts": [],
      "legal_basis": "Emperor v. Sardarkhan (1917) ILR 41 Bom 27"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Prosecution proved act whose natural consequences would be death; no evidence or explanation given, so intent inferred.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "s. 300 thirdly IPC; R v. Steane"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Argument that intention must relate to both injury and its sufficiency is fallacious; clauses disjunctive; first subjective (intention to cause bodily injury found), second objective (whether that injury sufficient to cause death).",
      "addresses_issue": "i1",
      "key_observation": "Prosecution must prove four elements objectively and subjectively: (1) bodily injury present; (2) nature proved; (3) intention to inflict that injury; (4) injury sufficient to cause death in ordinary course."
    },
    {
      "id": "cr2",
      "text": "Enquiry on intention broad-based: strike at vital spot with sufficient force; no need for anatomical detail.",
      "addresses_issue": "i1",
      "key_observation": "Here, spear thrust into abdomen with force penetrating bowels, intestines out, digested food oozing; no explanation, so intention to inflict that injury inferred."
    },
    {
      "id": "cr3",
      "text": "R v. Steane agrees: prove act with natural consequences of result, infer intent absent explanation.",
      "addresses_issue": "i1",
      "key_observation": "No other conclusion possible but intent to inflict injury found."
    },
    {
      "id": "cr4",
      "text": "Distinguishes Emperor v. Sardarkhan: intent separate from seriousness; if nothing beyond injury and fact of infliction, intent presumed unless contrary shown.",
      "addresses_issue": "i1",
      "key_observation": "No licence to inflict injuries sufficient to cause death claiming lack of intent."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under s. 300 thirdly, once intention to cause specific bodily injury proved, and that injury sufficient in ordinary course to cause death, offence is murder regardless of intent to kill or knowledge of lethality.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "R v. Steane",
      "citation": "1947 1 All E.R. 813",
      "treatment": "followed",
      "relevance": "Intent proved by act with natural consequences of result absent explanation; if doubt on intent, acquit."
    },
    {
      "case_name": "Emperor v. Sardarkhan Jaridkhan",
      "citation": "1917 I.L.R. 41 Bom. 27",
      "treatment": "distinguished",
      "relevance": "Intent not linked to seriousness of injury; separate enquiries."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "300",
        "149",
        "326",
        "324",
        "323"
      ],
      "relevance": "Murder under s.302 r/w s.300 thirdly; common object under s.149; grievous/simple hurt."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave limited to offence on accepted facts; Supreme Court upheld conviction under s.302 IPC, affirming Sessions Court and High Court on murder charge.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "No one has a licence to run around inflicting injuries that are sufficient to cause death in the ordinary course of nature and claim that they are not guilty of murder.",
      "speaker": "court",
      "significance": "Core holding rejecting defence of lack of murderous intent."
    },
    {
      "text": "The prosecution must prove the following facts before it can bring a case under s. 300, 3rdly: First, bodily injury present; Secondly, nature proved; Thirdly, intention to inflict that injury; Fourthly, sufficient to cause death.",
      "speaker": "court",
      "significance": "Defines four-part test for s.300 thirdly."
    },
    {
      "text": "If there is nothing beyond the injury and the fact that the appellant inflicted it, the only possible inference is that he intended to inflict it.",
      "speaker": "court",
      "significance": "Inference of intent from circumstances absent explanation."
    }
  ],
  "_case_id": "1958_148",
  "_label": 0,
  "_text_length": 15178,
  "_extracted_at": "2026-02-10T19:21:49.657930"
}