{
  "metadata": {
    "case_name": "Appellant v. Union of India",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "K. DAS, J."
    ],
    "case_number": "Civil Appeal No. 288 of 1958",
    "date_of_judgment": "1958-12-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant joined permanent Government service on April 4, 1924.",
      "type": "background",
      "date": "1924-04-04",
      "source": "appellant"
    },
    {
      "id": "f2",
      "text": "In 1947, before partition, appellant employed as Assistant Secretary, Frontier Corps of Militia and Scouts in North-Western Frontier Province, under External Affairs Department, Government of India; post in Central Service, Class II.",
      "type": "background",
      "date": "1947",
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "After partition, appellant opted for service in India and posted to Ministry of Commerce, Government of India in October 1947.",
      "type": "background",
      "date": "1947-10",
      "source": "appellant"
    },
    {
      "id": "f4",
      "text": "In December 1949, transferred to office of Chief Controller of Imports, New Delhi, to clear arrears.",
      "type": "background",
      "date": "1949-12",
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "In August 1951, posted as Deputy Chief Controller of Imports, Calcutta, continued till September 1952.",
      "type": "background",
      "date": "1951-08 to 1952-09",
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "Took four months leave on average pay from September 1952, expiry January 24, 1953; transferred as Section Officer in Development Wing, Ministry of Commerce.",
      "type": "procedural",
      "date": "1952-09 to 1953-01-24",
      "source": "appellant"
    },
    {
      "id": "f7",
      "text": "Appellant thought transfer amounted to reduction of rank, made representations which bore no fruit.",
      "type": "disputed",
      "date": "1953-01",
      "source": "appellant"
    },
    {
      "id": "f8",
      "text": "Applied for leave preparatory to retirement on February 6, 1953; normally due to retire April 1956, but sought retirement from May 1, 1953 due to difficulty reconciling to new conditions.",
      "type": "material",
      "date": "1953-02-06",
      "source": "appellant"
    },
    {
      "id": "f9",
      "text": "On February 14, 1953, amended leave application: informed of difficulty regarding inclusion of period as Assistant Secretary; prayed for four months leave on full average pay from February 15, 1953 or up to retirement date, whichever earlier.",
      "type": "procedural",
      "date": "1953-02-14",
      "source": "appellant"
    },
    {
      "id": "f10",
      "text": "On March 10, 1953, informed not allowed to retire at that stage; granted leave from February 16, 1953 to April 30, 1953.",
      "type": "procedural",
      "date": "1953-03-10",
      "source": "government"
    },
    {
      "id": "f11",
      "text": "On February 25, 1953, wrote to Government contemplating joining Messrs. Albert David Co. Ltd., Calcutta, accepting two months training.",
      "type": "material",
      "date": "1953-02-25",
      "source": "appellant"
    },
    {
      "id": "f12",
      "text": "In April 1953, accepted service under Messrs. Albert David Co. Ltd.; wrote to Government on April 6, 1953.",
      "type": "material",
      "date": "1953-04-06",
      "source": "appellant"
    },
    {
      "id": "f13",
      "text": "On June 16, 1953, charged with violating r.15 Government Servants Conduct Rules and Fundamental Rule 11 by accepting private employment without previous sanction.",
      "type": "procedural",
      "date": "1953-06-16",
      "source": "government"
    },
    {
      "id": "f14",
      "text": "Enquiry held by A.P. Mathur, Joint Chief Controller of Imports; appellant submitted explanation.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Enquiring Officer report on September 12, 1953: found appellant accepted private employment without sanction while still in service, contrary to rules.",
      "type": "procedural",
      "date": "1953-09-12",
      "source": "enquiring_officer"
    },
    {
      "id": "f16",
      "text": "Show cause notice dated April 14, 1954 under Art. 311(2): President provisionally of opinion major penalty (dismissal, removal or reduction) should be enforced; copy of report enclosed; representation within 14 days.",
      "type": "procedural",
      "date": "1954-04-14",
      "source": "government"
    },
    {
      "id": "f17",
      "text": "Appellant showed cause against notice.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f18",
      "text": "President's order October 1, 1954: after considering enquiry report and consultation with Public Service Commission, charge proved, removed from service with effect from that date.",
      "type": "procedural",
      "date": "1954-10-01",
      "source": "president"
    },
    {
      "id": "f19",
      "text": "Appellant filed petition under Art. 226 in Punjab High Court Civil Writ No. 8-D of 1955; dismissed by Dulat J. April 9, 1956; Letters Patent Appeal No. 25-D of 1956 dismissed December 3, 1956.",
      "type": "procedural",
      "date": "1955 to 1956-12-03",
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order of the President dated October 1, 1954 removing the appellant from service is invalid by reason of contravention of Art. 311(2) of the Constitution, specifically whether the show cause notice dated April 14, 1954 complied with the requirement of giving reasonable opportunity to show cause against the action proposed.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Show cause notice dated April 14, 1954 mentioned all three punishments (dismissal, removal or reduction) without particularising the actual or exact punishment proposed, thus did not comply with Art. 311(2); relied on Khem Chand v. Union of India emphasising 'one of the three punishments' and need for tentative proposal of specific punishment; also I.M. Lall requiring 'actual punishment' provisionally determined.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "Art. 311(2) Constitution; Khem Chand v. Union of India (1958 S.C.R. 1080); High Commissioner for India v. I.M. Lall (1948 L.R. 75 I.A. 225); Jatindra Nath Biswas v. R. Gupta; Dayanidhi Rath v. B.S. Mohanty; Lakshmi Narain Gupta v. A.N. Puri"
    },
    {
      "id": "pa2",
      "text": "Mistakes in final order: referred to r.13 instead of r.15 Conduct Rules; reference to para 5 of Government order on commercial employment post-retirement not applicable to Class II.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Had asked for leave preparatory to retirement and accepted private employment in bona fide belief Government had no objection.",
      "supporting_facts": [
        "f8",
        "f9",
        "f10",
        "f11",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Show cause notice complied with Art. 311(2); appellant had opportunities to deny guilt, defend, and show cause against proposed punishment.",
      "supporting_facts": [
        "f14",
        "f15",
        "f16",
        "f17"
      ],
      "legal_basis": "Art. 311(2) Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Art. 311(2) requires reasonable opportunity including to show cause against proposed punishment after enquiry, where competent authority applies mind to gravity of proved charges and tentatively proposes one of three punishments; notice here stated President provisionally of opinion that major penalty viz. dismissal, removal or reduction should be enforced, giving full opportunity.",
      "addresses_issue": "i1",
      "key_observation": "Mentioning three punishments in alternative gives better opportunity, not less; does not indicate lack of application of mind."
    },
    {
      "id": "cr2",
      "text": "Rejects need for exact punishment in notice: would require third notice if lesser accepted; enumeration of three does not invalidate; distinguished cases like I.M. Lall and Khem Chand where no second notice given post-enquiry.",
      "addresses_issue": "i1",
      "key_observation": "Observations on 'actual' or 'particular' punishment context-specific; real vice is no post-enquiry notice."
    },
    {
      "id": "cr3",
      "text": "Other cases (Jatindra, Dayanidhi, Lakshmi Narain) do not require only one punishment; vagueness or no application of mind was issue there, not here.",
      "addresses_issue": "i1",
      "key_observation": "Notice not vague; President applied mind to propose any of three major penalties."
    },
    {
      "id": "cr4",
      "text": "Inaccurate references in final order not vital; substance based on violation of r.15 and FR 11.",
      "addresses_issue": "i1",
      "key_observation": "Order valid in effect."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Show cause notice dated April 14, 1954 did not contravene Art. 311(2); mentioning three major penalties in alternative complies and gives fuller opportunity.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Appellant had reasonable opportunity under Art. 311(2); removal order valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Khem Chand v. Union of India",
      "citation": "1958 S.C.R. 1080",
      "treatment": "followed",
      "relevance": "Explains scope of Art. 311(2): reasonable opportunity includes post-enquiry show cause against tentatively proposed punishment after applying mind to gravity of charges."
    },
    {
      "case_name": "High Commissioner for India and High Commissioner for Pakistan v. I.M. Lall",
      "citation": "1948 L.R. 75 I.A. 225",
      "treatment": "followed",
      "relevance": "No action proposed until definite conclusion on charges and actual punishment provisionally determined; quoted with approval in Khem Chand; distinguished as no post-enquiry notice there."
    },
    {
      "case_name": "Jatindra Nath Biswas v. R. Gupta",
      "citation": "1953 58 C.W.N. 128",
      "treatment": "distinguished",
      "relevance": "No second show cause notice; proceeded on different footing, not requiring only one punishment."
    },
    {
      "case_name": "Dayanidhi Rath v. B.S. Mohanty",
      "citation": "A.I.R. 1955 Orissa 33",
      "treatment": "distinguished",
      "relevance": "Notice juxtaposed removal and dismissal confusingly, indicating no clear tentative conclusion."
    },
    {
      "case_name": "Lakshmi Narain Gupta v. A.N. Puri",
      "citation": "A.I.R. 1954 Cal. 335",
      "treatment": "distinguished",
      "relevance": "Notice vague, listed multiple penalties without indicating tentative conclusion."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 311(2)",
        "Article 226"
      ],
      "relevance": "Art. 311(2) requires reasonable opportunity to show cause against proposed punishment post-enquiry; complied with here. Art. 226 for writ petition."
    },
    {
      "name": "Government Servants Conduct Rules",
      "sections": [
        "Rule 15"
      ],
      "relevance": "Prohibits engaging in trade or employment without previous sanction; violated by appellant."
    },
    {
      "name": "Fundamental Rules",
      "sections": [
        "Rule 11"
      ],
      "relevance": "Whole time of Government servant at disposal of Government; violated."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; held that show cause notice complied with Art. 311(2), removal order valid; no contravention found.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the President is provisionally of opinion that a major penalty, viz., dismissal, removal or reduction should be enforced on you.",
      "speaker": "government",
      "significance": "Text of show cause notice central to compliance with Art. 311(2)."
    },
    {
      "text": "To specify more than one punishment in the alternative does not necessarily make the proposed action any the less definite on the contrary, it gives the Government servant better opportunity to show cause against each of those punishments being inflicted on him.",
      "speaker": "court",
      "significance": "Core holding upholding notice mentioning three punishments."
    },
    {
      "text": "the real point of the decision both in I.M. Lall's case and Khem Chand's case was that no opportunity had been given to the Government servant concerned to show cause after a stage had been reached when the charges had been established and the competent authority had applied its mind to the gravity or otherwise of the charges proved and tentatively proposed the punishment.",
      "speaker": "court",
      "significance": "Clarifies true ratio of precedents."
    }
  ],
  "_case_id": "1958_93",
  "_label": 0,
  "_text_length": 22955,
  "_extracted_at": "2026-02-10T19:21:23.907158"
}