{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Proprietor of Jaipur Estate",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar, J."
    ],
    "case_number": "Civil Appeal No. 426 of 1957",
    "date_of_judgment": "1958-10-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is the proprietor of the impartible zamin of Jaipur in Koraput District, area of 12,000 sq. miles, of which 1540 sq. miles are reserve forest and 100 sq. miles protected forest.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent derives income from the forests by the sale of timber such as teak, salwood, lac, myrabolam, tamarind, cashewnuts and firewood. There is no dispute as to the receipt of such income or its quantum. All that appears in the account books of the respondent.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "By order dated January 31, 1943, the Income-tax Officer held that the forests had not been proved to have been planted by the respondent, that the trees were of spontaneous growth, and that the income therefrom was not within the exemption under s. 4(3)(viii). This order was confirmed on appeal by the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": "1943-01-31",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The respondent appealed to the Appellate Tribunal, contending that the Income-tax Officer failed to take into account a letter of the Dewan dated June 3, 1942, giving detailed account of operations in rearing and maintenance of forests.",
      "type": "procedural",
      "date": "1942-06-03",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "By order dated April 9, 1946, the Tribunal accepted the contention and directed a fresh enquiry into the facts in the Dewan's letter.",
      "type": "procedural",
      "date": "1946-04-09",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Pursuant to Tribunal's order, Income-tax Officer enquired again, observed no materials proved plantation, no plantation books or working plans produced, held forests grown naturally, income assessable.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Tribunal held that forests yielding income could not be virgin forests due to periodic denudation by hill tribes through Podu cultivation. Podu cultivation: felling jungle, burning trees, sowing dry grain in ashes without tilling for two years, then abandoning.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Tribunal observed extensive destruction by Podu but considerable virgin forests survived, evidence of cultivation by zamin meagre, no expenses prior to 1904, negligible in 1904, trees planted then could not be those sold in assessment years 1942-43 to 1946-47.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Tribunal covered assessments for five years 1942-43 to 1946-47, facts same for all years. Referred question to High Court: Whether on the facts and circumstances the income derived from forest is taxable.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Orissa High Court (Panigrahi CJ and Misra J) by judgment dated April 21, 1955, answered reference in negative (not taxable). Observed both parties' cases too high; forests under Podu cultivation disappeared by 1870, regrown and destroyed by 1901, no virgin forest left.",
      "type": "procedural",
      "date": "1955-04-21",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court noted respondent maintained large establishment for: 1. preservation from man and cattle; 2. cultivation by felling and burning; 3. planned exploitation by blocks; 4. systematic cutting; 5. planting new trees in patches; 6. watering, pruning, etc.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court held onus on department to prove not agricultural; operations showed cultivation and human skill, most trees sprouts from burnt stumps, no basis for assumption all trees spontaneous.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court granted certificate under s.66A(2).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Forest receipts and expenses: 1942-43 Rs.438,894 rec/174,437 exp; 1943-44 407,447/209,895; 1944-45 552,122/228,830; 1945-46 372,971/247,216; 1946-47 689,366/460,369.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether income received by the respondent by the sale of trees growing in his forests is agricultural income exempt from taxation under s. 4(3)(viii) of the Indian Income-tax Act, 1922.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the burden of proof is on the assessee to establish exemption as agricultural income or on the department to prove it is not.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Income from forests is taxable as not agricultural; trees of spontaneous growth, no proof of plantation by estate.",
      "supporting_facts": [
        "f3",
        "f6",
        "f8"
      ],
      "legal_basis": "s. 2(1), s. 4(3)(viii) Indian Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "Burden on assessee to prove exemption.",
      "supporting_facts": [],
      "legal_basis": "Commissioner of Income-tax v. Venkataswamy Naidu; general law on exemptions"
    },
    {
      "id": "pa3",
      "text": "Tribunal's finding that no plantations worth the name and trees of spontaneous growth is binding; Podu cultivation does not prove plantation by estate.",
      "supporting_facts": [
        "f8",
        "f10"
      ],
      "legal_basis": "s.66(1) Indian Income-tax Act; Raja Benoy Kumar Sahas Roy"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Income is agricultural as forests result of human agency; original forests denuded by Podu cultivation, subsequent trees planted by estate.",
      "supporting_facts": [
        "f7",
        "f10",
        "f11"
      ],
      "legal_basis": "s. 2(1), s. 4(3)(viii)"
    },
    {
      "id": "ra2",
      "text": "Letter of Dewan June 3, 1942 shows operations; plantations from 1904 per accounts, infer prior; high expenses indicate planted trees.",
      "supporting_facts": [
        "f4",
        "f14"
      ],
      "legal_basis": "Raja Benoy Kumar Sahas Roy"
    },
    {
      "id": "ra3",
      "text": "Burden on department to prove taxable.",
      "supporting_facts": [],
      "legal_basis": "Australian Mutual Provident Society v. Inland Revenue Commissioners"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Burden of proof is on the person claiming exemption (assessee), not department. Dissent from High Court's view.",
      "addresses_issue": "i2",
      "key_observation": "Law well settled; ample authority including Venkataswamy Naidu."
    },
    {
      "id": "cr2",
      "text": "Agricultural income requires derivation from land by agriculture, including basic operations like tilling, sowing, planting; subsequent operations like preservation only qualify if following basic ones. Spontaneous growth not agricultural.",
      "addresses_issue": "i1",
      "key_observation": "Per Raja Benoy Kumar Sahas Roy."
    },
    {
      "id": "cr3",
      "text": "Crucial question: were trees planted by proprietors or spontaneous? Tribunal found no plantations worth name, trees spontaneous - finding of fact binding under s.66(1). High Court erred in re-appreciating.",
      "addresses_issue": "i1",
      "key_observation": "Podu cultivation destroys but new growth from stumps also spontaneous unless planted."
    },
    {
      "id": "cr4",
      "text": "High Court's view that subsequent operations alone suffice overruled by Raja Benoy Kumar Sahas Roy.",
      "addresses_issue": "i1",
      "key_observation": "Basic operations essential."
    },
    {
      "id": "cr5",
      "text": "High expenses do not prove plantations; in Raja Benoy Kumar, presumption only where plantations found over time. Here, Tribunal finding against.",
      "addresses_issue": "i1",
      "key_observation": "Figures do not override factual finding."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Burden lies on assessee to prove agricultural income exemption under s.4(3)(viii).",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Income from spontaneous forest growth not agricultural even with preservation efforts; requires basic agricultural operations like planting.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Tribunal's finding that trees were of spontaneous growth binding; income taxable.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax v. Venkataswamy Naidu",
      "citation": "1956 29 I.T.R. 529, 534",
      "treatment": "followed",
      "relevance": "Burden on assessee to prove agricultural income exemption."
    },
    {
      "case_name": "Commissioner of Income-tax, West Bengal v. Raja Benoy Kumar Sahas Roy",
      "citation": "1958 S.C.R. 101",
      "treatment": "followed",
      "relevance": "Definition of agriculture; basic vs subsequent operations; spontaneous growth not agricultural."
    },
    {
      "case_name": "Australian Mutual Provident Society v. Inland Revenue Commissioners",
      "citation": "1946 1 All E.R. 528",
      "treatment": "distinguished",
      "relevance": "Rule of construction for exemptions, not burden of proof."
    },
    {
      "case_name": "Maughan v. Free Church of Scotland",
      "citation": "1803 3 Tax Cas. 207",
      "treatment": "followed",
      "relevance": "Burden on claimant of exemption."
    },
    {
      "case_name": "Keren Kayemeth Le Jisroel Ltd. v. Commissioners of Inland Revenue",
      "citation": "1931 17 Tax Cas. 27",
      "treatment": "followed",
      "relevance": "Right to exemption must be established by claimants."
    },
    {
      "case_name": "Amritsar Produce Exchange Ltd., In re",
      "citation": "1937 5 I.T.R. 307",
      "treatment": "followed",
      "relevance": "Assessee to establish exemption under s.4."
    },
    {
      "case_name": "Sm. Charusila Dassi and others, In re",
      "citation": "1946 14 I.T.R. 362",
      "treatment": "followed",
      "relevance": "Assessee to establish exemption under s.4."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 66(1)",
        "s. 4(3)(viii)",
        "s. 2(1)",
        "s. 66A(2)"
      ],
      "relevance": "Reference under s.66(1); exemption for agricultural income defined in s.2(1), exempt under s.4(3)(viii); certificate under s.66A(2)."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, High Court order set aside, reference answered in affirmative: income from forest is taxable under the Act.",
    "relief_granted": "None; assessments upheld as taxable.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The law is well settled that it is for a person who claims exemption to establish it, and there is no reason why it should be otherwise when the exemption claimed is under the Income-tax Act.",
      "speaker": "court",
      "significance": "Clarifies burden of proof for exemptions."
    },
    {
      "id": "kq2",
      "text": "before an income could be held to be agricultural income, it must be shown to have been derived from land by agriculture or by one or the other of the operations described in cls. (i) and (ii) of s. 2(1)(b) of the Act.",
      "speaker": "court",
      "significance": "Defines requirements for agricultural income per Benoy Kumar."
    },
    {
      "text": "products which grow wild on the land or are of spontaneous growth not involving any human labour or skill upon the land are not products of agriculture and the income derived therefrom is not agricultural income.",
      "speaker": "court",
      "significance": "Key test for forest income."
    }
  ],
  "_case_id": "1958_152",
  "_label": 1,
  "_text_length": 24718,
  "_extracted_at": "2026-02-08T22:35:02.837088"
}