{
  "metadata": {
    "case_name": "Appellants (Contractors) v. Respondents (Sales Tax Authorities, State of Madhya Pradesh)",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "S. R. Das C.J.",
      "Venkatarama Aiyar J.",
      "S. K. Das J.",
      "A. K. Sarkar J.",
      "Bose J."
    ],
    "case_number": "Civil Appeals Nos. 253 to 255 of 1955",
    "date_of_judgment": "1958-04-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant in Civil Appeal No. 253 of 1955 is a contractor doing business in the construction of buildings and roads for the Military and Public Works Department in the State of Madhya Pradesh.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Appellant filed M.P. No. 245 of 1954 challenging proposed sales tax assessment under Central Provinces and Berar Sales Tax Act, 1947, on materials used in construction works.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Appellants contended that Provincial Legislature had no authority under Entry 48 of List II, Sch. VII of Government of India Act, 1935, to impose tax on supply of materials in works contracts as it was not a sale of goods.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Appellants claimed exemption under item 33 in Sch. II to the Act as enacted by Act XVI of 1949 ('Goods sold to or by the Crown/State Government'), withdrawn by notification dated September 18, 1950.",
      "type": "disputed",
      "date": "1950-09-18",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Item 33 originally 'Goods sold by the Crown', amended by Act XVI of 1949 to 'Goods sold to or by the Crown', then by Adaptation Order 1950 to 'State Government', and further by notification under s.6(2) to 'Goods sold by the State Government'.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellants in Civil Appeal No. 254 of 1955 are Jabalpur Contractors Association and certain contractors, filed M.P. No. 279 of 1954 on same grounds.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Appellant in Civil Appeal No. 255 of 1955 is Madhya Pradesh Contractors Association, Nagpur, filed M.P. No. 308 of 1954 on same grounds.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Nagpur High Court by judgment dated November 30, 1954, held that 'sale of goods' in Entry 48 covers transactions where property in movables passes for money, including materials in building contracts; provisions valid but s.2(h)(ii) and Rule 4 ultra vires for artificial price fixation; notification valid.",
      "type": "procedural",
      "date": "1954-11-30",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appeals preferred to Supreme Court on certificate under Art. 132(1) of Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Sales tax authorities called upon contractors to furnish returns for assessment on receipts from contract works.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Provincial Legislature has authority under Entry 48 of List II, Sch. VII of Government of India Act, 1935, to impose sales tax on supply of materials in works contracts, treating it as sale of goods.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the notification dated September 18, 1950, amending item 33 of Sch. II under s.6(2) of the Act constitutes unconstitutional delegation of legislative power.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Supply of materials in works contracts is not a sale of goods within Entry 48; provisions of Act seeking to impose tax thereon are ultra vires.",
      "supporting_facts": [
        "f3",
        "f10"
      ],
      "legal_basis": "Entry 48 List II Govt of India Act 1935; State of Madras v. Gannon Dunkerley Co. (1959 SCR 379)"
    },
    {
      "id": "pa2",
      "text": "Notification dated September 18, 1950, withdrawing exemption for goods sold to State Government is unconstitutional as it modifies legislative policy and constitutes excessive delegation.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "s.6(2) Central Provinces and Berar Sales Tax Act 1947; Rajnarain Singh v. Chairman Patna Administration (1955 SCR 290); In re Delhi Laws Act (1951 SCR 747)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Expression 'sale of goods' in Entry 48 wide enough to cover transfers of property in movables for consideration, including materials in building contracts.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Entry 48 List II Govt of India Act 1935"
    },
    {
      "id": "ra2",
      "text": "Even construing 'sale' narrowly per Sale of Goods Act, some contracts consist of distinct agreements for sale of materials and for work/labour, taxable on sale part.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Indian Sale of Goods Act 1930; State of Madras v. Gannon Dunkerley Co. (1959 SCR 379)"
    },
    {
      "id": "ra3",
      "text": "Notification under s.6(2) valid; delegation for details like exemptions in tax laws permissible.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "s.6(2) Act; Syed Mohamed Co. v. State of Madras; Powell v. Apollo Candle Co."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Expression 'sale of goods' in Entry 48 has meaning per Indian Sale of Goods Act 1930; in building contract, no sale of materials as such; ultra vires for indivisible works contracts.",
      "addresses_issue": "i1",
      "key_observation": "Question concluded by State of Madras v. Gannon Dunkerley Co.; but separable contracts (sale + work) taxable on sale portion after enquiry."
    },
    {
      "id": "cr2",
      "text": "Power under s.6(2) to amend schedule on exemptions is not unconstitutional delegation; common in tax laws for executive to determine details like exemptions; s.6(1) and (2) integral, exemption conditional.",
      "addresses_issue": "i2",
      "key_observation": "Consistent with legislative practice; not change of policy but detail; supported by Powell v. Apollo, Syed Mohamed, Hampton cases."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Impugned provisions of Act ultra vires Provincial Legislature's powers under Entry 48 for indivisible works contracts where no distinct sale of materials.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Notification dated September 18, 1950, under s.6(2) intra vires and valid.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Sales tax authorities may enquire and tax sale portion in contracts separable into sale of materials and work/labour.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Madras v. Gannon Dunkerley Co. (Madras) Ltd.",
      "citation": "1959 S.C.R. 379",
      "treatment": "followed",
      "relevance": "'Sale of goods' in Entry 48 means per Sale of Goods Act; no sale in indivisible building contract, but separable contracts taxable on sale part."
    },
    {
      "case_name": "Rajnarain Singh v. Chairman, Patna Administration Committee",
      "citation": "1955 1 S.C.R. 290",
      "treatment": "referred",
      "relevance": "Executive cannot modify essential features or change policy of law."
    },
    {
      "case_name": "In re The Delhi Laws Act, 1912 etc.",
      "citation": "1951 S.C.R. 747",
      "treatment": "referred",
      "relevance": "On delegation of legislative power."
    },
    {
      "case_name": "Powell v. Apollo Candle Company Limited",
      "citation": "1885 10 A.C. 282",
      "treatment": "followed",
      "relevance": "Delegation to executive for tax imposition details valid; legislature retains control."
    },
    {
      "case_name": "Syed Mohamed Co. v. State of Madras",
      "citation": "1952 3 S.T.C. 367",
      "treatment": "followed",
      "relevance": "Delegation to decide point of levy in sales tax chain valid."
    },
    {
      "case_name": "Hampton Jr. Co. v. United States",
      "citation": "276 U.S. 394",
      "treatment": "followed",
      "relevance": "Delegation for tariff rate adjustments valid."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Provinces and Berar Sales Tax Act, 1947",
      "sections": [
        "s.2(b)",
        "s.2(c)",
        "s.2(d)",
        "s.2(g)",
        "s.2(h)",
        "s.2(j)",
        "s.4(a)",
        "s.6",
        "Sch. II item 33",
        "Rule 4 Sales Tax Rules 1947"
      ],
      "relevance": "Defines contract, dealer, goods, sale, sale price, turnover; charging section; exemption power; impugned for taxing works contracts and price deduction."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Entry 48 List II Sch. VII"
      ],
      "relevance": "Limits Provincial power to tax sales of goods."
    },
    {
      "name": "Indian Sale of Goods Act, 1930",
      "sections": [],
      "relevance": "Defines 'sale of goods' for interpreting Entry 48."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 132(1)"
      ],
      "relevance": "Certificate for appeal."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court set aside Nagpur High Court judgment; held provisions ultra vires for indivisible works contracts but valid for separable sale+work contracts after enquiry; notification valid; restrained respondents from enforcing Act on construction works except separable sale parts; parties bear own costs throughout.",
    "relief_granted": "Writ restraining enforcement of Act on indivisible construction works contracts.",
    "costs": "Parties to bear their own costs throughout."
  },
  "key_quotes": [
    {
      "text": "\"in a building contract there is no sale of materials as such, and that it is therefore ultra vires the powers of the Provincial Legislature to impose tax on the supply of materials.\"",
      "speaker": "court",
      "significance": "Core holding following Gannon Dunkerley on indivisible contracts."
    },
    {
      "text": "\"the power conferred on the State Government by s.6(2) to amend the schedule relating to exemption is in consonance with the accepted legislative practice relating to the topic, and is not unconstitutional.\"",
      "speaker": "court",
      "significance": "Upholds delegation for tax exemptions."
    },
    {
      "text": "\"it cannot include a change of policy.\" (Bose J. in Rajnarain Singh)",
      "speaker": "court",
      "significance": "Cited by petitioners but distinguished by SC."
    }
  ],
  "_case_id": "1958_11",
  "_label": 1,
  "_text_length": 19523,
  "_extracted_at": "2026-02-10T19:19:43.233641"
}