{
  "metadata": {
    "case_name": "Appellant (representative of Purshottamdas) v. Respondents (Dhanrupmal and legal representatives of Motilal)",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar J."
    ],
    "case_number": "Civil Appeal No. 150 of 1954",
    "date_of_judgment": "1958-04-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The property mortgaged was a four-roomed shop with certain appurtenances, standing on a piece of land measuring 5 yards by 15 yards in Naya Bazar, Ajmere.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Mortgage dated August 1, 1899 created by Purshottamdas (now dead) in favour of Dhanrupmal (respondent) for Rs. 6,300 of which Rs. 5,750 left with mortgagee to redeem a prior mortgage on the same and another property.",
      "type": "material",
      "date": "1899-08-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Mortgage instrument provided that on redemption of prior mortgage, possession of shop to be taken by Dhanrupmal who would appropriate rent in lieu of interest; possession of other property (share in Kacheri) to be made over to mortgagor Purshottamdas.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Provisions: Mortgagor or heirs not entitled to redeem for 85 years. After expiry of 85 years, redeem within 6 months; if not, no claim over property, mortgagee no claim to money or lagat (repairs), deed deemed sale deed. No need for fresh sale deed. Expenses on repairs/new constructions paid on redemption per mortgagee's account.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Dhanrupmal redeemed prior mortgage, took possession of shop, delivered Kacheri possession to mortgagor.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Dhanrupmal assigned rights under mortgage to Motilal on April 12, 1939; Motilal died, estate represented by sons (respondents).",
      "type": "material",
      "date": "1939-04-12",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Estate of Purshottamdas represented by his son, the appellant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant filed suit for redemption on January 2, 1947 in Court of Sub-Judge 1st Class, Ajmer (Civil Suit No. I of 1947) against respondents.",
      "type": "procedural",
      "date": "1947-01-02",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Respondents contested suit as premature, no right of redemption till August 1, 1984 (85 years from mortgage).",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Sub-Judge held 85-year postponement invalid as clog on equity of redemption, passed preliminary decree for redemption (judgment/decree March 30, 1948), following decision of Judicial Commissioner, Ajmer.",
      "type": "procedural",
      "date": "1948-03-30",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Judicial Commissioner, Ajmer, on appeal (Civil First Appeal No. 13 of 1948), distinguished prior decision, held provision not a clog, allowed appeal, dismissed suit (judgment/decree March 21, 1950).",
      "type": "procedural",
      "date": "1950-03-21",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Suit for redemption brought over 47 years after mortgage date.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Case governed by Transfer of Property Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the covenant postponing redemption for 85 years, along with 6-month redemption window thereafter, amounts to a clog on the equity of redemption, rendering the suit not premature.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the term fixing mortgage term at 85 years is invalid as oppressive or unconscionable.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The covenant creating long term of 85 years for mortgage, taken with provision to redeem within 6 months thereafter or not at all, other terms, and circumstances, is a clog on equity of redemption; thus mortgage money due all along, suit not premature.",
      "supporting_facts": [
        "f4",
        "f2"
      ],
      "legal_basis": "Section 60 Transfer of Property Act; rule against clogs on equity of redemption"
    },
    {
      "id": "pa2",
      "text": "Term that mortgage not redeemable for 85 years amounts to clog.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Equity principles against oppressive bargains"
    },
    {
      "id": "pa3",
      "text": "Mortgagee free to demand payment anytime while mortgagor cannot redeem for 85 years; mortgagee can spend unlimited on repairs/constructions, mortgagor pays per mortgagee's account; all terms benefit mortgagee.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Prior mortgage indicates mortgagor's impecunious position.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Suit premature as no right of redemption for 85 years after mortgage date, till August 1, 1984.",
      "supporting_facts": [
        "f4",
        "f9"
      ],
      "legal_basis": "Section 60 Transfer of Property Act; Bakhtawain Begum v. Husaini Khanam"
    },
    {
      "id": "ra2",
      "text": "Suit brought as price of land gone up post-war.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Term providing failure to redeem within 6 months deems deed sale and takes away right to redeem is invalid; once a mortgage always a mortgage, right to redeem cannot be taken away (s.60 TPA).",
      "addresses_issue": "i1",
      "key_observation": "This term ignored; right to redeem continues even after 6 months."
    },
    {
      "id": "cr2",
      "text": "85-year term fixes when principal becomes due (right to redeem accrues); does not take away right, merely postpones accrual. Parties free to contract on when principal due.",
      "addresses_issue": "i2",
      "key_observation": "Not a clog in sense of taking away right."
    },
    {
      "id": "cr3",
      "text": "Equity relieves against unconscionable bargains where lender takes advantage of mortgagor's necessity/embarrassment. No evidence of oppression here: long terms common in India; prior mortgage freed Kacheri; mortgage money more but smaller security; no high interest complaint; suit after 47 years; small property limits repairs.",
      "addresses_issue": "i2",
      "key_observation": "Bargain fair, between equals; no unconscionability."
    },
    {
      "id": "cr4",
      "text": "No provision for mortgagee to demand money anytime; rights co-extensive. Repairs clause for necessary repairs only, per account as safeguard. Not all terms benefit mortgagee.",
      "addresses_issue": "i2",
      "key_observation": "Terms reasonable."
    },
    {
      "id": "cr5",
      "text": "Suit premature as term not expired.",
      "addresses_issue": "i1",
      "key_observation": "85-year term enforceable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Provision deeming deed sale on failure to redeem within 6 months after 85 years invalid as clog on equity of redemption.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "85-year term valid, not a clog; no unconscionability; principal not due till then, right to redeem not accrued.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bakhtawain Begum v. Husaini Khanam",
      "citation": "1913 L.R. 41 I.A. 84",
      "treatment": "followed",
      "relevance": "Right to redeem arises after term expires unless special condition; ordinarily only on expiration of specified period."
    },
    {
      "case_name": "Santley v. Wilde",
      "citation": "1899 2 Ch. 474",
      "treatment": "followed",
      "relevance": "Principle: Mortgage security redeemable notwithstanding contrary provision; any clog void; once a mortgage always a mortgage."
    },
    {
      "case_name": "Mohammad Sher Khan v. Seth Swami Dayal",
      "citation": "1921 L.R. 49 I.A. 60",
      "treatment": "followed",
      "relevance": "Once right to redeem arises under s.60 TPA, cannot be taken away; unqualified terms."
    },
    {
      "case_name": "Vermon v. Bethell",
      "citation": "1762 2 Eden 110",
      "treatment": "referred",
      "relevance": "Equity jealous of securities converting to purchases; relieves necessitous men from crafty impositions."
    },
    {
      "case_name": "G. and C. Kreglinger v. New Patagonia Meat and Cold Storage Company Ltd.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Equity relieves against penalties; origin in common law mortgage hardships; interferes only on unconscientious conduct; ascertain real nature as mortgage."
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act",
      "sections": [
        "s. 60"
      ],
      "relevance": "Mortgagor right to redeem after principal due; unqualified, right continues once arisen, cannot be contracted away."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; suit for redemption held premature as 85-year term valid and not expired; 6-month forfeiture clause severed as invalid but does not affect term.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"once a mortgage always a mortgage\".",
      "speaker": "court",
      "significance": "Core principle against clogs on equity of redemption."
    },
    {
      "text": "The rule against clogs on the equity of redemption is that, a mortgage shall always be redeemable and a mortgagors right to redeem shall neither be taken away nor be limited by any contract between the parties.",
      "speaker": "court",
      "significance": "Defines rule against clogs."
    },
    {
      "text": "The reason then justifying the Courts power to relieve a mortgagor from the effects of his bargain is its want of conscience.",
      "speaker": "court",
      "significance": "Limits equity relief to unconscionable bargains."
    }
  ],
  "_case_id": "1958_79",
  "_label": 0,
  "_text_length": 21330,
  "_extracted_at": "2026-02-08T22:33:20.217268"
}