{
  "metadata": {
    "case_name": "State of Bombay & Anr. v. Plaintiff-Respondent",
    "case_year": 1955,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha, J."
    ],
    "case_number": "Civil Appeal Nos. 287 and 288 of 1955",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plaintiff instituted suit on January 31, 1929, the last day of limitation, in Munsiff's Court at Miraj, registered as Original Suit No. 724 of 1930, for possession and mesne profits of lands at Malgaon and Takli.",
      "type": "procedural",
      "date": "1929-01-31",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "State of Miraj wrongfully resumed the lands in 1910 as part of State Sheri-Khata, and after inquiry, ordered on July 31, 1915, to be recorded as such with usufruct appropriated to Khasgi-Khata.",
      "type": "material",
      "date": "1910-00-00",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Narso, recorded owner of suit properties, died in 1910.",
      "type": "background",
      "date": "1910-00-00",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Plaintiff impleaded State of Miraj as first defendant, brothers (defendants 2 and 3) who relinquished interest, and defendants 4 to 7 from Narso's family who did not contest.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Suit valued at Rs. 2,065 (5 times assessment) for court-fee; no valuation for jurisdiction.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Similar Tikoni suit (OS No. 443 of 1928) by plaintiff in same court regarding lands in Tikoni village, dismissed on November 29, 1939.",
      "type": "background",
      "date": "1939-11-29",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Plaintiff applied on June 21, 1940, for return of plaint due to value of subject-matter being 8-10 thousand rupees, exceeding Munsiff's jurisdiction; court allowed on July 4, 1940, plaint returned and re-presented to District Judge at Miraj as Suit No. 2 of 1940.",
      "type": "procedural",
      "date": "1940-07-04",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "District Judge dismissed suit on December 12, 1945, with costs, contesting on limitation inter alia.",
      "type": "procedural",
      "date": "1945-12-12",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "On appeal, State of Bombay added as 6th respondent, Yuvaraj of Miraj (Madhavrao Narayanarao) as 7th respondent who acquired interest by grant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "High Court Division Bench allowed appeal (First Appeal No. 104 of 1950) on November 30, 1951, decreed suit with costs against first and 7th respondents.",
      "type": "procedural",
      "date": "1951-11-30",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Before January 1, 1926, Miraj State had 20-year limitation for possession after dispossession; Proclamation applied Indian Limitation Act IX of 1908 from February 1, 1926, with extension to January 31, 1929 for certain suits.",
      "type": "background",
      "date": "1926-01-01",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Defendant petitioned October 27, 1942, alleging plaintiff knew value exceeded jurisdiction, act not bona fide.",
      "type": "procedural",
      "date": "1942-10-27",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Tikoni suit plaint contained value statement, unlike present suit.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Plaintiff conducted suits himself in trial court, drafted plaints.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether plaintiff entitled to benefit of Section 14 of Limitation Act to exclude time from January 31, 1929 to July 4, 1940, for prosecuting suit in Munsiff's Court lacking jurisdiction.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Alternatively, whether suit barred by 12 years under Article 142, cause of action in 1910 or 1915.",
      "framed_by": "appellants"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Plaintiff not entitled to Section 14 benefit as previous suit not prosecuted with due diligence and good faith; knew value exceeded jurisdiction, filed deliberately low, moved for return only after Tikoni dismissal.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7",
        "f13"
      ],
      "legal_basis": "Section 14 Limitation Act; good faith defined in Section 2(7) as with due care and attention"
    },
    {
      "id": "pa2",
      "text": "Even with Section 14, suit barred under Article 142 (12 years limitation).",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Article 142 Limitation Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Entitled to exclude time under Section 14 as suit originally filed within time on last day, same cause of action, good faith.",
      "supporting_facts": [
        "f1",
        "f7"
      ],
      "legal_basis": "Section 14 Limitation Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "To claim Section 14, plaintiff must affirmatively prove prosecution with due diligence, good faith (due care and attention per s.2(7)), same cause, defect of jurisdiction; conditions 1 and 3 not satisfied.",
      "addresses_issue": "i1",
      "key_observation": "Burden on plaintiff not discharged; knew value from start, omission not due care, moved after Tikoni loss; no evidence of diligence like order-sheet."
    },
    {
      "id": "cr2",
      "text": "Courts below erred placing burden on defendant to prove mala fides; plaintiff responsible for plaint, no pleader mistake.",
      "addresses_issue": "i1",
      "key_observation": "Tikoni plaint had value, this did not; apprehensive after Tikoni dismissal."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Plaintiff not entitled to Section 14 exclusion; suit as re-presented on July 4, 1940 barred by limitation.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Limitation Act, 1908",
      "sections": [
        "Section 14",
        "Section 2(7)",
        "Article 142"
      ],
      "relevance": "Section 14 excludes time for bona fide prosecution in wrong court with due diligence; good faith requires due care; Art. 142 prescribes 12-year limitation"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeals, reversed High Court decree, held suit barred by limitation, dismissed suit with costs throughout.",
    "relief_granted": null,
    "costs": "Costs throughout"
  },
  "key_quotes": [
    {
      "text": "\"In computing the period of limitation prescribed for any suit, the time during which the plaintiff has been prosecuting with due diligence another civil proceeding... shall be excluded, where the proceeding... is prosecuted in good faith in a Court which, from defect of jurisdiction... is unable to entertain it.\"",
      "speaker": "court",
      "significance": "Quotes Section 14 verbatim, central to decision"
    },
    {
      "text": "\"Nothing shall be deemed to be done in good faith which is not done with due care and attention.\"",
      "speaker": "court",
      "significance": "Defines good faith under Section 2(7), key to denying benefit"
    },
    {
      "text": "The plaintiff's mala fides are therefore not established and the period occupied in prosecuting the former suit must be excluded under section 14 of the Limitation Act.",
      "speaker": "lower_court",
      "significance": "Trial court view reversed by Supreme Court"
    }
  ],
  "_case_id": "1958_13",
  "_label": 1,
  "_text_length": 16818,
  "_extracted_at": "2026-02-08T22:16:18.234072"
}