{
  "metadata": {
    "case_name": "Appellants v. State of Madras",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO J."
    ],
    "case_number": "Civil Appeals Nos. 169-171 of 1955",
    "date_of_judgment": "1958-10-06"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Madras Commercial Crops Markets Act XX of 1933 was passed to provide for the better regulation of the buying and selling of commercial crops in the State of Madras and to establish markets and make rules for their proper administration.",
      "type": "background",
      "date": "1933-07-25",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On May 18, 1951, the State Government issued G.O. No. 1049 Food Agriculture Department extending the provisions of the Act to Ramanathapuram and Tirunelveli Districts in respect of cotton and groundnuts.",
      "type": "procedural",
      "date": "1951-05-18",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On February 25, 1952, the State Government issued G.O. No. 251 Food Agriculture Department ordering the constitution of a Market Committee at Koilpatti and Sankarankoil in Tirunelveli District.",
      "type": "procedural",
      "date": "1952-02-25",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "By G.O. No. 356 Food-Agriculture Department dated March 8, 1952, the Government directed the constitution of a Market Committee at Virudhunagar and markets at Virudhunagar, Rajapalayan and Sattur in Ramanathapuram District.",
      "type": "procedural",
      "date": "1952-03-08",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Market Committees were duly constituted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On January 9, 1953, the Market Committee at Virudhunagar issued a notice stating that the Act and the Rules had come into force in Ramanathapuram District on January 1, 1953, and requiring persons who did business in cotton and groundnut to take out licences.",
      "type": "material",
      "date": "1953-01-09",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "A further notice dated January 17, 1953, by Virudhunagar Market Committee stated that all traders in cotton and groundnut who failed to take out licences on or before February 15, 1953, were liable to prosecution.",
      "type": "material",
      "date": "1953-01-17",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Similar notices dated January 22, 1953, and February 14, 1953, were issued by the Chairman, Tirunelveli Market Committee at Koilpatti calling upon all traders, producers and weighmen dealing in cotton to take out licences before February 28, 1953, threatening prosecution for failure to comply.",
      "type": "material",
      "date": "1953-01-22",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The appellants and others filed writ petitions in the Madras High Court against the State of Madras, Collectors of concerned Districts and Chairmen of Market Committees for writ of mandamus directing respondents to forbear from enforcing the Act, Rules and notifications.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Madras High Court by order dated July 10, 1953, dismissed the writ petitions. Held s.5(4)(a) void to extent conferring discretion on Collector to refuse licence; rule 37 void insofar as prohibiting unregistered persons from business. Rest upheld under Art.19(6).",
      "type": "procedural",
      "date": "1953-07-10",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court granted certificate for appeals to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Historical background: Marketing legislation to protect producers from middlemen exploitation. Royal Commission on Agriculture 1928 recommended regulated markets.",
      "type": "background",
      "date": "1928",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "In Virudhunagar, there is a well-established market functioning for over fifty years with stalls, godowns, etc., collecting 'mahimai' charges utilised for schools and religious purposes.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the provisions of the Madras Commercial Crops Markets Act 1933 and Rules thereunder constitute unreasonable restrictions on the fundamental right to carry on trade or business under Article 19(1)(g) read with Article 19(6).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether G.O. No. 356 dated 8-3-1952 directing establishment of market at Virudhunagar imposes unreasonable restriction on appellants' right to do business.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether 'mahimai' allowance is a trade allowance under Section 14 of the Act and whether bye-law 25(b) prohibiting it is valid.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Provisions of the Act and Rules constitute unreasonable restriction upon fundamental right to do business under Art.19(1)(g), cripple business of appellants, restrict small traders, cause hardship to growers, exceed purpose and defeat object.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8",
        "f13"
      ],
      "legal_basis": "Article 19(1)(g) and 19(6)"
    },
    {
      "id": "pa2",
      "text": "G.O. No. 356 directing market at Virudhunagar unreasonable as existing market provides facilities; could regulate existing market instead.",
      "supporting_facts": [
        "f4",
        "f13"
      ],
      "legal_basis": "Article 19(1)(g)"
    },
    {
      "id": "pa3",
      "text": "Mahimai is not a trade allowance; if not, not covered by s.14 prohibition; bye-law prohibiting it invalid.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Section 14 of the Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Act is valid marketing legislation under Art.19(6); appellants can still do business in new market or outside; not prohibited from holding property for other commodities.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Article 19(6)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Test of reasonableness: rational relation to object, not in excess. Object to protect producers from middlemen, provide regulated markets. Historical background supports.",
      "addresses_issue": "i1",
      "key_observation": "Restrictions have reasonable relation to object of eliminating middlemen exploitation."
    },
    {
      "id": "cr2",
      "text": "Provisions of s.5 etc. provide machinery for control and restrictions like licensing to ensure fair trade till markets established; licence fees not shown excessive; exemptions for small traders/growers.",
      "addresses_issue": "i1",
      "key_observation": "Act integrated scheme; small trader exemptions possible; prevents exploitation."
    },
    {
      "id": "cr3",
      "text": "Question on G.O. 356 left open to be decided when market established, depending on then circumstances.",
      "addresses_issue": "i2",
      "key_observation": "No early prospect of market; reasonableness depends on future conditions."
    },
    {
      "id": "cr4",
      "text": "Mahimai question arises; whether trade allowance under s.14 depends on facts if deduction from price/commodity in transaction; no material, leave open.",
      "addresses_issue": "i3",
      "key_observation": "Bye-law validity depends on nature of mahimai."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Impugned provisions of the Act constitute reasonable restrictions on citizen's right to do business under Art.19(1)(g), hence valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Question of reasonableness of G.O. No.356 left open for future decision when market established.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    },
    {
      "id": "h3",
      "text": "Whether mahimai is trade allowance and validity of bye-law 25(b) left open for decision in appropriate proceedings.",
      "resolves_issue": "i3",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chintaman Rao v. The State of Madhya Pradesh",
      "citation": "1950 S.C.R. 759",
      "treatment": "followed",
      "relevance": "Reasonable restriction must have rational relation to object and not go in excess."
    },
    {
      "case_name": "State of Madras v. V. G. Row",
      "citation": "1952 S.C.R. 597, 607",
      "treatment": "followed",
      "relevance": "Test of reasonableness applied to each statute; factors like nature of right, purpose, extent of evil, etc."
    },
    {
      "case_name": "T. B. Ibrahim v. Regional Transport Authority, Tanjore",
      "citation": "1953 S.C.R. 290",
      "treatment": "referred",
      "relevance": "On whether holding market incident of property right under Art.19(1)(f) or (g)."
    },
    {
      "case_name": "Ramunni Kurup v. The Panchayat Board, Badagara",
      "citation": "I.L.R. 1954 Mad. 513",
      "treatment": "referred",
      "relevance": "Cited in respondent argument on property rights."
    },
    {
      "case_name": "Captain Ganpati Singhji v. The State of Ajmer",
      "citation": "1955 S.C.R. 1065",
      "treatment": "referred",
      "relevance": "Cited in respondent argument."
    },
    {
      "case_name": "Valia Raja of Edappally v. The Commissioner for Hindu Religious Charitable Endowments, Madras",
      "citation": "I.L.R. 1955 Mad. 870",
      "treatment": "referred",
      "relevance": "Cited in respondent argument."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Commercial Crops Markets Act, 1933",
      "sections": [
        "s.2(1-a)",
        "s.3",
        "s.4-A",
        "s.5",
        "s.5(1)",
        "s.5(2)",
        "s.5(3)",
        "s.5(4)",
        "s.5(4)(a)",
        "s.6-10",
        "s.14",
        "s.16",
        "s.18",
        "s.19",
        "s.19(1)"
      ],
      "relevance": "Regulates buying/selling commercial crops via notified areas, market committees, licensing, prohibitions, trade allowances."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 19(1)(g)",
        "Article 19(6)"
      ],
      "relevance": "Right to carry on trade/business; reasonable restrictions in public interest."
    },
    {
      "name": "Madras Co-operative Societies Act, 1932",
      "sections": [],
      "relevance": "Exemption for co-operative societies selling members' produce."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals against High Court order dismissing writ petitions upheld; Act and Rules valid as reasonable restrictions under Art.19(6), subject to prior High Court holdings; issues on G.O.356 and mahimai left open for future.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Such a statute cannot be said to create unreasonable restrictions on the citizens right to do business unless it is clearly established that the provisions are too drastic, unnecessarily harsh and overreach the scope of the object.\"",
      "speaker": "court",
      "significance": "Defines threshold for invalidating marketing legislation."
    },
    {
      "text": "\"We, therefore, hold that, having regard to the entire scheme of the Act, the impugned provisions of the Act constitute reasonable restrictions on a citizens right to do business, and therefore, they are valid.\"",
      "speaker": "court",
      "significance": "Core holding upholding the Act."
    },
    {
      "text": "\"The test of reasonableness, wherever prescribed, should be applied to each individual statute impugned, and no abstract standard, or general pattern, of reasonableness can be laid down as applicable to all cases.\"",
      "speaker": "court",
      "significance": "Quotes Patanjali Sastri CJ on reasonableness test."
    }
  ],
  "_case_id": "1958_62",
  "_label": 0,
  "_text_length": 37297,
  "_extracted_at": "2026-02-08T22:17:07.372296"
}