{
  "metadata": {
    "case_name": "M. P. Davis v. Agricultural Income-tax Officer, Coorg",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was the registered owner of the Kaimabetta Coffee Estate and was assessed as an individual prior to the assessment year 1952-53.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For the assessment year 1952-53, appellant claimed a change of status, pleading that he and his brother P. W. Davis had agreed to become partners under a partnership deed Exhibit 12, and asked for registration of the firm under section 26 of the Coorg Agricultural Income-tax Act, 1 of 1951.",
      "type": "material",
      "date": "1952-53",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The partnership was purportedly constituted for the purposes inter alia of the joint working of the said estate as also for transacting generally the business of coffee, citrus and pepper and other businesses as specified in the document.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Agricultural Income-tax Officer, Coorg, refused to register the firm on the ground that the document did not create the relationship of partners between the two executants and that the appellant's brother was no more than his servant under the said document.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Order of refusal confirmed by the Deputy Commissioner of Agricultural Income-tax, Coorg.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellant applied to the Commissioner of Agricultural Income-tax, Coorg, under section 54(2) of the Act to refer the case to the Mysore High Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Question referred to High Court: Whether, upon the materials produced by the assessee, the Agricultural Income-tax Officer is justified in rejecting the deed of partnership as not creating the relation of partnership? High Court answered against the appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant obtained special leave to appeal to the Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Before the deed was executed, the appellant's estate was being managed by his brother as his agent on the basis of principal and agent or master and servant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In the assessment proceedings under the Coorg Agricultural Income-tax Act for the year 1951-52, P. W. Davis appeared as the agent of the appellant.",
      "type": "background",
      "date": "1951-52",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "For the assessment year 1952-53, claim for change of status was made by P. W. Davis who produced the partnership deed.",
      "type": "procedural",
      "date": "1952-53",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Even after change of status was pleaded for 1952-53, the appellant claimed loss of the previous year and full expenses of the accounting year against what he actually received during the accounting year 1951-52.",
      "type": "disputed",
      "date": "1952-53",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Books of account did not show change in the management of the estate in spite of the agreement.",
      "type": "disputed",
      "date": "1952-53",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the document Exhibit 12 created a relation of partnership between the appellant M. P. Davis and his brother P. W. Davis.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The partnership deed Exhibit 12 created a partnership between the appellant and his brother for joint working of the Kaimabetta Coffee Estate and other businesses.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Section 26 of the Coorg Agricultural Income-tax Act, 1 of 1951"
    },
    {
      "id": "pa2",
      "text": "Even if some special powers are conferred on one of the partners that does not necessarily negative the existence of the relationship of partnership.",
      "supporting_facts": [],
      "legal_basis": "In re Ambalal Sarabhai; Raghunandan Nanu Kothare v. Hormasji Bezonjee Bamjee; Robinson v. Ashton"
    },
    {
      "id": "pa3",
      "text": "The estate belonging to the senior partner became the capital of the firm and liabilities enforceable against the capital of a firm would be enforceable against the asset.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Robinson v. Ashton"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The document did not create the relationship of partners; the appellant's brother was no more than his servant.",
      "supporting_facts": [
        "f4",
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Despite the document, the relations between the two brothers continued the same as before; no change in management or accounting.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": "Section 6 of the Partnership Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In determining whether a group of persons is or is not a firm, regard shall be had to the real relation between the parties, as shown by all relevant facts taken together.",
      "addresses_issue": "i1",
      "key_observation": "Prior relationship was master-servant; conduct post-deed showed no change."
    },
    {
      "id": "cr2",
      "text": "Document described as partnership agreement but does not contain any decisive term to show partnership relationship.",
      "addresses_issue": "i1",
      "key_observation": "Capital is appellant's estate; brother not entitled to contribute, no power to deal with it, reverts to appellant on dissolution."
    },
    {
      "id": "cr3",
      "text": "Brother to employ himself diligently; no obligation on appellant to work; brother to maintain accounts subject to appellant's privilege to inspect.",
      "addresses_issue": "i1",
      "key_observation": "Indicates master-servant relation."
    },
    {
      "id": "cr4",
      "text": "Brother prevented from advancing moneys; submits estimates to appellant for approval; control with appellant.",
      "addresses_issue": "i1",
      "key_observation": "Powers given are those of a servant or agent."
    },
    {
      "id": "cr5",
      "text": "Remuneration out of profits only, no provision for losses; sharing of profits contingent on profits does not create partnership.",
      "addresses_issue": "i1",
      "key_observation": "Possible for servant; no loss sharing despite unequal profit shares."
    },
    {
      "id": "cr6",
      "text": "Precedents distinguished: Unlike Ambalal Sarabhai and Raghunandan, here prior conduct, inferior position of brother, no proprietary interest, and estate never became partnership capital.",
      "addresses_issue": "i1",
      "key_observation": "Usefulness of precedents limited to construing documents."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The document did not create a partnership; it continued the pre-existing master-servant relationship under the cloak of partnership.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "In re Ambalal Sarabhai",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Control with one partner and extra rights as major partner do not negative partnership; but here document unusual and conduct different."
    },
    {
      "case_name": "Raghunandan Nanu Kothare v. Hormasji Bezonjee Bamjee",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Agreement made defendant a partner despite no loss liability; but here parties' conduct and status inconsistent with no partnership."
    },
    {
      "case_name": "Robinson v. Ashton",
      "citation": null,
      "treatment": "referred",
      "relevance": "Partner's property credited as capital becomes firm asset; but here estate never became partnership capital."
    }
  ],
  "statutes_cited": [
    {
      "name": "Coorg Agricultural Income-tax Act, 1 of 1951",
      "sections": [
        "Section 26",
        "Section 54(2)"
      ],
      "relevance": "Registration of firms; reference to High Court."
    },
    {
      "name": "Partnership Act",
      "sections": [
        "Section 6"
      ],
      "relevance": "Real relation between parties shown by all relevant facts; sharing profits or contingent remuneration does not create partnership."
    },
    {
      "name": "Indian Income-tax Act",
      "sections": [],
      "relevance": "Relevant provisions correspond to Coorg Act."
    },
    {
      "name": "Indian Contract Act",
      "sections": [
        "Section 239"
      ],
      "relevance": "Mentioned in context of Ambalal Sarabhai precedent."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the High Court of Mysore's decision is dismissed, upholding that the document does not create a partnership relation between the appellant and his brother.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In determining whether a group of persons is or is not a firm regard shall be had to the real relation between the parties, as shown by all relevant facts taken together.\"",
      "speaker": "court",
      "significance": "Key test applied from section 6 of Partnership Act."
    },
    {
      "text": "\"We think that these provisions taken along with the conduct of the parties to the instrument earlier mentioned, clearly indicate that it was not the intention of the parties to bring about the relationship of partners but only to continue under the cloak of a partnership the pre-existing and real relationship, namely, that between a master and his servant.\"",
      "speaker": "court",
      "significance": "Core holding on true intention."
    },
    {
      "text": "\"The sharing of profits or the provision for payment of remuneration contingent upon the making of profits or varying with the profits, does not itself create a partnership.\"",
      "speaker": "court",
      "significance": "Explains why profit-sharing clause insufficient."
    }
  ],
  "_case_id": "1958_92",
  "_label": 0,
  "_text_length": 12861,
  "_extracted_at": "2026-02-10T19:21:06.425676"
}