{
  "metadata": {
    "case_name": "Appellant private limited company v. Income-tax Officer",
    "case_year": 1958,
    "court": "Calcutta High Court",
    "judges": [
      "Chakravartti, C.J.",
      "Sinha, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a private limited company formed under the Companies Act of 1956 to take over the assets and liabilities of another company as also its outstanding contracts.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Predecessor company obtained a lease of a considerable area of forest land in the North Andaman with a view to exploiting its timber.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Andaman timber has hardly any local market and it therefore became necessary for the company to secure some means of transport for bringing the timber over to the mainland. For that purpose it chartered from time to time sea-going vessels.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "One such vessel was Eastern Venture, owned by Newland Steamship Co. Ltd. of Hongkong, which the predecessor company hired by a charter-party executed in London on August 25,1954.",
      "type": "material",
      "date": "1954-08-25",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The charter-party was in the form of a uniform time charter. The period covered by it was six months, with an option of another three months for the charterer, but it appears that since the expiry of the original term, the charter-party has been renewed or its terms extended from time to time.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Although the vessel appears to have changed hands at least twice and the period of the original charter-party also expired long ago, it is not disputed that terms and conditions of the deed of August 25,1954, have continued to be in force with one slight modification.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Clause 6 of the charter-party provided that the charterers were to pay as hire £16s. per ton on the vessels dead weight of 5,250 tons per 30 days. This payment of hire was to be made without discount every 30 days in advance and, according to clause 6, it was to be made in cash in Calcutta.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Somewhat inconsistently, the charter-party came to contain another provision in clause 26 which said that the hire in accordance with clause 6 was to be paid by telegraphic transfer to London. By an addendum it was agreed that payment would be made in cash in London or Hongkong.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Clause 14 read: The charterers or their agents to advance to the Master, if required, necessary funds for ordinary disbursements for the vessels account at any port, charging only interest at 6 per cent., p.a., such advances to be deducted from hire.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Clause 25 provided that the owners were to pay a commission of 3 per cent. to Clegg, Cruickshank & Co. Ltd., Calcutta, as also some commission and brokerage to two other parties apparently in London.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The vessel was to be employed for the carriage of lawful merchandise only between good and safe ports or places. In the main, it appears to have plied between Calcutta and the North Andaman.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "In order to be allowed to leave the Calcutta port, it required a port clearance certificate and in order that a port clearance certificate could be obtained from the customs authorities, it was necessary to produce before them an income-tax clearance certificate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Clegg, Cruickshank & Co. Ltd., who were the local agents of the owners, and thereafter the appellant company itself, undertook to the Income-tax authorities to pay any income-tax for which the owners might be liable on their freight earnings.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Apparently on the faith of that guarantee, the Income-tax Officer went on issuing clearance certificates during the initial period without any question and that state of things went on till February 1956.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "In February 1956, the Income-tax Officer, then dealing with the matter, became a little more inquisitive and following some discussion with the representatives of the appellant company, he required them by a letter, dated February 21,1956, to let him know whether the hire for the ship had been paid to the owners in accordance with clause 6 of the charter-party and if it had been, what the actual amount of the hire, taken along with all other expenses, paid or payable on behalf of the non-resident owners, was.",
      "type": "procedural",
      "date": "1956-02-21",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The company replied to the Income-tax Officer’s letter on March 6, 1956, and informed him that the hire had been paid as per clause 26 of the charter-party, irrespective of clause 6.",
      "type": "procedural",
      "date": "1956-03-06",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The appellant annexed to its letter a statement showing the actual amount of hire, commission and other expenses paid and net amount remitted. The figures entered showed disbursements between September 1954 and March 1955: Rs. 52,109-11-0; April 1955 to February 1956: Rs. 69,768-13-6. Disbursements consisted of advances made to the master, costs of repairs and commission paid to the local agents of the owners. What was remitted to London was only the balance of the total amount of the hire after deduction of the amount of the disbursements.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "On a perusal of the statement furnished by the appellant, the Income-tax Officer took the view that the amount of the disbursements constituted payment in India to a non-resident of a chargeable sum, to which section 18(3B) of the Income-tax Act applied. Accordingly, on March 17,1956, he addressed a letter to the appellant company demanding payment of tax.",
      "type": "procedural",
      "date": "1956-03-17",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "The Income-tax Officer’s letter of March 17,1956: 'It is apparent from the enclosures to the said letter that Rs. 52,109 and Rs. 69,768 were constructively received in India by the non-resident owner of the above mentioned vessel during 1954-55 and 1955-56 respectively. You should have, therefore, deducted and paid tax under section 18(3B) in respect of such income. As this has not been done, you have rendered yourself liable for payment of such taxes under section 18(7) of the Income-tax Act, 1922.'",
      "type": "procedural",
      "date": "1956-03-17",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "The appellant did not admit its liability to make the payment demanded and some discussion with the Income-tax Officer appears to have followed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "In the meantime, the vessel had changed hands a second time, passing first from the ownership of the Newland Steamship Co. Ltd. to that of Pan Norse Steamship Co. S.A. of Panama, and next to the ownership of Messrs. Wallem & Co. Ltd.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "The newest owners, Wallem & Co. Ltd., while repudiating liability to pay any Indian income-tax, nevertheless, offered as a measure of compromise to pay a sum of Rs. 5,000 as representing their proportionate share of the tax which was said to be due from the owners. The Income-tax Officer did not agree to accept that payment, nor did he modify the demand he had made of the appellant company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "In the end, the appellant company paid the tax demanded by three challans on May 18,1956.",
      "type": "procedural",
      "date": "1956-05-18",
      "source": "court"
    },
    {
      "id": "f24",
      "text": "Thereafter, on May 18,1956, the appellant moved this court under article 226 of the Constitution for a rule on the Income-tax Officer.",
      "type": "procedural",
      "date": "1956-05-18",
      "source": "court"
    },
    {
      "id": "f25",
      "text": "A rule was issued on that application, but at the final hearing it was discharged by Sinha, J.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f26",
      "text": "It is against the order discharging the rule that the present appeal is directed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f27",
      "text": "The appellant preferred an appeal against the very order to the Appellate Assistant Commissioner on June 7, 1956, while the writ petition was pending.",
      "type": "procedural",
      "date": "1956-06-07",
      "source": "respondent"
    },
    {
      "id": "f28",
      "text": "Of the sums paid out on account of disbursements on which the Income-tax Officer had levied tax, Rs. 32,092-5-9 had been paid to Clegg, Cruickshank & Co. Ltd., and Rs 9,028 had been paid for repairs to the vessel and the cost of bunker at the time of re-delivery to various persons resident in India.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f29",
      "text": "The appellant company never treated these payments as loans at all, but treated them as pre-payments of the freight. The statement shows that invariably and in each month, the company remitted to the owners the entire balance of the hire after making a deduction of only the actual amount paid by it for the disbursements.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f30",
      "text": "The appellant asked for a release of sterling exchange on the basis of the agreed hire for the vessel, less only 3 per cent. commission payable to Clegg, Cruickshank & Co. Ltd., and disbursements, if any, made by it on behalf of the owners. There was no deduction made on account of interest.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the amounts paid on account of disbursements under clause 14 of the charter-party constituted loans advanced to the owners or part payments of the hire.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the payments made on account of disbursements were sums chargeable under the provisions of the Income-tax Act so as to attract section 18(3B).",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the payments were received by the non-resident owners in India, constructively or otherwise.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether 'any other sum chargeable under the provisions of this Act' in section 18(3B) means net taxable income or gross receipts liable to be brought into computation.",
      "framed_by": "court"
    },
    {
      "id": "i5",
      "text": "Whether the payments were earmarked for expenditure and thus not income.",
      "framed_by": "petitioner"
    },
    {
      "id": "i6",
      "text": "Whether a writ of certiorari lies against the Income-tax Officer's order, given alternative remedies and whether it is a speaking order.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The amounts paid on account of disbursements had been paid under the provisions of clause 14 of the charter-party and having been so paid, they constituted loans advanced to the owners and not part payments of the hire.",
      "supporting_facts": [
        "f9",
        "f28"
      ],
      "legal_basis": "Clause 14 of charter-party; interest charged"
    },
    {
      "id": "pa2",
      "text": "Even assuming the amounts were not loans, but part payments of the hire, they were still not chargeable to tax under the provisions of the Indian Income-tax Act, because the part payments had not been received by the owners in India.",
      "supporting_facts": [
        "f16",
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The amounts were merely gross receipts in the hands of the owner and no one could say that they constituted income till all other items of receipt and the expenses incurred in connection therewith had been taken into account and some taxable income found.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "Income-tax Act interpretation"
    },
    {
      "id": "pa4",
      "text": "The amounts concerned, having been paid for disbursements, were obviously earmarked for the expenditure and consequently they could not be chargeable as income.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The amount of the disbursements constituted payment in India to a non-resident of a chargeable sum, to which section 18(3B) of the Income-tax Act applied.",
      "supporting_facts": [
        "f17",
        "f19"
      ],
      "legal_basis": "Section 18(3B) and 18(7) Income-tax Act, 1922"
    },
    {
      "id": "ra2",
      "text": "No writ of certiorari could issue because the Income-tax Officer had undoubted jurisdiction to deal with the question of the appellants liability to tax under section 18(7) of the Act and the worst that could be said was that he had committed a mistake of law in exercising his jurisdiction.",
      "supporting_facts": [
        "f19"
      ],
      "legal_basis": "Rex v. Inspector of Taxes"
    },
    {
      "id": "ra3",
      "text": "There was no speaking order and no error apparent on the face of the record.",
      "supporting_facts": [
        "f19"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Appellant had alternative remedy by way of appeal, which it pursued without disclosing to the court.",
      "supporting_facts": [
        "f27"
      ],
      "legal_basis": "Rashid and Sons v. Income-tax Investigation Commission; State of U.P. v. Mohammad Nooh"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Advances under clause 14 were not loans, but pre-payments of a part of the hire, for which the charterer agreed to allow a certain amount of rebate in the form of interest. Particularly by the provision that the charterer will be entitled to deduct its dues from the hire.",
      "addresses_issue": "i1",
      "key_observation": "Provision for deduction from hire indicates part-payment, not loan."
    },
    {
      "id": "cr2",
      "text": "Even assuming advances were loans initially, they were repaid in Calcutta by deduction from the hire due to the owners, involving constructive receipt by owners in India.",
      "addresses_issue": "i3",
      "key_observation": "Charterer could not repay itself with its own money; deduction meant hire portion became owners' money in Calcutta."
    },
    {
      "id": "cr3",
      "text": "'Chargeable under the provisions of this Act' means liable in its nature to be brought into computation in an assessment, belonging to one of the heads of income under section 6, not necessarily net taxable income.",
      "addresses_issue": "i2",
      "key_observation": "Gross receipts includible; payer not concerned with ultimate assessment."
    },
    {
      "id": "cr4",
      "text": "Payments not mere loans as appellant never charged interest or treated as such; remitted net after exact disbursements, applied for exchange control accordingly.",
      "addresses_issue": "i1",
      "key_observation": "Appellant's own conduct shows pre-payments."
    },
    {
      "id": "cr5",
      "text": "Earmarking for expenditure does not prevent it being income; fundamental principle that nature determined on receipt, not subsequent use.",
      "addresses_issue": "i5",
      "key_observation": "Receipt surplus not less income because bound to particular use."
    },
    {
      "id": "cr6",
      "text": "Income-tax Officer's letter of March 17, 1956 is a speaking order as it states reasons: constructive receipt in India.",
      "addresses_issue": "i6",
      "key_observation": "Error, if any, apparent on face of record."
    },
    {
      "id": "cr7",
      "text": "Even if merits favor appellant, writ denied due to lack of candor: pursued parallel appeal without disclosure.",
      "addresses_issue": "i6",
      "key_observation": "Court should not decide simultaneously with inferior tribunal."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Disbursements under clause 14 are pre-payments of hire, constructively received by non-resident owners in India.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Such payments are 'sums chargeable under the provisions of the Act' within section 18(3B), including gross receipts to be computed under heads in section 6.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Writ of certiorari not issued as ITO's order correct on merits and speaking order; alternatively, due to alternative remedy pursued without disclosure.",
      "resolves_issue": "i6",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Allison v. Bristol Marine Insurance Co.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Leading authority on whether advance to master is loan or pre-payment of freight."
    },
    {
      "case_name": "Keshav Mills Ltd. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Money belonging to non-resident applied under instruction to pay creditors in India is received in India."
    },
    {
      "case_name": "Commissioners of Inland Revenue v. Corporation of London as Conservators of Epping Forest",
      "citation": null,
      "treatment": "followed",
      "relevance": "Annual payments include gross receipts, not just pure income profits; earmarking for expenditure does not negate income character."
    },
    {
      "case_name": "Aggarwal Chamber of Commerce Ltd. v. Ganpat Rai Hiralal",
      "citation": null,
      "treatment": "followed",
      "relevance": "Payers deducting tax under s.18 not concerned with ultimate taxability; gross receipts suffice."
    },
    {
      "case_name": "Mansfield v. Maitland",
      "citation": null,
      "treatment": "referred",
      "relevance": "Provision for deduction from freight indicates not a loan."
    },
    {
      "case_name": "State of U.P. v. Mohammad Nooh",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Writ possible despite alternative remedy if not pursued or exhausted."
    },
    {
      "case_name": "Rashid and Sons v. Income-tax Investigation Commission",
      "citation": null,
      "treatment": "followed",
      "relevance": "Decline writ if parallel remedy pursued."
    },
    {
      "case_name": "Rex v. Northumberland Compensation Appeal Tribunal, Ex parte Shaw",
      "citation": null,
      "treatment": "followed",
      "relevance": "Certiorari corrects errors of law on face of record."
    },
    {
      "case_name": "Rex v. Nat Bell Liquors Ltd.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Scope of certiorari includes observance of law in exercise of jurisdiction."
    },
    {
      "case_name": "Rex v. Inspector of Taxes and Commissioners of Income Tax",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Outmoded view; jurisdiction includes errors on record."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "Section 18(3B)",
        "Section 18(7)",
        "Section 18(3C)",
        "Section 18(3A)",
        "Section 6",
        "Section 40(2)",
        "Section 42(1)"
      ],
      "relevance": "Deduction of tax at source on payments to non-residents; liability if not deducted; chargeable sums include gross receipts under heads of income."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Writ jurisdiction for certiorari against ITO's order."
    },
    {
      "name": "Companies Act, 1956",
      "sections": [],
      "relevance": "Appellant formed under this Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against discharge of rule nisi in writ petition under Article 226 dismissed. Court held disbursements were pre-payments constructively received in India by non-resident owners, chargeable under section 18(3B) Income-tax Act, 1922. Writ not issued also due to alternative appeal pursued without disclosure.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'chargeable under the provisions of this Act' means liable in its nature to be brought into computation in an assessment, that is to say, as belonging to one or other of the heads of income, as set out in section 6 of the Act.",
      "speaker": "court",
      "significance": "Core interpretation of s.18(3B) including gross receipts."
    },
    {
      "text": "The charterer could not pay itself with its own money. Whether the procedure is called a set-off or first a notional payment of the money to the owners and then repayment by them through the charterers, the hire due to the owners was received and utilised by them in Calcutta.",
      "speaker": "court",
      "significance": "Explains constructive receipt by deduction."
    },
    {
      "text": "One of the fundamental principles of income-tax law that one cannot determine for income-tax purposes the nature of a payment by inquiring what becomes of it or what must become of it after the payee has received it.",
      "speaker": "court",
      "significance": "Rejects earmarking argument."
    },
    {
      "text": "Those persons who are bound under the Act to make deduction at the time payment of any income, profits or gains are not concerned with the ultimate result of the assessment.",
      "speaker": "court",
      "significance": "Quotes Supreme Court on payer's duty."
    }
  ],
  "_case_id": "1958_143",
  "_label": 0,
  "_text_length": 66003,
  "_extracted_at": "2026-02-10T19:22:11.532703"
}