{
  "metadata": {
    "case_name": "Legatees under Will v. Kesavan Kaimal and Transferees",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar J."
    ],
    "case_number": "Civil Appeals Nos. 5 and 6 of 1955",
    "date_of_judgment": "1958-10-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Will executed on February 10, 1906 (28th Makaram 1081 M.E.) jointly by Kunhan Kaimal (son of Karayamvattath Katbayakkal Kunhu Kutti Amma), Kesavan Kaimal (son of Theyi Amma), and Theyi Amma (daughter of Nani Amma) of Etathiruthi amsom and Etamuttan desom in Ponnani Taluk.",
      "type": "background",
      "date": "1906-02-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The will provided that all movable and immovable properties acquired jointly and separately by the three testators till then, in future, devolved or obtained, shall be held by them in possession and control till death, and after death, to be held hereditarily in equal shares by children of Kalliani Amma (Kali, Kunhu Kutty), Thona Amma (Parukutty, Kunhunni, Kochu Govindan, Ramar), and deceased Narayani Amma (Kunhunniri, Kuttiparu, Lakshmikutty) and their descendants.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The will allowed testators to alienate properties jointly or severally till death, and post-death, only specified heirs entitled, excluding alienated items.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Theyi Amma died first (exact date not material).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Kunhan Kaimal died in 1930.",
      "type": "background",
      "date": "1930",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Kesavan Kaimal claimed survivorship to all properties under the will, including Kunhan Kaimal's.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Kesavan Kaimal conveyed seven items (three belonging to Kunhan Kaimal) to Sankarankutty Kaimal on October 14, 1938.",
      "type": "procedural",
      "date": "1938-10-14",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Mortgage for Rs. 100 created over three properties (belonging to Kunhan Kaimal) on February 3, 1901.",
      "type": "background",
      "date": "1901-02-03",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Legatees under the 1906 will instituted O.S. No. 131 of 1945 in District Munsif, Chowghat, for possession of three items of Kunhan Kaimal's properties after redeeming the 1901 mortgage. Plaintiffs: legatees. Defendants 1-3: mortgagees. Defendant 6: Kesavan Kaimal. Defendants 4-5: transferees under Kesavan's October 16, 1944 deed.",
      "type": "procedural",
      "date": "1945",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "District Munsif decreed O.S. 131/1945 in favor of plaintiffs (legatees).",
      "type": "procedural",
      "date": "1945-10-09",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Kesavan Kaimal conveyed another three items (belonging to Kunhan Kaimal) to Kalyani and Vijayan on October 16, 1944.",
      "type": "procedural",
      "date": "1944-10-16",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Sankarankutty Kaimal instituted O.S. No. 158 of 1945 in District Munsif, Chowghat, for ejectment of defendants (including Kali Amma's LRs as D2-3) from three items (one absolute to Kunhan, two co-owned), alleging oral lease and rent arrears. Defendant 4: Kesavan Kaimal.",
      "type": "procedural",
      "date": "1945",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "District Munsif dismissed O.S. 158/1945 on June 29, 1946.",
      "type": "procedural",
      "date": "1946-06-29",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appeals: A.S. 180/1946 (by Kesavan) and A.S. 336/1946 (by Sankarankutty) in Subordinate Judge courts; both dismissed.",
      "type": "procedural",
      "date": "1946-09-19",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Second Appeals: S.A. 2256/1947 (by Kesavan) and S.A. 2545/1948 (by Sankarankutty) in Madras High Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Madras High Court (Raghava Rao J.) allowed both second appeals: held will created joint ownership with survivorship to Kesavan; dismissed O.S. 131/1945, decreed O.S. 158/1945.",
      "type": "procedural",
      "date": "1952-09-15",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Partition deed dated May 16, 1915, and mortgage deed dated March 4, 1926, to which Kesavan was party, treating properties as separate.",
      "type": "background",
      "date": "1915-05-16",
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "Execution proceedings: Kunhunni Kaimal's decree in S.C. 480/1933 against Kesavan; sale of tarwad properties; E.A. 320/1938 by tarwad members dismissed, Munsif noting Kesavan's power under will.",
      "type": "background",
      "date": "1938",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether under the will dated February 10, 1906, the three testators became joint owners of all properties covered by it, resulting in survivorship to Kesavan Kaimal on deaths of Theyi Amma and Kunhan Kaimal.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The will is testamentary, not creating joint tenancy inter vivos; each testator bequeathed their own properties to common legatees; no words divesting individual ownership; future properties cannot be subject of present disposition; power to alienate singly inconsistent with joint tenancy; partition and mortgage deeds show parties treated properties as separate.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f17"
      ],
      "legal_basis": "Marumakkathayam Law; nature of will as disposition on death"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Will construed as transfer inter vivos creating joint tenancy among testators; dealt with joint and separate properties uniformly; Theyi Amma would not prefer legatees over son Kesavan; subsequent conduct of parties (Kesavan dealing with properties, tarwad not disputing in E.A. 320/1938) shows understanding as joint estate.",
      "supporting_facts": [
        "f6",
        "f7",
        "f11",
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Will might be mutual will.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Will is testamentary disposition by each testator of their own properties (effectively three wills in one); no inter vivos transfer as it would require stamp and divesting words absent; future properties cannot be disposed presently; clause allowing individual alienation inconsistent with joint tenancy; properties 'jointly acquired' means tenants-in-common, not joint tenants.",
      "addresses_issue": "i1",
      "key_observation": "Joint will disposes separate properties of each testator on their death."
    },
    {
      "id": "cr2",
      "text": "Subsequent conduct inadmissible to vary clear language of will.",
      "addresses_issue": "i1",
      "key_observation": "Will language clear and unambiguous."
    },
    {
      "id": "cr3",
      "text": "Not mutual will as legatees distinct from testators.",
      "addresses_issue": "i1",
      "key_observation": "Mutual wills require reciprocal benefits between testators."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The will dated February 10, 1906, is a testamentary disposition operating on death of each testator as to their properties; no joint ownership or survivorship created among testators.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Re Duddell; Roundway v. Roundway",
      "citation": "1932 1 Ch. 585, 592",
      "treatment": "referred",
      "relevance": "Joint will operates as disposition of each testator's property on their death."
    }
  ],
  "statutes_cited": [
    {
      "name": "Stamp Act",
      "sections": [],
      "relevance": "Inter vivos transfer would require stamping; will unstamped."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 136"
      ],
      "relevance": "Certificate granted for appeal to Supreme Court."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order 21 Rule 100"
      ],
      "relevance": "Application in execution proceedings E.A. 320/1938."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeals, set aside Madras High Court judgment, holding the will testamentary with properties vesting in legatees on each testator's death; Kesavan Kaimal and his transferees have no claim to Kunhan Kaimal's properties.",
    "relief_granted": "Restoration of lower court decrees in favor of legatees (possession after redemption in O.S. 131/1945; dismissal of ejectment in O.S. 158/1945 implied).",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The point for determination in these two appeals is whether one Kesavan Kaimal who was one of three executants of a will dated February 10, 1906, became entitled under that will to the properties, which are the subject-matter of these appeals.",
      "speaker": "court",
      "significance": "States the sole issue."
    },
    {
      "text": "We are accordingly of opinion that the will dated February 10, 1906, is what it purports to be a will, and nothing else. It does not confer any rights inter se on the testators it only vests the title to the properties disposed of by it in the legatees on the death of the testators.",
      "speaker": "court",
      "significance": "Core holding on nature of the will."
    },
    {
      "text": "A joint will, though unusual, is not unknown to law.",
      "speaker": "court",
      "significance": "Affirms validity of joint wills as separate dispositions."
    }
  ],
  "_case_id": "1958_31",
  "_label": 1,
  "_text_length": 17269,
  "_extracted_at": "2026-02-08T22:17:00.689316"
}