{
  "metadata": {
    "case_name": "Jiyajeerao Cotton Mills Ltd. v. Commissioner of Income-tax",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar, J."
    ],
    "case_number": "Civil Appeal Nos. 204 of 1954 and 163 of 1958",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a public limited company incorporated in 1921 under Gwalior Companies Act, registered office at Gwalior, non-resident company for purposes of the Act, carries on business in manufacture and sale of textiles, managing agents Birla Brothers Ltd. registered in British India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant received sum of Rs. 27,30,094 during account year 1942-1943, admits it represents profits on certain forward contracts in cotton.",
      "type": "admitted",
      "date": "1942-1943",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Appellant contends contracts entered into at Gwalior with three brokers: Lashkar Trading Company, Banwarilal Shivkumar, Meghraj Mundra; agreements provide goods delivered and prices paid at Gwalior; sum made up of differences paid in settlement at Gwalior; profits accrued and received wholly at Gwalior.",
      "type": "disputed",
      "date": "1942-1943",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Department contends contracts entered into by managing agents of appellant with Jwaladutt Kishanprasad at Bombay; profits accrued in Bombay.",
      "type": "disputed",
      "date": "1942-1943",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Sum of Rs. 27,30,094 traceable to firm of Jwaladutt Kishanprasad.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant placed orders with three brokers in Gwalior, who placed orders with J.R. Pillani, Gwalior (branch of Jwaladutt Kishanprasad, Bombay); orders communicated to head office in Bombay; on settlement, monies sent by Bombay firm to J.R. Pillani Gwalior, paid to brokers, who paid appellant.",
      "type": "disputed",
      "date": "1942-1943",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Income-tax Officer held by order dated March 23, 1948, that forward contracts entered into by managing agents at Bombay, profits accrued at Bombay, three brokers mere dummies.",
      "type": "procedural",
      "date": "1948-03-23",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellate Assistant Commissioner confirmed ITO order on November 14, 1949.",
      "type": "procedural",
      "date": "1949-11-14",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellate Tribunal remanded case on July 26, 1950, for further investigation of intermediaries.",
      "type": "procedural",
      "date": "1950-07-26",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellate Assistant Commissioner took fresh evidence, examined seven witnesses, held on August 17, 1951, contracts entered into with Jwaladutt Kishanprasad by G.D. Birla and R.D. Birla at Bombay, contracts with brokers bogus.",
      "type": "procedural",
      "date": "1951-08-17",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellate Tribunal affirmed on February 28, 1952.",
      "type": "procedural",
      "date": "1952-02-28",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Tribunal dismissed reference application under s.66(1) on June 13, 1952.",
      "type": "procedural",
      "date": "1952-06-13",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Bombay High Court (Chagla CJ, Bhagwati J) dismissed application under s.66(2) on August 6, 1952.",
      "type": "procedural",
      "date": "1952-08-06",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "J.R. Pillani proprietor of Jwaladutt Kishanprasad Bombay and J.R. Pillani Gwalior; testified contracts made at Bombay by G.D. Birla and R.D. Birla in person or phone; profits first paid to Cotton Agents Ltd. Bombay, later returned and sent to Gwalior; names initially blank in books, later filled as J.R. Pillani Gwalior.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Account entries: Various debits/credits involving Cotton Agents Ltd. Bombay, J.R. Pillani Bombay/Gwalior, e.g., Rs.9,50,000 cheque from Cotton Agents to J.R. Pillani Bombay credited to Jwaladutt Kishanprasad.",
      "type": "material",
      "date": "1943-01-29 to 1943-03-11",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Three brokers had no prior/subsequent cotton futures business, no bank accounts, no proper accounts, ankdas freshly written; large cash payments alleged.",
      "type": "material",
      "date": "1942-1943",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Durgaprasad Mandalia (manager appellant) said brokers men of character, no securities taken; unable to explain not dealing directly with Cotton Agents Gwalior or J.R. Pillani Gwalior.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Transactions entered in Kherij Khata for small/short dealings, but these were large/long.",
      "type": "material",
      "date": "1942-1943",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Contracts recite principals, delivery/payment Gwalior, but per East India Cotton Association bye-laws, contracts take effect in Bombay, delivery in Bombay.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether sums of Rs. 27,30,094 received by appellant as profits on forward contracts in cotton during 1942-1943 liable to tax under Indian Income-tax Act, 1922, depending on whether contracts made at Gwalior or Bombay.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether any question of law arises from Tribunal order, or if finding of fact supported by evidence or perverse.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Contracts entered at Gwalior with brokers, profits accrued/received at Gwalior, not taxable.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Tribunal finding erroneous in law: no evidence or perverse.",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": "Meenakshi Mills v. Commissioner of Income-tax (proposition on no evidence/perverse finding)"
    },
    {
      "id": "pa3",
      "text": "Pillani evidence contradicted by accounts, Mahadeo Singhji; Gaurishanker Narandas partial support; no Birla evidence despite remand.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Contracts genuine as per terms, principal to principal, Gwalior delivery.",
      "supporting_facts": [
        "f3",
        "f19"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Contracts entered by Birlas with Jwaladutt Kishanprasad at Bombay, brokers dummies to conceal.",
      "supporting_facts": [
        "f4",
        "f14",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Brokers not credible: no means, no accounts, sham transactions.",
      "supporting_facts": [
        "f16",
        "f17",
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Contracts per East India Cotton Association rules made in Bombay.",
      "supporting_facts": [
        "f19"
      ],
      "legal_basis": "Bye-law No. 44-A of East India Cotton Association"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Whether question of law: pure fact finding on place of contracts not interfere unless no evidence or perverse.",
      "addresses_issue": "i2",
      "key_observation": "Finding of fact final unless no evidence or perverse (Meenakshi Mills)."
    },
    {
      "id": "cr2",
      "text": "Evidence supports Tribunal: Pillani direct testimony, account entries show initial payments to Cotton Agents Bombay then to Gwalior, blanks filled later.",
      "addresses_issue": "i1",
      "key_observation": "Rs.9,50,000 and other payments relate to cotton via Jwaladutt."
    },
    {
      "id": "cr3",
      "text": "Appellant evidence weak: brokers implausible, no securities, Kherij Khata inappropriate, contracts contradict bye-laws.",
      "addresses_issue": "i1",
      "key_observation": "Sham transactions to avoid tax."
    },
    {
      "id": "cr4",
      "text": "No misdirection; remand covered by examining manager; alternative pleas not raised below.",
      "addresses_issue": "i2",
      "key_observation": "Not court of appeal on facts."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Tribunal finding that contracts made at Bombay supported by evidence, not perverse; profits accrued in British India, taxable.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No question of law arises; finding of fact not vitiated.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Meenakshi Mills v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Principles on when Tribunal fact finding open to challenge: pure law, mixed, no evidence/perverse."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 34",
        "Section 66(1)",
        "Section 66(2)"
      ],
      "relevance": "Proceedings to tax escaped income; reference to court."
    },
    {
      "name": "Gwalior Companies Act",
      "sections": [],
      "relevance": "Incorporation of appellant."
    },
    {
      "name": "Bye-laws of East India Cotton Association",
      "sections": [
        "Bye-law No. 44-A"
      ],
      "relevance": "Contracts take effect as made in Bombay."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Both appeals dismissed as Tribunal's finding that forward contracts entered at Bombay and profits taxable is based on evidence and not perverse; no interference.",
    "relief_granted": null,
    "costs": "Respondent gets costs in Civil Appeal No. 204 of 1954; parties bear own costs in Civil Appeal No. 163 of 1958."
  },
  "key_quotes": [
    {
      "text": "A finding on a question of fact is open to attack under section 66(1) as erroneous in law when there is no evidence to support or if it is perverse.",
      "speaker": "court",
      "significance": "Test for interfering with Tribunal's fact finding."
    },
    {
      "text": "Every person is entitled so to arrange his affairs as to avoid taxation but the arrangement must be real and genuine and not a sham or make-believe.",
      "speaker": "court",
      "significance": "Limits of tax avoidance."
    }
  ],
  "_case_id": "1958_133",
  "_label": 0,
  "_text_length": 26037,
  "_extracted_at": "2026-02-08T22:34:08.000987"
}