{
  "metadata": {
    "case_name": "Managing Agents of Janardana Mills Ltd. v. Commissioner of Income-tax",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 709 of 1957",
    "date_of_judgment": "1958-11-24"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a firm acting as managing agents of Janardana Mills Ltd., Coimbatore.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant purchased four contiguous plots of land admeasuring 5 acres 26 cents under four sale deeds: October 25, 1941 for Rs. 521 covering 28 1/4 cents (in name of G. Raja, benami for appellant); November 15, 1941 for Rs. 1,250 covering 2 acres 79 1/4 cents; June 29, 1942 for Rs. 1,942 covering 28 1/4 cents; November 19, 1942 for Rs. 5,000 covering 1 acre 90 cents. Total consideration Rs. 8,712-15-6.",
      "type": "material",
      "date": "1941-10-25",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Plots adjoin the Janardana Mills.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f4",
      "text": "On plot purchased June 29, 1942, stood a house of six rooms fetching annual rent of Rs. 100, net Rs. 80 after taxes.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Other plots were vacant sites bringing no income.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "During possession, appellant made no effort to put up structures or cultivate the plots.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f7",
      "text": "Properties sold in two lots to Janardana Mills Ltd.: September 1, 1947 for Rs. 49,775 (three properties); November 10, 1947 for Rs. 2,825 (first property). Total sale consideration Rs. 52,600, profit Rs. 43,887-0-6.",
      "type": "material",
      "date": "1947-09-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Income-tax Officer assessed Rs. 43,887 as business income for 1948-49, holding it an adventure in the nature of trade due to no evidence of purchase for agriculture or investment, lands adjacent to mills, purchased solely to sell to mills at profit.",
      "type": "procedural",
      "date": null,
      "source": "income_tax_officer"
    },
    {
      "id": "f9",
      "text": "Appellate Assistant Commissioner upheld appellant's contention, set aside assessment, holding not assessable as no profit-making scheme.",
      "type": "procedural",
      "date": null,
      "source": "appellate_assistant_commissioner"
    },
    {
      "id": "f10",
      "text": "Income-tax Appellate Tribunal upheld ITO, held amount not capital accretion but gain from adventure in nature of business, rejected appellant's explanations, found purchase solely to sell to mills at profit.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f11",
      "text": "Tribunal referred question to Madras High Court at appellant's instance: 'whether there was material for the assessment of the sum of Rs. 43,887 being the difference between the purchase and sale price of the four plots of land as income from an adventure in the nature of trade'. High Court answered against appellant on April 18, 1955.",
      "type": "procedural",
      "date": "1955-04-18",
      "source": "high_court"
    },
    {
      "id": "f12",
      "text": "Appellant obtained special leave to appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appellant contended properties bought as investment.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Appellant alternatively contended purchased for building tenements for mill labourers, mills bought due to industrial tribunal award in June 1947 recommending tenements.",
      "type": "disputed",
      "date": "1947-06",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Tribunal rejected investment plea and tenements plea.",
      "type": "admitted",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f16",
      "text": "G. Raja is assistant manager of Janardana Mills, son-in-law of G. Venkataswami Naidu, partner in appellant firm.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the transaction in question was an adventure in the nature of trade, making the profit taxable as business income.",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether the finding that the transaction is an adventure in the nature of trade is a pure question of fact, mixed question of law and fact, or question of law, affecting scope of High Court's jurisdiction under s. 66(1) of Income-tax Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Transaction is not an adventure in the nature of trade but a capital accretion from investment; solitary transaction lacks elements of trade.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Income-tax Act s.2(4); precedents like Reinhold"
    },
    {
      "id": "pa2",
      "text": "Properties purchased for building tenements for mill labourers; mills purchased due to industrial tribunal award recommending provision of tenements.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Tribunal's finding is perverse, unsupported by evidence, or based on misapplication of legal principles; question is mixed law and fact reviewable under s.66(1).",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": "Income-tax Act s.66(1); Meenakshi Mills v. CIT; Edwards v. Bairstow"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant purchased plots solely intending to sell to mills at profit; as managing agents, could influence mills; no development or cultivation; adjacent to mills; raises presumption of adventure in trade.",
      "supporting_facts": [
        "f2",
        "f3",
        "f6",
        "f7"
      ],
      "legal_basis": "Income-tax Act s.2(4), s.10"
    },
    {
      "id": "ra2",
      "text": "Question is one of fact conclusive under s.66(1); or if mixed, tribunal applied correct principles.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Income-tax Act s.66(1)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Whether transaction is adventure in nature of trade is mixed question of law and fact; tribunal finds primary facts, applies legal concept from s.2(4); reviewable if misapplies principles.",
      "addresses_issue": "i2",
      "key_observation": "High Court can examine if relevant legal principles correctly applied."
    },
    {
      "id": "cr2",
      "text": "No universal test or formula; consider factors: nature of commodity (land usually investment), purchaser's business, quantity, improvement, incidents of purchase/sale, repetition, pride of possession, initial intention to resell.",
      "addresses_issue": "i1",
      "key_observation": "Initial intention to resell at profit raises strong presumption of adventure in trade, rebuttable by other factors."
    },
    {
      "id": "cr3",
      "text": "Applied factors to facts: appellant not ordinarily investor in land; piecemeal purchases over 2 years consolidating contiguous plots adjoining mills; no utilization except minimal rent; sold after consolidation to mills it managed; sole intention to resell at profit; presumption not rebutted.",
      "addresses_issue": "i1",
      "key_observation": "Transaction is series of four purchases in scheme to sell to mills; High Court right."
    },
    {
      "id": "cr4",
      "text": "Reviewed and distinguished precedents: followed Livingston, Rutledge etc. where intention and circumstances showed trade nature; distinguished Reinhold as borderline, onus not discharged there.",
      "addresses_issue": "i1",
      "key_observation": "Total effect of circumstances determines character."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Question whether transaction is adventure in nature of trade is mixed question of law and fact.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "On facts proved, transaction is adventure in nature of trade; profit taxable as business income under s.10.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Inland Revenue v. Livingston",
      "citation": "1926 11 Tax Cas. 538",
      "treatment": "followed",
      "relevance": "Profit from converting ship to marketable drifter after purchase was adventure in trade."
    },
    {
      "case_name": "Martin v. Lowry",
      "citation": "1926 11 Tax Cas 297",
      "treatment": "followed",
      "relevance": "Purchase and resale of large surplus linen stock with advertising etc. was trade."
    },
    {
      "case_name": "Rutledge v. Commissioners of Inland Revenue",
      "citation": "1929 14 Tax Cas. 490",
      "treatment": "followed",
      "relevance": "Moneylender's purchase of large cheap paper in Berlin for quick resale at profit was adventure in trade."
    },
    {
      "case_name": "Balgownie Land Trust, Ltd. v. Commissioners of Inland Revenue",
      "citation": "1929 14 Tax Cas. 684",
      "treatment": "followed",
      "relevance": "Company formed to realise estate, bought more property, sold parts: launching into trade."
    },
    {
      "case_name": "F.A. Lindsay, A.E. Woodward and W. Hiscox v. Commissioners of Inland Revenue",
      "citation": "1932 18 Tax Cas. 43",
      "treatment": "followed",
      "relevance": "Joint venture shipping whisky for resale was trade."
    },
    {
      "case_name": "Cayzer, Irvine and Co., Ltd. v. Commissioners of Inland Revenue",
      "citation": "1942 24 Tax Cas. 491",
      "treatment": "followed",
      "relevance": "Development of land to make saleable showed trading asset not investment."
    },
    {
      "case_name": "Commissioners of Inland Revenue v. Reinhold",
      "citation": "1953 34 Tax Cas. 389",
      "treatment": "distinguished",
      "relevance": "Borderline case of houses bought to resell; onus not discharged; not general proposition."
    },
    {
      "case_name": "Meenakshi Mills, Madurai v. Commissioner of Income-tax, Madras",
      "citation": "1958 S.C.R. 49",
      "treatment": "followed",
      "relevance": "Limits on s.66(1) jurisdiction; benami pure fact."
    },
    {
      "case_name": "Oriental Investment Co. Ltd. v. Commissioner of Income-tax, Bombay",
      "citation": "1956 S.C.R. 691",
      "treatment": "followed",
      "relevance": "Dealer vs investor mixed law and fact."
    },
    {
      "case_name": "Edwards v. Bairstow",
      "citation": "1956 A.C. 14; 36 Tax Cas. 207",
      "treatment": "referred",
      "relevance": "Transaction character mixed; court examines if facts compel different conclusion."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "s. 2(4)",
        "s. 10",
        "s. 66(1)"
      ],
      "relevance": "s.2(4) defines business including adventure in nature of trade; s.10 taxes business profits; s.66(1) High Court reference jurisdiction on questions of law."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upheld Madras High Court and Tribunal, holding the purchase and sale of lands an adventure in the nature of trade taxable as business income.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the purchase has been made solely and exclusively with the intention to resell at a profit and the purchaser has no intention of holding the property for himself or otherwise enjoying or using it. The presence of such an intention is no doubt a relevant factor and unless it is offset by the presence of other factors it would raise a strong presumption that the transaction is an adventure in the nature of trade.\"",
      "speaker": "court",
      "significance": "Key test for distinguishing investment from adventure in trade."
    },
    {
      "text": "\"In this connection it would be relevant to refer to another test which is sometimes applied in determining the character of the transaction. Was the purchase made with the intention to resell it at a profit?\"",
      "speaker": "court",
      "significance": "Introduces intention test, central to decision."
    },
    {
      "text": "\"We must, therefore, hold that the High Court was right in taking the view that, on the facts and circumstances proved in this case, the transaction in question is an adventure in the nature of trade.\"",
      "speaker": "court",
      "significance": "Concluding holding upholding tax."
    }
  ],
  "_case_id": "1958_65",
  "_label": 0,
  "_text_length": 76962,
  "_extracted_at": "2026-02-10T19:20:38.002010"
}