{
  "metadata": {
    "case_name": "Heir of Sailendra Sundar Mitra v. State",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha J."
    ],
    "case_number": "Criminal Appeal No. 116 of 1956",
    "date_of_judgment": "1958-10-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On 2nd December 1946 at Garden Reach, accused Sailendra Sundar Mitra, Establishment Clerk of B.C. II Section in Traffic Accounts Office of B.N. Railway (now Eastern Railway), cheated B.N. Railway by dishonestly inducing delivery of Rs. 205-13-0 excess to himself and Rs. 33-4-0 to Satish Chandra Das Gupta via false representation in pay bill for November 1946.",
      "type": "material",
      "date": "1946-12-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Trial Magistrate convicted accused for cheating Rs. 205-13-0 (benefit of doubt for Rs. 33-4-0), sentenced to one day's imprisonment (detention till rising of court), fine Rs. 500 (default 6 months RI), Rs. 333 of fine to B.N. Railway (now South Eastern Railway) as compensation. Order dated February 11, 1955.",
      "type": "procedural",
      "date": "1955-02-11",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Additional Sessions Judge, Alipore, dismissed appeal, confirmed conviction and sentence. Judgment dated May 9, 1955.",
      "type": "procedural",
      "date": "1955-05-09",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Accused filed revision under s.439 CrPC in Calcutta High Court (Criminal Revision No. 714 of 1955), rule issued, stay on realization of fine.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Accused died on July 8, 1955, survived by widow and five children (all minors except appellant).",
      "type": "background",
      "date": "1955-07-08",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant (son and heir) applied on December 6, 1955, to be added as party to revision to challenge conviction and sentence.",
      "type": "procedural",
      "date": "1955-12-06",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Calcutta High Court on December 22, 1955: Allowed substitution only for sentence of fine (principle of s.431 applies to composite sentence only for fine), refused to examine conviction merits, reduced fine to Rs. 205/13/- payable to B.N. Railway (now South Eastern Railway).",
      "type": "procedural",
      "date": "1955-12-22",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant obtained certificate of fitness under Art. 134(1)(c) Constitution, filed appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Defence of accused: over-charged on account of mistake, prepared to refund excess.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a pending application in revision under s.439 CrPC finally abates on the death of the petitioner, and if so, to what extent.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether High Court can limit revisional jurisdiction to sentence of fine only, without examining merits of conviction, in case of composite sentence where accused died after serving imprisonment.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Application to be substituted as heir to proceed with criminal revision challenging order of conviction and sentence.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.439 CrPC"
    },
    {
      "id": "pa2",
      "text": "High Court erred in refusing to go into merits of conviction and limiting revision to propriety of fine only.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Principle of s.431 CrPC applies to revision; abates except for fine in composite sentence.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s.431 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.431 CrPC applies only to appeals under Chapter XXXI, not to revisions under s.439; revisions do not abate automatically on death of petitioner.",
      "addresses_issue": "i1",
      "key_observation": "High Court has discretionary power under s.439 to pass orders as fit in aid of justice, no statutory abatement for revisions."
    },
    {
      "id": "cr2",
      "text": "Revisional jurisdiction not limited to fine; where fine affects estate of deceased, High Court can examine correctness of conviction itself.",
      "addresses_issue": "i2",
      "key_observation": "Question of fine cannot be examined without merits of conviction; heir entitled to challenge conviction if fine payable from estate."
    },
    {
      "id": "cr3",
      "text": "Legislature aware of prior decisions but did not extend s.431 to revisions; High Court power untouched, to be exercised per exigencies.",
      "addresses_issue": "i1",
      "key_observation": "Right of appeal statutory, but revision supervisory and discretionary."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Pending revision under s.439 CrPC does not finally abate on death of petitioner; High Court has discretion to continue and examine conviction where fine involved.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court cannot limit revision to fine only; must examine conviction merits if entertaining revision post-death.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "In re Nabishab",
      "citation": "1894 I.L.R. 19 Bom. 714",
      "treatment": "followed",
      "relevance": "High Court refused revision post-abatement of appeal on death, but on ground of evidence appreciation."
    },
    {
      "case_name": "Imperatrix v. Dongaji Andaji",
      "citation": "1878 I.L.R. 2 Bom. 564",
      "treatment": "followed",
      "relevance": "Appeal abated on death; no power for legal representative to continue appeal, but revision possible; majority held no continuation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s.439",
        "s.431",
        "s.435",
        "s.411A",
        "s.417"
      ],
      "relevance": "s.431 governs abatement of appeals only, not revisions; s.439 vests discretionary revisional power in High Court."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "s.420"
      ],
      "relevance": "Offence of cheating for which accused convicted."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 134(1)(c)"
      ],
      "relevance": "Certificate for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court held that revision does not abate on death under s.431 (applies only to appeals), High Court has discretion under s.439 to examine conviction merits where fine affects estate; High Court erred in limiting to fine only.",
    "relief_granted": "Appeal allowed; High Court directed to examine merits of conviction.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The simple question for determination in this appeal... is whether a pending application in revision made under s. 439 of the Code... finally abates on the death of the petitioner in the High Court, and if so, to what extent.",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "In our opinion, in the absence of statutory provisions... the High Court has the power to pass such orders as to it may seem fit and proper, in exercise of its revisional jurisdiction vested in it by s. 439 of the Code.",
      "speaker": "court",
      "significance": "Key holding on non-abatement of revisions."
    },
    {
      "text": "Once it is held that the High Courts revisional jurisdiction is attracted to such a case, it is difficult to limit the exercise of such a power in the way the High Court has done.",
      "speaker": "court",
      "significance": "Rejects High Court's limitation to fine only."
    }
  ],
  "_case_id": "1958_124",
  "_label": 1,
  "_text_length": 20313,
  "_extracted_at": "2026-02-10T19:21:09.261831"
}