{
  "metadata": {
    "case_name": "State of Uttar Pradesh v. Lakshmi Devi Sugar Mills Ltd.",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Criminal Appeals Nos. 157 and 158 of 1957 and 5 of 1958",
    "date_of_judgment": "1959-12-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Lakshmi Devi Sugar Mills Ltd. owns a factory at Chhitauni for manufacturing sugar.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The three respondents are respectively the General Manager, Assistant Manager and Secretary of the company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The company employs field workers, i.e., Supervisors and Kamdars, to guide, supervise and control the growth and supply of sugarcane for use in the factory.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Deputy Chief Inspector of Shops and Commercial Establishment, Uttar Pradesh, filed three complaints against the respondents in the court of the Judicial Magistrate, Deoria, charging them with contravention of ss. 12, 13 and 26 of the United Provinces Shop and Commercial Establishment Act, 1947 in respect of certain field workers.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondents contended that the Act did not apply to those employees as they were workers within the meaning of the Factories Act and accordingly exempt.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Judicial Magistrate rejected the contention, convicted respondents of contravention of s. 26 of the Act and sentenced each to pay a fine of Rs. 30 in each of the three cases.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Respondents preferred revision applications to the Court of Session at Deoria.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Sessions Judge, Deoria, disagreed with Trial Magistrate and on December 18, 1954, referred the cases to High Court at Allahabad in Criminal Revisions Nos. 7, 8 and 9 of 1954, recommending that orders of conviction and sentence be set aside.",
      "type": "procedural",
      "date": "1954-12-18",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Allahabad High Court on October 31, 1955, accepted the references in Criminal Reference Nos. 28, 29 and 30 of 1955 and ordered acquittal of the respondents.",
      "type": "procedural",
      "date": "1955-10-31",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "State of Uttar Pradesh appealed to Supreme Court by special leave under Art. 136 of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether field workers, i.e., Supervisors and Kamdars employed by a sugar factory to guide, supervise and control the growth and supply of sugarcane for use in the sugar factory are employees of a Commercial Establishment within the meaning of the United Provinces Shop and Commercial Establishment Act, XXII of 1947.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Field workers are employees of a Commercial Establishment as defined in s. 2 cl. 3 of the Act, since reference to Factories Act 1934 is to be construed as Factories Act 1948, and they are not workers under Factories Act.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "s. 2 cl. 3 U.P. Shops and Commercial Establishments Act; s. 8 General Clauses Act; Factories Act 1948 ss. 2(l), 2(m)"
    },
    {
      "id": "pa2",
      "text": "Contention that since repeal of Factories Act 1934, all clerical and other establishments of factory are included without exemption has no force.",
      "supporting_facts": [],
      "legal_basis": "s. 8 General Clauses Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Field workers are workers within the meaning of the Factories Act and accordingly exempt from the operation of the U.P. Shops and Commercial Establishments Act.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Factories Act ss. 2(l), 2(m)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "By definition in s. 2 cl. 3 of the Act, clerical and other establishments of a factory to whom Factories Act provisions do not apply are included; reference to 1934 Act construed as 1948 Act via s. 8 General Clauses Act.",
      "addresses_issue": "i1",
      "key_observation": "Field workers not employed in precincts or premises of factory."
    },
    {
      "id": "cr2",
      "text": "Factories Act 1948 s. 2(l) defines worker as person employed in manufacturing process or cleaning or other work incidental or connected with manufacturing process or subject thereof, but only if employed in factory premises s. 2(m).",
      "addresses_issue": "i1",
      "key_observation": "Field workers guide sugarcane growth outside factory premises, so not workers under Factories Act."
    },
    {
      "id": "cr3",
      "text": "Even if connected with subject of manufacturing process (sugarcane), unless employed in factory, Factories Act does not apply; thus they fall within Commercial Establishment definition.",
      "addresses_issue": "i1",
      "key_observation": "High Court erred in holding them as workers under Factories Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Field workers employed outside factory premises to supervise sugarcane growth and supply are not workers under Factories Act 1948 and are employees of Commercial Establishment under U.P. Act 1947.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "United Provinces Shop and Commercial Establishments Act, 1947",
      "sections": [
        "s. 2 cl. 3",
        "s. 11",
        "s. 12",
        "s. 13",
        "s. 26",
        "s. 27"
      ],
      "relevance": "Defines Commercial Establishment; regulates holidays, leave, records; penalises contraventions; applies to field workers as they are not under Factories Act."
    },
    {
      "name": "Factories Act, 1934",
      "sections": [],
      "relevance": "Repealed and referenced in U.P. Act definition; construed as 1948 Act."
    },
    {
      "name": "Factories Act, 1948",
      "sections": [
        "s. 2(l)",
        "s. 2(m)"
      ],
      "relevance": "Defines 'worker' and 'factory'; excludes field workers not employed in factory premises."
    },
    {
      "name": "General Clauses Act, 1897",
      "sections": [
        "s. 8"
      ],
      "relevance": "Construes reference to repealed Factories Act 1934 as to re-enacted 1948 Act."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 136"
      ],
      "relevance": "Basis for special leave appeals."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Orders of acquittal passed by the High Court set aside; orders of conviction and sentence passed by the Trial Magistrate restored.",
    "relief_granted": "Convictions under s. 26 restored with fines of Rs. 30 each.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is difficult to hold that field workers who are employed in guiding, supervising and controlling the growth and supply of sugarcane to be used in the factory are employed either in the precincts of the factory or in the premises of the factory.",
      "speaker": "court",
      "significance": "Core reasoning why field workers not under Factories Act."
    },
    {
      "text": "The High Court was therefore in error in acquitting the respondents of the offences of which they were convicted by the Trial Magistrate.",
      "speaker": "court",
      "significance": "Directly overturns High Court decision."
    }
  ],
  "_case_id": "1959_142",
  "_label": 1,
  "_text_length": 7639,
  "_extracted_at": "2026-02-10T19:37:18.459553"
}