{
  "metadata": {
    "case_name": "Appellant (Cinema Lessee Company) v. Respondent (Poona Municipal Corporation)",
    "case_year": 1955,
    "court": "Supreme Court of India",
    "judges": [
      "Das, C.J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a public limited company registered under the Companies Act. It is a lessee of four cinema houses situate within the municipal limits of Poona City known respectively as Minerva, The Globe, Sri Krishna and The Nishat. It exhibits cinematograph films, both foreign and Indian, in the said four houses.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent, a body corporate, was governed by the Bombay District Municipal Act, 1901 (Bom. III of 1901) up to June 8, 1926, and from then by the Bombay Municipal Boroughs Act, 1925 (Bom. XVIII of 1925) up to December 29, 1949, and, thereafter, by the Bombay Provincial Municipal Corporation Act, 1949 (Bom. LIX of 1949).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "With effect from October 1, 1920, the respondent, with the sanction of the Government of Bombay levied on the owners and lessees of cinema houses within the limits of the erstwhile province of Bombay a tax of Rs. 2 per day as license fee. Rules for the levy and collection of the said tax were framed by the respondent.",
      "type": "material",
      "date": "1920-10-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Those rules were amended on or about June 3, 1941, enhancing the tax from Rs. 2 per day to Rs. 1 per show.",
      "type": "material",
      "date": "1941-06-03",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The rules were again revised on or about June 9, 1948, under which the tax was enhanced from Rs. 1 per show to Rs. 5 per show. At all material times the tax was being collected at the last mentioned rate.",
      "type": "material",
      "date": "1948-06-09",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Every since the appellant became a lessee of the said cinema houses, the appellant has been making payments of the said tax under protest.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "After giving the necessary statutory notice to the respondent, the appellant, on or about March 31, 1950, filed a suit in the Court of the Civil Judge, Senior Division, Poona, being Suit No. 76 of 1950, against the respondent for a declaration that the levy and imposition of the said tax with effect from October 1, 1920, were invalid and illegal that the enhancement in the rates of the tax with effect first from June 3, 1941, and then June 9, 1948, was invalid and illegal and that the resolutions passed and rules framed in connection with the levy, imposition, enhancement and collection of the said impugned tax were invalid, illegal and ultra vires, for a permanent injunction restraining the defendants from levying or recovering and or increasing and enhancing the said tax and for refund to the appellant of the amounts of the tax collected from it and for costs of the suit and interest.",
      "type": "procedural",
      "date": "1950-03-31",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "By its judgment dated November 30, 1951, the trial court held that the said tax was validly levied and imposed, but that the increase and enhancement thereof in 1941 and 1948 were illegal and ultra vires and that the suit was not barred under the Acts governing the respondent. The trial court decreed the suit in part by issuing an injunction restraining the respondent from levying, recovering or collecting the tax at the enhanced rate and passing a decree against the respondent for refund of a sum of Rs. 27,072 with interest and costs.",
      "type": "procedural",
      "date": "1951-11-30",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The respondent preferred an appeal and the appellant filed cross objections.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "But the High Court by its judgment and decree dated February 10, 1953, reversed the judgment of the trial court and dismissed the suit of the appellant with costs throughout. The appellants cross objections were also dismissed.",
      "type": "procedural",
      "date": "1953-02-10",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On December 10, 1953, the High Court granted leave to the appellant to appeal to this Court from the said judgment. Hence this final appeal questioning the validity of the impugned tax.",
      "type": "procedural",
      "date": "1953-12-10",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the law imposing this tax is covered by entry 50 in List II of the Seventh Schedule to the Government of India Act, 1935, but is really a tax on the appellants trade or calling referred to in entry 46 and that, therefore, the amount of tax cannot under s. 142-A of the Government of India Act, 1935 exceed Rs. 100 per annum.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether s. 59(1)(xi) of the Bombay District Municipal Act, 1901 is unconstitutional in that the legislature had completely abdicated its functions and had delegated essential legislative power to the Municipality to determine the nature of the tax to be imposed on the rate payers.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether, under clause (xi) of s. 59(1), the enhancements of the rates of the tax in 1941 and again in 1948 were illegal in that the municipality had no power to do so under the Bombay Municipal Boroughs Act, 1925, particularly s. 60 thereof.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The law imposing this tax is covered by entry 50 in List II of the Seventh Schedule to the Government of India Act, 1935, but is really a tax on the appellants trade or calling referred to in entry 46 and that, therefore, the amount of tax cannot under s. 142-A of the Government of India Act, 1935 exceed Rs. 100 per annum.",
      "supporting_facts": [
        "f1",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Entry 50 and 46 List II, s.142A Government of India Act, 1935"
    },
    {
      "id": "pa2",
      "text": "s. 59(1)(xi) is unconstitutional in that the legislature had completely abdicated its functions and had delegated essential legislative power to the Municipality to determine the nature of the tax to be imposed on the rate payers. The power thus delegated to the municipality is unguided, uncanalised and vagrant, for there is nothing in the Act to prevent the municipality from imposing any tax it likes, even, say, income-tax. Such omnibus delegation cannot be supported as constitutional.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "s.59(1)(xi) Bombay District Municipal Act, 1901"
    },
    {
      "id": "pa3",
      "text": "Under clause (xi) of s. 59(1), the enhancements of the rates of the tax in 1941 and again in 1948 were illegal in that the municipality had no power to do so under the Bombay Municipal Boroughs Act, 1925. s.60 only provides power to suspend, reduce or abolish any existing tax; 'modify' should be construed in the sense of reduction, as per marginal note and root meaning.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "s.59(1)(xi) Bombay District Municipal Act, 1901; s.60 Bombay Municipal Boroughs Act, 1925"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The first point (tax on trade under entry 46) need not detain us long, for it is covered by us in the appellants other appeal No. 145 of 1955.",
      "addresses_issue": "i1",
      "key_observation": "Point covered in other appeal."
    },
    {
      "id": "cr2",
      "text": "s.59(1)(xi) is not unconstitutional. The power of the municipality cannot exceed the power of the provincial legislature itself; taxes must be for purposes of the Act, implementing obligations in Ch. VII, with reasonable relation to duties (e.g., s.54); items i-x indicate kind and nature; subject to approval of Governor-in-Council. The impugned section did lay down a principle and fix a standard; delegation not excessive.",
      "addresses_issue": "i2",
      "key_observation": "Delegation valid as limited by legislature's powers, Act's purposes, indicative items, and Governor approval."
    },
    {
      "id": "cr3",
      "text": "Enhancements valid under s.60 Bombay Municipal Boroughs Act, 1925. 'Modify' includes enhancement: marginal note cannot control clear body; change from 'reduce' (s.67 Bombay District Municipal Act) to 'modify' intentional to widen scope; s.76 refers to modification involving increase; Stevens v. General Steam Navigation supports 'modification' as alteration narrowing or enlarging.",
      "addresses_issue": "i3",
      "key_observation": "'Modify' means alteration including increase, legislative intent to widen scope."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The tax is not limited by entry 46 and s.142A GOI Act 1935.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "s.59(1)(xi) Bombay District Municipal Act 1901 is constitutional; no excessive delegation.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Municipality had power under s.60 Bombay Municipal Boroughs Act 1925 to enhance rates; 'modify' includes increase.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Appellant's other appeal No. 145 of 1955",
      "citation": null,
      "treatment": "followed",
      "relevance": "Covers the point on tax classification under GOI Act 1935 entries 46 and 50."
    },
    {
      "case_name": "Commissioner of Income Tax, Bombay v. Ahmedbhai Umarbhai and Co., Bombay",
      "citation": "1950 S.C.R. 335 at p. 353",
      "treatment": "followed",
      "relevance": "Marginal note cannot affect construction of clear language in body of section."
    },
    {
      "case_name": "Stevens v. The General Steam Navigation Company, Ltd.",
      "citation": "L.R. [1903] 1 K.B. 890",
      "treatment": "followed",
      "relevance": "Modification implies alteration, applicable whether narrowing or enlarging provisions."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay District Municipal Act, 1901 (Bom. III of 1901)",
      "sections": [
        "s.59(1)(xi)",
        "s.54",
        "s.67"
      ],
      "relevance": "Authorizes municipality to impose taxes including residuary under (xi) with Governor approval, for Act purposes; prior s.67 used 'reduce'."
    },
    {
      "name": "Bombay Municipal Boroughs Act, 1925 (Bom. XVIII of 1925)",
      "sections": [
        "s.60",
        "s.76"
      ],
      "relevance": "s.60 empowers municipality to suspend, modify or abolish tax; 'modify' includes enhancement; s.76 refers to modification involving increase."
    },
    {
      "name": "Bombay Provincial Municipal Corporation Act, 1949 (Bom. LIX of 1949)",
      "sections": [],
      "relevance": "Governed respondent post-1949."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "s.142A",
        "List II Entry 50",
        "List II Entry 46"
      ],
      "relevance": "Tax classification; limit of Rs.100 pa under entry 46."
    },
    {
      "name": "Indian Councils Act, 1861 (24 & 25 Vic. c. 67)",
      "sections": [],
      "relevance": "Governor-in-Council meaning."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's judgment reversing the trial court and dismissing the appellant's suit challenging the validity of the cinema tax levy from 1920 and its enhancements in 1941 and 1948, with costs.",
    "relief_granted": null,
    "costs": "High Court dismissed suit with costs throughout."
  },
  "key_quotes": [
    {
      "text": "\"the power of the municipality cannot exceed the power of the provincial legislature itself and the municipality cannot impose any tax, e.g., income tax which the provincial legislature could not itself impose.\"",
      "speaker": "court",
      "significance": "Limits scope of delegation under s.59(1)(xi)."
    },
    {
      "text": "\"Taxes, therefore, can be levied by the municipality only for implementing those purposes and for no other purpose.\"",
      "speaker": "court",
      "significance": "Tax must relate to municipal duties under the Act."
    },
    {
      "text": "\"the dropping of the word reduce and the introduction of the word modify in the body of s. 60 ... clearly indicate an intention on the part of legislature to widen the scope of this section\"",
      "speaker": "court",
      "significance": "Interprets 'modify' in s.60 to include enhancement."
    }
  ],
  "_case_id": "1959_143",
  "_label": 0,
  "_text_length": 12498,
  "_extracted_at": "2026-02-10T19:37:31.800916"
}