{
  "metadata": {
    "case_name": "Ahmedabad Manufacturing and Calico Printing Co. Ltd. v. Commissioner of Excess Profits Tax",
    "case_year": 1955,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee company is a limited liability company and one of the well known manufacturers of textile goods.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Concerned with three chargeable accounting periods corresponding to the calendar years 1943, 1944 and 1945.",
      "type": "background",
      "date": "1943-01-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Excess Profits Tax Officer found large payments made to five employees during the chargeable accounting periods based on a percentage of profits without first deducting income-tax or excess profits tax.",
      "type": "material",
      "date": null,
      "source": "excess_profits_tax_officer"
    },
    {
      "id": "f4",
      "text": "In case of 53 employees, excessive contributions made by the company to their provident funds, also based on percentage of profits without deducting taxes.",
      "type": "material",
      "date": null,
      "source": "excess_profits_tax_officer"
    },
    {
      "id": "f5",
      "text": "Five agreements with employees: four between 1933 and 1935, one in 1944, providing bonus as X per cent of profit of block value for the year, where profits meant company's profit for each complete official year as shown in balance-sheet before providing for depreciation and income-tax and super-tax.",
      "type": "admitted",
      "date": "1933-1944",
      "source": "assessee"
    },
    {
      "id": "f6",
      "text": "Provident Fund Regulations framed with effect from June 30, 1935, recognised by Commissioner of Income-tax. Regulation 12(b): If profits come to 4% and over on the cost value of the block, company payable amount as bonus = (Profit for year / Block value) x 100 x R (pre-assigned constant). Regulation 13: Profits meant as shown in balance-sheet before depreciation and income-tax charges but after providing for bonus.",
      "type": "admitted",
      "date": "1935-06-30",
      "source": "assessee"
    },
    {
      "id": "f7",
      "text": "Dispute whether 'income-tax and super-tax' includes excess profits tax introduced in 1940.",
      "type": "disputed",
      "date": "1940",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In assessment year 1944-45 (chargeable period ending 31.12.1943), Income-tax Officer did not allow claim re excess profits tax deduction; Excess Profits Tax Officer disallowed under Rule 12(1).",
      "type": "procedural",
      "date": "1944-45",
      "source": "income_tax_officer"
    },
    {
      "id": "f9",
      "text": "In subsequent years (periods ending 31.12.1944 and 31.12.1945), Income-tax Officer and Excess Profits Tax Officer allowed bonus and contributions on basis of net profits after deducting excess profits tax, under Rule 12(1).",
      "type": "procedural",
      "date": "1944-1945",
      "source": "excess_profits_tax_officer"
    },
    {
      "id": "f10",
      "text": "Excess Profits Tax Officer relied on Walchand Co. Ltd. v. Hindustan Construction Co. Ltd., disallowed excess bonuses: specific amounts for 5 employees and 53 provident fund contributions totaling Rs. 3,82,240.",
      "type": "material",
      "date": null,
      "source": "excess_profits_tax_officer"
    },
    {
      "id": "f11",
      "text": "Appellate Tribunal upheld Excess Profits Tax Officer; declined to state case, but High Court directed on assessee's application.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f12",
      "text": "Bombay High Court dated 27.08.1954 answered first question in negative, declined second.",
      "type": "procedural",
      "date": "1954-08-27",
      "source": "bombay_high_court"
    },
    {
      "id": "f13",
      "text": "Excess Profits Tax Officer in remand report: Payments excessive compared to other Ahmedabad textile mills (bonuses 3-6 months salary); percentages to salary 412-884% for 4 employees, Rs.2,46,260 bonus to one without salary; provident fund contributions 56-553% of salary.",
      "type": "material",
      "date": null,
      "source": "excess_profits_tax_officer"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in law, if there is an obligation on the employer to pay a certain bonus, the Excess Profits Tax Officer is bound to allow it as a deduction and is precluded from exercising his discretion under rule 12(1) of the First Schedule of the Excess Profits Tax Act.",
      "framed_by": "high_court"
    },
    {
      "id": "i2",
      "text": "If the answer to the first question is in the affirmative, whether on a true construction of the agreement between the assessee and its employees and the Provident Fund Rules, the assessee company is under obligation to pay the bonus without deducting the excess profits tax.",
      "framed_by": "high_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Genuineness of agreements and rules not questioned; agreements pre-date Excess Profits Tax Act; Provident Fund recognised by Commissioner; no dispute on meaning; construction excludes excess profits tax; reasonableness of percentage not questioned.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "L.C. Ltd. v. G.B. Ollivant Ltd. (1945) 13 ITR Sup. 23; N.M. Rayaloo Iyer v. CIT; CIT v. Delhi Flour Mills; Western Hosiery v. CIT; Shyamlal Pragnarain v. CIT"
    },
    {
      "id": "pa2",
      "text": "Excess Profits Tax Officer order discloses no reasons why deduction unreasonable; no material/evidence for unreasonableness; proper questions are those in rule nisi.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Payments unreasonable and unnecessary under Rule 12(1); employer and employee cannot divide profits including excess profits tax which employer not allowed to retain; relied on Walchand case.",
      "supporting_facts": [
        "f3",
        "f4",
        "f10"
      ],
      "legal_basis": "Excess Profits Tax Act, Rule 12(1) First Schedule; Walchand Co. Ltd. v. Hindustan Construction Co. Ltd."
    },
    {
      "id": "ra2",
      "text": "No need to prove motive; payments excessive vs business requirements/services; other Ahmedabad mills pay no such or 3-6 months salary; percentages to salary extraordinarily high (412-884%, etc.).",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Excess Profits Tax Act, Rule 12(1)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Assessee never contended lack of evidence before; acquiesced in modified questions; evidence exists: schedules of high % to salary, comparison to other concerns, Tribunal examined employee.",
      "addresses_issue": "i1",
      "key_observation": "Payments unreasonably high having regard to business requirements; Excess Profits Tax Officer validly exercised discretion under Rule 12(1)."
    },
    {
      "id": "cr2",
      "text": "No need to interpret agreements/regulations as action referable to Rule 12(1); High Court decision correct.",
      "addresses_issue": "i2",
      "key_observation": "Discretion not precluded by contractual obligation if unreasonable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Excess Profits Tax Officer not bound to allow bonus deduction if unreasonable; can exercise discretion under Rule 12(1) even if contractual obligation exists.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Walchand Co. Ltd. v. Hindustan Construction Co. Ltd.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Excess Profits Tax Officer relied on analysis of excess profits tax by Chagla CJ to hold payments unreasonable."
    },
    {
      "case_name": "L.C. Ltd. v. G.B. Ollivant Ltd.",
      "citation": "(1945) 13 ITR Sup. 23",
      "treatment": "referred",
      "relevance": "Petitioner cited opinion of Viscount Simon LC and Lord Macmillan as aid to construction excluding excess profits tax."
    },
    {
      "case_name": "N.M. Rayaloo Iyer and Sons v. Commr. of Income-tax",
      "citation": null,
      "treatment": "referred",
      "relevance": "Cited by petitioner as similar view on construction."
    },
    {
      "case_name": "Commr. of Income-tax v. Delhi Flour Mills Co. Ltd.",
      "citation": null,
      "treatment": "referred",
      "relevance": "Cited by petitioner as similar view."
    },
    {
      "case_name": "Western Hosiery and General Mills v. Commr. of Income-tax",
      "citation": null,
      "treatment": "referred",
      "relevance": "Cited by petitioner as similar view."
    },
    {
      "case_name": "Shyamlal Pragnarain v. Commr. of Income-tax",
      "citation": null,
      "treatment": "referred",
      "relevance": "Cited by petitioner on meaning of 'reasonable' for deductions."
    }
  ],
  "statutes_cited": [
    {
      "name": "Excess Profits Tax Act, 1940",
      "sections": [
        "Rule 12(1) of the First Schedule"
      ],
      "relevance": "Empowers Excess Profits Tax Officer to disallow excessive expenses; prior authority of Commissioner required; applied to disallow bonus and provident fund contributions as unreasonable."
    },
    {
      "name": "Income-tax Act",
      "sections": [
        "Section 10",
        "Section 10A"
      ],
      "relevance": "Contrasted with Excess Profits Tax Act; no motive proof needed under Rule 12(1)."
    },
    {
      "name": "Provident Fund Rules",
      "sections": [
        "Regulation 12(b)",
        "Regulation 13"
      ],
      "relevance": "Basis for company contributions; profits before income-tax etc.; recognised by Commissioner."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave against the Bombay High Court judgment dated 27.08.1954, upholding the disallowance of excess bonus payments to five employees and provident fund contributions to 53 employees as unreasonable under Rule 12(1) of the First Schedule to the Excess Profits Tax Act, 1940.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In computing the profits of any chargeable accounting period no deduction shall be allowed in respect of expenses in excess of the amount which the Excess Profits Tax Officer considers reasonable and necessary having regard to the requirements of the business...\"",
      "speaker": "court",
      "significance": "Quotes Rule 12(1), central to upholding discretion of Excess Profits Tax Officer."
    },
    {
      "text": "\"The payments even in the lowest cases seem extraordinarily high, and cannot be justified as dictated by the requirements of the business.\"",
      "speaker": "court",
      "significance": "Key observation on evidence of unreasonableness."
    },
    {
      "text": "\"In our view, the decision of the High Court impugned here was correct.\"",
      "speaker": "court",
      "significance": "Concludes dismissal of appeal."
    }
  ],
  "_case_id": "1959_101",
  "_label": 0,
  "_text_length": 20945,
  "_extracted_at": "2026-02-10T19:37:22.901794"
}