{
  "metadata": {
    "case_name": "Messrs. Ispahani Ltd. & Ispahani Employees Union v. Others",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO J."
    ],
    "case_number": "Civil Appeals Nos. 473 & 474 of 1957",
    "date_of_judgment": "1959-05-06"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Messrs. M. M. Ispahani Ltd. carrying on business in Calcutta since December 1934.",
      "type": "background",
      "date": "1934-12",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Shortly before partition, Messrs. M. M. Ispahani Ltd. transferred registered head office from Calcutta to Chittagong in Pakistan.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Messrs. M. M. Ispahani Ltd. became Pakistani company after August 1947, continued to own properties in India and small business in Calcutta.",
      "type": "background",
      "date": "1947-08",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Messrs. Ispahani Ltd. (company) incorporated on September 15, 1947, took over goodwill, trading rights, stock-in-trade, properties and assets of Messrs. M. M. Ispahani Ltd.",
      "type": "background",
      "date": "1947-09-15",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Most shares of company held by Messrs. M. M. Ispahani Ltd.; business same nature, same premises, same telegraphic address, same workmen on same remuneration.",
      "type": "background",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Company paid puja bonus at rate of one month's wages from 1948 to 1952, even in years of loss.",
      "type": "admitted",
      "date": "1948 to 1952",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Workmen under M. M. Ispahani Ltd. always got puja bonus at one month's wages; company did not deny this in reply.",
      "type": "admitted",
      "source": "workmen | company"
    },
    {
      "id": "f8",
      "text": "No puja bonus paid in 1953, leading to dispute.",
      "type": "disputed",
      "date": "1953",
      "source": "workmen"
    },
    {
      "id": "f9",
      "text": "Dispute between company and workmen referred by Government of West Bengal to Second Industrial Tribunal on December 17, 1953.",
      "type": "procedural",
      "date": "1953-12-17",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Industrial Tribunal held: no puja bonus for 1953 as not established uniform rate for sufficiently long unbroken period; workmen entitled to count service under M. M. Ispahani Ltd. for benefits under company.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Labour Appellate Tribunal (July 27, 1955): puja bonus term of employment, entitled for 1953; no continuity of service from M. M. Ispahani Ltd., fresh employment.",
      "type": "procedural",
      "date": "1955-07-27",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "When M. M. Ispahani Ltd. transferred to Chittagong, retrenchment of employees not willing to go; company employed those whose services terminated.",
      "type": "background",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Employees agreed to termination with M. M. Ispahani Ltd., received provident fund settlement and arrears of salary; joined company after withdrawal of provident fund, no undertaking for continuity.",
      "type": "material",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Employees joined provident fund of company afresh.",
      "type": "material",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether workmen entitled to puja bonus for 1953 based on implied term of employment.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether workmen entitled to benefits for service rendered under Messrs. M. M. Ispahani Ltd. during service under company.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellate Tribunal had no jurisdiction to interfere with Industrial Tribunal's finding of fact on puja bonus.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Even if jurisdiction, Appellate Tribunal's decision incorrect in law; no implied term for puja bonus.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Service under M. M. Ispahani Ltd. counts for benefits under company due to substantial continuity.",
      "supporting_facts": [
        "f4",
        "f5",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Practice under M. M. Ispahani Ltd. immaterial, does not bind company.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Termination of employment with M. M. Ispahani Ltd.; fresh employment by company.",
      "supporting_facts": [
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Decision on implied term of employment for puja bonus is mixed question of fact and law; Appellate Tribunal had jurisdiction.",
      "addresses_issue": "i1",
      "key_observation": "Similar to custom, adverse possession, or joint family status."
    },
    {
      "id": "cr2",
      "text": "Tests for implied agreement from Mahalaxmi case: unbroken payment, sufficiently long period, not out of bounty. All satisfied here: paid 1948-1952 unbroken, even in loss years, since company's inception.",
      "addresses_issue": "i1",
      "key_observation": "Length of period depends on circumstances; here justifies inference."
    },
    {
      "id": "cr3",
      "text": "Puja bonus in Bengal based on implied agreement or custom; here implied term category.",
      "addresses_issue": "i1",
      "key_observation": "Tests from Mahalaxmi correct and followed."
    },
    {
      "id": "cr4",
      "text": "No continuity of service: employees terminated with old company, settled claims, fresh appointment by company, new provident fund.",
      "addresses_issue": "i2",
      "key_observation": "Company took over business but employment fresh."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Workmen entitled to puja bonus at one month's wages for 1953 as implied term of employment established.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No entitlement to benefits from service under M. M. Ispahani Ltd.; fresh employment.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mahalaxmi Cotton Mills Ltd., Calcutta v. Mahalaxmi Cotton Mills Workers Union",
      "citation": "1952 L.A.C. 370",
      "treatment": "followed",
      "relevance": "Laid down tests for inferring implied agreement for puja bonus: unbroken, long period, not bounty."
    },
    {
      "case_name": "The Millowners Association, Bombay v. The Rashtriya Mill Mazdoor Sangh, Bombay",
      "citation": "1950 L.L.J. 1247",
      "treatment": "referred",
      "relevance": "Full Bench formula for profit bonus; puja bonus stands on different footing."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Both appeals dismissed: company's appeal against puja bonus award fails; workmen's appeal against denial of service continuity benefits fails.",
    "relief_granted": "Workmen entitled to puja bonus for 1953 at one month's wages; no continuity benefits.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We are of opinion that the tests laid down in that case for inferring that there was an implied agreement for grant of such a bonus are correct and it is necessary that they should all be satisfied before bonus of this type can be granted.",
      "speaker": "court",
      "significance": "Affirms tests for puja bonus implied term."
    },
    {
      "text": "The decision whether there is an implied term of employment is a mixed question of fact and law and not a pure question of fact.",
      "speaker": "court",
      "significance": "Jurisdiction of Appellate Tribunal upheld."
    },
    {
      "text": "There was termination of employment of the workmen when Messrs. M. M. Ispahani migrated to Pakistan and the employment of the workmen by the company was fresh employment.",
      "speaker": "court",
      "significance": "Rejects service continuity."
    }
  ],
  "_case_id": "1959_204",
  "_label": 0,
  "_text_length": 12670,
  "_extracted_at": "2026-02-10T19:38:07.550871"
}