{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. Calcutta Stock Exchange Association Ltd.",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha, J."
    ],
    "case_number": "Civil Appeal No. 204 of 1958",
    "date_of_judgment": "1959-03-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent is a limited liability company incorporated on June 7, 1933, with a view to taking over the assets and liabilities of an unincorporated association called The Calcutta Stock Exchange Association and to carrying on the affairs of the Stock Exchange.",
      "type": "background",
      "date": "1933-06-07",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Principal object of the Respondent Company is to facilitate the transaction of business on the Calcutta Stock Exchange. The Company had to make rules and by-laws, regulating the mode and the conditions in, and subject to, which the business of the Stock Exchange had to be transacted.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Company is composed of members who may be either individuals or firms, who, except in the case of parties who had been members of the unincorporated Association have to be elected as such, and upon such elections, have to acquire a share of the Company and pay an entrance fee. The members have to pay a monthly subscription according to the by-laws of the Company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Under the by-laws of the Respondent Company, members with a certain standing, are allowed to have Authorized Assistants, upto a maximum of six in number. Such Authorized Assistants are permitted the use of the premises of the Association and to transact business therein in the names and on behalf of the members employing them.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Members have to pay an admission fee for such Authorized Assistants according to the following scale: a for the first two Assistants Rs.1,000 b for the third Assistant Rs.2,000 c for the fourth Assistant Rs.3,000 d for the fifth Assistant Rs.4,000 e for the sixth Assistant Rs.5,000 f for replacement Rs.1,000.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Before these by-laws were amended with effect from July 10, 1944, a member could have more than six such Assistants, but the number was limited to six by the new amendment.",
      "type": "background",
      "date": "1944-07-10",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Rule 5, as amended: Every candidate applying for admission as Assistant to a member must serve at least for one year as a probationer in the firm of that member. A probationer must apply to the Committee through the member in whose office he will serve as probationer in such form as may be prescribed by the Committee by paying Rs. 100/- as probationer fee which will not be refunded in any circumstances.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The rules relating to the admission of members Assistants, confer the benefit upon those members only who are qualified according to the by-laws to have such Assistants, and who have paid admission fees and pay a monthly subscription in respect of each of them, besides their own dues, to the Company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "An authorized assistant shall not enter into any contracts on his own behalf and all contracts made by him shall be made in the name of the member employing him and such member shall be absolutely responsible for the due fulfilment of all such contracts.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Tickets have to be issued to the Authorized Assistants, besides the members tickets. A member shall give to the prescribed Authority of the Company an immediate notice in writing, of the termination of the employment by him of any Authorized Assistant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "During the accounting year 1944-45 (assessment year 1945-46), the Respondent Company received from its members the sum of Rs. 60,750/- as entrance fees, and the sum of Rs. 15,687/- as subscription in respect of the Authorized Assistants.",
      "type": "material",
      "date": "1944-45",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The Company also received during the aforesaid year, a sum of Rs. 16,000/- as fees for putting the names of companies on the Quotations List. Unless a particular company's name is placed on the Quotations List, no dealings in respect of the shares of that company are permitted on the Stock Exchange.",
      "type": "material",
      "date": "1944-45",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "An application has to be made by a member to place on the Quotations List any company not already included in that List, and on approval by the prescribed Authority of the Company, the name of the company thus proposed, is included in the List upon payment of a certain fee of Rs. 1,000/-, and it is only after the necessary scrutiny and investigation into the affairs of the proposed company have been made, that the enlistment applied for is granted.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Income-tax Officer, by his order dated March 27, 1946, held the sums of Rs. 60,750/-, Rs. 15,687/- and Rs. 16,000/- to be liable to income-tax under s.10(6). Rejected contention that Authorized Assistants were themselves members.",
      "type": "procedural",
      "date": "1946-03-27",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Appellate Assistant Commissioner, by his order dated June 30, 1947, affirmed that authorized Assistants were not members or substitute members, relied on Native Share and Stock Brokers Association v. CIT.",
      "type": "procedural",
      "date": "1947-06-30",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Income-tax Appellate Tribunal, by order dated April 23, 1949, dismissed appeal, held Authorized Assistants not members, position analogous to authorised clerks in Bombay case, amounts covered by s.10(6).",
      "type": "procedural",
      "date": "1949-04-23",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Tribunal referred questions to High Court under s.66(1): Whether Authorised Assistants were not members and amounts received from them taxable; whether amounts received for specific services under s.10(6); whether Rs.16,000/- and Rs.600/- remuneration for specific services.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Calcutta High Court (Harries CJ and Banerjee J), judgment dated January 6, 1956: Concession that Assistants not members, fees received from members not Assistants, recast questions, referred back to Tribunal.",
      "type": "procedural",
      "date": "1956-01-06",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Recast questions: Whether amounts of Rs.15,687/- and Rs.60,750/- received from members as subscriptions and entrance fees in respect of Authorized Assistants, and Rs.16,000/- and Rs.600/- as fees for enlisting companies and recognition of changes in firm styles, includible in assessable income.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "Calcutta High Court (Chakravarti CJ and Sarkar J) answered in negative, held not performing specific services for remuneration under s.10(6), disagreed with Bombay HC and Travancore-Cochin HC.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "Certificate of fitness granted by High Court, appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the amounts of Rs. 60,750/- (entrance fees for Authorized Assistants), Rs. 15,687/- (subscriptions for Authorized Assistants), and Rs. 16,000/- (fees for Quotations List) received by the respondent company are chargeable to income-tax under s.10(6) of the Indian Income-tax Act, 1922, as remuneration definitely related to specific services performed for its members.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Authorized Assistants were not members; amounts received from members in respect of Assistants and for Quotations List are remuneration definitely related to specific services performed, chargeable under s.10(6). Relied on Native Share and Stock Brokers Association v. CIT.",
      "supporting_facts": [
        "f4",
        "f5",
        "f11",
        "f12",
        "f14",
        "f15",
        "f16"
      ],
      "legal_basis": "s.10(6) Indian Income-tax Act, 1922; Native Share and Stock Brokers Association v. CIT (1946) 14 ITR 628"
    },
    {
      "id": "pa2",
      "text": "Provision for authorised assistants is giving extra facilities to members; by controlling the institution, company renders specific services; amounts covered by s.10(6).",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "s.10(6)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Authorized Assistants not members (conceded). Amounts received from members, not Assistants. Not performing specific services for remuneration under s.10(6); services within mutual dealings and objects of association; words 'performing specific services for' mean actual doing of definite acts outside mutual dealings.",
      "supporting_facts": [
        "f11",
        "f18",
        "f20"
      ],
      "legal_basis": "s.10(6) Indian Income-tax Act, 1922"
    },
    {
      "id": "ra2",
      "text": "Assessee is a mutual association; no specific services outside objects; distinguished Bombay HC case.",
      "supporting_facts": [
        "f2",
        "f20"
      ],
      "legal_basis": "s.10(6)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Interprets s.10(6): 'performing specific services' means conferring particular benefits on members; remuneration definitely related to those services; services not available but for specific payments.",
      "addresses_issue": "i1",
      "key_observation": "'Services' excludes theological or artistic usage; must confer tangible benefit otherwise not available except for payment."
    },
    {
      "id": "cr2",
      "text": "Rs.60,750/- entrance fees: Paid by members to have use of Authorized Assistants; price for services in arranging for absentee member to transact via representative.",
      "addresses_issue": "i1",
      "key_observation": "Clearly chargeable only from members availing benefit; specific service."
    },
    {
      "id": "cr3",
      "text": "Rs.15,687/- subscriptions: Contributions to continue benefit of using Assistants; substantial benefit worth additional payment.",
      "addresses_issue": "i1",
      "key_observation": "Proof positive businessman found worthwhile."
    },
    {
      "id": "cr4",
      "text": "Rs.16,000/- Quotations List fees: Paid by members for enlisting companies; specific service of permitting transactions not otherwise available.",
      "addresses_issue": "i1",
      "key_observation": "Definitely related to specific services."
    },
    {
      "id": "cr5",
      "text": "Mutuality extends only to benefits accruing to every member on payment; additional payments for additional services not covered by mutuality; services need not be outside objects.",
      "addresses_issue": "i1",
      "key_observation": "No warrant for limiting to matters outside mutual dealings."
    },
    {
      "id": "cr6",
      "text": "Agrees with Bombay HC in Native Share case; facts parallel; quotes Stone CJ and Kania J on scheme for authorised clerks as specific services.",
      "addresses_issue": "i1",
      "key_observation": "Rules provide organised arrangement controlled by Association for benefit of members."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The three items of income fall within s.10(6); deemed to carry on business in respect of those services; liable to tax.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Native Share and Stock Brokers Association v. Commissioner of Income-tax",
      "citation": "1946 14 I.T.R. 628",
      "treatment": "followed",
      "relevance": "Analogous facts; fees for authorised clerks held taxable under s.10(6) as specific services."
    },
    {
      "case_name": "Commissioner of Income-tax v. Chamber of Commerce, Alleppey",
      "citation": "1955 27 I.T.R. 535",
      "treatment": "referred",
      "relevance": "Fees for produce section held taxable under s.10(6); ratio relevant though facts differ."
    },
    {
      "case_name": "The Carlisle and Silloth Golf Club v. Smith",
      "citation": "1912 6 Tax Cas. 48",
      "treatment": "referred",
      "relevance": "Club fees from non-members for green fees held business income."
    },
    {
      "case_name": "The Liverpool Corn Trade Association, Limited v. Monks",
      "citation": "1926 Tax Cas. 442",
      "treatment": "referred",
      "relevance": "Similar facts; profits from transactions with members assessable."
    },
    {
      "case_name": "Bradbury v. Arnold",
      "citation": null,
      "treatment": "referred",
      "relevance": "Trivial services still form assessable contract under Case VI Schedule D."
    },
    {
      "case_name": "Housden v. Marshall",
      "citation": null,
      "treatment": "referred",
      "relevance": "Payment for trivial services (reminiscences) held for services rendered."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s.10(6)",
        "s.66(1)"
      ],
      "relevance": "s.10(6) deems trade associations performing specific services for members for remuneration as carrying on business liable to tax; s.66(1) for reference."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, held the High Court erred; the three sums (Rs.60,750/-, Rs.15,687/-, Rs.16,000/-) are includible in assessable income under s.10(6) as remuneration for specific services performed.",
    "relief_granted": "Answers to questions in affirmative in favour of Revenue.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The words performing specific services, in our opinion, mean, in the context, conferring particular benefits on the members.\"",
      "speaker": "court",
      "significance": "Core interpretation of s.10(6)"
    },
    {
      "text": "\"The entrance fee is, thus, a price paid for the services of the Association in making suitable arrangements for an absentee member to transact business on his behalf.\"",
      "speaker": "court",
      "significance": "Reasoning for entrance fees taxable"
    },
    {
      "text": "\"In my judgment these rules lay down a definite scheme and provide an organised arrangement, controlled and supervised by the Association for the benefit of its members.\"",
      "speaker": "Stone CJ (Bombay HC)",
      "significance": "Supports holding on specific services for Assistants"
    },
    {
      "text": "\"When section 10(6) speaks of a trade, professional or other similar association performing specific services for its members for remuneration, it contemplates, I think, services in regard to matters outside the mutual dealings.\"",
      "speaker": "High Court (rejected)",
      "significance": "High Court view overruled by SC"
    }
  ],
  "_case_id": "1959_6",
  "_label": 1,
  "_text_length": 32718,
  "_extracted_at": "2026-02-10T19:36:10.206899"
}