{
  "metadata": {
    "case_name": "Appellant (Glucovita owner) v. Respondent (Gluvita applicant)",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent, a manufacturer of biscuits, made application on November 5, 1949, for registration of mark Gluvita in respect of goods in class 30, which it had not used prior to that date.",
      "type": "material",
      "date": "1949-11-05",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Registrar ordered application to be advertised before acceptance on respondent agreeing to limit registration to biscuits only.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Appellant, a corporation organised under laws of State of New Jersey, USA, registered mark Glucovita on August 31, 1942, in class 30 in respect of Dextrose d-Glucose powder mixed with vitamins, used as food or ingredient in food glucose for food; also registered same mark in class 5 for infants and invalids foods.",
      "type": "background",
      "date": "1942-08-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant opposed respondent's application under ss. 8(a) and 10(1) of Trade Marks Act, 1940; respondent filed counter-statement; both sides filed affidavits.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Deputy Registrar held biscuits not goods of same description as glucose powder mixed with vitamins; marks Glucovita and Gluvita not visually or phonetically similar; no reasonable likelihood of deception or confusion; under s.8(a), syllable 'co' distinguished marks; appellant had acquired reputation and goodwill for Glucovita in respect of glucose powder mixed with vitamins.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellant appealed to High Court at Bombay; heard by Desai, J.; not seriously pressed that goods same description; held not so; agreed reputation acquired; disagreed no deception/confusion; marks sufficiently similar to cause deception/confusion; set aside Deputy Registrar's order; registration refused under s.8(a).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Respondent appealed to Division Bench of Bombay High Court (Chagla, C.J. and Shah, J.); held no evidence of reputation among public (only among tradespeople); series of marks with prefix/suffix Gluco or Vita; no likelihood of confusion/deception; set aside Desai, J.; restored Deputy Registrar's order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellant appealed to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant's goods under Glucovita sold in small containers (1 pound, 4 ounces); spent considerable sums on advertisements in popular journals; large quantities sold.",
      "type": "admitted",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f10",
      "text": "Affidavits by respondent's witnesses (e.g., K.M. Jamal of Pawar and Co.) state customers come to buy Gluvita and Glucovita products.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Respondent's grounds of appeal assume appellant's mark had reputation among public.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Deputy Registrar found large number of marks on register with Gluco or Vita as prefix/suffix.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appellant stated biscuits in market bear marks Glucose Biscuits, Gluco biscuits, Glucoa Lactine biscuits.",
      "type": "background",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f14",
      "text": "Glucose used in manufacture of biscuits; appellant received enquiry from tradesman for Glucovita biscuits.",
      "type": "material",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f15",
      "text": "Respondent's director told appellant's manager that Gluvita adopted to indicate glucose used in biscuits.",
      "type": "material",
      "date": null,
      "source": "appellant"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether s.8(a) of Trade Marks Act, 1940 prevents registration of respondent's mark Gluvita, given appellant's prior registered mark Glucovita has acquired reputation among public, and whether marks are similar so as to likely deceive or cause confusion.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether goods (biscuits vs. glucose powder mixed with vitamins) are of same description for s.10(1).",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether reputation of prior mark must be among public or only tradespeople for s.8(a).",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Effect of series of marks with common features (Gluco/Vita) on likelihood of confusion.",
      "framed_by": "court"
    },
    {
      "id": "i5",
      "text": "Whether trade connection between glucose and biscuits leads to likelihood of confusion despite different goods.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Registration should be refused under ss.8(a) and 10(1); marks similar; goods same description or connected; reputation among Indian buying public.",
      "supporting_facts": [
        "f3",
        "f4",
        "f9",
        "f14",
        "f15"
      ],
      "legal_basis": "ss. 8(a), 10(1) Trade Marks Act, 1940"
    },
    {
      "id": "pa2",
      "text": "Glucovita well-known mark denoting only appellant's products; sold to public in small packs; advertised widely.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Trade connection: glucose used in biscuits; enquiry for Glucovita biscuits received; respondent adopted Gluvita to indicate glucose use.",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": "Black Magic case; Panda case"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Goods not same description; marks not similar; no reputation among public (only tradespeople); series of Gluco/Vita marks.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Kerly on Trademarks; Beck, Kollar case"
    },
    {
      "id": "ra2",
      "text": "No evidence public wanted appellant's specific glucose powder.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.10(1) not applicable as goods not same description, conceded by appellant.",
      "addresses_issue": "i2",
      "key_observation": "Puts s.10(1) out of the way; only s.8(a) remains."
    },
    {
      "id": "cr2",
      "text": "Appellant's mark acquired reputation among buying public: affidavits state well-known in trade/public; sales in small containers; popular ads; respondent's affidavits show customers seek both; no denial; respondent's appeal grounds assume reputation.",
      "addresses_issue": "i1",
      "key_observation": "'In the trade' may include public; overwhelming evidence of public reputation."
    },
    {
      "id": "cr3",
      "text": "Reputation attaches to trademark, not necessarily manufacturer; public associates mark with goods.",
      "addresses_issue": "i3",
      "key_observation": "Wrong to require public know manufacturer."
    },
    {
      "id": "cr4",
      "text": "Series of marks argument fails: no evidence of user of such marks; register presence doesn't prove use; dictionary words like Glucose Biscuits not proprietary marks.",
      "addresses_issue": "i4",
      "key_observation": "Applicant must prove user; per Beck, Kollar, Harrods cases."
    },
    {
      "id": "cr5",
      "text": "Marks similar: question of first impression; consider as whole; phonetically/ structurally similar to average Indian buyer of imperfect recollection; common idea of glucose + vitamins/life; 'co' syllable not distinguishing in India.",
      "addresses_issue": "i1",
      "key_observation": "Agree with Desai J.; English pronunciation not applicable."
    },
    {
      "id": "cr6",
      "text": "Trade connection between glucose and biscuits: glucose used in biscuits; average buyer may think Gluvita biscuits made with Glucovita glucose; even if liquid vs powder, buyer unaware.",
      "addresses_issue": "i5",
      "key_observation": "Independent test from mark similarity; applies despite resemblance; per Black Magic, Panda."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant's Glucovita acquired reputation among general buying public.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Series of marks with Gluco/Vita do not assist respondent absent proof of user.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Glucovita and Gluvita similar, likely to deceive/confuse average buyer.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "Trade connection between glucose powder and biscuits makes confusion likely despite different goods.",
      "resolves_issue": "i5",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h5",
      "text": "s.8(a) prevents registration of Gluvita.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "In re an application by Smith Hayden & Coy. Ld.",
      "citation": "1945 63 R.P.C. 97",
      "treatment": "applied by Deputy Registrar, disagreed by Desai J. and SC",
      "relevance": "Syllable 'co' distinguishes marks (Ovax case); SC holds not decisive."
    },
    {
      "case_name": "In re an application by Beck, Kollar & Company (England) Limited",
      "citation": "64 R.P.C. 76",
      "treatment": "followed",
      "relevance": "Series objection based on user; must prove reputation/user of series marks; no presumption in opposition."
    },
    {
      "case_name": "Harrods Ld. Application",
      "citation": "52 R.P.C. 65, 70",
      "treatment": "followed",
      "relevance": "Common element in series of extensively used marks assists applicant."
    },
    {
      "case_name": "Edward Hack (Black Magic case)",
      "citation": "58 R.P.C. 91",
      "treatment": "followed",
      "relevance": "Trade connection between different goods (chocolates/laxatives) causes confusion."
    },
    {
      "case_name": "Ladislas Jellinek (Panda case)",
      "citation": "63 R.P.C. 59",
      "treatment": "followed",
      "relevance": "Trade connection shoes/shoe polish leads to confusion."
    },
    {
      "case_name": "Harry Reynolds v. Laffeatys Ld. (Aquamatic case)",
      "citation": "1958 R.P.C. 387",
      "treatment": "followed",
      "relevance": "Common idea in marks for similarity."
    },
    {
      "case_name": "Willesden Varnish Co. Ltd. v. Young Marten Ltd.",
      "citation": "39 R.P.C. 285",
      "treatment": "referred",
      "relevance": "Register presence doesn't prove use."
    }
  ],
  "statutes_cited": [
    {
      "name": "Trade Marks Act, 1940",
      "sections": [
        "s. 8(a)",
        "s. 10(1)",
        "s. 12"
      ],
      "relevance": "s.8(a): prohibits registration if likely to deceive/confuse due to prior mark's reputation; s.10(1): same goods/description; s.12: honest concurrent use."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed appellant's appeal, set aside Division Bench order, restored Desai J.'s order refusing registration of respondent's mark Gluvita under s.8(a).",
    "relief_granted": "Registration of Gluvita refused",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the reputation with which we are concerned in the present case is the reputation of the trade mark and not that of the maker of the goods bearing that trade mark.\"",
      "speaker": "court",
      "significance": "Clarifies s.8(a) requires reputation in mark itself, not manufacturer."
    },
    {
      "text": "\"It is not permissible to draw any inference as to their user from the presence of the marks on the register.\"",
      "speaker": "court",
      "significance": "Rejects series marks argument without user evidence."
    },
    {
      "text": "\"the marks have to be considered as a whole. So considered, we are inclined to agree with Desai, J., that the marks with which this case is concerned are similar.\"",
      "speaker": "court",
      "significance": "Test for mark similarity: overall impression."
    }
  ],
  "_case_id": "1959_77",
  "_label": 1,
  "_text_length": 25171,
  "_extracted_at": "2026-02-10T19:36:49.251625"
}