{
  "metadata": {
    "case_name": "Appellant v. State",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "KAPUR J."
    ],
    "case_number": "Criminal Appeal No. 114 of 1957",
    "date_of_judgment": "1959-05-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant employed as Assistant Store Keeper in Central Tractor Organisation at Delhi, duty included taking delivery of consignments of goods received by rail.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Consignment of iron and steel weighing about 500 Mds. received from Tata Iron Steel Co., Tatanagar, under Railway Receipt No. 039967 dated August 12, 1950, at Delhi Railway Station.",
      "type": "material",
      "date": "1950-08-12",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Consignment taken delivery of by appellant on October 2, 1950, at Lahori Gate Depot; paid Rs. 2,332-4-0 demurrage on October 2 and Rs. 57-3-0 on October 3.",
      "type": "material",
      "date": "1950-10-02",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Consignment lay at Railway depot for considerable time; efforts made to reduce wharfage and demurrage, reduced by Rs. 100.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Consignment never reached Central Tractor Organisation; appellant alleged to have misappropriated it.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Appellant absent from work after October 4, 1950, on ground of illness; sent for on October 7, appeared before Director of Administration Mr. F. C. Gera.",
      "type": "material",
      "date": "1950-10-04",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "On October 7, 1950, appellant explained to Mr. F. C. Gera that he lost Railway Receipt along with another RR and blank credit notes signed by Petrol and Transport Officer, and did not know goods were cleared.",
      "type": "material",
      "date": "1950-10-07",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Appellant handed over to police on October 7, 1950; case registered at instance of Mr. F. C. Gera.",
      "type": "procedural",
      "date": "1950-10-07",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "On October 8, 1950, appellant stated to Sub-Inspector Sumer Shah Singh (not in uniform) that he gave goods to Gurbachan Singh; Gurbachan traced, handed Rs. 200 to appellant in presence of SI, Dharam Vir, and Kartar Singh; SI took possession.",
      "type": "material",
      "date": "1950-10-08",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Gurbachan Singh took party (SI, Dharam Vir, Kartar Singh) to premises of Amar Singh at Kotia Khan; iron and steel goods seized, recovery memos prepared.",
      "type": "material",
      "date": "1950-10-08",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Seven packages of the consignment later recovered from Lahori Gate Goods Depot.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Defence: Appellant took delivery on October 2 and 3, removed goods to Saloon Siding (another Railway Siding where CTO goods occasionally stacked to save wharfage/demurrage) using CTO truck driven by Sukhdev Singh and some carts; produced Sukhdev Singh and two chowkidars as witnesses.",
      "type": "admitted",
      "date": "1950-10-02",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "High Court did not accept defence evidence that goods reached Saloon Siding.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Goods removed from Lahori Gate Depot but did not reach Saloon Siding or Central Tractor Organisation.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Iron/steel seized from Amar Singh's place do not tally with consignment under RR 039967; not shown to be Tata Iron Steel Co. manufacture.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Before High Court, not disputed that appellant took delivery of whole consignment at Lahori Gate and responsible for removal of considerable portions on October 2 and 3.",
      "type": "admitted",
      "date": "1950-10-02",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Special Judge convicted appellant under s.5(1)(c) Prevention of Corruption Act, 1947; Punjab High Court confirmed conviction, reduced sentence to nine months rigorous imprisonment (judgment December 6, 1955).",
      "type": "procedural",
      "date": "1955-12-06",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the prosecution proved that the appellant dishonestly or fraudulently misappropriated the goods under s.5(1)(c) of the Prevention of Corruption Act, 1947, given that goods were received and removed by him but never reached the Central Tractor Organisation.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Goods removed to Saloon Siding to save wharfage/demurrage using CTO truck and carts; supported by witnesses Sukhdev Singh and chowkidars.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Prosecution must prove not only receipt of goods but also that accused converted them to own use and did not apply them to the purpose received; relied on Ghulam Haider v. Emperor, In re Ramakkal Others, Bolai Chandra Khara v. Bishnu Bejoy Srimani, Bhikchand v. Emperor, Pritchard v. Emperor.",
      "supporting_facts": [],
      "legal_basis": "Ghulam Haider v. Emperor; In re Ramakkal Others; Bolai Chandra Khara v. Bishnu Bejoy Srimani; Bhikchand v. Emperor; Pritchard v. Emperor"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant took delivery, removed goods which never reached CTO; gave false explanations; absent from duty; linked to Gurbachan Singh and recovery from Amar Singh.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6",
        "f7",
        "f9",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Goods received by appellant, removed from Lahori Gate, never reached CTO or Saloon Siding; false explanation to Mr. Gera that lost RR and did not take delivery; absent from duty; defence not accepted; giving false account strong circumstance against accused.",
      "addresses_issue": "i1",
      "key_observation": "Failure to account for goods received, false explanations indicate dishonest intention under s.5(1)(c); prosecution not required to prove precise manner of misappropriation."
    },
    {
      "id": "cr2",
      "text": "Prosecution proved prima facie case; onus on accused under s.106 Evidence Act to explain as facts within his knowledge; not enough to raise suspicion only.",
      "addresses_issue": "i1",
      "key_observation": "Essence of offence is dishonest/fraudulent appropriation after possession; circumstances show guilty mind."
    },
    {
      "id": "cr3",
      "text": "Cases relied by appellant confined to peculiar facts; do not support broad proposition that prosecution must prove conversion beyond receipt and failure to account.",
      "addresses_issue": "i1",
      "key_observation": "Proof of receipt, duty to account, failure to do so (with false explanation) establishes misappropriation."
    },
    {
      "id": "cr4",
      "text": "Failure to produce Gurbachan Singh or link seized goods to consignment irrelevant as prosecution not required to prove exact disposal method.",
      "addresses_issue": "i1",
      "key_observation": "Question is intention, proved by circumstances."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant guilty under s.5(1)(c) Prevention of Corruption Act, 1947; court justified in concluding dishonest misappropriation based on receipt, removal, non-delivery to CTO, false explanations.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Harakrishna Mahtab v. Emperor",
      "citation": "A.I.R. 1930 Patna 209",
      "treatment": "followed",
      "relevance": "Essential to prove dishonest intention in criminal breach of trust; failure to account or false account strong circumstance."
    },
    {
      "case_name": "Lamier v. Rex",
      "citation": "1914 A.C. 221",
      "treatment": "followed",
      "relevance": "Embezzlement requires wilful appropriation moved by guilty mind."
    },
    {
      "case_name": "Emperor v. Santa Singh",
      "citation": "A.I.R. 1944 Lah. 338",
      "treatment": "followed",
      "relevance": "Prosecution establishes prima facie case; onus on accused for facts in his knowledge under s.106 Evidence Act."
    },
    {
      "case_name": "Emperor v. Chattur Bhuj",
      "citation": null,
      "treatment": "followed",
      "relevance": "Giving false explanation element courts consider."
    },
    {
      "case_name": "Rex v. William",
      "citation": "1836 7 C. P. 338",
      "treatment": "referred",
      "relevance": "Absconding infers intent to appropriate."
    },
    {
      "case_name": "Reg v. Lynch",
      "citation": "1854 6 Cox. C.C. 445",
      "treatment": "referred",
      "relevance": "Absconding after receipt infers intent to appropriate."
    },
    {
      "case_name": "Ghulam Haider v. Emperor",
      "citation": "1935 I.L.R. 15 Patna 108",
      "treatment": "distinguished",
      "relevance": "Proof of receipt and failure to account long way but not whole proof; peculiar facts (books not produced)."
    },
    {
      "case_name": "In re Ramakkal Others",
      "citation": "A.I.R. 1938 Mad. 172",
      "treatment": "distinguished",
      "relevance": "Mere intention or preparation not offence; intermediate stage quashing."
    },
    {
      "case_name": "Bolai Chandra Khara v. Bishnu Bejoy Srimani",
      "citation": "A.I.R. 1934 Cal. 425",
      "treatment": "distinguished",
      "relevance": "Proof of one element not enough; need proof of non-payment."
    },
    {
      "case_name": "Bhikchand v. Emperor",
      "citation": "A.I.R. 1934 Sindh 22",
      "treatment": "distinguished",
      "relevance": "Presumption on proof of non-payment."
    },
    {
      "case_name": "Pritchard v. Emperor",
      "citation": "A.I.R. 1928 Lah. 382",
      "treatment": "distinguished",
      "relevance": "Prosecution failed to produce books showing non-payment."
    }
  ],
  "statutes_cited": [
    {
      "name": "Prevention of Corruption Act, 1947",
      "sections": [
        "5(1)(c)"
      ],
      "relevance": "Defines criminal misconduct by public servant dishonestly or fraudulently misappropriating property entrusted or under control."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "24",
        "25"
      ],
      "relevance": "Defines 'dishonestly' (intention of wrongful gain/loss) and 'fraudulently' (intent to defraud)."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "106"
      ],
      "relevance": "Onus on accused for facts within his knowledge after prima facie case."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld the conviction under s.5(1)(c) of Prevention of Corruption Act, 1947, confirming High Court's judgment reducing sentence to nine months rigorous imprisonment; appeal by special leave dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the essential thing to be proved in case of criminal breach of trust is whether the accused was actuated by dishonest intention or not.\"",
      "speaker": "court",
      "significance": "Explains mens rea requirement, citing Harakrishna Mahtab."
    },
    {
      "text": "\"in cases of criminal breach of trust the failure to account for the money proved to have been received by the accused or giving a false account of its use is generally considered to be a strong circumstance against the accused.\"",
      "speaker": "court",
      "significance": "Key reasoning for inferring dishonest intention from false explanations."
    },
    {
      "text": "\"It is not the law of this country that the prosecution has to eliminate all possible defences or circumstances which may exonerate him.\"",
      "speaker": "court",
      "significance": "Clarifies prosecution burden shifts under s.106 Evidence Act."
    },
    {
      "text": "\"the court would be justified in concluding that he had dishonestly misappropriated the goods of the Central Tractor Organisation.\"",
      "speaker": "court",
      "significance": "Final holding upholding conviction."
    }
  ],
  "_case_id": "1959_68",
  "_label": 0,
  "_text_length": 16550,
  "_extracted_at": "2026-02-10T19:36:55.088916"
}