{
  "metadata": {
    "case_name": "State v. Mubarak Ali",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Criminal Appeal No. 141 of 1958",
    "date_of_judgment": "1959-02-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Shri Mohinder Nath Bhalla, manager of Daisy Sewing Machine Co. Ltd., Bhopal, informed Sub-Inspector of Police, Special Police Establishment, Gwalior, between 12 and 1 p.m. on January 11, 1955, that Station Master demanded annas ten per case as illegal gratification for booking empty wooden cases, but Assistant Station Master agreed to annas eight per case and asked to bring cases between 2 and 4 p.m.",
      "type": "material",
      "date": "1955-01-11",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Police officer went to stall at Gwalior Mela, saw twenty wooden cases (twelve big, eight small) ready for booking. Shri Bhalla gave typed complaint signed and attested by two witnesses.",
      "type": "material",
      "date": "1955-01-11",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Trap laid: Numbers of rupee notes entered in memorandum attested by witnesses. Notes given to Shri Bhalla in presence of witnesses. Instructed to pay when demanded, with witnesses overhearing and seeing, and give signal after.",
      "type": "procedural",
      "date": "1955-01-11",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Plan executed: Assistant Station Master took bribe after bargaining. Shri Bhalla gave signal. Sub-Inspector disclosed identity, asked for money. Assistant Station Master produced notes from pocket, numbers tallied with memorandum.",
      "type": "material",
      "date": "1955-01-11",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Sub-Inspector searched Assistant Station Master, secured articles. Searched Shri Bhalla, recovered two currency notes not given (bargain at smaller amount), numbers tallied. Memoranda prepared and attested.",
      "type": "procedural",
      "date": "1955-01-11",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Took possession of forwarding note, R.R. copy for twenty cases to New Delhi. Inventory of cases on platform prepared and attested.",
      "type": "procedural",
      "date": "1955-01-11",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Sub-Inspector concluded offences under ss. 120-B and 161 IPC and s. 5(2) Prevention of Corruption Act by Assistant Station Master Shri Mubarak Ali and pointsman Shri Mool Chand. Sent report to Special Police Establishment Office, Madhya Bharat on same day.",
      "type": "procedural",
      "date": "1955-01-11",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Report registered on January 14, 1955.",
      "type": "procedural",
      "date": "1955-01-14",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "On January 21, 1955, Sub-Inspector filed application before Additional District Magistrate (Judicial), Gwalior, for permission to investigate under relevant sections.",
      "type": "procedural",
      "date": "1955-01-21",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Charge-sheet filed before Special Judge, Anti-Corruption, Indore on October 1, 1955.",
      "type": "procedural",
      "date": "1955-10-01",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Respondent filed objections questioning validity of Additional District Magistrate's permission to investigate.",
      "type": "procedural",
      "date": "1955",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Special Judge intended to take evidence on delegation but prosecution sought adjournment due to pending appeal in High Court. Adjournment granted on December 3, 1955.",
      "type": "procedural",
      "date": "1955-12-03",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "On August 21, 1957, Special Judge discharged Shri Mool Chand, charged Shri Mubarak Ali under s. 161 IPC, disallowed objection holding Magistrate could have satisfied himself from papers.",
      "type": "procedural",
      "date": "1957-08-21",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "High Court in Criminal Revision No. 78 of 1957 on November 28, 1957, held permission given routinely ten days after investigation started, set aside Special Judge order, directed Deputy Superintendent of Police to carry on investigation afresh.",
      "type": "procedural",
      "date": "1957-11-28",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court was justified in holding that the Magistrate gave permission as a mere matter of routine without satisfying himself as to the advisability of giving such permission to Sub-Inspector under s. 5A Prevention of Corruption Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the High Court was wrong in holding that investigation started ten days prior to obtaining Magistrate's permission.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court not justified in holding Magistrate gave permission routinely; prosecution should have opportunity to prove Magistrate considered relevant material.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "s. 5A Prevention of Corruption Act; H.N. Rishbud v. State of Delhi; Biswabhusan Naik v. State of Orissa"
    },
    {
      "id": "pa2",
      "text": "High Court wrong that investigation started ten days prior to permission; information on Jan 11 related to offence but full investigation steps post-permission.",
      "supporting_facts": [
        "f1",
        "f3",
        "f4",
        "f7",
        "f9"
      ],
      "legal_basis": "s. 4(1) CrPC definition of investigation; H.N. Rishbud v. State of Delhi"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Order of Additional District Magistrate giving permission invalid as given routinely without satisfying prima facie case or reasons.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "s. 5A Prevention of Corruption Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s. 5A mandatory safeguard for public servants; Magistrate must exercise discretion on relevant material, not routinely; no evidence prosecution placed material before Magistrate; application and order ex facie show mechanical permission.",
      "addresses_issue": "i1",
      "key_observation": "Provisions of s. 5A not strictly complied with."
    },
    {
      "id": "cr2",
      "text": "Investigation under CrPC includes proceeding to spot, ascertainment of facts, trap, recovery, etc., started on Jan 11 upon information of offence before permission on Jan 21.",
      "addresses_issue": "i2",
      "key_observation": "Sub-Inspector conducted investigation steps prior to permission."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Order under s. 5A must disclose reasons or prosecution prove Magistrate considered material; here, no compliance shown.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Investigation commenced on Jan 11 before permission on Jan 21, violating s. 5A.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "H. N. Rishbud and Inder Singh v. The State of Delhi",
      "citation": "1955 1 S.C.R. 1150",
      "treatment": "followed",
      "relevance": "s. 5A mandatory; investigation without permission illegal."
    },
    {
      "case_name": "Biswabhusan Naik v. The State of Orissa",
      "citation": "1955 1 S.C.R. 92",
      "treatment": "followed",
      "relevance": "Sanction/permission need not set out facts if proved aliunde."
    }
  ],
  "statutes_cited": [
    {
      "name": "Prevention of Corruption Act, 1947",
      "sections": [
        "s. 3",
        "s. 4",
        "s. 5(2)",
        "s. 5A",
        "s. 6"
      ],
      "relevance": "Makes offences cognizable with safeguards; prior Magistrate permission required for subordinate police investigation; mandatory compliance."
    },
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "s. 120B",
        "s. 161",
        "s. 165",
        "s. 165A"
      ],
      "relevance": "Offences of bribery and conspiracy by public servant."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "s. 4(1)",
        "Chapter XIV",
        "s. 173"
      ],
      "relevance": "Defines investigation; procedure for police investigation."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court agreed with High Court that s. 5A Prevention of Corruption Act not complied with as Magistrate's permission mechanical and investigation started prior; upheld direction for Deputy Superintendent of Police to investigate afresh.",
    "relief_granted": "None to State; investigation to proceed by DSP.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the said provision must be taken to be mandatory.\"",
      "speaker": "court",
      "significance": "On s. 5A being mandatory per Rishbud case."
    },
    {
      "text": "\"a magistrate cannot surrender his discretion to a police officer, but must exercise it having regard to the relevant material made available to him at that stage.\"",
      "speaker": "court",
      "significance": "Explains Magistrate's duty under s. 5A."
    },
    {
      "text": "\"Ex facie, it appears to us... that the Magistrate did not realise the significance of his order giving permission, but only mechanically issued the order.\"",
      "speaker": "court",
      "significance": "Finding on invalid permission."
    }
  ],
  "_case_id": "1959_121",
  "_label": 0,
  "_text_length": 20585,
  "_extracted_at": "2026-02-10T19:37:34.117662"
}