{
  "metadata": {
    "case_name": "Appellant (Partnership Concern) v. Workmen",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a partnership concern carrying on business in the manufacture of pharmaceutical products.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "There was a gratuity scheme in force in the appellant-concern for a long time, modified by an award of the industrial tribunal dated August 18, 1952 (hereinafter called the Award), and since then the modified scheme has been in force.",
      "type": "background",
      "date": "1952-08-18",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Financial condition of the appellant deteriorated and consequently, it was compelled to retrench a number of workmen.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant applied to the Labour Appellate Tribunal of India under s. 22 of the Industrial Disputes (Appellate Tribunal) Act, No. XLVIII of 1950, for permission to retrench 89 workmen.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Appellate Tribunal granted permission for retrenchment of 75 workmen only.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "After obtaining permission, the appellant retrenched the workmen and paid them compensation as provided in s. 25F of the Industrial Disputes Act, 1947 (hereinafter called the Act).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "A dispute was raised by the retrenched workmen through the union in existence in the appellant-concern for gratuity on retrenchment under the Award.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The dispute was referred to the Second Industrial Tribunal, West Bengal, on March 23, 1956, for adjudication: 'Whether the seventy-five retrenched employees (as per attached list) are entitled to gratuity in addition to retrenchment benefits?'",
      "type": "procedural",
      "date": "1956-03-23",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Industrial Tribunal concluded that the retrenched workmen were only entitled to relief as provided under s. 25F of the Act and were not entitled to any gratuity under the Award over and above the compensation payable to them under the Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeal by the workmen to the Appellate Tribunal was allowed. The Appellate Tribunal held that the workmen were entitled to gratuity under the Award, as gratuity benefit therein was not a retrenchment benefit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant applied for special leave to appeal, which was granted, and the matter came up before the Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Relevant part of the Award: 'The following gratuity scheme shall be for cases of retrenchment or termination of service by the company for any reason other than misconduct or for cases of resignation with the consent of the management. The gratuity will be paid up to a maximum of 15 months basic pay at the following rates. The period of service to qualify for the gratuity shall be one year... no gratuity would be payable before the completion of one year of service... persons discharged for misconduct would not be entitled to any gratuity... in case of death of an employee, his widow or children or other dependents would be granted gratuity on the above basis.'",
      "type": "admitted",
      "date": "1952-08-18",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the retrenched workmen are entitled under the Award to gratuity provided therein in addition to retrenchment benefit under s. 25F of the Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Gratuity under the Award on retrenchment is really nothing more nor less than compensation on account of retrenchment. A retrenched workman could claim gratuity under the Award only on account of retrenchment and could not claim it under the other two conditions therein.",
      "supporting_facts": [
        "f2",
        "f12"
      ],
      "legal_basis": "s. 2(oo), s. 25F, s. 25J of Industrial Disputes Act, 1947"
    },
    {
      "id": "pa2",
      "text": "The Award provides a composite scheme covering retrenchment as defined in s. 2(oo), termination other than misconduct, and resignation with consent, so payment on retrenchment called gratuity is retrenchment compensation, not additional to s. 25F.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "s. 2(oo), Chapter VA, s. 25F, s. 25J of Industrial Disputes Act, 1947"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The workmen were entitled to gratuity under the Award, as gratuity benefit therein was not a retrenchment benefit.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Payment of gratuity in the event of retrenchment has nothing to do with the compensation payable under s. 25F; gratuity on retrenchment is something different from compensation on retrenchment.",
      "supporting_facts": [
        "f2",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Award is a composite scheme providing for what is termed gratuity under three conditions: (i) retrenchment, (ii) termination for any reason other than misconduct, (iii) resignation with consent. Though called gratuity, payment on retrenchment is really compensation on account of retrenchment.",
      "addresses_issue": "i1",
      "key_observation": "The name given to the payment is not material; it is the nature of the payment that has to be looked into."
    },
    {
      "id": "cr2",
      "text": "The Award provides payment not only for retrenchment but also for other terminations excepted from s. 2(oo) definition. It is thus a composite scheme; merely calling it gratuity does not make it other than compensation for retrenchment.",
      "addresses_issue": "i1",
      "key_observation": "Clauses (a), (b), (c) of s. 2(oo) correspond to parts of the Award."
    },
    {
      "id": "cr3",
      "text": "Chapter VA (ss. 25F, 25J) added in 1953 provides uniform minimum retrenchment compensation. s. 25J(1) has effect notwithstanding inconsistent provisions, but proviso allows rights under awards/contracts if more advantageous; not intended to allow double payment.",
      "addresses_issue": "i1",
      "key_observation": "No intention for workman to get compensation twice, once under Act and once under scheme."
    },
    {
      "id": "cr4",
      "text": "Gratuity under Award in this case is not different in nature from s. 25F retrenchment compensation; it is payment on account of retrenchment as defined in s. 2(oo). No justification for compelling payment twice.",
      "addresses_issue": "i1",
      "key_observation": "Workmen entitled to one or the other, whichever more advantageous per s. 25J."
    },
    {
      "id": "cr5",
      "text": "s. 25F provisions are better than the Award for retrenchment; workmen entitled to s. 25F compensation only, not both.",
      "addresses_issue": "i1",
      "key_observation": "Appellant has already paid s. 25F compensation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Gratuity provided in the Award on retrenchment is nothing more nor less than retrenchment compensation under s. 25F; workmen not entitled to both.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Provisions of s. 25F prevail as they are better than the Award; workmen entitled only to compensation under s. 25F.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Indian Hume Pipe Company Limited v. Its Workmen",
      "citation": "1960 2 S.C.R. 32",
      "treatment": "followed",
      "relevance": "General question considered therein; special considerations may arise on terms of agreements or awards in particular cases."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 2(oo)",
        "s. 25F",
        "s. 25J",
        "Chapter VA"
      ],
      "relevance": "Defines retrenchment; provides uniform minimum compensation on retrenchment; prevails over inconsistent provisions but allows more advantageous rights under awards without double payment."
    },
    {
      "name": "Industrial Disputes (Appellate Tribunal) Act, 1950",
      "sections": [
        "s. 22"
      ],
      "relevance": "Permission sought for retrenchment."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; decision of Appellate Tribunal set aside; decision of Industrial Tribunal restored. Workmen not entitled to gratuity under Award in addition to s. 25F compensation already paid.",
    "relief_granted": "None further; confirmation that s. 25F payment suffices.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The name given to the payment is, however, not material and it is the nature of the payment that has to be looked into.",
      "speaker": "court",
      "significance": "Emphasizes substance over nomenclature in determining nature of payment."
    },
    {
      "text": "It was not the intention of the legislature that a workman on retrenchment should get compensation twice, i.e. once under the Act and once under the scheme in force providing for retrenchment compensation, by whatever name the payment might have been called.",
      "speaker": "court",
      "significance": "Core holding against double payment."
    },
    {
      "text": "Whether it is called gratuity or compensation, it is in substance a payment to the workman on account of retrenchment.",
      "speaker": "court",
      "significance": "Rejects distinction based on label 'gratuity'."
    }
  ],
  "_case_id": "1959_80",
  "_label": 1,
  "_text_length": 11409,
  "_extracted_at": "2026-02-10T19:36:41.562466"
}