{
  "metadata": {
    "case_name": "Appellant v. State",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "IMAM J."
    ],
    "case_number": "Criminal Appeal No. 101 of 1958",
    "date_of_judgment": "1959-05-08"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was sentenced to imprisonment for life under s. 302 by the Sessions Judge of Birbhum, agreeing with the majority verdict of the jury that he was guilty.",
      "type": "procedural",
      "date": "1955-12-08",
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "Jagdish Gorain and Sudhir Gorain were tried along with the appellant but acquitted by the jury, verdict accepted by Sessions Judge.",
      "type": "procedural",
      "date": "1955-12-08",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Appellant appealed to Calcutta High Court in Criminal Appeal No. 19 of 1956, which dismissed the appeal holding no misdirection in Sessions Judge's charge to jury.",
      "type": "procedural",
      "date": "1956-09-12",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "High Court refused certificate to appeal to Supreme Court; present appeal by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Sibapada Hati was married to Lila; about a month before occurrence, appellant proposed she live with him, rejected.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Appellant thought removing Sibapada Hati would improve chances with Lila; murdered him on May 26, 1955, assisted by Jagdish Gorain, Sudhir Gorain, and approver Sastipada Ghose.",
      "type": "material",
      "date": "1955-05-26",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Conviction depended on evidence of approver Sastipada Ghose and circumstantial evidence corroborating him in connecting appellant with murder.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Sessions Trial No. 1 of November 1955 before Sessions Judge, Birbhum.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On May 25, 1955, appellant came to Lila's house and talked with deceased.",
      "type": "material",
      "date": "1955-05-25",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "On May 26, 1955 morning, appellant came to house and talked with deceased.",
      "type": "material",
      "date": "1955-05-26",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "On May 26, 1955, little after sunset, appellant came to house, asked deceased to go for walk; deceased did so.",
      "type": "material",
      "date": "1955-05-26",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Appellant seen going with Jagdish Gorain and deceased by Brojeswari and Lila towards north of village after 5 p.m. while bathing in Talbona tank.",
      "type": "material",
      "date": "1955-05-26",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Approver's evidence: at time deceased stabbed by appellant, appellant sustained injury on dorsum of left palm.",
      "type": "material",
      "date": "1955-05-26",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Medical evidence: appellant had almost healed ulcer 1 inch on left side of palm at posterior surface 1 inch below wrist joint, and 1/3 inch on left thumb posterior surface; could be caused by sharp cutting weapon like knife.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Night of May 26, 1955, as deceased not returned, Brojeswari (Lila's mother) and uncle Radharaman Sadhu searched; went to club-house where appellant, co-accused, approver associated.",
      "type": "material",
      "date": "1955-05-26",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Enquiries from appellant by Brojeswari: first denied deceased went with him; then admitted took to canal north of village but deceased had headache, came away; no news of deceased.",
      "type": "material",
      "date": "1955-05-26",
      "source": "prosecution"
    },
    {
      "id": "f17",
      "text": "No motive for Jagdish Gorain; injury to Jagdish while catching appellant's knife saying 'what have you done?', tending to show he tried to prevent further stabbing.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was misdirection or non-direction amounting to misdirection in Sessions Judge's charge to jury regarding approver's evidence, occasioning failure of justice.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Sufficiency of charge on approver's evidence per Sarwan Singh v. State of Punjab: double test of reliability and corroboration as to crime and identity.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether circumstantial evidence sufficiently corroborates approver in connecting appellant with crime per King v. Baskerville.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether similar corroboration for acquitted Jagdish Gorain shows no real distinction from appellant's case.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sessions Judge's direction on approver's evidence insufficient; jury should have been told per Sarwan Singh that evidence must satisfy double test: approver reliable witness and sufficient corroboration; corroboration as to circumstances of crime and identity of accused.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Sarwan Singh v. State of Punjab, 1957 S.C.R. 953"
    },
    {
      "id": "pa2",
      "text": "Circumstantial evidence corroborating approver not sufficient to connect appellant with murder.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11",
        "f12",
        "f14",
        "f15",
        "f16"
      ],
      "legal_basis": "King v. Baskerville, 1916 2 K.B.D. 658"
    },
    {
      "id": "pa3",
      "text": "On similar corroboration of approver's testimony, Jagdish Gorain acquitted; no real distinction between his case and appellant's.",
      "supporting_facts": [
        "f2",
        "f17"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No misdirection in Sessions Judge's charge; examined charge, which adequately warned jury on dangers of convicting on approver's evidence without substantial corroboration as to crime and identity of accused; corroboration must be independent evidence implicating accused.",
      "addresses_issue": "i1",
      "key_observation": "Charge follows settled rule of practice with near force of law."
    },
    {
      "id": "cr2",
      "text": "Sarwan Singh distinguished: there approver wholly unreliable due to discrepancies; here, no suggestion approver's evidence unreliable when tested as any prosecution witness; Sessions Judge warned not to convict without substantial corroboration.",
      "addresses_issue": "i2",
      "key_observation": "Reliability test common to all witnesses; no unreliability shown here."
    },
    {
      "id": "cr3",
      "text": "Charge accords with Baskerville: corroboration must implicate accused by connecting to crime, can be circumstantial; here, directed jury corroboration confirms not just crime but accused committed it, sufficient if connects or identifies accused.",
      "addresses_issue": "i3",
      "key_observation": "Corroborative evidence relates to identity when it connects accused to crime."
    },
    {
      "id": "cr4",
      "text": "Circumstances provide sufficient corroboration: motive (proposal to Lila); seen taking deceased north after sunset; injuries on appellant's left palm/thumb consistent with approver (caused by knife); false denial then partial admission of whereabouts; seen with Jagdish and deceased.",
      "addresses_issue": "i3",
      "key_observation": "Medical evidence corroborates approver on injury in material particular connecting appellant."
    },
    {
      "id": "cr5",
      "text": "Cases of appellant and Jagdish not comparable: no motive for Jagdish; his injury while trying to stop appellant, tending to exculpate.",
      "addresses_issue": "i4",
      "key_observation": "Jury entitled to distinguish based on evidence."
    },
    {
      "id": "cr6",
      "text": "No defect in charge vitiating jury verdict; unless misdirection occasions failure of justice, verdict prevails.",
      "addresses_issue": "i1",
      "key_observation": "High Court correct; agree no misdirection."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No misdirection or non-direction in charge to jury on approver's evidence; substantial corroboration required and provided; jury verdict must prevail.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Sarwan Singh v. State of Punjab distinguished; charge adequate without explicit 'double test' phrasing where no unreliability shown.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Circumstantial evidence sufficiently corroborates approver by connecting appellant to crime per Baskerville principles.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sarwan Singh v. State of Punjab",
      "citation": "1957 S.C.R. 953",
      "treatment": "distinguished",
      "relevance": "Double test for approver evidence; distinguished as approver there wholly unreliable, unlike here."
    },
    {
      "case_name": "The King v. Baskerville",
      "citation": "1916 2 K.B.D. 658",
      "treatment": "followed",
      "relevance": "Corroboration must be independent testimony implicating accused by connecting to crime; can be circumstantial."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302"
      ],
      "relevance": "Appellant sentenced to life imprisonment for murder."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by special leave, upholding the Calcutta High Court's dismissal of the appeal against conviction; agreed no misdirection in Sessions Judge's charge to jury; jury's majority verdict finding appellant guilty of murder under s.302, corroborated by approver and circumstances, prevails.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is highly dangerous to convict on approvers evidence alone... unless it is materially corroborated.\"",
      "speaker": "court",
      "significance": "Sessions Judge's charge warning jury on approver evidence, upheld by SC."
    },
    {
      "text": "\"Corroboration must be as to the crime and the identity of each one of the accused... independent testimony which affects the accused by connecting or tending to connect the accused with the crime.\"",
      "speaker": "court",
      "significance": "Defines required corroboration, aligning with Baskerville."
    },
    {
      "text": "\"The appreciation of an approvers evidence has to satisfy a double test. It must show that he is a reliable witness and that his evidence receives sufficient corroboration.\"",
      "speaker": "court",
      "significance": "Quote from Sarwan Singh, but distinguished as not requiring explicit phrasing here."
    }
  ],
  "_case_id": "1959_23",
  "_label": 0,
  "_text_length": 20737,
  "_extracted_at": "2026-02-10T19:36:03.880616"
}