{
  "metadata": {
    "case_name": "Manager, Hotel Imperial, New Delhi v. Chief Commissioner, Delhi & Ors.",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo J."
    ],
    "case_number": "Civil Appeal No. 291 of 1956",
    "date_of_judgment": "1959-05-13"
  },
  "facts": [
    {
      "id": "f1",
      "text": "A dispute arose between the hotel and its workmen in October 1955.",
      "type": "material",
      "date": "1955-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The hotel decided to dismiss a large number of workmen on October 7, 1955.",
      "type": "material",
      "date": "1955-10-07",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The dispute was referred to the Additional Industrial Tribunal, Delhi on October 12, 1955 by the Chief Commissioner of Delhi under s.12(4) of the Industrial Disputes Act, 1947.",
      "type": "procedural",
      "date": "1955-10-12",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The hotel has 480 workers of thirty different categories.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "The order of reference states: 'an industrial dispute exists between the management of the Hotel Imperial, New Delhi and its workmen as represented by the Hotel Workers Union, Katra Shahanshahi, Chandni Chowk, Delhi'.",
      "type": "procedural",
      "date": "1955-10-12",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The hotel filed a writ application in the Punjab High Court challenging the order of reference, which was dismissed on November 25, 1955.",
      "type": "procedural",
      "date": "1955-11-25",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Certificate granted by Punjab High Court under Art. 133(1)(a) and (c) of the Constitution; leave to appeal to Supreme Court granted on January 13, 1956.",
      "type": "procedural",
      "date": "1956-01-13",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The hotel obtained stay of proceedings before the Additional Industrial Tribunal from the Supreme Court on February 27, 1956.",
      "type": "procedural",
      "date": "1956-02-27",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the reference is incompetent because the union could not be made a party to the reference under the Industrial Disputes Act, 1947.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the reference is vague as it does not indicate how many of the 480 workers of thirty different categories were involved in the dispute.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The union could not be made a party to the reference under the Industrial Disputes Act, 1947.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Industrial Disputes Act, 1947"
    },
    {
      "id": "pa2",
      "text": "The reference was vague, as it does not indicate how many of the 480 workers of thirty different categories working in the hotel were involved in the dispute.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "An industrial dispute exists under s.2(k) as any dispute between employers and workmen connected with employment, non-employment, terms of employment or conditions of labour. The Chief Commissioner had power under s.10(1) to refer the dispute.",
      "addresses_issue": "i1",
      "key_observation": "There was a dispute between the hotel and its workmen regarding terms of employment or conditions of labour, including dismissal of large number of workmen."
    },
    {
      "id": "cr2",
      "text": "The words 'as represented by the Hotel Workers Union' in the reference are a mere technicality for convenience of notice; it does not make the reference incompetent. Workmen can be represented under s.36 by officers of unions.",
      "addresses_issue": "i1",
      "key_observation": "Union cannot be a party but mention is for notice; service on union officer represents workmen."
    },
    {
      "id": "cr3",
      "text": "For general disputes relating to terms of employment or conditions of labour of a body of workmen, it is unnecessary to specify numbers or names under s.10.",
      "addresses_issue": "i2",
      "key_observation": "Parties clearly indicated as management and workmen; vagueness attack fails, especially compared to State of Madras v. C.P. Sarathy."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The reference is competent; addition of union for representation does not invalidate it.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The reference is not vague; no need to specify number of workmen involved in general disputes.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Madras v. C. P. Sarathy",
      "citation": "1953 SCR 334",
      "treatment": "followed",
      "relevance": "Reference not invalid for vagueness or lack of specific disputes/parties; government need not specify particulars beyond knowing it is an industrial dispute."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 2(k)",
        "s. 10(1)",
        "s. 12(4)",
        "s. 36"
      ],
      "relevance": "Defines industrial dispute; empowers reference by government; provides for representation of workmen."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 133(1)(a) and (c)"
      ],
      "relevance": "Basis for certificate granting leave to appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal challenging the competence of the industrial reference is dismissed. The reference under s.10(1) of the Industrial Disputes Act is valid despite mentioning the union for representation and not specifying number of workmen involved.",
    "relief_granted": null,
    "costs": "Costs to respondent No. 3."
  },
  "key_quotes": [
    {
      "text": "\"We are of opinion that this objection is a mere technicality, which does not affect the competence of the order of reference.\"",
      "speaker": "court",
      "significance": "Rejects argument that naming union invalidates reference."
    },
    {
      "text": "\"It is in our opinion unnecessary for the purposes of s.10 where the dispute is of a general nature relating to the terms of employment or conditions of labour of a body of workmen, to mention the names of particular workmen.\"",
      "speaker": "court",
      "significance": "Explains why vagueness claim fails."
    }
  ],
  "_case_id": "1959_131",
  "_label": 0,
  "_text_length": 10514,
  "_extracted_at": "2026-02-10T19:37:13.324420"
}