{
  "metadata": {
    "case_name": "Income Tax Officer, C Ward, Hyderabad v. Vazir Sultan Sons",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "Bhagwati J.",
      "Sinha J.",
      "Kapur J."
    ],
    "case_number": "Civil Appeal No. 340 of 1957",
    "date_of_judgment": "1959-03-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a registered firm consisting of five brothers and the wife of a deceased brother having equal shares in the profit and loss of the partnership.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The firm was appointed the sole selling agents and sole distributors for the Hyderabad State for the cigarettes manufactured by M/s. Vazir Sultan Tobacco Co., Ltd., under the terms of a resolution of the Board of Directors dated January 6, 1931.",
      "type": "material",
      "date": "1931-01-06",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Mr. Baker reported that an arrangement had been come to for the time being whereby the firm of Vazir Sultan Sons were given the distributorship of Charminar Cigarettes within the H. E. H. the Nizams Dominions and that they were allowed a discount of 2% on the gross selling price. No written agreement was entered into between the Company and the assessee nor was there any correspondence exchanged between them in this behalf.",
      "type": "material",
      "date": "1931",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1939 another arrangement was arrived at between the assessee and the company whereby the assessee was given a discount of 2% not only on the goods sold in the Hyderabad State but on all the goods sold in the Hyderabad State and outside Hyderabad State.",
      "type": "material",
      "date": "1939",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "It does not appear that the Board of Directors passed any resolution in support of this new arrangement nor was any agreement drawn up between the parties incorporating the said new arrangement.",
      "type": "procedural",
      "date": "1939",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On June 16, 1950, the Board of Directors passed the following resolution reverting to the old arrangement embodied in the resolution dated January 6, 1931: The Chairman, having referred to resolution No. 24 passed at the board meeting held on 6-1-31 and having reported that Vazir Sultan Sons had agreed to revert to the arrangement outlined in that resolution with effect from 1-6-50, it was resolved that payment of the sum of O. S. Rs. 2,26,263 be made to Vazir Sultan Sons by way of compensation, Vazir Sultan Sons, to pay D. B. Akki Co., out of that amount the sum of O. S. Rs. 6,920 also by way of compensation.",
      "type": "material",
      "date": "1950-06-16",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Mr. Mohd. Sultan and Mr. Hameed Sultan stated that, as partners in the firm of Vazir Sultan Sons, they did not take part in this resolution, although they had accepted on behalf of Vazir Sultan Sons, the terms thereof.",
      "type": "procedural",
      "date": "1950-06-16",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The sum of Rs. 2,19,343 was accordingly received by the assessee in the year of account 1359 F relevant for the assessment year 1951-52.",
      "type": "material",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Income-tax Officer included this sum in the assessee's total income and taxed it as a revenue receipt.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "On appeal the Appellate Assistant Commissioner held that the sum of Rs. 2,19,343 was not a revenue receipt but a capital receipt being compensation for the loss of the agency and as such not liable to tax.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The Income-tax Officer C Ward Hyderabad thereupon preferred an appeal to the Income-tax Appellate Tribunal, Bombay, which held that the said sum received by the assessee was a revenue receipt and liable to tax.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The assessee then applied to the Appellate Tribunal for a reference to the High Court under sec. 66(1) of the Income-tax Act and the Tribunal accordingly referred the following question of law to the High Court: Whether the sum of O. S. Rs. 2,19,343 received by the assessee Firm from Vazir Sultan Tobacco Co., Ltd., is a revenue receipt or a capital receipt?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The High Court answered the question in favour of the assessee stating the question in a different form, viz., Whether the sum of O. S. Rs. 2,19,343 received by the assessee firm from Vazir Sultan Tobacco Co., Ltd., is liable to be taxed under the Indian Income-tax Act?",
      "type": "procedural",
      "date": "1954-11-29",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The appellant thereafter applied to the High Court for a certificate of fitness which was granted by the High Court on February 21, 1955.",
      "type": "procedural",
      "date": "1955-02-21",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "During the accounting year the amount of income, profits and gains of the assessees from the cigarette distribution business and from another source, i.e., Acid Factory within the State of Hyderabad was Rs. 4,53,159.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The order of the Income-tax Officer or the Appellate Tribunal does not show how much of this sum was attributable to the Cigarette distribution business and how much to the other source. There is no finding as to how and to what extent, if any, the business of the assessees was affected by the cesser of distribution business outside that State.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sum of Rs. 2,19,343 received by the assessee in the year of account relevant for the assessment year 1951-52 was a revenue receipt or a capital receipt.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The sole selling agency which was granted by the Company to the assessee in the year 1931 was merely expanded as regards territory in 1939 and what was done in 1950 was to revert to the old arrangement, and the structure or the profit-making apparatus of the assessee's business was not affected thereby.",
      "supporting_facts": [
        "f2",
        "f4",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The expansion as well as the restriction of the assessee's territory were in the ordinary course of the assessee's business and were mere accidents of the business which the assessee carried on and the sum of Rs. 2,19,343 received by the assessee as and by way of compensation for the restriction of the territory was a trading or an income receipt and was therefore liable to tax.",
      "supporting_facts": [
        "f4",
        "f6",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Periodicity or recurring nature of the receipt was not a necessary ingredient of income nor was the existence of a material external source capable of producing a recurrent return necessary before a receipt could be treated as income chargeable to tax.",
      "supporting_facts": [],
      "legal_basis": "Raja Bahadur Kamakshya Narain Singh v. C.I.T., Raghuvanshi Mills Ltd. v. Commissioner of Income-tax"
    },
    {
      "id": "pa4",
      "text": "The agency in question was terminable at will, and any compensation paid for it would prima facie be revenue.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "The amount of profit which the assessee made from working the agency contract in Hyderabad State alone was much more than the amount which the assessee received for the termination of the whole of their agency outside the State. Thus the termination did not affect the trading activities of the assessees.",
      "supporting_facts": [
        "f15",
        "f16"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "It did not carry on business of acquiring and working agencies, that the agency acquired in 1931 was a capital asset of the assessee's business of distributing Charminar cigarettes in the Hyderabad State, that the expansion of territory outside the Hyderabad State in 1939 was an accretion to the capital asset already acquired by the assessee.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The resolution of 1950 was in substance a termination or cancellation of the agency qua territory outside the Hyderabad State and resulted in the sterilisation of the capital asset qua that territory, that the sum of Rs. 2,19,343 received by the assessee in the year of account was by way of compensation for the termination or cancellation of the agency outside Hyderabad State and being therefore compensation for the sterilisation pro tanto of a capital asset of the assessee's business was a capital receipt and was therefore not liable to tax.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The question whether a particular receipt is a revenue receipt or a capital receipt is to be determined irrespective of the stand taken by Revenue or assessee; no infallible test, decided cases indicate considerations.",
      "addresses_issue": "i1",
      "key_observation": "Character of payment varies with circumstances; agency as capital asset if fixed capital forming profit-making apparatus, revenue if trading asset."
    },
    {
      "id": "cr2",
      "text": "Agency agreements formed a capital asset of the assessee's business worked or exploited by entering into contracts for sale; part of fixed capital, not circulating capital or stock-in-trade.",
      "addresses_issue": "i1",
      "key_observation": "Compensation for terminating such agency is capital receipt; sterilisation pro tanto of capital asset."
    },
    {
      "id": "cr3",
      "text": "Facts similar to Shaw Wallace; payments as solatium for compulsory cessation of agency which was capital asset.",
      "addresses_issue": "i1",
      "key_observation": "Agency not entered in ordinary course of business of acquiring agencies."
    },
    {
      "id": "cr4",
      "text": "Dissent by Kapur J.: Termination merely contraction of area from 1939 expansion back to 1931; compensation surrogatum for lost commission, revenue receipt as agency terminable at will and did not destroy profit-making structure.",
      "addresses_issue": "i1",
      "key_observation": "Business continued in Hyderabad with higher profits; loss of part agency absorbed by structure."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The sum of Rs. 2,19,343 received by the assessee was a capital receipt, being compensation for termination of agency outside Hyderabad State, a capital asset.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Van Den Berghs, Limited v. Clark",
      "citation": "1935 19 Tax Cas. 390",
      "treatment": "followed",
      "relevance": "Distinction between capital and revenue; agreements forming fixed framework of profit-making apparatus lead to capital receipt on termination."
    },
    {
      "case_name": "Commissioner of Income-tax v. Shaw Wallace Co.",
      "citation": "1932 L.R. 59 I.A. 206",
      "treatment": "followed",
      "relevance": "Compensation for termination of agency (capital asset) is capital receipt, not taxable as income from business."
    },
    {
      "case_name": "Commissioner of Income-tax and Excess Profits Tax, Madras v. The South India Pictures Ltd., Karaikudi",
      "citation": "1956 S.C.R. 223",
      "treatment": "distinguished",
      "relevance": "Cancellation of distribution agreements in ordinary course of business yields revenue receipt; unlike here where agency is fixed capital."
    },
    {
      "case_name": "Commissioner of Income-tax, Nagpur v. Rai Bahadur Jairam Valji",
      "citation": "1959 Supp. 1 S.C.R. 110; 35 I.T.R. 148",
      "treatment": "followed",
      "relevance": "Agency may be capital asset unlike trading contract; but depends on nature."
    },
    {
      "case_name": "Raja Bahadur Kamakshya Narain Singh v. C.I.T., Bihar and Orissa",
      "citation": "1943 L.R. 70 I.A. 180",
      "treatment": "referred",
      "relevance": "Income not necessarily periodical; multiplicity of forms."
    },
    {
      "case_name": "Raghuvanshi Mills Ltd. v. Commissioner of Income-tax, Bombay City",
      "citation": "1953 S.C.R. 177",
      "treatment": "referred",
      "relevance": "Shaw Wallace definition of income confined to facts; periodicity not essential."
    },
    {
      "case_name": "Barr Crombie & Co. Ltd. v. Commissioners of Inland Revenue",
      "citation": "1945 26 Tax Cas. 406",
      "treatment": "followed",
      "relevance": "Compensation for loss of sole agency (whole business) is capital."
    },
    {
      "case_name": "Kelsall Parsons Co. v. Commissioners of Inland Revenue",
      "citation": "1938 21 Tax Cas. 608",
      "treatment": "distinguished",
      "relevance": "Compensation for one of several agencies is revenue."
    },
    {
      "case_name": "Glenboig Union Fireclay Co., Ltd. v. The Commissioners of Inland Revenue",
      "citation": "1922 12 Tax Cas. 427",
      "treatment": "followed",
      "relevance": "Compensation for sterilisation of capital asset (part or whole) is capital."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "Section 66(1)",
        "Section 10(1)",
        "Section 2(4)",
        "Section 4(3)(vii)"
      ],
      "relevance": "Reference to High Court; charge on business profits; exemption claimed as capital receipt not income."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by the Revenue is dismissed; the sum of Rs. 2,19,343 is held to be a capital receipt not liable to tax. Majority (Bhagwati and Sinha JJ.) uphold High Court; Kapur J. dissents holding it revenue.",
    "relief_granted": "Assessee not liable to tax on the sum as capital receipt.",
    "costs": "Dismissed with costs throughout."
  },
  "key_quotes": [
    {
      "text": "\"the sum of Rs. 2,19,343 received by the assessee from the Company was a capital receipt.\"",
      "speaker": "court",
      "significance": "Core holding of majority judgment."
    },
    {
      "text": "\"This asset really formed part of the fixed capital of the assessee's business. It did not constitute the business of the assessee but was the means by which the assessee entered into the business transactions.\"",
      "speaker": "court",
      "significance": "Explains why agency is capital asset."
    },
    {
      "text": "\"The compensation therefore was in the nature of surrogatum and in this view of the matter it is revenue and not capital.\"",
      "speaker": "court",
      "significance": "Dissenting view crux by Kapur J."
    },
    {
      "text": "\"Income was thus likened pictorially to the fruit of a tree or the crop of a field.\"",
      "speaker": "court",
      "significance": "Critiqued concept of income from Shaw Wallace."
    }
  ],
  "_case_id": "1959_4",
  "_label": 0,
  "_text_length": 60661,
  "_extracted_at": "2026-02-10T19:36:16.509338"
}