{
  "metadata": {
    "case_name": "Andheri Marol Kurla Bus Service & Anr. v. State",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Criminal Appeal No. 46 of 1957",
    "date_of_judgment": "1959-04-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Some disputes arose between the appellant No. 1 (Andheri Marol Kurla Bus Service) and its workmen.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On December 13, 1951, the Conciliation Officer wrote to the appellant No. 1 and enclosed the demands of the Union which were dated August 9, 1951.",
      "type": "procedural",
      "date": "1951-12-13",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On December 31, 1951, the appellant No. 1 was asked to appear before the Conciliation Officer on January 9, 1952.",
      "type": "procedural",
      "date": "1951-12-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After getting one adjournment, the appellant No. 1 appeared before the Conciliation Officer on January 17, 1952, and filed its Written Statement and raised various objections.",
      "type": "procedural",
      "date": "1952-01-17",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The next date of hearing was January 31, 1952, and the proceedings went on till June 2, 1952.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On June 2, 1952, the appellant No. 1 wrote to the Conciliation Officer saying that no useful purpose would be served by holding any further meetings.",
      "type": "procedural",
      "date": "1952-06-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On May 9, 1952, the Union had also indicated to the Conciliation Officer that the negotiations had failed.",
      "type": "procedural",
      "date": "1952-05-09",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On March 18, 1952, the appellant dismissed Louis Pereira, a bus conductor.",
      "type": "material",
      "date": "1952-03-18",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Proceedings were taken on a complaint by Assistant Commissioner of Labour under s. 33 read with s. 31 of the Act against 5 accused persons including the two appellants and the partners of appellant No. 1.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Chief Presidency Magistrate, Bombay, in Case No. 176/S of 1953, judgment dated June 19, 1954, acquitted all the accused including the appellants holding that as the conciliation proceedings had continued for a period of more than 14 days as from January 17, 1952, further proceedings for conciliation were illegal and therefore the accused persons could not be convicted under s. 31(1) of the Act.",
      "type": "procedural",
      "date": "1954-06-19",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The State took an appeal to the Bombay High Court in Criminal Appeal No. 1256 of 1954.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Bombay High Court, judgment and order dated February 4, 1955, reversed the judgment of acquittal, convicted accused Nos. 1 and 5 (appellants), sentenced accused No. 1 to a fine of Rs. 250 and accused No. 5 to a fine of Rs. 50, and acquitted the others.",
      "type": "procedural",
      "date": "1955-02-04",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appeal by special leave to Supreme Court: Criminal Appeal No. 46 of 1957.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the conciliation proceedings could be said to be pending when Louis Pereira was dismissed on March 18, 1952.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The object of conciliation is to get a settlement made with expedition and therefore under s. 12 the Conciliation Officer was bound to make his report within 14 days of the commencement of the conciliation proceedings or within such shorter period fixed by the appropriate Government. As 14 days had expired before March 18, 1952, the dismissal could not be said to be one within the words 'pendency of conciliation proceedings'.",
      "supporting_facts": [
        "f4",
        "f8"
      ],
      "legal_basis": "Section 12 of the Industrial Disputes Act, 1947"
    },
    {
      "id": "pa2",
      "text": "The conciliation proceedings should be held to terminate when the Conciliation Officer is required under s. 12(6) of the Act to submit his report.",
      "supporting_facts": [],
      "legal_basis": "Section 12(6) of the Industrial Disputes Act, 1947"
    },
    {
      "id": "pa3",
      "text": "On this interpretation the conciliation proceedings could be prolonged much beyond what was contemplated by the Act and the termination would depend upon how soon a report is received by the appropriate Government.",
      "supporting_facts": [],
      "legal_basis": "Industrial Disputes Act, 1947"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 33(1) prohibits alteration or dismissal during pendency of conciliation proceedings. The question reduces to the meaning of 'pendency of any conciliation proceedings before a conciliation officer'.",
      "addresses_issue": "i1",
      "key_observation": "Section 31(1) makes contravention of s.33 an offence."
    },
    {
      "id": "cr2",
      "text": "The Act provides for commencement and conclusion of conciliation proceedings under s.20. Sub-s.2 provides that conciliation proceedings shall be deemed to have concluded where no settlement is arrived at, when the report of the conciliation officer is received by the appropriate Government.",
      "addresses_issue": "i1",
      "key_observation": "The conciliation proceedings therefore do not end when the report under s.12(6) is made by the Conciliation Officer but when that report is received by the appropriate Government."
    },
    {
      "id": "cr3",
      "text": "s.12 contemplates submission within 14 days but that does not affect pendency; proceedings do not automatically come to an end after 14 days but only terminate as provided in s.20(2)(b).",
      "addresses_issue": "i1",
      "key_observation": "If the Conciliation Officer delays, it may be reprehensible but does not affect the interpretation."
    },
    {
      "id": "cr4",
      "text": "As the conciliation proceedings were pending at the time when Louis Pereira was dismissed, the appellants were rightly convicted under s.31(1) read with s.33 of the Act.",
      "addresses_issue": "i1",
      "key_observation": "Affirmative answer to issue i1."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Conciliation proceedings are pending until the report of the Conciliation Officer is received by the appropriate Government as per s.20(2)(b), not merely upon submission under s.12(6).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Workers of the Industry Colliery, Dhanbad v. Management of the Industry Colliery",
      "citation": "1953 S.C.R. 428",
      "treatment": "followed",
      "relevance": "Interpreted s.20(2)(b) that termination occurs when report is received by Government."
    },
    {
      "case_name": "Colliery Mazdoor Congress, Asansol v. New Beerbhoom Coal Co. Ltd.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Proceedings do not automatically come to an end after 14 days but terminate as per s.20(2)(b)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "31(1)",
        "33(1)",
        "12",
        "12(6)",
        "20",
        "20(2)",
        "20(2)(b)",
        "17",
        "10"
      ],
      "relevance": "Defines offences for contravention of s.33 during pendency of conciliation; duties and timelines of Conciliation Officer; commencement and conclusion of proceedings."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave, upholding the Bombay High Court's conviction of the appellants under s.31(1) read with s.33 of the Industrial Disputes Act, 1947, for dismissing Louis Pereira during pendency of conciliation proceedings.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The conciliation proceedings therefore do not end when the report under s.12(6) is made by the Conciliation Officer but when that report is received by the appropriate Government.",
      "speaker": "court",
      "significance": "Core interpretation of 'pendency' under s.20(2)(b)"
    },
    {
      "text": "in law the proceedings do not automatically come to an end after 14 days but only terminate as provided in s.20(2)(b) of the Act.",
      "speaker": "court",
      "significance": "Rejects argument that 14-day limit ends pendency automatically"
    }
  ],
  "_case_id": "1959_59",
  "_label": 0,
  "_text_length": 8291,
  "_extracted_at": "2026-02-10T19:36:42.843399"
}