{
  "metadata": {
    "case_name": "Dr. B. K. Pal Chaudhury v. State of Assam",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a medical doctor and was Civil Surgeon of Dibrugarh at the material time.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant was a witness in criminal case G. P. Case No. 654/54 (Lakhimpur Case No. 72 of 1955 - The State v. Mahendra Nath Barua and Others), where three persons charged inter alia under s. 376 IPC with rape.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Trial with aid of jury resulted in verdict of acquittal on rape charge.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appeal to High Court of Assam against acquittal allowed; two accused convicted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Offence alleged on minor girl Roheswari Chetia in afternoon of March 19, 1954.",
      "type": "material",
      "date": "1954-03-19",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Girl examined by Dr. Dhanbir Pait (doctor in charge of Moran Dispensary) at 6 p.m. on March 19, 1954.",
      "type": "material",
      "date": "1954-03-19",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Police produced girl for medical examination at Dibrugarh on March 20, 1954; examined by Dr. Mahibulla, assistant to appellant.",
      "type": "material",
      "date": "1954-03-20",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Police produced girl before appellant for further medical examination on March 21, 1954; examined by appellant.",
      "type": "material",
      "date": "1954-03-21",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Dr. Pait (prosecution witness): girl raped; two circular teeth marks on cheeks, reddish circular mark on left breast, hymen ruptured same day he examined.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Dr. Mahibulla (defence witness): hymen ruptured nine or ten days before incident, not recent.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant (defence witness): marks on cheeks appeared to be insect bites, hymen not ruptured, no evidence of rape.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f12",
      "text": "Direct contradiction between prosecution doctor and defence doctors on hymen rupture.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "High Court allowed appeal against acquittal relying on prosecution doctor's evidence and other evidence.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appeal heard by Sarjoo Prosad, C.J. and Deka, J.; after convicting accused on 31-7-1958, passed order issuing notice to appellant (D.W.2, Dr. B. K. Pal Chaudhury) to show cause why prosecuted under s.193 IPC for false evidence.",
      "type": "procedural",
      "date": "1958-07-31",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Notice issued and served on appellant; appellant showed cause.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Matter heard by Deka and Mehrotra JJ.; concluded fit case for complaint under s.193 IPC; directed Registrar to lodge complaint in Court of Deputy Commissioner, Lakhimpur.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Present appeal filed against order directing complaint.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court complied with the requirements of s.479A CrPC (particularly sub-ss.1 and 5) before directing a complaint for offence under s.193 IPC for giving false evidence.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Terms of s.479A not complied with: no finding recorded that appellant intentionally gave false evidence or that it was expedient for eradication of perjury and interests of justice to prosecute; no proper opportunity of being heard.",
      "supporting_facts": [
        "f14",
        "f16",
        "f17"
      ],
      "legal_basis": "s.479A(1) and (5) CrPC"
    },
    {
      "id": "pa2",
      "text": "High Court preferred other doctors' testimony, but cannot necessarily conclude appellant's evidence false or intentionally false; open to court to come to different conclusion.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Procedure under s.479A substantially followed; reasons for perjury not elaborated to avoid prejudice to appellant at trial.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "s.479A CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Ss.476-479 CrPC inapplicable due to s.479A(6); case governed by s.479A(5) as complaint by Appellate Court.",
      "addresses_issue": "i1",
      "key_observation": "Must record finding of intentional false evidence and expediency for prosecution, and give opportunity of hearing."
    },
    {
      "id": "cr2",
      "text": "No finding recorded by High Court (neither in main appeal judgment nor notice order) that appellant intentionally gave false evidence or expedient to prosecute.",
      "addresses_issue": "i1",
      "key_observation": "Order directing notice does not record required finding."
    },
    {
      "id": "cr3",
      "text": "No proper hearing given: Deka J said procedure substantially followed but reasons not elaborated to avoid prejudice; Mehrotra J erroneously considered bound by previous bench's 'finding' (which did not exist) and said not open to upset it or consider merits.",
      "addresses_issue": "i1",
      "key_observation": "Hearing required under s.479A(5) allows court to decide not to complain after hearing; Mehrotra J did not give real hearing."
    },
    {
      "id": "cr4",
      "text": "Finding under s.479A(1) is prima facie only, no prejudice at trial; cannot breach section to avoid fancied prejudice.",
      "addresses_issue": "i1",
      "key_observation": "Even if Deka J correct, Mehrotra J wrong view means decision unreliable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court order directing complaint made in breach of express provisions of s.479A(1) and (5) CrPC; cannot stand.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 376",
        "s. 193"
      ],
      "relevance": "s.376 for rape charge in underlying case; s.193 for perjury prosecution"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "ss. 476 to 479A",
        "s. 479A(1)",
        "s. 479A(5)",
        "s. 479A(6)"
      ],
      "relevance": "Procedure for complaints on false evidence; mandatory requirements for finding, reasons, hearing before complaint"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order directing complaint under s.193 IPC set aside for non-compliance with s.479A CrPC. Supreme Court declined to make complaint itself or remand, leaving further action to High Court.",
    "relief_granted": "Order quashed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"No finding recorded by it that the appellant had intentionally given any false evidence or that it was expedient to proceed against him for the eradication of the evils of perjury and in the interest of justice.\"",
      "speaker": "court",
      "significance": "Core reason for holding non-compliance with s.479A"
    },
    {
      "text": "\"It is not open to this Bench to upset this finding. To my mind it is not open to the other Bench to record a finding different from the Bench hearing the appeal on the question of the witness intentionally giving a false evidence.\"",
      "speaker": "Mehrotra J.",
      "significance": "Shows erroneous view that court bound by non-existent prior finding, denying proper hearing"
    },
    {
      "id": "kq3",
      "text": "\"The finding required to be made by s.479A(1) is only of a prima facie nature it cannot be a finding which would have any force at the trial upon the complaint.\"",
      "speaker": "court",
      "significance": "Clarifies nature of required finding and rejects prejudice argument"
    }
  ],
  "_case_id": "1959_137",
  "_label": 1,
  "_text_length": 13168,
  "_extracted_at": "2026-02-10T19:37:26.587080"
}