{
  "metadata": {
    "case_name": "Abdul Rehman Mohamed Yusuf v. Mohomed Haji Ahmed Agbotwala",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "IMAM J."
    ],
    "case_number": "Criminal Appeal No. 174 of 1956",
    "date_of_judgment": "1959-09-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "A complaint was filed by the appellant on the 4th of December, 1953, against the respondent Agbotwala and one Phirozbai Mazarkhan under ss. 385, 389 and 500/34 and 109 of the Indian Penal Code in the Presidency Magistrates 15th Court, Mazagaon, Bombay.",
      "type": "procedural",
      "date": "1953-12-04",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "The accused were summoned. As the accused Phirozbai Mazarkhan could not be produced the trial proceeded against the respondent only.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Presidency Magistrate was not satisfied, on the evidence, that the respondent and Phirozbai Mazarkhan had conspired either to defame the appellant or to extort money from him. He also held that there was no evidence to show that the respondent knew that Phirozbai Mazarkhan was committing an offence.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The Presidency Magistrate declined to frame a charge under ss. 385 and 389/34 and 109 of the Indian Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "The Presidency Magistrate framed a charge under s. 500, I.P.C., against the respondent who pleaded not guilty.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The respondent had on the 13th of October, 1952 uttered before Mr. Parab, an advocate, the defamatory words with which he was charged.",
      "type": "disputed",
      "date": "1952-10-13",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The charge: That you on or about 13-10-52 at Bombay defamed Abdul Rehman Mohamed Yusuf by making or publishing to witness N.K. Parab certain imputations concerning the said Abdul Rehman to wit that a woman named Phirozbai Mazarkhan was in his keeping, that he had promised to marry her but did not keep his promise and that he cheated her of her ornaments worth about Rs. 30,000 by means of spoken words intending to harm or knowing or having reason to believe that such imputations would harm the reputation of the said Abdul Rehman and you thereby committed an offence punishable under section 500 of the Indian Penal Code.",
      "type": "material",
      "date": "1952-10-13",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Presidency Magistrate held that s. 198 of the Code of Criminal Procedure stood in the way of his taking cognizance as the complaint had been made by the person aggrieved but there was no mention therein of the facts which formed the subject matter of the offence with which the respondent had been charged.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The Presidency Magistrate acquitted the respondent on the ground that the charge had been wrongly framed as a complaint should have been filed in respect of the offence with which the respondent had been charged.",
      "type": "procedural",
      "date": "1954-12-14",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Against the decision of the Presidency Magistrate an application in revision was filed by the appellant in the High Court of Bombay which was dismissed with the remark 'Rejected as no offence'.",
      "type": "procedural",
      "date": "1955-04-15",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The appellant obtained special leave from this Court to appeal against the decision of the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "When the appellant filed his complaint before the Presidency Magistrate he referred to the nature of the defamatory statement made by Phirozbai Mazarkhan which was contained in the notice sent to him by Mr. N. K. Parab on behalf of his client Phirozbai Mazarkhan.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "After giving good many details of the correspondence which ensued thereon, he referred to the part played by the respondent in paragraphs 19 to 24 of the complaint.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Paragraph 22 of complaint: 'I have also come to know as a result of my enquiries that Accused No. 2 was seen on occasions and at the relevant time going to the office of the said advocate Mr. Parab at Mazagaon with a woman. My enquiries further revealed that Accused No. 2 was in fact instrumental in connection with the aforesaid correspondence and filing a complaint and that though in fact the complaint was filed in the name of Accused No. 1 Accused No. 2 was the real person behind it.'",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "The appellant finally alleged that Phirozbai Mazarkhan and the respondent had conspired together and in furtherance of their common intention attempted to put him in fear of injury in body and reputation and in property and that they did so with the object of committing extortion.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Presidency Magistrate could take cognizance and frame charge under s.500 IPC for defamatory words uttered by respondent to Mr. Parab, given that the complaint did not specifically mention those facts, in view of s.198 CrPC.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Presidency Magistrate, upon finding the charge wrongly framed, should have acquitted the accused or referred the matter to the High Court, and whether the acquittal was a nullity.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Presidency Magistrate having found that the respondent had uttered the words mentioned in the charge to the advocate Parab, he should not have acquitted the respondent as s. 198 of the Code of Criminal Procedure was no real impediment in the way of the Presidency Magistrate.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "s. 500 IPC"
    },
    {
      "id": "pa2",
      "text": "He had taken cognizance of an offence under s. 500/34 and 109 of the Indian Penal Code on the complaint filed by the appellant. If at the trial it appeared that an offence under s. 500 only had been committed it was open to the Presidency Magistrate to take cognizance of that offence without the necessity of a separate complaint in respect thereof.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "s.198 CrPC"
    },
    {
      "id": "pa3",
      "text": "If the complaint was read as a whole it indicated that the respondent must have uttered the words, the subject matter of the charge, and that those words were not uttered to Mr. Parab by Phirozbai Mazarkhan only.",
      "supporting_facts": [
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Even if it be assumed that for the charge framed a separate complaint should have been filed and no cognizance could be taken for the offence charged in view of s. 198 of the Code of Criminal Procedure and that the Presidency Magistrate was right in his opinion that he had wrongly framed such a charge, it was his duty to make a reference to the High Court for the cancellation of the charge.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "s.198 CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Presidency Magistrate correctly acquitted the respondent as there was no complaint for the offence as charged and s. 198 of the Code of Criminal Procedure prohibited him from taking cognizance of the offence mentioned in the charge.",
      "supporting_facts": [
        "f1",
        "f8"
      ],
      "legal_basis": "s.198 CrPC"
    },
    {
      "id": "ra2",
      "text": "The offence of defamation could be committed on several occasions. The charge, as framed, referred to the defamatory words alleged to have been uttered by the respondent to Mr. Parab. This was a separate offence though of the same kind from the offence mentioned in the complaint.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Although the Presidency Magistrate had expressed the opinion that the respondent had uttered the defamatory words charged to Mr. Parab he had given no grounds upon which he came to this conclusion. If the entire evidence and the attending circumstances were taken into consideration it was clear that the evidence of Parab could not be believed.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "On the findings of the Presidency Magistrate, he could not have recorded an order of acquittal. The complaint as filed was not with reference to any alleged defamatory words uttered by the respondent to Mr. Parab.",
      "addresses_issue": "i1",
      "key_observation": "Complaint did not state facts constituting the s.500 offence charged."
    },
    {
      "id": "cr2",
      "text": "Although the Presidency Magistrate believed the evidence of Mr. Parab he was of the opinion that he wrongly framed the charge as the complaint did not state the facts which constituted the offence with which the respondent had been charged. In such a situation the Presidency Magistrate, instead of proceeding to record an order of acquittal, should have brought the matter to the notice of the High Court so that the error might be corrected.",
      "addresses_issue": "i2",
      "key_observation": "Should have referred to High Court instead of acquitting."
    },
    {
      "id": "cr3",
      "text": "The offence charged was a separate offence although of the same kind from the offence in respect of which the facts had been stated in the complaint. For this separate offence a complaint should have been filed and the provisions of s. 198 of the Code of Criminal Procedure complied with.",
      "addresses_issue": "i1",
      "key_observation": "Provisions of s.198 CrPC are mandatory."
    },
    {
      "id": "cr4",
      "text": "Even in s. 238 of the Code of Criminal Procedure the importance of the provisions of s. 198 or s. 199 of the Code is emphasised. Cl. 3 of this section specifically states that the provisions of this section do not authorise the conviction of an offence referred to in s. 198 or 199 when no complaint has been made as required by these sections.",
      "addresses_issue": "i1",
      "key_observation": "s.238 CrPC emphasizes s.198 requirements."
    },
    {
      "id": "cr5",
      "text": "The Presidency Magistrate wrongly framed the charge, as on the record, when in respect of the offence charged there was no complaint filed and the facts as stated in the complaint actually filed did not make out the offence as charged.",
      "addresses_issue": "i1",
      "key_observation": "No jurisdiction to frame charge without compliant complaint."
    },
    {
      "id": "cr6",
      "text": "It is clear from the findings of the Presidency Magistrate that the offence of conspiracy and abetment, as alleged in the complaint actually filed, had not been established. He should have then discharged the accused and refrained from framing a charge for an offence in respect of which there was no complaint before him as required by s. 198 of the Code of Criminal Procedure.",
      "addresses_issue": "i2",
      "key_observation": "Should have discharged accused."
    },
    {
      "id": "cr7",
      "text": "He had no jurisdiction to frame the charge he had framed. His order of acquittal, therefore, must be regarded as a nullity.",
      "addresses_issue": "i2",
      "key_observation": "Acquittal is a nullity."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The provisions of s.198 CrPC are mandatory; no cognizance can be taken of a separate defamation offence without a specific complaint mentioning the facts.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Where charge is wrongly framed due to lack of compliant complaint under s.198 CrPC, Magistrate should discharge accused or refer to High Court, not acquit; acquittal is nullity.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "385",
        "389",
        "500",
        "34",
        "109"
      ],
      "relevance": "Offences charged: extortion, putting in fear of injury to commit extortion, defamation with common intention and abetment."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "198",
        "199",
        "238"
      ],
      "relevance": "s.198 requires complaint by aggrieved person specifying facts for defamation; mandatory for cognizance; s.238 does not authorize conviction without such complaint."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "The appeal is allowed and the order of acquittal made by the Presidency Magistrate is set aside as a nullity, but on the finding of the Presidency Magistrate that no offence of conspiracy or abetment arising therefrom had been established, the present complaint is dismissed.",
    "relief_granted": "Acquittal set aside; complaint dismissed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The provisions of that section [s.198 CrPC] are mandatory.\"",
      "speaker": "court",
      "significance": "Core holding on requirement for specific complaint in defamation cases."
    },
    {
      "text": "\"His order of acquittal, therefore, must be regarded as a nullity.\"",
      "speaker": "court",
      "significance": "Determines acquittal invalid due to lack of jurisdiction."
    },
    {
      "id": "kq3",
      "text": "\"We accordingly allow the appeal and set aside the order of acquittal made by the Presidency Magistrate but... we direct that the present complaint be dismissed.\"",
      "speaker": "court",
      "significance": "Final disposition balancing setting aside acquittal and dismissing complaint."
    }
  ],
  "_case_id": "1959_32",
  "_label": 1,
  "_text_length": 11651,
  "_extracted_at": "2026-02-10T19:36:51.304618"
}