{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Assessees",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Civil Appeals Nos. 259 and 260 of 1958",
    "date_of_judgment": "1959-02-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Two appeals by special leave from judgment and orders dated August 5, 1955, of the former Travancore Cochin High Court in Income-tax Reference Appeals Nos. 6 of 1953 and 21 of 1954.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Common question: whether business losses incurred in the erstwhile State of Cochin could, under the Income-tax Act of Travancore, be set off against the business profits made in the erstwhile State of Travancore.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In C.A. No. 259/58, assessee is a public limited company incorporated in the State of Cochin with branches in that State as well as in what was British India and in Travancore State. Filed income-tax return showing income of Rs. 11,872 for assessment year 1948-49, accounting year previous calendar year.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Income-tax Officer determined assessable income Rs. 90,947 representing only profit in Travancore State and under s.32(1), first proviso, of Travancore Act refused deduction of Rs. 79,275 loss from branches outside Travancore.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Assessee's appeal to Income-tax Commissioner unsuccessful; Appellate Tribunal held banking business one and indivisible, entitled to deduct losses outside Travancore from profits in Travancore.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "High Court referred question: Is Rs. 79,275 a loss arising outside Travancore for first proviso to s.32(1)? Answered in favour of assessee.",
      "type": "procedural",
      "date": "1955-08-05",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "In C.A. No. 260/58, assessee private limited company with registered office in former Cochin State, business at head office in Cochin and in Travancore. Assessment under Travancore Act for previous year ending June 30, 1949, assessment year 1950-51.",
      "type": "background",
      "date": "1949-06-30",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Profit in Travancore Rs. 38,998, loss in Cochin Rs. 27,709, net profit Rs. 2,643 sought to be deducted; not allowed by ITO, confirmed by Appellate Assistant Commissioner and Tribunal.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "High Court referred question: Whether loss of Rs. 27,709 in Cochin could be set off against profit of Rs. 38,998 in Travancore? Answered in favour of assessee.",
      "type": "procedural",
      "date": "1955-08-05",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Relevant sections of Travancore Act identically worded with Indian Income-tax Act, 1922.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether business losses incurred in Cochin could be set off against business profits in Travancore under s.32(1) and first proviso of Travancore Income-tax Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "In Appeal No. 260/58, whether year ending June 30, 1949, was previous year for assessment year 1950-51 under Indian Income-tax Act, 1922.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "First proviso to s.32(1) of Travancore Act bars set off of losses from British India or other States against profits in Travancore; proviso imposes liability by disallowing such deduction and modifies computation under s.13 (business).",
      "supporting_facts": [
        "f2",
        "f4",
        "f8"
      ],
      "legal_basis": "First proviso to s.32(1) Travancore Act; Rhondda Urban Council v. Taff Vale Railway; Harrison v. Ward"
    },
    {
      "id": "pa2",
      "text": "S.10 (business) of Indian Act to be read with s.14(2)(e); profits from Indian States exempt, so losses not deductible; business in s.10 means business in British India.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "S.10 Indian Act; In Re Mishrimal Gulabchand; Raghunath Parshad v. CIT"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Banking business one and indivisible; entitled to deduct losses outside Travancore from profits in Travancore.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Proviso to s.24(1) Indian Act / s.32(1) Travancore Act qualifies generality of main enactment for set off between different heads; does not apply to profits/losses under same head (business) computed under s.10/13.",
      "addresses_issue": "i1",
      "key_observation": "Proviso carves exception from main enactment; cannot enlarge scope or modify computation under business head."
    },
    {
      "id": "cr2",
      "text": "History: Pre-1939 tax on British India income; 1939 total world income; 1941 exemption for Indian States income unless received/brought in, but included for rate; proviso added consequentially.",
      "addresses_issue": "i1",
      "key_observation": "Scheme admits set off under same head without proviso application."
    },
    {
      "id": "cr3",
      "text": "Words 'loss of profits or gains' in proviso same as main section; not restricted to business alone, as contrasted with s.24(2) proviso.",
      "addresses_issue": "i1",
      "key_observation": "Business indivisible; s.10 not limited to British India per definitions of total income, s.3, s.4."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S.32(1), first proviso, Travancore Act bars set off only where loss in Indian States under one head sought against profits in British India under other head; does not apply to profits/losses under business head (s.13/10).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Corporation of the City of Toronto v. Attorney-General for Canada",
      "citation": "1946 A.C. 32",
      "treatment": "followed",
      "relevance": "Effect of proviso: carves out from preceding enactment; cannot enlarge scope."
    },
    {
      "case_name": "Rhondda Urban Council v. Taff Vale Railway",
      "citation": "1909 A.C. 253",
      "treatment": "distinguished",
      "relevance": "Proviso may contain fresh enactment, but not here."
    },
    {
      "case_name": "Arunachalam Chettiar v. Commissioner of Income-tax",
      "citation": "1936 L.R. 63 I.A. 233",
      "treatment": "followed",
      "relevance": "S.24(1) for set off between different heads; same head adjusted directly."
    },
    {
      "case_name": "Anglo-French Textiles Co. Ltd. v. Commissioner of Income-tax, Madras",
      "citation": "1953 S.C.R. 448",
      "treatment": "followed",
      "relevance": "Set off under s.24(1) only for different heads; same head under s.10."
    },
    {
      "case_name": "Abdul Jabar Butt v. State of Jammu & Kashmir",
      "citation": "1957 S.C.R. 51",
      "treatment": "followed",
      "relevance": "Proviso construed harmoniously with main enactment."
    },
    {
      "case_name": "Ram Narain Sons Ltd. v. Assistant Commissioner of Sales Tax",
      "citation": "1955 2 S.C.R. 483",
      "treatment": "followed",
      "relevance": "Proviso embraces only field of main provision."
    },
    {
      "case_name": "Madras Southern Mahratta Railway Co. v. Bezwada Municipality",
      "citation": "1944 L.R. 71 I.A. 113",
      "treatment": "followed",
      "relevance": "Proviso excepts case within main enactment; no repercussion on clear main language."
    },
    {
      "case_name": "Commissioner of Income-tax v. Shaw Wallace & Co.",
      "citation": "1932 L.R. 59 I.A. 206",
      "treatment": "referred",
      "relevance": "'Income' expanded to 'income, profits and gains' is matter of words."
    }
  ],
  "statutes_cited": [
    {
      "name": "Travancore Income-tax Act",
      "sections": [
        "S.32(1) and proviso",
        "S.13",
        "S.9",
        "S.4",
        "S.18"
      ],
      "relevance": "Governs set off of losses; proviso does not modify business computation."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "S.24(1) and proviso",
        "S.10",
        "S.6",
        "S.4",
        "S.3",
        "S.14(2)(c)",
        "S.16",
        "S.2(15)"
      ],
      "relevance": "Identical scheme; total income includes world income; business head indivisible."
    },
    {
      "name": "Indian Income-tax Amendment Act, 1939",
      "sections": [
        "VII of 1939"
      ],
      "relevance": "Introduced total world income."
    },
    {
      "name": "Indian Income-tax Amendment Act, 1941",
      "sections": [
        "XXIII of 1941, S.8 adding S.14(2)(c)"
      ],
      "relevance": "Exempted Indian States income unless received/brought in."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals dismissed; High Court correctly answered common question in favour of assessees allowing set off of Cochin losses against Travancore profits under business head. Second question in C.A. 260/58 left open.",
    "relief_granted": "Set off of losses allowed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Ordinarily the effect of an excepting or a qualifying proviso is to carve something out of the preceding enactment or to qualify something enacted therein which but for the proviso would be in it",
      "speaker": "court",
      "significance": "Defines proper function of proviso."
    },
    {
      "text": "a set off under section 24(1) can only be claimed when the loss arises under one head and the profits against which it is sought to be set off arises under a different head.",
      "speaker": "court",
      "significance": "Distinguishes set off between heads vs. same head adjustment."
    },
    {
      "text": "The proper function of a proviso is to except and deal with a case which would otherwise fall within the general language of the main enactment",
      "speaker": "court",
      "significance": "Limits proviso scope to main enactment field."
    }
  ],
  "_case_id": "1959_2",
  "_label": 0,
  "_text_length": 24075,
  "_extracted_at": "2026-02-10T19:36:08.337656"
}