{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Patney & Co.",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Civil Appeal No. 326 of 1957",
    "date_of_judgment": "1959-05-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondents at all material times were non-residents carrying on business at Secunderabad which was then in the territories of the Nizam of Hyderabad.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondents acted as agents for the supply of gas plants manufactured by Messrs. T. V. S. Iyengar Sons, Madura, to the Nizams Government, and also as agents of the Lucas Indian Services, Bombay branch, for the supply of certain goods to that Government.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The year of assessment is 1945-46.",
      "type": "material",
      "date": "1945-46",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "There does not appear to have been any written agreement between the two manufacturers and the respondents but the goods were to be supplied on a commission basis.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The respondents received from Messrs. T.V.S. Iyengar Sons, Madura, cheques drawn on the Imperial Bank of India, Madras, amounting to Rs. 35,202 in respect of all goods supplied from Madura and also from Lucas Indian Services, Bombay, by cheques drawn on Imperial Bank of India, Bombay branch, amounting to Rs. 5,302 in respect of goods supplied by them, thus making a total of Rs. 40,504.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "These cheques were sent by post and when received by the respondents at Secunderabad were credited in the account books of the respondents and sent to their banker G. Raghunathmal for collecting and crediting to the account of the respondents.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "As against these sums so deposited the respondents at once drew cheques and thus operated on these amounts deposited.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In regard to the commission received from the Bombay firm it was paid into the account on December 22, 1944, but was given credit for only on January 2, 1945.",
      "type": "material",
      "date": "1944-12-22",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Income-tax Officer assessed these sums as taxable income holding that the entire amount of Rs. 40,504 was received in British India and not at Secunderabad.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "An appeal was taken by the respondents to the Appellate Assistant Commissioner who upheld the order holding that income must be held to have accrued, arisen or received in British India.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Against this order the respondents took an appeal to the Income-tax Appellate Tribunal and it was held that the amounts were received by the respondents from Madura and Bombay firms as commission but they were received at Secunderabad. The appeal was therefore allowed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The finding of the Appellate Tribunal: 'The contention of the Appellants is that the cheques being negotiable instruments and the creditor having accepted them and passed through their books, the receipt must be taken to be receipts in Hyderabad. We agree with the view submitted by the appellants. In Bhashyam Negotiable Instruments Act, 8th Edition, Revised, page 556, it is stated that it will be open to a creditor to accept a cheque in absolute payment of money due to him, in which case it will be equivalent to cash payment. That being the position it cannot be said that the income was received in British India.'",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "At the instance of the Commissioner a reference under s. 66(1) of the Act was made to the High Court of Orissa for their opinion on the following question: 'Whether in the circumstances of the case, the sums of Rs. 35,202 and Rs. 5,302 received as commission from T. V. S. Iyengar Sons Ltd., and Lucas Indian Services Ltd., respectively were income that accrued, arose or were received in British India.'",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The High Court found that the statement of case was imperfect and that the real question was different: 'The real question in all such cases is not merely whether the cheques were drawn on a bank in British India, and sent for collection to that bank. The question is whether when the cheques were received by the assessee having his place of business outside British India, those cheques were in fact received as absolute and final payments by way of unconditional discharge or whether they were received as mere conditional payments on realisation. The fact that cheques were drawn on a bank in British India or that they were sent for collection through a Secunderabad banker of the assessee though relevant, are not conclusive.' It therefore remitted the case to the Appellate Tribunal for submission of supplementary statement of case.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f15",
      "text": "The controversy was confined to the question whether the cheques having been sent to Secunderabad and having been realised in British India would amount to a final discharge or an unconditional one.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The Tribunal in its supplementary statement found that the course of conduct followed by the parties showed that the cheques were received from the Bombay and Madura firms in full satisfaction of the commission ascertained from time to time and due on such date. 'The facts that such entries were made in the assessees books, that the cheques were put into the bank immediately, that the bank at once gave credit to the assessee for these sums after charging discount thereon and immediately allowed the assessee to operate on those sums are significant.'",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "The finding of fact by the Tribunal although not specific was that the receipt of the cheque by the respondents operated as full discharge of the debt due on account of commission from these two firms.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "The matter was decided by the High Court against the appellant and even after considering the decision in Commissioner of Income-tax v. Ogale Glass Works Ltd., the High Court was of the opinion that the income of the respondents was not received in British India and answered the question against the Revenue.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f19",
      "text": "The High Court refused to give leave to appeal to this Court and it was this Court which gave special leave to appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "The Appellate Tribunal found that all the cheques whether from Madura or from Bombay were sent by the two respective firms from Madura or Bombay and were received by the respondents at Secunderabad and were treated as payment.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "There is in support of the respondents an affidavit which was filed in the assessment proceedings: 'The above commission was verbally decided to be paid to Messrs. Patney & Co. Ltd., Secunderabad the Agent Company in Hyderabad State at Secunderabad in cash or by cheque as the case may be.'",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the amounts of commission paid by cheques, drawn respectively on banks at Madras and Bombay and respectively posted from Madura and Bombay, can in the circumstances of this case be held to have been received in what was British India or at Secunderabad?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether in the circumstances of the case, the sums of Rs. 35,202 and Rs. 5,302 received as commission from T. V. S. Iyengar Sons Ltd., and Lucas Indian Services Ltd., respectively were income that accrued, arose or were received in British India.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "The real question in all such cases is not merely whether the cheques were drawn on a bank in British India, and sent for collection to that bank. The question is whether when the cheques were received by the assessee having his place of business outside British India, those cheques were in fact received as absolute and final payments by way of unconditional discharge or whether they were received as mere conditional payments on realisation.",
      "framed_by": "high_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The entire amount of Rs. 40,504 was received in British India and not at Secunderabad.",
      "supporting_facts": [
        "f5",
        "f6",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Income must be held to have accrued, arisen or received in British India.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Cheques being negotiable instruments drawn on banks in British India and sent for collection to that bank amount to receipt in British India.",
      "supporting_facts": [
        "f5",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "If there is an express request by the creditor that the amount be paid by cheques to be sent by post and they are so sent there is no doubt that the payment will be taken to be at the place where the cheque or cheques are posted.",
      "supporting_facts": [
        "f20"
      ],
      "legal_basis": "Commissioner of Income-tax v. Ogale Glass Works Ltd."
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The amounts were received by the respondents from Madura and Bombay firms as commission but they were received at Secunderabad.",
      "supporting_facts": [
        "f11",
        "f20"
      ],
      "legal_basis": "Bhashyam Negotiable Instruments Act, 8th Edition, Revised, page 556"
    },
    {
      "id": "ra2",
      "text": "The contention that the cheques being negotiable instruments and the creditor having accepted them and passed through their books, the receipt must be taken to be receipts in Hyderabad.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "There was an agreement between the Madura and Bombay firms and the respondents that the money would be paid whether in cash or by cheque at Secunderabad and therefore when the cheques were sent by post the post office was the agent of the debtor and not of the respondents.",
      "supporting_facts": [
        "f21"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "In the absence of such a request the post office could not be constituted as the agent of the creditor.",
      "supporting_facts": [
        "f21"
      ],
      "legal_basis": "Commissioner of Income-tax v. Ogale Glass Works Ltd."
    },
    {
      "id": "ra5",
      "text": "There was an express agreement that the payment was to be made at Secunderabad.",
      "supporting_facts": [
        "f21"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The question is whether the amounts, of commission paid by cheques, drawn respectively on banks at Madras and Bombay and respectively posted from Madura and Bombay, can in the circumstances of this case be held to have been received in what was British India or at Secunderabad?",
      "addresses_issue": "i1",
      "key_observation": "The Appellate Tribunal found that all the cheques were sent by the two respective firms from Madura or Bombay and were received by the respondents at Secunderabad and were treated as payment."
    },
    {
      "id": "cr2",
      "text": "The question still remains as to the effect of the sending of the cheques from Madura or Bombay by post.",
      "addresses_issue": "i1",
      "key_observation": "If there is an express request by the creditor that the amount be paid by cheques to be sent by post and they are so sent there is no doubt that the payment will be taken to be at the place where the cheque or cheques are posted."
    },
    {
      "id": "cr3",
      "text": "In the case of payment by cheques sent by post the determination of the place of payment would depend upon the agreement between the parties or the course of conduct of the parties.",
      "addresses_issue": "i1",
      "key_observation": "If it is shown that the creditor authorised the debtor either expressly or impliedly to send a cheque by post the property in the cheque passes to the creditor as soon as it is posted. Therefore the post office is an agent of the person to whom the cheque is posted if there be an express or implied authority to send it by post."
    },
    {
      "id": "cr4",
      "text": "In Commissioner of Income-tax v. Ogale Glass Works Ltd., there was an express request of the assessee to remit the amount by means of cheques. But it was observed that according to the course of business usage in general which has to be considered as a part of the surrounding circumstances the parties must have intended that the cheques should be sent by post which is the usual and normal mode of transmission and therefore the posting of cheques in Delhi amounted to payment in Delhi to the post office which was constituted the agent of the assessee.",
      "addresses_issue": "i1",
      "key_observation": "Of course if there be no such request, express or implied, then the delivery of the letter or the cheque to the post office is delivery to the agent of the sender himself."
    },
    {
      "id": "cr5",
      "text": "Applying the above principles to the facts found by the Tribunal the position appears to be this. The engagement of the Government was to make payment by cheques. The cheques were drawn in Delhi and received by the assessee in Aundh by post. According to the course of business usage to which, as part of the surrounding circumstances, attention has to be paid under the authorities cited above, the parties must have intended that the cheques should be sent by post which is the usual and normal agency for transmission of such articles and according to the Tribunals finding they were in fact received by the assessee by post.",
      "addresses_issue": "i1",
      "key_observation": "Quoted from Ogale Glass Works Ltd."
    }
  ],
  "holdings": [],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax v. Ogale Glass Works Ltd.",
      "citation": "1955 1 S.C.R. 185",
      "treatment": "followed | referred",
      "relevance": "On the place of payment/receipt when cheques are sent by post; whether post office is agent of sender or receiver based on express/implied authority or course of business."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "s. 66(1)"
      ],
      "relevance": "For making reference to the High Court for opinion on the question of accrual/arising/receipt of income in British India."
    }
  ],
  "outcome": {
    "disposition": null,
    "summary": "Appeal by special leave against Orissa High Court judgment holding commissions not received in British India. Supreme Court judgment delivered by Kapur J. analyzing facts and applying principles from Ogale Glass Works on place of receipt of cheques sent by post.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The real question in all such cases is not merely whether the cheques were drawn on a bank in British India, and sent for collection to that bank. The question is whether when the cheques were received by the assessee having his place of business outside British India, those cheques were in fact received as absolute and final payments by way of unconditional discharge or whether they were received as mere conditional payments on realisation.",
      "speaker": "high_court",
      "significance": "High Court's reformulation of the core issue remitted to Tribunal."
    },
    {
      "text": "The facts that such entries were made in the assessees books, that the cheques were put into the bank immediately, that the bank at once gave credit to the assessee for these sums after charging discount thereon and immediately allowed the assessee to operate on those sums are significant.",
      "speaker": "lower_court",
      "significance": "Tribunal's supplementary finding on course of conduct indicating full discharge."
    },
    {
      "text": "If it is shown that the creditor authorised the debtor either expressly or impliedly to send a cheque by post the property in the cheque passes to the creditor as soon as it is posted. Therefore the post office is an agent of the person to whom the cheque is posted if there be an express or implied authority to send it by post.",
      "speaker": "court",
      "significance": "Key principle on agency of post office in determining place of payment."
    },
    {
      "text": "Of course if there be no such request, express or implied, then the delivery of the letter or the cheque to the post office is delivery to the agent of the sender himself.",
      "speaker": "court",
      "significance": "Distinction from Ogale case where request or course of business implied agency."
    }
  ],
  "_case_id": "1959_130",
  "_label": 0,
  "_text_length": 10650,
  "_extracted_at": "2026-02-10T19:37:48.751083"
}