{
  "metadata": {
    "case_name": "Gullapalli Nageswara Rao & Ors. v. Andhra Pradesh State Road Transport Corporation & Ors.",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao J."
    ],
    "case_number": "Civil Appeals Nos. 198 to 200 of 1959",
    "date_of_judgment": "1959-08-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants were carrying on motor transport business for several years in Krishna District in the State of Andhra Pradesh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Shri Guru Pershad, General Manager of the State Transport Undertaking, published a scheme for nationalization of motor transport in the said State.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Objections to the proposed scheme were invited by the State Government, and the appellants filed objections.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On December 26, 1957, the Secretary in charge of the Transport Department gave a personal hearing to the objectors and heard representations on behalf of the State Transport Undertaking.",
      "type": "procedural",
      "date": "1957-12-26",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Chief Minister approved the scheme, published in Andhra Pradesh Gazette dated January 9, 1958, effective from January 10, 1958.",
      "type": "procedural",
      "date": "1958-01-09",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Andhra Pradesh Road Transport Corporation formed under Road Transport Corporations Act, 1950, took over and proceeded to implement the scheme.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellants moved Supreme Court under Art. 32, which quashed the approval order on grounds related to hearing by Secretary, dated November 5, 1958.",
      "type": "procedural",
      "date": "1958-11-05",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Government issued notices for personal hearing by Chief Minister on December 9, 1958; objectors could file further objections by November 30, 1958.",
      "type": "procedural",
      "date": "1958-12-09",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Chief Minister heard objectors and Corporation, passed orders dated December 19, 1958, rejecting objections and approving scheme; published December 22, 1958.",
      "type": "procedural",
      "date": "1958-12-19",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On December 23, 1958, Corporation applied to Regional Transport Authority (RTA) for permits and eliminating private permits.",
      "type": "procedural",
      "date": "1958-12-23",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "RTA passed orders on December 24, 1958, rendering appellants' permits ineffective from December 24, 1958, issuing permits to Corporation; communicated same day, directing stop plying from December 25, 1958.",
      "type": "procedural",
      "date": "1958-12-24",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appellants filed writ petitions in Andhra Pradesh High Court under Art. 226 to quash Government and RTA orders; dismissed by Division Bench on March 5, 1959.",
      "type": "procedural",
      "date": "1959-03-05",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appellants filed affidavits alleging Chief Minister initiated scheme and was biased; counter-affidavit denied, stating scheme initiated by Guru Pershad, Corporation autonomous.",
      "type": "disputed",
      "date": null,
      "source": "petitioner | respondent"
    },
    {
      "id": "f14",
      "text": "Newspaper extracts (Exhibits IV, V, VI, IX, X) purporting speeches by Chief Minister supporting nationalization; not proved by affidavits from witnesses.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Appellants withdrew vehicles post-RTA order; Corporation vehicles plying on routes.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Chief Minister was disqualified from hearing objections due to official bias as Minister in charge of transport or personal bias from acts and speeches.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Regional Transport Authority complied with Rule 11 by giving due notice before rendering permits ineffective.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Chief Minister disqualified like Secretary per previous Gullapalli judgment, as in charge of transport portfolio; party cannot be judge in own cause.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "Principles of natural justice; Gullapalli Nageswara Rao v. Andhra Pradesh State Road Transport Corporation"
    },
    {
      "id": "pa2",
      "text": "Chief Minister's acts (initiating scheme) and speeches showed personal bias against private operators.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": "Doctrine of bias: no man shall be judge in own cause; justice must manifestly seem to be done"
    },
    {
      "id": "pa3",
      "text": "RTA rendered permits ineffective without due notice as per Rule 11.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Rule 11 of Andhra Pradesh Motor Vehicles Rules; s.68F(2) Motor Vehicles Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Distinction between official bias inherent in statutory duty and personal bias; no proof of personal bias.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Statutory authorization qualifies doctrine of bias"
    },
    {
      "id": "ra2",
      "text": "Chief Minister not part of Transport Department; Corporation autonomous; scheme initiated by Guru Pershad.",
      "supporting_facts": [
        "f2",
        "f13"
      ],
      "legal_basis": "Constitution Art.166; Government Business Rules"
    },
    {
      "id": "ra3",
      "text": "Newspaper reports not proved; speeches reflect policy only.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "No legal proof of bias"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Principles of bias apply to quasi-judicial functions: no man judge in own cause; justice must seem to be done. Statutory duty does not override unless expressly authorized.",
      "addresses_issue": "i1",
      "key_observation": "Act does not authorize Government to initiate scheme and judge; visualizes Government as neutral judge."
    },
    {
      "id": "cr2",
      "text": "Distinction between Secretary (part of department) and Chief Minister (primarily responsible, but not part); previous judgment accepted CM's competence.",
      "addresses_issue": "i1",
      "key_observation": "Appellants cannot reopen after previous judgment."
    },
    {
      "id": "cr3",
      "text": "No proof Chief Minister initiated scheme or made biasing speeches; newspaper extracts unproved.",
      "addresses_issue": "i1",
      "key_observation": "Speeches reflect policy; no closed mind established."
    },
    {
      "id": "cr4",
      "text": "RTA violated Rule 11: no prior notice, only one day compliance; but technical defect, no practical utility to quash as scheme upheld, vehicles replaced.",
      "addresses_issue": "i2",
      "key_observation": "High Court discretion under Art.226 rightly exercised."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Chief Minister not disqualified; no violation of natural justice.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "RTA order defective for lack of due notice under Rule 11, but no interference warranted.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gullapalli Nageswara Rao v. Andhra Pradesh State Road Transport Corporation",
      "citation": "1959 S.C.R. Suppl. 319",
      "treatment": "followed",
      "relevance": "Previous stage quashed scheme due to Secretary's hearing; distinguished for Chief Minister"
    },
    {
      "case_name": "The King v. Bath Compensation Authority",
      "citation": "1925 1 K.B. 685; 1926 A.C. 586",
      "treatment": "followed",
      "relevance": "No one can be party and judge; statute does not override natural justice unless clear"
    },
    {
      "case_name": "The King v. Leicester Justices",
      "citation": "1927 1 K.B. 557",
      "treatment": "distinguished",
      "relevance": "Statutory duty originating objection ok if within procedure; unlike active opposition"
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 226",
        "Article 166"
      ],
      "relevance": "Writs filed; Governor acts on Minister advice; business rules"
    },
    {
      "name": "Motor Vehicles Act, 1939 (as amended by Act 100 of 1956)",
      "sections": [
        "Section 68C",
        "Section 68F(2)"
      ],
      "relevance": "Scheme preparation, approval, permit cancellation to implement scheme"
    },
    {
      "name": "Road Transport Corporations Act, 1950",
      "sections": [],
      "relevance": "Formation of Corporation to implement scheme"
    },
    {
      "name": "Andhra Pradesh Motor Vehicles Rules",
      "sections": [
        "Rule 11"
      ],
      "relevance": "Due notice before eliminating permits"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals, upholding High Court dismissal of writs; Chief Minister's hearing valid, no bias; RTA procedural defect overlooked as futile.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"no man shall be a judge in his own cause; justice should not only be done but manifestly and undoubtedly seem to be done.\"",
      "speaker": "court",
      "significance": "Core principles of bias doctrine applied"
    },
    {
      "text": "\"unless the legislature clearly and expressly ordained to the contrary, the principles of natural justice cannot be violated.\"",
      "speaker": "court",
      "significance": "Limits statutory override of natural justice"
    },
    {
      "text": "\"to interfere on a technical point of no practical utility is to strain at a gnat after swallowing a camel.\"",
      "speaker": "court",
      "significance": "Justification for not quashing RTA order despite defect"
    }
  ],
  "_case_id": "1959_133",
  "_label": 0,
  "_text_length": 32332,
  "_extracted_at": "2026-02-10T19:37:20.886773"
}