{
  "metadata": {
    "case_name": "Ram Dayal v. Respondent No. 1",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha, J."
    ],
    "case_number": "Civil Appeal No. 108 of 1959",
    "date_of_judgment": "1959-04-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeal from judgment and order dated November 25, 1958, of Punjab High Court dismissing appeal against Election Tribunal, Hissar order dated September 14, 1958, setting aside appellant's election to Punjab Legislative Assembly from general seat in double-member constituency of Sirsa.",
      "type": "procedural",
      "date": "1958-11-25",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant was successful candidate from general seat in Sirsa double-member constituency (one reserved for scheduled castes), securing 27,272 votes; respondent No. 2 (Harijan candidate) also successful; first respondent contested general seat with 23,329 votes.",
      "type": "material",
      "date": "1957-03-12",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Election held on March 12 and 14, 1957; result declared March 17, 1957.",
      "type": "background",
      "date": "1957-03-17",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "First respondent filed election petition on April 28, 1957, challenging appellant's election on multiple grounds, but only corrupt practices in sub-paras 1 to 3 of para 13B (issue No. 4) relevant.",
      "type": "procedural",
      "date": "1957-04-28",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Allegations: Respondent No. 1 (appellant in this appeal), agents, others with consent committed undue influence by interfering with free exercise of electoral right; Sat Guru Maharaj Pratap Singh (Namdharis) and Maharaj Charan Singh (Radha Swamis) issued farmans orally conveyed via Subas (Bir Singh, Naginder Singh, Purshotam Singh) and Sant Teja Singh, threatening divine displeasure, expulsion if not supporting respondent No. 1 (appellant) and opposing petitioner.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Sat Guru Pratap Singh held Diwans: Big Diwan at Sirsa on Feb 25, 1957 in presence of respondent No. 1 preaching support for him; at Tharaj (Mar 6), Dhiwan (Mar 5), Rori (Mar 6), Phaggu (Mar 6), 1957; big diwan at Khairpur Feb 26, 1957.",
      "type": "disputed",
      "date": "1957-02-25",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Posters printed Feb 26, 1957 at Bansal Press, Sirsa, in Hindi/Gurumukhi, containing farmans of Satguru Pratap Singh signed by Maharaj Bir Singh, distributed till polling day; exh. P.1 contained command to Namdharis to vote and canvass for Shri Ram Dayal.",
      "type": "material",
      "date": "1957-02-26",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Election Tribunal found: Maharaj Pratap Singh issued farmans threatening suffering in this world and next if not voting for appellant; Diwans held as alleged for canvassing; posters like exh. P.1 issued under authority of Maharaj Bir Singh and father, widely distributed; done at instance and in presence of appellant.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Tribunal not proved oral conveyance of farmans by specified persons except Naginder Singh's statements; inclined to view as undue influence under s.123(2), alternatively systematic appeal on religion under s.123(3); declared election void u/s 100(1)(b); parties bear own costs.",
      "type": "material",
      "date": "1958-09-14",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court (Falshaw and Dua JJ) affirmed Tribunal findings on issue 4, accepted oral evidence on poster distribution; held language of poster exh. P.1 implied threat of divine displeasure/spiritual censure; attracted s.123(2); not s.123(3) or s.123(4); dismissed appeal with costs.",
      "type": "material",
      "date": "1958-11-25",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court granted certificate of fitness for appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Supreme Court added Election Commission as respondent No. 3 on Feb 27, 1959; directed hearing before fresh election.",
      "type": "procedural",
      "date": "1959-02-27",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Hearing concluded March 18, 1959; appeal dismissed with costs, reasons to follow.",
      "type": "procedural",
      "date": "1959-03-18",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on findings of fact, corrupt practice of undue influence as defined in s.123(2) of Representation of the People Act, 1951 has been made out.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Main cl.(2) of s.123 applies only to threats of injury to person/property, not spiritual undue influence covered specifically by proviso (a)(ii); proviso adds to main provision what was not covered.",
      "supporting_facts": [],
      "legal_basis": "s.123(2) proviso (a)(ii), Representation of the People Act, 1951"
    },
    {
      "id": "pa2",
      "text": "s.123(2) directed against unduly influencing individual voters; requires pleading and finding on specific named individuals affected; general allegation insufficient to vitiate election.",
      "supporting_facts": [],
      "legal_basis": "s.79(d); precedents: Cheltenham, Nottingham, North Durham; Rogers on Elections"
    },
    {
      "id": "pa3",
      "text": "Religious leader has right to freedom of speech, express opinion, canvass for candidate without vitiating election.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Exh. P.1 does not contain direct threat bringing within second para of proviso (a) to s.123(2).",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "s.123(2)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Farmans, speeches, poster exh. P.1 by religious heads at instance/presence of appellant constituted undue influence by inducing belief in divine displeasure/spiritual censure if not voting for appellant.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7",
        "f8",
        "f9",
        "f10"
      ],
      "legal_basis": "s.123(2) proviso (a)(ii)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Indian law under s.123(2) does not emphasize individual aspect like English law; material is acts calculated to interfere with free exercise of electoral right, not actual effect.",
      "addresses_issue": "i1",
      "key_observation": "English precedents not applicable as statutes differ."
    },
    {
      "id": "cr2",
      "text": "Poster exh. P.1, with bold 'hukam of Shri Sat Guru', conveyed mandate implying divine displeasure/spiritual censure for non-compliance to illiterate Namdhari voters.",
      "addresses_issue": "i1",
      "key_observation": "Agreed with High Court construction."
    },
    {
      "id": "cr3",
      "text": "Religious leader can express opinion/canvass but abuses influence if leaves no choice, implying disobedience carries divine displeasure/spiritual censure; here farmans/speeches did so.",
      "addresses_issue": "i1",
      "key_observation": "Case within proviso (a)(ii) to s.123(2)."
    },
    {
      "id": "cr4",
      "text": "No need to consider if main cl.(2) covers spiritual influence apart from proviso, as proviso applies.",
      "addresses_issue": "i1",
      "key_observation": "Main ground fails."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "On facts found, corrupt practice of undue influence u/s 123(2) proviso (a)(ii) proved; appellant's election void.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Cheltenham",
      "citation": "1869 1 OM. H. 62, 64",
      "treatment": "referred",
      "relevance": "English case on individual intimidation"
    },
    {
      "case_name": "Nottingham",
      "citation": "1869 1 OM. H. 245, 246",
      "treatment": "referred",
      "relevance": "English case on individual intimidation"
    },
    {
      "case_name": "North Durham",
      "citation": "1874 2 OM. H. 152, 156",
      "treatment": "distinguished",
      "relevance": "English emphasis on individual aspect not applicable to Indian law"
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "s.123(2)",
        "s.123(3)",
        "s.100(1)(b)",
        "s.79(d)"
      ],
      "relevance": "Defines undue influence; basis for voiding election; Tribunal/High Court applied s.123(2) proviso (a)(ii)"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed affirming High Court and Tribunal; appellant's election declared void due to corrupt practice of undue influence u/s 123(2); costs to respondent No. 1.",
    "relief_granted": "Election of appellant set aside",
    "costs": "Appeal dismissed with costs to respondent No. 1"
  },
  "key_quotes": [
    {
      "text": "\"The language of the mandate and the general background... can lead but to one conclusion that it was intended to convey to them the threat of divine displeasure and spiritual censure if they dared to disobey the farman of their supreme spiritual and religious head.\"",
      "speaker": "court",
      "significance": "High Court observation affirmed by SC on effect of poster"
    },
    {
      "text": "\"A command from Shri Sat Guru Sacha Padshah to the Namdharis of Halqa-Sirsa Every Namdhari... is commanded... to make every effort for the success of Shri Ram Dayal Vaid... it being our primary duty.\"",
      "speaker": "court",
      "significance": "Text of exh. P.1 poster central to finding undue influence"
    },
    {
      "text": "\"If the influence exercised by the religious and spiritual head has the effect of creating in the minds of the voters a feeling of divine displeasure or spiritual censure then whatever the motive, the influence would amount to undue influence.\"",
      "speaker": "court",
      "significance": "High Court holding on motive irrelevance, affirmed"
    }
  ],
  "_case_id": "1959_11",
  "_label": 0,
  "_text_length": 23864,
  "_extracted_at": "2026-02-10T19:36:10.408134"
}