{
  "metadata": {
    "case_name": "Indian Hume Pipe Co. Ltd., Bombay v. its workmen (monthly-rated including canteen boys)",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No.169 of 1958",
    "date_of_judgment": "1959-10-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Industrial dispute between Indian Hume Pipe Co. Ltd. (appellant) and its monthly-rated workmen including canteen boys (respondents) regarding claim for gratuity.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1950, respondents raised dispute claiming scale of pay, dearness allowance, provident fund and gratuity; referred to Mr. Thakore who awarded gratuity scheme on August 13, 1951.",
      "type": "background",
      "date": "1951-08-13",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Both parties appealed the 1951 award; Labour Appellate Tribunal dismissed appeals and confirmed award.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On June 2, 1953, respondents gave notice terminating the 1951 award and demanded gratuity at higher rate.",
      "type": "procedural",
      "date": "1953-06-02",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Conciliation proceedings failed; present reference made on July 1, 1954 as I.T. No. 100 of 1954: 'Gratuity - employees should be paid gratuity on the scale and conditions prescribed in the industrial tribunal's award in Ref. I.T. No. 82 of 1950 dated August 13, 1951. It should also be paid to those whose services have been terminated by the management after the termination of the aforesaid award.'",
      "type": "procedural",
      "date": "1954-07-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Industrial Tribunal held jurisdiction limited to 1951 scheme, could not revise; enforced scheme with modifications after examining appellant's financial position; rejected appellant's contention that no gratuity if entitled to s.25F retrenchment compensation.",
      "type": "procedural",
      "date": "1955-07-14",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellant challenged tribunal award before Labour Appellate Tribunal (Appeal Bombay No. 245 of 1955); argued no double benefit; appellate tribunal rejected, confirmed both gratuity and retrenchment compensation; modified scheme, examined finances; added paragraph for retrenched persons between reference and award: no additional gratuity if already received excess unemployment/retrenchment compensation, else difference.",
      "type": "procedural",
      "date": "1955-06-29",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Are workmen entitled to the double benefit of a gratuity scheme as well as retrenchment compensation under s.25F of the Industrial Disputes Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No gratuity should be paid to workmen entitled to receive retrenchment compensation under s.25F; after enactment of s.25F, no scope for framing gratuity schemes in addition to statutory retrenchment compensation.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "s.25F Industrial Disputes Act; Ordinance V of 1953 s.25E(b) used 'gratuity' but Act substituted 'retrenchment compensation'"
    },
    {
      "id": "pa2",
      "text": "Solicitor-General conceded no legal bar but urged twofold gratuity scheme: lesser gratuity for retrenched workmen.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Entitled to gratuity per 1951 scheme even for terminated services; urged revision of scheme but tribunal limited jurisdiction.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5"
      ],
      "legal_basis": "1951 award by Mr. Thakore"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Gratuity is retirement benefit (like provident fund/pension) for length of service, to help after retirement/superannuation/disability; retrenchment compensation is to soften hardship of sudden unemployment, different concepts; they complement, not conflict; double benefit valid on social justice.",
      "addresses_issue": "i1",
      "key_observation": "Industrial tribunals generally allowed both pre- and post-s.25F."
    },
    {
      "id": "cr2",
      "text": "s.25F standardises retrenchment compensation amount (15 days average pay per completed year), does not oust gratuity jurisdiction; Legislature aware of gratuity (s.2(rr) excludes it from wages), would have expressly barred if intended.",
      "addresses_issue": "i1",
      "key_observation": "No provision like s.17 Employees Provident Funds Act exempting existing schemes."
    },
    {
      "id": "cr3",
      "text": "Declined to frame twofold gratuity scheme; matter for tribunals; not for Art.136 appeal.",
      "addresses_issue": "i1",
      "key_observation": "Decision does not cover schemes providing compensation in lieu/addition to gratuity."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Workmen entitled to both reasonable gratuity schemes and s.25F retrenchment compensation; no conflict, tribunals right to frame gratuity schemes post-s.25F.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Army and Navy Stores Ltd., Bombay, And Their Workmen",
      "citation": "1951 II L.L.J. 31",
      "treatment": "followed",
      "relevance": "Model gratuity scheme examined; basis for subsequent schemes."
    },
    {
      "case_name": "Bangalore Woollen, Cotton and Silk Mills Co. Ltd., And Binny Mills Labour Association",
      "citation": "1952 I L.L.J. 656",
      "treatment": "followed",
      "relevance": "Retrenchment relief in addition to pending gratuity scheme."
    },
    {
      "case_name": "Chemical, Industrial and Pharmaceutical Laboratory Ltd., And Their Workmen",
      "citation": "1955 II L.L.J. 355",
      "treatment": "distinguished",
      "relevance": "Rare case denying gratuity to terminated workmen."
    },
    {
      "case_name": "All India Industrial Tribunal (Bank Disputes)",
      "citation": null,
      "treatment": "followed",
      "relevance": "Retrenchment compensation does not affect gratuity claim."
    },
    {
      "case_name": "Rashtriya Mill Mazdoor Sangh and Gold Mohur Mills",
      "citation": "1953 II L.L.J. 660",
      "treatment": "referred",
      "relevance": "Quantum of retrenchment compensation: 10 days basic wages + DA per year, no maximum."
    },
    {
      "case_name": "Bombay Gas Co. Ltd., And Their Workmen",
      "citation": "1950 L.L.J. 150",
      "treatment": "referred",
      "relevance": "Detailed scheme for retrenchment compensation quantum."
    },
    {
      "case_name": "National Industrial Works And Their Workmen",
      "citation": "1950 L.L.J. 1143",
      "treatment": "referred",
      "relevance": "Elaborate scheme for retrenchment compensation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act",
      "sections": [
        "s.25F",
        "s.2(rr)"
      ],
      "relevance": "s.25F mandates retrenchment compensation (15 days average pay per completed year or part >6 months); does not bar gratuity; s.2(rr) excludes gratuity from wages."
    },
    {
      "name": "Industrial Disputes (Amendment) Ordinance V of 1953",
      "sections": [
        "s.25E(b)"
      ],
      "relevance": "Precursor to s.25F, used 'gratuity' but Act changed to 'retrenchment compensation'."
    },
    {
      "name": "Industrial Disputes (Amendment) Act 43 of 1953",
      "sections": [
        "s.25F(b)"
      ],
      "relevance": "Introduced s.25F effective Oct 24, 1953; standardises retrenchment compensation."
    },
    {
      "name": "Employees Provident Funds Act, 1952 (Act 19 of 1952)",
      "sections": [
        "s.17"
      ],
      "relevance": "Example of express exemption for existing schemes; absent in Industrial Disputes Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding the Labour Appellate Tribunal and Industrial Tribunal awards enforcing the gratuity scheme alongside s.25F retrenchment compensation, with modifications; no amendment to scheme as urged.",
    "relief_granted": "Gratuity scheme enforced for respondents, including retrenched workmen.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'Are workmen entitled to the double benefit of a gratuity scheme as well as retrenchment compensation? That is the main question which falls to be considered in the present appeal.'",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "'Gratuity is a kind of retirement benefit like the provident fund or pension... retrenchment compensation is not a retirement benefit at all... The two schemes are not at all irreconcilable nor even inconsistent they really complement each other.'",
      "speaker": "court",
      "significance": "Distinguishes concepts, justifies double benefit."
    },
    {
      "text": "'The enactment of s.25F thus merely standardises the payment of retrenchment compensation and nothing more.'",
      "speaker": "court",
      "significance": "Clarifies s.25F does not bar gratuity."
    }
  ],
  "_case_id": "1959_172",
  "_label": 0,
  "_text_length": 23588,
  "_extracted_at": "2026-02-10T19:38:16.068333"
}