{
  "metadata": {
    "case_name": "Government of Jammu and Kashmir & Ors. v. Jammu Kashmir Mechanics And Transport Workers Co-operative Society Limited & Anr.",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO J."
    ],
    "case_number": "Civil Appeal No. 217 of 1959",
    "date_of_judgment": "1959-11-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The second respondent, M/s. Jammu Kashmir Mechanics And Transport Workers Co-operative Society Limited (the Society), was registered under the Jammu and Kashmir Co-operative Societies Act No. 6 of 1993 (Vikrami).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Society put in a number of applications before the third appellant for the grant of stage carriage and public carrier permits for various routes in the State of Jammu and Kashmir.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "No permits were granted to the Society on the ground that under r. 4-47 of the Jammu and Kashmir Motor Vehicle Rules (the Rules), service licence could only be issued to a person or a company registered under the Partnership Act and that, as the Society was neither a person nor a partnership, it was not entitled to a licence under the Rules.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The respondents filed a petition in the High Court of Jammu and Kashmir under S. 103 of the Constitution of Jammu and Kashmir challenging the vires of r. 4-47 of the Rules. The appellants herein (Government of Jammu and Kashmir State, the Transport Minister, the Registering Authority and the Traffic Superintendent) were made party-respondents.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The High Court held that the said rule was ultra vires as offending Art. 14 of the Constitution and directed a writ of mandamus to issue against the appellants from enforcing the provisions of the said rule.",
      "type": "material",
      "date": "1958-06-20",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The appellants filed an application in the High Court for a certificate under Art. 132(1) of the Constitution which was rejected on the ground that no substantial question of law as to the interpretation of the Constitution was involved in the case.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The appellants applied to this Court for special leave under Art. 132(2) of the Constitution, which was granted with liberty to the respondents to raise the question of maintainability of the appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the case involves a substantial question of law as to the interpretation of the Constitution so as to attract special leave under Art. 132(2), particularly whether a question of reasonable classification under Art. 14 constitutes interpretation of the Constitution.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether r. 4-47 of the Jammu and Kashmir Motor Vehicle Rules is based on reasonable classification and intra vires Art. 14.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Whenever a question of classification is raised, it involves the interpretation of Art. 14 of the Constitution with reference to the impugned classification; whether a registered firm, a limited company and a person have equal attributes is a question of interpretation of Art. 14.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "Art. 14 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "The impugned rule 4-47 is based upon reasonable classification having intelligible differentia (marked difference between corporate body and partnership, local conditions), rational and not discriminatory.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Art. 14 of the Constitution (doctrine of reasonable classification)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Under Art. 132(2), special leave can be given only if the Supreme Court is satisfied that the case involves a substantial question of law as to the interpretation of the Constitution; interpretation of Art. 14 is well-settled by series of decisions, no question arises.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Art. 132(2) of the Constitution"
    },
    {
      "id": "ra2",
      "text": "The rule discriminates against co-operative societies/corporations, does not proceed on rational basis of classification, arbitrarily singles out corporation for discriminatory treatment, offends Art. 14.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Art. 14 of the Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "There was no controversy between the parties in regard to the interpretation of Art. 14; dispute centered only on whether the impugned rule stood the test of reasonable classification.",
      "addresses_issue": "i1",
      "key_observation": "Parties agree on interpretation of Art. 14 and doctrine of classification; no question of interpretation arises."
    },
    {
      "id": "cr2",
      "text": "Interpretation means method by which true sense of words understood; arises only if conflicting constructions placed on provision. Where parties agree or do not raise question, no interpretation issue.",
      "addresses_issue": "i1",
      "key_observation": "Art. 132(2) requires substantial question of law as to interpretation; final authority on Constitution rests with Supreme Court."
    },
    {
      "id": "cr3",
      "text": "Doctrine of classification under Art. 14 settled by series of decisions; question here is application to facts, not interpretation.",
      "addresses_issue": "i1",
      "key_observation": "Substantial question cannot arise where law authoritatively decided."
    },
    {
      "id": "cr4",
      "text": "Even if question of interpretation, not substantial as guidance already furnished by prior decisions like Budhan Choudhry.",
      "addresses_issue": "i1",
      "key_observation": "Restatement of settled law."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The question raised does not involve any question of law as to the interpretation of the Constitution, much less a substantial question.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "M. Krishnaswami Pillai v. Governor General in Council",
      "citation": "1947 52 C.W.N. F.R. 1",
      "treatment": "relied on",
      "relevance": "No substantial question of law as to interpretation where guidance already furnished by prior decision."
    },
    {
      "case_name": "Bhudan Choudhury v. The State of Bihar",
      "citation": "1955 1 S.C.R. 1045",
      "treatment": "relied on",
      "relevance": "Explains Art. 14: forbids class legislation but permits reasonable classification based on intelligible differentia with rational relation to object."
    },
    {
      "case_name": "Chiranjit Lal Chowdhuri v. Union of India",
      "citation": "1950 S.C.R. 869",
      "treatment": "relied on",
      "relevance": "Evolves doctrine of classification under Art. 14."
    },
    {
      "case_name": "Ram Krishna Dalmia v. Justice Tendolkar",
      "citation": "1959 S.C.R. 279",
      "treatment": "relied on",
      "relevance": "Reaffirms principles of reasonable classification under Art. 14."
    },
    {
      "case_name": "Mohammad Haneef Quayeshi v. State of Bihar",
      "citation": "1959 S.C.R. 629",
      "treatment": "relied on",
      "relevance": "Reaffirms principles of reasonable classification under Art. 14."
    },
    {
      "case_name": "Secretary of State for India v. I.M. Lall",
      "citation": "1945 F.C.R. 103",
      "treatment": "referred",
      "relevance": "Prior guidance on interpretation in Krishnaswami Pillai case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14",
        "Article 132"
      ],
      "relevance": "Art. 14 on equality and reasonable classification; Art. 132(2) on special leave for substantial question of constitutional interpretation."
    },
    {
      "name": "Constitution of Jammu and Kashmir",
      "sections": [
        "Section 103"
      ],
      "relevance": "Basis for writ petition in High Court."
    },
    {
      "name": "Jammu and Kashmir Co-operative Societies Act",
      "sections": [
        "No. 6 of 1993 (Vikrami)"
      ],
      "relevance": "Under which Society was registered."
    },
    {
      "name": "Jammu and Kashmir Motor Vehicle Rules",
      "sections": [
        "Rule 4-47"
      ],
      "relevance": "Impugned rule restricting licences to persons or partnerships; held ultra vires by High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court upheld the preliminary objection to maintainability, holding that no substantial question of law as to the interpretation of the Constitution was involved under Art. 132(2), as the dispute was only on application of settled Art. 14 principles to facts.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The principle underlying Art. 132(2) of the Constitution is that the final authority of interpreting the Constitution must rest with the Supreme Court.",
      "speaker": "court",
      "significance": "Explains purpose and scope of Art. 132(2)."
    },
    {
      "text": "Interpretation is the method by which the true sense or the meaning of the word is understood... Where the parties agree as to the true interpretation... the case does not involve any question of law as to the interpretation of the Constitution.",
      "speaker": "court",
      "significance": "Defines 'interpretation' for Art. 132(2); key to holding."
    },
    {
      "text": "A substantial question of law cannot arise where that law has been finally and authoritatively decided by this Court.",
      "speaker": "court",
      "significance": "Reason for rejecting substantiality of question."
    }
  ],
  "_case_id": "1959_158",
  "_label": 0,
  "_text_length": 17429,
  "_extracted_at": "2026-02-10T19:38:21.031897"
}