{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Firm of manufacturers of perfumery and hair oils at Ratlam",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur J."
    ],
    "case_number": "Civil Appeal No. 373 of 1957",
    "date_of_judgment": "1959-05-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents are a registered firm of manufacturers of perfumery and hair oils at Ratlam in Madhya Bharat, a Part B State, and their goods are sold throughout India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Assessed for assessment year 1950-51 at rates applicable to income arising in Part A States.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Course of business: sent out agents to various parts of India to canvass orders and sometimes take advance payments in full or part; after deducting expenses, remitted balance to respondents at Ratlam through bank drafts etc.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Goods sent to customers either by V.P.P. or by rail; in rail case, Railway Receipts in favour of self sent through Bank deliverable against payment of Demand Draft drawn on buyers.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Income-tax Officer held major quantity supplied to Part A/C States, sales effected there, payments received there; assessed estimated profit of Rs. 1,60,340 on sales of Rs. 5,09,424 without concessional rebate for Part B States.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Assessee's banker was Bank of India Ltd., Bombay; sale proceeds mainly realised through this Bank.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On appeal, Appellate Asst. Commissioner reduced estimated profit by Rs. 20,000.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Income-tax Appellate Tribunal reduced total income from Part A/C States to Rs. 2,85,376; found income through Post Office (V.P.P.) Rs. 1,23,710 and by rail/Bank drafts Rs. 2,85,376, total Rs. 4,21,955.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Tribunal held advances received with orders and price of V.P.P. goods received at Ratlam (not Part A/C); bank drafts received at Ratlam but sent to Bombay banker for cashing, so received in Part A State (Rs. 2,85,376).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Tribunal referred to Kirloskar Bros. Ltd. v. CIT and distinguished facts.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Both parties applied for reference to High Court under s.66(1) Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "High Court judgment and decree dated September 20, 1955, in Civil Misc. Case No. 40 of 1954, answered both questions in favour of assessees and gave certificate.",
      "type": "procedural",
      "date": "1955-09-20",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the receipt of sale proceeds at Ratlam which included the assessee's profits in respect of goods sent by the assessee to customers in Part A or C States by V.P.P. amounted to receipts of income, profits or gains at Ratlam in Part B States?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the bank drafts payable in Part A or C States but received at Ratlam and encashed through the assessee's bankers at Bombay constituted receipts in Part A State?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether on the facts and circumstances of this case the payment received from a buyer by a banker in Part A or C States against delivery of Railway Receipt for goods sent by the seller is payment in these States or in Ratlam which was a Part B State.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sale proceeds to the extent of Rs. 2,85,376 were received at Bombay as per printed advice to bankers to hand over goods against payment of demand draft.",
      "supporting_facts": [
        "f4",
        "f6",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Judgment in CIT v. Ogale Glass Works Ltd. applies; Post Office was agent of assessee.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "CIT v. Ogale Glass Works Ltd. (1955) 1 SCR 185"
    },
    {
      "id": "ra2",
      "text": "Respondents delivered goods to Post Office at instance of buyer; Post Office acted as bailee for transmission.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "The Badische Anilin Und Soda Fabrik v. The Basle Chemical Works (1898) AC 200"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under V.P.P. system, Post Office is agent of seller for recovery of price; payment to Post Office is payment to seller at place of delivery (Part A/C States); seller retains control until payment; falls under s.25 Sale of Goods Act (conditional appropriation).",
      "addresses_issue": "i1",
      "key_observation": "Income in respect of V.P.P. goods received in Part A/C States, not Ratlam."
    },
    {
      "id": "cr2",
      "text": "Ogale Glass Works principle has no application as it did not deal with sale of goods or receipt of price against delivery.",
      "addresses_issue": "i1",
      "key_observation": "Distinguished Ogale Glass Works."
    },
    {
      "id": "cr3",
      "text": "For rail despatches, Railway Receipts sent with demand drafts; delivered only on payment; conditional appropriation under s.25 Sale of Goods Act; performed in Part A/C States where payment to Bank as agent of seller.",
      "addresses_issue": "i3",
      "key_observation": "Income received in Part A/C States, not Ratlam."
    },
    {
      "id": "cr4",
      "text": "Kirloskar Bros. facts different; here bankers hand over goods against demand draft, not unconditional discharge.",
      "addresses_issue": "i2",
      "key_observation": "Agreed with AAC that Rs. 2,85,376 received at Bombay."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Receipt of sale proceeds for V.P.P. goods to Part A/C States amounted to receipt of income in Part A/C States, not Ratlam (Part B).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Bank drafts received at Ratlam but encashed through Bombay bankers constituted receipts in Part A State.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Payments received by banker in Part A/C States against delivery of Railway Receipts are payments in those States, not Ratlam.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "Respondents not entitled to concessional rate of taxation applicable to Part B States.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kirloskar Bros. Ltd. v. Commissioner of Income-tax",
      "citation": "1952 21 I.T.R. 82",
      "treatment": "distinguished",
      "relevance": "Tribunal distinguished facts; not unconditional discharge."
    },
    {
      "case_name": "Commissioner of Income-tax v. Ogale Glass Works Ltd.",
      "citation": "1955 1 S.C.R. 185",
      "treatment": "distinguished",
      "relevance": "Principle has no application to sale of goods or receipt of price against delivery."
    },
    {
      "case_name": "Mothi Rungaya Chetty v. The Secretary of State for India",
      "citation": "1904 I.L.R. 28 Mad. 213",
      "treatment": "followed",
      "relevance": "Post Office failing to recover price liable in damages to seller."
    },
    {
      "case_name": "Mirabita v. Imperial Ottoman Bank",
      "citation": "1878 3 Ex. D. 164",
      "treatment": "followed",
      "relevance": "If seller sends with direction not to deliver till payment, appropriation conditional; property does not pass till price paid."
    },
    {
      "case_name": "The Parchim",
      "citation": "1918 A.C. 1157",
      "treatment": "followed",
      "relevance": "Goods pass at place where price is paid."
    },
    {
      "case_name": "The Badische Anilin Und Soda Fabrik v. The Basle Chemical Works",
      "citation": "1898 A.C. 200",
      "treatment": "distinguished",
      "relevance": "No control over goods till price paid or conditional delivery; not about passing of ownership."
    },
    {
      "case_name": "Narain Swadeshi Weaving Mills v. The Commissioner of Excess Profits Tax",
      "citation": "1955 1 S.C.R. 952",
      "treatment": "followed",
      "relevance": "Reframed question as done in this case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "s. 66(1)"
      ],
      "relevance": "Reference by Tribunal to High Court."
    },
    {
      "name": "Indian Sale of Goods Act",
      "sections": [
        "s. 25"
      ],
      "relevance": "Seller reserves right of disposal until conditions fulfilled; conditional appropriation; property does not pass till price paid."
    },
    {
      "name": "Indian Contract Act",
      "sections": [
        "s. 148"
      ],
      "relevance": "Bailee to deal with goods according to directions of bailor; receives price on behalf of seller."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; both questions answered in favour of Commissioner; income, profits and gains from V.P.P. and rail despatches to Part A/C States received there, not at Ratlam; respondents not entitled to concessional Part B rates.",
    "relief_granted": "Reversal of High Court judgment in favour of Commissioner.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Post Office is an agent for the seller and receives the price from the buyer at the place of delivery for transmission to the seller.",
      "speaker": "court",
      "significance": "Determines place of receipt of income under V.P.P."
    },
    {
      "text": "Under the V.P.P. system the seller retains control over the goods right up to the time the goods are delivered to the buyer against payment of price.",
      "speaker": "court",
      "significance": "Explains conditional appropriation under s.25 Sale of Goods Act."
    },
    {
      "text": "The income in the present case was therefore received in Part A or Part C States and not in Ratlam.",
      "speaker": "court",
      "significance": "Core holding on place of income receipt."
    }
  ],
  "_case_id": "1959_129",
  "_label": 1,
  "_text_length": 15242,
  "_extracted_at": "2026-02-10T19:37:22.367943"
}