{
  "metadata": {
    "case_name": "Corporation of the City of Nagpur v. Its Employees",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Civil Appeals Nos. 143 and 144 of 1959 and 545 of 1958",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is the Corporation of the City of Nagpur constituted under the City of Nagpur Corporation Act, 1948 (Madhya Pradesh Act No. 2 of 1950).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Disputes arose between the Corporation and the employees in various departments in respect of wage scales, gratuity, provident fund, house rent, confirmation, allowances etc.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Government of the State of Madhya Pradesh by order dated October 23, 1956, referred the disputes under s. 39 of the C.P. Berar Industrial Disputes Settlement Act, 1947 to the State Industrial Court, Nagpur, numbered as Industrial Reference No. 18 of 1956.",
      "type": "procedural",
      "date": "1956-10-23",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant filed a statement before the Industrial Court inter alia on the ground that the Corporation was not an industry as defined by the Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "On February 13, 1957, the Industrial Court made a preliminary order holding that the Corporation was an industry and that whether any department was an industry would be decided on evidence.",
      "type": "procedural",
      "date": "1957-02-13",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellant challenged the preliminary order by petition under Art. 226 in High Court of Bombay at Nagpur, but petition dismissed as award made before hearing.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "On June 3, 1957, Industrial Court made award holding Corporation an industry, all departments covered, revised pay scales, accepted major demands.",
      "type": "procedural",
      "date": "1957-06-03",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "On July 15, 1957, appellant filed petition in High Court at Nagpur questioning award.",
      "type": "procedural",
      "date": "1957-07-15",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Division Bench of High Court by order dated September 11, 1957 rejected contention Corporation not industry, remanded to Industrial Court to decide which departments' activities fall within definition and restrict award.",
      "type": "procedural",
      "date": "1957-09-11",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On remand, Industrial Court scrutinized departments, held all except (i) assessment and levy of house-tax, (ii) assessment and levy of octroi, (iii) removal of encroachment and pulling down dilapidated houses, (iv) prevention and control of food adulteration, (v) maintenance of cattle pounds, covered by definition.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant filed Civil Appeal No. 143 of 1959 by special leave against Industrial Court award, and Civil Appeal No. 144 of 1959 against High Court order.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Civil Appeal No. 545 of 1958 arises from reference Industrial Reference No. 1 of 1957 re disputes in Fire Brigade Department.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Industrial Court heard both references together, award on Dec 14, 1957 in Ref No.1/1957 held Fire Brigade industry.",
      "type": "procedural",
      "date": "1957-12-14",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "List of 22 departments of Nagpur City Corporation provided.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether and to what extent the activities of the Corporation of the City of Nagpur come under the definition of industry in s. 2(14) of the C.P. Berar Industrial Disputes Settlement Act, 1947.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether services rendered by Corporation must be analogous to business or trade to satisfy definition.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether activities must partake common characteristics of industry.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No service rendered by the Corporation would be an industry as defined by s. 2(14) of the Act.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": "s. 2(14) C.P. Berar Industrial Disputes Settlement Act, 1947"
    },
    {
      "id": "pa2",
      "text": "Assuming some services comprehended, they must be analogous to a business or trade.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Activities must partake common characteristics of industry: (i) production/distribution of goods/services, (ii) serve others not self, (iii) cooperative effort employer-employee, (iv) commercial transaction, (v) not purely governmental.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Finding of Industrial Court that various departments are industries incorrect as services do not satisfy tests.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "First question settled by precedents: municipal undertakings can be industry; differences in definitions do not warrant different view.",
      "addresses_issue": "i1",
      "key_observation": "Service by corporation complying with conditions implicit in definition is industry."
    },
    {
      "id": "cr2",
      "text": "Activity need not share common characteristics unless implicit in definition; words clear and wide; noscitur a sociis not applicable as intention clear.",
      "addresses_issue": "i2",
      "key_observation": "Definition comprehensive, includes calling, service, employment without narrow restriction."
    },
    {
      "id": "cr3",
      "text": "Regal/sovereign functions excluded: primary and inalienable like legislation, justice, law enforcement; corporation's delegated regal functions excluded.",
      "addresses_issue": "i1",
      "key_observation": "Corporation has dual role: governmental (excluded) and business-like (included)."
    },
    {
      "id": "cr4",
      "text": "Not limited to trade/business; if service by individual is industry, same by corporation is; no need for profit/quid pro quo; organized activity with employer-employee relation.",
      "addresses_issue": "i2",
      "key_observation": "Tests: organized, not personal; non-regal; if private can do, corporation can."
    },
    {
      "id": "cr5",
      "text": "Predominant nature of department determines; integrated activities not separable arbitrarily.",
      "addresses_issue": "i3",
      "key_observation": "Admin/financial depts connected to industrial activity included if primary concern."
    },
    {
      "id": "cr6",
      "text": "Department-wise analysis: Tax Dept (predominantly water/scavenging rates), Public Conveyance, Fire Brigade, Lighting, Water Works, City Engineer, Enforcement Encroachment, Sewage, Health, Market, Gardens, Public Works, Assessment, Estate, Education, Printing Press, Building, General Admin - all industries except the five excluded by Industrial Court.",
      "addresses_issue": "i1",
      "key_observation": "Services satisfy definition and tests; statutory powers incidental, not changing nature."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Definition of industry very comprehensive; excludes regal functions; if service by private is industry, by corporation is; predominant function test for mixed depts.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "All departments except the five specified (house-tax, octroi, encroachment removal, food adulteration, cattle pounds) are industries; employees in connected depts entitled to benefits.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "N. Banerji v. P. K. Mukherjee",
      "citation": "1953 S.C.R. 302",
      "treatment": "followed",
      "relevance": "Municipal conservancy service is industry under Industrial Disputes Act."
    },
    {
      "case_name": "Baroda Borough Municipality v. Its Workmen",
      "citation": "1957 S.C.R. 33",
      "treatment": "followed",
      "relevance": "Municipal electricity undertaking is industry."
    },
    {
      "case_name": "State of Bombay v. Hospital Mazdoor Sabha",
      "citation": null,
      "treatment": "referred",
      "relevance": "Considered noscitur a sociis and characteristics of industry."
    },
    {
      "case_name": "Coomber v. Justices of Berks",
      "citation": "1883-84 9 App. Cas. 61",
      "treatment": "followed",
      "relevance": "Primary and inalienable functions of government."
    },
    {
      "case_name": "Federated State School Teachers Association of Australia v. State of Victoria",
      "citation": "1929 41 C.L.R. 569",
      "treatment": "followed",
      "relevance": "Regal vs non-regal functions."
    },
    {
      "case_name": "Country Council of Middlesex v. Assessment Committee of St. Georges Union",
      "citation": "1896 2 Q.B.D. 143",
      "treatment": "referred",
      "relevance": "Distinction between municipal and justice administration premises."
    },
    {
      "case_name": "Verisimo Vasquez Vilas v. City of Manila",
      "citation": "220 U.S. 345",
      "treatment": "followed",
      "relevance": "Dual character of municipal corporation: governmental and private."
    },
    {
      "case_name": "Federated Municipal and Shire Council Employees Union of Australia v. Melbourne Corporation",
      "citation": "1918-19 26 C.L.R. 508",
      "treatment": "followed",
      "relevance": "Municipal street works subject to industrial disputes; modern concept of industry."
    },
    {
      "case_name": "Federated Engine Drivers and Firemens Association of Australia v. Broken Hill Proprietary Company Limited",
      "citation": null,
      "treatment": "referred",
      "relevance": "Distinction trading/non-trading operations."
    }
  ],
  "statutes_cited": [
    {
      "name": "C.P. Berar Industrial Disputes Settlement Act, 1947",
      "sections": [
        "s. 2(14)",
        "s. 39"
      ],
      "relevance": "Definition of industry; reference of disputes."
    },
    {
      "name": "City of Nagpur Corporation Act, 1948 (Madhya Pradesh Act No. 2 of 1950)",
      "sections": [
        "s. 7",
        "s. 6",
        "s. 57",
        "s. 58",
        "s. 79",
        "s. 333"
      ],
      "relevance": "Constitution and powers of Corporation; obligatory/discretionary duties."
    },
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 2(j)"
      ],
      "relevance": "Comparative definition of industry."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Writ petition against preliminary order."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Court upheld that most departments of the Corporation are industries under s.2(14), agreed with Industrial Court exclusion of five departments, employees entitled to benefits under the Act; no need to detail reliefs as not turning on them; employees did not appeal exclusions.",
    "relief_granted": "Employees in covered departments entitled to benefits of the Act",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The definition of industry in the Act is very comprehensive. It is in two parts One part defines it from the standpoint of the employer and the other from the standpoint of the employee.",
      "speaker": "court",
      "significance": "Core holding on scope of definition."
    },
    {
      "text": "If a service rendered by an individual or a private person would be an industry, it would equally be an industry in the hands of a corporation.",
      "speaker": "court",
      "significance": "Key test for municipal activities."
    },
    {
      "text": "Regal functions described as primary and inalienable functions of State though statutorily delegated to a corporation are necessarily excluded from the purview of the definition.",
      "speaker": "court",
      "significance": "Exclusion criterion."
    }
  ],
  "_case_id": "1959_47",
  "_label": 0,
  "_text_length": 63507,
  "_extracted_at": "2026-02-10T19:36:47.042715"
}