{
  "metadata": {
    "case_name": "Additional Collector, Banaras v. Respondent (Proprietor of Semapur Estate)",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": "Civil Appeal No. 298 of 1955",
    "date_of_judgment": "1959-03-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent was the proprietor of landed properties in the United Provinces and was entitled to claim relief under the United Provinces Encumbered Estates Act, 1934.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1926 and 1927, the respondent created several mortgages on his properties in favour of the Allahabad Bank, the Banaras Bank and a person called Kalia, for very large sums.",
      "type": "material",
      "date": "1926-1927",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1929, the Banaras Bank filed a suit against the respondent in the Court of the Additional Sub-Judge, Banaras, in the United Provinces for enforcement of its mortgage making the other creditors parties to the suit. A decree was passed giving the creditors priority in a certain order.",
      "type": "procedural",
      "date": "1929",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Allahabad Bank, not being satisfied with the order of priority, filed an appeal in the High Court at Allahabad which was decided in its favour.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "While the appeal was pending, the respondent applied to the Collector of Banaras for relief under the United Provinces Encumbered Estates Act, 1934.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The procedure laid down in the Act was duly followed and on March 21, 1940, the Special Judge of Banaras passed three money decrees in favour of the three creditors in a certain order of priority. The total amount of such decrees came nearly to rupees nine lacs.",
      "type": "procedural",
      "date": "1940-03-21",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Special Judge sent the decrees to the Collector of Banaras for execution as required by the Act. The execution of the decrees was thereafter commenced by the Additional Collector, Banaras under the provisions of the Act against the properties in the United Provinces.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The respondent owns an estate in the district of Purnea in Bihar, called the Semapur estate.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Additional Collector, Banaras, applied to the Additional Civil Judge, Banaras, for transmission of the said decrees to the Court of the Subordinate Judge, Purnea for execution and an order for transmission was made on January 4, 1947.",
      "type": "procedural",
      "date": "1947-01-04",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On March 17, 1947, the Additional Collector, Banaras, applied to the Subordinate Judge, Purnea, as the transferee Court to execute the decrees by attachment and sale of the Semapur estate. The Subordinate Judge made an order directing execution to issue.",
      "type": "procedural",
      "date": "1947-03-17",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The respondent preferred an appeal to the High Court at Patna from the order of the Subordinate Judge, Purnea, dated January 25, 1949, in Misc. Case No. 54 of 1947. The appeal (Appeal from Original Order No. 90 of 1949) was allowed by judgment and order dated April 28, 1953.",
      "type": "procedural",
      "date": "1949-01-25",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The present appeal to the Supreme Court is by the Additional Collector, Banaras against the order of the Patna High Court dated April 28, 1953.",
      "type": "procedural",
      "date": "1953-04-28",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The Additional Collector is empowered under Sections 14 and 14A of the United Provinces Land Revenue Act, 1901, to exercise powers of the Collector including work of sale and execution under the Encumbered Estates Act.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Powers of Special Judge under the Act were conferred on the Court of the Additional Subordinate Judge, Banaras (later Additional Civil Judge) by U.P. Government notification No. 767-Rev. published October 12, 1935.",
      "type": "background",
      "date": "1935-10-12",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Execution proceedings have continuously been pending since the decree was sent to the Collector, with execution against UP properties ongoing by Additional Collector Banaras.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Subordinate Judge, Purnea, had jurisdiction to order execution of the decree transferred to him.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the order of transfer of the decree was invalid because it was not made on the application of the decree-holder (Collector) but by the Additional Collector.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the order of transfer was invalid because it was made by the Additional Civil Judge, Banaras, and not by the Special Judge who passed the decree.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether the decree was barred by limitation under Article 182 of the Limitation Act before the order for its transfer.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Subordinate Judge, Purnea had no jurisdiction because the decree was not a decree under the Code of Civil Procedure but only deemed so under s.14(7) of the U.P. Act, which cannot have extra-territorial operation outside United Provinces.",
      "supporting_facts": [
        "f6",
        "f9",
        "f10"
      ],
      "legal_basis": "United Provinces Encumbered Estates Act, 1934 s.14(7); Code of Civil Procedure"
    },
    {
      "id": "ra2",
      "text": "The order of transfer was invalid under s.39 CPC as it was not made on application of the decree-holder (Collector under s.24(3) of the Act) but by Additional Collector.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "United Provinces Encumbered Estates Act, 1934 s.24(3); Code of Civil Procedure s.39"
    },
    {
      "id": "ra3",
      "text": "The transfer order was invalid as under s.39 CPC it could only be made by the court which passed the decree (Special Judge), but was made by Additional Civil Judge.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "United Provinces Encumbered Estates Act, 1934 s.14; Code of Civil Procedure s.39"
    },
    {
      "id": "ra4",
      "text": "The decree was barred by limitation under Art.182 Limitation Act long before the transfer order.",
      "supporting_facts": [
        "f9",
        "f15"
      ],
      "legal_basis": "Limitation Act Art.182"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No extra-territorial operation issue; s.14(7) makes decree a CPC decree within UP, transferable under s.39 CPC to outside court; transferee court applies UP Act to UP-passed decree without extra-territorial effect.",
      "addresses_issue": "i1",
      "key_observation": "Execution outside UP is result of CPC (central law), not UP Act."
    },
    {
      "id": "cr2",
      "text": "Additional Collector exercises Collector's powers under U.P. Land Revenue Act ss.14,14A; entrusted with execution/sale under Encumbered Estates Act; thus competent as decree-holder.",
      "addresses_issue": "i2",
      "key_observation": "Additional Collector deemed to be the Collector for execution purposes."
    },
    {
      "id": "cr3",
      "text": "Powers of Special Judge conferred on Additional Civil Judge's court; same court; order irregularity does not invalidate; Special Judge deemed CPC court passing decree, empowered to transfer under s.39 CPC and s.24(3).",
      "addresses_issue": "i3",
      "key_observation": "Special Judge acts as civil court."
    },
    {
      "id": "cr4",
      "text": "Execution continuously pending since decree sent to Collector; Purnea execution is continuation; no fresh application under Art.182; right to continue pending execution arises day to day, no limitation bar.",
      "addresses_issue": "i4",
      "key_observation": "Collector's execution deemed CPC execution; application continues it."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Subordinate Judge, Purnea, had jurisdiction to execute the transferred decree.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Order of transfer valid; Additional Collector competent as decree-holder.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Transfer order by Additional Civil Judge valid as same court as Special Judge.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "No limitation bar; execution in Purnea is continuation of pending execution by Collector.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kedar Nath Dutt v. Harra Chand Dutt",
      "citation": "1882 I.L.R. 8 Cal. 420",
      "treatment": "followed",
      "relevance": "Right to continue pending proceeding arises day to day; no limitation bar."
    },
    {
      "case_name": "Subba Chariar v. Muthuveeran Pillai",
      "citation": "1912 I.L.R. 36 Mad. 553",
      "treatment": "followed",
      "relevance": "Right to continue pending proceeding arises day to day; no limitation bar."
    }
  ],
  "statutes_cited": [
    {
      "name": "United Provinces Encumbered Estates Act, 1934 (U.P. XXV of 1934)",
      "sections": [
        "3",
        "4",
        "6",
        "7",
        "8",
        "9",
        "10",
        "11",
        "14",
        "14(7)",
        "19",
        "24(3)",
        "Chapter V"
      ],
      "relevance": "Governs application for relief, stay of proceedings, adjudication by Special Judge, deemed decrees, execution by Collector within/outside UP."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "39",
        "60"
      ],
      "relevance": "Transfer of decree for execution; powers in execution; decree executable thereunder."
    },
    {
      "name": "United Provinces Land Revenue Act, 1901",
      "sections": [
        "14",
        "14A"
      ],
      "relevance": "Appointment and powers of Collector and Additional Collector."
    },
    {
      "name": "Limitation Act",
      "sections": [
        "Article 182"
      ],
      "relevance": "Limitation for execution applications; held inapplicable to continuation of pending execution."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal succeeds. The order of the Patna High Court is set aside and the order of the Subordinate Judge, Purnea directing execution is restored.",
    "relief_granted": "Execution against Semapur estate permitted",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "No question of any extra-territorial application of the United Provinces Act either directly or indirectly, arises in this case.",
      "speaker": "court",
      "significance": "Rejects core respondent argument on jurisdiction."
    },
    {
      "text": "We think therefore that this appeal must succeed. We set aside the order of the High Court and restore the order of the Subordinate Judge, Purnea.",
      "speaker": "court",
      "significance": "Final disposition of the appeal."
    },
    {
      "text": "It is quite clear that if the application for execution with which we are concerned was made in a pending execution proceeding, no question of the application of art. 182 arises.",
      "speaker": "court",
      "significance": "Key to rejecting limitation argument."
    }
  ],
  "_case_id": "1959_145",
  "_label": 1,
  "_text_length": 21352,
  "_extracted_at": "2026-02-10T19:37:40.570593"
}