{
  "metadata": {
    "case_name": "Legal Representatives of Mangilal v. Shrimati Lilabai",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 239 of 1955",
    "date_of_judgment": "1959-01-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent Shrimati Lilabai w/o Vrijpalji filed suit for specific performance of contract to lease or in alternative damages and declaration against defendant 2 that she has no right, title or interest in the property.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "Defendant 1 Mangilal executed instrument Ex. P-1 in favour of respondent, contracting to lease to her in perpetuity in occupancy right his four khudkasht lands admeasuring 95.19 acres in Mouza Mohammadpur in consideration of debt of Rs. 8,700. If debt not repaid by June 1, 1944, contract of lease operative from that date.",
      "type": "material",
      "date": "1944-06-01",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Defendant 1 did not repay loan by stipulated date June 1, 1944, and ignored repeated demands to perform contract.",
      "type": "material",
      "date": "1944-06-01",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Respondent ready and willing to perform agreement and accept deed of lease in lieu of Rs. 8,700.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Defendant 1 guilty of gross delay causing loss of benefit of lease and consequent damage; claimed Rs. 2,340 compensation or alternatively damages Rs. 11,080.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Defendant 2 Mst. Durgabai, daughter of defendant 1, setting up own title; filed written statement contesting declaration but did not appear, trial ex parte against her.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Defendant 1 denied receipt of consideration, pleaded Ex. P-1 bogus, sham, collusive to shield property from creditors, not intended to be acted upon; if genuine, agreement to lease under s. 27 Indian Registration Act, unregistered hence inadmissible.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Trial court (Additional District Judge, Wardha, Civil Suit No. 9-A of 1946) found against defendant 1 on all issues; decreed defendant 1 to execute lease-deed in occupancy right, put respondent in possession; Rs. 2,316 compensation; declaration against defendant 2. Dated 12th August, 1947.",
      "type": "procedural",
      "date": "1947-08-12",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Defendant 1 appealed to Nagpur High Court (First Appeal No. 118 of 1947); pending appeal, defendant 1 died, widow and minor son (appellants) on record as legal representatives.",
      "type": "procedural",
      "date": "1953-11-30",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "High Court held document supported by consideration, not agreement to lease under s. 27, no registration required, admissible; confirmed trial court decree, dismissed appeal. Dated 30th November, 1953.",
      "type": "procedural",
      "date": "1953-11-30",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellants applied for leave to appeal to Supreme Court; High Court granted certificate as construction of document of title substantial question of law.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Is the document Ex. P-1 an agreement to lease under s. 27 of the Indian Registration Act?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If not, does it require registration under s. 17 of the said Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Document Ex. P-1 bogus, sham, collusive, brought into existence to shield property from creditors, not intended to be acted upon.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No receipt of consideration.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "If genuine, it is an agreement to lease under s. 27 Indian Registration Act, unregistered hence inadmissible in evidence.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Indian Registration Act s. 27, s. 17"
    },
    {
      "id": "pa4",
      "text": "Document evidences grant of lease subject to condition, amounts to present demise; opening recitals show present giving of land and respondent becoming occupancy tenant.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Correctness of Privy Council in Hemanta Kumari Debi open to doubt; re-examine.",
      "supporting_facts": [],
      "legal_basis": "Hemanta Kumari Debi v. Midnapur Zamindari Co. Ltd."
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Document Ex. P-1 genuine, supported by consideration of Rs. 8,700 debt.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Not an agreement to lease under s. 27, does not require registration.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Indian Registration Act s. 27"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Agreement to lease under s. 27 must effect actual demise and operate as lease, creating present and immediate demise; mere agreement entitling claim for execution of lease without present demise not included.",
      "addresses_issue": "i1",
      "key_observation": "Follows Privy Council in Hemanta Kumari Debi v. Midnapur Zamindari; approves Jenkins C.J. in Panchanan Bose."
    },
    {
      "id": "cr2",
      "text": "All High Courts consistently construe agreement to lease as creating immediate present demise.",
      "addresses_issue": "i1",
      "key_observation": "Distinguishes Narayanan Chetty v. Muthiah Servai as not directly on point and not good law post Hemanta Kumari."
    },
    {
      "id": "cr3",
      "text": "S. 17(1) documents create immediate present demise; cl. (d) leases same, reading with T.P. Act s.105,107 which require registered instrument for certain leases transferring right to enjoy immediately.",
      "addresses_issue": "i1",
      "key_observation": "Instrument signed by lessor alone may be agreement to lease under s.27."
    },
    {
      "id": "cr4",
      "text": "Legislative history s.17(2)(v) excludes mere agreements not creating present interest.",
      "addresses_issue": "i1",
      "key_observation": "No difference between agreements to sell/lease; both may lead to specific performance without present demise."
    },
    {
      "id": "cr5",
      "text": "Ex. P-1: Executed by laymen, liberally construed. Purports receipt; says 'I have this day given... you have become occupancy tenant... enjoy from generation to generation... become owner from 1-6-1944... no right after that date... given in lieu of Rs.8700 subject to condition if not paid by 1-6-1944'.",
      "addresses_issue": "i1",
      "key_observation": "No present demise; contingent on non-repayment by 1-6-1944; no rent, no possession till then; agricultural year starts June."
    },
    {
      "id": "cr6",
      "text": "Distinguishes precedents like Purmananddas, Pool v Bentley, etc., as they had present terms like rent from specified date, possession.",
      "addresses_issue": "i1",
      "key_observation": "Precedents limited utility; construe on own terms."
    },
    {
      "id": "cr7",
      "text": "High Court right: Ex. P-1 not agreement to lease under s.27, no registration needed under s.17.",
      "addresses_issue": "i2",
      "key_observation": "Concurrent findings on other issues concluded."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Expression 'an agreement to lease' under s.27 covers only agreements creating present demise.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Ex. P-1 does not constitute agreement to lease under s.27, does not require registration under s.17.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hemanta Kumari Debi v. Midnapur Zamindari Co. Ltd.",
      "citation": "1919 L.R. 46 I.A. 240",
      "treatment": "followed",
      "relevance": "Agreement to lease must effect actual demise, present immediate interest; not mere promise to execute lease."
    },
    {
      "case_name": "Panchanan Bose v. Chandra Charan Misra",
      "citation": "1910 I.L.R. 37 Cal. 808",
      "treatment": "followed",
      "relevance": "No immediate interest created is not lease under s.17(d), falls under s.17(h); affirmed by Privy Council."
    },
    {
      "case_name": "Narayanan Chetty v. Muthiah Servai",
      "citation": "1912 I.L.R. 35 Mad. 63",
      "treatment": "distinguished",
      "relevance": "Full Bench held agreement to execute sub-lease registrable; not directly on construction of 'agreement to lease'; not good law post Hemanta Kumari."
    },
    {
      "case_name": "Swaminatha Mudaliar v. Ramaswami Mudaliar",
      "citation": "1921 I.L.R. 44 Mad. 399",
      "treatment": "referred",
      "relevance": "Did not follow Narayanan Chetty post Hemanta Kumari."
    },
    {
      "case_name": "Fati Chand Sahu v. Lilambar Singh Das",
      "citation": "1871 9 Beng. L.R. 433 (14 M.I.A. 129)",
      "treatment": "referred",
      "relevance": "Led to enactment of s.17(2)(v) excluding mere agreements to sell from registration."
    },
    {
      "case_name": "Purmananddas Jiwandas v. Dharsey Virji",
      "citation": "1886 I.L.R. 10 Bom. 101",
      "treatment": "distinguished",
      "relevance": "Lease to commence future date but rent from then, present demise."
    },
    {
      "case_name": "Pool v. Bentley",
      "citation": "1810 12 East. 168 (104 E.R. 66)",
      "treatment": "distinguished",
      "relevance": "Intention for present interest despite future formal lease; rent and possession immediate."
    },
    {
      "case_name": "Satyadhyan Tirtha Swami v. Raghunath Daji",
      "citation": "A.I.R. 1926 Bom. 384",
      "treatment": "distinguished",
      "relevance": "Documents showed present occupation and terms."
    },
    {
      "case_name": "Balram v. Mahadeo",
      "citation": "I.L.R. 1949 Nag. 849",
      "treatment": "distinguished",
      "relevance": "Receipt construed as present transfer of occupancy rights."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Registration Act, 1908",
      "sections": [
        "s. 2(7)",
        "s. 17(1)(d)",
        "s. 17(2)(v)",
        "s. 49"
      ],
      "relevance": "Defines lease to include agreement to lease; compulsory registration for leases creating present demise; exception for mere agreements not creating present interest."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "s. 105",
        "s. 107",
        "s. 4"
      ],
      "relevance": "Lease is transfer of right to enjoy; certain leases require registered instrument executed by both parties; supplemental to Registration Act."
    },
    {
      "name": "Central Provinces Land Revenue Act, 1917",
      "sections": [
        "s. 2"
      ],
      "relevance": "Agricultural year commences June 1."
    },
    {
      "name": "Code of Civil Procedure, 1882",
      "sections": [
        "s. 375"
      ],
      "relevance": "Decree reciting agreement terms."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court and trial court decrees; held Ex. P-1 not an agreement to lease under s.27 Registration Act, no registration required; appeal dismissed.",
    "relief_granted": "Specific performance: defendant 1 to execute lease-deed in occupancy right for lands, put respondent in possession; Rs. 2,316 compensation; declaration defendant 2 no right.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'an agreement to lease, which a lease is by the statute declared to include, must be a document which effects an actual demise and operates as a lease'.",
      "speaker": "court",
      "significance": "Defines scope of 'agreement to lease' under s.27 per Privy Council."
    },
    {
      "text": "Section 107 [TP Act] ... a lease ... can be made only under a registered instrument ... executed by both the lessor and the lessee.",
      "speaker": "court",
      "significance": "Explains why certain leases require registration; instrument by lessor alone may be mere agreement."
    },
    {
      "text": "'I have this day given to you, the land described below which is owned by me. Now you have become occupancy tenant of the same... You shall become the owner ... from date 1-6-1944.'",
      "speaker": "court",
      "significance": "Key terms of Ex. P-1 showing contingent, not present, demise."
    },
    {
      "text": "the expression an agreement to lease covers only such agreements as create a present demise.",
      "speaker": "court",
      "significance": "Core holding on construction."
    }
  ],
  "_case_id": "1959_162",
  "_label": 0,
  "_text_length": 29880,
  "_extracted_at": "2026-02-10T19:38:18.461828"
}