{
  "metadata": {
    "case_name": "Appellant v. Anant Prasad",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "SARKAR, J."
    ],
    "case_number": "Civil Appeal No. 284 of 1958",
    "date_of_judgment": "1959-04-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was holder of permit to run stage carriage on Rewa-Singrauli route in Vindhya Pradesh (now Madhya Pradesh), due to expire on December 11, 1955.",
      "type": "background",
      "date": "1955-12-11",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On September 12, 1955, appellant applied for renewal of permit for further period.",
      "type": "procedural",
      "date": "1955-09-12",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent Anant Prasad made representation against renewal of appellant's permit and applied for grant of permit to himself.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On December 9, 1955, State Transport Authority (STA), Vindhya Pradesh, ordered 'Renewed for three years', renewing appellant's permit; no express order on respondent's application.",
      "type": "procedural",
      "date": "1955-12-09",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondent appealed to Vindhya Pradesh Transport Appellate Tribunal against STA order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant contended before Tribunal that appeal was not competent; Tribunal rejected contention, cancelled appellant's permit, issued permit to respondent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant filed Misc. Civil Writ No. 27 of 1956 for writ of certiorari in Judicial Commissioners Court, Rewa, to quash Tribunal order; held appeal competent, writ dismissed on April 21, 1956.",
      "type": "procedural",
      "date": "1956-04-21",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Present appeal to Supreme Court against Judicial Commissioner's order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Did an appeal lie to the Appellate Tribunal from the order made by the State Transport Authority renewing appellant's permit and implicitly refusing respondent's application?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No appeal lay under s.64 as respondent not covered by cl.(e) or cl.(f); cannot imply refusal under cl.(a) because fresh applications cannot be considered until renewal objections disposed; ss.47,57,58 require renewal first.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Motor Vehicles Act, 1939 ss.47,57,58,64"
    },
    {
      "id": "pa2",
      "text": "Renewed permit is continuation of old; no consideration of new applications needed.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": "V. C. K. Bus Service Ltd. v. Regional Transport Authority, Coimbatore"
    },
    {
      "id": "pa3",
      "text": "Even if appeal competent under s.64(a), Tribunal cannot set aside renewal without foundation under cl.(f) as respondent not entitled to appeal under cl.(f).",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "s.64(f); Dholpur Co-operative Transport Etc. Union Ltd. v. Appellate Authority, Rajasthan; Nadar Transport case"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Right of appeal under s.64(a) as aggrieved by refusal to grant permit; STA order renewing appellant's implicitly refused respondent's application as only one permit available.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Motor Vehicles Act, 1939 s.64(a)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Respondent aggrieved by refusal under s.64(a) as STA order granting to appellant necessarily refused respondent's; no express refusal needed; agrees with S. Gopala Reddi case.",
      "addresses_issue": "i1",
      "key_observation": "Grant of permit to one automatically means refusal to other."
    },
    {
      "id": "cr2",
      "text": "No merit in priority argument; ss.47,57,58 do not prevent considering renewal and new applications together; s.58 requires renewal treated as new application, preference if equal.",
      "addresses_issue": "i1",
      "key_observation": "Applications heard together; STA had jurisdiction over respondent's application."
    },
    {
      "id": "cr3",
      "text": "Renewed permit not precluding new applications; VCK Bus case does not support.",
      "addresses_issue": "i1",
      "key_observation": "Authority can consider fresh along with renewal."
    },
    {
      "id": "cr4",
      "text": "In appeal under s.64(a), Tribunal can set aside renewal/grant; cl.(f) independent, does not restrict; no foundation needed under cl.(f); disagrees with Dholpur on this point.",
      "addresses_issue": "i1",
      "key_observation": "Appeal under cl.(a) effective; sets whole order at large."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appeal to Tribunal competent under s.64(a); order refusing permit implied; Tribunal could cancel renewal and grant to appellant.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "S. Gopala Reddi v. Regional Transport Authority, North Arcot",
      "citation": "1955 2 M.L.J. 130",
      "treatment": "followed",
      "relevance": "Identical facts; grant to one implies refusal to other; appeal under s.64(a) attacks renewal."
    },
    {
      "case_name": "V. C. K. Bus Service Ltd. v. Regional Transport Authority, Coimbatore",
      "citation": "1957 S.C.R. 663",
      "treatment": "referred",
      "relevance": "Renewed permit continuation of old, but does not preclude considering new applications with renewal."
    },
    {
      "case_name": "Dholpur Co-operative Transport Etc. Union Ltd. v. Appellate Authority, Rajasthan",
      "citation": "A.I.R. 1955 Rajasthan 19",
      "treatment": "distinguished",
      "relevance": "Disagrees that no jurisdiction to cancel grant without cl.(f) foundation in s.64(a) appeal."
    },
    {
      "case_name": "Nadar Transport, Tiruchirapalli v. State of Madras",
      "citation": null,
      "treatment": "referred",
      "relevance": "s.64(a) and (f) for different situations; appellate power not restricted."
    }
  ],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act, 1939",
      "sections": [
        "47",
        "57",
        "58",
        "64"
      ],
      "relevance": "Governs permits, appeals; s.64(a) allows appeal by aggrieved by refusal to grant; renewal applications treated as new under s.58; all heard together."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court held appeal to Tribunal was competent under s.64(a) of Motor Vehicles Act, 1939; affirmed Tribunal's cancellation of appellant's renewed permit and grant to respondent; dismissed appellant's appeal against Judicial Commissioner's dismissal of writ.",
    "relief_granted": "None to appellant; upheld grant to respondent.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The grant of a permit to one, would automatically mean the refusal of the permit to the other.\"",
      "speaker": "court",
      "significance": "Core reasoning for implied refusal under s.64(a)"
    },
    {
      "text": "\"Clause f deals with a case where an objection had been filed... Each is independent of the others.\"",
      "speaker": "court",
      "significance": "Cl.(f) does not restrict powers in cl.(a) appeal"
    },
    {
      "text": "\"The filing of the appeal by the appellant set at large the order of the Regional Transport Authority granting the renewal.\"",
      "speaker": "court",
      "significance": "Appeal under s.64(a) allows full review including renewal"
    }
  ],
  "_case_id": "1959_96",
  "_label": 0,
  "_text_length": 16371,
  "_extracted_at": "2026-02-10T19:37:18.882522"
}