{
  "metadata": {
    "case_name": "Appellant (Bhavnagar Textile Company) v. Commissioner of Income-tax",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "Justice Bhagwati"
    ],
    "case_number": "Civil Appeal No. 50 of 1957",
    "date_of_judgment": "1959-05-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a limited liability company manufacturing textile goods at Bhavnagar, an Indian State during assessment years 1943-44 and 1944-45; held to be non-resident, years of account being calendar years 1942 and 1943.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For assessment year 1943-44 (account year 1942), total sales Rs. 66,14,852; sale proceeds Rs. 35,92,157 held received in British India: Cheques from Supply Dept. Rs. 2,58,987; through Trikainlal Mahasukhram Rs. 20,24,190; other cheques on British India banks Rs. 13,08,980.",
      "type": "material",
      "date": "1942",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Income-tax Officer computed income at Rs. 27,11,136 proportionate to sales; held Rs. 14,72,267 received in British India under s.4(1)(a).",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "No dispute on sale proceeds through Trikainlal Mahasukhram.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "For assessment year 1944-45 (account year 1943), sale proceeds Rs. 16,72,693 (disputed as Rs. 12,97,631) by cheques from Supply Dept. on British India banks held taxable under s.4(1)(a).",
      "type": "disputed",
      "date": "1943",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellant contended amounts received at Bhavnagar by cheques drawn on British India banks.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Revenue contended payments by cheques received at Bhavnagar were received in British India where cheques cashed and honoured.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Appellant appealed to Appellate Assistant Commissioner (AAC), Ahmedabad; AAC confirmed ITO, held cheques not legal tender, receipt at Bhavnagar not receipt of money; actual payment by drawee banks.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Tribunal by consolidated order dated July 17, 1952, held cheques Rs. 2,58,987 and Rs. 13,08,980 (1943-44) and Rs. 12,97,631 (or verified figure) and Rs. 5,53,447 (1944-45) received at Bhavnagar; followed Bombay HC in Kirloskar Brothers Ltd. v. CIT.",
      "type": "procedural",
      "date": "1952-07-17",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Tribunal presumed letters containing cheques addressed to assessee at Bhavnagar; no evidence of registered office elsewhere.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Tribunal noted if SC reverses Kirloskar, enquiry needed if assessee's banks at Ahmedabad agents for collection.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Revenue never contended cheques not received at Bhavnagar due to posting in British India or post office as agent; only ground was encashment in British India.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Commissioner filed applications u/s 66(1) (Refs. 615 & 616 of 1952-53) for reference; stated no evidence cheques received at Bhavnagar or as unconditional discharge; collected by bankers in British India.",
      "type": "procedural",
      "date": "1952",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Questions proposed: Whether receipt of cheques at Bhavnagar amounts to receipt there even if cashed in British India; whether income from certain sales received in British India u/s 4(1)(a).",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "References pending till SC decision in CIT v. Kirloskar Bros. (1954) and Ogale Glass Works (1954); SC held post office agent where assessee requested remittance by cheque/post.",
      "type": "procedural",
      "date": "1954-04-17",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Revenue did not urge post office agency aspect before Tribunal post-SC decisions; Tribunal drew statement on Nov 5, 1954, including facts from record, two letters showing cheques received by post, sample agreement.",
      "type": "procedural",
      "date": "1954-11-05",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Question referred: Whether receipt of cheques in Bhavnagar amounted to receipt of sale proceeds in Bhavnagar.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Bombay HC on Sep 23, 1955, held cannot answer without materials on whether cheques posted at assessee's request (post office agent); directed supplementary statement u/s 66(4) on portions received by post, request express/implied.",
      "type": "procedural",
      "date": "1955-09-23",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "HC noted burden on Revenue but necessary inquiry needed; Mr. Johi concedes hand-delivered cheques received in Bhavnagar.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "Appellant petition for certificate u/s 66A(2) dismissed Dec 8, 1955; special leave granted by SC Mar 12, 1956, limited to HC jurisdiction u/s 66(4).",
      "type": "procedural",
      "date": "1956-03-12",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court had jurisdiction under section 66(4) of the Indian Income-tax Act, 1922 to direct the Tribunal to submit a supplementary statement of case on points not arising out of the Tribunal's order, such as whether cheques were received by post at the assessee's request.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether receipt of cheques at Bhavnagar amounted to receipt of sale proceeds in Bhavnagar under s.4(1)(a), even if cashed in British India.",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Cheques received at Bhavnagar; receipt of money there, not where cashed.",
      "supporting_facts": [
        "f6",
        "f9",
        "f10"
      ],
      "legal_basis": "Kirloskar Brothers Ltd. v. CIT Bombay (Bombay HC)"
    },
    {
      "id": "pa2",
      "text": "High Court lacked jurisdiction u/s 66(4) to call for supplementary statement on new points like post office agency, not raised before Tribunal or arising from its order.",
      "supporting_facts": [
        "f12",
        "f15",
        "f16"
      ],
      "legal_basis": "Section 66(1), 66(2), 66(4) of Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No evidence cheques received at Bhavnagar or as unconditional discharge; collected by bankers in British India; receipt where cashed.",
      "supporting_facts": [
        "f7",
        "f13"
      ],
      "legal_basis": "Section 4(1)(a) of Indian Income-tax Act, 1922"
    },
    {
      "id": "ra2",
      "text": "Need enquiry if post office agent per SC in Kirloskar and Ogale; HC can direct supplementary statement u/s 66(4).",
      "supporting_facts": [
        "f15",
        "f18"
      ],
      "legal_basis": "Section 66(4); CIT v. Kirloskar Bros.; Ogale Glass Works"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Questions under s.66(1)/(2) must arise out of Tribunal's order, based on admitted/found facts; HC u/s 66(4) can only direct additions/alterations to clarify existing statement for determining referred question, not new questions or fresh enquiries.",
      "addresses_issue": "i1",
      "key_observation": "Jurisdiction under s.66 advisory, limited to facts/case as before Tribunal; cannot enlarge scope to new lines of enquiry."
    },
    {
      "id": "cr2",
      "text": "Post office agency not raised before authorities/Tribunal or in references; not in Tribunal order; two letters on record only supported presumption of receipt at Bhavnagar.",
      "addresses_issue": "i1",
      "key_observation": "Revenue never urged posting/request aspect despite SC decisions."
    },
    {
      "id": "cr3",
      "text": "Cited authorities confirm no power to remand for new facts/evidence or fresh contentions not before Tribunal.",
      "addresses_issue": "i1",
      "key_observation": "HC cannot allow party second chance on different case."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court erred in not deciding reference on existing statement and lacked jurisdiction u/s 66(4) to direct supplementary statement on new points.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kirloskar Brothers Ltd. v. Commissioner of Income-tax Bombay",
      "citation": "1952 21 I.T.R. 82",
      "treatment": "followed",
      "relevance": "Tribunal followed for receipt at place cheques received; later reversed by SC but on different facts"
    },
    {
      "case_name": "Commissioner of Income-tax v. Kirloskar Bros.",
      "citation": "1954 25 I.T.R. 547",
      "treatment": "referred",
      "relevance": "Post office agent if assessee requested remittance by post; distinguished as not urged here"
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay South v. Messrs. Ogale Glass Works Ltd.",
      "citation": "1955 1 S.C.R. 185",
      "treatment": "referred",
      "relevance": "Similar to Kirloskar on post office agency"
    },
    {
      "case_name": "Craddock, H.M. Inspector of Taxes v. Zevo Finance Co. Ltd.",
      "citation": "1946 27 T.C. 267",
      "treatment": "followed",
      "relevance": "No remand for new evidence/different contention"
    },
    {
      "case_name": "Commissioner of Income-tax, West Bengal v. State Bank of India",
      "citation": "1957 31 I.T.R. 545",
      "treatment": "followed",
      "relevance": "Limit to points raised before Tribunal"
    },
    {
      "case_name": "Industrial Development and Investments Co., Ltd. v. Commissioner of Excess Profits Tax, Bombay",
      "citation": "1957 31 I.T.R. 688",
      "treatment": "followed",
      "relevance": "Statement of case limited to materials before Tribunal"
    },
    {
      "case_name": "Vadilal Ichhachand v. Commissioner of Income-tax",
      "citation": "1957 32 I.T.R. 569",
      "treatment": "followed",
      "relevance": "No power u/s 66 to remand for undetermined facts"
    },
    {
      "case_name": "Commissioner of Income-tax v. Bhurangya Coal Co.",
      "citation": "1958 34 I.T.R. 802",
      "treatment": "followed",
      "relevance": "No remand for new enquiry not sought before Tribunal"
    },
    {
      "case_name": "Commissioner of Income-tax, Bihar Orissa v. Visweshwar Singh",
      "citation": "1939 7 I.T.R. 536",
      "treatment": "distinguished",
      "relevance": "Tribunal to re-hear on existing issues, not new enquiries"
    },
    {
      "case_name": "Sir Sunder Singh Majithia v. Commissioner of Income-tax, C.P. and U.P.",
      "citation": "1942 10 I.T.R. 457",
      "treatment": "distinguished",
      "relevance": "Remand for missing essential facts on referred question"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 4(1)(a)",
        "Section 66(1)",
        "Section 66(2)",
        "Section 66(4)",
        "Section 66A(2)",
        "Section 33(4)"
      ],
      "relevance": "Governs computation of British India income for non-residents; reference procedure to HC and Tribunal's statement of case"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court's order directing supplementary statement set aside as lacking jurisdiction u/s 66(4); matter remanded to High Court to decide the referred question on the existing statement of case submitted by Tribunal.",
    "relief_granted": "Remand to High Court for decision on merits based on original reference",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is only a question of law which would arise out of such facts which are admitted and or found by the Tribunal that would be the substratum of the reference to the High Court.\"",
      "speaker": "court",
      "significance": "Defines scope of reference jurisdiction under s.66"
    },
    {
      "text": "\"Section 66(4) does not enable the High Court to raise a new question of law which does not arise out of the Tribunal's order and direct the Tribunal to investigate new or further facts necessary to determine this new question.\"",
      "speaker": "court",
      "significance": "Core holding limiting HC power u/s 66(4)"
    },
    {
      "text": "\"The Crown failed in its contention on a matter of fact and it must abide by the result; it would be contrary to all principle to give it another chance.\"",
      "speaker": "court",
      "significance": "From Craddock case, supports no second chance on new case"
    }
  ],
  "_case_id": "1959_18",
  "_label": 1,
  "_text_length": 43013,
  "_extracted_at": "2026-02-10T19:36:17.388141"
}