{
  "metadata": {
    "case_name": "Pares Nath Thakur (Deity) v. Plaintiffs (Assignees of Mortgagees)",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha J."
    ],
    "case_number": "Civil Appeal No. 655 of 1957",
    "date_of_judgment": "1959-05-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Deed of trust dated December 15, 1926, executed in favour of first defendant Pares Nath Thakur, installed in Digamber Jain Temple, Cuttack, purporting to convey properties to the deity.",
      "type": "background",
      "date": "1926-12-15",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Simple mortgage bond dated April 14, 1927, executed by predecessors-in-interest of defendants 2 to 4.",
      "type": "background",
      "date": "1927-04-14",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Disputed properties conveyed by deed of trust attached before judgment on September 23, 1934.",
      "type": "procedural",
      "date": "1934-09-23",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Mortgagees instituted suit in Subordinate Judge's Court, Cuttack; preliminary decree on June 11, 1935; final decree on October 13, 1936.",
      "type": "procedural",
      "date": "1935-06-11",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Mortgaged properties sold and purchased by decree-holders, but decree dues not satisfied; money decree obtained against defendants 2 to 4 for Rs. 11,000 odd on April 29, 1940.",
      "type": "procedural",
      "date": "1940-04-29",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Defendant-first party (deity through trustees) preferred claim under O.21 r.63 CPC; executing court allowed claim after inquiry.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Plaintiffs (assignees of mortgagees) instituted suit under O.21 r.63 CPC for declaration that deed of trust was sham and fraudulent; properties belonged to defendants 2-4 liable in execution.",
      "type": "procedural",
      "date": "1943",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Two courts of fact (Second Munsif Cuttack Aug 31, 1946; District Judge Cuttack Jan 12, 1948) held idol exists, deed effective, donors divested title, properties not family property of mortgagors, deed to put title beyond doubt; dismissed suit.",
      "type": "admitted",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Orissa High Court (Apr 27, 1954) in Second Appeal No. 174/1948 reversed lower courts, held no dedication proved, allowed appeal with costs.",
      "type": "procedural",
      "date": "1954-04-27",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Special leave to appeal granted by Supreme Court.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Evidence of DW3 (respectable witness) accepted by lower courts.",
      "type": "material",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Evidence of DW1 Kunjabahari Lal: Disputed shop house gifted to Thakur in 1870 or 1872 by Maniklal.",
      "type": "disputed",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Evidence of Dhaneswar Lal (Ext. M, dead witness): Looks after Thakur's affairs since 1934 as Pujari, maintains accounts filed in Suit No. 94/1941; disputed properties relate to lots 1 and 2 of trust deed.",
      "type": "material",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Deed empowers trustees to sell specific inconvenient properties in Mouzas Baramunda etc., not the disputed urban properties in Cuttack.",
      "type": "material",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the deed of trust dated December 15, 1926, was a sham and fraudulent transaction not conveying title to the deity.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the High Court on second appeal could re-examine findings of fact by two lower courts of fact regarding validity of dedication.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether onus of proof was correctly placed: heavy burden on plaintiff to prove registered deed fictitious and executing court's order erroneous.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Deed of trust valid; idol exists; properties dedicated; lower courts correctly found plaintiffs failed to prove sham transaction.",
      "supporting_facts": [
        "f1",
        "f8",
        "f11",
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": "O.21 r.63 CPC; heavy burden on plaintiff challenging registered deed and executing court order"
    },
    {
      "id": "pa2",
      "text": "High Court cannot interfere with concurrent findings of fact on second appeal.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Well-settled law from Privy Council and Supreme Court decisions"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Deed of trust does not create endowment without aliunde evidence of existing endowment; no formal dedication proved except recitals; no evidence of installation, rents appropriation till 1938, accounts not produced.",
      "supporting_facts": [
        "f1",
        "f9"
      ],
      "legal_basis": "Principles on endowment and dedication"
    },
    {
      "id": "ra2",
      "text": "Recitals in deed allow trustees to dispose properties and appoint Pujari, indicating no real dedication.",
      "supporting_facts": [
        "f1",
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court on second appeal cannot go behind concurrent findings of fact by two courts below; question whether trust deed fictitious is one of fact.",
      "addresses_issue": "i2",
      "key_observation": "High Court misdirected itself in law and facts by re-examining evidence."
    },
    {
      "id": "cr2",
      "text": "Heavy onus on plaintiff suing to declare registered deed sham and set aside executing court's order; plaintiffs failed to discharge it; lower courts correctly found so.",
      "addresses_issue": "i3",
      "key_observation": "High Court misplaced onus, requiring defendant to prove dedication aliunde."
    },
    {
      "id": "cr3",
      "text": "High Court overlooked evidence: DW1 on gift of shop; Dhaneswar Lal on puja, accounts since 1934; power to alienate only specific inconvenient properties, not disputed ones.",
      "addresses_issue": "i1",
      "key_observation": "High Court's findings unsound even on merits; drew adverse inferences without foundation."
    },
    {
      "id": "cr4",
      "text": "Inference from facts is finding of fact, not law.",
      "addresses_issue": "i2",
      "key_observation": "Cited Meenakshi Hills case."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court lacked jurisdiction to reverse concurrent findings of fact on second appeal.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Plaintiffs bore heavy burden to prove deed fictitious and executing order erroneous; failed; deed valid dedication.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "High Court's decision based on misdirected onus and overlooked evidence cannot stand.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Meenakshi Hills, Madurai v. The Commissioner of Income-tax, Madras",
      "citation": "1956 S.C.R. 691",
      "treatment": "followed",
      "relevance": "Finding of fact, even inference from other facts, not question of law open in second appeal."
    },
    {
      "case_name": "Long series of decisions of Judicial Committee of Privy Council and this Court",
      "citation": null,
      "treatment": "followed",
      "relevance": "High Court cannot go into questions of fact on second appeal."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order 21 Rule 63"
      ],
      "relevance": "Suit for declaration that claim under this rule allowed by executing court was based on sham deed; heavy burden on such plaintiff."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, set aside Orissa High Court judgment dated April 27, 1954, restored decisions of courts below dismissing plaintiffs' suit; High Court had wrongly interfered with concurrent findings of fact.",
    "relief_granted": "Restoration of lower courts' decrees upholding validity of deed of trust and claim of deity.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is well-settled by a long series of decisions of the Judicial Committee of the Privy Council and of this Court, that a High Court, on second appeal, cannot go into questions of fact.",
      "speaker": "court",
      "significance": "Core principle justifying reversal of High Court."
    },
    {
      "text": "The burden of proof is heavy on a plaintiff who sues for a declaration of a document solemnly executed and registered, as a fictitious transaction.",
      "speaker": "court",
      "significance": "Explains misplacement of onus by High Court."
    },
    {
      "text": "Judged by these principles Ext. F, the deed of trust by itself creates no endowment and it is necessary for the defendants to show by evidence aliunde that there had been an existing endowment.",
      "speaker": "court",
      "significance": "High Court's erroneous approach criticized."
    }
  ],
  "_case_id": "1959_21",
  "_label": 1,
  "_text_length": 14989,
  "_extracted_at": "2026-02-10T19:36:00.855390"
}