{
  "metadata": {
    "case_name": "Appellants v. State (Rajendra Kumar Jain)",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO J."
    ],
    "case_number": "Criminal Appeal No. 143 of 1957",
    "date_of_judgment": "1959-09-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "A complaint was filed by Rajendra Kumar Jain against the four appellants and three others under ss. 409, 465, 467, 471 and 477A of the Indian Penal Code.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "After the statement of the complainant under s. 200 of the Code of Criminal Procedure, summonses were issued to the accused persons requiring them to answer a charge under s. 406 of the Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Prosecution witnesses were examined and cross-examined and the statements of the accused persons recorded.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Magistrate heard arguments on the question of framing of charges which were concluded on September 23, 1954. It was ordered that the case should be put up on September 30, 1954, for orders.",
      "type": "procedural",
      "date": "1954-09-23",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On September 30, 1954, the Magistrate framed charges against the four appellants under ss. 409 and 465 read with s. 471 and 477A of the Penal Code and ordered commitment of the four appellants to the Court of Session on these charges. The remaining three accused were discharged.",
      "type": "procedural",
      "date": "1954-09-30",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "There was a revision petition by Rajendra Kumar Jain against the discharge of one of the three accused, namely, Bhajan Lal.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "On April 9, 1955, the First Additional Sessions Judge, Agra, ordered suo motu after a perusal of the commitment order that Bhajan Lal be committed to the Court of Session to stand his trial and dismissed the revision petition as infructuous.",
      "type": "procedural",
      "date": "1955-04-09",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Bhajan Lal filed revision to the High Court. Roy, J. set aside the order of commitment of Bhajan Lal on October 6, 1955, inter alia because a Magistrate was not empowered to frame a charge and make an order of commitment until he had taken all such evidence as the accused might produce before him, and Bhajan Lal had not been called upon to produce evidence in defence.",
      "type": "procedural",
      "date": "1955-10-06",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On January 7, 1956, the four appellants filed a revision petition before the Sessions Judge praying that the order of commitment passed against them be quashed as the Magistrate had not observed the mandatory provisions of ss. 208 to 213 of the Code.",
      "type": "procedural",
      "date": "1956-01-07",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "The First Additional Sessions Judge made a reference to the High Court on January 14, 1956, that the procedure followed by the Magistrate was irregular and the order of commitment dated September 30, 1954, was bad in law and should be quashed.",
      "type": "procedural",
      "date": "1956-01-14",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Chowdhry, J. rejected the reference taking the view that the Magistrate had not failed to comply with s. 208 and non-compliance with ss. 211 and 212 was curable under s. 537 of the Code.",
      "type": "procedural",
      "date": "1957-05-08",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Allahabad High Court granted certificate to appeal to the Supreme Court as the view taken by Chowdhry, J. conflicted with the view taken by Roy, J.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the proceedings before the Magistrate began as a trial of a warrant case under s. 406 IPC or as an inquiry under Chapter XVIII of the CrPC, and consequently whether the Magistrate was required to follow ss. 208 to 213 when committing under s. 347 CrPC.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the non-compliance with s. 208 CrPC (failure to give accused opportunity to produce defence evidence) vitiates the commitment order, or is curable under s. 537 CrPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "As the case began before the Magistrate as a warrant case under s. 406 IPC, it was incumbent upon the Magistrate, when deciding under s. 347 CrPC to commit to Sessions Court, to follow the procedure in Ch. XVIII (ss. 208 to 213 CrPC), which was not done, rendering the commitment bad in law.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "ss. 347, 208-213 CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Magistrate was proceeding from the beginning as an inquiry under Ch. XVIII per s. 207 CrPC despite summons under s. 406 IPC, as offence under s. 406 is triable by Sessions or Magistrate; no non-compliance with s. 208, and non-compliance with ss. 211, 212 curable under s. 537 CrPC without prejudice.",
      "supporting_facts": [
        "f2",
        "f11"
      ],
      "legal_basis": "ss. 207, 208, 211, 212, 537 CrPC; Schedule II Column 8"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Proceedings began as trial of warrant case since summons issued only under s. 406 IPC (not exclusively Sessions triable) and Magistrate did not inform accused it was inquiry under Ch. XVIII; accused reasonably concluded it was trial.",
      "addresses_issue": "i1",
      "key_observation": "Magistrate must inform accused when deciding to commit under s. 347 to allow defence evidence under s. 208."
    },
    {
      "id": "cr2",
      "text": "When committing under s. 347 after starting trial, Magistrate must comply with remaining Ch. XVIII provisions not yet done, including opportunity for accused defence evidence under s. 208 before framing charge.",
      "addresses_issue": "i1",
      "key_observation": "In this case, after prosecution evidence and arguments, Magistrate framed charges and committed on Sep 30, 1954 without intimating intent to commit or asking for defence."
    },
    {
      "id": "cr3",
      "text": "Denial of right under s. 208 to produce defence evidence before commitment causes presumed prejudice to accused, as it affects decision to frame charge; not curable under s. 537 CrPC.",
      "addresses_issue": "i2",
      "key_observation": "Breach of s. 208 bound to cause failure of justice; possibility accused had no defence irrelevant."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The commitment order dated September 30, 1954 is bad in law due to non-compliance with s. 208 CrPC and must be quashed.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Non-compliance with s. 208 CrPC in commitment proceedings under s. 347 is not curable under s. 537 as it causes prejudice.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Subramania Iyer v. King-Emperor",
      "citation": "1901 L.R. 28 I.A. 257",
      "treatment": "referred",
      "relevance": "Trial conducted differently from Code is bad; no curing irregularity."
    },
    {
      "case_name": "Pulukuri Kotayya v. King-Emperor",
      "citation": "1948 L.R. 74 I.A. 65",
      "treatment": "followed",
      "relevance": "If trial substantially per Code but irregularity, curable u/s 537; distinction illegality vs irregularity one of degree."
    },
    {
      "case_name": "Abdul Rehman v. King-Emperor",
      "citation": "1926 L.R. 54 I.A. 96",
      "treatment": "referred",
      "relevance": "Failure to comply with s. 360 CrPC curable u/ss 535, 537."
    },
    {
      "case_name": "Narain Rao v. State of Andhra Pradesh",
      "citation": "1958 S.C.R. 283",
      "treatment": "followed",
      "relevance": "Approved Privy Council view on curability under s. 537."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "406",
        "409",
        "465",
        "467",
        "471",
        "477A"
      ],
      "relevance": "Offences charged in complaint and summons; s. 406 not exclusively Sessions triable."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "200",
        "207",
        "208",
        "209",
        "210",
        "211",
        "212",
        "213",
        "347",
        "537"
      ],
      "relevance": "Procedure for inquiry and commitment to Sessions; mandatory compliance required when switching from trial to commitment under s. 347; s. 537 does not cure prejudice from s. 208 breach."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court allowed the appeal, held the commitment order dated September 30, 1954 bad in law for non-compliance with s. 208 CrPC, quashed the commitment, without examining breaches of ss. 211-213.",
    "relief_granted": "Commitment order quashed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"If the Magistrate intends to use his powers under s. 207 and hold an inquiry from the beginning in a case not exclusively triable by the Court of Session, the only way in which the accused can know that he is holding an inquiry and not a trial is by the Magistrate informing the accused that he is holding an inquiry under Ch. XVIII and not trial.\"",
      "speaker": "court",
      "significance": "Clarifies requirement to inform accused of inquiry nature."
    },
    {
      "text": "\"The denial of that right [under s. 208] is in itself sufficient to cause prejudice to the accused and failure of justice.\"",
      "speaker": "court",
      "significance": "Holds breach of s. 208 vitiates commitment, not curable u/s 537."
    },
    {
      "text": "\"When a trial is conducted in a manner different from that prescribed by the Code... the trial is bad, and no question of curing an irregularity arises.\"",
      "speaker": "court",
      "significance": "Quotes Pulukuri Kotayya to distinguish when s. 537 inapplicable."
    }
  ],
  "_case_id": "1959_183",
  "_label": 1,
  "_text_length": 24906,
  "_extracted_at": "2026-02-10T19:38:24.238797"
}