{
  "metadata": {
    "case_name": "Commissioner of Sales Tax v. Respondent (Sawar Logs Supplier)",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "DAS, C.J."
    ],
    "case_number": "Civil Appeal No. 13 of 1958",
    "date_of_judgment": "1959-04-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent deals in matchwood called sawar (Bombay-Malabaricum). His place of business is situate at Chanda in the erstwhile Central Provinces.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In January 1948 the respondent entered into an agreement with the Western India Match Co. Ltd. (WIMCO) for the supply of a minimum quantity of 2,500 tons of sawar logs during the season 1947-48. This agreement is evidenced by WIMCO's letter dated January 7, 1948.",
      "type": "material",
      "date": "1948-01-07",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The agreement of sale was subject to the conditions appearing in a formal contract in writing dated March 2, 1945, which was renewed from year to year. Prior contract dated October 18, 1940 was superseded.",
      "type": "material",
      "date": "1945-03-02",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Pursuant to the agreement, the respondent loaded diverse quantities of Sawar logs on railway wagons and despatched the same by railway from Chanda or other railway stations in the Central Provinces to Ambernath in the erstwhile province of Bombay.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On many occasions the representative of WIMCO was present at the railway station when the logs were sorted out and loaded into the wagons.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The railway receipts were made out with WIMCO as the consignee.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On arrival of the logs at Ambernath, WIMCO paid the railway freight, inspected and measured the logs by its Factory Manager, and paid the prices at agreed rates to the respondent's agent at Bombay.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The price of the logs supplied and accepted by WIMCO during June 1, 1947 to November 12, 1947 amounted to Rs. 30,067-9-0.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Assistant Commissioner assessed sales tax of Rs. 939-10-0 and penalty of Rs. 100 for period June 1, 1947 to November 12, 1947.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeal to Sales Tax Commissioner upheld assessment and penalty.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Revision to Board of Revenue treated as such, upheld liability but remitted penalty.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Board referred questions to Nagpur High Court under s.23(1) of Central Provinces Berar Sales Tax Act, 1947 in Misc. Civil Case No. 219 of 1952.",
      "type": "procedural",
      "date": "1954-06-29",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court held sales did not take place in Central Provinces and Berar, not liable to tax.",
      "type": "procedural",
      "date": "1954-06-29",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Commissioner of Sales Tax obtained special leave and appealed to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Did the agreements dated 18-10-1940 and 2-3-1945 constitute contracts of sale - either express or implied - in respect of sawar wood supplied by the assessee to WIMCO?",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "If yes, did the contracts relate to specific or ascertained goods or to unascertained or future goods?",
      "framed_by": "lower_court"
    },
    {
      "id": "i3",
      "text": "Did the property in the goods pass to WIMCO by consignment simpliciter at different railway stations within the province, or did it pass at Ambernath when the goods were approved as provided in the contract?",
      "framed_by": "lower_court"
    },
    {
      "id": "i4",
      "text": "Was reliance on the definition of 'goods' contained in s.2(7) of the Sale of Goods Act in order in applying Explanation II to s.2(g) of the Sales Tax Act in cases where the goods sold were in the form of trees standing on the land in the province at the time of the contract of sale?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Property in the logs passed from the respondent to WIMCO under s.23 of Sale of Goods Act when logs were loaded at railway stations in Central Provinces and railway receipts taken in name of WIMCO and forwarded; unconditional appropriation by seller with assent of buyer (express by representative or implied by contract terms).",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Sale of Goods Act, 1930 ss.18, 23, 33, 39(1)"
    },
    {
      "id": "pa2",
      "text": "Explanation II to s.2(g) deems sale to take place in Central Provinces as goods (logs or standing timber) were actually in Central Provinces at time of contract of sale.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": "Central Provinces Berar Sales Tax Act, 1947 s.2(g) Explanation II; Sale of Goods Act s.2(7)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The contract was for unascertained goods; property passed at Ambernath upon inspection, measurement and acceptance by WIMCO's Factory Manager; appropriation conditional on approval at destination.",
      "supporting_facts": [
        "f3",
        "f7"
      ],
      "legal_basis": "Sale of Goods Act, 1930 s.23"
    },
    {
      "id": "ra2",
      "text": "Explanation II does not apply as goods were not in existence in the form of logs in Central Provinces at date of contract; standing trees not 'goods' under Sales Tax Act.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Central Provinces Berar Sales Tax Act, 1947 s.2(g) Explanation II; s.2(d)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Contract clauses (cls.2,6,7 of 1945 contract) reserve right to reject at Ambernath notwithstanding prior acceptance by representative; measurements and payment after inspection at Ambernath; F.O.R. Ambernath; property passes at Ambernath upon appropriation by buyer with seller's assent.",
      "addresses_issue": "i3",
      "key_observation": "Provisions indicate contrary intention negativing prima facie passing of property at railway stations."
    },
    {
      "id": "cr2",
      "text": "No evidence of express assent by WIMCO representative; implied assent displaced by contract terms requiring final approval at Ambernath.",
      "addresses_issue": "i3",
      "key_observation": "Seller assented in advance to buyer's appropriation at Ambernath."
    },
    {
      "id": "cr3",
      "text": "Explanation II requires goods to be in existence in Central Provinces at contract date in the form agreed to be sold (logs); no evidence logs existed as such; no provision for severance of standing timber.",
      "addresses_issue": "i4",
      "key_observation": "Standing trees not goods under Sales Tax Act; Explanation II inapplicable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Agreements were express agreements to sell unascertained or future goods by description; property passed at Ambernath, outside Central Provinces.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Property did not pass by delivery to railway; passed at Ambernath upon approval.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "'Goods' in Explanation II to s.2(g) per Sales Tax Act s.2(d), not SOGA s.2(7); standing trees not goods.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Sales not within Central Provinces and Berar; not liable to tax under the Act.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "The Badische Anilin and Soda Fabrik v. The Basle Chemical Works, Bindschedler",
      "citation": "1898 A.C. 200",
      "treatment": "referred",
      "relevance": "Delivery to carrier does not pass property if contract requires delivery at destination."
    },
    {
      "case_name": "Poppatlal Shah v. State of Madras",
      "citation": null,
      "treatment": "followed",
      "relevance": "Constitutional validity of similar Explanation not challenged."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Provinces and Berar Sales Tax Act, 1947",
      "sections": [
        "s.2(g)",
        "s.4",
        "s.22(4)",
        "s.22(5)",
        "s.23(1)",
        "s.25"
      ],
      "relevance": "Charging section for sales tax; definition of sale with Explanation II deeming situs; reference procedure."
    },
    {
      "name": "Indian Sale of Goods Act, 1930",
      "sections": [
        "s.2(4)",
        "s.2(7)",
        "s.4",
        "s.18",
        "s.19(3)",
        "s.23",
        "s.33",
        "s.39(1)"
      ],
      "relevance": "Defines contract of sale, passing of property in unascertained goods, delivery to carrier."
    },
    {
      "name": "Central Provinces and Berar Sales Tax Rules",
      "sections": [
        "r.19",
        "r.57"
      ],
      "relevance": "Return requirements; revision procedure."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's answers to the reference questions, holding that the sales took place outside the Central Provinces at Ambernath and were not liable to tax under the Act; appeal dismissed.",
    "relief_granted": "Assessment order nullified; no sales tax liability.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "In our judgment the prima facie case of what might have been the appropriation of the logs by the respondent by loading on the wagons logs of the contract quality and description with the assent of WIMCO given in advance by the terms of cl. 4 is effectively displaced by the provisions of cls. 2, 6 and 7 of the later contract which clearly indicate a contrary intention.",
      "speaker": "court",
      "significance": "Core reasoning on contract construction and passing of property."
    },
    {
      "text": "Explanation II can apply only if the goods in respect of which the contract of sale is entered into are, at the date of such contract, actually in the Central Provinces... the goods must at the date of the contract be there in the form in which they are agreed to be sold.",
      "speaker": "court",
      "significance": "Interpretation limiting Explanation II, rejecting tax liability."
    }
  ],
  "_case_id": "1959_124",
  "_label": 0,
  "_text_length": 31902,
  "_extracted_at": "2026-02-10T19:37:33.220325"
}