{
  "metadata": {
    "case_name": "Bhaskar Waman Joshi and others v. Narayan Rambilas Aggarwal and others",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No.16 of 1955",
    "date_of_judgment": "1959-11-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Deed dated September 10, 1931, executed by Shri Narayan Rambilas Aggarwal and his two sons Sadan Gopal and Murli Dhar in favour of two brothers Bhaskar Waman Joshi and Trimbak Waman Joshi ostensibly conveying absolute title to three properties.",
      "type": "material",
      "date": "1931-09-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Properties: 1. House in Amravati outside Amba Gate, Municipal No. 5/98, valued Rs. 11,500; 2. Chawl in Amravati, old Municipal Nos. 6/857, 6/858, 6/859, valued Rs. 26,000; 3. House in Dhanraj Lane Amravati, old Municipal No. 3/459, valued Rs. 2,000.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Transferors indebted to Imperial Bank of India Rs. 30,000 and Rs. 9,500 due to transferees and relations, total Rs. 39,500 satisfied by deed; Rs. 2,320 set off, balance Rs. 37,180 paid by cheques.",
      "type": "background",
      "date": "1931-09-10",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Possession delivered to transferees by calling tenants to attorn; mutated in names of transferees.",
      "type": "procedural",
      "date": "1931-09-10",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Transferees constructed eight shops in compound of Amba Gate house in 1940-1941, other constructions in Chawl compound, sold Dhanraj Lane house to Suraj Mal Salig Ram.",
      "type": "material",
      "date": "1940-1941",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Notice dated August 26, 1943, by transferors to Bhaskar Waman Joshi and representatives of Trimbak Waman Joshi stating willingness to redeem mortgage and demanding accounts.",
      "type": "procedural",
      "date": "1943-08-26",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Reply by transferees denying right to redeem, asserting absolute sale and claim as afterthought due to rise in prices.",
      "type": "disputed",
      "date": "1943",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Suit No. 5-A of 1943 (Tr. Civil Suit No.11-A of 1943) filed September 9, 1943, by three transferors and joint Hindu family members against Bhaskar Waman Joshi, representatives of Trimbak, and Suraj Mal for redemption alleging mortgage by conditional sale.",
      "type": "procedural",
      "date": "1943-09-09",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Trial court (Second Additional District Judge, Amraoti) decree dated September 25, 1944, dismissed suit holding absolute conveyance with condition of repurchase, period expired.",
      "type": "procedural",
      "date": "1944-09-25",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Nagpur High Court in First Appeal No. 10 of 1945, judgment dated February 14, 1952, reversed trial court, held mortgage by conditional sale, directed redemption decree.",
      "type": "procedural",
      "date": "1952-02-14",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Draft sale deed Ex. P-13 prepared before Ex. D-1 conveying only two properties valued Rs. 10,000 and Rs. 25,000; final included third house valued Rs. 3,500 then Rs. 2,000.",
      "type": "background",
      "date": "1931",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Agreement Ex. D-3 dated September 10, 1931, by transferors reciting sale for past debts, request not to register immediately, agreement to pay difference between 9% interest on price and net rent till reconveyance.",
      "type": "material",
      "date": "1931-09-10",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Monthly rent Rs. 270, expenses debated; evidence shows municipal taxes borne by tenants.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Land areas: Amba Gate 9,037 sq ft, Chawl 23,805 sq ft, Dhanraj 817 sq ft; much open land.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Valuation reports Ex. D-52, D-53 undervalued structures and land.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "True effect of deed dated September 10, 1931: absolute conveyance with condition of repurchase or mortgage by conditional sale?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Transaction was absolute conveyance subject to condition of repurchase within five years; period expired; claim to treat as mortgage afterthought due to price rise.",
      "supporting_facts": [
        "f1",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Consideration adequate: net rent capitalized at 5-6% equals or exceeds Rs.39,500; Ex. D-3 inadmissible without registration; subsequent conduct shows sale.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Deed intended as mortgage by conditional sale; conditions embodied in deed; surrounding circumstances show security for debt.",
      "supporting_facts": [
        "f1",
        "f3",
        "f12"
      ],
      "legal_basis": "Section 58(c), Transfer of Property Act"
    },
    {
      "id": "ra2",
      "text": "Consideration inadequate; properties undervalued especially Dhanraj house; Ex. D-3 shows personal covenant for interest indicating mortgage.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Question of intention from language of deed in light of surrounding circumstances; condition in sale deed not conclusive but factor; distinguishes mortgage (debtor-creditor, security) from sale with repurchase agreement.",
      "addresses_issue": "i1",
      "key_observation": "Form not decisive; real character from provisions and circumstances."
    },
    {
      "id": "cr2",
      "text": "Analyzes conditions: transferees' option to return properties after 4.5 years even if damaged by vis major, transferors bear loss, indicates price charged on property as security.",
      "addresses_issue": "i1",
      "key_observation": "Strongly indicative of mortgage."
    },
    {
      "id": "cr3",
      "text": "Ex. D-3 admissible as personal covenant for 9% interest till reconveyance; shows parties regarded as mortgage; transferors in straitened circumstances needing exact Rs.39,500.",
      "addresses_issue": "i1",
      "key_observation": "Agreement executed same day supports mortgage."
    },
    {
      "id": "cr4",
      "text": "Consideration inadequate: rents, valuations, land value show properties worth more; taxes by tenants; open land undervalued.",
      "addresses_issue": "i1",
      "key_observation": "Artificial valuation especially Dhanraj house."
    },
    {
      "id": "cr5",
      "text": "Subsequent conduct inadmissible; precedents support looking to intention via deed and circumstances.",
      "addresses_issue": "i1",
      "key_observation": "High Court right."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Real transaction in Ex. D-1 is mortgage by conditional sale, not absolute sale.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Narasingerji Gyanagerji v. Panuganti Parthasarathi and Others",
      "citation": "1924 L.R. 51 I.A. 305",
      "treatment": "followed",
      "relevance": "Real character from provisions of deed and surrounding circumstances; form and time essence not decisive."
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act",
      "sections": [
        "Section 58(c)"
      ],
      "relevance": "Defines mortgage by conditional sale; condition must be embodied in sale deed; intention determines if mortgage."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Nagpur High Court decree reversing trial court; held transaction as mortgage by conditional sale; affirmed direction for redemption decree.",
    "relief_granted": "Redemption of properties",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the question whether by the incorporation of such a condition a transaction ostensibly of sale may be regarded as a mortgage is one of intention of the parties to be gathered from the language of the deed interpreted in the light of the surrounding circumstances.\"",
      "speaker": "court",
      "significance": "Core principle for determining nature of transaction."
    },
    {
      "text": "\"What distinguishes the two transactions is the relationship of debtor and creditor and the transfer being a security for the debt.\"",
      "speaker": "court",
      "significance": "Key distinction between mortgage and sale with repurchase."
    },
    {
      "text": "\"In our view, the High Court was right in holding that the real transaction incorporated in Ex. D-1 was a mortgage and not a sale.\"",
      "speaker": "court",
      "significance": "Final holding affirming mortgage."
    }
  ],
  "_case_id": "1959_82",
  "_label": 0,
  "_text_length": 25599,
  "_extracted_at": "2026-02-10T19:36:45.994408"
}