{
  "metadata": {
    "case_name": "Faguna Kanta Nath v. State",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Criminal Appeal No. 203 of 1956",
    "date_of_judgment": "1959-01-13"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On May 9, 1952, complainant Narendra Nath Brahma was taking two carts carrying 25 Mds. of paddy for sale to Billashiparabazar along the path by the side of river Gauranga.",
      "type": "background",
      "date": "1952-05-09",
      "source": "complainant"
    },
    {
      "id": "f2",
      "text": "Complainant stopped by paddy-checking Inspector Khalilur Rahman, accompanied by appellant Faguna Kanta Nath and three others.",
      "type": "material",
      "date": "1952-05-09",
      "source": "complainant"
    },
    {
      "id": "f3",
      "text": "Khalilur Rahman demanded Rs. 200 as bribe, threatened seizure of cart and paddy, supported by appellant and three others.",
      "type": "disputed",
      "date": "1952-05-09",
      "source": "complainant"
    },
    {
      "id": "f4",
      "text": "Before demand, appellant and Khalilur Rahman went aside and had talks, then Khalilur Rahman demanded Rs. 200.",
      "type": "disputed",
      "date": "1952-05-09",
      "source": "complainant"
    },
    {
      "id": "f5",
      "text": "Complainant expressed inability, agreed to Rs. 150, borrowed Rs. 100 from Surajmal Oswal, offered Rs. 80 to Khalilur Rahman who directed to hand to appellant.",
      "type": "material",
      "date": "1952-05-09",
      "source": "complainant"
    },
    {
      "id": "f6",
      "text": "Appellant counted Rs. 80 and made it over to Khalilur Rahman.",
      "type": "disputed",
      "date": "1952-05-09",
      "source": "complainant"
    },
    {
      "id": "f7",
      "text": "Complainant forced to execute promissory note for Rs. 70 in favour of appellant, promising payment next day after paddy sold; Khalilur Rahman tore page from notebook, lent pen.",
      "type": "material",
      "date": "1952-05-09",
      "source": "complainant"
    },
    {
      "id": "f8",
      "text": "Complainant learnt in bazar that Happaran Rai similarly treated but paid less.",
      "type": "background",
      "date": "1952-05-09",
      "source": "complainant"
    },
    {
      "id": "f9",
      "text": "On May 11, 1952, complainant approached appellant for refund of money and return of pronote; appellant promised but did not.",
      "type": "material",
      "date": "1952-05-11",
      "source": "complainant"
    },
    {
      "id": "f10",
      "text": "On May 11, 1952, at meeting at Futkibari Middle English School with Deputy Commissioner present, complainant presented written complaint describing payment of Rs. 80 and pronote for Rs. 70.",
      "type": "procedural",
      "date": "1952-05-11",
      "source": "complainant"
    },
    {
      "id": "f11",
      "text": "Khalilur Rahman prosecuted under s. 161 IPC read with s. 5(2) Prevention of Corruption Act, 1947; appellant under s. 165A IPC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Special Judge convicted both: Khalilur under s. 161 IPC (acquitted under PCA), appellant under s. 165A; sentenced to one year RI.",
      "type": "procedural",
      "date": "1955-05-23",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court (Deka J.) acquitted Khalilur Rahman (benefit of doubt on payment to him), upheld appellant's conviction under s. 165A.",
      "type": "procedural",
      "date": "1955-12-14",
      "source": "high_court"
    },
    {
      "id": "f14",
      "text": "Special Judge found fully convinced Rs. 80 realised from complainant for forbearing seizure by Khalilur Rahman, helped and abetted by appellant Faguna Kanta Nath.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether conviction of appellant for abetment under s. 165A IPC can be sustained when Khalilur Rahman acquitted of offence under s. 161 IPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "As Khalilur Rahman acquitted, conviction of appellant for abetment cannot be sustained on facts and circumstances.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Sections 107, 165A IPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Acquittal of Khalilur Rahman wrong; does not prevent conviction of appellant for abetment under s. 165A.",
      "supporting_facts": [
        "f6",
        "f12"
      ],
      "legal_basis": "Dalip Singh v. State of Punjab"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "For abetment under s. 107 IPC, no necessity that offence abetted is committed; s. 165A explicitly states offence punishable whether or not offence committed in consequence of abetment.",
      "addresses_issue": "i1",
      "key_observation": "Abetment by instigation or conspiracy possible even if offence not committed, but here no instigation or conspiracy proved."
    },
    {
      "id": "cr2",
      "text": "No instigation by appellant; no conspiracy as charge fails if co-conspirator acquitted (King v. Plummer, approved in Topandas v. State of Bombay).",
      "addresses_issue": "i1",
      "key_observation": "Remains abetment by aiding: but aiding requires intention to facilitate commission of offence under s. 161, which High Court held not committed by Khalilur."
    },
    {
      "id": "cr3",
      "text": "Appellant only received money at instance of Khalilur for counting and handed back; no independent aiding of s. 161 offence.",
      "addresses_issue": "i1",
      "key_observation": "Acquittal of Khalilur means no s. 161 offence; thus no abetment by aiding."
    },
    {
      "id": "cr4",
      "text": "Dalip Singh v. State of Punjab distinguished: peculiar circumstances where Supreme Court found acquittals wrong and upheld others under s. 149; not applicable here.",
      "addresses_issue": "i1",
      "key_observation": "Cannot opine on Khalilur's acquittal as no appeal against it."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "On facts found, with Khalilur Rahman acquitted of s. 161 IPC, appellant's conviction under s. 165A IPC for abetment cannot be upheld.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "The King v. Plummer",
      "citation": "(1902) 2 K.B. 339",
      "treatment": "followed",
      "relevance": "Conspiracy charge fails if co-conspirator acquitted."
    },
    {
      "case_name": "Topandas v. State of Bombay",
      "citation": "1955 2 S.C.R. 881",
      "treatment": "followed",
      "relevance": "Approved Plummer on conspiracy."
    },
    {
      "case_name": "Dalip Singh v. State of Punjab",
      "citation": "1954 S.C.R. 145",
      "treatment": "distinguished",
      "relevance": "Wrong acquittals do not affect other convictions in peculiar circumstances under s. 302 r/w s. 149; not applicable here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "165A",
        "161",
        "107"
      ],
      "relevance": "s. 165A punishes abetment of s. 161 offence whether or not committed; abetment defined in s. 107 (instigation, conspiracy, aiding)."
    },
    {
      "name": "Prevention of Corruption Act, 1947",
      "sections": [
        "5(2)"
      ],
      "relevance": "Khalilur charged under s. 161 IPC r/w s. 5(2); acquitted by Special Judge."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, order of conviction and sentence of appellant set aside.",
    "relief_granted": "Acquittal of appellant",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Under the Indian law for an offence of abetment it is not necessary that the offence should have been committed.\"",
      "speaker": "court",
      "significance": "Clarifies scope of abetment independent of principal offence commission."
    },
    {
      "text": "\"A person abets by aiding when by the commission of an act he intends to facilitate and does facilitate the commission thereof.\"",
      "speaker": "court",
      "significance": "Defines abetment by aid under s. 107 third limb."
    },
    {
      "text": "\"We are of the opinion that on the facts found and circumstances established in this case and as Khalilur Rahman has been acquitted the appellants conviction cannot be upheld.\"",
      "speaker": "court",
      "significance": "Core holding reversing conviction."
    }
  ],
  "_case_id": "1959_51",
  "_label": 1,
  "_text_length": 12660,
  "_extracted_at": "2026-02-10T19:36:42.981609"
}