{
  "metadata": {
    "case_name": "Trustees of the Charity Fund Founded by Sir Sassoon David, Baronet of Bombay v. Commissioner of Income-tax",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "DAS, C.J."
    ],
    "case_number": "Civil Appeal No.396 of 1957",
    "date_of_judgment": "1959-05-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Sir Sassoon David, Bart. and four other persons holding securities of value Rs. 24,25,000 for charity executed Deed of Declaration of Trust on June 8, 1922, declaring trust fund held on trusts in Clause 13.",
      "type": "background",
      "date": "1922-06-08",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Clause 13 provides for application of net income for six purposes: (a) relief of poor and indigent members of Jewish or any other community; (b) hospitals, schools etc.; (c) relief of distress by natural calamities; (d) care of animals; (e) advancement of religion; (f) other beneficial purposes; with provisos giving preference to poor relations of Sir Sassoon David, not less than half income for Jewish community of Bombay, surplus carry forward, and regard to Sir Sassoon David's wishes during lifetime.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Deed registered under Bombay Public Trusts Act, 1950 on June 4, 1953.",
      "type": "procedural",
      "date": "1953-06-04",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Trust fund invested inter alia in 3 1/2% Government Securities.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In 1930, Income-tax Officer, A Ward, Bombay issued certificate authorizing Reserve Bank of India to deduct tax at source on interest, enuring till cancellation.",
      "type": "procedural",
      "date": "1930",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In 1946, 3 1/2% Government Securities redeemed and converted into 3% Conversion Loan, 1946.",
      "type": "material",
      "date": "1946",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In February 1948, certificate of exemption cancelled as securities redeemed.",
      "type": "procedural",
      "date": "1948-02",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Trustees applied for fresh certificate for 3% Conversion Loan, 1946 from Income-tax Officer, Bombay Refund Circle, who refused on ground income not exempt under s.4(3)(i).",
      "type": "procedural",
      "date": "1948",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Income-tax Officer, A-V Ward, Bombay started proceedings under s.34 for assessment years 1944-45 to 1947-48 and regular assessments for 1948-49 to 1952-53, assessing income as not exempt under s.4(3)(i).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellate Assistant Commissioner confirmed assessments.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Income-tax Appellate Tribunal set aside assessments for 1944-45 to 1947-48 holding s.34 wrongly invoked (difference of opinion between ITOs), department accepted; upheld assessments for 1948-49 to 1952-53.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On application under s.66(1), Tribunal referred two questions to Bombay High Court in Income-tax Reference No.32 of 1954.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Bombay High Court by order dated February 21, 1956 answered both questions in negative.",
      "type": "procedural",
      "date": "1956-02-21",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "High Court granted certificate under s.66A(2) on September 19, 1956 for appeal to Supreme Court.",
      "type": "procedural",
      "date": "1956-09-19",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Trust property is held wholly for religious or charitable purposes within the meaning of section 4(3)(i) of the Indian Income-tax Act?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "If the answer to question 1 is in the negative, whether the trust property is held in part only for religious or charitable purposes?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Each of the six purposes in Clause 13 is charitable involving public utility; trustees could expend on any one exclusively and still exempt; provisos do not make it non-charitable as primary class under sub-cl.(a) is public charitable.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s.4(3)(i)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Clause 13 read with provisos shows trust primarily for benefit of relations/family of Sir Sassoon David; mandatory preference to family, not less than half (possibly all) for Jewish community including family; trustees could spend entire income on poor indigent relations under sub-cl.(a) without breach.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s.4(3)(i); Trustees of Gordhandas Govindram Family Charitable Trust v. CIT"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Clause 13 omitting provisos constitutes valid public charitable trust; sub-cls.(b)-(f) have public utility as family not direct beneficiaries; sub-cl.(a) for poor/indigent of communities worldwide is public charitable; first proviso applies only to sub-cl.(a), preference from primary public class.",
      "addresses_issue": "i1",
      "key_observation": "Relations claim benefit only if within classes in sub-cl.(a); e.g., non-community member relation excluded."
    },
    {
      "id": "cr2",
      "text": "Distinguishes Gordhandas case (blatant family benefit, public remote); follows In re Koettgen's Will Trusts (preference to sub-class from primary public class does not invalidate charitable trust).",
      "addresses_issue": "i1",
      "key_observation": "Validity determined at primary public class stage; preference does not affect."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Trust property held wholly for religious or charitable purposes under s.4(3)(i); income exempt; question 1 answered affirmatively, question 2 does not arise.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Trustees of Gordhandas Govindram Family Charitable Trust v. Commissioner of Income-tax, Central, Bombay",
      "citation": "(1952) 21 I.T.R. 231",
      "treatment": "distinguished",
      "relevance": "Facts different: blatant family benefit with remote public element; not applicable here."
    },
    {
      "case_name": "In re Koettgen's Will Trusts",
      "citation": "1954 Ch. 252",
      "treatment": "followed",
      "relevance": "Preference to sub-class (employees/families up to 75%) from primary public class for commercial education does not invalidate charitable trust; validity at primary class stage."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s.66A(2)",
        "s.66(1)",
        "s.4(3)(i)",
        "s.34"
      ],
      "relevance": "Exemption for income from property held wholly for charitable purposes; reference and appeal provisions; escapement proceedings."
    },
    {
      "name": "Bombay Public Trusts Act, 1950",
      "sections": [],
      "relevance": "Deed registered thereunder."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, answered first question affirmatively holding trust wholly charitable under s.4(3)(i) and exempt, second question does not arise; reversed High Court.",
    "relief_granted": "Income exempt from tax for relevant years; assessments set aside implicitly.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the primary class of eligible persons is ascertained that the question of the public nature of the trust arises and falls to be decided\"",
      "speaker": "court",
      "significance": "Quoting Upjohn J. from Koettgen's case; crux of reasoning on validity of trust."
    },
    {
      "text": "\"In our opinion the income from the trust properties comes within the scope of s.4(3)(i) and is, therefore, entitled to exemption.\"",
      "speaker": "court",
      "significance": "Direct holding on exemption."
    }
  ],
  "_case_id": "1959_128",
  "_label": 1,
  "_text_length": 22392,
  "_extracted_at": "2026-02-10T19:37:18.192116"
}