{
  "metadata": {
    "case_name": "Mahant Ram Saroop Das v. State of Bihar & Ors.",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das, J."
    ],
    "case_number": "Civil Appeal No. 343 of 1955",
    "date_of_judgment": "1959-04-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Mahatma Mast Ram, a Hindu saint, owned and possessed considerable properties in Monghyr district, Bihar. About two hundred years ago, he built a small temple at Salouna and installed deity Sri Thakur Lakshmi Narainji. This temple known as Salouna asthal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Mast Ram died near about 1802. Succeeded by disciples, one of whom was Mahant Lakshmi Dasji.",
      "type": "background",
      "date": "1802",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Mahant Lakshmi Dasji built a new temple in 1916, removed deity from old temple, installed two new deities Sri Ram and Sita.",
      "type": "background",
      "date": "1916",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Mahant Lakshmi Dasji died in 1919. Left three disciples: Vishnu Das, Bhagwat Das, Rameshwar Das.",
      "type": "background",
      "date": "1919",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Dispute among disciples about succession to gaddi settled in February 1919: Vishnu Das succeeds Lakshmi Dasji as shebait, then Bhagwat Das, thereafter ablest bairagi of asthal born of Brahmin parents.",
      "type": "procedural",
      "date": "1919-02",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Bhagwat Das died in 1935. Dispute between Rameshwar Das (youngest chela of Lakshmi Dasji) and Ram Saroop Das (present Mahant and appellant).",
      "type": "disputed",
      "date": "1935",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Rameshwar Das filed application under Charitable and Religious Trusts Act XIV of 1920 for accounts from Mahant Ram Saroop Das. Ram Saroop contested saying properties not public trust under the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Mahant Ram Saroop Das obtained permission under s.5 of 1920 Act to sue for declaration that Salouna asthal and properties not public trust. Suit filed in Subordinate Judge Monghyr, dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appeal to Patna High Court in First Appeal No. 10 of 1941. Judgment dated March 5, 1943: declared Salouna asthal and properties do not constitute public trust under Charitable and Religious Trusts Act XIV of 1920.",
      "type": "admitted",
      "date": "1943-03-05",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Bihar Hindu Religious Trusts Act, 1950 (Bihar I of 1951) passed, President's assent February 21, 1951, came into force August 15, 1951. Bihar State Board of Religious Trusts constituted.",
      "type": "background",
      "date": "1951-02-21",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Board under s.59 of Act asked appellant on November 14, 1952 to furnish return of income and expenditure of asthal.",
      "type": "procedural",
      "date": "1952-11-14",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Appellant replied December 1, 1952: Salouna asthal private institution, Act not apply, cited High Court judgment in F.A. No.10/1941.",
      "type": "procedural",
      "date": "1952-12-01",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Board replied not bound by prior declaration, asked appellant to obtain declaration under Act or submit return.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Appellant filed writ petition under Art.226 on January 22, 1954: asthal not religious trust under Act, properties not trust property, appellant not trustee, Act not apply to private trusts, Board's demand interferes with Art.19(1)(f). Prayed quash order, restrain interference.",
      "type": "procedural",
      "date": "1954-01-22",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Patna High Court dismissed writ Misc. Judl. Case No.39/1954 on September 13, 1954: s.2(1) definition covers private and public trusts except specified, restrictions not violate Art.19(1)(f).",
      "type": "procedural",
      "date": "1954-09-13",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "High Court certificate granted, appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Do the provisions of the Bihar Hindu Religious Trusts Act, 1950 apply to private religious trusts?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If the Act applies to private trusts, are its provisions violative of Article 19(1)(f) of the Constitution?",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Salouna asthal constitutes a public religious trust under the Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Salouna asthal not religious trust within Act; properties not constitute religious trust; appellant not trustee; Act not apply to private trusts; Board's demand interferes with fundamental right under Art.19(1)(f).",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4",
        "f5",
        "f6",
        "f9"
      ],
      "legal_basis": "Art.226 Constitution; prior High Court declaration F.A. No.10/1941"
    },
    {
      "id": "pa2",
      "text": "True construction of Act: definition s.2(1) confined to public religious trusts; legislative history shows only public trusts regulated; other provisions (ss.29,30,32,48) appropriate only to public trusts.",
      "supporting_facts": [
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": "Bihar Hindu Religious Trusts Act s.2(1), s.4(5), s.29, s.30, s.32, s.48; historical Acts like Religious Endowments Act 1863, s.92 CPC"
    },
    {
      "id": "pa3",
      "text": "If Act applies to private trusts, provisions impose unreasonable restrictions violating Art.19(1)(f); no warrant to apply English law visitorial powers to Hindu private trusts.",
      "supporting_facts": [],
      "legal_basis": "Art.19(1)(f), Art.19(5) Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "s.2(1) definition wide enough to cover both private and public religious trusts; Salouna asthal not fall in exceptions; Act applies; restrictions reasonable under Art.19(5).",
      "supporting_facts": [
        "f11",
        "f13"
      ],
      "legal_basis": "Bihar Hindu Religious Trusts Act s.2(1)"
    },
    {
      "id": "ra2",
      "text": "Not bound by prior High Court declaration in F.A. No.10/1941 as not parties; materials insufficient to decide public character but Act applies even to private.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Bihar Hindu Religious Trusts Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Definition s.2(1) 'religious trust' expressed widely but exceptions and context (s.4(5) excluding prior public trust laws from 'any' religious trust under Act) indicate confined to public trusts; legislative history supports only public trusts.",
      "addresses_issue": "i1",
      "key_observation": "s.4(5) makes clear all trusts under Act are public, as prior laws applied only to public."
    },
    {
      "id": "cr2",
      "text": "Provisions like s.29 (supervision by committees under Board), s.30 (cy pres by any Hindu), s.32 (scheme by two or more interested persons), s.48 (removal etc. by Board/person interested) appropriate only to public trusts, analogous to s.92 CPC.",
      "addresses_issue": "i1",
      "key_observation": "Private trusts regulated by general law; no need for two or more persons in private family debutter."
    },
    {
      "id": "cr3",
      "text": "Distinction in Hindu law: public (uncertain fluctuating body) vs private (definite ascertained individuals); Act preamble for better administration of Hindu religious trusts like prior public trust laws.",
      "addresses_issue": "i1",
      "key_observation": "No unambiguous language to include private trusts."
    },
    {
      "id": "cr4",
      "text": "Unnecessary to decide constitutionality as Act not apply to private; but serious question would arise if did.",
      "addresses_issue": "i2",
      "key_observation": "English law visitorial powers not applicable to Hindu private trusts."
    },
    {
      "id": "cr5",
      "text": "Salouna asthal not public per prior High Court declaration F.A.10/1941 (stands unrebutted); no evidence contrary; s.43 may allow future determination.",
      "addresses_issue": "i3",
      "key_observation": "Appellant entitled to rely on prior declaration absent contrary proof."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Bihar Hindu Religious Trusts Act, 1950 and provisions do not apply to private religious trusts; definition s.2(1) confined to public religious, pious or charitable trusts.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Salouna asthal and properties do not constitute public trust per prior declaration; Act not apply unless determined otherwise under s.43.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Nabi Shirazi v. Province of Bengal",
      "citation": "1942 I.L.R. I Cal. 211",
      "treatment": "followed",
      "relevance": "Distinction between public and private trusts: public has uncertain fluctuating body, even sect does not make private."
    },
    {
      "case_name": "Mahant Moti Das v. S.P. Sahi",
      "citation": "P. 563 ante",
      "treatment": "referred",
      "relevance": "Related appeals on same Act provisions."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bihar Hindu Religious Trusts Act, 1950 (Bihar I of 1951)",
      "sections": [
        "s.2(1)",
        "s.2(g)",
        "s.2(n)",
        "s.2(p)",
        "s.4(5)",
        "s.28",
        "s.29",
        "s.30",
        "s.32",
        "s.48",
        "s.59",
        "s.43"
      ],
      "relevance": "Definition of religious trust held limited to public; powers of Board over public trusts; excludes prior laws."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.19(1)(f)",
        "Art.19(5)",
        "Art.226"
      ],
      "relevance": "Claim of violation by Act on private trusts; writ jurisdiction."
    },
    {
      "name": "Charitable and Religious Trusts Act, 1920 (XIV of 1920)",
      "sections": [
        "s.5"
      ],
      "relevance": "Prior application for accounts; declaration suit; applied only to public trusts."
    },
    {
      "name": "Religious Endowments Act, 1863 (XX of 1863)",
      "sections": [],
      "relevance": "Excluded by s.4(5); applied only to public religious endowments."
    },
    {
      "name": "Code of Civil Procedure, 1908 (V of 1908)",
      "sections": [
        "s.92"
      ],
      "relevance": "Excluded by s.4(5); applies only to public trusts; analogous provisions in Act."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court judgment and order dated September 13, 1954 set aside; writ issued quashing Board's order for return of income/expenditure; respondents prohibited from interfering with appellant's management unless obtain determination under s.43 that asthal is public trust.",
    "relief_granted": "Quashing of Board's order dated November 14, 1952; restraint on interference with management of Salouna asthal and properties.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"religious trust means any express or constructive trust created or existing for any purpose recognised by Hindu Law to be religious, pious or charitable, but shall not include a trust created according to the Sikh religion or purely for the benefit of the Sikh community and a private endowment created for the worship of a family idol in which the public are not interested.\"",
      "speaker": "court",
      "significance": "Definition s.2(1) central to construction issue."
    },
    {
      "text": "\"The Religious Endowments Act, 1863, and section 92 of the Code of Civil Procedure, 1908, shall not apply to any religious trust in this State, as defined in this Act.\"",
      "speaker": "court",
      "significance": "s.4(5) key to holding definition limited to public trusts."
    },
    {
      "text": "\"we hold that the definition clause does not include within its ambit private trusts and the Act and its provisions do not apply to such trusts.\"",
      "speaker": "court",
      "significance": "Core holding resolving principal issue."
    },
    {
      "text": "\"in a public trust the beneficial interest is vested in an uncertain and fluctuating body of persons... in a private trust the beneficiaries are definite and ascertained individuals.\"",
      "speaker": "court",
      "significance": "Distinction applied from Hindu law."
    }
  ],
  "_case_id": "1959_146",
  "_label": 1,
  "_text_length": 36901,
  "_extracted_at": "2026-02-10T19:38:20.707812"
}