{
  "metadata": {
    "case_name": "District Board Ghazipur v. Respondent",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo J."
    ],
    "case_number": "Civil Appeal No. 372 of 1956",
    "date_of_judgment": "1960-10-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is carrying on the trade of hulling rice, milling grains and extracting oil in village Nandganj within the area of Gaon Sabha Barapur.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "He obtained licences for the three trades under the United Provinces Rice and Dal Control Order, 1948, as also under the Uttar Pradesh Pure Food Act, 1950.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "The Gaon Sabha imposed a tax of Rs. 8/- on each mill within its jurisdiction and the respondent had been paying that.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1953 the District Board, Ghazipur, enforced bye-laws for the regulation and control of flour, rice and oil mills in the rural areas of the district under which a licence has to be obtained by such mills on payment of Rs. 20/- as licence-fee per year per mill.",
      "type": "material",
      "date": "1953",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "When the respondent was served with a notice to take out a licence for each mill and to pay the licence-fee, he objected to the legality and validity of the levy.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The respondent filed a writ petition in the Allahabad High Court under Art. 226 of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Contentions in writ: (i) After constitution of Gaon Sabha Barapur under U.P. Panchayat Raj Act, No. XXVI of 1947, the District Board had been divested of its power under U.P. District Boards Act, No. X of 1922; (ii) respondent had paid fees under 1948 Control Order and 1950 Pure Food Act, could not be asked to pay again; (iii) levy too high and out of proportion to expenses, meant to augment revenues.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Learned Single Judge dismissed the writ petition in limine by reasoned judgment negativing all three contentions.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Respondent appealed to Division Bench (Special Appeal No. 43 of 1955), which allowed the appeal holding that under s.111 Panchayat Raj Act, District Board lost power under s.174 District Boards Act, and levy out of proportion, not a fee.",
      "type": "procedural",
      "date": "1956-01-18",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "District Board applied for and obtained certificate to appeal to Supreme Court.",
      "type": "procedural",
      "date": "1956",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the view of the Appeal Court that the District Board has lost its power to make bye-laws under s.174 of the District Boards Act for regulation and control of trade in view of s.111 of the Panchayat Raj Act, is correct.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the District Board can levy licence-fee under District Boards Act when fees already paid under U.P. Rice and Dal Control Order, 1948 and U.P. Pure Food Act, 1950.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether the licence-fee of Rs.20/- is too high and out of proportion to expenses, amounting to a tax.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Panchayat Raj Act does not contain any provision by which Gaon Sabha or Gaon Panchayat has power to regulate or control trade; thus no inconsistency with District Boards Act, power remains with District Board.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": "Panchayat Raj Act ss.15,16,111; District Boards Act s.91(q)"
    },
    {
      "id": "pa2",
      "text": "In alternative, intention of legislature was not that common provisions be repealed by implication; District Board's power to control trade remains.",
      "supporting_facts": [],
      "legal_basis": "District Boards Act s.174"
    },
    {
      "id": "pa3",
      "text": "Fees under Control Order 1948 and Pure Food Act 1950 are for different purposes than regulation of obnoxious trades under District Boards Act.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "District Boards Act ss.91(q),174; Essential Supplies Act; U.P. Pure Food Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "District Board divested of power after constitution of Gaon Sabha under Panchayat Raj Act.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "Panchayat Raj Act s.111; District Boards Act s.174"
    },
    {
      "id": "ra2",
      "text": "Already paid licence-fees under U.P. Rice and Dal Control Order, 1948 and U.P. Pure Food Act, 1950; cannot pay again under District Boards Act.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "U.P. Rice and Dal Control Order, 1948; U.P. Pure Food Act, 1950"
    },
    {
      "id": "ra3",
      "text": "Levy too high and out of proportion to actual/probable expenses for control/regulation; meant to augment revenues.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Regulation/control covered by cl.(c) s.15 Panchayat Raj Act (sanitation given wide meaning).",
      "supporting_facts": [],
      "legal_basis": "Panchayat Raj Act s.15(c)"
    },
    {
      "id": "ra5",
      "text": "S.111 Panchayat Raj Act in general terms covers promotion/maintenance of health, safety, convenience.",
      "supporting_facts": [],
      "legal_basis": "Panchayat Raj Act s.111"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Panchayat Raj Act ss.15,16 do not contain provision corresponding to District Boards Act s.91(q) for regulation/control of offensive, dangerous or obnoxious trades; prima facie power unaffected.",
      "addresses_issue": "i1",
      "key_observation": "No specific provision in Panchayat Raj Act for control/regulation of trades."
    },
    {
      "id": "cr2",
      "text": "Sanitation in s.15(c) Panchayat Raj Act not widest meaning to include regulation of trades; used in ordinary/restricted sense (conservancy, drainage); scheme of both Acts shows separate provisions for related matters.",
      "addresses_issue": "i1",
      "key_observation": "Word 'sanitation' confined to ordinary meaning re dirt/disease, not trades."
    },
    {
      "id": "cr3",
      "text": "S.111 bye-laws power conditioned by duties/functions in ss.15,16 etc. of Panchayat Raj Act; cannot extend to trades absent duty thereon.",
      "addresses_issue": "i1",
      "key_observation": "Bye-laws under s.111 limited to Panchayat duties."
    },
    {
      "id": "cr4",
      "text": "S.37(d) Panchayat Raj Act re tax on trades (List II item 60), not regulation/fees.",
      "addresses_issue": "i1",
      "key_observation": "Tax power distinct from regulatory fees."
    },
    {
      "id": "cr5",
      "text": "Fees under 1948 Control Order/Essential Supplies Act and Pure Food Act for different purposes than District Board regulation of obnoxious trades; no reason to strike down.",
      "addresses_issue": "i2",
      "key_observation": "Different purposes, possible overlap irrelevant."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Panchayat Raj Act does not provide for control/regulation of trades like s.91(q) District Boards Act; no inconsistency, District Board retains power under s.174 to frame bye-laws and charge fees.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "District Board licence-fee valid despite fees under other Acts, as purposes differ.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "U.P. District Boards Act, 1922",
      "sections": [
        "s.91 (cl. q, m, e, n, r)",
        "s.92 (cl. c, i)",
        "s.106",
        "s.174 (cl. 2 k)",
        "s.56"
      ],
      "relevance": "Powers of District Board for compulsory/optional duties, fees, bye-laws for regulating obnoxious trades."
    },
    {
      "name": "U.P. Panchayat Raj Act, 1947",
      "sections": [
        "s.15 (cl. c, g, k, r)",
        "s.16 (cl. c, l, m)",
        "s.18",
        "s.37 (cl. d)",
        "s.111"
      ],
      "relevance": "Duties of Gaon Panchayat, bye-laws power; does not cover trade regulation."
    },
    {
      "name": "United Provinces Rice and Dal Control Order, 1948",
      "sections": [],
      "relevance": "Licence for rice milling etc.; fee for different purpose."
    },
    {
      "name": "U.P. Pure Food Act, 1950",
      "sections": [],
      "relevance": "Licence for trades; fee for different purpose."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Writ petition filed under."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; order of Allahabad High Court Appeal Court set aside; writ petition dismissed. District Board's bye-laws and licence-fee upheld as valid.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "as the Panchayat Raj Act does not provide for control or regulation of the nature mentioned in s.91(q) of the District Boards Act, there is no question of the power of the District Board under s.174 to frame bye-laws and to prescribe fees in that behalf being taken away by s.111 of the Panchayat Raj Act.",
      "speaker": "court",
      "significance": "Core holding on no inconsistency between Acts."
    },
    {
      "text": "the word sanitation as used in s.15 of the Panchayat Raj Act is confined to its ordinary meaning in relation to conservancy and drainage and the like with reference to the necessity of avoiding dirt and disease and cannot be given such a wide meaning as to include control or regulation of trades, callings or practices.",
      "speaker": "court",
      "significance": "Rejects wide interpretation of 'sanitation'."
    }
  ],
  "_case_id": "1960_319",
  "_label": 1,
  "_text_length": 18600,
  "_extracted_at": "2026-02-10T19:55:56.159710"
}