{
  "metadata": {
    "case_name": "Petitioners (Operators in Anekal Area) v. State of Mysore & Ors.",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Petition No. 2 of 1960",
    "date_of_judgment": "1960-04-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioners are operators of stage carriages on certain routes in the Anekal area in Bangalore District.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "On January 13, 1959, the General Manager, Mysore Government Road Transport Department (2nd respondent), published a scheme under s. 68C of the Motor Vehicles Act, 1939, for exclusion of private operators on certain routes and reservation for State transport undertaking in Anekal area.",
      "type": "material",
      "date": "1959-01-13",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Chief Minister of Mysore State gave affected operators opportunity for oral representations, perused written objections, and approved the scheme as framed by 2nd respondent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On April 23, 1959, the scheme was published in the Mysore State Government gazette.",
      "type": "procedural",
      "date": "1959-04-23",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On June 23, 1959, renewal applications by petitioners 1 to 3 for permits on routes covered by scheme were rejected by Transport Authority; permanent permits given to 2nd respondent operative from June 24, 1959.",
      "type": "procedural",
      "date": "1959-06-23",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In Writ Petition No. 463 of 1959, High Court of Mysore held issue of permanent permits to 2nd respondent before expiry of six weeks from gazette publication illegal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Renewal permits operative till March 31, 1961, issued to petitioners 1 to 3 and other operators by third respondent (Regional Transport Authority, Bangalore).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "2nd respondent applied for fresh permits pursuant to approved scheme; notices returnable on January 5, 1960, served on affected operators.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On January 4, 1960, five petitioners applied to Supreme Court under Art. 32 for quashing the scheme and restraining respondents from acting pursuant to it.",
      "type": "procedural",
      "date": "1960-01-04",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Anekal area has 31 routes served by private stage carriages; scheme covers 14 routes exclusively for State transport undertaking.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Statement 2 to scheme lists 56 operators, their routes, stage carriages, and trips.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Order dated October 22, 1959, by 3rd respondent rejected permit application as route passed through notified area under scheme.",
      "type": "procedural",
      "date": "1959-10-22",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Statement of objections by 2nd respondent on October 24, 1959, referred to scheme as covering notified area.",
      "type": "procedural",
      "date": "1959-10-24",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Petitioners alleged two operators (Chikkaveerappa and Krishna Rao) on specified routes not excluded; affidavit by State/2nd respondent denied, stating they were notified as affected.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Chief Minister filed affidavit denying bias, stating he heard objections, gave full opportunity, and provided detailed reasons for approval.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the scheme violates equal protection as it covers only 14 out of 31 routes in Anekal area, and allegedly leaves out two operators on those routes.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether State of Mysore competent to enter motor transport business to exclusion of private operators absent its own legislation, given Chapter IVA merely regulates procedure.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Chief Minister who approved scheme under s.68D was biased.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether Chief Minister gave genuine consideration to objections in light of conditions prescribed by Legislature.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Scheme violates equal protection clause as only 14/31 routes covered, and two operators on those routes left out, discriminating between operators.",
      "supporting_facts": [
        "f10",
        "f11",
        "f14"
      ],
      "legal_basis": "Article 14 (equal protection)"
    },
    {
      "id": "pa2",
      "text": "Chapter IVA of Motor Vehicles Act merely regulates procedure for State entry into motor transport; absent State legislation, Mysore incompetent to exclude private operators.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Constitution (legislative competence)"
    },
    {
      "id": "pa3",
      "text": "Chief Minister biased against petitioners.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Principles of natural justice (bias)"
    },
    {
      "id": "pa4",
      "text": "Chief Minister did not give genuine consideration to objections in light of legislative conditions.",
      "supporting_facts": [
        "f3",
        "f15"
      ],
      "legal_basis": "Section 68D, Motor Vehicles Act"
    },
    {
      "id": "pa5",
      "text": "Scheme cannot be for select routes in an area; must apply to all or none.",
      "supporting_facts": [
        "f10",
        "f12",
        "f13"
      ],
      "legal_basis": "Section 68C"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Plea that two operators not excluded is incorrect; they were notified as affected.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Chief Minister not biased; heard objections, gave full opportunity, provided detailed reasons.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Section 68D (judicial duty but no presumption of bias)"
    },
    {
      "id": "ra3",
      "text": "Scheme relates to 14 notified routes, not entire area.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": "Sections 68C, 68D"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Scheme is for 14 specified routes, not notified area; column 1 describes area contextually, but column 3 specifies routes for exclusion. True interpretation not affected by RTA or respondent's assumptions.",
      "addresses_issue": "i1",
      "key_observation": "No discrimination as scheme is route-specific; two operators' routes not proven identical with pickup rights."
    },
    {
      "id": "cr2",
      "text": "Chapter IVA validly enacted by Parliament under Entry 21 List III (commercial monopolies); enables State monopoly in transport. Art. 298 recognizes State trade power; Art.19(6) saves such laws. No need for State-specific legislation.",
      "addresses_issue": "i2",
      "key_observation": "Parliament competent to grant State transport undertakings monopoly; scheme itself 'law' under Art.13(3)(a)."
    },
    {
      "id": "cr3",
      "text": "No evidence of Chief Minister's bias; acts in official capacity. Affidavit shows hearing, consideration, reasons given. Duty under s.68D is judicial, but no presumption of bias as Government party.",
      "addresses_issue": "i3",
      "key_observation": "Plea fails absent controverting evidence."
    },
    {
      "id": "cr4",
      "text": "Chief Minister's order discusses law/facts; no specific reference to some objections does not mean non-consideration. s.68D guarantees opportunity/hearing with judicial approach, not appeal or detailed reasons for each.",
      "addresses_issue": "i4",
      "key_observation": "Order not challengeable if opportunity given and objections dealt with in light of public interest."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Scheme approved under ss.68C/68D is for 14 notified routes, not area; no violation of equal protection.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Parliament competent under Entry 21 List III to enact Chapter IVA granting State transport monopoly; saved by Art.19(6).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No bias by Chief Minister; approval valid.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Genuine consideration given to objections per s.68D.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gullapalli Nageswara Rao v. Andhra Pradesh State Road Transport Corporation",
      "citation": "1959 Supp. 1 S.C.R. 319",
      "treatment": "followed",
      "relevance": "s.68D imposes judicial duty on State Government in considering objections."
    },
    {
      "case_name": "Navinchandra Mafatlal v. Commissioner of Income-tax, Bombay City",
      "citation": "1955 1 S.C.R. 829, 836",
      "treatment": "followed",
      "relevance": "Constitutional entries to be construed in widest amplitude."
    },
    {
      "case_name": "United Provinces v. Atiqua Begum",
      "citation": "1940 F.C.R. 110",
      "treatment": "followed",
      "relevance": "Constitutional expressions in wide sense."
    }
  ],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act, 1939",
      "sections": [
        "s.68C",
        "s.68D",
        "s.68A to 68I",
        "Chapter IVA",
        "s.68F",
        "s.68G",
        "s.68B"
      ],
      "relevance": "Authorizes State transport undertaking to frame scheme for exclusive services; overrides other provisions; judicial consideration of objections; permits issuance/cancellation."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 19(1)(g)",
        "Article 19(6)",
        "Article 298",
        "Article 12",
        "Article 13(3)(a)"
      ],
      "relevance": "Fundamental right to trade; State power to trade/exclude; saving for State monopolies; scheme as 'law'."
    },
    {
      "name": "Seventh Schedule",
      "sections": [
        "Entry 21 List III",
        "Entry 26 List II",
        "Entry 33 List III",
        "Entry 35 List III"
      ],
      "relevance": "Concurrent power for commercial monopolies; State trade power."
    },
    {
      "name": "Road Transport Corporations Act, 1950",
      "sections": [
        "Act 44 of 1950"
      ],
      "relevance": "Defines State transport undertaking."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Court rejected all four grounds urged by petitioners, upheld validity of scheme under Chapter IVA of Motor Vehicles Act approved by Chief Minister, and dismissed the writ petition seeking to quash the scheme.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The scheme must therefore be regarded as one for the fourteen notified routes and not in relation to the area described in column 1.\"",
      "speaker": "court",
      "significance": "Interprets scheme as route-specific, rejecting area-wide discrimination claim."
    },
    {
      "text": "\"Chapter IVA is not merely regulatory of the procedure for carrying on business of road transport by the State it enables the State transport undertaking... to exclude private operators and to acquire a monopoly.\"",
      "speaker": "court",
      "significance": "Upholds Chapter IVA as granting monopoly power."
    },
    {
      "text": "\"unless there is reliable evidence to show that he is biased, his decision will not be liable to be called in question, merely because he is a limb of the Government.\"",
      "speaker": "court",
      "significance": "Rejects bias presumption against government functionary acting judicially."
    }
  ],
  "_case_id": "1960_21",
  "_label": 0,
  "_text_length": 24940,
  "_extracted_at": "2026-02-10T19:51:56.416476"
}