{
  "metadata": {
    "case_name": "Appellant v. Union of India and State of Jammu and Kashmir",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha, C.J.",
      "Kapur, J.",
      "Gajendragadkar, J.",
      "Wanchoo, J.",
      "Shah, J.",
      "Subba Rao, J.",
      "Das Gupta, J."
    ],
    "case_number": "Civil Appeal No. 37 of 1955",
    "date_of_judgment": "1960-12-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was aged 45 years 262 days on August 12, 1954.",
      "type": "background",
      "date": "1954-08-12",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Appellant held a regular commission in the Jammu and Kashmir State Forces, amalgamated with the Defence Forces of the Union with effect from September 1, 1949.",
      "type": "background",
      "date": "1949-09-01",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Appellant held the substantive rank of Lieut. Col. in the amalgamated forces and had the right to continue in service until he attained the age of 53 years on November 20, 1961.",
      "type": "admitted",
      "date": "1961-11-20",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Government of India issued a letter dated July 31, 1954, retiring the appellant from service with effect from August 12, 1954, not based on any allegations or charge of inefficiency, indiscipline or any other irregularity.",
      "type": "material",
      "date": "1954-07-31",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Appellant filed application under Art. 32(2A) of the Constitution in Jammu and Kashmir High Court for writ, directions or order against Union of India (Secretary, Ministry of Defence) as first respondent and State of Jammu and Kashmir (Chief Secretary) as second respondent, impugning the retirement as illegal, unwarranted, discriminatory and in contravention of Art. 16(1).",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Respondents opposed the petition on preliminary grounds, including that respondent No. 1 (Union of India) being outside territorial limits of Jammu and Kashmir High Court, the petition was not maintainable.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Jammu and Kashmir High Court (Janki Nath Wazir, C.J. and M. Shahmiri, J.) by judgment dated December 7, 1954, upheld the preliminary objection relying on Election Commission v. Saka Venkata Subba Rao and K.S. Rashid v. Income-tax Investigation Commission, held no jurisdiction over first respondent, dismissed petition but granted certificate under Art. 132.",
      "type": "procedural",
      "date": "1954-12-07",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appeal to Supreme Court on certificate of fitness granted by High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Jammu and Kashmir High Court has jurisdiction under Art. 32(2A) to issue a writ against the Union of India (located outside its territorial jurisdiction) when the cause of action arose within its jurisdiction.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether 'authority' in Art. 226/32(2A) includes 'Government'.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the concept of cause of action determines jurisdiction under Art. 226/32(2A), or only the location/residence of the person/authority/Government.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether Government of India has a fixed location at New Delhi or is present throughout India.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Previous decisions of this Court (Election Commission and Rashid cases) are distinguishable as they did not consider whether Government of India is amenable to jurisdiction under Art. 226 or 32(2A); those provisions do not stand in the way as Government of India has no location and its authority is present throughout Union; correct test is whether cause of action arose within territorial limits.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Art. 226, Art. 32(2A)"
    },
    {
      "id": "pa2",
      "text": "High Court erred in holding that 'authority' includes Government.",
      "supporting_facts": [],
      "legal_basis": "Art. 226"
    },
    {
      "id": "pa3",
      "text": "Union Government functions throughout India and cannot be said to be located only in Delhi.",
      "supporting_facts": [],
      "legal_basis": "Maqbulunnissa v. Union of India (Allahabad High Court)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "On proper construction of Constitution, observations in Election Commission case relating to 'authority' apply to Government including Union Government; Government functions through officers, location means place where orders are passed; considerations in suits re cause of action do not apply to writs; writ must reach particular officers within jurisdiction; not every case allows writ against Union.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Art. 226; Election Commission v. Saka Venkata Subba Rao; K.S. Rashid v. Income-tax Investigation Commission"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Word 'authority' in Art. 226 includes 'Government' in appropriate cases; clause 'including in appropriate cases any Government' modifies 'authority'.",
      "addresses_issue": "i2",
      "key_observation": "'authority' may include Government where orders by Government or subordinates challenged."
    },
    {
      "id": "cr2",
      "text": "Government of India located at New Delhi (its seat); not present everywhere merely because functioning throughout; jurisdiction under Art. 226 depends on residence/location of person/authority/Government within territories, not where order has effect or cause of action.",
      "addresses_issue": "i4",
      "key_observation": "Introduces no concept of cause of action or functioning; avoids conflict of jurisdiction."
    },
    {
      "id": "cr3",
      "text": "Reaffirms two-fold limitation from prior cases: writs cannot run beyond territories; person/authority must be within territories by residence/location.",
      "addresses_issue": "i1",
      "key_observation": "No departure from prior SC rulings unless manifestly wrong."
    },
    {
      "id": "cr4",
      "text": "Concept of cause of action from suits (statutory) does not apply to writs under Art. 226 which insist on presence within territories; Privy Council Parlakimedi case not applicable post-Constitution.",
      "addresses_issue": "i3",
      "key_observation": "Writs are extraordinary remedies with special procedure."
    },
    {
      "id": "cr5",
      "text": "Subba Rao J. (dissent): Art. 32(2A)/226 allows writ against Union Government as it functions within every State; no fixed location, constitutional situs everywhere; cause of action relevant; protects fundamental rights effectively.",
      "addresses_issue": "i1",
      "key_observation": "Broad construction to effectuate intent; Union present where exercising power."
    },
    {
      "id": "cr6",
      "text": "Das Gupta J.: Agrees with majority; Government not located merely by head's residence; but Art. 226 requires within territories; Union not within J&K HC jurisdiction.",
      "addresses_issue": "i1",
      "key_observation": "No fixed location test simplifies but Constitution demands presence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Jammu and Kashmir High Court has no jurisdiction under Art. 32(2A) to issue writ against Union of India as it is not located within its territories.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "'Authority' includes 'any Government' in appropriate cases under Art. 226/32(2A).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Jurisdiction under Art. 226/32(2A) determined by location/residence of authority/Government within territories, not cause of action or effect of order.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Election Commission, India v. Saka Venkata Subba Rao",
      "citation": "1953 S.C.R. 1144",
      "treatment": "followed",
      "relevance": "Two-fold limitation on Art. 226 jurisdiction: writs within territories, person/authority within territories."
    },
    {
      "case_name": "K. S. Rashid and Son v. Income-tax Investigation Commission",
      "citation": "1954 S.C.R. 738",
      "treatment": "followed",
      "relevance": "Reaffirmed limitations on Art. 226; Punjab HC had jurisdiction over Delhi-based Commission."
    },
    {
      "case_name": "Ryots of Garabandho v. Zamindar of Parlakimedi",
      "citation": "1943 L.R. 70 I.A. 129",
      "treatment": "distinguished",
      "relevance": "Cause of action in writ jurisdiction; limited to pre-Constitution Presidency HCs."
    },
    {
      "case_name": "Maqbulunnissa v. Union of India",
      "citation": "I.L.R. 1953 2 All. 289",
      "treatment": "distinguished",
      "relevance": "Allahabad HC held jurisdiction over Union based on effect within territory; pre-SC rulings."
    },
    {
      "case_name": "Lloyds Bank Limited v. Lloyds Bank Indian Staff Association",
      "citation": "I.L.R. 1954 2 Cal. 1",
      "treatment": "referred",
      "relevance": "Calcutta HC no jurisdiction over Union as not located in West Bengal."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32(2A)",
        "Article 226",
        "Article 16(1)",
        "Article 132",
        "Article 73",
        "Article 53",
        "Article 74",
        "Article 77",
        "Article 300"
      ],
      "relevance": "Jurisdiction of High Courts to issue writs; fundamental rights enforcement; executive power."
    },
    {
      "name": "Constitution (Application to Jammu and Kashmir) Order, 1954",
      "sections": [
        "Order No. 48 dated May 14, 1954"
      ],
      "relevance": "Applied Constitution to J&K with modifications including insertion of Art. 32(2A)."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order XXVII Rule 3",
        "Section 79",
        "Sections 15-20"
      ],
      "relevance": "Suits against Union of India; no need for residence in plaint."
    },
    {
      "name": "Contempt of Courts Act, 1952",
      "sections": [
        "Section 5"
      ],
      "relevance": "Enforcement against officers outside jurisdiction."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; J&K High Court correctly held no jurisdiction to entertain writ petition against Union of India under Art. 32(2A) as Union not located within its territories. Matter not decided on merits of retirement order.",
    "relief_granted": "None",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "The rule that cause of action attracts jurisdiction in suits is based on statutory enactment and cannot apply to writs issuable under Art. 226 which makes no reference to any cause of action or where it arises but insists on the presence of the person or authority within the territories.",
      "speaker": "court",
      "significance": "Defines territorial limits for writ jurisdiction."
    },
    {
      "text": "A Government may be functioning all over a State or all over India but it certainly is not located all over the State or all over India.",
      "speaker": "court",
      "key_observation": "Distinguishes functioning from location."
    },
    {
      "text": "The Union Government has no fixed legal abode it is present throughout the territories over which it exercises jurisdiction and in respect whereof it can make effective and binding orders.",
      "speaker": "Subba Rao, J.",
      "significance": "Dissenting view on Union's presence everywhere."
    }
  ],
  "_case_id": "1960_211",
  "_label": 0,
  "_text_length": 91694,
  "_extracted_at": "2026-02-10T19:54:49.304637"
}