{
  "metadata": {
    "case_name": "State v. Respondent",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": "Criminal Appeal No. 160 of 1959",
    "date_of_judgment": "1960-04-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent was prosecuted before the Judicial Magistrate, Barabanki, for offences under cls. i and iii of s. 7 of the Prevention of Food Adulteration Act, 1954, for selling adulterated milk and for selling milk without a licence.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "The learned Magistrate found that the offences had been proved and further that the respondent had committed the offences for the third time.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Under cl. a iii of sub-sec. i of s. 16 of the Act, in the absence of special and adequate reasons to the contrary, for a third offence the imprisonment to be awarded cannot be for less than two years and the fine to be imposed not less than three thousand rupees.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Section 32 of Criminal Procedure Code provides that a Magistrate of the first class shall not have power to impose a sentence of fine exceeding rupees two thousand.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Under the impression that his power as a Magistrate of the first class to impose sentence was limited by s.32 of the Code the learned Judicial Magistrate committed the respondent to stand his trial before the Court of Session, presumably acting under s. 347 of the Code of Criminal Procedure.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The respondent was thereupon tried by a learned Sessions Judge of Barabanki who found him guilty of the offences with which he had been charged.",
      "type": "procedural",
      "date": "1957-02-12",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The learned Sessions Judge came to the conclusion that the offences had been committed by the respondent for the second time and not the third.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The learned Sessions Judge observed that the learned Judicial Magistrate was competent to award the minimum punishment prescribed by the Act for a second offence and should not have committed the case to the Court of Session at all.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The learned Sessions Judge convicted the respondent and awarded the minimum sentence prescribed by the Act for a second offence, namely, rigorous imprisonment for one year and a fine of rupees two thousand and, in default, rigorous imprisonment for a further period of six months for each of the offences and directed the sentences of imprisonment to run concurrently.",
      "type": "procedural",
      "date": "1957-02-12",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The respondent then appealed to the High Court at Allahabad.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Mulla, J., who heard the appeal pointed out that the learned Judicial Magistrate had overlooked the Provisions of s. 21 of the Act which provides that notwithstanding anything contained in s. 32 of the Code it shall be lawful for a Magistrate of the first class to pass any sentence authorised by the Act in excess of his powers under s. 32 of the Code.",
      "type": "procedural",
      "date": "1958-10-30",
      "source": "high_court"
    },
    {
      "id": "f12",
      "text": "The learned Judge observed that the learned Magistrate was therefore quite competent to award all punishments that the law required and had no reason to commit the respondent to a Court of Session.",
      "type": "procedural",
      "date": "1958-10-30",
      "source": "high_court"
    },
    {
      "id": "f13",
      "text": "Mulla, J. held that the learned Judicial Magistrate had no power to commit the respondent to the Court of Session for trial and the learned Sessions Judge had no jurisdiction to try the case.",
      "type": "procedural",
      "date": "1958-10-30",
      "source": "high_court"
    },
    {
      "id": "f14",
      "text": "Mulla, J. set aside the order of conviction and the sentence passed against the respondent and remanded the case to the District Magistrate of Barabanki to be transferred by him to the Court of a competent Magistrate for trial and disposal.",
      "type": "procedural",
      "date": "1958-10-30",
      "source": "high_court"
    },
    {
      "id": "f15",
      "text": "The State has appealed to this Court against the judgment of Mulla, J.",
      "type": "procedural",
      "date": null,
      "source": "state"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Sessions Judge had jurisdiction to try the case committed to it by the Judicial Magistrate despite s. 21 of the Prevention of Food Adulteration Act, 1954.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether s. 21 of the Act is a disabling provision that prevents commitment under s. 347 CrPC and affects the jurisdiction of the Court of Session.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Sessions Judge had full jurisdiction to try the case as it was committed by a Magistrate having power to commit under the Code, and s. 21 of the Act does not affect the provisions of ss. 207 and 347 of the Code or the jurisdiction of a Court of Session.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "s. 21 Prevention of Food Adulteration Act, 1954; ss. 207, 347 CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "s. 21 of the Act prevents a commitment to the Court of Session by a Magistrate of the first class as it enables the Magistrate to award sentences beyond s. 32 CrPC limits, making the commitment void and depriving Sessions Court of jurisdiction.",
      "supporting_facts": [
        "f5",
        "f11"
      ],
      "legal_basis": "s. 21 Prevention of Food Adulteration Act, 1954; s. 347 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "We are unable to agree with the view of Mulla, J., that the learned Sessions Judge had no jurisdiction to try the case. We do not think that s. 21 of the Act is a disabling provision. All that it does is to authorise a Magistrate of the first class to award a sentence beyond the limits prescribed for him under s. 32 of the Code.",
      "addresses_issue": "i1",
      "key_observation": "s. 21 is enabling, not disabling; does not affect commitment or Sessions jurisdiction"
    },
    {
      "id": "cr2",
      "text": "The jurisdiction of a Court of Session depends upon the Code. It has jurisdiction to try any case which is committed to it. The case against the respondent had been committed to a Court of Session by a Magistrate having power to commit. Further, the Magistrate did not lack territorial jurisdiction to commit.",
      "addresses_issue": "i2",
      "key_observation": "Commitment valid even if Magistrate competent to try; s. 21 does not make commitment a nullity"
    },
    {
      "id": "cr3",
      "text": "It may be that the Magistrate was competent to try the case and award all punishments prescribed by law. It is also true that the Magistrate was not compelled to commit the case to a Court of Session. We are unable to subscribe to the view that a commitment in such circumstances is itself void.",
      "addresses_issue": "i2",
      "key_observation": "s. 21 does not take away Magistrate's power to commit or affect Sessions jurisdiction"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s. 21 of the Prevention of Food Adulteration Act, 1954 is an enabling provision that authorises Magistrates of the first class to impose sentences exceeding limits under s. 32 CrPC but does not prohibit commitment under s. 347 CrPC or deprive Sessions Court of jurisdiction.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "A Court of Session has jurisdiction to try any case committed to it by a Magistrate empowered to commit, regardless of s. 21 of the Act.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Prevention of Food Adulteration Act, 1954",
      "sections": [
        "s. 7 (cls. i and iii)",
        "s. 16 (1)(a)(iii)",
        "s. 21"
      ],
      "relevance": "Defines offences, minimum punishments for second/third offences, and empowers Magistrate first class to exceed CrPC fine limits"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 32",
        "s. 207",
        "s. 347"
      ],
      "relevance": "Limits Magistrate's fine power; provides for commitment to Sessions; basis for Sessions jurisdiction"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court allowed the State's appeal, set aside the High Court's order that had quashed the Sessions Court's conviction for lack of jurisdiction, holding that the Sessions Judge had full jurisdiction to try the case.",
    "relief_granted": "High Court order set aside; Sessions Court conviction and sentence restored implicitly",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We are unable to agree with the view of Mulla, J., that the learned Sessions Judge had no jurisdiction to try the case. We do not think that s. 21 of the Act is a disabling provision.",
      "speaker": "court",
      "significance": "Rejects High Court's interpretation and core holding on s. 21"
    },
    {
      "text": "The jurisdiction of a Court of Session depends upon the Code. It has jurisdiction to try any case which is committed to it.",
      "speaker": "court",
      "significance": "Clarifies basis of Sessions jurisdiction independent of special Act provisions"
    },
    {
      "text": "Where a special Act has made a special provision for punishment to be awarded by a Magistrate irrespective of the limitations placed upon his powers under the Criminal Procedure Code, it amounts to an abrogation of the general law and the provisions of s. 347 of the Criminal Procedure Code cannot be applied to such a case.",
      "speaker": "high_court",
      "significance": "High Court's erroneous view rejected by Supreme Court"
    }
  ],
  "_case_id": "1960_94",
  "_label": 1,
  "_text_length": 6479,
  "_extracted_at": "2026-02-10T19:52:28.573658"
}