{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Punjab v. Pandit Thakurdas Bhargava",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "K. DAS J."
    ],
    "case_number": "Civil Appeal No. 236 of 1955",
    "date_of_judgment": "1960-07-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "For the assessment year 1946-47, corresponding to account year 1945-46, Pandit Thakurdas Bhargava, an advocate of Hissar and respondent, was assessed to income tax on a total assessable income of Rs. 58,475/- including Rs. 32,500/- received in July 1945 for defending accused in Farrukhnagar case.",
      "type": "material",
      "date": "1945-07",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Assessee claimed Rs. 32,500/- was not part of professional income as it was given in trust for charity.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Income-tax Officer and Appellate Assistant Commissioner held Rs. 32,500/- as professional income; trust deed dated August 6, 1945 did not change its nature; no trust or obligation created by payers at time of receipt.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Income-tax Appellate Tribunal deleted Rs. 32,500/- from assessment, holding income did not arise to assessee; voluntary trust created upon accepting brief, payments received on behalf of trust.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Tribunal stated case to High Court under s.66 of Indian Income-tax Act on question: Whether Rs. 32,500/- received in circumstances set out in trust deed dated August 6, 1945 was professional income or money received on behalf of trust.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Punjab High Court by judgment dated August 3, 1953 answered in favour of assessee, holding Rs. 32,500/- not professional income but received on behalf of trust.",
      "type": "procedural",
      "date": "1953-08-03",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "High Court granted certificate of fitness under s.66A(2) on December 28, 1953 for appeal to Supreme Court.",
      "type": "procedural",
      "date": "1953-12-28",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "In trust deed dated August 6, 1945, respondent stated he decreased legal practice, reserved income after June 1944 for taxes and charity; agreed to conduct Farrukhnagar case (Crown v. Chuttan Lal etc.) on persistence and promise of Rs.40,000/- for charitable trust he would create; Rs.32,500/- received and deposited in bank.",
      "type": "material",
      "date": "1945-08-06",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Tribunal found assessee initially unwilling to accept brief in Farrukhnagar case; persuaded by Bar members and locals on understanding accused would provide Rs.40,000/- for charitable trust respondent would create; Rs.32,500/- paid by/on behalf of accused.",
      "type": "background",
      "date": "1945",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Assessee's affidavit: agreed accused would provide Rs.40,000/- for charitable trust he would create, on understanding money not for private purposes.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sum of Rs. 32,500/- received by the assessee in the circumstances set out in the trust deed dated August 6, 1945, was his professional income taxable in his hands, or was it money received by him on behalf of a trust and not in his capacity as an individual.",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Amount received as professional income; no trust or legal obligation imposed by payers at time of receipt; assessee created trust later out of his professional income; future application irrelevant for taxing.",
      "supporting_facts": [
        "f1",
        "f3",
        "f8",
        "f9",
        "f10"
      ],
      "legal_basis": "Indian Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "Even if trust existed, money not diverted before becoming professional income.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Rs.32,500/- received on behalf of trust created by stipulation when accepting brief; not professional income.",
      "supporting_facts": [
        "f2",
        "f4",
        "f8",
        "f9"
      ],
      "legal_basis": "Raja Bejoy Singh Dudhuria v. Commissioner of Income-tax, Bengal"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "From facts found by Tribunal, proper inference is Rs.32,500/- was professional income when paid; no trust or obligation created at that time; assessee created trust on August 6, 1945 out of his professional income.",
      "addresses_issue": "i1",
      "key_observation": "Persons paying money did not use imperative words creating trust; assessee proposed and created trust himself."
    },
    {
      "id": "cr2",
      "text": "Trust deed recitals show assessee reserved professional income for charity and created trust from money received for Farrukhnagar case.",
      "addresses_issue": "i1",
      "key_observation": "No indication payers created trust or imposed enforceable obligation."
    },
    {
      "id": "cr3",
      "text": "Principle in Bejoy Singh case not applicable as no overriding obligation at time of receipt.",
      "addresses_issue": "i1",
      "key_observation": "Voluntary desire of assessee to create trust does not create trust or obligation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rs. 32,500/- received by assessee was his professional income taxable in his hands.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Raja Bejoy Singh Dudhuria v. Commissioner of Income-tax, Bengal",
      "citation": "1933 1 I.T.R. 135",
      "treatment": "distinguished",
      "relevance": "Principle of overriding obligation not applicable as no such obligation imposed at time of receipt."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 66A(2)",
        "s. 66"
      ],
      "relevance": "Basis for certificate of fitness and stating case to High Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court judgment and order set aside; question answered in favour of appellant that Rs.32,500/- was professional income taxable in assessee's hands.",
    "relief_granted": "Restoration of assessment including Rs.32,500/- as taxable income.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the sum of Rs. 32,500/- paid to the assessee was his professional income at the time when it was paid and no trust or obligation in the nature of a trust was created at that time\"",
      "speaker": "court",
      "significance": "Core holding reversing lower courts."
    },
    {
      "text": "\"The clear statement in the trust deed... is that the assessee created a trust on certain conditions etc. It is not stated anywhere that the persons who paid the money created a trust or imposed a legally enforceable obligation on the assessee.\"",
      "speaker": "court",
      "significance": "Explains why no overriding title existed."
    }
  ],
  "_case_id": "1960_254",
  "_label": 1,
  "_text_length": 13766,
  "_extracted_at": "2026-02-10T19:55:07.226771"
}