{
  "metadata": {
    "case_name": "Diamond Sugar Mills Ltd. and another v. State of U. P. and another",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Imam J.",
      "Kapur J.",
      "Das Gupta J.",
      "Dayal J.",
      "Ayyangar J."
    ],
    "case_number": "Civil Appeal No. 35 of 1959",
    "date_of_judgment": "1960-12-13"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The first appellant is the Diamond Sugar Mills Ltd., a public limited company owning and operating a sugar factory at Pipraich in the District Gorakhpur, for the manufacture of sugar from sugarcane. The second appellant is the Director of the company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By writ application under Art. 226 dated February 24, 1956, appellants challenged imposition of cess on entry of sugarcane into their factory. On that date, U. P. Sugarcane Regulation of Supply and Purchase Act, 1953 (U. P. XXIV of 1953) was in force. Section 20 empowered Governor to impose by notification a cess not exceeding 4 annas per maund on entry of sugarcane into an area specified for consumption, use or sale therein.",
      "type": "procedural",
      "date": "1956-02-24",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The 1953 Act replaced U. P. Sugar Factories Control Act, 1938, s. 29 of which authorised Governor to impose cess not exceeding 10 per cent of minimum price or 4 annas per maund on entry into local area. Notifications issued from 1938-39 crushing season, last for 1952-53, levying 3 annas per maund on entry into local areas comprised in factories listed in schedule.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "First notification under s.20 of 1953 Act for 1954-55 crushing season levied 3 annas per maund on entry into local areas comprised in factories in schedule. Similar notifications on October 23, 1954 for 1954-55 and November 9, 1955 for 1955-56. Appellants' factory included in all schedules.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On February 24, 1956, Rs. 2,59,644-9-0 due from first appellant and further Rs. 2,41,416-3-0 liability on account of cess up to end of January 1956 unpaid.",
      "type": "material",
      "date": "1956-02-24",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellants contended s.20 of 1953 Act unconstitutional, prayed for writs directing respondents (State of U.P. and Collector of Gorakhpur) not to levy/collect cess for 1954-55, 1955-56 and successive seasons, and withdraw notifications dated October 23, 1954 and November 9, 1955.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "During pendency of writ petition No. 327 of 1956 before Allahabad High Court, U.P. Sugarcane Cess Act, 1956 (U.P. XXII of 1956) enacted, repealing 1953 Act. S.3 empowered State Government by notification to impose cess not exceeding four annas per maund on entry of cane into premises of factory for use, consumption or sale therein.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "S.9(2) and (3) of 1956 Act deemed prior notifications, assessments and collections under 1938 and 1953 Acts as under 1956 Act. Appellant prayed to raise constitutionality of 1956 Act, for writ directing not to levy cess under it.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "High Court allowed amendment, considered s.3 of 1956 Act valid, rejected petition on October 29, 1956, granted certificate under Art.132(1) and 133(1)(c).",
      "type": "procedural",
      "date": "1956-10-29",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether s.3 of U.P. Sugarcane Cess Act, 1956, empowering imposition of cess on entry of sugarcane into premises of a factory, falls within Entry 52 of State List (Tax on the entry of goods into a local area for consumption, use or sale therein), i.e., whether premises of a factory is a 'local area'.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether s.3 involves excessive delegation of legislative power by allowing Governor/State Government to fix rate of cess exceeding 4 annas without guidance.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "S.20 of 1953 Act and s.3 of 1956 Act invalid as beyond legislative competence of State Legislature; premises of factory not a 'local area' under Entry 52 State List.",
      "supporting_facts": [
        "f1",
        "f2",
        "f7"
      ],
      "legal_basis": "Entry 52 List II Seventh Schedule; ordinary meaning of 'local area'; historical legislative context"
    },
    {
      "id": "pa2",
      "text": "S.3 amounts to excessive delegation as it empowers fixation of any cess exceeding 4 annas per maund without guidance on rate.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Limits of delegated legislation"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Impugned law within Entry 52; 'local area' includes any specified area inside State, including single factory premises; presumption of constitutionality.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "Entry 52 List II; liberal construction of words conferring legislative power; Emperor v. Munnalal (Allahabad HC)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Words in constitutional entries to be interpreted liberally but not stretched beyond reasonable connotation. 'Local area' in Entry 52 means area administered by local body (municipality, district board etc.), not premises of single factory, based on historical context from GOI Act 1935 Entry 49, 1919 Act Scheduled Taxes Rules (octroi on entry into areas of local authorities), and ordinary usage.",
      "addresses_issue": "i1",
      "key_observation": "Premises of a factory is therefore not a local area."
    },
    {
      "id": "cr2",
      "text": "S.3 of 1956 Act not within Entry 52 or any other State/Concurrent List entry; entire law invalid, not severable.",
      "addresses_issue": "i1",
      "key_observation": "Cannot re-write law to save portion."
    },
    {
      "id": "cr3",
      "text": "Unnecessary to decide excessive delegation as legislation beyond competence.",
      "addresses_issue": "i2",
      "key_observation": "First ground dispositive."
    },
    {
      "id": "cr4",
      "text": "Dissent (Ayyangar J.): 'Local area' limited to units of local self-government; but s.3 valid to extent of entry from outside local area into factory; read down accordingly, remand for factual inquiry (Ayyangar J.).",
      "addresses_issue": "i1",
      "key_observation": "Valid where cane from outside local area; invalid only for intra-area entry."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Premises of a factory is not a 'local area' under Entry 52 List II; s.3 of U.P. Sugarcane Cess Act, 1956 beyond State legislative competence; entire Act invalid.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "In Re the Central Provinces Berar Act No. XIV of 1938",
      "citation": "1939 F.C.R. 18",
      "treatment": "followed",
      "relevance": "Broad and liberal spirit in interpreting legislative powers but not stretching language."
    },
    {
      "case_name": "Navinchandra Mafatlal v. Commissioner of Income Tax, Bombay City",
      "citation": "1955 1 S.C.R. 829",
      "treatment": "followed",
      "relevance": "Liberal construction of words conferring legislative power to widest amplitude."
    },
    {
      "case_name": "State of Madras v. Gannon Dunkerley Co. Ltd.",
      "citation": "1959 S.C.R. 379",
      "relevance": "Historical legislative context relevant for interpreting constitutional entries."
    },
    {
      "case_name": "Emperor v. Munnalal",
      "citation": "I.L.R. 1942 All. 302",
      "treatment": "distinguished",
      "relevance": "Allahabad HC held factory areas could be local areas under 1938 Act but not binding or correct for constitutional interpretation."
    },
    {
      "case_name": "In re Hindu Women's Rights to Property Act, 1937",
      "citation": "1941 F.C.R. 12",
      "treatment": "referred",
      "relevance": "Read down 'property' to non-agricultural to sustain validity (dissent)."
    },
    {
      "case_name": "Blackwood v. Queen",
      "citation": "1882 8 A.C. 82",
      "treatment": "referred",
      "relevance": "Construe words to competence limits (dissent)."
    }
  ],
  "statutes_cited": [
    {
      "name": "U. P. Sugarcane Regulation of Supply and Purchase Act, 1953 (U.P. XXIV of 1953)",
      "sections": [
        "Section 20"
      ],
      "relevance": "Empowered cess; repealed by 1956 Act but prior actions saved."
    },
    {
      "name": "U. P. Sugar Factories Control Act, 1938",
      "sections": [
        "Section 29"
      ],
      "relevance": "Prior cess power; notifications saved by 1956 Act."
    },
    {
      "name": "U. P. Sugarcane Cess Act, 1956 (U.P. XXII of 1956)",
      "sections": [
        "Section 3",
        "Section 9"
      ],
      "relevance": "Impugned charging section held invalid; s.9 saved prior actions deemed under it."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Entry 52 List II Seventh Schedule",
        "Article 226",
        "Article 132(1)",
        "Article 133(1)(c)",
        "Article 277",
        "Article 20"
      ],
      "relevance": "Legislative competence; writ jurisdiction; certificate for appeal."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed by majority; High Court order set aside; writ of mandamus issued directing respondents to forbear from levying and collecting cess from appellants on account of arrears for 1954-55 and successive seasons under 1956 Act.",
    "relief_granted": "Writ directing forbearance from levying/collecting cess; appellants get costs here and below.",
    "costs": "Appellants awarded costs in Supreme Court and High Court."
  },
  "key_quotes": [
    {
      "text": "'The premises of a factory is therefore not a local area. It must therefore be held that s. 3 of the U. P. Sugarcane Cess Act, 1956... did not fall within Entry 52 of the State List.'",
      "speaker": "court",
      "significance": "Core holding on legislative competence."
    },
    {
      "text": "Words conferring right of legislation interpreted liberally but guard against extending beyond reasonable connotation.",
      "speaker": "court",
      "significance": "Principle of constitutional interpretation applied."
    },
    {
      "text": "'Local area' can designate only predetermined local unit demarcated by local self-government statutes under control of local authority like municipality.",
      "speaker": "court",
      "significance": "Dissent defines 'local area' but agrees on invalidity outcome."
    }
  ],
  "_case_id": "1960_128",
  "_label": 1,
  "_text_length": 49301,
  "_extracted_at": "2026-02-10T19:53:13.277262"
}