{
  "metadata": {
    "case_name": "Nand Lal (minor) through guardian Smt. Gita Basu v. Advocate-General, Uttar Pradesh",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Criminal Appeal No. 64 of 1958",
    "date_of_judgment": "1960-04-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a minor living under the guardianship of his mother, Smt. Gita Basu.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On September 14, 1955, appellant through his mother filed application under s. 488 CrPC in Court of City Magistrate, Allahabad, praying for maintenance order against respondent, Advocate-General, Uttar Pradesh, alleging he is putative father.",
      "type": "material",
      "date": "1955-09-14",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Magistrate posted petition for evidence on September 20, 1955, without issuing notice to respondent.",
      "type": "procedural",
      "date": "1955-09-20",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On September 20, 1955, appellant's guardian examined and cross-examined at length by Magistrate; directed to produce further evidence under s. 202 CrPC, adjourned to September 26, 1955.",
      "type": "procedural",
      "date": "1955-09-20",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On September 26, 1955, one police company stable examined; endorsement that applicant would examine no other witness.",
      "type": "procedural",
      "date": "1955-09-26",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On September 27, 1955, appellant filed petition stating s. 200 CrPC had no application, no enquiry needed before notice; if treated as complaint, asked for time to adduce further evidence.",
      "type": "procedural",
      "date": "1955-09-27",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Magistrate endorsed on September 27 petition: 'lead the further evidence, please, if you like'.",
      "type": "procedural",
      "date": "1955-09-27",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On October 6, 1955, guardian examined one more witness.",
      "type": "procedural",
      "date": "1955-10-06",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "On October 6, 1955, Magistrate endorsed 'no further evidence to be led at this stage'.",
      "type": "procedural",
      "date": "1955-10-06",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On October 10, 1955, Magistrate dismissed application, holding ss. 200-203 CrPC not applicable but needed prima facie case before issuing notice; concluded respondent not father of Nand Lal.",
      "type": "procedural",
      "date": "1955-10-10",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant filed revision to Sessions Judge, Allahabad.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Sessions Judge considered materials, concluded Magistrate ought to have issued summons under s. 488(6) CrPC; referred to Allahabad High Court recommending set aside of Magistrate's order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court (Chowdhry, J.) on December 3, 1956, rejected reference in Criminal Reference No. 159 of 1956, holding Magistrate's preliminary enquiry in consonance with Code's scheme, no illegality, appellant conceded enquiry, no prejudice, finding factual, proceedings summary.",
      "type": "procedural",
      "date": "1956-12-03",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Appellant's guardian related circumstances leading to illicit intimacy with respondent, filed copies of notices sent by registered post demanding maintenance (acknowledgments received, no reply), photograph of her, respondent, and appellant.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Servant deposed seeing respondent visiting appellant's mother at odd hours.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Magistrate cross-examined guardian at great length, eliciting minute details.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether s. 488 CrPC contemplates any preliminary enquiry by Magistrate before issuing notice to opposite party.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether procedure followed by Magistrate was unjust to appellant.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Learned Magistrate followed procedure not contemplated by CrPC; enquiry unjust to appellant.",
      "supporting_facts": [
        "f3",
        "f4",
        "f9",
        "f10",
        "f16"
      ],
      "legal_basis": "s. 488 CrPC; ss. 200-203 CrPC not applicable"
    },
    {
      "id": "pa2",
      "text": "In revision: Court below erred in directing evidence under s. 200 CrPC and considering it, usurping jurisdiction not vested.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s. 488(6) CrPC mandatory: all evidence in presence of opposite party"
    },
    {
      "id": "pa3",
      "text": "No concession that Magistrate can make preliminary enquiry under s. 488; contention only that ss. 200-203 not apply.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Supported procedure adopted by Magistrate and his finding.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Appellant conceded before Magistrate and High Court that Magistrate had power to make preliminary enquiry.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No concession by appellant that Magistrate can make preliminary enquiry; contention only that ss. 200-203 not apply, meaning Magistrate cannot enquire as per those provisions but can check if ex facie frivolous.",
      "addresses_issue": "i1",
      "key_observation": "Appellant consistently contended no power for preliminary enquiry."
    },
    {
      "id": "cr2",
      "text": "s. 488 Chapter XXXVI self-contained, civil nature, summary procedure; illegitimate child entitled to maintenance if putative father neglects; Magistrate must decide paternity as jurisdictional fact.",
      "addresses_issue": "i1",
      "key_observation": "s. 488(6) mandatory: all evidence in presence of father/pleader; no preliminary enquiry contemplated."
    },
    {
      "id": "cr3",
      "text": "No scope to draw from other Code sections; notice must issue even in blackmail case, akin to civil suit.",
      "addresses_issue": "i1",
      "key_observation": "Notice benefits both parties."
    },
    {
      "id": "cr4",
      "text": "Magistrate's procedure unjust: cross-examined at length like advocate for respondent, prevented further evidence, converted enquiry to trial, oppressed by respondent's status.",
      "addresses_issue": "i2",
      "key_observation": "No double-standard in courts; appellant not given full opportunity."
    },
    {
      "id": "cr5",
      "text": "Evidence prima facie sufficient to issue notice, but Magistrate found against appellant prematurely.",
      "addresses_issue": "i2",
      "key_observation": "No opinion on merits; to be decided on full evidence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s. 488 CrPC does not contemplate preliminary enquiry before issuing notice; all evidence under Chapter to be taken in presence of respondent or pleader.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Procedure followed by Magistrate unjust; appellant not given full opportunity.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "488",
        "488(1)",
        "488(6)",
        "489",
        "490",
        "200",
        "202",
        "203"
      ],
      "relevance": "s. 488 provides summary procedure for maintenance; ss. 200-203 not applicable; s. 488(6) mandatory for evidence in presence of opposite party; no preliminary enquiry."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court and Magistrate orders set aside; Magistrate directed to proceed with application in accordance with law, issuing notice and taking evidence in presence of respondent.",
    "relief_granted": "Remand to Magistrate for fresh proceedings per s. 488 CrPC",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "All evidence under this Chapter shall be taken in the presence of the husband or father, as the case may be, or when his personal attendance is dispensed with, in the presence of his pleader.",
      "speaker": "court",
      "significance": "Mandatory procedure under s. 488(6) CrPC prohibiting preliminary enquiry."
    },
    {
      "text": "In the courts of law, there cannot be a double-standard-one for the highly placed and another for the rest.",
      "speaker": "court",
      "significance": "Critique of Magistrate's bias due to respondent's status."
    },
    {
      "text": "s. 488 of the Code does not contemplate a preliminary enquiry before issuing a notice, but lays down that all evidence under that Chapter should be taken in the presence of the respondent or his pleader.",
      "speaker": "court",
      "significance": "Core holding on procedure under s. 488."
    }
  ],
  "_case_id": "1960_192",
  "_label": 1,
  "_text_length": 19045,
  "_extracted_at": "2026-02-10T19:54:35.687617"
}