{
  "metadata": {
    "case_name": "Godavari Sugar Mills Ltd. v. Respondent",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent was a stenographer employed by the appellant, Godavari Sugar Mills Ltd., at its head office in Bombay for some years past on a salary of Rs. 135 plus Rs. 27 as dearness allowance.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent was charged with having committed acts of disobedience and insubordination.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "After a proper enquiry where respondent was given an opportunity to defend himself, he was found guilty of the alleged misconduct and dismissed by the appellant on April 22, 1955.",
      "type": "material",
      "date": "1955-04-22",
      "source": "appellant"
    },
    {
      "id": "f4",
      "text": "Respondent challenged the legality and propriety of his dismissal by an application before the Labour Court at Bombay under s. 42(4) read with s. 78(1)(a)(i) and (iii) of the Bombay Industrial Relations Act, 1946.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Appellant challenged the competence of the application on the ground that the Act did not apply to respondent's case and Labour Court had no jurisdiction.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "Parties agreed that question of jurisdiction be tried as preliminary issue; Labour Court considered objection, held notification did not apply to head office, and dismissed application.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Respondent appealed to Industrial Court, which agreed with Labour Court and dismissed appeal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Respondent appealed to Labour Appellate Tribunal, which held notification applied to head office, set aside orders below, and remanded to Labour Court for disposal on merits.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Notification No. 1131-46 issued by Government of Bombay on October 4, 1952 under s. 2(4) of the Act, directing all provisions of Act to apply to manufacture of sugar and its by-products including (1) growing of sugarcane on farms belonging to or attached to concerns engaged in said manufacture, and (2) all agricultural and industrial operations connected with growing of sugarcane or said manufacture, engaged in such concerns; Note: all service or employment connected with conduct of above industry deemed part of industry when engaged in or by employer engaged in that industry.",
      "type": "background",
      "date": "1952-10-04",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant's factories and offices attached to them situated at Lakshmiwadi and Sakharwadi, separated by hundreds of miles from head office at Bombay.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "At head office there is accounts department, establishment section, stores purchase section and legal department; machinery purchased for industry landed at Bombay, received by head office and sent to factories.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Registrar appointed under s. 11 of Act has consistently refused to recognise staff of head office as coming under the notification.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether notification No. 1131-46 issued by Government of Bombay on October 4, 1952 under s. 2(4) of Bombay Industrial Relations Act, 1946 applies to the head office of the appellant at Bombay.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Notification does not apply to head office of appellant at Bombay as it applies not to sugar industry as such but to manufacture of sugar and its by-products, and head office staff like respondent stenographer not covered even by deeming note.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "s. 2(4) of Bombay Industrial Relations Act, 1946; s. 2(19) of the Act"
    },
    {
      "id": "pa2",
      "text": "Consistent practice of registrar under s. 11 refusing to recognise head office staff under notification.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "s. 11 of the Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Notification applies to head office as there are accounts department, establishment section, stores purchase section and legal department; machinery for industry received at head office and forwarded to factories.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Note to notification deeming services connected with conduct of industry as part of industry"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Notification applies not to sugar industry as such but deliberately to manufacture of sugar and its by-products; Labour Appellate Tribunal erred by reading it as sugar industry.",
      "addresses_issue": "i1",
      "key_observation": "Expression 'manufacture of sugar and its by-products' must be given limited interpretation; inclusions in cls. (1) and (2) indicate scope."
    },
    {
      "id": "cr2",
      "text": "Deeming note includes services connected with conduct of industry but only if engaged in that industry; respondent stenographer at head office in Bombay, hundreds of miles from factories, not covered.",
      "addresses_issue": "i1",
      "key_observation": "Connection with industry must be established; head office activities like receiving machinery do not bring it within scope."
    },
    {
      "id": "cr3",
      "text": "Object of notification to confine benefits to services connected with manufacture including specified items; subsidiary services included by deeming but head office not extended.",
      "addresses_issue": "i1",
      "key_observation": "Consistent practice of registrar aligns with this construction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Notification No. 1131-46 does not apply to head office of appellant at Bombay; Labour Appellate Tribunal erred in holding otherwise.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bombay Industrial Relations Act, 1946 (Bom. XI of 1947)",
      "sections": [
        "s. 2(4)",
        "s. 42(4)",
        "s. 78(1)(a)(i)",
        "s. 78(1)(a)(iii)",
        "s. 2(19)",
        "s. 2(19)(b)(i)",
        "s. 11"
      ],
      "relevance": "Governs application to industries via notifications; provides for employee applications to Labour Court against dismissal orders; defines 'industry'"
    },
    {
      "name": "Industrial Disputes Act, 1947 (Central Act XIV of 1947)",
      "sections": [
        "s. 10"
      ],
      "relevance": "Contrasted with Bombay Act; under Central Act, dismissal dispute requires union sponsorship or group, unlike direct application under Bombay Act"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; order of Labour Appellate Tribunal set aside; respondent's application to Labour Court dismissed as incompetent due to non-applicability of notification to head office.",
    "relief_granted": "Dismissal of respondent's application",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is significant that the notification applies not to sugar industry as such but to the manufacture of sugar and its by-products.",
      "speaker": "court",
      "significance": "Core of narrow interpretation rejecting broader 'sugar industry' reading"
    },
    {
      "text": "The fact that the machinery required at the factories is received at the head office and has to be forwarded to the respective factories cannot... assist the respondent.",
      "speaker": "court",
      "significance": "Rejects respondent's connection argument for head office coverage"
    }
  ],
  "_case_id": "1960_89",
  "_label": 1,
  "_text_length": 11177,
  "_extracted_at": "2026-02-10T19:52:34.568848"
}