{
  "metadata": {
    "case_name": "Mrs. Kusumben D. Mahadevia v. Commissioner of Income-tax",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 507 of 1957",
    "date_of_judgment": "1960-03-30"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Mrs. Kusumben D. Mahadevia (assessee) residing in Bombay, holding 760 shares of Mafatlal Gagalbhai Co., Ltd., Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For assessment year 1950-51 (previous year calendar year 1949), assessed to income-tax on total income of Rs. 1,50,765 including grossed-up dividend income of Rs. 1,47,026, which included Rs. 47,120 dividends from Mafatlal Gagalbhai Co., Ltd.",
      "type": "material",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Mafatlal Gagalbhai Co., Ltd. is a private limited company with registered office at Bombay, resident and ordinarily resident in British India, doing business in former Baroda State, keeping profits derived there with Mafatlal Gagalbhai Investment Corporation, Navsari.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1949, company declared dividends out of accumulated profits in Baroda State by resolutions: (i) 25-3-1949, Rs. 17 per ordinary share for 1947, absorbing Rs. 4,29,250, payable in Navsari; (ii) 24-9-1949, Rs. 24 per ordinary share for 1948, absorbing Rs. 6,06,000, payable in Navsari on or after 30-4-1949; (iii) 24-9-1949, ad-interim Rs. 21 per ordinary share for 1949, absorbing Rs. 5,30,250, payable in Navsari on or after 30-4-1949.",
      "type": "material",
      "date": "1949-03-25",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Assessee did not bring these dividends into British India.",
      "type": "material",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Assessee claimed benefit of para. 4 of Merged States (Taxation Concessions) Order, 1949, but Tribunal held income did not accrue to her in Baroda State, as declared out of composite profits partly in British India and partly in Indian State, and shares held as asset in British India.",
      "type": "disputed",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f7",
      "text": "Tribunal referred question under s. 66(1) of Indian Income-tax Act to Bombay High Court: 'Whether the net dividend income of Rs. 47,120 accrued to the assessee in the former Baroda State, or whether it is income accrued or deemed to have accrued to the assessee in British India?'",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f8",
      "text": "Bombay High Court by order dated 28-9-1955 reframed question to: 'Whether the assessee is entitled to any concession under the Merged States (Taxation Concessions) Order, 1949, with regard to the net dividend income of Rs. 47,120?', without sending back to Tribunal.",
      "type": "procedural",
      "date": "1955-09-28",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Bombay High Court by judgment dated 20-2-1956 answered reframed question in negative, holding para. 4 of Concessions Order did not apply; did not decide accrual question.",
      "type": "procedural",
      "date": "1956-02-20",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Special leave to appeal to Supreme Court granted against High Court order and judgment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Bombay High Court had jurisdiction to reframe the question referred by the Tribunal to include applicability of Merged States (Taxation Concessions) Order, 1949, which was not decided by the Tribunal.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether net dividend income of Rs. 47,120 accrued to assessee in former Baroda State or in British India.",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court lacked jurisdiction to frame and decide question of applicability of Concessions Order, not arising out of Tribunal's order; Tribunal decided accrual in British India, and if needed, Commissioner should have sought reference on other point.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Section 66 of Indian Income-tax Act; New Jehangir Vakil Mills Ltd. v. Commissioner of Income-tax"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Main question was assessability claiming benefit of Concessions Order; accrual question ancillary and included; High Court rightly framed comprehensive question and since Concessions Order did not apply, no need to decide accrual.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "Scindia Steam Navigation Co. Ltd. v. CIT; CIT v. Breach Candy Swimming Bath Trust; Ismailia Grain Merchants Association v. CIT"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Objection of assessee well-founded; Tribunal did not address applicability of Concessions Order, decided only accrual in British India; High Court considered different matter not touched by Tribunal.",
      "addresses_issue": "i1",
      "key_observation": "Two matters neither co-extensive nor one included in other; accrual decided under Income-tax Act, independent of Concessions Order."
    },
    {
      "id": "cr2",
      "text": "Section 66 permits reference only of question of law arising out of Tribunal's order; High Court cannot decide different question not considered by Tribunal.",
      "addresses_issue": "i1",
      "key_observation": "High Court decided something Tribunal did not, and vice versa; against s.66."
    },
    {
      "id": "cr3",
      "text": "Distinguished respondent's cases as involving widening within same question; agreed with Punjab High Court in Mash Trading Co. v. CIT.",
      "addresses_issue": "i1",
      "key_observation": "Issues decided by Tribunal and High Court entirely different."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court exceeded jurisdiction under s.66 by deciding question not arising from Tribunal's order.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "New Jehangir Vakil Mills Ltd. v. Commissioner of Income-tax",
      "citation": "1959 37 I.T.R. 11",
      "treatment": "followed",
      "relevance": "High Court has no jurisdiction to direct Tribunal for supplementary statement on points not arising from its order."
    },
    {
      "case_name": "Scindia Steam Navigation Co. Ltd. v. Commissioner of Income-tax",
      "citation": "1954 26 I.T.R. 686",
      "treatment": "distinguished",
      "relevance": "Question wide enough to include alternative reasoning."
    },
    {
      "case_name": "Commissioner of Income-tax v. Breach Candy Swimming Bath Trust",
      "citation": "1955 27 I.T.R. 279",
      "treatment": "distinguished",
      "relevance": "Question wide enough to include alternative reasoning."
    },
    {
      "case_name": "Ismailia Grain Merchants Association v. Commissioner of Income-tax",
      "citation": "1957 31 I.T.R. 433",
      "treatment": "distinguished",
      "relevance": "Question widened by deleting reference to one section when another material."
    },
    {
      "case_name": "Mash Trading Co. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "High Court cannot go outside point decided by Tribunal."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "Section 66(1)"
      ],
      "relevance": "Confers jurisdiction on High Court only for questions of law arising out of Tribunal's order; does not permit deciding different questions."
    },
    {
      "name": "Merged States (Taxation Concessions) Order, 1949",
      "sections": [
        "Para 4"
      ],
      "relevance": "Assessee claimed benefit for dividends not brought into British India; Tribunal did not decide applicability; High Court held inapplicable."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Supreme Court set aside the order dated 28-9-1955 and judgment dated 20-2-1956 of Bombay High Court, and remitted the case to High Court to decide the question framed by the Tribunal.",
    "relief_granted": "Case remitted to Bombay High Court for decision on original referred question.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Section 66 of the Income-tax Act which confers jurisdiction upon the High Court only permits a reference of a question of law arising out of the order of the Tribunal. It does not confer jurisdiction on the High Court to decide a different question of law not arising out of such order.",
      "speaker": "court",
      "significance": "Core holding on limits of High Court's jurisdiction under s.66."
    },
    {
      "text": "The resulting position can be summed up by saying that the High Court decided something which the Tribunal did not, and the Tribunal decided something which the High Court did not. This is clearly against the provisions of s. 66.",
      "speaker": "court",
      "significance": "Explains why High Court exceeded jurisdiction."
    }
  ],
  "_case_id": "1960_322",
  "_label": 1,
  "_text_length": 11466,
  "_extracted_at": "2026-02-10T19:55:54.488755"
}