{
  "metadata": {
    "case_name": "S. Zoraster Co., Jaipur v. Commissioner of Income-tax",
    "case_year": 1955,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee, Messrs. S. Zoraster Co., Jaipur, consists of three partners. Two of them are karta of a joint Hindu family, and the third is a stranger.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "They had formed this partnership in June, 1940, for the manufacture and sale of blankets, felts and other woollen articles. A deed of partnership was also executed on March 16, 1944.",
      "type": "background",
      "date": "1940-06-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The assessee entered into contracts with the Government for the supply of goods.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In the assessment year 1942-43, Rs. 10,80,658-0-0 and in the assessment year 1943-44, Rs. 17,45,336-0-0 were assessed as its income by the Income-tax Officer, Contractors Circle, New Delhi.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The supplies to Government were made for Jaipur by the assessee, and payment was by cheques which were received at Jaipur and were endorsed in favour of the joint Hindu family, which acted as the assessee's bankers.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The contention of the assessee was that this income was received at Jaipur outside the then taxable territories.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "This contention was not accepted by the Income-tax Appellate Tribunal, Delhi.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The assessee then applied for a reference to the High Court under section 66(1) of the Income-tax Act, and by its order dated December 10, 1952, the Income-tax Appellate Tribunal referred the following question: Whether on the facts and circumstances of the case the profits and gains in respect of the sales made to the Government of India were received by the assessee in the taxable territories?",
      "type": "procedural",
      "date": "1952-12-10",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The Tribunal had stated in the statement of the case: The payment was made by the Government of India by cheques drawn on the Reserve Bank of India, Bombay Branch. These cheques were received in Jaipur.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "In the contract of sale between the assessee and the Government of India, the following clause was included: 21. System of payment - Unless otherwise agreed between the purchaser and the contractor payment for the delivery of the stores will be made by the Chief Auditor, Indian Stores Department, New Delhi, by cheque on a Government Treasury in India or on a branch of the Imperial Bank of India or the Reserve Bank of India transacting Government Business.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The High Court passed an order under section 66(4) of the Income-tax Act observing it would be necessary for the Appellate Tribunal to find, inter alia, whether the cheques were sent to the assessee firm by post or by hand and what directions, if any, had the assessee firm given to the Department in the matter. The High Court thereafter remanded the case to the Tribunal for a supplemental statement of the case on the lines indicated.",
      "type": "procedural",
      "date": "1955-03-24",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "This appeal, by special leave of this Court, is against the judgment and order dated March 24, 1955, of the Punjab High Court. The special leave granted by this Court is limited to the question whether the High Court had jurisdiction in this case to call for the supplemental statement.",
      "type": "procedural",
      "date": "1955-03-24",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court had jurisdiction under section 66(4) of the Indian Income-tax Act to call for a supplemental statement of the case from the Income-tax Appellate Tribunal.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court exceeded its jurisdiction in calling for a supplemental statement, on the authority of the decision of this Court in New Jehangir Vakil Mills Ltd. v. The Commissioner of Income-tax which completely covers this case.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "New Jehangir Vakil Mills Ltd. v. Commissioner of Income-tax"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The question referred was wide: Whether on the facts and circumstances of the case the profits and gains in respect of the sales made to the Government of India were received by the assessee in taxable territories? This can include an enquiry into whether there was any request, express or implied, that the amount of the bills be paid by cheques so as to bring the matter within the dicta of this Court in the Ogale Glass Works case or Jagdish Mills case.",
      "addresses_issue": "i1",
      "key_observation": "The first limit to the jurisdiction of the High Court as laid down by this Court is thus not exceeded by the High Court."
    },
    {
      "id": "cr2",
      "text": "The High Court observed that it would be necessary for the Appellate Tribunal to find inter alia whether the cheques were sent to the assessee-firm by post or by hand and what directions, if any, had the assessee-firm given to the Department in that matter. If the Tribunal has to make a fresh enquiry leading to the admission of fresh evidence on the record, then this direction offends against the ruling of this Court in the Jehangir Vakil Mills case. If, however, the direction be interpreted to mean that the Tribunal in giving the finding must confine itself to the facts admitted and/or found by it, the direction cannot be described as in excess of the jurisdiction of the High Court.",
      "addresses_issue": "i1",
      "key_observation": "In the absence of anything expressly to the contrary, we cannot hold that the direction would lead inevitably to the admitting of fresh evidence."
    },
    {
      "id": "cr3",
      "text": "The present case does not fall within the rule in the Jehangir Vakil Mills case, and is distinguishable.",
      "addresses_issue": "i1",
      "key_observation": "The question as framed in this case can include the alternative line of approach unlike the narrow question in Jehangir Vakil Mills."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The High Court did not exceed its jurisdiction under s. 66(4) of the Indian Income-tax Act in calling for a supplemental statement limited to facts on record.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "New Jehangir Vakil Mills Ltd. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "High Court exceeded jurisdiction by calling for supplemental statement on new facts not arising from Tribunal's order; this case distinguishable as question wide enough."
    },
    {
      "case_name": "Jagdish Mills Ltd. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Principle extended: endorsement on bills for payment by cheque constitutes implied request, post office agent of payee."
    },
    {
      "case_name": "Keshav Mills Co. Ltd. v. Commissioner of Income-tax",
      "citation": "1950 18 I.T.R. 407",
      "treatment": "referred",
      "relevance": "Bombay HC view on cheque collection by bank as agent."
    },
    {
      "case_name": "Sir Sobha Singh v. Commissioner of Income-tax",
      "citation": "1950 18 I.T.R. 998",
      "treatment": "referred",
      "relevance": "Punjab HC: receipt at place where bank on which cheque drawn is situated."
    },
    {
      "case_name": "Kirloskar Bros. Ltd. v. Commissioner of Income-tax",
      "citation": "1952 21 I.T.R. 82",
      "treatment": "reversed",
      "relevance": "Bombay HC called for supplemental statement; reversed by SC: intimation to remit by cheque constitutes post office as agent."
    },
    {
      "case_name": "Ogale Glass Works Ltd. v. Commissioner of Income-tax",
      "citation": "I. Tax Reference No. 19 of 1949 of Bombay H.C. decided on September 17 1951; 1954 25 I.T.R. 547 (SC)",
      "treatment": "followed",
      "relevance": "Unless payee expressly constituted post office as agent, receipt where cheque received; reversed by SC on agency by request."
    },
    {
      "case_name": "Commissioner of Income-tax v. Ogale Glass Works Ltd.",
      "citation": "1954 25 I.T.R. 547",
      "treatment": "followed",
      "relevance": "Intimation to payer to remit by cheque sufficient nomination of post office as agent."
    },
    {
      "case_name": "Commissioner of Income-tax v. Kirloskar Bros. Ltd.",
      "citation": "1954 25 I.T.R. 547",
      "treatment": "followed",
      "relevance": "Same as above."
    },
    {
      "case_name": "Kusumben D. Mahadevia v. Commissioner of Income-tax, Bombay",
      "citation": null,
      "treatment": "followed",
      "relevance": "High Court cannot decide different question not arising from Tribunal's order."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "66(1)",
        "66(4)",
        "4(1)(a)"
      ],
      "relevance": "High Court's jurisdiction to call for reference and supplemental statement; receipt of income in taxable territories."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Punjab High Court's order dated March 24, 1955, calling for a supplemental statement under s.66(4) is dismissed, as the High Court did not exceed jurisdiction; the case is distinguishable from New Jehangir Vakil Mills Ltd.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "s. 66(4) does not enable the High Court to raise a new question of law which does not arise out of the Tribunal's order and direct the Tribunal to investigate new or further facts necessary to determine this new question.",
      "speaker": "court",
      "significance": "Limits on High Court's jurisdiction under s.66(4)"
    },
    {
      "text": "The present case does not fall within the rule in the Jehangir Vakil Mills case, and is distinguishable.",
      "speaker": "court",
      "significance": "Final holding distinguishing the case and upholding High Court order."
    },
    {
      "text": "The question is wide enough to include the alternative line of approach that if there was a request, express or implied, to send the amount due under the bills by cheque, the post office would be the agent of the assessee.",
      "speaker": "court",
      "significance": "Reason why jurisdiction not exceeded."
    }
  ],
  "_case_id": "1960_198",
  "_label": 0,
  "_text_length": 18908,
  "_extracted_at": "2026-02-10T19:54:41.851200"
}