{
  "metadata": {
    "case_name": "Appellants (Firm of Merchants) v. Commissioner of Income Tax",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 304/56",
    "date_of_judgment": "1960-09-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellants are a firm of merchants carrying on business in yarn in the Districts of Trivandrum, and Nagercoil in the Travancore-Cochin State.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For the accounting year 1118 M. E. (August 17, 1942 to August 16, 1943), the appellants submitted a return under the Income Tax Act showing a net return of Rs.4,78,594-5-0 as assessable income, and they were assessed to income-tax and super tax by the Income Tax Officer on that return.",
      "type": "material",
      "date": "1942-08-17",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "In 1124 M. E., the Legislature of Travancore enacted the Travancore Taxation on Income Investigation Commission Act, 1124 Malayalam Era (Investigation Act) conferring authority upon the Government of Travancore to constitute a Commission to investigate matters relating to taxation on income, particularly evasion.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The State of Travancore-Cochin merged with the Indian Union on March 7, 1949, but the Income Tax Act and the Investigation Act continued to apply to that area notwithstanding the merger.",
      "type": "background",
      "date": "1949-03-07",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On August 6, 1949, the Government of Travancore-Cochin passed an order referring the case of the appellants to the Commission for investigation and report under s. 5 of the Investigation Act.",
      "type": "procedural",
      "date": "1949-08-06",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "On the evidence led before it, the Commission held by its report dated February 1, 1950, that the appellants had in the accounting year 1118 M. E. made a secret profit of Rs. 1,31,750 which was not included in the earlier assessment. The Commission computed the tax payable as Rs. 1,35,736-8-0 subject to credit for tax already paid.",
      "type": "material",
      "date": "1950-02-01",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The Government of Travancore-Cochin by order dated February 14, 1950, accepted the report of the Commission and directed that immediate steps be taken to recover, under the Income Tax Act, from the appellants the tax due according to the findings recorded by the Commission.",
      "type": "procedural",
      "date": "1950-02-14",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Pursuant to this direction, the Income Tax Officer, without holding any fresh assessment proceedings, issued on March 15,1950, a demand notice under s. 42 of the Income Tax Act for the additional tax imposed on the appellants according to the findings of the Commission and called upon the appellants to pay Rs. 13,337-13-0 as additional tax.",
      "type": "procedural",
      "date": "1950-03-15",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The Union Legislature enacted on April 17, 1950, the Opium and Revenue Laws Extension of Application Act providing for extension of certain laws; by s. 3, the Investigation Act continued in force with modifications including transfer of cases to Central Commission and references to State Government construed as Central Government.",
      "type": "background",
      "date": "1950-04-17",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Purporting to exercise authority under s. 8(2) of the Investigation Act read with s. 3(c) of the Opium and Revenue Laws Extension of Application Act, 1950, the Government of India, on October 25, 1951, directed that appropriate assessment proceedings under the Income Tax Act be taken against the appellants with a view to assess or reassess the concealed income of Rs. 1,31,750 which had escaped assessment.",
      "type": "procedural",
      "date": "1951-10-25",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "On January 1, 1952, the Commissioner of Income Tax withdrew the notice of demand dated March 15, 1950.",
      "type": "procedural",
      "date": "1952-01-01",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Thereafter the Income Tax Officer commenced reassessment proceedings against the appellants and by his order dated March 29, 1952, directed the appellants to pay income-tax and super tax on the concealed income.",
      "type": "procedural",
      "date": "1952-03-29",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "At the instance of the appellants, a reference was made to the High Court of Travancore-Cochin under s. 8(5) of the Investigation Act and the three questions were referred to that court.",
      "type": "procedural",
      "date": "1954-07-19",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "The High Court answered the three questions in the affirmative by judgment dated July 19, 1954.",
      "type": "procedural",
      "date": "1954-07-19",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Against the order of the High Court, this appeal has been preferred with special leave.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, there was any evidence before the Commission to come to the conclusion to which it came in its report?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "On the facts and in the circumstances of the case was the order C. No. 76/1 I.T/51 dated 25-10-1951 of the Government of India passed under the provisions of s. 8(2) of the Travancore Taxation on Income Investigation Commission Act read with s. 3 of the Opium and Revenue Laws Extension of Application Act of 1950, a legal and valid order?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether on the facts and in the circumstances of the case, the order passed by the Income Tax Officer in pursuance of the directions of the Government under s. 8(2) of the Travancore Taxation on Income Investigation Commission Act, 1124, was a legal and valid order?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Central Government may direct proceedings to be taken under the Income Tax Act only if the report was made by a Commission appointed under the Taxation on Income Investigation Commission Act, XXX of 1947, and not on a report made by a Commission appointed by the Travancore-Cochin State under the Investigation Act.",
      "supporting_facts": [
        "f5",
        "f6",
        "f10"
      ],
      "legal_basis": "s. 8(2) Investigation Act; s. 3 Opium and Revenue Laws Extension Act"
    },
    {
      "id": "pa2",
      "text": "The Travancore-Cochin Government having once taken action directing recovery of the tax due, it was not competent to the Central Government under s. 8(2) of the Investigation Act again to take any action on the report.",
      "supporting_facts": [
        "f7",
        "f8",
        "f10"
      ],
      "legal_basis": "s. 8(2) Investigation Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "There was evidence on which the Commission could arrive at the conclusion recorded by it.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The Government of India was competent to direct proceedings under s. 8(2) after the Opium Act, as State law continued with modifications construing State Government references as Central Government.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "s. 3(c) Opium and Revenue Laws Extension Act; s. 8(2) Investigation Act"
    },
    {
      "id": "ra3",
      "text": "The earlier direction did not preclude further action; the 1951 order effectuated proper assessment proceedings as required.",
      "supporting_facts": [
        "f7",
        "f8",
        "f10",
        "f12"
      ],
      "legal_basis": "s. 8(2), s. 8(4) Investigation Act; s. 25 Income Tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The High Court was competent only to check if there was any evidence, not review it; appellant concedes no challenge to first question.",
      "addresses_issue": "i1",
      "key_observation": "High Court right; no review of evidence in advisory jurisdiction."
    },
    {
      "id": "cr2",
      "text": "By s. 3 of Opium Act, Investigation Act continued with modification: references to State Government construed as Central Government; thus Central Government competent to act on the report of State Commission.",
      "addresses_issue": "i2",
      "key_observation": "Plain language of s. 3(c); no requirement for Central Commission report."
    },
    {
      "id": "cr3",
      "text": "Earlier State Government order directed recovery without assessment; Central Government order directed proper assessment proceedings, effectuating the earlier intent; nothing prevents rectification or multiple actions under s. 8(2). Findings final per s. 8(4), limitation removed per s. 8(2).",
      "addresses_issue": "i3",
      "key_observation": "ITO order valid as per directions; reassessment competent notwithstanding prior assessment."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "There was evidence before the Commission to support its conclusion.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Government of India order dated 25-10-1951 under s. 8(2) read with s. 3 Opium Act is legal and valid.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Income Tax Officer order in pursuance of Government directions under s. 8(2) is legal and valid.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Travancore Taxation on Income Investigation Commission Act, 1124 Malayalam Era",
      "sections": [
        "s. 5",
        "s. 8(1)",
        "s. 8(2)",
        "s. 8(4)",
        "s. 8(5)"
      ],
      "relevance": "Authorized reference to Commission, Government direction for proceedings, finality of findings, reference to High Court on law."
    },
    {
      "name": "Travancore Income Tax Regulation, 1096 Malayalam Era",
      "sections": [
        "s. 42",
        "s. 25"
      ],
      "relevance": "Demand notice, limitation on reassessment removed by Investigation Act."
    },
    {
      "name": "Opium and Revenue Laws Extension of Application Act, 1950 (Act XXXIII of 1950)",
      "sections": [
        "s. 2",
        "s. 3"
      ],
      "relevance": "Extended central laws; continued State Investigation Act with modifications construing State Government as Central Government."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court affirmed the High Court's answers to the three questions in the affirmative, holding that there was evidence for the Commission's findings, the Government of India order was valid, and the ITO reassessment order was valid. The appeal by special leave was dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The High Court was incompetent, in answering the question, to enter upon a review of the evidence in exercise of its advisory jurisdiction.",
      "speaker": "court",
      "significance": "Limits scope of High Court's review on first issue."
    },
    {
      "text": "On the plain language used by the Legislature in s. 3(c) of the Opium and Revenue Laws Extension of Application Act, 1950, the contention raised on behalf of the appellants is unsustainable.",
      "speaker": "court",
      "significance": "Rejects petitioner's main argument on Central Government's authority."
    },
    {
      "text": "If an unauthorised direction is given under s. 8(2), there is nothing in that provision which prevents rectification of that order.",
      "speaker": "court",
      "significance": "Allows 1951 order as rectification of improper 1950 recovery direction."
    }
  ],
  "_case_id": "1960_108",
  "_label": 0,
  "_text_length": 13800,
  "_extracted_at": "2026-02-10T19:53:14.204269"
}