{
  "metadata": {
    "case_name": "Legal Representatives of Tuljaramarao Narainrao Desai v. Legal Representatives of Rao Ba. Vithalrao Laxmanrao Thube",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Jafer Imam J.",
      "Raghubar Dayal J.",
      "A. K. Sarkar J."
    ],
    "case_number": "Civil Appeal No. 716 of 1957",
    "date_of_judgment": "1960-10-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Whole of village Nandi granted as inam to ancestor of Tuljaramarao and descendants per Sanad Ext. 54 and Inam Patrak Ext.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "No mention of any Wada existing on the Inam land in the Sanad.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Wada built after the grant on land in inam village of Nandi.",
      "type": "material",
      "date": null,
      "source": "executing_court"
    },
    {
      "id": "f4",
      "text": "Rao Ba. Vithalrao Laxmanrao Thube (Laxmanrao) brought Civil Suit No. 313 of 1943 against Tuljaramarao Narainrao Desai (Tuljaramarao) to recover Rs. 80,000 borrowed by him from plaintiff. Suit decreed on December 20, 1943.",
      "type": "material",
      "date": "1943-12-20",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Tuljaramarao died; legal representatives (present appellants) brought on record on September 21, 1944.",
      "type": "procedural",
      "date": "1944-09-21",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In April 1949, Laxmanrao filed application for execution of decree, seeking attachment and sale of properties including the Wada.",
      "type": "procedural",
      "date": "1949-04",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Appellants objected to attachment of Wada on various grounds.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Executing court on December 17, 1951 issued warrant of attachment only against the Wada.",
      "type": "procedural",
      "date": "1951-12-17",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellants appealed to Bombay High Court; Shah J. on September 3, 1953 (First Appeal No. 547/1952) set aside attachment order relying on Chagla J. in Second Appeal No. 760/1942, but gave no decision on s.60 CPC.",
      "type": "procedural",
      "date": "1953-09-03",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Letters Patent Appeal No. 50/1953: Division Bench reversed Shah J. on July 29, 1955, restored executing court's order.",
      "type": "procedural",
      "date": "1955-07-29",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court gave certificate for appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Tuljaramarao reserved some lands for home farm about 8 years before death, area 35 acres, maintained 12 bullocks and 8 servants, income Rs.20,000-25,000/year. Cattle, servants, implements kept in Wada; produce stored there. Supervised operations.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "After Tuljaramarao's death, son Appasaheb (appellant) increased home farm to 60 acres, 14 bullocks, 10-12 servants, income Rs.30,000-35,000/year. Cattle, produce in Wada where he resides.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Appasaheb has inams in 4 villages; owns lands in 10-12 villages, income Rs.35,000-40,000 from lands. Sometimes works personally in fields.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Appasaheb receives cash allowance Rs.700-800/annum and Rs.4,000-5,000 from village officers of four inam villages.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "Laxmanrao died by 1949; respondent is successor in interest.",
      "type": "background",
      "date": "1949",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Wada house ordered to be attached by the executing court is Watan property, and if so, can it be attached in execution of a decree?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If the Wada is not Watan property, is it exempted from attachment by virtue of the provisions of s. 60 of the Code of Civil Procedure?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Wada is accession to Watan land on which it stands, partakes of character of immovable property held for performance of duty appertaining to hereditary office under s.4 Bombay Hereditary Offices Act; cannot be severed.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": "Bombay Hereditary Offices Act, 1874 s.4; definition of immovable property in Bombay General Clauses Act; Chagla J. in Second Appeal No. 760 of 1942"
    },
    {
      "id": "pa2",
      "text": "Grantor (Government) had full rights; grantee could build; no reservation in Sanad; Wada rightfully constructed.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Terms of Sanad"
    },
    {
      "id": "pa3",
      "text": "Appasaheb is agriculturist; Wada belongs to and occupied by him as agriculturist; exempted under cl.(c) proviso to s.60(1) CPC. Agriculturist not restricted to personal tiller or small farmer; main source of income test; large income irrelevant.",
      "supporting_facts": [
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": "CPC s.60 proviso cl.(b),(c); Dwarka Prasad v. Municipal Board Meerut; Gowardhandas v. Mohanlal; Parvataneni Lakshmayya v. Official Receiver of Kistna (partially); Nihal Singh v. Siri Ram (contra)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Wada constructed after grant, not subject of original grant; not held/acquired/assigned for remuneration of hereditary duty; does not partake of Watan character as severable/dismantlable.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Bombay Hereditary Offices Act s.4"
    },
    {
      "id": "ra2",
      "text": "Watandar not absolute owner; land held on conditions, liable to forfeiture; building not Watan even if constructed by grantee.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Bombay Hereditary Offices Act s.60, Sch. II"
    },
    {
      "id": "ra3",
      "text": "Appasaheb not agriculturist under s.60 CPC cl.(c); must be real tiller dependent on soil tillage for living, unable to maintain otherwise; large landlord supervising labourers, substantial other income.",
      "supporting_facts": [
        "f13",
        "f14",
        "f15"
      ],
      "legal_basis": "CPC s.60 proviso cl.(b),(c); Hanmantrao Annarao v. Dhruvaraj Pandurangrao; Parvataneni Lakshmayya v. Official Receiver of Kistna"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Wada not Watan property: not part of original grant; constructed subsequently; not held/acquired for performance of hereditary duty; severable from land, dismantlable, materials removable/sellable without violating Act.",
      "addresses_issue": "i1",
      "key_observation": "Accession not applicable as not imperceptible accretion; does not partake of land's character."
    },
    {
      "id": "cr2",
      "text": "Wada not exempted under s.60(1) CPC proviso cl.(c): Appasaheb not 'agriculturist' - not real tiller dependent for living on soil tillage, unable to maintain otherwise; supervises labourers, large income from home farm plus other substantial incomes.",
      "addresses_issue": "i2",
      "key_observation": "Agriculturist in cl.(b),(c) means tiller dependent on cultivation; scheme protects from destitution; evidence shows not dependent solely on tillage."
    },
    {
      "id": "cr3",
      "text": "Dissent (Sarkar J.): Appasaheb is agriculturist (any person occupying with agriculture, even large scale via labourers, multiple incomes); Wada occupied for agriculture (storage, servants, supervision); protected under cl.(c). But Wada not Watan.",
      "addresses_issue": "i2",
      "key_observation": "Plain meaning of agriculturist; no qualifications like sole/main source, personal tilling, small scale."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Wada is not Watan property under Bombay Hereditary Offices Act s.4 as not part of original grant and severable.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Wada not exempted from attachment under CPC s.60(1) proviso cl.(c) as appellants not agriculturists within meaning (real tillers dependent on tillage).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Second Appeal No. 760 of 1942 (Chagla J.)",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Held house accession to Watan land partakes character; overruled for post-grant construction."
    },
    {
      "case_name": "Hanmantrao Annarao v. Dhruvaraj Pandurangrao",
      "citation": "1946 49 B.L.R. 867",
      "treatment": "followed",
      "relevance": "Agriculturist in s.60: personally engaged in tilling, livelihood from tillage; excludes large proprietors via servants."
    },
    {
      "case_name": "Parvataneni Lakshmayya v. The Official Receiver of Kistna",
      "citation": "I.L.R. 1937 Mad. 777",
      "treatment": "followed",
      "relevance": "Agriculturist: real tiller dependent on soil tillage, unable to maintain otherwise; not main source test alone."
    },
    {
      "case_name": "Tirloki Prasad Kunj Behari Lal",
      "citation": "A.I.R. 1935 All. 448",
      "treatment": "referred",
      "relevance": "Test: main source of income from cultivation."
    },
    {
      "case_name": "Dwarka Prasad v. Municipal Board, Meerut",
      "citation": "A.I.R. 1958 All. 561",
      "treatment": "distinguished",
      "relevance": "Cl.(b) applies to large farmers; tractor implement."
    },
    {
      "case_name": "Gowardhandas v. Mohanlal",
      "citation": "I.L.R. 1938 Nag. 461",
      "treatment": "distinguished",
      "relevance": "Agriculturist by occupation, even large scale via labourers."
    },
    {
      "case_name": "Nihal Singh v. Siri Ram",
      "citation": "1939 I.L.R. 21 Lah. 23",
      "treatment": "followed",
      "relevance": "Agriculturist personally tills, depends on tillage."
    },
    {
      "case_name": "Anantalal v. Bibhuti",
      "citation": "1944 I.L.R. 23 Pat. 348",
      "treatment": "referred",
      "relevance": "Agriculturist tills soil for livelihood; cultivation main income."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Hereditary Offices Act, 1874",
      "sections": [
        "Section 4",
        "Section 60",
        "Schedule II"
      ],
      "relevance": "Defines Watan property as movable/immovable held/acquired/assigned for hereditary office duty; land liable to forfeiture."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Section 60(1) proviso (b), (c)",
        "Section 61"
      ],
      "relevance": "Properties liable to attachment; exemptions for agriculturist's implements, cattle, seed-grain necessary for livelihood, houses occupied by agriculturist."
    },
    {
      "name": "Bombay General Clauses Act",
      "sections": [],
      "relevance": "Definition of immovable property includes house permanently fastened to land."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed with costs; High Court decision upheld that Wada is neither Watan property nor exempted under s.60 CPC as house of agriculturist; attachment order restored.",
    "relief_granted": "None to appellants; respondent entitled to attach and sell Wada.",
    "costs": "With costs (to respondent)"
  },
  "key_quotes": [
    {
      "text": "\"Watan Property has been defined in the Act to mean The moveable or immoveable property held, acquired, or assigned for providing remuneration for the performance of the duty appertaining to an hereditary office.\"",
      "speaker": "court",
      "significance": "Defines scope; Wada fails as not held/acquired for duty."
    },
    {
      "text": "\"an agriculturist in the section is a person who is really dependent for his living on tilling the soil and unable to maintain himself otherwise.\"",
      "speaker": "court",
      "significance": "Interprets 'agriculturist' under s.60 CPC; Appasaheb fails test."
    },
    {
      "text": "\"an agriculturist contemplated by the clauses is any person who occupies himself with agriculture.\"",
      "speaker": "court",
      "significance": "Dissenting view by Sarkar J. on broad meaning of agriculturist."
    }
  ],
  "_case_id": "1960_113",
  "_label": 0,
  "_text_length": 51704,
  "_extracted_at": "2026-02-10T19:53:21.147980"
}