{
  "metadata": {
    "case_name": "Appellants (heirs of Buchayya) v. Sole Trustee appointed by Hindu Religious Endowment Board (for the deity)",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur J."
    ],
    "case_number": "Civil Appeal No. 147 of 1956",
    "date_of_judgment": "1960-01-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The suit was brought by the deity through the sole trustee appointed by the Hindu Religious Endowment Board for recovery of Rs. 3,480 towards arrears of income of the property in trust for the years 1942-44 and for future payment at Rs. 1,680 (equivalent to 160 bags of paddy per year).",
      "type": "material",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f2",
      "text": "The property in dispute constituted a specific endowment for Kalyanotsavam of the deity and the defendants (appellants), who were trustees, committed default in carrying out the purpose of the trust. Prayer for recovery of expenses of Kalyanotsavam and feeding charges.",
      "type": "material",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f3",
      "text": "Defence: The inam was a personal grant for driving the car of the deity on festival days, burdened with service to the god, not a specific trust or endowment for the benefit of the idol. Other pleas: jurisdiction, res judicata, adverse possession.",
      "type": "disputed",
      "date": null,
      "source": "defendants"
    },
    {
      "id": "f4",
      "text": "Trial court (Sub Judge, Tenali, O.S. No. 64 of 1944, judgment October 31, 1947): Held grant was specific endowment for Kalyanotsavam but appellants not bound to spend whole income; decreed Rs. 200 per year as adequate; rejected other pleas.",
      "type": "procedural",
      "date": "1947-10-31",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "High Court of Madras (A.S. No. 809 of 1947, judgment August 7, 1952): Varied trial court decree; held general trustee cannot call upon specific trustee without proof of expenditure; allowed amendment of plaint to add prayer for declaration that properties and income form specific endowment for Kalyanotsavam, feeding charges, etc., and liability to pay entire income; all facts pleaded, no new facts, evidence complete.",
      "type": "procedural",
      "date": "1952-08-07",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Inam statement of 1859-60 by Buchayya (ancestor of appellants): Names inamdars/enjoyers as N. Buchayya; present enjoyment for Kalyanotsavam of deity; grantor gave land for performing Sri Swami Varus Kalyanotsavam; income Rs. 11 per annum spent on services.",
      "type": "background",
      "date": "1859",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Inam fair register of May 16, 1860: General class religious endowment; description 'For service in the pagoda. The service is performed'; original grantee ancestor of appellants; in fasli 1223 Viresalingam, 1236 Nanduri Vissanna Buchayya for service during festival; to be confirmed and continued so long as service performed; title deed T.D. 243.",
      "type": "material",
      "date": "1860-05-16",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Admissions by predecessors of appellants that they were dharmakartas of Kalyanotsavam and performing service.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "No sanad or inam title deed produced.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "At time of grant, specific charitable payments exhausted the income; subsequent increase accrues to charity.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the suit was maintainable.",
      "framed_by": "appellant"
    },
    {
      "id": "i2",
      "text": "Whether the amendment of the plaint to add prayer for declaration of specific endowment and liability for entire income should have been allowed.",
      "framed_by": "appellant"
    },
    {
      "id": "i3",
      "text": "Whether the grant was a specific endowment for Kalyanotsavam or a personal grant to appellants burdened with service obligation.",
      "framed_by": "appellant"
    },
    {
      "id": "i4",
      "text": "What portion of the income of the inam lands is to be expended on the service to the deity.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Suit not maintainable.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Amendment should not have been allowed.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Grant was personal grant to appellants burdened with provision for service, not specific endowment; words 'to continue as long as service performed' indicative of personal grant.",
      "supporting_facts": [
        "f3",
        "f6",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Property is specific endowment for Kalyanotsavam; defendants trustees defaulted.",
      "supporting_facts": [
        "f1",
        "f2",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Suit maintainability not shown to be defective.",
      "addresses_issue": "i1",
      "key_observation": "No basis shown for non-maintainability."
    },
    {
      "id": "cr2",
      "text": "Amendment rightly allowed: all allegations made, pleas raised, issue framed, parties cognizant, evidence led; declaration formal relief flowing from plaint.",
      "addresses_issue": "i2",
      "key_observation": "No change in cause of action, no fresh trial needed."
    },
    {
      "id": "cr3",
      "text": "Inam registers (1859-60 statement and 1860 fair register) show specific endowment for Kalyanotsavam; entries detail enjoyment for deity's service; no 'driving car' in original; religious endowment class; confirmed so long as service performed; predecessors' admissions as dharmakartas.",
      "addresses_issue": "i3",
      "key_observation": "Combined reading shows specific trust; two views possible but lower courts' finding supported."
    },
    {
      "id": "cr4",
      "text": "Language in registers distinguished from personal grant cases; cy-pres applied as whole income at grant time exhausted by charity, increases accrue to charity.",
      "addresses_issue": "i4",
      "key_observation": "Whole income to deity."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Suit maintainable.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Amendment properly allowed.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Grant is specific endowment for Kalyanotsavam and incidental purposes, constituting specific trust; appellants are trustees.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Whole income of inam lands to be expended for the deity via cy-pres doctrine.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hindu Religious Endowments, Madras v. Thadikonda Koteswara Rao",
      "citation": "AIR 1937 Mad. 852",
      "treatment": "followed",
      "relevance": "Distinction between 'confirmed so long as service performed' (specific endowment) and 'confirmed to party so long as he continues service' (personal grant)."
    },
    {
      "case_name": "N. Sankaranarayana Pillayan Ors.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Application of cy-pres doctrine."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court judgment varying trial court decree: confirmed specific endowment nature, allowed plaint amendment, directed whole income to deity for Kalyanotsavam etc. via cy-pres; appeal dismissed.",
    "relief_granted": "Declaration of specific endowment; entire income payable to deity.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Inam registers have always been treated as evidence of the utmost importance.",
      "speaker": "court",
      "significance": "Establishes basis for determining nature of grant."
    },
    {
      "text": "A combined reading of the two documents shows that the grant was a specific endowment and that the lands were endowed for the purpose of Kalyanotsavam.",
      "speaker": "court",
      "significance": "Core holding on nature of grant."
    },
    {
      "text": "The High Court was therefore justified in holding that the whole of the income was to go to deity.",
      "speaker": "court",
      "significance": "Application of cy-pres and final direction on income."
    }
  ],
  "_case_id": "1960_267",
  "_label": 0,
  "_text_length": 11403,
  "_extracted_at": "2026-02-10T19:55:13.843513"
}