{
  "metadata": {
    "case_name": "Assessee (son of late Maharajadhiraja of Darbhanga) v. Commissioner of Income-tax",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Civil Appeals Nos. 137 to 141 of 1958",
    "date_of_judgment": "1960-12-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is the son of the late Maharajadhiraja of Darbhanga and the brother of the present Maharaja. The father died in 1929 and the appellant was given by way of maintenance the Estate of Rajnagar. He was also given a yearly allowance of Rs. 30,000 which was later raised to Rs. 48,000.",
      "type": "background",
      "date": "1929",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "From 1929, the appellant invested his cash surplus in shares and securities, the account of which was entered in what is called Account Book No. 1.",
      "type": "background",
      "date": "1929",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "From the year 1930 onwards up to the year 1941-42 the appellant purchased a large number of shares and securities which by the accounting year 1941-42 were of the value of Rs. 14.91 lacs.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "During this period the appellant sold shares and securities in the accounting years 1936-37 and 1939-40 of the value of 1.48 lacs and 1.69 lacs respectively. He made certain amount of profits on these sales but under orders of the Commissioner of Income-tax in the former case and of the Income-tax Tribunal in the latter case, these sums were not assessed to income-tax.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In the accounting years 1942-43 to 1946-47 the appellant purchased and sold some shares and securities. Entries in Account No. 1: 1942-43: Total value at beginning Rs. 14.66 lacs, purchased Nil, sold Rs. 4.68 lacs (13 items); 1943-44: Rs. 9.98 lacs beginning, purchased Rs. 2.37 lacs (4 items), sold Rs. 4.16 lacs (12 items); 1944-45: Rs. 8.20 lacs beginning, purchased Rs. 3.05 lacs (2 items and 3 items other call money), sold Rs. 0.69 lacs; 1945-46: Rs. 10.52 lacs beginning, purchased Nil, sold Rs. 1.03 lacs (3 items); 1946-47: Rs. 9.50 lacs beginning, purchased Rs. 15.83 lacs (9 items), sold Rs. 3.39 lacs (2 items). In all these years the appellant made profits which varied from Rs. 2,56,959 in 1942-43 to Rs. 33,174 in 1946-47.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On July 16, 1940, the appellant arranged an overdraft with the Mercantile Bank of India and actually withdrew Rs. 10,000 for the purchase of shares. But his brother the Maharaja advanced to him without interest Rs. 10 lacs and thus the overdraft was paid off. A new Account was opened in the books of the appellant named No. 2 Investment Account which contained all entries in regard to shares purchased and sold from out of the money borrowed from the Maharajadhiraj.",
      "type": "material",
      "date": "1940-07-16",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In the third period, i.e., the assessment years 1944-45 to 1948-49 the profits made by the appellant from purchase and sale of shares were: 1944-45 Rs.2,62,000 and odd; 1945-46 Rs.3,95,000 and odd; 1946-47 Rs.1,57,000 and odd; 1947-48 Rs.1,33,000 and odd; 1948-49 Rs. 76,000 and odd.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Income-Tax Officer held these to be liable to income-tax as business profits.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "On appeal the Appellate Assistant Commissioner excluded the profits for the years 1944-45 and 1945-46 but for the years 1946-47 to 1948-49 the assessments were upheld.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The Appellate Tribunal held on the evidence that the appellant was to be regarded as a dealer in shares and securities and therefore the profits were assessable to income-tax.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The appellant applied for a case to be stated under s. 66(1) of the Income-tax Act. This application was dismissed but the High Court made an order under s. 66(2) of the Income-tax Act to state a case on two questions of law.",
      "type": "procedural",
      "date": "1956-04-26",
      "source": "high_court"
    },
    {
      "id": "f12",
      "text": "The High Court answered the two questions against the appellant and in favour of the Commissioner of Income-tax.",
      "type": "procedural",
      "date": "1956-04-26",
      "source": "high_court"
    },
    {
      "id": "f13",
      "text": "In July 1948 the appellant had borrowed, though without interest, a large sum of money to the extent of about Rs. 10,00,000 from his brother. He started a new account calling it No. 2 Investment Account. For the assessment years under appeal shares purchased and sold were of a large magnitude ranging from Rs. 4.68 lacs to Rs. 69 thousands in what is called the first account and from Rs. 9,64,000 or even if Port Trust Debentures are excluded Rs. 3,60,000 to Rs. 30,000.",
      "type": "material",
      "date": "1948-07",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in the circumstances of the case, there is material to support the finding of the Appellate Tribunal that the assessee was a dealer in shares and securities with respect to each of the accounts and, therefore, liable to be taxed?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether, having regard to the findings of the Appellate Tribunal in respect of 1941/42 assessment, it was open to the Appellate Tribunal in the present case to hold that the profits and the transactions of sale and purchase of shares and securities amounted to profits of business and so liable to be taxed?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "He was not carrying on the business of buying and selling shares but his purchases and sales were in the nature of investments of his surplus monies and therefore the excess amounts received by sales were capital receipts being merely surplus and not profits.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The appellant being a zamindar the buying and selling of shares was not his normal activity that he had a large income and it was his surplus income which he was investing in buying the shares and whenever he found it profitable he converted his holdings and securities and for a number of years from 1931-32 he had been buying shares but he did not sell them that the very nature of investments was such that they had to be constantly changed so that the monies invested may be used to the best advantage of the investor and that the sales were really for the purpose of reemploying the monies that he had invested to his best advantage.",
      "supporting_facts": [
        "f1",
        "f2",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The first question raised was of a wider amplitude and that it had been erroneously restricted by the High Court and that its true import was the same as of the questions which were raised in G. Venkataswami Naidu Co. v. The Commissioner of Income-tax and Oriental Investment Co., Ltd. v. The Commissioner of Income-tax, Bombay.",
      "supporting_facts": [],
      "legal_basis": "G. Venkataswami Naidu Co. v. CIT; Oriental Investment Co. Ltd. v. CIT"
    },
    {
      "id": "pa4",
      "text": "The amounts received by him in the accounting years were in the nature of capital accretions and therefore not assessable.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f7"
      ],
      "legal_basis": "Raja Bahadur Kamakshya Narain Singh v. CIT; Californian Copper Syndicate Limited v. Harris; Cooper v. Stubbs; Leeming v. Jones; Edwards v. Bairstow"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The question which the High Court had to answer was a narrow one and the answer to that on the material before the Court was rightly given in the affirmative. But even if the question is taken to be wider in amplitude, on the materials produced and on the facts proved the appellant must be held to have been rightly assessed.",
      "addresses_issue": "i1",
      "key_observation": "The facts and circumstances which the Tribunal took into consideration in arriving at the finding were the material before the Tribunal to support the finding."
    },
    {
      "id": "cr2",
      "text": "The principle applicable to such transactions is that when an owner of an ordinary investment chooses to realise it and obtains a higher price for it than he originally acquired it at, the enhanced price is not a profit assessable to income tax but where what is done is not merely a realisation or a change of investment but an act done in what is truly the carrying on of a business the amount recovered as appreciation will be assessable.",
      "addresses_issue": "i1",
      "key_observation": "In July 1948 the appellant had borrowed Rs. 10,00,000 without interest from his brother and started No. 2 Investment Account. Magnitude and frequency of purchases and sales, ratio of sales to purchases and total holdings support finding of business."
    },
    {
      "id": "cr3",
      "text": "The magnitude and the frequency and the ratio of sales to purchases and total holdings was evidence from which the Income-tax Appellate Tribunal could come to the conclusion as to the true nature of the activities of the appellant.",
      "addresses_issue": "i1",
      "key_observation": "Substantial nature of the transactions, the manner in which the books had been maintained, the magnitude of the shares purchased and sold and the ratio between the purchases and sales and the holdings support Tribunal's finding."
    },
    {
      "id": "cr4",
      "text": "The second question is wholly unsubstantial. There is no such thing as res judicata in income-tax matters.",
      "addresses_issue": "i2",
      "key_observation": "The Appellate Tribunal has placed in a tabulated form the activities of the appellant showing the buying and selling and the magnitude of holdings and it cannot be said therefore that it was not open to the Appellate Tribunal to give the finding that it did."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "There is material to support the finding of the Appellate Tribunal that the assessee was a dealer in shares and securities and therefore liable to be taxed as business profits.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "It was open to the Appellate Tribunal to hold that the profits amounted to profits of business and so liable to be taxed, notwithstanding findings in 1941/42 assessment.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "G. Venkataswami Naidu Co. v. The Commissioner of Income-tax",
      "citation": "1959 Supp. 1 S.C.R. 646",
      "treatment": "referred",
      "relevance": "Explained that adventure in nature of trade requires consideration of legal requirements of trade; purchase with intent to resell at profit is trade, but rebuttable."
    },
    {
      "case_name": "Oriental Investment Co., Ltd. v. The Commissioner of Income-tax, Bombay",
      "citation": "1958 S.C.R. 49",
      "treatment": "referred",
      "relevance": "Whether assessee's business amounted to dealing in shares or merely investment is mixed question of law and fact."
    },
    {
      "case_name": "Raja Bahadur Kamakshya Narain Singh v. The Commissioner of Income-Tax, Bihar Orissa",
      "citation": "1943 L.R.70 I.A. 180",
      "treatment": "referred",
      "relevance": "Profits realised by sale of shares may be capital if seller is ordinary investor changing securities, but income if dealer."
    },
    {
      "case_name": "Californian Copper Syndicate Limited v. Harris",
      "citation": "1904 5 T.C. 259",
      "treatment": "referred",
      "relevance": "Cited by appellant on capital accretion."
    },
    {
      "case_name": "Cooper v. Stubbs",
      "citation": "1925 10 T.C. 29, 57",
      "treatment": "referred",
      "relevance": "Cited by appellant on capital accretion."
    },
    {
      "case_name": "Leeming v. Jones",
      "citation": "1930 15 T.C. 333",
      "treatment": "referred",
      "relevance": "Cited by appellant on capital accretion."
    },
    {
      "case_name": "Edwards v. Bairstow",
      "citation": "1955 36 T.C. 207",
      "treatment": "referred",
      "relevance": "Cited by appellant on capital accretion."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s. 66(1)",
        "s. 66(2)"
      ],
      "relevance": "High Court ordered statement of case under s.66(2) after dismissing application under s.66(1)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals against the judgment and order dated April 26, 1956 of the Patna High Court are dismissed. The High Court rightly answered both questions in the affirmative and against the appellant.",
    "relief_granted": null,
    "costs": "with costs"
  },
  "key_quotes": [
    {
      "text": "when an owner of an ordinary investment chooses to realise it and obtains a higher price for it than he originally acquired it at, the enhanced price is not a profit assessable to income tax but where what is done is not merely a realisation or a change of investment but an act done in what is truly the carrying on of a business the amount recovered as appreciation will be assessable.",
      "speaker": "court",
      "significance": "Core principle distinguishing investment realization from business profits."
    },
    {
      "text": "There is no such thing as res judicata in income-tax matters.",
      "speaker": "court",
      "significance": "Rejects argument on second issue regarding prior assessment findings."
    }
  ],
  "_case_id": "1960_175",
  "_label": 0,
  "_text_length": 12949,
  "_extracted_at": "2026-02-10T19:54:10.464710"
}