{
  "metadata": {
    "case_name": "Petition No. 38 of 1959",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Petition No. 38 of 1959",
    "date_of_judgment": "1960-01-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The petitioner is a private company within the meaning of the Companies Act, 1956 and has its registered office at Kasturi Buildings, Bombay-1.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On March 24, 1954 and April 15, 1954, the petitioner entered into two contracts with the Government of India for selling to the latter two consignments of sugar - one of 9500 Long Tons of sugar of Peruvian origin and the other of 25000 metric Tons of sugar of continental origin.",
      "type": "material",
      "date": "1954-03-24",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "To fulfil the terms of the contracts, the petitioner placed orders with dealers in foreign countries.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "For the first contract dated March 24, 1954: Letter of Credit opened on 3rd April 1954; S.S. Alba sails from Salaverry, Peru on 3rd May 1954 carrying 9782.01688 Long Tons of sugar; On 26th May 1954, petitioner delivered to Central Bank of India Limited, Bombay, along with invoice for Rs. 50,35,405-11-0, the Documents of Title viz. Bills of Lading duly endorsed in favour of Government of India, Ministry of Food & Agriculture, and instructed bankers to present to Government and collect amount from Deputy Accountant General, Food Rehabilitation, New Delhi; Payment made on 7th June 1954; Arrival at Bombay harbour on 26th June 1954.",
      "type": "material",
      "date": "1954-03-24",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "For the second contract: Letters of Credit opened June 1954; Vessels S. Eleni (9910.858 Tons), S.S. Inger Stathatos (9919.7158 Tons), S.S. Giovanni (4464.315 Tons), total 24292.8888 Tons; Sailing dates July 1954; Documents delivered to Bank of Baroda Limited, Bombay with invoices totalling Rs. 50,43,501-8-0, Rs. 22,69,800-13-0, Rs. 50,38,997-14-0, endorsed to Government of India; Payments made July/August 1954; Arrivals August/September 1954.",
      "type": "material",
      "date": "1954-04-15",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Some weeks before vessels arrived at Bombay harbour, i.e., when vessels were on high seas, Government of India received documents of title including bills of lading and paid the price to petitioner.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "After goods reached port, they were unloaded, taken delivery of, and cleared by Government of India after paying customs duties.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "For assessment year 1954-55 (April 1, 1954 to March 31, 1955), petitioner assessed to sales tax by Sales Tax Officer, Licence Circle, Division 1, Bombay, who deducted price of the two sales from turnover.",
      "type": "procedural",
      "date": "1954-04-01",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On January 31, 1958, first respondent (Assistant Collector of Sales Tax) issued notice to petitioner under s.31 of Bombay Sales Tax Act, 1953 proposing to review assessment order of Sales Tax Officer.",
      "type": "procedural",
      "date": "1958-01-31",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Petitioner contended before first respondent that notice should be under s.15 not s.31 as sales disclosed and deduction allowed; and sales in course of import not liable to tax.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "First respondent rejected contentions, held sales tax payable, reassessed to Rs.10,22,850-12-0 less Rs.315-3-0 paid, i.e., Rs.10,22,535-9-0; directed second respondent (Sales Tax Officer) to issue notice of demand dated February 14, 1959.",
      "type": "procedural",
      "date": "1959-02-09",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Petitioner filed petition under Art.32 for writ of certiorari to quash order of first respondent dated February 9, 1959 and demand notice.",
      "type": "procedural",
      "date": "1959",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sales by petitioner to Government of India took place in the course of import of goods into India under Art.286(1)(b) Constitution as it stood before Sixth Amendment Act, 1956, and thus not liable to sales tax by Bombay State.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether sales exempted under explanation to Art.286(1) as goods delivered for consumption in States other than Bombay.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether sales effected outside State of Bombay (New Delhi) and exempted under Art.286(1)(a).",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether first respondent could interfere under s.31 Bombay Sales Tax Act, 1953, or only under s.15 within 3 years from end of assessment year 1954-55.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under Art.286(1)(b) Constitution pre-Sixth Amendment, sales took place in course of import into India.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Art.286(1)(b) Constitution"
    },
    {
      "id": "pa2",
      "text": "Sales exempted by Bombay State under explanation to Art.286(1) as goods for consumption outside Bombay.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Explanation to Art.286(1) Constitution"
    },
    {
      "id": "pa3",
      "text": "Sales effected in New Delhi, outside Bombay, exempted under Art.286(1)(a).",
      "supporting_facts": [],
      "legal_basis": "Art.286(1)(a) Constitution"
    },
    {
      "id": "pa4",
      "text": "Notice issued under s.31 invalid; should be under s.15 within 3 years from March 31, 1955.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "s.15 and s.31 Bombay Sales Tax Act, 1953"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sales not in course of import; property in goods did not pass to Government till actual delivery at port despite delivery of shipping documents.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Terms of contracts (clauses 5,9,11); non-transferable licence; seller chartered ship"
    },
    {
      "id": "ra2",
      "text": "Notice properly under s.31; sales liable to tax.",
      "supporting_facts": [
        "f8",
        "f9",
        "f11"
      ],
      "legal_basis": "s.31 Bombay Sales Tax Act, 1953"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Phrase 'in the course of the import' means period from crossing customs barrier in foreign country to crossing in India; sale occasions import or by transfer of shipping documents while on high seas is in course of import.",
      "addresses_issue": "i1",
      "key_observation": "Course of import begins when goods cross foreign customs barrier and ends when cross Indian; transfer of bill of lading operates as constructive delivery."
    },
    {
      "id": "cr2",
      "text": "Petitioner's sales to Government by delivery of endorsed bills of lading against payment while goods on high seas constitute sale in course of import under fourth principle derived from precedents.",
      "addresses_issue": "i1",
      "key_observation": "Bill of lading symbolizes goods; indorsement and delivery passes property."
    },
    {
      "id": "cr3",
      "text": "Contract terms do not indicate intention to postpone passing of property till actual delivery; clauses consistent with mercantile usage; circumstances show parties intended property to pass on delivery of documents.",
      "addresses_issue": "i1",
      "key_observation": "No clause postpones property passing; safeguards pre-shipment; liabilities post-passage do not affect."
    },
    {
      "id": "cr4",
      "text": "Seller chartering ship and non-transferable licence do not prevent property passing.",
      "addresses_issue": "i1",
      "key_observation": "Licence for fulfilling contract; Government used it to clear goods."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sales by petitioner to Government of India took place in course of import when shipping documents delivered against payment while goods on high seas; exempt from sales tax under Art.286(1)(b) Constitution.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Travancore-Cochin v. Shanmugha Vilas Cashew Nut Factory",
      "citation": "1954 S.C.R. 53",
      "treatment": "followed",
      "relevance": "Interpretation of 'in the course of import/export'; limits as customs barriers; sales/purchases by transfer of shipping documents while goods en route within exemption."
    },
    {
      "case_name": "State of Travancore-Cochin v. The Bombay Co. Ltd.",
      "citation": "1952 S.C.R. 1112",
      "treatment": "followed",
      "relevance": "Sale which occasions export is in course of export; analogous to import."
    },
    {
      "case_name": "Sanders Brothers v. Maclean & Co.",
      "citation": "1883 11 Q.B.D. 327",
      "treatment": "followed",
      "relevance": "Legal effect of indorsement and delivery of bill of lading: symbolical delivery passing property in goods afloat."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 286(1)(b)",
        "Art. 286(1)(a)",
        "Art. 32"
      ],
      "relevance": "Art.286(1)(b) pre-Sixth Amendment exempts sales in course of import; explanation to Art.286(1); Art.32 for writ petition."
    },
    {
      "name": "Bombay Sales Tax Act, 1953",
      "sections": [
        "s.46",
        "s.31",
        "s.15"
      ],
      "relevance": "Deduction under s.46; review under s.31; alternative s.15 time-barred."
    },
    {
      "name": "Companies Act, 1956",
      "sections": [],
      "relevance": "Petitioner is private company within meaning."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Order of Assistant Collector of Sales Tax dated February 9, 1959 setting aside STO's order allowing deduction set aside; STO's original order restored; sales exempt under Art.286(1)(b).",
    "relief_granted": "Writ of certiorari quashing demand notice; original assessment restored.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The course of import, therefore, starts from one point and ends at another. It starts when the goods cross the customs barrier in foreign country and ends when they cross the customs barrier in the importing country.\"",
      "speaker": "court",
      "significance": "Defines temporal scope of 'in the course of import'."
    },
    {
      "text": "\"A bill of lading... by the law merchant is universally recognised as its symbol, and the indorsement and delivery of the bill of lading operates as a symbolical delivery of cargo.\"",
      "speaker": "court",
      "significance": "Establishes constructive transfer of property via bill of lading."
    },
    {
      "text": "\"Our conclusions may be summed up as follows- ... Sales in the State by the exporter or importer by transfer of shipping documents while the goods are beyond the customs barrier are within the exemption.\"",
      "speaker": "court",
      "significance": "Summarizes exemption principles from precedent applied here."
    }
  ],
  "_case_id": "1960_216",
  "_label": 1,
  "_text_length": 28039,
  "_extracted_at": "2026-02-10T19:54:40.256620"
}