{
  "metadata": {
    "case_name": "Appellants v. Income-tax Officer, Bellari, Special Circle, Bangalore",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "HIDAYATULLAH, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "For the assessment year 1948-49, the appellants failed to file a return within the prescribed time.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Income-tax Officer, acting under section 28(1)(a) of the Indian Income-tax Act, issued a notice to the appellants to show cause why penalty should not be imposed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In answer to the notice, the appellants filed a written reply.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Income-tax Officer proceeded to levy a penalty of Rs. 16,000 without affording a hearing to the appellants as required by the third sub-section of section 28 of the Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellants appealed to the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Appellate Assistant Commissioner held that the order was defective, set it aside, and directed the refund of the penalty if it had been recovered.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On receipt of the order, the Income-tax Officer issued a further notice calling upon the appellants to appear before him for an opportunity of being heard, intimating that if no appearance was made, he would proceed on the written statement filed earlier.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Before the Income-tax Officer could decide the case, the appellants filed a petition under article 226 of the Constitution for a writ of prohibition or other appropriate writ against the Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The High Court of Mysore dismissed the petition in limine, holding that the contention raised by the appellants may perhaps be raised before the Income-tax authorities.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The appellants applied for special leave to the Supreme Court, leave was granted, and the matter came up before the Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Income-tax Officer can continue the penalty proceedings from the stage at which the illegality (lack of hearing under section 28(3)) occurred after the Appellate Assistant Commissioner set aside the original penalty order.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the original show cause notice under section 28(1)(a) remains operative despite the Appellate Assistant Commissioner's order, allowing proceedings to relate back.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the penalty proceedings are concluded such that the Income-tax Officer cannot reassess penalty.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order of the Appellate Assistant Commissioner became final as no appeal was taken by the Commissioner of Income-tax to the Appellate Tribunal under sub-section (2) of section 33, so the Income-tax Officer could no longer proceed to reassess the penalty.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": "Jos Chacko Poothokaran v. Income-tax Officer, Ernakulam Circle (Kerala High Court); sub-section (2) of section 33"
    },
    {
      "id": "pa2",
      "text": "Such proceedings could only be taken during the course of assessment proceedings, which are concluded.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The requirements of section 28(1)(a) were completely fulfilled by the initial notice, and the omission to file return attracted clause (a) of sub-section (1) of section 28.",
      "addresses_issue": "i1",
      "key_observation": "No question on initial initiation."
    },
    {
      "id": "cr2",
      "text": "Sub-section (3) of section 28 requires affording a reasonable opportunity of being heard before imposing penalty, which was denied, vitiating the order during the course of proceedings.",
      "addresses_issue": "i1",
      "key_observation": "Illegality supervened during proceedings, not at initial stage."
    },
    {
      "id": "cr3",
      "text": "The Appellate Assistant Commissioner's order set aside the defective order and directed refund if recovered, correcting the error and leaving it open to the Income-tax Officer to continue from the stage of illegality; no express remand necessary.",
      "addresses_issue": "i1",
      "key_observation": "Order interpreted as directing continuation after correction."
    },
    {
      "id": "cr4",
      "text": "The Kerala High Court decision in Jos Chacko Poothokaran is beside the point; the Appellate Assistant Commissioner vacated the order due to illegality, allowing the Income-tax Officer to proceed from that point.",
      "addresses_issue": "i1",
      "key_observation": "Distinguishes the cited case."
    },
    {
      "id": "cr5",
      "text": "The show cause notice did not cease to be operative; proceedings initiated lawfully continue as 'during the course of assessment proceedings' and relate back to the first notice.",
      "addresses_issue": "i2",
      "key_observation": "Notice remains dispositive."
    },
    {
      "id": "cr6",
      "text": "The Income-tax Officer is within jurisdiction to continue proceedings from the stage of illegality and assess penalty if circumstances require.",
      "addresses_issue": "i3",
      "key_observation": "Proceedings not concluded."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Income-tax Officer is well within his jurisdiction to continue the proceedings from the stage at which the illegality has occurred and to assess the appellants to a penalty, if any, which the circumstances of the case may require.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The original show cause notice under section 28(1)(a) remains operative, and proceedings relate back to its issuance.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jos Chacko Poothokaran v. Income-tax Officer, Ernakulam Circle",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Cited by appellants; court holds reason given is beside the point as AAC vacated order due to illegality during proceedings."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "28(1)(a)",
        "28(3)",
        "33(2)"
      ],
      "relevance": "Governs initiation of penalty for non-filing return, requirement of hearing before imposition, and appeals; violation of hearing vitiated order but allowed continuation."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "226"
      ],
      "relevance": "Basis for High Court petition for writ of prohibition, dismissed in limine."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, holding that the Income-tax Officer could continue penalty proceedings from the stage where the lack of hearing vitiated the original order, as the show cause notice remained operative and proceedings related back.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Sub-section (3) of section 28, however, requires that the penalty shall not be imposed without affording to the assessee a reasonable opportunity of being heard.",
      "speaker": "court",
      "significance": "Identifies the specific illegality that vitiated the original penalty order."
    },
    {
      "text": "That notice having remained still to be disposed of, the proceedings not started can be described as during the course of the assessment proceedings, because the action will relate back to the time when the first notice was issued.",
      "speaker": "court",
      "significance": "Core reasoning allowing continuation of proceedings."
    },
    {
      "text": "In our opinion, the Income-tax Officer is well within his jurisdiction to continue the proceedings from the stage at which the illegality has occurred.",
      "speaker": "court",
      "significance": "Key holding upholding ITO's authority."
    }
  ],
  "_case_id": "1960_19",
  "_label": 0,
  "_text_length": 5110,
  "_extracted_at": "2026-02-10T19:51:44.930312"
}