{
  "metadata": {
    "case_name": "Appellants (Gunnies Dealers) v. State (Respondent)",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "HIDAYATULLAH, J."
    ],
    "case_number": "Civil Appeals Nos. 223 and 224 of 1960",
    "date_of_judgment": "1960-12-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In the year 1952-53, for which the assessment of sales tax was in question, the appellants dealt in gunnies, and purchased them from two Mills in Vishakapatnam District.",
      "type": "material",
      "date": "1952-53",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellants first entered into contracts with the Mills agreeing to purchase gunnies at a certain rate for future delivery. Exhibit A-1 is a specimen of such contracts.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellants also entered into agreements with the Mills, by which the Mills agreed to deliver the goods to third parties if requested by the appellants. The Mills did not accept the third parties as contracting parties but only as agents of the appellants. Exhibits A-2 and A-2a are specimen agreements of this kind.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Before the date of delivery, the appellants entered into agreements with third parties, by which they charged something extra from the third parties and handed over to them the delivery orders, which were known as kutcha delivery orders. Exhibits A-3 and A-4 are specimens of the agreement and the delivery orders respectively.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Mills used to deliver the goods against the kutcha delivery orders along with an invoice and a bill, of which Exs. A-6 and A-7 are specimens respectively, and collected the sales tax from the third parties.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The tax authorities treated the transaction between the appellants and third parties as a fresh sale, and sought to levy sales tax on it again.",
      "type": "material",
      "date": null,
      "source": "tax_authorities"
    },
    {
      "id": "f7",
      "text": "Appellants contended that sales tax on the transaction between appellants and third parties was not demandable, as there was no second sale.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Appellants failed before the Deputy Commercial Tax Officer, Guntur.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellants' appeals to the Deputy Commissioner of Commercial Taxes, Guntur and the Andhra Sales Tax Appellate Tribunal, Guntur, were unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellants filed revision to the High Court under the Madras General Sales Tax Act, 1939 as amended by Madras Act No. 6 of 1951, but were unsuccessful. High Court granted certificates on November 23, 1956, in Tax Revision Cases Nos. 17 and 18 of 1956.",
      "type": "procedural",
      "date": "1956-11-23",
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the agreement and delivery of the kutcha delivery order to third parties amounted to a sale of goods or only an assignment of a right to obtain delivery of the gunnies, which were not in existence at the time or appropriated to the contract.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "In the alternative, whether the transaction was only an assignment of a forward contract.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether there were two separate sales (Mills to appellants, and appellants to third parties) taxable at both points, or only one sale.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The agreement and the delivery of the kutcha delivery order did not amount to a sale of goods, but was only an assignment of a right to obtain delivery of the gunnies, which were not in existence at the time of the transaction with third parties, and were not appropriated to the contract.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "In the alternative, this was only an assignment of a forward contract.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "There was only one transaction of sale between the Mills and the third parties, who, on the strength of the assignment of the right to take delivery, had received the goods from the Mills.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The transaction between the appellants and third parties was a fresh sale, and sales tax was leviable on it.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Madras General Sales Tax Act, 1939 as amended"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Mills had made clear in their agreements that they were not recognising the third parties as contracting parties having privity with them, and that delivery would be given against the kutcha delivery orders to the third parties as agents of the appellants.",
      "addresses_issue": "i1",
      "key_observation": "Mills recognised only the appellants as contracting parties, and there was thus a sale to the appellants from the Mills, on which sales tax was correctly demanded and was paid."
    },
    {
      "id": "cr2",
      "text": "In so far as the third parties were concerned, they had purchased the goods by payment of an extra price, and the transaction must, in law and in fact, be considered a fresh transaction of sale between the appellants and the third parties.",
      "addresses_issue": "i3",
      "key_observation": "A delivery order is a document of title to goods vide s. 2(4) of the Sale of Goods Act, and the possessor of such a document has the right not only to receive the goods but also to transfer it to another by endorsement or delivery."
    },
    {
      "id": "cr3",
      "text": "At the moment of delivery by the Mills to the third parties, there were, in effect, two deliveries, one by the Mills to the Appellants, represented by the appellants' agents, the third parties, and the other, by the appellants to the third parties as buyers from the appellants. These two deliveries might synchronise in point of time, but were separate, in point of fact and in the eye of law.",
      "addresses_issue": "i3",
      "key_observation": "If a dispute arose as to the goods delivered under the kutcha delivery order to the third parties against the Mills, action could lie at the instance of the appellants. The third parties could proceed on breach of contract only against the appellants and not against the Mills."
    },
    {
      "id": "cr4",
      "text": "There being two separate transactions of sale, tax was payable at both the points, as has been correctly pointed out by the tax authorities and the High Court.",
      "addresses_issue": "i3",
      "key_observation": "The appellants relied upon State of Andhra v. Kolla Sreeramamurty, but there the facts were different."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "There were two separate transactions of sale: one from Mills to appellants, and another from appellants to third parties.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Sales tax was payable on both transactions.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "The Sales Tax Officer, Pilibhit v. Messrs. Budh Prakash Jai Prakash",
      "citation": "1955 1 S.C.R. 243",
      "treatment": "distinguished",
      "relevance": "Relied upon by appellants in High Court to show transactions were not sales, but High Court showed inapplicability; not relied before Supreme Court."
    },
    {
      "case_name": "Poppatlal Shah v. The State of Madras",
      "citation": "1953 S.C.R. 677",
      "treatment": "distinguished",
      "relevance": "Relied upon by appellants in High Court to show transactions were not sales, but High Court showed inapplicability; not relied before Supreme Court."
    },
    {
      "case_name": "The State of Andhra v. Kolla Sreeramamurty",
      "citation": "Second Appeals Nos. 194 & 195 of 1954 decided on June 27, 1957",
      "treatment": "distinguished",
      "relevance": "Relied by appellants, but facts different: property in goods did not pass from mills to assessee and no agreement of sale to third party."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras General Sales Tax Act, 1939",
      "sections": [
        "as amended by Madras Act No. 6 of 1951"
      ],
      "relevance": "Governed the revisions filed by appellants; basis for levy of sales tax on second transaction."
    },
    {
      "name": "Sale of Goods Act",
      "sections": [
        "s. 2(4)"
      ],
      "relevance": "Defines delivery order as document of title to goods, enabling right to receive and transfer goods."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals fail and are dismissed with costs.",
    "relief_granted": null,
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "A delivery order is a document of title to goods vide s. 2(4) of the Sale of Goods Act, and the possessor of such a document has the right not only to receive the goods but also to transfer it to another by endorsement or delivery.",
      "speaker": "court",
      "significance": "Explains legal nature of kutcha delivery order, supporting finding of two sales."
    },
    {
      "text": "These two deliveries might synchronise in point of time, but were separate, in point of fact and in the eye of law.",
      "speaker": "court",
      "significance": "Key to holding that there were two distinct sales taxable separately."
    },
    {
      "text": "There being two separate transactions of sale, tax was payable at both the points.",
      "speaker": "court",
      "significance": "Core holding affirming tax liability on second sale."
    }
  ],
  "_case_id": "1960_70",
  "_label": 0,
  "_text_length": 6805,
  "_extracted_at": "2026-02-10T19:52:26.350971"
}