{
  "metadata": {
    "case_name": "Appellant No. 1 and Appellant No. 2 v. State",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Criminal Appeal No. 159 of 1957",
    "date_of_judgment": "1960-03-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On June 15, 1948, the Textile Commissioner invited tenders for dyeing Pugree Cloth.",
      "type": "background",
      "date": "1948-06-15",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Parikh Dyeing and Printing Mills Ltd. (the company), of which first appellant was Managing Director and second appellant was a Director and technical expert, submitted a tender which was accepted on July 27, 1948, subject to certain general and special conditions.",
      "type": "material",
      "date": "1948-07-27",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Pursuant to the contract, 2,51,059-3/4 yards of cloth were supplied to the company for dyeing.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The company failed to dye the cloth within the stipulated period and there was correspondence in that behalf between the company and the Textile Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Approximately 1,11,000 yards out of the cloth were dyed and delivered to the Textile Commissioner.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On March 25, 1950, the company requested the Textile Commissioner to cancel the contract and by letter dated April 3, 1950, the Textile Commissioner complied, cancelling the contract in respect of 96,128 yards.",
      "type": "material",
      "date": "1950-04-03",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On November 20, 1950, the contract was cancelled by the Textile Commissioner in respect of the balance of cloth and the company was called upon to give an account without any further delay of the balance undelivered and informed it would be held responsible for material spoiled or not accounted for.",
      "type": "material",
      "date": "1950-11-20",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On December 4, 1950, the company sent a statement of account setting out quantity actually delivered for dyeing, quantity returned duly dyed, and balance of 1,32,160 yards remaining to be delivered; claimed wastage allowance of 2,412 yards and admitted liability to deliver 1,29,748 yards lying with it on Government account.",
      "type": "admitted",
      "date": "1950-12-04",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In December 1950, the first appellant left Bombay to take up management of a factory in Ahmedabad and affairs of the company were managed by one R. K. Patel.",
      "type": "background",
      "date": "1950-12",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In June 1952, application for adjudicating the two appellants insolvents filed in Insolvency Court at Ahmedabad; insolvency notice against them at instance of another creditor in Bombay High Court; proceedings for winding up the company commenced in Bombay High Court.",
      "type": "background",
      "date": "1952-06",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Mortgagee of machinery and factory entered into possession under covenant reserved.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Textile Commissioner attempted to recover undelivered cloth; letter posted April 16, 1952 calling upon company to deliver 51,756 yards to Chief Ordnance Officer, Ordnance Depot, Sewri, returned undelivered; served on second appellant in October 1952 with police help.",
      "type": "procedural",
      "date": "1952-04-16",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On November 7, 1952, another letter addressed to company, served on second appellant November 25, 1952, reminding of 1,35,726-3/4 yards lying with it, instructions to deliver not attended to, called for representatives to clarify and account.",
      "type": "procedural",
      "date": "1952-11-25",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "After receiving letter, second appellant attended Textile Commissioner's office; on November 27, 1952, wrote letter stating material old, dhobibleached in different lots, unsuitable for dyeing, suffered losses Rs.40,000; offered to cooperate and make good government's bare cost, sought appointment.",
      "type": "material",
      "date": "1952-11-27",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On December 29, 1952, premises of company and residences of appellants raided, no trace of cloth found.",
      "type": "material",
      "date": "1952-12-29",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Complaint filed with police charging appellants with criminal breach of trust in respect of 1,32,404 yards of cloth belonging to Government.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "No dispute that approximately 1,30,000 yards not returned; company admitted liability for 1,29,748 yards by letter Dec 4, 1950, not returned despite demands.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Appellants as directors had dominion over the cloth, not questioned; plea of other directors having dominion negatived by High Court.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "At trial, appellants explained disappearance: cloth old, eaten by white-ants and moths, thrown away as rubbish; not accepted by High Court.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f20",
      "text": "First appellant admitted often visiting Bombay after migrating to Ahmedabad, visiting mill, finding heap smaller, told by watchman of sweepings thrown away daily, shown pits filled with sweepings.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f21",
      "text": "Letter Nov 27, 1952 written by second appellant under instructions of first appellant; first appellant informed of Textile Commissioner's letter, deputed second appellant, informed prepared to pay after deducting damages.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f22",
      "text": "No information given to Textile Commissioner after Dec 4, 1950 about cloth eaten by white-ants/moths; no evidence led in support.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Directors' meetings held but minutes not produced; books of account evidencing disbursements for meetings/expenses for collection/throwing sweepings not produced.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f24",
      "text": "Counsel contended goods possibly passed to mortgagees, but no evidence led.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f25",
      "text": "Trial: Additional Sessions Judge convicted both under s.409 r/w s.34 IPC; first appellant RI 5 years, second RI 4 years.",
      "type": "procedural",
      "date": "1955-10-03",
      "source": "lower_court"
    },
    {
      "id": "f26",
      "text": "High Court: Reviewed evidence due to jury misdirection, upheld conviction, reduced sentences: first to 3 years RI, second to 1 year RI.",
      "type": "procedural",
      "date": "1956-02-14",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the conviction of the appellants under s.409 read with s.34 IPC for criminal breach of trust is sustainable on the evidence, given failure to account for entrusted cloth and explanations provided.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether physical presence of first appellant at time of misappropriation is required for liability under s.409 r/w s.34 IPC.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether conviction under s.409 alone (without explicit s.34) is invalid when charged under s.409 r/w s.34.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether sentences are unduly severe and distinction between appellants justified.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Failure to return cloth gives rise to civil liability only, not criminal breach of trust.",
      "supporting_facts": [
        "f17",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "First appellant left Bombay in 1950, settled in Ahmedabad, preoccupied with insolvency, unable to attend to company affairs; no criminal misappropriation attributable.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Explanation of cloth destroyed by white-ants/moths/watchman reports credible.",
      "supporting_facts": [
        "f19",
        "f20"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Goods possibly passed to mortgagees.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Charge under s.409 r/w s.34 requires physical presence at misappropriation per Shreekantiah case.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Shreekantiah Ramayya Munipalli v. State of Bombay (1955) 1 SCR 1177"
    },
    {
      "id": "pa6",
      "text": "High Court erred in convicting under s.409 without s.34 when charged under s.409 r/w s.34.",
      "supporting_facts": [
        "f25",
        "f26"
      ],
      "legal_basis": null
    },
    {
      "id": "pa7",
      "text": "Sentence unduly severe; no distinction between appellants.",
      "supporting_facts": [
        "f25",
        "f26"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Direct evidence of misappropriation lacking, but entrustment proved, dominion by appellants as directors proved, failure to account despite duty, in light of circumstances (false explanation, no production of records), justifies inference of dishonest misappropriation/conversion.",
      "addresses_issue": "i1",
      "key_observation": "Conviction may be founded on failure to account + untrue explanation."
    },
    {
      "id": "cr2",
      "text": "Appellants' plea of destruction by white-ants/moths rejected: no prior intimation to Textile Commissioner, no evidence led, inconsistent with admissions of liability in letters.",
      "addresses_issue": "i1",
      "key_observation": "False defence + absent records establish criminal intent."
    },
    {
      "id": "cr3",
      "text": "First appellant continued involvement post-1950: frequent visits to mill, aware of disappearance, instructed letter Nov 27, 1952 admitting liability to pay.",
      "addresses_issue": "i2",
      "key_observation": "Frequent visits and directions show participation."
    },
    {
      "id": "cr4",
      "text": "S.34 liability does not require physical presence in all cases; essence is common intention and participation in action, which need not be physical presence for non-violent offences.",
      "addresses_issue": "i2",
      "key_observation": "Distinguishes Shreekantiah as fact-specific; applies Barendra Kumar principle of participation."
    },
    {
      "id": "cr5",
      "text": "Charge under s.409 r/w s.34 invokes joint liability principle; s.34 not creating offence but principle; conviction under s.409 where reasons show joint liability is not illegal, reference to s.34 surplusage.",
      "addresses_issue": "i3",
      "key_observation": "High Court order not illegal."
    },
    {
      "id": "cr6",
      "text": "Sentences not excessive; distinction justified as first appellant Managing Director with primary dominion, second technician.",
      "addresses_issue": "i4",
      "key_observation": "Property of considerable value misappropriated."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Entrustment and dominion over cloth proved; failure to account with false explanation and absent records warrants inference of dishonest misappropriation under s.409 IPC.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Liability under s.409 r/w s.34 does not require physical presence where common intention and participation established, even if acts at different times/places.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Conviction recorded under s.409 (omitting s.34 reference) valid when charged under s.409 r/w s.34 and reasons establish joint liability.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "No interference with reduced sentences or distinction between appellants.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shreekantiah Ramayya Munipalli v. The State of Bombay",
      "citation": "1955 1 SCR 1177",
      "treatment": "distinguished",
      "relevance": "Observations on s.34 read in light of facts where accused absent at removal of goods; not universal principle requiring physical presence."
    },
    {
      "case_name": "Barendra Kumar Ghose v. The King Emperor",
      "citation": "1924 L.R. 52 I.A. 40",
      "treatment": "followed",
      "relevance": "Explains s.34: leading feature is participation in action; common intention and participation in commission, not necessarily physical presence."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "409",
        "34"
      ],
      "relevance": "Conviction for criminal breach of trust by public servant/agent etc. with joint liability for acts done in furtherance of common intention."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against conviction and sentence dismissed; High Court's order confirming conviction under s.409 r/w s.34 IPC (sentences reduced to 3 years RI for first appellant, 1 year RI for second) upheld.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Conviction of a person for the offence of criminal breach of trust may not, in all cases, be founded merely on his failure to account for the property entrusted to him, or over which he has dominion, even when a duty to account is imposed upon him, but where he is unable to account or renders an explanation for his failure to account which is untrue, an inference of misappropriation with dishonest intent may readily be made.",
      "speaker": "court",
      "significance": "Core principle applied to infer dishonest intent from failure to account + false explanation."
    },
    {
      "text": "The essence of liability under s.34 is to be found in the existence of a common intention animating the offenders leading to the doing of a criminal act in furtherance of the common intention and presence of the offender sought to be rendered liable under s. 34 is not, on the words of the statute, one of the conditions of its applicability.",
      "speaker": "court",
      "significance": "Clarifies s.34 does not require physical presence; distinguishes prior precedent."
    },
    {
      "text": "A charge framed against the accused person, referring to s. 34 is but a convenient form of giving notice to him that the principle of joint liability is sought to be invoked. Section 34 does not create an offence it merely enunciates a principle of joint liability for criminal acts done in furtherance of the common intention of the offenders.",
      "speaker": "court",
      "significance": "Validates conviction form despite reference only to s.409."
    }
  ],
  "_case_id": "1960_88",
  "_label": 0,
  "_text_length": 18705,
  "_extracted_at": "2026-02-10T19:52:47.204739"
}