{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 357 of 1958",
    "date_of_judgment": "1960-10-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant executed a deed of trust settling certain lands described in Schedule A and the rents of lands described in Schedule C for the maintenance of certain temples and Thakoorbaries.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Material terms of the deed: cl. 6 - declarant feels a Declaration of Trust should be made whereby income of part of Raj properties earmarked for maintenance of institutions, declarant as legal Trustee.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Cl. 7 - declarant holds properties in Schedule A in trust for religious purposes of maintaining institutions in Schedule B.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Cl. 8 - Lands in Schedule C held as Bakast or proprietors private lands in direct khas cultivation shall be tenancy lands, declarant to pay rental annually to trustee as rayat under Bihar Tenancy Act.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Net income of Schedule A lands after expenses and taxes estimated at Rs. 1,81,717; net rental Schedule C at Rs. 10,208; aggregate after 15% trustee remuneration: Rs. 1,63,136-4-0 for trust objects.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "For assessment year 1950-51, Income-Tax Officer included Rs. 6,000 as income from non-agricultural properties of the trust; viewed trust not a public religious trust, non-agricultural income not exempt.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellate Assistant Commissioner held income from trust properties not taxable as private income of appellant, but remuneration Rs. 21,274 (15% of net income) liable to tax as not agricultural income.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Income-tax Appellate Tribunal affirmed AAC order on remuneration.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Patna High Court directed Tribunal to submit statement of case on five questions; fifth question: Whether Rs. 21,274 paid to assessee as Shebait of Trust properties exempt as agricultural income.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "High Court held remuneration received under contract, not agricultural income merely because source was agricultural; answered fifth question against assessee.",
      "type": "procedural",
      "date": "1957-04-24",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appeal to Supreme Court with leave under s.66A(2) of Indian Income-tax Act limited to question whether amount received as shebait exempt.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the amount of Rs. 21,274 being the amount paid to the assessee in his character of a Shebait of the Trust properties should have been held to be exempted from taxation on the ground that it is agricultural income?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The remuneration received by the appellant as trustee is exempt under s.4(3)(viii) because it is a fraction of the rent or revenue of agricultural lands appropriated towards remuneration; original character of the income not altered.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "s.4(3)(viii) Indian Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Remuneration received under contract; not agricultural income merely because source is agricultural income.",
      "supporting_facts": [
        "f7",
        "f8",
        "f10"
      ],
      "legal_basis": "s.2(1) definition of agricultural income"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Agricultural income under s.2(1) means rent or revenue derived from land used for agricultural purposes; income received by appellant as trustee from agricultural properties is exempt, but remuneration is not received as rent/revenue.",
      "addresses_issue": "i1",
      "key_observation": "Appellant has no beneficial interest in lands; source of remuneration right is covenant in deed for management, not right to rent/revenue; both source and character altered when appropriated as remuneration."
    },
    {
      "id": "cr2",
      "text": "Remuneration not received as rent or revenue under title legal or beneficial in property; computed as percentage does not preserve character.",
      "addresses_issue": "i1",
      "key_observation": "Not exempt under s.4(3)(viii)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The remuneration appropriated by the appellant as trustee is not agricultural income within s.2(1) and not exempt under s.4(3)(viii).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Nawab Habibulla v. Commissioner of Income Tax, Bengal",
      "citation": "1943 L.R. 70 I.A. 14",
      "treatment": "followed",
      "relevance": "Remuneration of mutwalli not agricultural income even if wakf income from agricultural properties."
    },
    {
      "case_name": "Premier Construction Co., Ltd. v. Commissioner of Income Tax, Bombay City",
      "citation": "1948 L.R. 75 I.A. 246",
      "treatment": "followed",
      "relevance": "Income not itself agricultural does not become so by source or calculation method; remuneration under contract for services not agricultural."
    },
    {
      "case_name": "Commissioner of Income Tax, Bihar and Orissa v. Kameshwar Singh",
      "citation": "1935 L.R. 62 I.A. 215",
      "treatment": "distinguished",
      "relevance": "Mortgagee in possession receives agricultural income as landlord; nature of primary receipt matters, not appropriation."
    },
    {
      "case_name": "K. B. Syed Mohammad Isa and another v. Commissioner of Income Tax, Central and United Provinces",
      "citation": "I.L.R. 1942 All. 425",
      "treatment": "distinguished",
      "relevance": "Mutwalli as beneficiary with obligation; income passes through to beneficiary without change in source/character."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s.2(1)",
        "s.4(3)(viii)",
        "s.66A(2)"
      ],
      "relevance": "Definition of agricultural income; exemption for agricultural income; reference to High Court."
    },
    {
      "name": "Bihar Tenancy Act",
      "sections": [],
      "relevance": "Declarant's rights in Schedule C lands as rayat paying rental."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's answer to the fifth question against the assessee, holding that the remuneration of Rs. 21,274 received by the appellant as shebait/trustee is not agricultural income and not exempt from tax.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The source of the right in which a fraction of the net income of the trust is to be appropriated by the appellant as his remuneration is not in the right to receive rent or revenue of agricultural lands, but rests in the covenant in the deed to receive remuneration for management of the trust.\"",
      "speaker": "court",
      "significance": "Core reasoning on alteration of source and character of income."
    },
    {
      "text": "\"Both the source and character of the income are therefore altered when a part of the income of the trust is appropriated by the appellant as his remuneration.\"",
      "speaker": "court",
      "significance": "Key holding distinguishing remuneration from agricultural income."
    }
  ],
  "_case_id": "1960_47",
  "_label": 0,
  "_text_length": 12476,
  "_extracted_at": "2026-02-10T19:51:46.371278"
}