{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Bombay City v. Khatau Makanji Spinning and Weaving Co. Ltd., Bombay",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 303 of 1958",
    "date_of_judgment": "1960-05-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Assessee Company has its year of account ending June 30 every year.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "At the close of the account year 1951, assessee carried forward profits amounting to Rs. 30,680 and earned a rebate by declaring dividends below the limit fixed by the Finance Act.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For the account year 1952, book profits were Rs. 28,67,235 less allowances for depreciation and tax; after adjustments, balance available for distribution was Rs. 5,02,915. Income-tax Officer found total income to be Rs. 5,26,681.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "For account year 1952, assessee declared dividends amounting to Rs. 4,78,950 and carried forward the balance of Rs. 23,965.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Concerned with assessment year 1953-54; Finance Act, 1953 applicable, applying Finance Act, 1951 with some changes.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Income-tax Officer found assessee had declared excess dividends amounting to Rs. 1,87,691 and calculated additional income-tax at Rs. 21,115-4-0.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appeals of assessee under Income-tax Act failed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellate Tribunal held excess dividends deemed paid out of undistributed profits of earlier year ending June 30, 1951, amounting to Rs. 6,60,720 on which rebate of 1 anna in the rupee was given in assessment year 1952-53.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Tribunal referred four questions under s. 66(1) of Indian Income-tax Act to Bombay High Court; first question not pressed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Bombay High Court judgment and order dated August 3, 1956, in Income-tax Reference No. 10 of 1956; answered remaining questions in the negative after modifying them; certified fit for appeal.",
      "type": "procedural",
      "date": "1956-08-03",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether additional income-tax has been legally charged under clause (ii) of the proviso to paragraph B of Part 1 of the First Schedule to the Indian Finance Act, 1951, as applied to the assessment year 1953-54 by the Indian Finance Act, 1953, read with Section 3 of the Indian Income-tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "It was not necessary to look only to s. 3 of the Indian Income-tax Act but also to the provisions of the Finance Act, through which Parliament could impose a new tax.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Finance Act 1951 and 1953"
    },
    {
      "id": "pa2",
      "text": "Suggested modifications of language in Finance Act to sustain the tax independently of s. 3.",
      "supporting_facts": [],
      "legal_basis": "Finance Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Provisions of Finance Act go beyond ambit of s. 3 of Income-tax Act; additional income-tax not on total income of previous year.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Section 3 of Indian Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S. 3 of Income-tax Act lays down liability to tax on total income of previous year; Finance Act provides rates but cannot impose tax beyond that without making excess dividends part of total income fictionally.",
      "addresses_issue": "i1",
      "key_observation": "Fiction deems excess dividend out of prior undistributed profits but does not make them total income of previous year under assessment."
    },
    {
      "id": "cr2",
      "text": "Finance Act fails to state that profits of back years shall be deemed part of total income of previous year; tax must be on income of previous year or fictionally so.",
      "addresses_issue": "i1",
      "key_observation": "Additional income-tax not properly laid on total income as defined in Income-tax Act."
    },
    {
      "id": "cr3",
      "text": "Modifications to language suggested by appellant involve recasting Finance Act, which is for legislature not court.",
      "addresses_issue": "i1",
      "key_observation": "Words of Finance Act must be construed as they stand."
    },
    {
      "id": "cr4",
      "text": "Reasons given in Civil Appeal No. 427 of 1957 support view that Finance Act cannot stand independently of s. 3.",
      "addresses_issue": "i1",
      "key_observation": "Procedure of modifying language not open to court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court was right in answering the question in the negative; additional income-tax not legally charged.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Civil Appeal No. 427 of 1957",
      "citation": null,
      "treatment": "followed",
      "relevance": "Reasons given therein support that Finance Act cannot stand independently of s. 3 of Income-tax Act."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s. 66(1)",
        "s. 3",
        "s. 23A(1)",
        "s. 18(3D)",
        "s. 18(3E)"
      ],
      "relevance": "Governs reference to High Court, liability to tax on total income of previous year, no order under s. 23A, deduction of super-tax."
    },
    {
      "name": "Indian Finance Act, 1951",
      "sections": [
        "Part 1, First Schedule, paragraph B, proviso clause (ii)"
      ],
      "relevance": "Provides for rebate and additional income-tax on excess dividends; deems excess out of prior undistributed profits."
    },
    {
      "name": "Indian Finance Act, 1953",
      "sections": [],
      "relevance": "Applies Finance Act, 1951 with modifications to assessment year 1953-54."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by the Commissioner, upholding the Bombay High Court's negative answer to the question whether additional income-tax was legally charged under the Finance Act provisions read with s. 3 of the Income-tax Act.",
    "relief_granted": "No additional income-tax payable by assessee.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The Finance Act fails to do is to make them total income, so as to take in the rate which is prescribed for the total income in the Proviso.\"",
      "speaker": "court",
      "significance": "Core reasoning why additional tax provision is ineffective."
    },
    {
      "text": "\"Income-tax is a tax on income of the previous year, and it would not cover something which is not the income of the previous year, or made fictionally so.\"",
      "speaker": "court",
      "significance": "Explains limit of legislative fiction in Finance Act."
    },
    {
      "text": "\"The ambit of Section 3 is clear and the ambit is that the tax to be levied must be a tax on income and the power of Parliament is equally clear and that is to fix the rate at which income-tax is to be charged upon the total income of the previous year.\"",
      "speaker": "court",
      "significance": "Quotes High Court reasoning affirmed by Supreme Court."
    }
  ],
  "_case_id": "1960_228",
  "_label": 0,
  "_text_length": 13365,
  "_extracted_at": "2026-02-10T19:54:36.762878"
}