{
  "metadata": {
    "case_name": "Appellant (Accused No. 1) v. State",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": "Criminal Appeal No. 55 of 1955",
    "date_of_judgment": "1960-04-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant and two others were convicted by a Magistrate under s. 420 read with ss. 511 and 34 of the Indian Penal Code and each was sentenced to rigorous imprisonment for 12 months and a fine of Rs. 500 and in default of payment, a further period of imprisonment for four months.",
      "type": "procedural",
      "date": "1955-03-31",
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "On appeal the accused persons were acquitted by a Sessions Judge.",
      "type": "procedural",
      "date": "1955-03-31",
      "source": "sessions_judge"
    },
    {
      "id": "f3",
      "text": "The State then appealed to the High Court at Bombay and the High Court set aside the order of acquittal and restored the order passed by the learned Magistrate.",
      "type": "procedural",
      "date": "1957-08-26",
      "source": "high_court"
    },
    {
      "id": "f4",
      "text": "Accused No. 1 alone has appealed against the order of the High Court to this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The three accused persons approached one Ramanlal and the third accused told Ramanlal that accused Nos. 1 and 2 were proficient in duplicating currency numbers and they were prepared to do it for Ramanlal who should take advantage of the offer.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The third accused then asked Ramanlal to think over the matter and promised to come again.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Ramanlal later mentioned this matter to his friend Champaklal, the complainant, and the two decided to trap the accused persons disbelieving their professed power to duplicate numbers.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The third accused again came as promised and met Ramanlal and Champaklal.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Champaklal promised to find currency notes for Rs. 20,000 for duplicating and a date was fixed when it was to be done.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Thereafter Ramanlal and Champaklal informed the police.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The police hid themselves in the house of Ramanlal where it had been fixed with the accused that the duplicating would be done.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The three accused arrived duly.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The second accused spread bottles, blank papers, etc., on a carpet.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The first accused, the appellant, asked Champaklal to produce the currency notes.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Champaklal who was carrying a bag supposed to contain the promised currency notes worth Rs. 20,000, took out two currency notes of Rs. 100 each from the bag and gave them to the appellant.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "As soon as the appellant had taken the money, Champaklal gave the pre-arranged signal and the police came into the room and arrested all the accused persons.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "They were thereafter prosecuted for the offence of an attempt to cheat upon a complaint lodged by Champaklal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "The Courts below found that a representation had been made to Champaklal.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "The complainant had never believed that the accused could actually duplicate currency notes. He feigned belief only in order to trap the accused.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was evidence to show that any representation had been made to Champaklal.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether there had been an attempt to commit the offence of cheating or only a preparation which is not punishable.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether there was an attempt to cheat because the complainant had not been deceived.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The charge was for an attempt to cheat Champaklal but there was no evidence to show that any representation had been made by anyone to Champaklal.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "There had been no attempt to commit the offence of cheating but only a preparation to commit that offence which was not punishable.",
      "supporting_facts": [
        "f5",
        "f6",
        "f8",
        "f9",
        "f12",
        "f13"
      ],
      "legal_basis": "s. 511 of the Indian Penal Code"
    },
    {
      "id": "pa3",
      "text": "There was no attempt to cheat because the complainant had not been deceived.",
      "supporting_facts": [
        "f7",
        "f19"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Courts below found that such a representation had been made and the finding is clearly supported by the evidence on record.",
      "addresses_issue": "i1",
      "key_observation": "Finding of representation to Champaklal supported by evidence."
    },
    {
      "id": "cr2",
      "text": "It seems clear that an attempt to commit the offence had actually been made. A false representation had been made and a sum of Rs. 200 had been obtained from Champaklal. These clearly are acts done towards the commission of the offence within the meaning of s. 511 of the Indian Penal Code. The making of the false representation is one of the ingredients for an offence of cheating under s. 420 and the delivery of property is another. Both took place.",
      "addresses_issue": "i2",
      "key_observation": "Acts beyond preparation: false representation made and property obtained."
    },
    {
      "id": "cr3",
      "text": "It is true that the complainant had not been taken in. He had never believed that the accused could actually duplicate currency notes. He feigned belief only in order to trap the accused. That however clearly makes no difference so far as an attempt to cheat is concerned. The accused had attempted to cheat the complainant. That they had failed in their attempt is irrelevant in considering whether they had committed the offence of attempting to cheat.",
      "addresses_issue": "i3",
      "key_observation": "Failure to deceive does not negate attempt to cheat."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A representation was made to Champaklal as found by lower courts and supported by evidence.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Acts of making false representation and obtaining Rs. 200 constitute an attempt under s. 511 IPC, beyond mere preparation.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Lack of actual deception by complainant does not preclude offence of attempt to cheat.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 420",
        "s. 511",
        "s. 34"
      ],
      "relevance": "Conviction under s. 420 read with ss. 511 and 34 for attempt to cheat; s. 511 defines attempt; false representation and delivery of property as ingredients of cheating under s. 420."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court rejected all three arguments of the appellant, upheld the findings of the High Court and Magistrate that an attempt to cheat under s. 420 r/w ss. 511 and 34 IPC was committed, thereby dismissing the appeal against conviction.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A false representation had been made and a sum of Rs. 200 had been obtained from Champaklal. These clearly are acts done towards the commission of the offence within the meaning of s. 511 of the Indian Penal Code.",
      "speaker": "court",
      "significance": "Distinguishes attempt from preparation."
    },
    {
      "text": "That they had failed in their attempt is irrelevant in considering whether they had committed the offence of attempting to cheat.",
      "speaker": "court",
      "significance": "Clarifies that actual deception not required for attempt to cheat."
    }
  ],
  "_case_id": "1960_25",
  "_label": 0,
  "_text_length": 4599,
  "_extracted_at": "2026-02-10T19:51:51.273624"
}