{
  "metadata": {
    "case_name": "Workmen v. Tata Locomotive Engineering Co. Ltd.",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Civil Appeal No. 101 of 1960",
    "date_of_judgment": "1960-03-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "14 appellants were workmen in Tata Locomotive Engineering Co. Ltd., Jamshedpur, dismissed by company management based on results of domestic enquiry into charges of misconduct.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Industrial disputes between these workmen and company pending before Industrial Tribunal, Bihar.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Company filed applications under s.33 of Industrial Disputes Act for approval of dismissal action; workmen filed under s.33A complaining of action.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Company's s.33 applications held infructuous; workmen's s.33A applications considered and dismissed by Labour Court, Chotanagpur Division, Ranchi, on 2nd March 1959 in Misc. Cases Nos. 73,76,77,79-82,84-90 of 1958.",
      "type": "procedural",
      "date": "1959-03-02",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellants obtained special leave and preferred this appeal against Labour Court order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On June 5, 1953, requests made on behalf of workmen to be represented by representative of Jamshedpur Mazdoor Union at enquiry; management rejected but allowed representation by co-worker from own department.",
      "type": "procedural",
      "date": "1953-06-05",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Charges against Charan Singh, Parmanand and K. Ganguli: (i) Participating in illegal strike, (ii) Leaving appointed place of duty, (iii) Inciting other employees to strike work, (iv) Threatening and intimidating other workers. Enquiry Officer found guilty of first three; no finding on fourth but found guilty of 'Behaving in a riotous and disorderly manner by shouting slogans on the shop floor'. Manager dismissed based on first three in some cases.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Charge-sheet against S.B. Nath: four acts including participating in illegal strike, leaving place, inciting, threatening. Dismissal order: guilty of 'entering the works when not on duty and inciting other employees to strike work'.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Charge-sheet against M.R. Ghosh: participation in illegal strike, inciting, leaving place, threatening/intimidating in Repair Shop. Particulars: 'By threatening and intimidating others... you took the Compressor man by his hand and got the Compressor stopped'. Dismissal included 'deliberately preventing the man in charge of the Compressor'.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Charge-sheet against Gurbux Singh: four acts. Enquiry Officer found guilty of first three and 'threatening and intimidating Mr. Charan Singh to stop work' (clerical error; actually Mr. Chakravarty). Manager agreed with findings.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Charge-sheet against S.K. Dhanda: four acts including participation, leaving place, inciting, riotous behaviour/threatening. Enquiry Officer found guilty of first three, not fourth. Manager's order noted fourth not proved but dismissed on others; formal order mistakenly included fourth.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "When the management of an industry holds an enquiry into the charges against a workman for the purpose of deciding what action if any, should be taken against him, has the workman a right to be represented by a representative of his Union at the enquiry?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether dismissal orders were invalid because based on findings of guilt for misconduct not mentioned in the charge-sheet for certain appellants (Charan Singh, Parmanand, K. Ganguli, S.B. Nath, M.R. Ghosh, Gurbux Singh, S.K. Dhanda).",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Enquiry not proper/valid as workmen not allowed representation by Jamshedpur Mazdoor Union representative; fair play demands assistance for examination/cross-examination; Union rep best suited.",
      "supporting_facts": [
        "f1",
        "f6"
      ],
      "legal_basis": "natural justice"
    },
    {
      "id": "pa2",
      "text": "For Charan Singh, Parmanand, K. Ganguli: Dismissal bad as based partly on guilt of 'behaving in riotous and disorderly manner by shouting slogans' not in charge-sheet.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "For S.B. Nath: Dismissal mentions guilt of 'entering works when not on duty' not accused in charge-sheet and not misconduct under standing orders.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "For M.R. Ghosh: 'Deliberately preventing Compressor man' not in charge-sheet.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "For Gurbux Singh: Manager wrongly considered threat to Chakravarty when Enquiry Officer said Charan Singh.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa6",
      "text": "For S.K. Dhanda: Manager wrongly thought guilty of all four charges when only three proved.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No right to Union representation at domestic enquiry; not court of law, simple facts, workman can conduct own case as in domestic tribunals; rules for govt employees have no such provision; if unfair, challengeable in industrial dispute. Employer may allow in discretion.",
      "addresses_issue": "i1",
      "key_observation": "Accustomed to lawyers in courts, but domestic enquiries differ; fair intelligence suffices for questioning."
    },
    {
      "id": "cr2",
      "text": "For Charan Singh etc.: Manager would have dismissed on first three charges alone; extra finding does not vitiate as there are cases dismissed on three alone.",
      "addresses_issue": "i2",
      "key_observation": "No reason to think manager would discriminate."
    },
    {
      "id": "cr3",
      "text": "For S.B. Nath: 'Entering works when not on duty' describes manner of inciting, not separate misconduct; only inciting weighed.",
      "addresses_issue": "i2",
      "key_observation": "Unnecessary/erroneous mention but not basis for punishment."
    },
    {
      "id": "cr4",
      "text": "For M.R. Ghosh: Act mentioned in particulars of fourth charge.",
      "addresses_issue": "i2",
      "key_observation": "Slightly different words but same."
    },
    {
      "id": "cr5",
      "text": "For Gurbux Singh: Clerical error in report (Charan Singh instead of Chakravarty); clear from body of report and evidence; no misleading; name immaterial to charge.",
      "addresses_issue": "i2",
      "key_observation": "Manager went through evidence."
    },
    {
      "id": "cr6",
      "text": "For S.K. Dhanda: Manager's order explicitly noted fourth not proved but dismissed on others; formal order clerical mistake.",
      "addresses_issue": "i2",
      "key_observation": "Reading both orders together clear."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Workman has no right to be represented at management enquiry by Union representative, though employer may allow in discretion.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Specific infirmities in dismissal orders do not vitiate them; clerical errors or extra findings do not affect validity where punishment based on proved charges.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act",
      "sections": [
        "s.33",
        "s.33A"
      ],
      "relevance": "Company sought approval under s.33; workmen challenged under s.33A; Labour Court disposed s.33A applications."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; Labour Court's dismissal of workmen’s s.33A applications upheld; no right to Union representation at domestic enquiry; specific contentions on charge-sheet infirmities rejected.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "a workman against whom an enquiry is being held by the management has no right to be represented at such enquiry by a representative of his Union though of course an employer in his discretion can and may allow his employee to avail himself of such assistance.",
      "speaker": "court",
      "significance": "Core holding on principal issue."
    },
    {
      "text": "these are not enquiries in a court of law. It is necessary to remember also that in these enquiries, fairly simple questions of fact as to whether certain acts of misconduct were committed by a workman or not only fall to be considered",
      "speaker": "court",
      "significance": "Distinguishes domestic enquiry from court proceedings."
    }
  ],
  "_case_id": "1960_220",
  "_label": 0,
  "_text_length": 18831,
  "_extracted_at": "2026-02-10T19:54:36.350558"
}