{
  "metadata": {
    "case_name": "Quamar Shaffi Tyabji v. Commissioner of Income-tax, Hyderabad",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das, J."
    ],
    "case_number": "Civil Appeals Nos. 324 and 325 of 1957",
    "date_of_judgment": "1960-04-18"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Two cotton mills in Hyderabad State: Azamjahi mills and Osmanshahi mills, public joint stock companies.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Firman-e-Mubarak of 1929 formed Industrial Trust Fund to help industries, managed by Committee of three Government Trustees.",
      "type": "background",
      "date": "1929",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Agreements dated April 12, 1934, and July 27, 1934: Trustees appointed secretaries, treasurers, agents, and selling agents of the two mills, with powers to manage business, appoint employees, and delegate subject to Board approval.",
      "type": "material",
      "date": "1934-04-12",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Supplemental agreements dated October 16, 1938: Trustees given power to delegate selling agency powers subject to Board approval.",
      "type": "material",
      "date": "1938-10-16",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Till October 1938, Trustees exercised powers through Advisory Board; appellant Quamar Shaffi Tyabji appointed chairman on Rs. 1,500 per month plus commission.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Agreement dated December 6, 1938, between Trustees and appellant: Appellant appointed managing agent of Trustees' business as secretaries, treasurers, agents, and selling agents; full powers delegated subject to general control of Trustees; remuneration Rs. 2,000 per month plus 2% commission on profits subject to profit conditions; separate selling commission; non-assignable; first refusal on transfer.",
      "type": "material",
      "date": "1938-12-06",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant conducted business of mills as management and selling agent under 1938 agreement.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Assessed to excess profits tax for chargeable periods 1351F (October 1, 1941 to September 30, 1942): total income Rs. 2,37,451 including Rs. 2,11,230 managing agency allowance and commission.",
      "type": "procedural",
      "date": "1941-10-01",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Assessed to excess profits tax for chargeable periods 1352F (October 1, 1942 to September 30, 1943): total income Rs. 4,90,027 including Rs. 4,45,775 managing agency commission and allowance.",
      "type": "procedural",
      "date": "1942-10-01",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant contended before Excess Profits Tax authorities that he was employee of Industrial Trust Fund, remuneration was salary, not income from business.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Excess Profits Tax authorities negatived contention; High Court of Hyderabad on April 10, 1953, in references under s. 48(3) of Hyderabad Excess Profits Tax Act, answered affirmatively that income was from business.",
      "type": "procedural",
      "date": "1953-04-10",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appeals by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in the circumstances of the case, the officers of the Excess-Profits Tax Department were right in treating the income of the assessee or the Industrial Trust Fund as income from business.",
      "framed_by": "high_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "On true construction of relevant agreements, Industrial Trust Fund was managing and selling agent; Trustees employed appellant on certain terms with certain powers; appellant was employee carrying out duties, not independent business; income was salary, not from business.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": "Distinction between managing agent and manager under Indian Companies Act, 1913 (citing Inderchand Hari Ram v. CIT)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant's income was from business of managing agency.",
      "supporting_facts": [
        "f3",
        "f6",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Distinction between agent/servant/independent contractor: principal directs what, master directs how; agent not under direct control/supervision like servant.",
      "addresses_issue": "i1",
      "key_observation": "Relation between Mills and Trustees was principal-agent; delegation to appellant made him agent of principal (Mills), not servant or sub-agent of Trustees (per Indian Contract Act s. 194)."
    },
    {
      "id": "cr2",
      "text": "Terms of 1938 agreement: full powers delegated (cl.2), tenure (cl.3), remuneration (cl.4), termination (cl.7), winding up clauses appropriate to business, not master-servant; cl.9 non-assignment does not change to servant relation.",
      "addresses_issue": "i1",
      "key_observation": "Appellant undertook managing agency business under general control of Trustees."
    },
    {
      "id": "cr3",
      "text": "Managing agency is business (citing precedents); appellant had prior business experience.",
      "addresses_issue": "i1",
      "key_observation": "Agreements show agency business, not employment."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court correctly answered that income was from business; appellant carried on business of managing agency.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Lakshminarayan Ram Gopal and Son Ltd. v. Government of Hyderabad",
      "citation": "1955 1 S.C.R. 393",
      "treatment": "followed",
      "relevance": "Explains distinction between agent, servant, independent contractor; managing agency is business."
    },
    {
      "case_name": "J.K. Trust, Bombay v. Commissioner of Income-tax Excess Profits Tax, Bombay",
      "citation": "1958 S.C.R. 65",
      "treatment": "followed",
      "relevance": "Managing agency is business."
    },
    {
      "case_name": "Inderchand Hari Ram v. Commissioner of Income-tax, U.P.",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Distinction between managing agent and manager under Companies Act does not help; issue is construction of agreements."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hyderabad Excess Profits Tax Act",
      "sections": [
        "s. 48(3)"
      ],
      "relevance": "References made under this section to High Court."
    },
    {
      "name": "Indian Contract Act",
      "sections": [
        "s. 194"
      ],
      "relevance": "Position of agent named by sub-delegation."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [],
      "relevance": "Distinction between managing agent and manager mentioned but not decisive."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court's affirmative answer that assessee's income was from business; appeals dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the difference between the relations of master and servant and of principal and agent lay in this a principal has the right to direct what work the agent has to do but a master has the further right to direct how the work is to be done.",
      "speaker": "court",
      "significance": "Key distinction applied to hold appellant was agent, not servant."
    },
    {
      "text": "managing agency is business see Lakshminarayan Ram Gopal and Son Ltd. v. The Government of Hyderabad and J. K. Trust, Bombay v. The Commissioner of Income-tax",
      "speaker": "court",
      "significance": "Affirms that managing agency constitutes business income liable to tax."
    }
  ],
  "_case_id": "1960_252",
  "_label": 0,
  "_text_length": 14002,
  "_extracted_at": "2026-02-10T19:55:13.858341"
}