{
  "metadata": {
    "case_name": "Appellants (Decree-holders) v. Respondent (Judgment-debtor)",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur J."
    ],
    "case_number": "Civil Appeal No. 302 of 1955",
    "date_of_judgment": "1960-09-08"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On February 3, 1941, by a registered deed the father of the appellants leased to the respondent the house in dispute for a period of 10 years with an option of renewal for further periods for as long as the respondent wanted.",
      "type": "material",
      "date": "1941-02-03",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "This house was used by the respondent for his hotel.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The father died on January 25, 1945.",
      "type": "background",
      "date": "1945-01-25",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On December 21, 1945, the appellants filed a suit for a declaration that the deed of lease of February 3, 1941, executed by their father was not for legal necessity or for the benefit of the family, that the alienation was not binding on them and the option of renewal under the lease was void and unenforceable on account of uncertainty. The appellants further prayed for delivery of possession and for a decree for a sum of Rs. 2,655 as past mesne profits and future mesne profits at Rs. 250 per mensem as from December 1, 1945.",
      "type": "procedural",
      "date": "1945-12-21",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The respondent filed his written statement on March 11, 1946, and an additional written statement on November 26, 1946, whereby he raised an objection to the jurisdiction of the court by reason of the Mysore House Rent Control Order of 1945.",
      "type": "procedural",
      "date": "1946-03-11",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The trial judge upheld the preliminary objection and dismissed the suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On appeal, the High Court set aside the decree on the ground that the nature and scope of the suit had been misconceived by the trial court and that it was not based on relationship of landlord and tenant and therefore s. 8(1) of the Mysore House Rent Control Order was inapplicable and the case was remanded for retrial.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On August 23, 1948, the suit was decreed. The trial court held that the lease was binding for the first period of ten years as from May 1, 1941, as it was supported by legal necessity but the option of renewal was void and unenforceable for uncertainty and therefore a decree for possession was passed to be operative on the expiry of ten years, i.e., May 1, 1951.",
      "type": "procedural",
      "date": "1948-08-23",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "On appeal the High Court confirmed that decree.",
      "type": "procedural",
      "date": "1950-08-22",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On July 9, 1951, the appellants took out execution of the decree and on July 22, 1951, possession was delivered to them. The order for delivery was made without notice to and in the absence of the respondent.",
      "type": "procedural",
      "date": "1951-07-09",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The proceedings, spot mahazar that the respondent came to the spot after delivery of the major portion of the property in dispute had been delivered to the appellants.",
      "type": "procedural",
      "date": "1951-07-22",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On August 13, 1951, the respondent made an application in the Executing Court, the District Judge, under ss. 47, 144 and 151 of the Code of Civil Procedure for setting aside the ex parte order of delivery and for redelivery of possession of the house to him and in the alternative for an order to the appellants to give facilities to him respondent to remove the various moveables and articles mentioned in the petition.",
      "type": "procedural",
      "date": "1951-08-13",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The appellants pleaded that the application was not maintainable.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "The District Judge, on November 14, 1951, upheld this contention and dismissed the application.",
      "type": "procedural",
      "date": "1951-11-14",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "An appeal was taken to the High Court and it reversed the order of the Executing Court and directed the appellants to return possession of the house in dispute to the respondent along with the moveables which were in the house at the time respondent was evicted. The High Court held that the Executing Court had no jurisdiction to order the eviction of the respondent because of the provisions of Mysore House Rent and Accommodation Control Order, 1948, which was in operation on the date of eviction.",
      "type": "procedural",
      "date": "1954-04-03",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The High Court having refused to give a certificate under art. 133 the appellants obtained special leave to appeal from this Court on January 12, 1955.",
      "type": "procedural",
      "date": "1955-01-12",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Mysore House Rent Control Order of 1945 came into force on November 6, 1945.",
      "type": "background",
      "date": "1945-11-06",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Mysore Rent and Accommodation Control Order of 1948 came into force on July 1, 1948.",
      "type": "background",
      "date": "1948-07-01",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Part B States Laws Act, 1951 enacted on February 22, 1951, came into force on April 1, 1951.",
      "type": "background",
      "date": "1951-04-01",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "By virtue of Notification No. 2676-Cts. 46-51-5 dated September 12, 1951, the Transfer of Property Act was extended to the State of Mysore as from October 1, 1951.",
      "type": "background",
      "date": "1951-10-01",
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Mysore Rent Control Act of 1951 received the President's assent on August 16, 1951.",
      "type": "background",
      "date": "1951-08-16",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "The question for decision mainly turns upon the applicability of the provisions of the two House Rent Control Orders of 1945 and 1948 and how far they were applicable to the proceedings in the suit and execution.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Mysore House Rent Control Order of 1948 was repugnant to the provisions of the Transfer of Property Act which was brought into force in the State of Mysore by Part B States Laws Act, 1951.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Inapplicability of s. 47 CPC to the proceedings.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Applicability of res judicata, waiver and estoppel to bar the respondent's application.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether ignoring ss. 9(1) and 16 of the 1948 House Rent Control Order is no more than an error in the exercise of jurisdiction.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Mysore House Rent Control Order of 1948 was repugnant to the provisions of the Transfer of Property Act which was brought into force in the State of Mysore by Part B States Laws Act, 1951 as from April 1, 1951, and thus could not operate on the rights of the parties on July 9, 1951 or July 22, 1951.",
      "supporting_facts": [
        "f10",
        "f19"
      ],
      "legal_basis": "Transfer of Property Act, 1882; Part B States Laws Act, 1951"
    },
    {
      "id": "pa2",
      "text": "The application under ss. 47, 144 and 151 CPC was not maintainable.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Code of Civil Procedure, ss. 47, 144, 151"
    },
    {
      "id": "pa3",
      "text": "Plea of lack of jurisdiction due to House Rent Control Order, 1945 raised earlier in written statement and decided against respondent operates as res judicata barring objection to executability.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "res judicata"
    },
    {
      "id": "pa4",
      "text": "Respondent waived rights and is estopped based on letter from his lawyer stating arrangements being made to hand over possession.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "waiver and estoppel"
    },
    {
      "id": "pa5",
      "text": "Ignoring ss. 9(1) and 16 of 1948 Order is merely an error in exercise of jurisdiction, not lack thereof.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Mysore Rent and Accommodation Control Order, 1948, ss. 9(1), 16"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Executing Court had no jurisdiction to order eviction because of Mysore House Rent and Accommodation Control Order, 1948 in operation on date of eviction; seek setting aside ex parte delivery and redelivery or removal of movables.",
      "supporting_facts": [
        "f10",
        "f11",
        "f12",
        "f15"
      ],
      "legal_basis": "Mysore House Rent Control Order, 1945, s. 8(1); Mysore Rent and Accommodation Control Order, 1948, ss. 9, 16; CPC ss. 47, 144, 151"
    },
    {
      "id": "ra2",
      "text": "Civil court had no jurisdiction to order eviction due to House Rent Control Order, 1945.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Mysore House Rent Control Order, 1945"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Part B States Laws Act merely placed Mysore on same footing as other states for TPA; TPA extended to Mysore only from October 1, 1951 via notification; 1948 Order continued in force till repealed by 1951 Act; no repugnancy as from April 1, 1951.",
      "addresses_issue": "i2",
      "key_observation": "House Rent Control Order of 1948 continued to be in force and applicable."
    },
    {
      "id": "cr2",
      "text": "S. 47 CPC applicable as question relates to execution, satisfaction and discharge of decree.",
      "addresses_issue": "i3",
      "key_observation": "Cited Ramanna v. Nallaparaju."
    },
    {
      "id": "cr3",
      "text": "No res judicata as prohibition was against execution, not passing of decree; objection to executability taken at execution stage, but ex parte without notice.",
      "addresses_issue": "i4",
      "key_observation": "Objection to executability could only be taken at time of execution."
    },
    {
      "id": "cr4",
      "text": "No waiver or estoppel; letter slender basis; no conduct changing position; statutory prohibition not subject to estoppel.",
      "addresses_issue": "i4",
      "key_observation": "Against statute there cannot be an estoppel."
    },
    {
      "id": "cr5",
      "text": "Ss. 9(1) and 16 are fetter on executability of decree, not mere error in jurisdiction.",
      "addresses_issue": "i5",
      "key_observation": "Restriction on power of court to execute decree."
    },
    {
      "id": "cr6",
      "text": "Executing Court could not execute decree without Controller's certificate; possession under ex parte order set aside under s. 151 CPC.",
      "addresses_issue": "i1",
      "key_observation": "Cited K. Mohammad Sikri Sahib v. Madhava Kurup."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Mysore House Rent Control Orders of 1945 and 1948 applicable to execution proceedings; no decree for eviction executable without certificate from Controller.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Part B States Laws Act, 1951 did not repeal 1948 Order by repugnancy with TPA prior to October 1, 1951.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "S. 47 CPC applicable to question of executability due to Rent Control Orders.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "No res judicata, waiver or estoppel bars objection to execution based on Rent Control Orders.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "M/s. Tilakram Rambaksh v. Bank of Patiala",
      "citation": "A.I.R. 1959 Pb. 440",
      "treatment": "followed",
      "relevance": "Part B States Laws Act makes it possible to extend TPA by notification, but not automatically in force."
    },
    {
      "case_name": "Ramanna v. Nallaparaju",
      "citation": "A.I.R. 1956 S.C. 87",
      "treatment": "followed",
      "relevance": "Question whether sale in execution not warranted by decree agitated under s. 47 CPC."
    },
    {
      "case_name": "J. Marret v. Mohammad Shirazi Sons",
      "citation": "A.I.R. 1930 P.C. 86",
      "treatment": "referred",
      "relevance": "Executing court directing contrary to decree terms."
    },
    {
      "case_name": "K. Mohammad Sikri Sahib v. Madhava Kurup",
      "citation": "A.I.R. 1949 Mad. 809",
      "treatment": "followed",
      "relevance": "Executing court unaware of Rent Restriction Act amendment prohibiting execution; ex parte possession set aside under s. 151 CPC."
    }
  ],
  "statutes_cited": [
    {
      "name": "Mysore House Rent Control Order, 1945",
      "sections": [
        "Section 8(1)"
      ],
      "relevance": "Restriction on eviction of tenants; inapplicable to suit as not landlord-tenant relation, but applicable to execution."
    },
    {
      "name": "Mysore Rent and Accommodation Control Order, 1948",
      "sections": [
        "Section 9(1)",
        "Section 16"
      ],
      "relevance": "Prohibits eviction without Controller direction/certificate; fetter on execution of eviction decree."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Section 47",
        "Section 144",
        "Section 151"
      ],
      "relevance": "Application to set aside ex parte delivery and for redelivery; applicable to execution, discharge issues."
    },
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [],
      "relevance": "Not extended to Mysore till October 1, 1951; no repugnancy with 1948 Order."
    },
    {
      "name": "Part B States Laws Act, 1951",
      "sections": [
        "Section 3"
      ],
      "relevance": "Extended/amended certain Acts including TPA for Part B States; did not automatically enforce TPA."
    },
    {
      "name": "Mysore Rent Control Act, 1951",
      "sections": [],
      "relevance": "Repealed 1948 Order."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 372",
        "Article 133"
      ],
      "relevance": "Existing laws saved; certificate for appeal refused."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed as having little substance. High Court order upheld directing appellants to return possession and movables to respondent, as execution without Controller's certificate under 1948 Order was invalid.",
    "relief_granted": "Redelivery of possession of house and movables to respondent.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "This appeal has little substance and must, therefore, be dismissed.",
      "speaker": "court",
      "significance": "Opening and concluding statement on merits."
    },
    {
      "text": "A tenant in possession of a house shall not be evicted therefrom, whether in execution of a decree or otherwise except in accordance with the provisions of this clause.",
      "speaker": "court",
      "significance": "Key provision of s. 8(1) 1945 Order and s. 9(1) 1948 Order barring eviction."
    },
    {
      "text": "Against statute there cannot be an estoppel.",
      "speaker": "court",
      "significance": "Rejects waiver/estoppel plea."
    }
  ],
  "_case_id": "1960_275",
  "_label": 0,
  "_text_length": 13842,
  "_extracted_at": "2026-02-10T19:55:29.210624"
}