{
  "metadata": {
    "case_name": "Appellant v. State",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Criminal Appeal No. 116 of 1958",
    "date_of_judgment": "1960-03-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Case instituted on a police report charging the appellant with an offence under s. 332 IPC for voluntarily causing hurt by means of a piece of wood to Sisir Kumar Bose, Bailiff of Calcutta Corporation, and Chandra Sekhar Bhattacharjee, an employee of Calcutta Corporation, with intent to prevent or deter them from discharging their duties as public servants.",
      "type": "material",
      "date": null,
      "source": "police_report"
    },
    {
      "id": "f2",
      "text": "Magistrate satisfied himself that documents under s. 173 CrPC were furnished to accused, examined documents, heard counsel of both parties, opined that charge under s. 332 IPC could not be sustained but there was evidence for prima facie case under s. 323 IPC.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Magistrate charged accused under s. 323 IPC, accused pleaded not guilty and claimed trial, case posted for examination of prosecution witnesses.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "On next hearing, submission on behalf of accused that under s. 251A(2) CrPC, accused should be acquitted and no trial for s. 323 IPC could proceed.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Magistrate rejected contention, directed trial under s. 323 IPC to proceed under Chapter XX CrPC (summons case procedure).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Accused convicted under s. 323 IPC, sentenced to fine of Rs. 50, in default rigorous imprisonment for one month.",
      "type": "procedural",
      "date": "1956-06-26",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellant's application under s. 439 CrPC for revision rejected by Calcutta High Court on February 28, 1957, in Criminal Revision No. 1158 of 1956.",
      "type": "procedural",
      "date": "1957-02-28",
      "source": "high_court"
    },
    {
      "id": "f8",
      "text": "High Court granted certificate under Art. 134(1)(c) Constitution for appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a Magistrate after making an order of discharge under s. 251A(2) CrPC in respect of a charge for an offence triable as a warrant case can still proceed to try the accused for another offence disclosed by the police report and triable as a summons case.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "In view of s. 251A(2) CrPC, after discharge, accused should have been acquitted altogether and no trial for offence under s. 323 IPC could proceed.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s. 251A(2) CrPC"
    },
    {
      "id": "pa2",
      "text": "Magistrate cannot proceed with trial of other offences triable under Chapter XX because no cognizance has been taken of such offences; requires fresh complaint for cognizance under s. 190(1)(b) CrPC.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "s. 190(1)(b), s. 251A(2) CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "If Magistrate finds on materials that summons case offence committed, he has right and duty to proceed under Chapter XX CrPC; discharge under s. 251A(2) refers only to specific offence charge-sheeted, not other offences like summons cases.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "s. 251A(2), Chapter XX CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In deciding under s. 251A(2) or (3), Magistrate forms opinion on whether ground for presuming offence triable under Chapter XXI (warrant cases); discharge under s. 251A(2) only if no such ground for Chapter XXI offences.",
      "addresses_issue": "i1",
      "key_observation": "Discharge under s. 251A(2) is only in respect of offences triable under Chapter XXI mentioned in charge-sheet, not all offences."
    },
    {
      "id": "cr2",
      "text": "Facts in police report may constitute offences under both Chapter XXI (warrant) and Chapter XX (summons); discharge of warrant offence does not affect summons offences.",
      "addresses_issue": "i1",
      "key_observation": "Order of discharge under s. 251A(2) has reference only to such offences triable under Chapter XXI."
    },
    {
      "id": "cr3",
      "text": "When Magistrate takes cognizance under s. 190(1)(b) CrPC of offence in police report, he takes cognizance of all offences constituted by the facts reported, not only some.",
      "addresses_issue": "i1",
      "key_observation": "Facts constituting s. 332 IPC also constitute minor offence under s. 323 IPC; cognizance of 332 implies cognizance of 323."
    },
    {
      "id": "cr4",
      "text": "After discharge of s. 332 IPC (warrant case), minor offence s. 323 IPC (summons case) remains for trial under Chapter XX procedure.",
      "addresses_issue": "i1",
      "key_observation": "Magistrate rightly followed Chapter XX procedure."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Magistrate after discharge under s. 251A(2) CrPC for warrant-case offence can proceed to try summons-case offence disclosed in same police report, as cognizance under s. 190(1)(b) covers all offences from facts reported.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "s. 251",
        "s. 251A",
        "s. 173",
        "s. 190(1)(b)",
        "s. 439",
        "Chapter XX",
        "Chapter XXI"
      ],
      "relevance": "Governs procedure for trial of warrant and summons cases; discharge under s. 251A(2) limited to warrant offences; cognizance of all offences from police report facts."
    },
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "s. 332",
        "s. 323"
      ],
      "relevance": "s. 332 (warrant case, hurt to public servant); s. 323 (summons case, minor hurt); facts constitute both."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 134(1)(c)"
      ],
      "relevance": "Basis for certificate granting appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld the conviction and sentence under s. 323 IPC by Additional Chief Presidency Magistrate and rejection of revision by Calcutta High Court; appeal dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The word discharge used in sub-s. (2) of s. 251A Cr. P.C. must be read as having reference to a discharge in relation to the specific offence upon which the accused has been charge-sheeted.",
      "speaker": "court",
      "significance": "High Court view affirmed by Supreme Court."
    },
    {
      "text": "When a Magistrate takes cognizance of offences under s. 190(1)(b) Cr. P.C., he takes cognizance of all offences constituted by the facts reported by the police officer and not only of some of such offences.",
      "speaker": "court",
      "significance": "Core reasoning allowing trial of summons offence post-discharge of warrant offence."
    }
  ],
  "_case_id": "1960_85",
  "_label": 0,
  "_text_length": 8046,
  "_extracted_at": "2026-02-10T19:52:23.001610"
}