{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Ahmedabad v. Karamchand Premchand Ltd., Ahmedabad",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "K. DAS, J."
    ],
    "case_number": "Civil Appeal No. 304 of 1958",
    "date_of_judgment": "1960-04-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee, Karamchand Premchand Ltd., held the managing agency of the Ahmedabad Manufacturing and Calico Printing Co. Ltd. and had a pharmaceutical business in Baroda State under the name Sarabhai Chemicals.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The assessee's business in India showed business profits assessable under the Business Profits Tax Act, 1947, but the business in Baroda showed a loss in the relevant chargeable accounting periods.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Relevant chargeable accounting periods: (1) April 1, 1946 to December 31, 1946; (2) January 1, 1947 to December 31, 1947; (3) January 1, 1948 to December 31, 1948; (4) January 1, 1949 to March 31, 1949.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The assessee claimed that its assessable income in India should be reduced by the loss suffered in its Baroda business.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Income-tax Officer rejected the assessee's claim, holding that the Act did not apply to business in an Indian State unless profits were received or deemed received in or brought into India.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "On appeal, Appellate Assistant Commissioner upheld the assessee's contention and allowed the appeal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellate Tribunal held that under the third proviso to s.5, profits and losses of business in Indian State not to be considered unless received or brought into India, set aside AAC order, restored ITO order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Assessee moved applications for reference to Bombay High Court on question of law in respect of four periods (cases 85,86,87,88 of 1953-54), consolidated.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Tribunal referred question: 'Whether on the facts and circumstances of the case the loss suffered by the assessee in the business of Sarabhai Chemicals should be deducted in computing the business income of the assessee company liable to business profits tax?'",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Bombay High Court answered the question in the affirmative, held assessee entitled to deduct Baroda losses against profits in taxable territories. Judgment dated September 7, 1956 in Income-tax Reference No. 19 of 1956.",
      "type": "procedural",
      "date": "1956-09-07",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant obtained certificate of fitness from High Court and appealed to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "The true scope and effect of the third proviso to s. 5 of the Business Profits Tax Act, 1947: whether it excludes the Baroda business from the Act except when profits are received/brought into India, or merely exempts income/profits/gains, allowing set-off of losses.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The third proviso to s.5 excludes the Baroda business from the purview of the Act except insofar as income, profits or gains are received or deemed received in or brought into India; thus losses cannot be set off.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5"
      ],
      "legal_basis": "Third proviso to s.5, Business Profits Tax Act, 1947; contrast with first/second provisos; reference to Excess Profits Tax Act, 1940 s.5 third proviso; s.4(3) Indian Income-tax Act pre-1939"
    },
    {
      "id": "pa2",
      "text": "Construction allowing losses to be set off leads to anomaly where profits escape tax but losses reduce Indian profits; object was to exclude business unless profits brought in.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Legislative intent; precedents: CIT Madras v. M.P.T.K.M.M.S.M.A.B. Somasundaram Chettiar; CIT Bombay v. Provident Investment Co. Ltd."
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Third proviso exempts only income, profits or gains of Baroda business unless received/brought into India, but business remains within purview of Act under substantive s.5; losses can be set off against Indian profits as all businesses treated as one.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "S.5 substantive part and provisos, Business Profits Tax Act, 1947; s.2(3) second proviso (all businesses as one); analogy to s.14(2)(c) Indian Income-tax Act, 1922"
    },
    {
      "id": "ra2",
      "text": "Change in language from Excess Profits Tax Act, 1940 s.5 third proviso assimilates to s.14(2)(c) I.T. Act allowing loss set-off; precedents support set-off under same head.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "CIT Mysore etc. v. Indo-Mercantile Bank Ltd.; CIT Bombay v. Murlidhar Mathurawalla Mahajan Association; CET Bombay v. Bhogilal H. Patel"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Unit of taxation is the business; s.5 substantive part applies Act to assessee's business including Baroda; third proviso unlike first/second does not exclude business but exempts income/profits/gains unless received/brought in; language apt for exemption not exclusion.",
      "addresses_issue": "i1",
      "key_observation": "Third proviso takes out only income, profits, gains; losses not included as they cannot be 'received or brought into' territories."
    },
    {
      "id": "cr2",
      "text": "Contrast with Excess Profits Tax Act s.5 third proviso which explicitly excluded business; legislature used different language deliberately, aligning with I.T. Act s.14(2)(c) allowing loss set-off.",
      "addresses_issue": "i1",
      "key_observation": "Expression 'income, profits or gains' excludes losses; all businesses treated as one under s.2(3)."
    },
    {
      "id": "cr3",
      "text": "No anomaly; hypothetical difficulties in capital computation or deficiency relief not compelling; ambiguity benefits assessee.",
      "addresses_issue": "i1",
      "key_observation": "High Court correctly answered reference."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Third proviso to s.5 exempts income, profits or gains of business in Indian State unless received/brought into taxable territories, but does not exclude the business; losses can be set off against Indian profits.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Mysore, Travancore-Cochin and Coorg v. Indo-Mercantile Bank Ltd.",
      "citation": "1959 Supp. 2 S.C.R. 256",
      "treatment": "followed",
      "relevance": "Effect of s.24(1) first proviso I.T. Act on set-off under same head."
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay City v. Murlidhar Mathurawalla Mahajan Association",
      "citation": "1948 16 I.T.R. 146",
      "treatment": "followed",
      "relevance": "Set-off of Indian State loss against Indian profits under same head (s.10 I.T. Act)."
    },
    {
      "case_name": "Commissioner of Excess Profits Tax, Bombay City v. Bhogilal H. Patel",
      "citation": "1952 21 I.T.R. 72",
      "treatment": "followed",
      "relevance": "Distinction in Excess Profits Tax Act s.5 third proviso excluding business vs. profits."
    },
    {
      "case_name": "CIT Madras v. M.P.T.K.M.M.S.M.A.B. Somasundaram Chettiar",
      "citation": "A.I.R. 1928 Mad. 487",
      "treatment": "distinguished",
      "relevance": "Interpretation of 'Act shall not apply' in I.T. Act s.4(3) pre-1939."
    },
    {
      "case_name": "CIT Bombay v. The Provident Investment Co. Ltd.",
      "citation": "1931 1 L.R. 56 Bom. 92",
      "treatment": "distinguished",
      "relevance": "No deduction of foreign business expenses."
    }
  ],
  "statutes_cited": [
    {
      "name": "Business Profits Tax Act, 1947",
      "sections": [
        "s. 2(1)",
        "s. 2(3)",
        "s. 2(7)",
        "s. 2(17)",
        "s. 4",
        "s. 5 (third proviso)",
        "s. 6",
        "Schedule II r. 2A"
      ],
      "relevance": "Charging on taxable profits of business; application to businesses with part profits chargeable to I.T.; third proviso exempts income/profits/gains from Indian States unless remitted; all businesses as one."
    },
    {
      "name": "Excess Profits Tax Act, 1940",
      "sections": [
        "s. 4",
        "s. 5 (third proviso)"
      ],
      "relevance": "Prior Act with different third proviso explicitly excluding business in Part B State."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 4(1)(b)(i),(ii), (c)",
        "s. 10",
        "s. 14(2)(c)",
        "s. 24(1)",
        "s. 42"
      ],
      "relevance": "Basis for application of BPT Act; set-off of losses under same head; taxation of remitted foreign profits."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the Bombay High Court's decision that the assessee is entitled to deduct losses from its Baroda business against profits in taxable territories, as the third proviso to s.5 merely exempts income/profits/gains unless remitted, without excluding the business.",
    "relief_granted": "Assessee entitled to set off Baroda losses.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the third proviso does not use the language of exclusion in respect of any business. What it takes out of the ambit of the Act is merely the income, profits and gains of a particular business.\"",
      "speaker": "court",
      "significance": "Core reasoning distinguishing exemption from exclusion."
    },
    {
      "text": "\"on the language of the proviso as it stands, the answer given by the High Court appears to us to be the correct answer.\"",
      "speaker": "court",
      "significance": "Affirmation of High Court holding."
    },
    {
      "text": "\"if there is any ambiguity of language, the benefit of that ambiguity must be given to the assessee.\"",
      "speaker": "court",
      "significance": "Rule of construction in tax cases."
    }
  ],
  "_case_id": "1960_146",
  "_label": 0,
  "_text_length": 31031,
  "_extracted_at": "2026-02-10T19:53:09.879639"
}