{
  "metadata": {
    "case_name": "Appellants (Shareholders of Navjivan Mills Ltd.) v. Respondent (Income Tax Authorities)",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 364 of 1957",
    "date_of_judgment": "1960-11-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellants held 570 out of a total issue of 800 shares of the Navjivan Mills Ltd., Kalol, a public limited company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Between the years 1943-47, the Mills purchased 5,000 shares of the Bank of India Ltd.",
      "type": "background",
      "date": "1943-1947",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "At an extraordinary general meeting of the shareholders of the Bank of India held on May 6, 1948, a resolution was passed increasing the share capital of the Bank and offering new shares to the existing shareholders in the proportion of one new share for every three shares held.",
      "type": "material",
      "date": "1948-05-06",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The face value of the new shares was Rs. 50, but issued at a premium of Rs. 50, requiring payment of Rs. 100 per new share.",
      "type": "material",
      "date": "1948-05-06",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Mills, as holder of 5,000 shares, became entitled to 1,666 shares of the Bank of India at Rs. 100 per share.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Bank of India communicated resolution by letter dated May 25, 1948, enclosing forms A (acceptance), B (renunciation), C (allotment to nominees).",
      "type": "procedural",
      "date": "1948-05-25",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Directors of the Mills passed resolution to invest in 66 shares only, and distribute right to remaining 1,600 shares amongst its 800 shareholders in proportion of shares held (right to two shares of Bank per one ordinary share in Mills).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Mills exercised right to take 66 shares, and right to 1,600 shares distributed to shareholders.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Seven appellants, holders of 570 shares of Mills, became entitled to 1,140 shares of Bank of India, agreed to allotment, and transferred to Jesinghbai Investment Co. Ltd.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Assessment of seven appellants and other shareholders reopened under s. 34(1)(a) of Indian Income Tax Act by Income Tax Officer, treating release by Mills of shares as distribution of dividend, value of right taxable under s. 12, had escaped tax.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "ITO's reassessment order confirmed by Appellate Assistant Commissioner and Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Tribunal referred question to Bombay High Court under s. 66(1): 'Whether on the facts and circumstances of the case the distribution of the right to apply for the shares of the Bank of India by Navjivan Mills Ltd. in favour of the assessees amounted to a distribution of dividend within the meaning of s. 2(6A) of the Indian Income Tax Act.'",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "High Court reframed question slightly and answered in affirmative on February 22, 1956.",
      "type": "procedural",
      "date": "1956-02-22",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Right to apply for shares had market value of Rs. 100 per share; new shares quoted at more than Rs. 200.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "High Court granted leave to appeal certifying question of importance.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of the case the distribution of the right to apply for the shares of the Bank of India by Navjivan Mills Ltd. in favour of the assessees amounted to a distribution of dividend within the meaning of s. 2(6A) of the Indian Income Tax Act.",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court was not justified in enlarging scope of question beyond 'within the meaning of s. 2(6A)', answering in light of ordinary meaning.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": "s. 2(6A) Indian Income Tax Act"
    },
    {
      "id": "pa2",
      "text": "In intimating shareholders to exercise option to purchase new issue, Mills did not distribute any dividend; Mills not obliged to accept offer, had three options: accept, decline, or surrender to nominee.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Distribution of right to shares was dividend within ordinary and extended meaning of s. 2(6A), taxable as income.",
      "supporting_facts": [
        "f7",
        "f9",
        "f10"
      ],
      "legal_basis": "s. 2(6A), s. 12 Indian Income Tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court justified in considering both normal and extended meaning of 'dividend' under s. 2(6A); question not limited to extended definition only.",
      "addresses_issue": "i1",
      "key_observation": "Tribunal question required accounting for normal and extended meaning."
    },
    {
      "id": "cr2",
      "text": "Dividend in ordinary meaning is distributive share of profits/income to shareholders; s. 2(6A) inclusive, adds categories to normal meaning.",
      "addresses_issue": "i1",
      "key_observation": "'Dividend' means as normally understood plus specified receipts."
    },
    {
      "id": "cr3",
      "text": "Mills transferred valuable right (market value Rs. 100-200 per share) to shareholders by nominating them for allotment; not distribution of capital.",
      "addresses_issue": "i1",
      "key_observation": "Mills could sell right and distribute proceeds (dividend), or transfer directly (still dividend); dividend need not be money, can be property/right of monetary value."
    },
    {
      "id": "cr4",
      "text": "Form of resolution does not alter true character; distribution of right at half market value is dividend.",
      "addresses_issue": "i1",
      "key_observation": "High Court right in holding it amounted to distribution of dividend."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Distribution of the right to apply for and obtain two shares of the Bank of India at half their market value for each share held by the shareholders of the Mills amounted to distribution of dividend.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act",
      "sections": [
        "s. 2(6A)",
        "s. 12",
        "s. 34(1)(a)",
        "s. 66(1)"
      ],
      "relevance": "Definition of dividend inclusive of normal meaning; basis for reassessment, taxability of right as income, reference to High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court's affirmative answer that distribution of rights was dividend; appeal dismissed implicitly by agreement with lower courts.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Dividend in its ordinary meaning is a distributive share of the profits or income of a company given to its shareholders.",
      "speaker": "court",
      "significance": "Defines ordinary meaning of dividend central to reasoning."
    },
    {
      "text": "Dividend need not be distributed in money it may be distributed by delivery of property or right having monetary value.",
      "speaker": "court",
      "significance": "Key holding on nature of dividend distribution."
    },
    {
      "text": "By its resolution, the Mills in truth transferred a right of the value of Rs. 200 for each share held by its shareholders.",
      "speaker": "court",
      "significance": "Explains economic substance of transaction as dividend."
    }
  ],
  "_case_id": "1960_261",
  "_label": 0,
  "_text_length": 9755,
  "_extracted_at": "2026-02-10T19:55:11.271209"
}