{
  "metadata": {
    "case_name": "Vadilal Panchal v. Dattatraya Dulaji Ghadigaonkar",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das, J."
    ],
    "case_number": "Criminal Appeal No. 117 of 1958",
    "date_of_judgment": "1960-05-06"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On June 3, 1956, in the evening, a public meeting was held at Chowpatty in Bombay addressed by the Prime Minister in connection with agitation for reorganisation of State of Bombay. There was considerable disturbance, meeting dispersed, large crowds wandered around including near Charni Road Station.",
      "type": "background",
      "date": "1956-06-03",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "At about 8 p.m., Sitaram (younger brother of complainant Dattatraya Dulaji Ghadigaonkar) was crossing Queens Road near Laud Mansion with Sashikant Kamtekar and Nand Kumar Vagal. Large crowd stopping vehicles. Taxi cab from Opera House towards Churchgate stopped. Heard revolver shots, Bhayya injured and fell. They went to help, another shot fired from blue car near taxi cab, Sitaram hit on chest, bullet injured right ventricle of heart.",
      "type": "disputed",
      "date": "1956-06-03",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Sitaram removed to G.T. Hospital, died before medical assistance. Postmortem by Dr. H.S. Mehta: died of shock and haemorrhage from gunshot wound; charring indicated fired from 2 to 18 inches.",
      "type": "material",
      "date": "1956-06-03",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Complainant alleged Vadilal Panchal (appellant) fired the shot from blue car. Occupants: K.K. Shah, his son Vinay, Ratilal Sanghvi (back seat); appellant and chauffeur Mohiddin (front seat).",
      "type": "disputed",
      "date": "1956-06-03",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "K.K. Shah's version: After meeting, returning home via longer route due to trouble. At Queens Road, large crowds pelting stones, shouting slogans, committing violence; public bus burnt, taxi ahead stopped. 300-400 surrounded car, pelted stones, shouted 'maro maro', attempted to drag Ratilal and appellant. Appellant fired revolver, rioters held back, car passed. Later reported at Gamdevi Police Station. Appellant treated at Nair Hospital.",
      "type": "admitted",
      "date": "1956-06-03",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Coroner held inquest on Sitaram's death. Witnesses including K.K. Shah, Sashikant Kamtekar examined. Jury verdict on October 16, 1956: died of gunshot by appellant in exercise of right of private defence, justified.",
      "type": "procedural",
      "date": "1956-10-16",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On July 3, 1956, complainant enquired via advocate from Commissioner of Police if appellant arrested; reply: no offence by appellant, no action.",
      "type": "procedural",
      "date": "1956-07-03",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Complaint filed by respondent on October 31, 1956 in Presidency Magistrate Court.",
      "type": "procedural",
      "date": "1956-10-31",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Magistrate referred to Superintendent of Police, C.I.D. for enquiry under s.202 CrPC. Report November 15, 1956: Vadilal justified in using firearms in self-defence.",
      "type": "procedural",
      "date": "1956-11-15",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Magistrate gave opportunity to examine witnesses. Enquiring officer examined all, report March 12, 1957: Vadilal fired in right of private defence, as per Coroner's jury.",
      "type": "procedural",
      "date": "1957-03-12",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "On April 30, 1957, Magistrate dismissed complaint under s.203 CrPC: police statements show right of private defence; prosecution witnesses false, not credible; harassment to issue process.",
      "type": "procedural",
      "date": "1957-04-30",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Respondent moved Bombay High Court in Criminal Petition Application No. 834 of 1957. High Court on September 13, 1957 set aside dismissal, directed issue process: cannot establish exception from police report alone per s.105 Evidence Act.",
      "type": "procedural",
      "date": "1957-09-13",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appellant obtained special leave to appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a Magistrate, after inquiry under s.202 CrPC where report supports plea of self-defence by accused, can dismiss complaint under s.203 CrPC, or must issue process and leave plea to trial?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Magistrate can consider plea of right of private defence at s.203 stage based on inquiry materials; applied judicial mind, found no sufficient ground to proceed as witnesses unreliable and self-defence established.",
      "supporting_facts": [
        "f5",
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "ss.200, 202, 203 CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Magistrate cannot establish exception (right of private defence under ss.96 onwards IPC) merely from police report; s.105 Evidence Act mandatory; must issue process.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "ss.96 onwards IPC; s.105 Evidence Act; ss.202, 203 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Scope of s.202 inquiry is to ascertain truth/falsehood of complaint for issuing process, not full trial. Under s.203, Magistrate considers complainant/witness statements and inquiry result to judge if sufficient ground to proceed; can accept plea of exception if materials satisfactory.",
      "addresses_issue": "i1",
      "key_observation": "Magistrate not fettered; applies judicial mind to materials, not bound by inquiry but can rely if reliable."
    },
    {
      "id": "cr2",
      "text": "High Court erred in holding as matter of law Magistrate cannot accept self-defence plea at this stage; no absolute rule against it. Distinguished cited cases as not laying absolute proposition.",
      "addresses_issue": "i1",
      "key_observation": "Overwhelming material showed mob attack on car, inconsistent with complainant witnesses; their evidence unworthy of credence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Magistrate can dismiss complaint under s.203 if, after considering s.202 inquiry supporting exception like private defence, finds no sufficient ground to proceed.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Emperor v. Dhondu Bapu",
      "citation": "29 Bom. L.R. 713",
      "treatment": "distinguished",
      "relevance": "Dismissal without evidence bad; but if evidence taken, different."
    },
    {
      "case_name": "Emperor v. Finan",
      "citation": "33 Bom. L.R. 1182",
      "treatment": "distinguished",
      "relevance": "Must investigate claim under ss.76,79 IPC with legal evidence."
    },
    {
      "case_name": "Tulsidas v. Billimoria",
      "citation": "34 Bom. L.R. 910",
      "treatment": "distinguished",
      "relevance": "Different facts on absolute privilege for Bar."
    },
    {
      "case_name": "Gulab Khan v. Gulam Muhammad Khan",
      "citation": "A.I.R. 1927 Lah 30",
      "treatment": "followed",
      "relevance": "Magistrate can accept self-defence after s.202 inquiry if evidence unworthy."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "200",
        "202",
        "203",
        "204"
      ],
      "relevance": "Procedure for complaint, inquiry, dismissal if no sufficient ground."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "96"
      ],
      "relevance": "Right of private defence exceptions."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "105"
      ],
      "relevance": "Burden of proof for exceptions."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed. High Court order set aside, Presidency Magistrate's order dismissing complaint restored. Held Magistrate rightly found no sufficient ground to proceed based on inquiry materials supporting self-defence.",
    "relief_granted": "Restoration of dismissal of complaint",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The inquiry is for the purpose of ascertaining the truth or falsehood of the complaint that is, for ascertaining whether there is evidence in support of the complaint so as to justify the issue of process.\"",
      "speaker": "court",
      "significance": "Defines scope of s.202 CrPC inquiry."
    },
    {
      "text": "\"If the Magistrate has not misdirected himself as to the scope of an enquiry under s.202 and has applied his mind judicially to the materials before him, it would be erroneous in law to hold that a plea based on an exception can never be accepted by him.\"",
      "speaker": "court",
      "significance": "Core holding on Magistrate's power at s.203 stage."
    }
  ],
  "_case_id": "1960_151",
  "_label": 1,
  "_text_length": 23075,
  "_extracted_at": "2026-02-10T19:54:01.300258"
}