{
  "metadata": {
    "case_name": "Appellant (Textile Research Association) v. Workmen",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 22 of 1959",
    "date_of_judgment": "1960-11-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dispute between the appellant and its workmen related to the wagescale and dearness allowance of certain employees of the appellant and also to the payment of house-rent allowance.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The dispute was referred by the Government of Bombay for adjudication to the Industrial Tribunal, Bombay in Reference I.T. No. 141 of 1957.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Industrial Tribunal, Bombay delivered an award dated 31st October, 1957, rejecting the appellant's contention that the reference was incompetent as the appellant was not an industry under the Act, holding the reference valid and adjudicating the merits.",
      "type": "procedural",
      "date": "1957-10-31",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Appeal by special leave to the Supreme Court against the award of the Industrial Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellant-association was founded in 1947 to establish a textile research institute for carrying on research and other scientific work in connection with the textile trade or industry and allied trades.",
      "type": "background",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Objects of the appellant-association include investigation into manufacture and improvement of materials used in textile industry, utilisation of products, improvement of machinery, processes for greater efficiency, rationalisation and reduction of costs, research into conditions of work, time and motion studies, fatigue, standardisation, conditioning of factories, diseases and accidents.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "To carry out objects, appellant establishes and maintains laboratories, workshops, factories, conducts experiments, publishes books, papers, maintains libraries, museums, disseminates information, employs skilled personnel, founds schools/colleges for research, endows scholarships.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Research is directed to help member mills improve methods of production for greater efficiency, rationalisation and reduction of costs.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Administration vested in a Council consisting majority of representatives of the textile industry; research under Director of Research by technical personnel who are paid employees.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Technical personnel give undertaking of secrecy and not to use knowledge privately; inventions/processes property of association for use by members per rules.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Rule 13: Member may object to proposed research to government; research halted pending decision unless government directs otherwise.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Rule 42: Results of research property of association, not individual researchers.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Rule 44: Employees contract to assign all rights in discoveries, inventions to association.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Costs met partly by members, partly by government grants.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Employees raising dispute do not contribute to research, but technical personnel do.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant was an industry within the meaning of s. 2(j) of the Industrial Disputes Act, 1947, rendering the reference competent.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The reference was incompetent as the appellant was not an industry under s. 2(j) of the Act; appellant is a research centre in the nature of educational activity with no analogy to trade or business.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "s. 2(j) Industrial Disputes Act, 1947; Federated State School Teachers Assn. v. State of Victoria"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The appellant is an undertaking within s. 2(j) as held by the Tribunal.",
      "supporting_facts": [],
      "legal_basis": "s. 2(j) Industrial Disputes Act, 1947"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s. 2(j) uses wide words but line drawn to exclude some; undertaking need not involve profit or capital investment; sovereign govt activities excluded but not welfare; relevant if profit motive present; undertaking if systematically undertaken for production/distribution of goods or material services to community/part with employees' help, organised like trade/business.",
      "addresses_issue": "i1",
      "key_observation": "Tests from State of Bombay v. Hospital Mazdoor Sabha applied."
    },
    {
      "id": "cr2",
      "text": "Appellant's activity satisfies tests: systematic, renders material services (discovery of processes for efficiency, cost reduction) to member-mills (part of community), with help of employees (technical personnel paid, no rights in results), organised like trade/business, postulates employer-employee cooperation.",
      "addresses_issue": "i1",
      "key_observation": "Research benefits members like joint research dept; not purely educational."
    },
    {
      "id": "cr3",
      "text": "Australian case distinguished as appellant not purely educational institution.",
      "addresses_issue": "i1",
      "key_observation": "Little in common with purely educational activities."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The appellant-association is carrying on an activity which comes within the definition of 'industry' in s. 2(j); the dispute is an industrial dispute and could be properly referred for adjudication under the Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Bombay v. Hospital Mazdoor Sabha",
      "citation": "1960 2 S.C.R. 866",
      "treatment": "followed",
      "relevance": "Definition of 'undertaking' under s. 2(j); tests for industry including systematic activity for material services organised like trade/business."
    },
    {
      "case_name": "Federated State School Teachers Assn. v. State of Victoria",
      "citation": "1929 41 C.L.R. 569",
      "treatment": "distinguished",
      "relevance": "Educational activities of state not industry; distinguished as appellant not purely educational."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 2(j)"
      ],
      "relevance": "Definition of 'industry'; determines competence of reference."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The Supreme Court holds that the appellant is an 'industry' under s. 2(j) of the Industrial Disputes Act, 1947, upholding the Tribunal's finding that the reference was competent.",
    "relief_granted": "None to appellant; upholds Tribunal award on competence.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"an activity systematically or habitually undertaken for the production or distribution of goods or for the rendering of material services to the community at large or a part of such community with the help of employees would be an undertaking within the meaning of the Act provided it was carried on in an organised manner like trade or business.\"",
      "speaker": "court",
      "significance": "Key test from Hospital Mazdoor Sabha case applied to define undertaking/industry."
    },
    {
      "text": "\"the appellant-association is carrying on an activity which clearly comes within the definition of the word industry in s. 2(j) and which cannot be assimilated to a purely educational institution.\"",
      "speaker": "court",
      "significance": "Conclusion that appellant is an industry, dismissing appeal."
    }
  ],
  "_case_id": "1960_169",
  "_label": 0,
  "_text_length": 14933,
  "_extracted_at": "2026-02-10T19:54:13.467666"
}