{
  "metadata": {
    "case_name": "Appellant (Tenant) v. Respondent (Landlord)",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur J."
    ],
    "case_number": "Civil Appeal No. 24 of 1956",
    "date_of_judgment": "1960-09-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On March 14, 1948, the appellant took two houses in Morar from the respondent at a monthly rental of Rs. 80 plus other charges at Rs. 5 per month.",
      "type": "background",
      "date": "1948-03-14",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On October 20, 1948, the appellant brought a suit for fixation of rent in the court of the Cantonment Magistrate at Morar under the provisions of Accommodation Control Ordinance XX of 1944.",
      "type": "procedural",
      "date": "1948-10-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Accommodation Control Act XV of 1950 was passed on January 25, 1950, and came into force on February 10, 1950.",
      "type": "background",
      "date": "1950-01-25",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Because of the passing of the Act the plaint was returned on March 20, 1950, for want of jurisdiction.",
      "type": "procedural",
      "date": "1950-03-20",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On April 28, 1950, the appellant filed the suit before the Rent Controller praying for the fixation of fair rent at Rs. 20 per month.",
      "type": "procedural",
      "date": "1950-04-28",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The respondent pleaded inter alia that the suit could not be instituted before the Rent Controller and that the suit was incompetent because notice under s. 7(2) of the Act had not been given.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Both pleas of the respondent were overruled; Rent Controller held that the notice which the appellant had given prior to the institution of the first suit was a proper notice, decreed the suit and fixed the fair rent at Rs. 483 per annum. Respondent's appeal to District Judge was dismissed; question of notice under s. 7 not raised there.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Respondent filed Revision Petition in High Court under s. 115 CPC and Art. 227 Constitution; High Court held notice under s. 7 condition precedent, no such notice given so no jurisdiction; Rent Controller passed decree operating retrospectively from lease deed date without authority; original suit properly instituted in civil court, Act did not take away its jurisdiction so plaint should not have been returned.",
      "type": "procedural",
      "date": "1954-03-31",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a suit could be instituted without a fresh notice because of s. 7(2) of the Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the notice given by appellant prior to the Act was a proper notice under s. 7(2).",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Rent Controller's order operated retrospectively from the date of the lease deed.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether the civil court should have returned the plaint given the Act's passing.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The notice given prior to institution of first suit was proper notice under s. 7(2); trial court so held.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s. 7(2) Accommodation Control Act XV of 1950"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Suit could not be instituted before Rent Controller without notice under s. 7(2); such notice must be given after Act came into force in terms of the Act.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s. 7(2) Accommodation Control Act XV of 1950"
    },
    {
      "id": "ra2",
      "text": "Rent Controller had no authority to pass decree operating retrospectively from lease deed date.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Original suit properly instituted in civil court; Act did not take away its jurisdiction.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S. 7(2) provides that where rent agreed or landlord wishes to enhance or tenant to reduce, by giving notice in writing to other party shall proceed for fixation under sub-s. (4); all it contemplates is that notice should be given; no words make it obligatory that notice issued in terms under Act after it came into force or in particular form.",
      "addresses_issue": "i1",
      "key_observation": "Trial court held prior notice proper; point not raised before District Judge."
    },
    {
      "id": "cr2",
      "text": "Notice given by appellant was proper notice; section does not mean notice had to be given under and after Act.",
      "addresses_issue": "i2",
      "key_observation": "Significant that point never taken before District Judge."
    },
    {
      "id": "cr3",
      "text": "Fairly construed, order of Rent Controller does not operate retrospectively from date of lease but prospective; after coming into operation of Act, jurisdiction vested in Rent Controller not civil court.",
      "addresses_issue": "i3",
      "key_observation": "This point has no substance."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Notice prior to Act was proper under s. 7(2); no fresh notice in specific form after Act required.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Rent Controller's order prospective, not retrospective; had jurisdiction post-Act.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Civil court properly returned plaint post-Act.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Accommodation Control Act XV of 1950",
      "sections": [
        "s. 7(2)",
        "s. 7(4)"
      ],
      "relevance": "Notice under s. 7(2) condition precedent for suit for fixation of rent; does not require specific form or post-Act issuance."
    },
    {
      "name": "Accommodation Control Ordinance XX of 1944",
      "sections": [],
      "relevance": "Governed initial suit for rent fixation before Cantonment Magistrate."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s. 115"
      ],
      "relevance": "Basis for respondent's revision petition."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 227"
      ],
      "relevance": "Basis for respondent's revision petition."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment and order of High Court set aside; that of trial court restored.",
    "relief_granted": "Restoration of Rent Controller's order fixing fair rent at Rs. 483 per annum.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "All that this section contemplates is that a notice should be given. There are no words which make it obligatory that the notice should be issued in terms as under the Act and be given after the Act came into force nor has it prescribed any particular form.",
      "speaker": "court",
      "significance": "Core reasoning on sufficiency of prior notice under s. 7(2)."
    },
    {
      "text": "In our opinion it cannot be said that the notice which was given by the appellant was not a proper notice nor does the section mean, as contended by the respondent, that the notice had to be given as under and after the Act came into force.",
      "speaker": "court",
      "significance": "Rejects respondent's contention on notice requirement."
    }
  ],
  "_case_id": "1960_276",
  "_label": 1,
  "_text_length": 4890,
  "_extracted_at": "2026-02-10T19:55:14.369956"
}