{
  "metadata": {
    "case_name": "State of Bombay v. Vishnu Ramchandra",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": "Criminal Appeal No. 78 of 1959",
    "date_of_judgment": "1960-10-18"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Vishnu Ramchandra was convicted under s. 380 and 114 of the Indian Penal Code on November 16, 1949, and sentenced to one month's rigorous imprisonment.",
      "type": "material",
      "date": "1949-11-16",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On October 15, 1957, the Deputy Commissioner of Police, Bombay, acting under s. 57 of the Bombay Police Act, 1951, passed an order externing Vishnu Ramchandra from the limits of Greater Bombay for one year.",
      "type": "procedural",
      "date": "1957-10-15",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "At the time of the externment order, a prosecution under s. 411 of the Indian Penal Code was pending against Vishnu Ramchandra, so he was not immediately externed to enable him to attend the case.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "The s. 411 IPC prosecution ended on July 10, 1958, resulting in his acquittal.",
      "type": "procedural",
      "date": "1958-07-10",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Immediately after acquittal, a constable took Vishnu Ramchandra outside the limits of Greater Bombay and left him there.",
      "type": "procedural",
      "date": "1958-07-10",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Vishnu Ramchandra returned to Greater Bombay and was arrested at Pydhonie on August 24, 1958.",
      "type": "material",
      "date": "1958-08-24",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Vishnu Ramchandra was prosecuted under s. 142 of the Bombay Police Act. His plea that he was forcibly brought back to Pydhonie was not accepted.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Presidency Magistrate, 2nd Court, Mazagaon, Bombay convicted Vishnu Ramchandra under s. 142 Bombay Police Act and sentenced him to six months' rigorous imprisonment on September 18, 1958.",
      "type": "procedural",
      "date": "1958-09-18",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Vishnu Ramchandra filed Criminal Revision Application No. 1393 of 1958 in Bombay High Court, which acquitted him on November 25, 1958.",
      "type": "procedural",
      "date": "1958-11-25",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Deputy Commissioner of Police had applied his mind to the facts of the case before making the order of externment.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether s. 57 of the Bombay Police Act was prospective and could not be made applicable unless the conviction on which the action of externment was based took place after the coming into force of that Act.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether the belief entertained by the Deputy Commissioner that Vishnu Ramchandra was likely to engage himself in the commission of an offence similar to that for which he was prosecuted was based on the pending prosecution which ended in acquittal.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "S. 57 of the Bombay Police Act merely re-enacted provisions of s. 27 of the City of Bombay Police Act, 1902, and liability under the older Act was preserved by s. 167 of the Bombay Police Act, 1951.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "S. 167 Bombay Police Act, 1951"
    },
    {
      "id": "pa2",
      "text": "S. 57 is not retrospective but prospective, yet applies to past convictions as it protects public and does not create new offences or punishments.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Principles of statutory interpretation; precedents like Midland Rly. Co. v. Pye, Queen v. Vine"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Deputy Commissioner of Police had not applied his mind to the facts before making the externment order.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "S. 57 is prospective because of the present participle 'has been convicted'; being penal, interpreted prospectively; conviction in 1949 predates Act.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "S. 57 Bombay Police Act, 1951"
    },
    {
      "id": "ra3",
      "text": "Belief of Deputy Commissioner based on pending s. 411 IPC prosecution which ended in acquittal, so ground disappeared.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "S. 57 Bombay Police Act, 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Statutes must be interpreted prospectively unless language makes them retrospective expressly or by implication; penal statutes creating new offences prospective, but those creating disabilities on past conduct may be retrospective if intendment clear.",
      "addresses_issue": "i2",
      "key_observation": "Penal statutes shocking justice if retrospective unless clear intent; but protective statutes for public benefit may apply to past convictions."
    },
    {
      "id": "cr2",
      "text": "S. 57 does not create new offence or punish past acts but protects public from undesirable convicted persons by externment; applies prospectively to orders made after Act but based on past convictions.",
      "addresses_issue": "i2",
      "key_observation": "'Has been convicted' in present perfect tense describes past actions as hypothesis without regard to time."
    },
    {
      "id": "cr3",
      "text": "Externment order must be bona fide, based on conviction sufficiently proximate in time; no absolute rule, depends on facts.",
      "addresses_issue": "i1",
      "key_observation": "High Court erred in holding s. 57 inapplicable to pre-Act convictions."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S. 57 of Bombay Police Act, 1951 operates prospectively but authorizes action based on past convictions to protect public; High Court wrong in holding it prospective only excluding pre-Act convictions.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Externment order valid if bona fide and conviction proximate; case remitted implicitly for consideration on facts.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Midland Rly. Co. v. Pye",
      "citation": "10 C.B. N.S. 179, 191",
      "treatment": "followed",
      "relevance": "Principle against retrospective penal statutes unless clear language."
    },
    {
      "case_name": "Rex v. Birthwhistle",
      "citation": "58 L.J. N.S. M.C. 158",
      "treatment": "referred",
      "relevance": "Retrospective Acts to cure existing evil without express words."
    },
    {
      "case_name": "Queen v. Vine",
      "citation": "10 Q.B. 195",
      "treatment": "followed",
      "relevance": "Protective statutes against harmful persons construed retrospectively if language permits."
    },
    {
      "case_name": "Ex Parte Pratt",
      "citation": "12 Q.B. 334",
      "treatment": "followed",
      "relevance": "Present tense used as hypothesis without regard to time."
    },
    {
      "case_name": "Bourke v. Nutt",
      "citation": "1 Q.B. 725",
      "treatment": "referred",
      "relevance": "Time for consideration is when court acts, not when condition arose; public benefit exception."
    },
    {
      "case_name": "Ganesan v. A. K. Joscelyne",
      "citation": "A.I.R. 1957 Cal. 33",
      "treatment": "followed",
      "relevance": "Protective Acts against undesirable persons not strictly prospective."
    },
    {
      "case_name": "Taher Saifuddin v. Tyebbhai Moosaji",
      "citation": "A.I.R. 1953 Bom. 183",
      "treatment": "followed",
      "relevance": "Same principles for public protection statutes."
    },
    {
      "case_name": "The Queen v. Inhabitants of St. Mary Whitechapel",
      "citation": "12 Q.B. 120",
      "treatment": "referred",
      "relevance": "Prospective operation relating to future actions drawing on antecedent facts."
    },
    {
      "case_name": "Rex v. Austin",
      "citation": "1 K.B. 551",
      "treatment": "followed",
      "relevance": "No vested right in past crimes; legislation may consider antecedents."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Police Act, 1951",
      "sections": [
        "57",
        "142",
        "167"
      ],
      "relevance": "S.57 authorizes externment based on past convictions of specified offences to protect public; s.142 for violation; s.167 preserves prior liabilities."
    },
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "380",
        "114",
        "411"
      ],
      "relevance": "Convictions under these trigger s.57 Bombay Police Act."
    },
    {
      "name": "City of Bombay Police Act, 1902",
      "sections": [
        "27"
      ],
      "relevance": "Predecessor provision re-enacted in Bombay Police Act, 1951."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal by special leave allowed; High Court's order of acquittal set aside as erroneous on interpretation of s.57 Bombay Police Act; externment order held valid in principle, subject to proximity of conviction and bona fides on facts.",
    "relief_granted": "Reversal of High Court acquittal; restoration of Magistrate's conviction implied.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Statutes must always be interpreted prospectively, unless the language of the statutes makes them retrospective, either expressly or by necessary implication.\"",
      "speaker": "court",
      "significance": "Core principle of statutory interpretation applied."
    },
    {
      "text": "\"No man has such a vested right in his past crimes and their consequences as would entitle him to insist that in future legislation shall any regard whatever be had to his previous history.\"",
      "speaker": "court",
      "significance": "Justifies considering past convictions for protective measures."
    },
    {
      "text": "The verb 'has been' describes past actions, and is used to express a hypothesis, without regard to time.",
      "speaker": "court",
      "significance": "Rejects High Court's tense-based prospectivity argument."
    }
  ],
  "_case_id": "1960_292",
  "_label": 1,
  "_text_length": 15095,
  "_extracted_at": "2026-02-10T19:55:21.303316"
}