{
  "metadata": {
    "case_name": "M/s. Northbrook Jute Co., Ltd. & Dalhousie Jute Mills v. Their Workmen",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Civil Appeal No. 141 of 1959",
    "date_of_judgment": "1960-03-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Proposal of introducing a rationalisation scheme in the two mills was considered at an extraordinary meeting of the Works Committee almost a month before the reference, and the Committee agreed to the proposal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Notice under s. 9A of the Industrial Disputes Act was given by the companies to the Unions of their workmen.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Workmen objected to the introduction of the rationalisation scheme, leading to a dispute referred by Government of West Bengal under s. 10 on December 13, 1957: 'Do the proposals of rationalisation in the above two mills involve any increase in workload? If so, what relief the workmen are entitled to?'",
      "type": "material",
      "date": "1957-12-13",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On December 16, 1957, while the reference was pending before the Tribunal, the management put the rationalisation scheme into operation.",
      "type": "material",
      "date": "1957-12-16",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Workmen refused to do the additional work placed on them by the scheme.",
      "type": "disputed",
      "date": "1957-12-16",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Same day, December 16, 1957, the mills declared a lock-out.",
      "type": "material",
      "date": "1957-12-16",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Work resumed on December 20, 1957 in all departments except weaving and finishing, and on December 21, 1957 in those two departments, as a result of a settlement on the rationalisation scheme.",
      "type": "procedural",
      "date": "1957-12-20",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Dispute arose regarding payment of wages for the closure period: December 16-20 in weaving/finishing, December 16-19 in other departments. Referred to Tribunal by Government order dated February 1, 1958.",
      "type": "material",
      "date": "1958-02-01",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Earlier reference amended to: 'Have the rationalisation effected in the above two mills since 16th December, 1957, involved any increase in the workload? To what relief the workers are entitled to?' Tribunal decided against workmen on this, no longer disputed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Tribunal awarded wages to workmen for the period of absence during the closure.",
      "type": "admitted",
      "date": "1958-07-19",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Employers' witness Mr. Fraser stated: previously two hands per machine in batching, now two for two machines; surplus labour, company losing heavily, rationalisation to reduce costs by more work for same wages.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Did the employers' introduction of the rationalisation scheme on December 16, 1957, while the reference was pending, contravene s. 33 of the Industrial Disputes Act?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Was the workmen's refusal to do additional work an illegal strike, or was the employers' lock-out illegal, entitling workmen to wages for the closure period?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Works Committee approved the scheme, and workmen's representatives thereon agreed, so binding on workmen.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Section 3(2) of the Industrial Disputes Act"
    },
    {
      "id": "pa2",
      "text": "Alteration in conditions of service was made when notice under s. 9A was given, before December 13 reference, no contravention of s. 33.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Section 9A of the Industrial Disputes Act"
    },
    {
      "id": "pa3",
      "text": "Alteration was not to the prejudice of the workmen.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Section 33 of the Industrial Disputes Act"
    },
    {
      "id": "pa4",
      "text": "Workmen's remedy was under s. 33A; refusal to work was illegal strike, justifying lock-out.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Sections 33A and 33 of the Industrial Disputes Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Workmen could not do work due to illegal lock-out by employers.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Works Committee representatives do not represent workmen for all purposes; their functions under s. 3(2) are to comment on matters of common interest and compose differences, not decide substantial changes like rationalisation; not binding on unions.",
      "addresses_issue": "i1",
      "key_observation": "Works Committee not intended to supplant unions for collective bargaining."
    },
    {
      "id": "cr2",
      "text": "Change under s. 9A is effected only when actually introduced after 21 days, not on proposal or notice; here on Dec 16 while reference pending, contravening s. 33.",
      "addresses_issue": "i1",
      "key_observation": "Conditions of service altered only when new conditions actually introduced."
    },
    {
      "id": "cr3",
      "text": "Rationalisation increased workload, made surplus labour for discharge, prejudiced workmen seriously.",
      "addresses_issue": "i1",
      "key_observation": "Object to decrease cost by more work for same wages, surplus discharge."
    },
    {
      "id": "cr4",
      "text": "s. 33A remedy does not require workmen to work under illegal altered conditions; refusal not illegal strike; lock-out illegal.",
      "addresses_issue": "i2",
      "key_observation": "Workmen refused work employer had no right to ask."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Introduction of rationalisation scheme on Dec 16, 1957 contravened s. 33; lock-out illegal; workmen entitled to wages for closure period.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Workmen's refusal to do additional work not illegal strike.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kemp and Company Ltd. v. Their Workmen",
      "citation": "1955 I L.L.J. 48",
      "treatment": "followed",
      "relevance": "Works Committees concerned with day-to-day problems, functions limited to recommendations; final decision with union."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act",
      "sections": [
        "s. 10",
        "s. 9A",
        "s. 33",
        "s. 33A",
        "s. 3(2)"
      ],
      "relevance": "Reference of dispute; notice for change in conditions; prohibition on changes during pendency; remedy for contravention; functions of Works Committee; Fourth Schedule matters."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court upheld the Tribunal's award dated July 19, 1958, in favour of the workmen, holding that the employers' introduction of rationalisation contravened s. 33, the lock-out was illegal, and workmen entitled to wages for the closure period from December 16 to 20/19, 1957.",
    "relief_granted": "Wages for period of absence due to illegal lock-out",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Works Committee was not intended to supplant or supersede the Unions for the purpose of collective bargaining they are not authorised to consider real or substantial changes in the conditions of service.",
      "speaker": "court",
      "significance": "Defines limits of Works Committee authority."
    },
    {
      "text": "The conditions of service do not stand changed, either when the proposal is made or the notice is given but only when the change is actually effected.",
      "speaker": "court",
      "significance": "Clarifies timing of 'alteration' under s. 33 and s. 9A."
    },
    {
      "text": "When they refused to do the additional work which the rationalisation scheme required them to do, they refused to do work, which the employer had no right in law to ask them to do.",
      "speaker": "court",
      "significance": "Justifies workmen's refusal as not illegal strike."
    }
  ],
  "_case_id": "1960_323",
  "_label": 0,
  "_text_length": 12299,
  "_extracted_at": "2026-02-10T19:55:52.793367"
}