{
  "metadata": {
    "case_name": "Petitioner v. Respondent",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Misc. Petition No. 530 of 1959",
    "date_of_judgment": "1960-03-09"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent filed Civil Suit No. 18 of 1934 in Court of First Class Sub Judge at Dharwar claiming partition and possession of properties as adopted son of Shiddangouda; properties in possession of petitioner.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Trial court passed decree in favour of respondent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Petitioner preferred Appeal No. 182 of 1935 in High Court of Bombay; appeal allowed and trial court decree reversed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent appealed to Privy Council in Appeal No. 11 of 1948; appeal allowed, trial court decree restored; Order-in-Council dated November 25, 1949, entitled respondent to half share by partition, mesne profits past and future till recovery of possession or three years with enquiry.",
      "type": "procedural",
      "date": "1949-11-25",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Properties include 11 Watan lands at Kirtgeri in Taluk of Gadag, part of Watan assigned as remuneration to officiator of Patilki office under s. 23 of Bombay Hereditary Offices Act, 1874.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondent filed execution application Darkhast No. 41 of 1950 in Court of Subordinate Judge at Dharwar.",
      "type": "procedural",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Petitioner contended 11 lands governed by Act, assigned to Patil office, not partitionable; respondent made no claim to Patil office in original suit.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Petitioner relied on ss. 7, 10, 11, 13, 24, 25, 36 of Act; applied for certificate under s. 10; Collector issued certificate to Civil Judge, Senior Division, Dharwar.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Executing court cancelled execution process against Patilki-assigned property of Kirtgeri based on certificate.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Respondent challenged order before Bombay High Court; High Court upheld challenge following Rachapa v. Amingouda (1881 V BOM. 283), held certificate invalid as addressed to Civil Judge Dharwar not Privy Council; set aside cancellation, directed execution to proceed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Petitioner applied for reissue of certificate under s. 10 addressed to Supreme Court as successor to Privy Council; certificate issued January 13, 1958 by Assistant Commissioner, Gadag Division, stating property inalienable, not liable to civil court process, attachment to be removed, decree to be cancelled re said property.",
      "type": "procedural",
      "date": "1958-01-13",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Respondent appealed certificate to Deputy Commissioner, Dharwar; appeal failed, certificate confirmed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Petition under s. 10 of Act for cancellation of decree dated November 25, 1949 insofar as it operates on or includes right to Patilki office and 11 Watan lands at Kirtgeri.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the certificate under s. 10 of Bombay Hereditary Offices Act, 1874 addressed to Supreme Court is valid, given Bombay High Court decision and constitutional changes making Supreme Court successor to Privy Council.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Bombay High Court decision operates as res judicata against validity of present certificate.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether Supreme Court can cancel the decree under s. 10 regarding Watan properties assigned as remuneration to Patilki office.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "11 lands governed by Bombay Hereditary Offices Act, assigned as remuneration to Patil office, inalienable and not liable to partition; respondent made no claim to Patil office in original suit.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Bombay Hereditary Offices Act, 1874 ss. 7, 10, 11, 13, 24, 25, 36"
    },
    {
      "id": "pa2",
      "text": "Certificate under s. 10 validly issued and addressed to Supreme Court as successor to Privy Council.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "Abolition of Privy Council Jurisdiction Act, 1949; Constitution Arts. 374, 135"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Bombay High Court decision operates as res judicata; certificate invalid as not addressed to Privy Council.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Rachapa v. Amingouda (1881 V BOM. 283)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Bombay High Court decision does not create res judicata; it held certificate must be to court that passed decree, and Supreme Court is in effect and substance that court due to succession.",
      "addresses_issue": "i2",
      "key_observation": "No substance in res judicata argument."
    },
    {
      "id": "cr2",
      "text": "Supreme Court is successor: Abolition of Privy Council Jurisdiction Act, 1949 ss. 2,4,5,8 made Privy Council orders effective as Federal Court orders; Constitution Art. 374(2) made Federal Court orders effective as Supreme Court orders; Art. 135 confers jurisdiction on Supreme Court for such petitions.",
      "addresses_issue": "i1",
      "key_observation": "Certificate addressed to this Court is valid."
    },
    {
      "id": "cr3",
      "text": "Properties assigned as remuneration to Patilki office under s. 23, governed by Act; valid s. 10 certificate obliges court to cancel decree re those properties.",
      "addresses_issue": "i3",
      "key_observation": "Undisputed that properties are Watan remuneration."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Supreme Court is the court that passed the decree in effect; certificate valid.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No res judicata from Bombay High Court decision.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Decree cancelled insofar as it purports to operate on or include right to Patilki office and 11 Watan lands at Kirtgeri.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rachapa v. Amingouda",
      "citation": "1881 V BOM. 283",
      "treatment": "distinguished",
      "relevance": "Followed by Bombay High Court to hold prior certificate invalid; here held not applicable to new certificate addressed correctly."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Hereditary Offices Act, 1874",
      "sections": [
        "s. 2",
        "s. 7",
        "s. 10",
        "s. 11",
        "s. 13",
        "s. 23",
        "s. 24",
        "s. 25",
        "s. 36"
      ],
      "relevance": "Governs inalienability of Watan lands assigned as remuneration to Patilki office; s.10 mandates cancellation of decree on certificate."
    },
    {
      "name": "Abolition of Privy Council Jurisdiction Act, 1949",
      "sections": [
        "s. 2",
        "s. 4",
        "s. 5",
        "s. 8"
      ],
      "relevance": "Transfers Privy Council jurisdiction to Federal Court; makes Privy Council orders effective as Federal Court orders."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 374",
        "Art. 135"
      ],
      "relevance": "Art. 374(2) transfers Federal Court proceedings to Supreme Court, makes prior orders effective as Supreme Court; Art. 135 confers jurisdiction on Supreme Court for such petitions."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Petition allowed; decree dated November 25, 1949 granted by Order-in-Council in Privy Council Appeal No. 11 of 1948 cancelled insofar as it purports to operate on or include any right to the office of Patilki and 11 Watan lands attached thereto at Kirtgeri as per certificate.",
    "relief_granted": "Cancellation of decree regarding Patilki office and 11 Watan lands.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"We are not impressed by this argument. What the Bombay High Court has held is that the certificate must be issued to the court which passed the decree, and if in law this Court can be said to be in effect and in substance the Court that passed the decree then the Certificate must be held to be perfectly valid.\"",
      "speaker": "court",
      "significance": "Rejects res judicata; affirms certificate validity."
    },
    {
      "text": "\"Section 10 provides, inter alia, that ... the court shall, on receipt of a certificate under the hand and seal of the Collector ... cancel the decree or order complained of so far as it concerns the said watan or any part thereof.\"",
      "speaker": "court",
      "significance": "Explains mandatory effect of valid s.10 certificate."
    },
    {
      "text": "\"In the result the petition is allowed and the decree in question in so far as it purports to operate on or include any right to the office of Patilki and watan lands attached thereto at Kirtgeri as enumerated in the certificate is cancelled.\"",
      "speaker": "court",
      "significance": "Final operative order."
    }
  ],
  "_case_id": "1960_223",
  "_label": 1,
  "_text_length": 12509,
  "_extracted_at": "2026-02-10T19:54:41.849001"
}