{
  "metadata": {
    "case_name": "S. Zoraster Co., Jaipur v. Commissioner of Income-tax",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": "Civil Appeal No. 30 of 1958",
    "date_of_judgment": "1960-08-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee, Messrs. S. Zoraster Co., Jaipur, consists of three partners. Two of them are coparceners of a joint Hindu family, and the third is a stranger.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "They formed this partnership in June, 1940, for the manufacture and sale of blankets, felts and other woollen articles. A deed of partnership was executed on March 16, 1944.",
      "type": "background",
      "date": "1940-06-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The assessee entered into contracts with Government for the supply of goods.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In the assessment year 1942-43, Rs. 10,80,658-0-0 and in the assessment year 1943-44, Rs. 17,45,336-0-0 were assessed as its income by the Income-tax Officer, Contractors Circle, New Delhi.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The supplies to Government were made for Jaipur by the assessee, and payment was by cheques which were received at Jaipur and were endorsed in favour of the joint Hindu family, which acted as the assessee's bankers.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Contention of the assessee was that this income was received at Jaipur outside the then taxable territories.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "This contention was not accepted by the Income-tax Appellate Tribunal, Delhi.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The assessee then applied for a reference to the High Court under s. 66(1) of the Indian Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "By its order dated December 10, 1952, the Income-tax Appellate Tribunal referred the following question: Whether on the facts and circumstances of the case the profits and gains in respect of the sales made to the Government of India were received by the assessee in the taxable territories?",
      "type": "procedural",
      "date": "1952-12-10",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The Tribunal stated: The payment was made by the Government of India by cheques drawn on the Reserve Bank of India, Bombay Branch. These cheques were received in Jaipur.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "In the contract of sale between the assessee and the Government of India, the following clause was included: System of payment-Unless otherwise agreed between the Purchaser and the Contractor payment for the delivery of the stores will be made by the Chief Auditor, Indian Stores Department, New Delhi, by cheque on a Government treasury in India or on a branch of the Imperial Bank of India or the Reserve Bank of India transacting Government business.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The High Court passed an order under s. 66(4) observing it would be necessary for the Appellate Tribunal to find, inter alia, whether the cheques were sent to the assessee firm by post or by hand and what directions, if any, had the assessee firm given to the Department in the matter. The High Court remanded the case to the Tribunal for a supplemental statement of the case on the lines indicated.",
      "type": "procedural",
      "date": "1955-03-24",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appeal by special leave from the judgment and order dated March 24, 1955, of the Punjab High Court in Civil Reference No. 3 of 1953.",
      "type": "procedural",
      "date": "1955-03-24",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court had jurisdiction in this case to call for the supplemental statement under s. 66(4) of the Indian Income-tax Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether on the facts and circumstances of the case the profits and gains in respect of the sales made to the Government of India were received by the assessee in the taxable territories?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court exceeded its jurisdiction under s. 66(4) in calling for a supplemental statement, on the authority of the decision of this Court in The New Jehangir Vakil Mills Ltd. v. The Commissioner of Income-tax.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": "New Jehangir Vakil Mills Ltd. v. Commissioner of Income-tax (1960) 1 S.C.R. 249"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The High Court had jurisdiction under s. 66(4) to direct the Tribunal to state further facts so that it may properly exercise its advisory jurisdiction.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "s. 66(4) of the Indian Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The special leave granted by this Court is limited to the question whether the High Court had jurisdiction in this case to call for the supplemental statement.",
      "addresses_issue": "i1",
      "key_observation": "The advisory jurisdiction under s. 66(4) is confined to the facts on the record and/or found by the Tribunal and the question which would arise from the Tribunal's order."
    },
    {
      "id": "cr2",
      "text": "In New Jehangir Vakil Mills case, the High Court exceeded jurisdiction by raising a new question of law not arising out of the Tribunal's order and directing investigation of new facts.",
      "addresses_issue": "i1",
      "key_observation": "s. 66(4) does not enable the High Court to raise a new question of law which does not arise out of the Tribunal's order and direct the Tribunal to investigate new or further facts."
    },
    {
      "id": "cr3",
      "text": "The question referred in this case is wide: 'Whether on the facts and circumstances of the case the profits and gains in respect of the sales made to the Government of India were received by the assessee in taxable territories?' Unlike the narrow question in Jehangir Vakil Mills.",
      "addresses_issue": "i1",
      "key_observation": "The question is wide enough to include enquiry into whether there was any request, express or implied, to send cheques by post, per Ogale Glass Works and Jagdish Mills."
    },
    {
      "id": "cr4",
      "text": "The High Court's direction to find whether cheques were sent by post or hand and directions given does not inevitably lead to fresh evidence if confined to facts admitted or found by Tribunal.",
      "addresses_issue": "i1",
      "key_observation": "The first limit (facts on record) is not exceeded; second limit (question arising from Tribunal's order) also satisfied as question is wide."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The High Court did not exceed its jurisdiction under s. 66(4); the question referred was wide enough and direction can be confined to the record.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "New Jehangir Vakil Mills Ltd. v. Commissioner of Income-tax",
      "citation": "1960 1 S.C.R. 249",
      "treatment": "followed",
      "relevance": "High Court exceeds jurisdiction if calling supplemental statement on new question or new facts not from Tribunal's order."
    },
    {
      "case_name": "Jagdish Mills Ltd. v. Commissioner of Income-tax",
      "citation": "1960 1 S.C.R. 236",
      "treatment": "followed",
      "relevance": "Endorsement on bills for payment by cheque constitutes implied request; post office agent of payee."
    },
    {
      "case_name": "Keshav Mills Co., Ltd. v. Commissioner of Income-tax",
      "citation": "1950 18 I.T.R. 407",
      "treatment": "referred",
      "relevance": "Cheque given to bank for collection; receipt at place of bank's situation."
    },
    {
      "case_name": "Sir Sobha Singh v. Commissioner of Income-tax",
      "citation": "1950 18 I.T.R. 998",
      "treatment": "referred",
      "relevance": "Cheques given to bank for collection; receipt where bank on which drawn is situated."
    },
    {
      "case_name": "Kirloskar Bros. Ltd. v. Commissioner of Income-tax",
      "citation": "1952 21 I.T.R. 82",
      "treatment": "reversed",
      "relevance": "Mere posting of cheque not receipt unless express request; reversed by SC."
    },
    {
      "case_name": "Ogale Glass Works Ltd. v. Commissioner of Income-tax",
      "citation": "1955 1 S.C.R. 185",
      "treatment": "followed",
      "relevance": "Intimation to remit by cheque constitutes post office as agent; receipt where posted."
    },
    {
      "case_name": "Commissioner of Income-tax v. Ogale Glass Works Ltd.",
      "citation": "1954 25 I.T.R. 547",
      "treatment": "followed",
      "relevance": "Reversal of Bombay HC; request for payment by cheque sent by post makes post office agent."
    },
    {
      "case_name": "Commissioner of Income-tax v. Kirloskar Bros. Ltd.",
      "citation": "1954 25 I.T.R. 547",
      "treatment": "followed",
      "relevance": "Reversal of Bombay HC on similar grounds."
    },
    {
      "case_name": "Kusumben D. Mahadevia v. Commissioner of Income-tax Bombay",
      "citation": "1960 3 S.C.R. 417",
      "treatment": "followed",
      "relevance": "High Court cannot decide different question not arising from Tribunal's order."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "66(1)",
        "66(4)",
        "4(1)(a)"
      ],
      "relevance": "Jurisdiction of High Court to call for reference and supplemental statement; place of receipt of income."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court held that the Punjab High Court did not exceed its jurisdiction under s. 66(4) in directing the Tribunal to submit a supplemental statement, as the referred question was wide enough and the direction could be confined to facts on record. The appeal was dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "s. 66(4) does not enable the High Court to raise a new question of law which does not arise out of the Tribunals order and direct the Tribunal to investigate new or further facts necessary to determine this new question.",
      "speaker": "court",
      "significance": "Defines limits of High Court's jurisdiction under s. 66(4)"
    },
    {
      "text": "The question is wide enough to include the alternative line of approach that if there was a request, express or implied, to send the amount due under the bills by cheque, the post office would be the agent of the assessee.",
      "speaker": "court",
      "significance": "Distinguishes this case from Jehangir Vakil Mills due to width of question."
    },
    {
      "text": "It would have been better if the High Court had given directions confined to the record of the case before the Tribunal but, in the absence of anything expressly to the contrary, we cannot hold that the direction would lead inevitably to the admitting of fresh evidence.",
      "speaker": "court",
      "significance": "Interprets High Court's order as within jurisdiction."
    }
  ],
  "_case_id": "1960_309",
  "_label": 0,
  "_text_length": 19273,
  "_extracted_at": "2026-02-10T19:55:55.003215"
}