{
  "metadata": {
    "case_name": "Kundan Sugar Mills v. Zia Uddin and others",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Civil Appeal No. 136 of 1958",
    "date_of_judgment": "1960-02-09"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Kundan Sugar Mills is a partnership concern owning a sugar mill at Amroha.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondents 1 to 4 (Zia Uddin, Raisuddin, Shafiquddin and Ahmed Bux) were employed by appellant as seasonal masons in 1946.",
      "type": "admitted",
      "date": "1946",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1951, partners of appellant-Mills purchased building, machinery and equipment of another sugar mill at Kiccha, district Nainital, closed it and started Pannijee Sugar General Mills at Bulandshahr.",
      "type": "background",
      "date": "1951",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On January 19, 1955, General Manager of appellant-Mills ordered transfer of respondents 1 to 4 to new mill at Bulandshahr.",
      "type": "material",
      "date": "1955-01-19",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondents 1 to 4 through representative (respondent No. 5) protested transfer to General Manager.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "General Manager by letter dated January 22/24, 1955, insisted on joining new mill.",
      "type": "material",
      "date": "1955-01-22",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Respondents 1 to 4 did not join new mill.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On January 28, 1955, General Manager served notice on respondents 1 to 4 for disobeying orders, committing misconduct under Standing Order No. LI a, asking for explanation.",
      "type": "procedural",
      "date": "1955-01-28",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Labour Union (respondent No. 5) by letter dated January 31, 1955, denied charges.",
      "type": "procedural",
      "date": "1955-01-31",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "On February 2, 1955, General Manager dismissed respondents 1 to 4 for disobeying transfer order, guilty of misconduct under Standing Order No. LI a.",
      "type": "material",
      "date": "1955-02-02",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Labour Union raised industrial dispute; U.P. Government by notification dated November 7, 1955, referred issue to State Industrial Tribunal, Allahabad: Whether employers wrongfully terminated services of workers for refusing transfer to Pannijee Sugar Mills, Bulandshahr; if so, relief.",
      "type": "procedural",
      "date": "1955-11-07",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "State Industrial Tribunal by award dated February 6, 1956, held management within rights, dismissal proper as workers disobeyed order.",
      "type": "procedural",
      "date": "1956-02-06",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Respondents through Union appealed to Labour Appellate Tribunal; Tribunal held management had no right to transfer, dismissal illegal, directed reinstatement.",
      "type": "procedural",
      "date": "1956-04-30",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Two mills owned by same partners but separate concerns: different amenities (house-rent, fuel, light, travelling at Amroha; none at Bulandshahr), different awards (Kaul at Amroha), different bonuses (Amroha higher), separate accounts.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "No express term in contract for service in future concerns acquired or started by employer.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "General Manager (E.W.1) evidence: Interim bonus Bulandshahr Rs. 11,000 (Nov 1955), Amroha nearly 1.5 lakhs; last year bonus Amroha ~11 months wages, Bulandshahr 4-5 days.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the right to transfer an employee by an employer from one of his concerns to another is implicit in every contract of service.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Labour Appellate Tribunal had jurisdiction to set aside the finding of the State Industrial Tribunal that both mills formed one unit, under s. 7(1) of the Industrial Disputes Appellate Tribunal Act, 1950.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The right to transfer an employee from one concern to another is implicit in every contract of service.",
      "supporting_facts": [
        "f1",
        "f3",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "State Industrial Tribunal held both concerns one unit; Appellate Tribunal had no jurisdiction to set aside under s. 7(1) Industrial Disputes Appellate Tribunal Act, 1950.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "s. 7(1) Industrial Disputes Appellate Tribunal Act, 1950"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Management had no right to transfer to new factory; dismissal illegal.",
      "supporting_facts": [
        "f5",
        "f9",
        "f14",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Two mills are distinct entities: different places, separate accounts, different service conditions, amenities, bonuses; only common ownership.",
      "addresses_issue": "i1",
      "key_observation": "Mills treated as two different entities."
    },
    {
      "id": "cr2",
      "text": "No express term allowing transfer to future concerns; cannot imply such term as at employment time (1946) only Amroha mill existed, no contemplation of new factories; implying would make new contract.",
      "addresses_issue": "i1",
      "key_observation": "Rights governed by contract terms express or necessarily implied; no such implication here."
    },
    {
      "id": "cr3",
      "text": "Distinguished precedents: All involved single unit/concern with transfers within; not to new independent concern started later.",
      "addresses_issue": "i1",
      "key_observation": "No precedent supports inherent right to transfer to subsequent new concern."
    },
    {
      "id": "cr4",
      "text": "Government Order Rule I requires re-employment in same factory for seasonal workers who worked previous season, but does not prevent transfer if right exists under contract; here no such right.",
      "addresses_issue": "i1",
      "key_observation": "Order not relevant as no contractual right."
    },
    {
      "id": "cr5",
      "text": "Question of transfer right is substantial question of law under s.7(1); Appellate Tribunal had jurisdiction.",
      "addresses_issue": "i2",
      "key_observation": "Involves important principle on employer transfer rights."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No condition of service, express or implied, giving employer right to transfer employees to new concern started subsequent to employment.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Substantial question of law arose; Labour Appellate Tribunal had jurisdiction under s.7(1) Industrial Disputes Appellate Tribunal Act, 1950 to set aside finding.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Alexandre Bouzourou v. The Ottoman Bank",
      "citation": "A.I.R. 1930 P.C. 118",
      "treatment": "distinguished",
      "relevance": "Transfer within branches of single bank unit, ordinary incident of service; unlike here distinct concerns."
    },
    {
      "case_name": "Mary Anamalai Plantation Workers Union v. Seliparai estate",
      "citation": "1956 I.L.L.J. 343",
      "treatment": "distinguished",
      "relevance": "Transfers between factory/field in single plantation per common practice; implied condition."
    },
    {
      "case_name": "Bata Shoe Company, Ltd. v. Ali Hasan Industrial Tribunal, Patna Ors.",
      "citation": "1956 1 L.L.J. 278",
      "treatment": "distinguished",
      "relevance": "Transfer within same concern from one post to another not alteration of conditions."
    },
    {
      "case_name": "S. N. Mukherjee v. Kemp Co. Ltd.",
      "citation": "1954 L.A.C. 903",
      "treatment": "distinguished",
      "relevance": "Implicit transfer within branches of single business unit unless express contrary."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Appellate Tribunal Act, 1950",
      "sections": [
        "s. 7(1)"
      ],
      "relevance": "Jurisdiction to set aside findings involving substantial question of law."
    },
    {
      "name": "U.P. Government Order No. 6122/ST/XXXVI-A-640/S-T-1953",
      "sections": [
        "Rule I"
      ],
      "relevance": "Requires re-employment of seasonal workers in same factory; does not confer or bar transfer rights under contract."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by management against Labour Appellate Tribunal's order setting aside dismissal and directing reinstatement dismissed; held no right to transfer workers to new concern, Appellate Tribunal had jurisdiction.",
    "relief_granted": "Reinstatement of workers upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The argument of the learned counsel for the appellant that the right to transfer is implicit in every contract of service is too wide of the mark.\"",
      "speaker": "court",
      "significance": "Rejects broad contention on implied transfer right."
    },
    {
      "text": "\"We, therefore, hold that it was not a condition of service of employment of the respondents either express or implied that the employer has the right to transfer them to a new concern started by him subsequent to the date of their employment.\"",
      "speaker": "court",
      "significance": "Core holding on no transfer right."
    },
    {
      "text": "\"The only connection between the two is in the identity of ownership and, but for it, one has nothing to do with the other.\"",
      "speaker": "court",
      "significance": "Emphasizes mills as separate entities."
    }
  ],
  "_case_id": "1960_79",
  "_label": 0,
  "_text_length": 15780,
  "_extracted_at": "2026-02-10T19:52:31.742211"
}