{
  "metadata": {
    "case_name": "Godavari Sugar Mills Ltd. v. Respondent (Stenographer)",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 425 of 1958",
    "date_of_judgment": "1960-03-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent was a stenographer employed by the appellant, Godavari Sugar Mills Ltd., at its head office in Bombay, working for some years on a salary of Rs. 135 plus Rs. 27 as dearness allowance.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent was charged with acts of disobedience and insubordination; after proper enquiry where he was given opportunity to defend himself, found guilty, and dismissed on April 22, 1955.",
      "type": "material",
      "date": "1955-04-22",
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "Respondent challenged dismissal by application before Labour Court at Bombay under s.42(4) read with s.78(1)(a)(i) and (iii) of Bombay Industrial Relations Act, 1946.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Appellant challenged competence of application, contending Act and Notification No.1131-46 did not apply to respondent's case or head office, hence Labour Court had no jurisdiction.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "Parties agreed to try jurisdiction as preliminary issue; Labour Court upheld objection, held notification did not apply to head office, dismissed application.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Respondent appealed to Industrial Court; appeal failed as Industrial Court agreed with Labour Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Respondent appealed to Labour Appellate Tribunal; Tribunal held notification applied to head office, set aside orders below, remanded to Labour Court for merits.",
      "type": "procedural",
      "date": "1956-10-09",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appeal by special leave to Supreme Court from Labour Appellate Tribunal's decision dated October 9, 1956 in Appeal Bom. No. 111 of 1956.",
      "type": "procedural",
      "date": "1956-10-09",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Notification No.1131-46 issued by Government of Bombay on October 4, 1952 under s.2(4) of Act, applying Act to manufacture of sugar and its by-products including (1) growing of sugarcane on farms belonging to or attached to concerns engaged in said manufacture, and (2) all agricultural and industrial operations connected with growing of sugarcane or said manufacture, engaged in such concerns. Note: all service or employment connected with conduct of above industry deemed part of industry when engaged in or by employer engaged in that industry.",
      "type": "background",
      "date": "1952-10-04",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Factories and offices at Lakshmiwadi and Sakharwadi, separated by hundreds of miles from head office at Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Head office has accounts department, establishment section, stores purchase section, legal department; machinery purchased for industry landed at Bombay, received by head office, sent to factories.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Registrar under s.11 of Act consistently refused to recognise staff of head office as coming under notification.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Notification No.1131-46 issued by Government of Bombay on October 4, 1952 under s.2(4) of Bombay Industrial Relations Act, 1946 applies to the head office of the appellant at Bombay.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Notification does not apply to head office at Bombay; Act does not apply to respondent's case, Labour Court lacked jurisdiction.",
      "supporting_facts": [
        "f4",
        "f9"
      ],
      "legal_basis": "s.2(4) of Bombay Industrial Relations Act, 1946"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Notification applies to head office; head office has accounts department, establishment section, stores purchase section, legal department; machinery received at head office and forwarded to factories.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Note to Notification deeming services connected with conduct of industry as part of industry"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Notification applies not to 'sugar industry' as such but specifically to 'manufacture of sugar and its by-products'; deliberate phraseology limits scope; cls.(1) and (2) extend to sugarcane growing and operations not covered otherwise.",
      "addresses_issue": "i1",
      "key_observation": "If 'sugar industry' used, broader via s.2(19); but specific words limit; cls.(1)(2) not superfluous."
    },
    {
      "id": "cr2",
      "text": "Note deems services connected with conduct of industry as part thereof when engaged in that industry; connection must be established; head office stenographer not covered; machinery handling at head office does not bring head office within scope.",
      "addresses_issue": "i1",
      "key_observation": "Object confines to services connected with manufacture including subsidiary like manure depot, but not head office."
    },
    {
      "id": "cr3",
      "text": "Consistent practice by registrar refusing recognition of head office staff consistent with construction.",
      "addresses_issue": "i1",
      "key_observation": "Practice supports but not determinative."
    },
    {
      "id": "cr4",
      "text": "No need to consider textile industry notifications or decisions.",
      "addresses_issue": "i1",
      "key_observation": "Not useful."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Notification does not apply to head office of appellant at Bombay; Labour Appellate Tribunal erred in holding otherwise.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bombay Industrial Relations Act, 1946 (Bom. 11 of 1947)",
      "sections": [
        "s.2(4)",
        "s.42(4)",
        "s.78(1)(a)(i)",
        "s.78(1)(a)(iii)",
        "s.2(19)",
        "s.11"
      ],
      "relevance": "Notification under s.2(4) applies provisions including challenge to dismissal under s.42(4) r/w s.78(1)(a); defines industry broadly but notification limits to manufacture of sugar etc."
    },
    {
      "name": "Industrial Disputes Act, 1947 (Central Act XIV of 1947)",
      "sections": [
        "s.10"
      ],
      "relevance": "Contrasted; under Central Act, dismissal dispute needs union sponsorship or group, referred under s.10; Bombay Act allows direct application."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; order of Labour Appellate Tribunal set aside; respondent's application to Labour Court dismissed as incompetent due to notification not applying to head office.",
    "relief_granted": "Dismissal of respondent's application upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "This appeal by special leave raises a short question about the construction of the Notification No.1131-46 issued by the Government of Bombay on October, 4, 1952, under s.2(4) of the Bombay Industrial Relations Act, 1946.",
      "speaker": "court",
      "significance": "Frames the sole issue"
    },
    {
      "text": "It is significant that the notification applies not to sugar industry as such but to the manufacture of sugar and its by-products.",
      "speaker": "court",
      "significance": "Key to narrow construction limiting scope"
    },
    {
      "text": "We must accordingly hold that the Labour Appellate Tribunal erred in law in holding that the case of the respondent was governed by the notification.",
      "speaker": "court",
      "significance": "Core holding"
    }
  ],
  "_case_id": "1960_188",
  "_label": 1,
  "_text_length": 11592,
  "_extracted_at": "2026-02-10T19:53:59.732169"
}