{
  "metadata": {
    "case_name": "Provat Kumar Mitter v. Commissioner of Income-tax",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das, J."
    ],
    "case_number": "Civil Appeal No. 366 of 1959",
    "date_of_judgment": "1960-12-08"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee, Provat Kumar Mitter, is the registered holder of 500 Ordinary shares of the Calcutta Agency Ltd.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By a written instrument dated January 19, 1953, the assessee assigned to his wife, Ena Mitter, the right, title and interest to all dividends and sums of money which might be declared or become due on account of or in respect of those shares for the term of her natural life.",
      "type": "material",
      "date": "1953-01-19",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The material portion of the instrument states: 'This Deed Witnesseth that for effecting the said desire and in consideration of the natural love and affection of the Settlor for the Beneficiary the Settlor as the beneficial owner assigns unto the Beneficiary the right, title and interest to every dividend and sum of money which may be declared or become due and payable on account of or in respect of the said shares... To Hold the same unto the Beneficiary absolutely during the term of her natural life.'",
      "type": "material",
      "date": "1953-01-19",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Under the terms, the shares themselves remained the property of the assessee, and it was only the income arising therefrom which was sought to be settled or assigned to his wife.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "During the accounting year which ended on March 31, 1953, the dividend declared on the shares amounted to Rs. 12,000.",
      "type": "material",
      "date": "1953-03-31",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In assessing the assessee for the assessment year 1953-54, the Income-tax Officer included the said sum of Rs. 12,000 in his income under s. 16(1)(c) and s. 16(3) of the Indian Income-tax Act, 1922.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The assessee appealed to the Appellate Assistant Commissioner, contending that the third proviso to s. 16(1)(c) applied and s. 16(3) did not apply as there was no transfer of shares.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The Department contended before AAC that the third proviso to s. 16(1)(c) should be ignored as repugnant, and that the transfer was only an application of income.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "AAC accepted Department's contentions and dismissed the appeal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "In appeal to Income-tax Appellate Tribunal, assessee relied on third proviso to s. 16(1)(c); Department urged same contentions plus that the deed was invalid as unregistered.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Tribunal rejected repugnancy contention, did not opine on application of income, but held deed invalid as unregistered.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Tribunal referred three questions to High Court: (1) Whether deed void for non-registration? (2) Whether third proviso repugnant? (3) Whether payment to wife was application of assessee's income?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court answered first two in favour of assessee, third against assessee, holding it was application of income.",
      "type": "procedural",
      "date": "1958-09-18",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appeal to Supreme Court on certificate under s. 66A(2) limited to third question.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the deed dated January 19, 1953, assigning the dividends to accrue, merely on account of natural love and affection, is void as it is not registered?",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Whether the third proviso to section 16(1)(c) is repugnant to the main clause 16(1)(c) and the general scheme of the Act, and should not be given effect to?",
      "framed_by": "lower_court"
    },
    {
      "id": "i3",
      "text": "Whether, on the facts and in the circumstances of the case, the payment of dividend income to the assessee's wife, Ena Mitter, under the covenant in the deed of assignment dated January 19, 1953, was merely a case of application of the assessee's income?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Third proviso to s. 16(1)(c) applies since settlement for lifetime of wife; s. 16(3) does not apply as no transfer of shares.",
      "supporting_facts": [
        "f2",
        "f3",
        "f7"
      ],
      "legal_basis": "s. 16(1)(c) third proviso, Indian Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "The third question did not arise out of Tribunal's order.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "s. 66, Indian Income-tax Act, 1922"
    },
    {
      "id": "pa3",
      "text": "The instrument assigned a present right of property in dividends (right to participate in profits), not mere contract to pay in future.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Bacha F. Guzdar v. CIT"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Third proviso to s. 16(1)(c) repugnant to main provision and scheme of Act.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s. 16(1)(c), Indian Income-tax Act, 1922"
    },
    {
      "id": "ra2",
      "text": "Transfer of dividend was only application of income after accrual, as shares stood in assessee's name.",
      "supporting_facts": [
        "f1",
        "f5",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Deed invalid as unregistered.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The instrument was not a transfer of existing property but a contract to transfer future dividends; shares retained by assessee, so right to profits not parted with.",
      "addresses_issue": "i3",
      "key_observation": "Beneficiary given right to receive from assessee dividends which accrue to him first."
    },
    {
      "id": "cr2",
      "text": "Company pays dividend only to registered shareholder; income accrues to assessee then applied to wife per contract.",
      "addresses_issue": "i3",
      "key_observation": "s. 16(1)(c) not attracted, nor third proviso; income assessable in assessee's hands."
    },
    {
      "id": "cr3",
      "text": "Third question arose out of Tribunal's order as raised by Department and decided implicitly against it; no objection in High Court.",
      "addresses_issue": "i3",
      "key_observation": "Appellant cannot now contend it did not arise."
    },
    {
      "id": "cr4",
      "text": "Principle of diversion before accrual (Bejoy Singh Dudhuria) not applicable; this is application after accrual.",
      "addresses_issue": "i3",
      "key_observation": "If source alienated, no tax post-assignment apart from deeming provisions; here mere application."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The payment of dividend to wife was application of assessee's income after accrual, assessable in his hands; High Court correctly answered third question.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bacha F. Guzdar v. Commissioner of Income-tax, Bombay",
      "citation": "1955 1 S.C.R. 876",
      "treatment": "referred",
      "relevance": "Right to participate in profits exists independently of declaration; not assistance here as question is construction of instrument."
    },
    {
      "case_name": "Howrah Trading Co. Ltd. v. Commissioner of Income-tax, Central, Calcutta",
      "citation": "1959 Supp. 2 S.C.R. 448",
      "treatment": "followed",
      "relevance": "Company pays dividend only to registered shareholder or under his orders."
    },
    {
      "case_name": "Bejoy Singh Dudhuria v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Principle of allocation/diversion before accrual does not apply; here application after accrual."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 66A(2)",
        "s. 16(1)(c)",
        "s. 16(3)",
        "s. 66",
        "s. 2(1)",
        "s. 4(3)(viii)"
      ],
      "relevance": "Inclusion of wife's dividend income in assessee's total income; third proviso not applicable as outside main clause; questions of repugnancy and arising from Tribunal order."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the High Court's answer to the third question that the dividend payment to the wife was an application of the assessee's income after it accrued to him, and thus assessable in his hands.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the income continued to accrue to the assessee but was thereafter paid over to his wife under the terms of the contract. The income was, therefore, assessable in the hands of the assessee, because it was part of his income though applied subsequently towards payment to the wife under the terms of the contract.\"",
      "speaker": "court",
      "significance": "Core holding on application of income vs diversion."
    },
    {
      "text": "\"if the assessee merely applies the income so that it passes through him and goes on to an ultimate purpose, even though he may have entered into a legal obligation to apply it in that way, it remains his income.\"",
      "speaker": "court",
      "significance": "Distinguishes alienation of source from mere application."
    }
  ],
  "_case_id": "1960_69",
  "_label": 0,
  "_text_length": 14479,
  "_extracted_at": "2026-02-10T19:52:32.358875"
}