{
  "metadata": {
    "case_name": "State of Rajasthan v. Thakur Pratap Singh",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Rajagopala Ayyangar, J."
    ],
    "case_number": "Civil Appeal No. 231 of 1956",
    "date_of_judgment": "1960-08-18"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The inhabitants of certain villages in the district of Jhunjhunu in the State of Rajasthan, harboured dacoits and receivers of stolen property, and were besides creating trouble between landlords and tenants as a result of which there were serious riots in the locality in the course of which some persons lost their lives.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The State Government took action under s. 15 of the Police Act, 1861 by proclamation notified in the official Gazette declaring that the 24 villages included in the schedule were in a disturbed and dangerous state for a period of six months.",
      "type": "procedural",
      "date": null,
      "source": "state"
    },
    {
      "id": "f3",
      "text": "Under sub-section 2 of section 15, the Rajpramukh authorised the Inspector-General of Police to employ additional police force at the cost of the inhabitants of the said area.",
      "type": "procedural",
      "date": null,
      "source": "state"
    },
    {
      "id": "f4",
      "text": "Under sub-section 5 of section 15, the Rajpramukh exempted the Harijan and Muslim inhabitants of these villages from liability to bear any portion of the cost on account of the posting of the additional Police force.",
      "type": "procedural",
      "date": null,
      "source": "state"
    },
    {
      "id": "f5",
      "text": "The respondent-Thakur Pratap Singh being an inhabitant of Baragaon-one of these 24 villages, moved the High Court of Rajasthan for the issue of a writ or direction under Art. 226 of the Constitution impugning the validity of s. 15 of the Police Act and in particular of sub-s. 5 thereof and of the notification.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "High Court by judgment and order dated September 11, 1953, repelled contentions regarding invalidity of s. 15 generally but held that Para 4 of the notification exempting Harijan and Muslim inhabitants was violative of Art. 15(1) and struck it down as unconstitutional.",
      "type": "procedural",
      "date": "1953-09-11",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The State of Rajasthan applied to the High Court for a certificate under Art. 132(1) which was granted, leading to this appeal.",
      "type": "procedural",
      "date": null,
      "source": "state"
    },
    {
      "id": "f8",
      "text": "In para 5 of the petition filed before the High Court, the respondent averred that the Notification is ultra vires as it discriminates amongst Citizens on basis of religion, race or caste, contravening Art. 15.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The State's answer was that Harijan and Muslim inhabitants were exempted not because of religion, race or caste but because they were found to be peace-loving and law-abiding citizens.",
      "type": "disputed",
      "date": null,
      "source": "state"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Para 4 of the notification exempting Harijan and Muslim inhabitants from liability to bear the cost of additional police force under s.15(5) of Police Act, 1861 is violative of Art. 15(1) of the Constitution.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The exemption of the Harijan Muslim inhabitants was not based only on the ground of caste or religion but on the ground that persons belonging to these two communities were found by the State not to have been guilty of the conduct which necessitated the stationing of the additional police force.",
      "supporting_facts": [
        "f1",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The aforesaid Notification is ultra vires of the Constitution as it discriminates amongst the Citizens of a village on the basis of religion, race or caste, in as much as it makes a distinction between persons professing the Mohammadan religion and others and also between persons who are Muslims and Harijans by caste and the rest. It contravenes Art. 15.",
      "supporting_facts": [
        "f4",
        "f8"
      ],
      "legal_basis": "Article 15"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The argument that only persons of a certain community or caste were law-abiding citizens while members of other communities were not is a very strange argument. Disturbing elements may be found among members of any community or religion just as much as there may be saner elements among members of that community or religion.",
      "addresses_issue": "i1",
      "key_observation": "Rejects State's argument as per High Court observation which is correct."
    },
    {
      "id": "cr2",
      "text": "Even if the bulk of the members of the communities exempted or even all of them were law-abiding, it was not contended that there were no peaceful and law-abiding persons in these 24 villages belonging to the other communities.",
      "addresses_issue": "i1",
      "key_observation": "Notification discriminates against law-abiding members of other communities in favour of Muslim and Harijan communities on basis only of caste or religion."
    },
    {
      "id": "cr3",
      "text": "If there were other grounds they ought to have been stated in the notification. It is plain that the notification is directly contrary to the terms of Art. 15(1) and that para 4 has incurred condemnation as violating a specific constitutional prohibition.",
      "addresses_issue": "i1",
      "key_observation": "High Court was clearly right in striking down this paragraph."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Para 4 of the notification is violative of Art. 15(1) and unconstitutional.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Police Act, 1861",
      "sections": [
        "Section 15",
        "Section 15(1)",
        "Section 15(2)",
        "Section 15(5)"
      ],
      "relevance": "Invoked to quarter additional police in disturbed areas and exempt certain inhabitants from cost; sub-s.5 exemption challenged."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 15(1)",
        "Article 226",
        "Article 132(1)"
      ],
      "relevance": "Art.15(1) violated by discriminatory exemption; Art.226 for writ; Art.132(1) for certificate of appeal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by the State of Rajasthan against the Rajasthan High Court order striking down Para 4 of the notification as unconstitutional under Art.15(1) fails and is dismissed. The High Court's view is upheld.",
    "relief_granted": "High Court order upheld striking down Para 4 of notification.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Now this is a very strange argument that only persons of a certain community or caste were law-abiding citizens, while the members of other communities were not.\"",
      "speaker": "court",
      "significance": "Court endorses High Court's rejection of State's justification for exemption."
    },
    {
      "text": "The notification is directly contrary to the terms of Art. 15(1) and that para 4 of the notification has incurred condemnation as violating a specific constitutional prohibition.",
      "speaker": "court",
      "significance": "Core holding on unconstitutionality of the exemption."
    }
  ],
  "_case_id": "1960_36",
  "_label": 0,
  "_text_length": 8687,
  "_extracted_at": "2026-02-10T19:51:45.454541"
}