{
  "metadata": {
    "case_name": "State of Uttar Pradesh v. Hafiz Mohammad Ismail and Hafiz Jawed Ali",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Criminal Appeal Nos. 129-130 of 1957",
    "date_of_judgment": "1960-02-09"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Bhagwan Swarup Saxena, Trade Marks Investigator of Lever Brothers Ltd., investigated manufacture and sale of counterfeit Sunlight and Lifebuoy soaps in Yahiaganj and other places in Lucknow.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Two soap factories in Lucknow were manufacturing counterfeit Sunlight and Lifebuoy soaps.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Hafiz Mohammad Ismail and Hafiz Jawed Ali (respondents) were selling counterfeit soaps in their shops in Yahiaganj.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Raid conducted on respondents' shops on May 19, 1953, with police help; large number of soaps recovered wrapped in labels said to be counterfeits of genuine Sunlight and Lifebuoy soaps.",
      "type": "material",
      "date": "1953-05-19",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondents prosecuted under ss. 482 and 486 of Indian Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Magistrate found case proved, held labels counterfeit, convicted respondents under ss. 482 and 486 IPC.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Sessions Judge (Second Civil and Sessions Judge, Lucknow) dismissed respondents' appeals in Criminal Appeals Nos. 511 and 512 of 1954 on March 31, 1954.",
      "type": "procedural",
      "date": "1954-03-31",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Allahabad High Court (Lucknow Bench) in Criminal Revisions Nos. 118 and 119 of 1955, judgment dated July 13, 1956, held cases do not fall under s. 482 IPC, acquitted thereunder; held labels not counterfeit but colourable imitations, acquitted under s. 486 IPC without considering other points.",
      "type": "procedural",
      "date": "1956-07-13",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "State of Uttar Pradesh's application for certificate to appeal rejected by High Court; special leave granted by Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Magistrate and Sessions Judge examined wrappers/labels, compared with genuine, found resemblance close enough to deceive.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Supreme Court examined labels/wrappers, agreed with Magistrate and Sessions Judge that resemblance such that person may be deceived.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the labels/wrappers on soaps sold by respondents are 'counterfeit' trade marks within meaning of s. 28 and s. 486 IPC, or mere colourable imitations.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Application of Explanations 1 and 2 to s. 28 IPC to determine counterfeiting despite differences in detail.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in holding wrappers/labels only colourable imitations and not counterfeit; failed to apply s. 28 IPC and its Explanations fully.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": "Sections 28, 486 IPC"
    },
    {
      "id": "pa2",
      "text": "Counterfeiting under s. 28 requires resemblance likely to deceive, not exact imitation; presumption under Expl. 2 if resemblance might deceive; no proof to rebut.",
      "supporting_facts": [
        "f4",
        "f10"
      ],
      "legal_basis": "Section 28 IPC, Explanations 1 and 2"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Labels/wrappers are colourable imitations, not counterfeit; differences in detail prevent deception.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S. 28 defines counterfeit as causing one thing to resemble another intending/knowing deception likely; Expl. 1: imitation need not be exact; Expl. 2: presumption of intent/knowledge if resemblance might deceive, rebuttable.",
      "addresses_issue": "i1",
      "key_observation": "No need for 'colourable imitation'; focus on resemblance likely to deceive."
    },
    {
      "id": "cr2",
      "text": "High Court acknowledged resemblance (called colourable imitations) but overlooked Expl. 1; failed to assess if resemblance might deceive despite differences noticed by lower courts.",
      "addresses_issue": "i2",
      "key_observation": "Lower courts found resemblance deceptive; Supreme Court agrees upon examination."
    },
    {
      "id": "cr3",
      "text": "Expl. 2 applies; no contrary proved; thus intention/knowledge presumed; labels counterfeit.",
      "addresses_issue": "i1",
      "key_observation": "Conviction under s. 486 proper."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Labels/wrappers counterfeit under s. 28 IPC as resemblance such that person might be deceived; presumption under Expl. 2 applies, not rebutted.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Acquittal under s. 482 stands as not pressed.",
      "resolves_issue": null,
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "28",
        "482",
        "486"
      ],
      "relevance": "S. 28 defines 'counterfeit'; s. 486 punishes selling goods with counterfeit trade mark; s. 482 not pressed."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeals allowed on s. 486 IPC; acquittal set aside, respondents' labels held counterfeit, convictions restored subject to consideration of jurisdiction, limitation, and protections under cls. (a) and (b) not addressed by High Court.",
    "relief_granted": "Restoration of conviction under s. 486 IPC",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is not essential to counterfeiting that the imitation should be exact.\"",
      "speaker": "court",
      "significance": "Expl. 1 to s. 28 IPC; rejects High Court's emphasis on differences in detail."
    },
    {
      "text": "\"When a person causes one thing to resemble another thing, and the resemblance is such that a person might be deceived thereby, it shall be presumed...\"",
      "speaker": "court",
      "significance": "Expl. 2 to s. 28; applies presumption of intent/knowledge."
    },
    {
      "text": "\"We have looked at the labels and wrappers... and we agree... that the resemblance is such that a person may be deceived by it.\"",
      "speaker": "court",
      "significance": "Supreme Court's independent finding affirming lower courts."
    }
  ],
  "_case_id": "1960_7",
  "_label": 1,
  "_text_length": 11801,
  "_extracted_at": "2026-02-10T19:51:46.750419"
}