{
  "metadata": {
    "case_name": "Madhya Pradesh Mineral Industry Association v. Regional Labour Commissioner (Central), Nagpur and State of Madhya Pradesh",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a non-profit company limited by guarantee registered under s. 26 of the Indian Companies Act, 1913, formed to protect and promote interests of members engaged in mining industry.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "President of India issued Notification No. S.R.O. 2052 on December 11, 1951 under Art. 258 of Constitution, delegating functions of Central Government under Minimum Wages Act to Governments of certain States including Madhya Pradesh for fixation of minimum wages for employees in stone-breaking or stone-crushing operations in mines.",
      "type": "procedural",
      "date": "1951-12-11",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Madhya Pradesh Government issued notification on March 30, 1952 under s. 5(2) of Minimum Wages Act, 1948, prescribing minimum rates of wages for employment in stone-breaking or stone-crushing operations carried on in mines, inclusive of dearness allowance.",
      "type": "material",
      "date": "1952-03-30",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Regional Labour Commissioner (Central), Nagpur (Respondent 1) wrote to appellant on June 20, 1956, stating Madhya Pradesh (Respondent 2) considered Minimum Wages Act applicable to manganese mining industry and directing implementation within a fortnight.",
      "type": "procedural",
      "date": "1956-06-20",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant made representations to Respondent 1 urging Minimum Wages Act inapplicable to manganese mining industry.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Respondent 1 threatened large-scale prosecution of appellant's members for contravention of Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant filed writ petition in High Court of Bombay at Nagpur challenging validity of Madhya Pradesh notification under s. 5(2) as ultra vires, alleging no alternative remedy, and that President's notification under Art. 258 cannot apply to manganese mining.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Respondents contended Act applies to any industry involving stone-breaking or stone-crushing operations; manganese mining consists of development work, removal of overburden, breaking big mineral stones like boulder ore or bed ore, dressing ores to remove impurities.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "High Court dismissed appellant's petition but granted certificate of fitness under Art. 133(1)(c) of Constitution.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court assumed impugned notification added entry to Schedule and that vires not challenged before it.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Certificate of fitness states questions relate to applicability of Act to persons employed in stone-breaking or stone-crushing at manganese mines.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the impugned notification issued by Madhya Pradesh Government under s. 5(2) of Minimum Wages Act is ultra vires because stone-breaking or stone-crushing operations in manganese mines do not fall under item 8 in Part I of the Schedule.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether employment in stone-breaking or stone-crushing operations carried on in mines amounts to employment in stone-breaking or stone-crushing specified as item 8 in Part I of the Schedule.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether appellant can challenge vires of State notification without challenging President's delegation under Art. 258.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Impugned notification ultra vires s. 5(2) because stone-breaking and stone-crushing operations in manganese mines do not fall under any item in Part I of Schedule, particularly item 8.",
      "supporting_facts": [
        "f3",
        "f7"
      ],
      "legal_basis": "Minimum Wages Act, 1948 s. 5(2); Schedule Part I item 8"
    },
    {
      "id": "pa2",
      "text": "Notification by President under Art. 258 cannot fasten character of stone-breaking or stone-crushing on manganese mining industry.",
      "supporting_facts": [
        "f2",
        "f7"
      ],
      "legal_basis": "Constitution Art. 258"
    },
    {
      "id": "pa3",
      "text": "No alternative remedy equally speedy and efficacious.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Act applies to any industry wherein workers employed in operations involving stone-breaking or stone-crushing; manganese mining involves breaking big mineral stones, dressing ores.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Minimum Wages Act, 1948 Schedule Part I item 8"
    },
    {
      "id": "ra2",
      "text": "Word 'employment' and 'stone' should receive widest denotation to include operations in mines.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Shorter Oxford Dictionary"
    },
    {
      "id": "ra3",
      "text": "Appellant cannot challenge State notification without challenging President's delegation under Art. 258.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Constitution Art. 258"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court erred in assuming impugned notification added entry to Schedule and that vires not challenged; vires were challenged as per petition, certificate, and statement of case.",
      "addresses_issue": "i1",
      "key_observation": "High Court misdirected itself on two important points."
    },
    {
      "id": "cr2",
      "text": "s. 5(2) empowers fixation/revision of minimum wages only for scheduled employments; s. 27 separately empowers addition to Schedule; powers distinct.",
      "addresses_issue": "i1",
      "key_observation": "Impugned notification issued under s. 5(2), not s. 27."
    },
    {
      "id": "cr3",
      "text": "Item 8 'employment in stone-breaking or stone-crushing' refers to quarry operations, not incidental breaking/crushing in manganese mines; 'stone' in context excludes manganese ore.",
      "addresses_issue": "i2",
      "key_observation": "Context of Schedule and ordinary parlance limit scope; beneficent construction only if two reasonable meanings possible."
    },
    {
      "id": "cr4",
      "text": "Absence of 'any' in item 8 confines it to quarries, not mines; notification inconsistent with Schedule scheme as it covers only specific operations, not whole employment.",
      "addresses_issue": "i2",
      "key_observation": "If intended for mines, use s. 27 to add to Schedule."
    },
    {
      "id": "cr5",
      "text": "Appellant can challenge invalid State notification without challenging President's delegation; no agency in commission of wrong.",
      "addresses_issue": "i3",
      "key_observation": "Wrongdoer liable directly."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Stone-breaking or stone-crushing operations in manganese mines not included in item 8 Part I Schedule; impugned notification under s. 5(2) ultra vires and invalid.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Appellant entitled to writ prohibiting enforcement without challenging Presidential notification.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "A. Thangal Kunju Musaliar v. M. Venkitachalam Potti",
      "citation": null,
      "treatment": "followed",
      "relevance": "No agency in commission of wrong; wrongdoer liable directly even if acting under principal."
    }
  ],
  "statutes_cited": [
    {
      "name": "Minimum Wages Act, 1948",
      "sections": [
        "s. 2(b)",
        "s. 2(e)",
        "s. 2(g)",
        "s. 3",
        "s. 5(2)",
        "s. 27",
        "Schedule Part I item 8"
      ],
      "relevance": "Defines scheduled employment; s.5(2) for fixing wages in scheduled employments only; s.27 to add employments to Schedule; impugned notification ultra vires s.5(2)."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 258",
        "Art. 133(1)(c)",
        "Art. 226"
      ],
      "relevance": "Delegation by President; certificate for appeal; writ jurisdiction."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [
        "s. 26"
      ],
      "relevance": "Appellant's incorporation as non-profit company."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court held impugned notification of Madhya Pradesh Government under s.5(2) Minimum Wages Act ultra vires and invalid as stone-breaking/crushing in manganese mines not covered by Schedule item 8; reversed High Court judgment; prohibited enforcement against appellant's members.",
    "relief_granted": "Writ quashing impugned notification and prohibiting enforcement.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the impugned notification issued by the State Government under s. 5(2) is ultra vires.\"",
      "speaker": "court",
      "significance": "Core holding on invalidity of notification."
    },
    {
      "text": "\"what can be done by the appropriate government in exercise of its power under s. 27 cannot be done by it in exercise of its power under s. 5(2).\"",
      "speaker": "court",
      "significance": "Distinguishes powers under ss.5(2) and 27."
    },
    {
      "text": "\"when item 8 refers to stone-breaking or stone-crushing it is intended to cover the breaking or the crushing of stones incidental to the manganese mining operations.\"",
      "speaker": "court",
      "significance": "Rejects broad interpretation of item 8."
    }
  ],
  "_case_id": "1960_191",
  "_label": 1,
  "_text_length": 22402,
  "_extracted_at": "2026-02-10T19:54:39.487839"
}