{
  "metadata": {
    "case_name": "Manohar Lal v. State",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Ayyangar J."
    ],
    "case_number": "Criminal Appeal No. 173/1956",
    "date_of_judgment": "1960-11-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant-Manohar Lal has a shop at Ferozepore Cantt. in which business is carried on under the name and style of Imperial Book Depot.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Section 7(1) of the Punjab Trade Employees Act, 1940 enacts: 'Save as otherwise provided by this Act, every shop or commercial establishment shall remain closed on a close day.'",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant had chosen Friday as the close day, i.e., the day of the week on which his shop would remain closed.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Inspector of Shops and Commercial Establishments, Ferozepore Circle, visited the appellant's shop on Friday, the 29th of January, 1954, and found the shop open and the appellant's son selling articles.",
      "type": "material",
      "date": "1954-01-29",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Appellant was prosecuted in the Court of the Additional District Magistrate, Ferozepore, for an offence under s.16 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant admitted the facts but pleaded that the Act would not apply to his shop or establishment for the reason that he had engaged no strangers as employees but that the entire work in the shop was being done by himself and by the members of his family.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Additional District Magistrate rejected the plea regarding the constitutionality of s.7(1) in its application to shops where no employees were engaged and sentenced him to a fine of Rs. 100 and simple imprisonment in default of payment of the fine since the appellant had been convicted once before.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellant applied to the High Court of Punjab to revise this order in Criminal Revision No. 1058/1954, but the Revision was dismissed on May 23, 1956.",
      "type": "procedural",
      "date": "1956-05-23",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "High Court granted a certificate of fitness under Arts. 132 and 134 of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether s.7(1) of the Punjab Trade Employees Act, 1940 is unconstitutional as violative of the fundamental rights guaranteed by Arts. 14, 19(1)(f) and (g) of the Constitution, particularly Art.19(1)(g) read with Art.19(6), in its application to shops where no employees are engaged.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The provision violated the appellant's right to carry on his trade or business guaranteed by Art. 19(1)(g) and that the restriction imposed was not reasonable within Art. 19(6) because it was not in the interest of the general public.",
      "supporting_facts": [
        "f1",
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": "Art. 19(1)(g), Art. 19(6); Long title of the Act: 'An Act to limit the hours of work of Shop Assistants and Commercial Employees...'"
    },
    {
      "id": "pa2",
      "text": "Insistence on the appellant to close his shop, in which there were no employees, was really outside the purview of the legislation and could not be said to subserve the purposes for which the Act was enacted.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Long title of the Act"
    },
    {
      "id": "pa3",
      "text": "The provision for the compulsory closure of his shop for one day in the week served no interests of the general public and that it was unduly and unnecessarily restrictive of his freedom to carry on a lawful trade or business.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "Art. 19(1)(g), Art. 19(6)"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The long title indicates the main purposes of the enactment but cannot control the express operative provisions of the Act, such as s.7(1).",
      "addresses_issue": "i1",
      "key_observation": "Long title does not limit scope of s.7(1)."
    },
    {
      "id": "cr2",
      "text": "The ratio of the legislation is social interest in the health of the worker who forms an essential part of the community and in whose welfare, therefore, the community is vitally interested.",
      "addresses_issue": "i1",
      "key_observation": "Act concerned with welfare of workers, including preventing self-injury by overwork."
    },
    {
      "id": "cr3",
      "text": "Sections 3, 4, 4(1), 4(4), 4(5) of the Act are aimed at protecting health of young persons, limiting working hours, aligning with International Labour Convention, and preventing overwork even by workers themselves.",
      "addresses_issue": "i1",
      "key_observation": "Similar principles apply to employer working on his own business."
    },
    {
      "id": "cr4",
      "text": "The impugned section might be justified on the ground that it is designed in the interest of the owner of the shop or establishment himself and that his health and welfare is a matter of interest not only to himself but to the general public.",
      "addresses_issue": "i1",
      "key_observation": "Legislation exercises social control over manner of carrying business in interests of health and welfare of all engaged in it; saved by Art.19(6)."
    },
    {
      "id": "cr5",
      "text": "Constitutionality sustained on ground of avoiding evasion of provisions for protection of workmen; inclusion of reasonable margin ensures effective enforcement.",
      "addresses_issue": "i1",
      "key_observation": "Provisions justified for administrative convenience and proper enforcement without evasion."
    },
    {
      "id": "cr6",
      "text": "Reference to prior case: Legislature may have felt it necessary, in order to reduce possibilities of evasion, to encroach upon liberties of those who would not otherwise have been affected; to require a shopkeeper who employs one or two men to close while rival employing family remains open creates disadvantage.",
      "addresses_issue": "i1",
      "key_observation": "Prevents engendering discontent and affecting employer-employee relations."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S.7(1) of the Punjab Trade Employees Act, 1940 is constitutional and does not violate Art.19(1)(g) read with Art.19(6).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Manohar Lal v. The State",
      "citation": "1951 S.C.R. 671",
      "treatment": "referred",
      "relevance": "When appellant challenged validity of same provision on other grounds; legislature may encroach to reduce evasion, as distinction in closure could disadvantage employers and affect relations."
    }
  ],
  "statutes_cited": [
    {
      "name": "Punjab Trade Employees Act, 1940",
      "sections": [
        "7(1)",
        "7(2)(i)",
        "16",
        "3",
        "4",
        "4(1)",
        "4(4)",
        "4(5)"
      ],
      "relevance": "Impugned provision for weekly closure; offence and penalty; restrictions on employment of young persons, hours of work, prevention of overwork."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "14",
        "19(1)(f)",
        "19(1)(g)",
        "19(6)",
        "132",
        "134"
      ],
      "relevance": "Fundamental rights challenged; certificate for appeal; reasonable restrictions on trade/business in interest of general public."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal challenging the constitutionality of s.7(1) of the Punjab Trade Employees Act, 1940 was repelled, upholding the conviction and sentence by the trial court affirmed by the High Court.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The ratio of the legislation is social interest in the health of the worker who forms an essential part of the community and in whose welfare, therefore, the community is vitally interested.",
      "speaker": "court",
      "significance": "Core purpose justifying the Act's provisions including s.7(1)."
    },
    {
      "text": "A restriction imposed with a view to secure this purpose would, in our opinion, be clearly saved by Art. 19(6).",
      "speaker": "court",
      "significance": "Holds restriction reasonable in interest of general public."
    },
    {
      "text": "We have, therefore, no hesitation in repelling the attack on the constitutionality of s. 7(1) of the Act.",
      "speaker": "court",
      "significance": "Final rejection of constitutional challenge."
    }
  ],
  "_case_id": "1960_60",
  "_label": 0,
  "_text_length": 10130,
  "_extracted_at": "2026-02-10T19:52:22.135306"
}