{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Respondent Firm",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Civil Appeal No. 358 of 1958",
    "date_of_judgment": "1960-11-24"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is a registered firm carrying on business as commission agents in Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For purposes of its business, the respondent borrowed money from time to time from Banks on joint promissory notes executed by it and by others with joint and several liability.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On September 26, 1949, the respondent borrowed Rs. 1,00,000 from the Bank of India on a pronote executed jointly with one Kishorilal. Out of this amount a sum of Rs. 50,000 was taken by the respondent for purposes of its business and the rest by Kishorilal.",
      "type": "material",
      "date": "1949-09-26",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Kishorilal failed to meet his liability and became a bankrupt.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The respondent had to pay the Bank the whole amount, i.e., Rs. 1,00,000 with interest.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Out of the amount taken by Kishorilal, the respondent received in the accounting year, from the Official Assignee, a sum of Rs. 18,805 and claimed the balance, i.e., Rs. 31,740 as deduction.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The accounting year was from August 26, 1949 to July 17, 1950, the assessment year being 1951-52.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "This claim was disallowed both by the Income-tax Officer as well as the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On appeal to the Income-tax Appellate Tribunal, this sum was allowed as an allowable deduction under s. 10(2)(xv) of the Income-tax Act and as business loss.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "At the instance of the Commissioner, a case was stated to the High Court of Bombay by the Income-tax Appellate Tribunal in I.T.R. No. 55 of 1955.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appeal by special leave from the judgment and order dated 8th March, 1956, of the former Bombay High Court.",
      "type": "procedural",
      "date": "1956-03-08",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The Tribunal found that for the purpose of his business, he borrows from time to time money on joint and several liability from banks. The commercial practice is to borrow money from banks on joint and several liability.",
      "type": "admitted",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f13",
      "text": "An illustration: A and B require Rs. 50,000 each. They find that the Bank would not advance Rs. 50,000 to each on his individual security. They however, find that the Bank would be prepared to advance Rupees one lakh on their joint and several liability. They take Rupees one lakh on joint and several liability and then divide the money equally between themselves.",
      "type": "background",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f14",
      "text": "The Banks advanced monies to some constituents on their personal security also but they had to pay a higher rate of interest than when the money was borrowed on joint and several responsibility.",
      "type": "background",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f15",
      "text": "Rs. 1,00,000 borrowed from the Bank was in accordance with the commercial practice of Bombay.",
      "type": "admitted",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f16",
      "text": "Counsel for the Commissioner challenged the findings of the Tribunal in regard to the existence of commercial practice in Bombay but this ground of attack is not available to him because not only did the Tribunal give this finding in its Order, but in the agreed statement of the case also this finding was repeated.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The High Court proceeded on the basis of this commercial practice.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the assessee's claim is sustainable under section 10(2)(xv) of the Act?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether the assessee's claim that the loss was a business loss and, therefore, allowable as a deduction in computing the profits of the assessee's business is sustainable under law?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Challenged the findings of the Tribunal in regard to the existence of commercial practice in Bombay.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "This court in Madan Gopal Bagla v. Commissioner of Income Tax, West Bengal had decided against the allowability of such losses.",
      "supporting_facts": [],
      "legal_basis": "Madan Gopal Bagla v. CIT (1956 SCR 551)"
    },
    {
      "id": "pa3",
      "text": "The loss of the respondent was a capital loss.",
      "supporting_facts": [],
      "legal_basis": "Madan Gopal Bagla v. CIT"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Madan Gopal Bagla's case was decided against the assessee because the custom of persons standing surety for each other for borrowing money and the element of mutuality which was an essential ingredient in the case of Commissioner of Income Tax, Madras v. S. A. S. Ramaswamy Chettiar was not proved.",
      "supporting_facts": [],
      "legal_basis": "CIT v. S.A.S. Ramaswamy Chettiar (1946) 14 ITR 236"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Counsel for the Commissioner challenged the findings of the Tribunal in regard to the existence of commercial practice in Bombay but this ground of attack is not available to him because not only did the Tribunal give this finding in its Order, but in the agreed statement of the case also this finding was repeated.",
      "addresses_issue": "i1",
      "key_observation": "Finding of commercial practice is binding."
    },
    {
      "id": "cr2",
      "text": "The facts of Madan Gopal Bagla case are distinguishable; mutuality as an essential ingredient of the custom was lacking there.",
      "addresses_issue": "i1",
      "key_observation": "Distinguished Madan Gopal Bagla."
    },
    {
      "id": "cr3",
      "text": "In the present case, there is mutuality and custom of borrowing money on joint pronotes for the carrying on of business, similar to CIT v. Ramaswamy Chettiar.",
      "addresses_issue": "i2",
      "key_observation": "Mutuality and custom proved."
    },
    {
      "id": "cr4",
      "text": "The decision in CIT v. S.R. Subramanya Pillai distinguished on facts; loss too remote there.",
      "addresses_issue": "i1",
      "key_observation": "Not applicable due to different business."
    },
    {
      "id": "cr5",
      "text": "Montreal Coke case not applicable as financial arrangements were distinct from income-earning activities there.",
      "addresses_issue": "i2",
      "key_observation": "Different facts."
    },
    {
      "id": "cr6",
      "text": "The respondent was rightly held to be entitled to deduct the loss which was suffered by him in the transaction in dispute.",
      "addresses_issue": "i1",
      "key_observation": "Loss is business loss deductible under s.10(2)(xv)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The assessee's claim is sustainable under section 10(2)(xv) of the Act as a business loss.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The loss was a business loss allowable as a deduction in computing the profits of the assessee's business.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Madan Gopal Bagla v. Commissioner of Income Tax, West Bengal",
      "citation": "1956 S.C.R. 551",
      "treatment": "distinguished",
      "relevance": "Facts distinguishable; mutuality lacking there."
    },
    {
      "case_name": "Commissioner of Income Tax, Madras v. S. A. S. Ramaswamy Chettiar",
      "citation": "1946 14 I.T.R. 236",
      "treatment": "followed",
      "relevance": "Similar custom and mutuality in money-lending business; loss deductible."
    },
    {
      "case_name": "Commissioner of Income Tax v. S. R. Subramanya Pillai",
      "citation": "1950 18 I.T.R. 85",
      "treatment": "distinguished",
      "relevance": "Loss too remote from book-selling business."
    },
    {
      "case_name": "Montreal Coke and Manufacturing Co. v. Minister of National Revenue",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Financial arrangements distinct from income-earning activities."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "10(2)(xv)",
        "10(2)(xi)"
      ],
      "relevance": "Allowable deduction as business loss or bad debt."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Bombay High Court judgment favoring the assessee is dismissed. The High Court answered both referred questions in favor of the assessee, holding the loss deductible under s.10(2)(xv) as per commercial practice.",
    "relief_granted": "Loss of Rs. 31,740 allowed as deduction upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The finding of the Tribunal is clear and explicit that what the assessee was doing was not something out of the ordinary, but in borrowing this money on joint and several liability he was following a practice which was established as a commercial practice.",
      "speaker": "high_court",
      "significance": "Basis for upholding commercial practice."
    },
    {
      "text": "In our opinion in the circumstances proved in the present case, and on the facts established and on the findings given, the respondent was rightly held to be entitled to deduct the loss which was suffered by him in the transaction in dispute.",
      "speaker": "court",
      "significance": "Core holding on deductibility."
    }
  ],
  "_case_id": "1960_208",
  "_label": 0,
  "_text_length": 13437,
  "_extracted_at": "2026-02-10T19:54:37.997424"
}