{
  "metadata": {
    "case_name": "Appellant v. Union of India & Ors.",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo J."
    ],
    "case_number": "Civil Appeal No. 428 of 1959",
    "date_of_judgment": "1960-01-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was granted a mining lease by the then Ruler of Gangpur State on December 30, 1947, shortly before the merger of that State with the State of Orissa on January 1, 1948.",
      "type": "background",
      "date": "1947-12-30",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant's lease was annulled on June 29, 1949.",
      "type": "background",
      "date": "1949-06-29",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Thereafter the appellant was granted certificates of approval in respect of prospecting licences and mining leases.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant applied on December 19, 1949, for mining leases for manganese in respect of five areas in the district of Sundergarh, Orissa.",
      "type": "material",
      "date": "1949-12-19",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Appellant was asked on July 4, 1950, to submit a separate application for each area which he did on July 27, 1950.",
      "type": "procedural",
      "date": "1950-07-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Some defects were pointed out in appellant's applications and therefore the appellant submitted fresh applications on September 6, 1950, after removing the defects.",
      "type": "procedural",
      "date": "1950-09-06",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Third respondent made applications for mining leases for manganese for the same areas on July 10, 1950. These applications were not accompanied by the deposit required under r. 29 of the Rules.",
      "type": "material",
      "date": "1950-07-10",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Third respondent was asked on July 24, 1950, to deposit a sum of Rs. 500, which it did on August 3, 1950.",
      "type": "procedural",
      "date": "1950-07-24",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Third respondent's applications were found defective. It was asked on September 5, 1950, to send a separate application in the prescribed form for each block and thereupon it submitted fresh applications on September 6, 1950.",
      "type": "procedural",
      "date": "1950-09-06",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On December 22, 1952, the State of Orissa granted the mining leases of the five areas to the appellant taking into account r. 32 of the Rules, which prescribed priority. It was held that the appellant's applications were prior.",
      "type": "material",
      "date": "1952-12-22",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "On April 21, 1953, possession of the areas leased was delivered to the appellant.",
      "type": "material",
      "date": "1953-04-21",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Third respondent applied for review to the Central Government under r. 52 of the Rules.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Review application was allowed by the Central Government on January 28, 1954, and the Government of Orissa was directed to grant a mining lease to the third respondent with respect to two out of the five areas.",
      "type": "material",
      "date": "1954-01-28",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Appellant came to know in February, 1954, that the third respondent had applied to the Central Government under r. 52 for review. He addressed a letter to the Central Government praying that he might be given a hearing before any order was passed.",
      "type": "procedural",
      "date": "1954-02",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Appellant was informed on July 5, 1955, by the Government of Orissa of the order passed by the Central Government on January 28, 1954, by which the lease granted to him by the State of Orissa with respect to two areas was cancelled.",
      "type": "procedural",
      "date": "1955-07-05",
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Appellant made an application under Art. 226 to the Punjab High Court (Writ Petition No. 306-D of 1954) praying for quashing the order of January 28, 1954.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Writ petition heard by Single Judge of High Court, held order not quasi-judicial but administrative, no hearing required, petition failed on November 28, 1955.",
      "type": "procedural",
      "date": "1955-11-28",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Letters Patent Appeal No. 47-D of 1955 to Division Bench, upheld Single Judge on February 25, 1959.",
      "type": "procedural",
      "date": "1959-02-25",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Certificate granted by Punjab High Court for appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether an order of the Central Government under r. 54 of the Mineral Concession Rules, 1949, is quasi-judicial or administrative.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Central Government was acting in a quasi-judicial capacity when it passed the order under r. 54 and therefore it was incumbent upon it to hear the appellant before deciding the review application, as principles of natural justice apply.",
      "supporting_facts": [
        "f10",
        "f11",
        "f13",
        "f14"
      ],
      "legal_basis": "Nagendra Nath Bora v. Commissioner of Hills Division (1958 S.C.R. 1240); rr. 52-55 of Rules create lis"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Order of January 28, 1954, is a mere administrative order; no necessity to hear parties; minerals are state property, no right to lease until final order; even under r.32 State not bound to grant to first applicant.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "rr. 32, 52-55 of Rules"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rules 52-55 analyzed: r.52 gives statutory right to aggrieved person to apply for review within 2 months; creates lis between grantee and aggrieved; State Government order final subject to r.54; right created upon grant as possession given and worked.",
      "addresses_issue": "i1",
      "key_observation": "Lis created upon review application; duty to act judicially unless statute contrary."
    },
    {
      "id": "cr2",
      "text": "Applied principles from Province of Bombay v. Kushaldas S. Advani: authority determining questions affecting rights with duty to act judicially is quasi-judicial.",
      "addresses_issue": "i1",
      "key_observation": "r.54 requires acting justly and properly; no provision negatives judicial duty."
    },
    {
      "id": "cr3",
      "text": "Central Government acting quasi-judicially under r.54; failed to give reasonable opportunity to appellant; order violates natural justice.",
      "addresses_issue": "i1",
      "key_observation": "Quash order; liberty to rehear after notice."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "On the Rules and the Act as they stood, Central Government acting in quasi-judicial capacity under r.54; must give reasonable opportunity to represent before decision.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Nagendra Nath Bora v. Commissioner of Hills Division and Appeals, Assam",
      "citation": "1958 S.C.R. 1240",
      "treatment": "referred",
      "relevance": "Supports quasi-judicial nature due to lis"
    },
    {
      "case_name": "Province of Bombay v. Kushaldas S. Advani",
      "citation": "1950 S.C.R. 621",
      "treatment": "followed",
      "relevance": "Principles for quasi-judicial acts: legal authority to determine rights with duty to act judicially"
    },
    {
      "case_name": "R. v. Electricity Commissioners",
      "citation": "1924 1 K.B. 171",
      "treatment": "referred",
      "relevance": "Definition of quasi-judicial body by Atkin L.J., adopted in Advani case"
    }
  ],
  "statutes_cited": [
    {
      "name": "Mines and Minerals (Regulation and Development) Act, 1948 (No. 53 of 1948)",
      "sections": [
        "s. 6"
      ],
      "relevance": "Rules framed under; governs mining leases"
    },
    {
      "name": "Mineral Concession Rules, 1949",
      "sections": [
        "r. 29",
        "r. 32",
        "r. 52",
        "r. 53",
        "r. 54",
        "r. 55"
      ],
      "relevance": "Priority (r.32); review by Central Govt (r.52-55); basis for quasi-judicial determination"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Basis for writ petition"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court orders set aside; Central Government order dated January 28, 1954 quashed for violating natural justice by not hearing appellant; liberty to Central Government to rehear review application after giving reasonable opportunity to appellant.",
    "relief_granted": "Writ of certiorari quashing Central Government order; liberty to proceed afresh with hearing.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Whenever any body of persons having legal authority to determine questions affecting rights of subjects, and having the duty to act judicially act in excess of their legal authority they are subject to the controlling jurisdiction...\"",
      "speaker": "court",
      "significance": "Definition of quasi-judicial act from Electricity Commissioners via Advani case"
    },
    {
      "text": " \"It must therefore be held that on the Rules and the Act, as they stood at the relevant time, the Central Government was acting in a quasi-judicial capacity while deciding an application under r. 54.\"",
      "speaker": "court",
      "significance": "Core holding on nature of Central Government order"
    },
    {
      "text": "\"As such it was incumbent upon it before coming to a decision to give a reasonable opportunity to the appellant...\"",
      "speaker": "court",
      "significance": "Application of natural justice principles"
    }
  ],
  "_case_id": "1960_180",
  "_label": 1,
  "_text_length": 16367,
  "_extracted_at": "2026-02-10T19:54:10.769497"
}