{
  "metadata": {
    "case_name": "Dalip Singh v. State of PEPSU",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA J."
    ],
    "case_number": "Civil Appeal No. 235 of 1958",
    "date_of_judgment": "1960-07-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant Dalip Singh entered the service of the Patiala State in 1916 and rose to the rank of Inspector General of Police of the State in June 1946.",
      "type": "background",
      "date": "1916-06-1946",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "After the formation of the State of Pepsu he was absorbed in the Police Service of the newly formed State and was appointed and confirmed as Inspector General of Police thereof.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "While holding that post he proceeded on leave from October 18, 1949, till August 17, 1950.",
      "type": "procedural",
      "date": "1949-10-18 to 1950-08-17",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On August 18, 1950, an order was made by the Rajpramukh of the State: 'His Highness the Rajpramukh is pleased to retire from service Sardar Dalip Singh, Inspector General of Police, Pepsu on leave for administrative reasons with effect from the 18th August, 1950.' A copy of this order was forwarded to the appellant.",
      "type": "material",
      "date": "1950-08-18",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "On August 19, 1950, the appellant wrote to the Chief Secretary of the State stating that by his retirement he would be put to heavy loss, i.e., about Rs. 50,000 which he would have earned as his pay and allowances etc., during this period and that his pension was also being affected and that this decision of the Government tantamounts to his removal from service. He requested that the Government should let him know the grounds which had impelled the Government to take this decision about his removal.",
      "type": "procedural",
      "date": "1950-08-19",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Ultimately on March 30, 1951, the Government mentioned the charges against him on the basis of which the Government had decided to retire him on administrative grounds.",
      "type": "material",
      "date": "1951-03-30",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "After service of notice under s.80 of the Code of Civil Procedure the appellant brought a suit in the Court of the District Judge, Patiala, against the State of Pepsu asking for a declaration that the orders of August 18, 1950, whereby the plaintiff has been removed from the post of Inspector-General of Police, Pepsu, are unconstitutional, illegal, void, ultra vires and inoperative and that the plaintiff still continues to be in the service of the defendant as Inspector General of Police and is entitled to the arrears of his pay and allowances from August 18, 1950, and is also entitled to continue to draw his pay and allowances till his retirement at the age of superannuation and a decree for the recovery of Rs. 26,699-13-0 and full costs of this suit and future interest.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The trial Court held that the order compulsorily retiring the plaintiff amounted to his removal within the meaning of Art. 311 of the Constitution and as the requirement of that Article had not been complied with it held that the termination of service effected by that order was void in law. The Court accordingly decreed the suit in favour of the plaintiff.",
      "type": "procedural",
      "date": "1953-11-21",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "On appeal by the State the Pepsu High Court disagreeing with the Trial Court held that the order of compulsory retirement did not amount to removal from service within the meaning of Art. 311 of the Constitution and accordingly allowed the appeal and dismissed the plaintiffs suit.",
      "type": "procedural",
      "date": "1956-10-18",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Rule 278 of the Patiala State Regulations: 'For all classes of pensions the person who desires to obtain the pension is required to submit his application before any pension is granted to him. The State reserves to itself the right to retire any of its employees on pension on political or on other reasons.'",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The appellant has been allowed full pension.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the compulsory retirement of the appellant under Rule 278 of the Patiala State Regulations was a removal from service within the meaning of Art. 311 of the Constitution.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Rule 278 of the Patiala State Regulations was applicable on August 18, 1950.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order of August 18, 1950, amounted to his removal from service within the meaning of Art. 311(2) of the Constitution and the provisions of that article having not been complied with the termination of his service was void and inoperative in law.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "Art. 311(2) of the Constitution"
    },
    {
      "id": "pa2",
      "text": "Rule 278 of the Patiala State Regulations under which the Government apparently made the order of compulsory retirement was no longer operative as revised rules do not contain any rules similar to Rule 278.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Patiala State Regulations"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The plaintiff had been retired from service and had not been removed from service and so Art. 311 of the Constitution had no application.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Art. 311 of the Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 278 was in force on August 18, 1950, as pension rules from 1931 edition continued to apply to PEPSU until 1952 publication, and the 1952 edition retained the provision.",
      "addresses_issue": "i2",
      "key_observation": "Upto the publication in 1952 of Volume III of the Pepsu Service Regulations the pension rules appearing in the 1931 edition of the Patiala State Regulations continued to be applicable to Pepsu."
    },
    {
      "id": "cr2",
      "text": "Two tests for whether termination by compulsory retirement amounts to removal under Art. 311: (1) whether the action is by way of punishment (charge or imputation made condition of exercise of power); (2) whether the officer is losing the benefit he has already earned.",
      "addresses_issue": "i1",
      "key_observation": "These tests were applied from Shyamlal v. State of U.P. and State of Bombay v. Subhagchand Doshi."
    },
    {
      "id": "cr3",
      "text": "The order does not purport to be passed on any charge of misconduct or inefficiency; it states retirement for administrative reasons. Charges were communicated only after appellant's insistence.",
      "addresses_issue": "i1",
      "key_observation": "There is no basis for saying that the order of retirement contained any imputation or charge against the officer."
    },
    {
      "id": "cr4",
      "text": "The officer has been allowed full pension; no loss of earned benefit. Retirement is on pension in accordance with rules.",
      "addresses_issue": "i1",
      "key_observation": "The order of retirement is clearly not by way of punishment."
    },
    {
      "id": "cr5",
      "text": "Observations in Doshi's case do not limit compulsory retirement to rules fixing an age; applicable to Rule 278 allowing retirement at any age.",
      "addresses_issue": "i1",
      "key_observation": "It will not be proper to read the observations in Doshi's Case as laying down the law that retirement under the rule we are considering must necessarily be regarded as dismissal or removal within the meaning of Art. 311."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The order of compulsory retirement made against the appellant was not removal from service so as to attract the provisions of Art. 311 of the Constitution.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Rule 278 of the Patiala State Regulations remained in force and applicable on August 18, 1950.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shyamlal v. The State of U. P. and the Union of India",
      "citation": "1955 1 S.C.R. 26",
      "treatment": "followed",
      "relevance": "Laid down two tests for whether compulsory retirement amounts to removal under Art. 311: (1) not by way of punishment; (2) no loss of earned benefits."
    },
    {
      "case_name": "State of Bombay V. Subhagchand Doshi",
      "citation": "1958 S.C.R. 571",
      "treatment": "followed",
      "relevance": "Applied the tests from Shyamlal case; distinguished retirement from dismissal/removal where misconduct forms basis vs. background."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 311"
      ],
      "relevance": "Provisions on removal/dismissal from service; not attracted by compulsory retirement."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 80"
      ],
      "relevance": "Notice served before filing suit."
    },
    {
      "name": "Patiala State Regulations",
      "sections": [
        "Rule 278"
      ],
      "relevance": "Reserved right to State to retire employees on pension for political or other reasons; held applicable and not amounting to removal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the PEPSU High Court's decision, holding that the compulsory retirement order was not removal under Art. 311, Rule 278 was applicable, and dismissed the appeal and the suit.",
    "relief_granted": "None",
    "costs": "Not specified"
  },
  "key_quotes": [
    {
      "text": "\"His Highness the Rajpramukh is pleased to retire from service Sardar Dalip Singh, Inspector General of Police, Pepsu on leave for administrative reasons with effect from the 18th August, 1950.\"",
      "speaker": "respondent",
      "significance": "The impugned retirement order, key to determining if it was removal."
    },
    {
      "text": "Two tests had to be applied for ascertaining whether a termination of service by compulsory retirement amounted to removal or dismissal so as to attract the provisions of Art. 311 of the Constitution.",
      "speaker": "court",
      "significance": "Defines the legal test applied to resolve the main issue."
    },
    {
      "text": "The order of compulsory retirement made against the appellant was not removal from service so as to attract the provisions of Art. 311 of the Constitution and that the suit was rightly dismissed.",
      "speaker": "court",
      "significance": "Core holding of the judgment."
    }
  ],
  "_case_id": "1960_324",
  "_label": 0,
  "_text_length": 13497,
  "_extracted_at": "2026-02-10T19:55:55.000084"
}