{
  "metadata": {
    "case_name": "State of Bombay v. Arati Cotton Mills Ltd. and Supreme General Films Exchange Ltd.",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das, J."
    ],
    "case_number": "Civil Appeals Nos. 86 and 87 of 1956",
    "date_of_judgment": "1960-04-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On April 16, 1953, Messrs. Sawaldas Madhavdas brought a suit against the Arati Cotton Mills Ltd., praying for a decree for rupees two lacs and odd.",
      "type": "background",
      "date": "1953-04-16",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The suit against Arati Cotton Mills Ltd. was decreed on July 22, 1954.",
      "type": "procedural",
      "date": "1954-07-22",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Arati Cotton Mills Ltd. filed a memorandum of appeal against the decree on September 4, 1954, and paid court fees of Rs. 3,193-12-0.",
      "type": "procedural",
      "date": "1954-09-04",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "On or about October 5, 1954, a settlement was arrived at between the parties in the Arati Cotton Mills case, and on October 9, 1954, a prayer was made for dismissal of the appeal for want of prosecution.",
      "type": "procedural",
      "date": "1954-10-05",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On November 18, 1954, Arati Cotton Mills Ltd. applied under s. 151, Code of Civil Procedure, for refund of excess court fees paid on the memorandum of appeal, claiming only Rs. 32 was payable under old law.",
      "type": "procedural",
      "date": "1954-11-18",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "On December 17, 1953, Messrs. Rasiklal and Company Ltd. brought a suit against Messrs. Supreme General Films Exchange Ltd. and two other defendants.",
      "type": "background",
      "date": "1953-12-17",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The suit against Supreme General Films Exchange Ltd. was decreed on May 11, 1954, for Rs. 44,876-12-0.",
      "type": "procedural",
      "date": "1954-05-11",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Supreme General Films Exchange Ltd. filed a memorandum of appeal on July 31, 1954, and paid court fees of Rs. 1,958.",
      "type": "procedural",
      "date": "1954-07-31",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The appeal by Supreme General Films Exchange Ltd. was withdrawn with the leave of the High Court on September 27, 1954.",
      "type": "procedural",
      "date": "1954-09-27",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Supreme General Films Exchange Ltd. applied for refund of excess court fees on similar grounds.",
      "type": "procedural",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Both applications heard together after notice to Advocate-General, Bombay, who opposed for State of Bombay.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Bombay High Court by judgment dated November 24, 1954, allowed both applications for refund.",
      "type": "procedural",
      "date": "1954-11-24",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "State of Bombay obtained certificate that cases fit for appeal to Supreme Court; consolidated appeals filed.",
      "type": "procedural",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Court Fees Bombay Amendment Act, 1954 (Bombay Act No. XII of 1954) came into force on April 1, 1954, altering system to ad valorem fees by deleting s.4, amending s.6 and Art.1 Sch.I of Court Fees Act, 1870; no retrospective effect provision.",
      "type": "background",
      "date": "1954-04-01",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Prior to amendment, fixed fees applied; post-amendment, ad valorem fees on Original Side of Bombay High Court.",
      "type": "background",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in the absence of provisions giving retrospective effect to amendments in Court Fees Act, 1870 as applied to Bombay by Court Fees Bombay Amendment Act, 1954 effective April 1, 1954, the court fees payable on memoranda of appeal filed after that date but arising from suits filed prior were payable according to law at date of filing suits or at date of filing appeals.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No vested right in procedure; presumption against retrospective construction has no application to enactments affecting only procedure and practice of courts, even if disadvantageous.",
      "supporting_facts": [],
      "legal_basis": "Maxwell on Interpretation of Statutes, 10th Edn., p. 225; Mohri Kunwar v. Keshri Chand (I.L.R. 1941 All. 558)"
    },
    {
      "id": "pa2",
      "text": "No suitor has vested right to insist that court fee enactment shall not be changed during pendency; fee can be increased for future appeals.",
      "supporting_facts": [],
      "legal_basis": "Mohri Kunwar v. Keshri Chand"
    },
    {
      "id": "pa3",
      "text": "Attempts to distinguish earlier Bombay HC decision in A Reference Under Section 5 of the Court Fees Act (1954 57 Bom. L.R. 180).",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Right of appeal is substantive right vesting at date of filing suit; appeal is continuation of suit; cannot be impaired, imperilled, new conditions attached, or existing conditions made more onerous by non-retrospective procedural enactment.",
      "supporting_facts": [
        "f1",
        "f6"
      ],
      "legal_basis": "Hoosein Kasam Dada (India) Ltd. v. State of Madhya Pradesh (1953 S.C.R. 987); A Reference Under Section 5 of the Court Fees Act (1954 57 Bom. L.R. 180); Garikapatti Veerayya v. N. Subbiah Choudhury (1957 S.C.R. 488)"
    },
    {
      "id": "ra2",
      "text": "Amendments lacked express or necessary intendment for retrospective effect affecting appeals from pre-amendment suits.",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": "Court Fees Bombay Amendment Act, 1954"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Right of appeal vests at institution of suit; is substantive, not mere procedure; impairment by more onerous condition (higher fees) has no retrospective effect unless expressly or by intendment provided.",
      "addresses_issue": "i1",
      "key_observation": "Bombay High Court decision in A Reference Under Section 5 correct and governs present cases."
    },
    {
      "id": "cr2",
      "text": "Amendments changed fees from fixed to ad valorem without retrospective provision.",
      "addresses_issue": "i1",
      "key_observation": "No express or necessary intendment for retrospectivity."
    },
    {
      "id": "cr3",
      "text": "Hoosein Kasam Dada held amendment requiring tax deposit for appeal whittled down substantive right, not mere procedure.",
      "addresses_issue": "i1",
      "key_observation": "Impairment of appeal right not procedural."
    },
    {
      "id": "cr4",
      "text": "Garikapatti Veerayya approved that increasing court fees impairs appeal right like taking it away.",
      "addresses_issue": "i1",
      "key_observation": "Cited Sawaldas Madhavdas v. Arati Cotton Mills Ltd. (present case at HC level)."
    },
    {
      "id": "cr5",
      "text": "Distinguished Mohri Kunwar as concerning new right of appeal conferred, not impairment of existing vested right.",
      "addresses_issue": "i1",
      "key_observation": "No vested right in procedure for fee sufficiency determination."
    },
    {
      "id": "cr6",
      "text": "Approved Nagendra Nath Bose v. Mon Mohan Singh Roy: new deposit condition for appeal admission impairs substantive right.",
      "addresses_issue": "i1",
      "key_observation": "Date of original proceeding (suit) governs, not appeal filing date."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Impairment of right of appeal by imposing more onerous condition (higher court fees) is substantive, not procedural; subsequent enactment not retrospective without express or necessary intendment.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hoosein Kasam Dada (India) Ltd. v. State of Madhya Pradesh",
      "citation": "1953 S.C.R. 987",
      "treatment": "followed",
      "relevance": "Amendment requiring tax payment for appeal whittles down substantive right of appeal; not mere procedure."
    },
    {
      "case_name": "Garikapatti Veerayya v. N. Subbiah Choudhury",
      "citation": "1957 S.C.R. 488",
      "treatment": "followed",
      "relevance": "Increasing court fees or imposing onerous condition on appeal right involves same principle as taking away right; not retrospective."
    },
    {
      "case_name": "A Reference Under Section 5 of the Court Fees Act",
      "citation": "1954 57 Bom. L.R. 180",
      "treatment": "followed",
      "relevance": "Court fees on appeal from pre-amendment partition suit governed by old fixed fee law."
    },
    {
      "case_name": "Mohri Kunwar v. Keshri Chand",
      "citation": "I.L.R. 1941 All. 558",
      "treatment": "distinguished",
      "relevance": "Concerned new appeal right conferred; no vested right in procedure for fee determination."
    },
    {
      "case_name": "Nagendra Nath Bose v. Mon Mohan Singh Roy",
      "citation": "1930 34 C.W.N. 1009",
      "treatment": "followed",
      "relevance": "New deposit condition for appeal admission impairs substantive right; date of suit governs."
    },
    {
      "case_name": "Sawaldas Madhavdas v. Arati Cotton Mills Ltd.",
      "citation": "1954 57 B.L.R. 394",
      "treatment": "referred",
      "relevance": "Cited in Garikapatti; present case at HC level."
    },
    {
      "case_name": "R. M. Seshadri v. Province of Madras",
      "citation": null,
      "treatment": "referred",
      "relevance": "Court fees increase on appeal."
    },
    {
      "case_name": "In re, Punya Nahako",
      "citation": "1926 I.L.R. 50 Mad. 488",
      "treatment": "distinguished",
      "relevance": "Review fees increased; review not substantive like appeal."
    },
    {
      "case_name": "Parmeshwar Kurmi v. Bakhtwar Pande",
      "citation": "1932 I.L.R. 54 All. 1092",
      "treatment": "referred",
      "relevance": "Different view on review fees."
    },
    {
      "case_name": "Anand Ram Pramhans v. Ramgulam Sahu",
      "citation": "A.I.R. 1923 Pat. 150",
      "treatment": "distinguished",
      "relevance": "Incidental observation on new court fees act applying; no discussion on retrospectivity."
    },
    {
      "case_name": "Delhi Cloth and General Mills Co. Ltd. v. Income-tax Commissioner, Delhi",
      "citation": "1927 L.R. 54 I.A. 421",
      "treatment": "referred",
      "relevance": "Applied principle in reverse."
    },
    {
      "case_name": "Colonial Sugar Refining Co. v. Irving",
      "citation": "1905 A.C. 369",
      "treatment": "referred",
      "relevance": "Principle applied in Delhi Cloth case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Court Fees Act, 1870",
      "sections": [
        "s.4 (deleted)",
        "s.6 (amended)",
        "Sch. I Art.1",
        "Sch. II Art.17(vii)"
      ],
      "relevance": "Amended by Bombay Act to impose ad valorem fees instead of fixed; governed fees on appeals."
    },
    {
      "name": "Court Fees Bombay Amendment Act, 1954",
      "sections": [],
      "relevance": "Bombay Act No. XII of 1954; effective April 1, 1954; no retrospective effect; changed Original Side fees to ad valorem."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s.151"
      ],
      "relevance": "Basis for applications for refund of excess fees."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals by State of Bombay, upheld Bombay High Court orders refunding excess court fees paid on memoranda of appeal, as fees governed by law at suit institution date, pre-amendment.",
    "relief_granted": "High Court refunds upheld",
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "\"a right of appeal is a substantive right which vests in a litigant at the date of the filing of the suit, and cannot be taken away unless the legislature expressly or by necessary intendment says so\"",
      "speaker": "court",
      "significance": "Core principle affirming substantive nature of appeal right."
    },
    {
      "text": "\"impairment of the right of appeal by imposing a more onerous condition is not a matter of procedure only\"",
      "speaker": "court",
      "significance": "Distinguishes from pure procedural changes; applies to fee increases."
    },
    {
      "text": "\"the date to be looked into for this purpose is the date of the original proceeding, which eventually culminated in the appeal.\"",
      "speaker": "court",
      "significance": "Determines governing law by suit date, not appeal date."
    }
  ],
  "_case_id": "1960_23",
  "_label": 0,
  "_text_length": 19948,
  "_extracted_at": "2026-02-10T19:52:02.917225"
}