{
  "metadata": {
    "case_name": "Mathuradas (assessee) v. Commissioner of Income-tax (Civil Appeal No. 139 of 1956) and Commissioner of Income-tax v. Mathuradas (Civil Appeal No. 207 of 1959)",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Civil Appeal No. 139 of 1956 and Civil Appeal No. 207 of 1959",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant in C.A. No. 139 of 1956 was the karta of a Hindu undivided family which consisted of the appellant, his wife and three sons. The family owned various movable and immovable properties and business and were being assessed as a Hindu undivided family.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "There was a partition on October 16, 1944, and the deed of partition was executed on December 30, 1944, and was registered on January 2, 1945.",
      "type": "material",
      "date": "1944-10-16",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The appellant claimed that the partition was given full effect to and applied under section 25A of the Income-tax Act claiming exemption and reduction of tax liability for assessment years 1944-45, 1945-46, 1946-47 and 1947-48 and prayed for an order under section 25A.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The Income-tax Officer rejected the application holding that there was no partition as alleged by the appellant and that the deed of partition was not meant to be acted upon.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Appeal to the Appellate Assistant Commissioner was dismissed, and so was the appeal to the Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellant applied under section 66(1) for reference to High Court on five questions of law but dismissed. Then applied under section 66(2) and High Court directed Tribunal to state case on: Whether there is in this case any legal evidence to support the inference of the Tribunal that the partition in question was not genuine and meant to be acted upon? The partition in question was dated October 16, 1944.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "High Court decided reference against the appellant. Appellant came to Supreme Court on certificate of High Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Civil Appeal No. 207 of 1959 relates to assessment years 1948-49 and 1949-50. Accounting years were Samvat years.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On May 6, 1950, the respondents, Mathuradas, filed civil suits praying that the partition as evidenced by the deed dated December 30, 1944, be declared null and void and a fresh partition be made between the parties. Union of India sought to be made party but court refused.",
      "type": "material",
      "date": "1950-05-06",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The court held the partition evidenced by the deed of partition to be genuine, fair and binding on all the parties and that the joint family had ceased to exist as from December 30, 1944.",
      "type": "disputed",
      "date": "null",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Mathuradas applied under section 25A but dismissed. On appeal to Tribunal, decided in favour of Mathuradas except in regard to a house at Bikaner.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Commissioner applied for reference under section 66(1) rejected. Applied to High Court under section 66(2), High Court ordered reference: Whether there was any legal evidence before the Tribunal for the finding the partition was effected in 1944 and it was genuine? High Court answered in favour of respondent and against Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Additional facts placed before Tribunal including statements on oath of the sons of the respondent and other relevant material.",
      "type": "material",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there is in this case any legal evidence to support the inference of the Tribunal that the partition in question was not genuine and meant to be acted upon? (partition dated October 16, 1944)",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there was any legal evidence before the Tribunal for the finding the partition was effected in 1944 and it was genuine? (deed dated December 30, 1944)",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The partition was genuine, given full effect to, and deed meant to be acted upon.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Section 25A of the Income-tax Act"
    },
    {
      "id": "pa2",
      "text": "It was really the same partition and there was nothing fresh to support the genuineness of the partition and that the partition which had been held not to be genuine cannot now be held ratified.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "There was no partition as alleged and the deed of partition was not meant to be acted upon.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Partition evidenced by deed dated December 30, 1944, should be declared null and void.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It was held by the Tribunal, on the material before it, that the partition was not acted upon. In our opinion, the High Court, on this finding, rightly held against the appellant. No question of law arises in this appeal.",
      "addresses_issue": "i1",
      "key_observation": "Tribunal's finding that partition not acted upon supported by material; High Court rightly held against appellant."
    },
    {
      "id": "cr2",
      "text": "Considering the additional facts which were placed before the Tribunal and on which it had given a finding in favour of the respondent, Mathuradas, the High Court held that there was material in favour of the partition set up. On the additional facts proved before the Tribunal including the statements on oath of the sons of the respondent and the other relevant material it cannot be said that there were no materials for the Appellate Tribunal for finding in favour of the respondent and in favour of the partition being genuine.",
      "addresses_issue": "i2",
      "key_observation": "Additional evidence before Tribunal, including oath statements of sons, supports finding of genuine partition."
    },
    {
      "id": "cr3",
      "text": "The partition set up in this case was of December 30, 1944, whereas the partition set up in the earlier case was of October 16, 1944.",
      "addresses_issue": "i2",
      "key_observation": "Dates of partitions differ between the two cases."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No question of law arises; Tribunal's finding that partition not genuine and not acted upon upheld.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "There was material before Tribunal to find partition genuine based on additional facts.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "25A",
        "66(1)",
        "66(2)"
      ],
      "relevance": "Applied for claims of partition effect, exemptions, references to High Court on questions of law regarding genuineness of partition."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Both cross appeals dismissed. Civil Appeal No. 139 of 1956 dismissed as no question of law arises and Tribunal's finding upheld that partition not genuine. Civil Appeal No. 207 of 1959 dismissed as Tribunal had material to find partition genuine based on additional evidence.",
    "relief_granted": null,
    "costs": "Appeal No. 139 dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "In our opinion no question of law arises in this appeal.",
      "speaker": "court",
      "significance": "Supreme Court holds no substantial question of law in first appeal, dismissing it."
    },
    {
      "text": "It cannot be said that there were no materials for the Appellate Tribunal for finding in favour of the respondent and in favour of the partition being genuine.",
      "speaker": "court",
      "significance": "Upholds Tribunal's finding on genuineness based on evidence in second appeal."
    }
  ],
  "_case_id": "1960_172",
  "_label": 0,
  "_text_length": 5222,
  "_extracted_at": "2026-02-10T19:54:06.949837"
}