{
  "metadata": {
    "case_name": "Mahalaxmi Mills Ltd. & Master Silk Mills Ltd. v. Commissioner of Income-tax",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Das Gupta, J."
    ],
    "case_number": "Civil Appeals Nos. 599-602 of 1962",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Assessees Mahalaxmi Mills Ltd. and Master Silk Mills Ltd. carried on business in Bhavnagar, formerly an Indian State, before 1949-50.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1948, Bhavnagar and other Kathiawar states formed United States of Kathiawar, later renamed Saurashtra.",
      "type": "background",
      "date": "1948",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On March 16, 1949, Raj Pramukh instituted Saurashtra Income-tax Ordinance, 1949, in force for assessment year 1949-50.",
      "type": "background",
      "date": "1949-03-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Assets of both assessees acquired before previous year 1949-50, so S.13(5)(b) of Ordinance applied for written down value (WDV).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "ITO deducted depreciation which would have been allowable under Indian Income-tax Act, 1922, if in force: Rs.17,21,041 for Mahalaxmi (CA 599/62), Rs.2,02,500 for Master Silk (CA 601/62).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Assessees contended no deduction as no claim made under IT Act 1922.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Appellate Assistant Commissioner and Tribunal held no deduction permitted under expression 'or which would have been allowed to him if the Indian Income-tax Act, 1922, was in force in the past'.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court answered reference under s.66(1) IT Act in affirmative: WDV computed by deducting allowable depreciation under IT Act 1922 even if not claimed; certificate under s.66A(2) granted.",
      "type": "procedural",
      "date": "1960-04-07",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In 1950, Saurashtra became Part B State by s.3 Finance Act 1950; IT Act 1922 extended.",
      "type": "background",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "For 1951-52 (CA 600/62, 602/62), ITO deducted under s.10(5)(b) IT Act: depreciation 1950-51 (admitted), 1949-50 Ordinance (conceded by assessee), and Bhavnagar War Profits Act (Rs.5,93,285 Mahalaxmi, Rs.1,26,707 Master Silk).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "AAC agreed with ITO; Tribunal differed on War Profits Act depreciation.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "References to High Court: on s.10(5)(b) with Removal of Difficulties Order para 2 and Notification No.19 SRO 477 dt.9.3.1953; High Court held Notification ultra vires (not disputed), but depreciation under War Profits Act deductible under para 2.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Central Government made Taxation Laws (Part B States) Removal of Difficulties Order, 1950 on Dec 2, 1950 under s.12 Finance Act 1950.",
      "type": "background",
      "date": "1950-12-02",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts, upon proper construction of 'or which would have been allowed to him if the Indian Income-tax Act, 1922, was in force in the past' in S.13(5)(b) Saurashtra Ordinance 1949, WDV computed by deducting depreciation allowable under IT Act 1922 even though not claimed? (CA 599/62, 601/62)",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether on facts, under s.10(5)(b) IT Act 1922 read with Removal of Difficulties Order 1950 para 2 and Notification No.19 SRO 477 dt.9.3.1953, depreciation under Bhavnagar War Profits Act deductible for WDV in 1951-52? (CA 600/62, 602/62)",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Ordinance words 'would have been allowed' do not imply 'if claim supported by prescribed particulars made'; no justification to read in; assessee might not claim depreciation if beneficial.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "S.13(5)(b) Saurashtra Income-tax Ordinance 1949"
    },
    {
      "id": "pa2",
      "text": "Construction makes position worse than if IT Act 1922 actually in force (only actually allowed deductible); unreasonable; causes hardship without actual availment.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "For 1951-52, no difficulty experienced in particular case for Removal of Difficulties Order para 2 to apply; Bhavnagar War Profits Act not law of Part B State (pre-dates Saurashtra), nor 'any law relating to tax on profits of business' without 'of a Part B State'.",
      "supporting_facts": [
        "f10",
        "f13"
      ],
      "legal_basis": "S.10(5)(b) IT Act 1922; Removal of Difficulties Order 1950 para 2"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Deduct depreciation allowable under IT Act 1922 even if not claimed, as per proper construction.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "S.13(5)(b) Saurashtra Ordinance"
    },
    {
      "id": "ra2",
      "text": "Depreciation under Bhavnagar War Profits Act deductible under para 2 Removal of Difficulties Order as 'any law relating to tax on profits of business'.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Removal of Difficulties Order 1950 para 2"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Words 'which would have been allowed' implicit that proper claim made; meaningless without claim; apt to express intention to deduct allowable depreciation assuming IT Act 1922 in force.",
      "addresses_issue": "i1",
      "key_observation": "Authority appreciated no allowance without claim; fiction assumes proper claim ordinarily made."
    },
    {
      "id": "cr2",
      "text": "Not unreasonable; Raj Pramukh assumed proper claim under IT Act; hardship irrelevant as words clear.",
      "addresses_issue": "i1",
      "key_observation": "Distinguished Kamala Mills (actually allowed unambiguous) and Rajaratna (applicable vs allowed)."
    },
    {
      "id": "cr3",
      "text": "Removal of Difficulties Order valid; once made on satisfaction of difficulties in some cases, applies generally per its terms to all depreciation under Part B State laws or any law on profits tax; no need for case-specific difficulty.",
      "addresses_issue": "i2",
      "key_observation": "Followed Dewan Bahadur Ran Gopal Mills; para 2 operative irrespective of particular difficulty."
    },
    {
      "id": "cr4",
      "text": "Bhavnagar War Profits Act covered by 'any law relating to tax on profits of business' (deliberate omission of 'of a Part B State'); intended to include pre-Part B laws in component states; contrast with Merged States Order.",
      "addresses_issue": "i2",
      "key_observation": "No ellipsis; addition deliberate for prior laws."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "WDV under S.13(5)(b) Saurashtra Ordinance computed by deducting depreciation allowable under IT Act 1922 even if not claimed.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Depreciation under Bhavnagar War Profits Act deductible under s.10(5)(b) IT Act read with para 2 Removal of Difficulties Order 1950.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax v. Kamala Mills Ltd.",
      "citation": "1949 17 I.T.R. 130",
      "treatment": "distinguished",
      "relevance": "Held 'actually allowed' unambiguous, not 'allowable'; no similar expression as here."
    },
    {
      "case_name": "Rajaratna Naranbhai Mills Ltd. v. Commissioner of Income-Tax",
      "citation": "1950 18 I.T.R. 122",
      "treatment": "distinguished",
      "relevance": "'Depreciation applicable' immaterial if benefit taken; no consideration of 'would have been allowed if IT Act in force'."
    },
    {
      "case_name": "Commissioner of Income-tax Hyderabad v. Dewan Bahadur Ran Gopal Mills Ltd.",
      "citation": "1961 2 S.C.R. 318",
      "treatment": "followed",
      "relevance": "Central Govt determines difficulty under s.12 Finance Act 1950; order applies once made."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s.10(5)(b)",
        "s.66(1)",
        "s.66A(2)"
      ],
      "relevance": "Governs WDV computation by deducting actually allowed depreciation; hypothetical for Ordinance; extended to Part B States."
    },
    {
      "name": "Saurashtra Income-tax Ordinance, 1949",
      "sections": [
        "s.13(5)(b)"
      ],
      "relevance": "WDV = actual cost less depreciation actually allowed or which would have been allowed if IT Act 1922 in force."
    },
    {
      "name": "Finance Act, 1950",
      "sections": [
        "s.3",
        "s.12"
      ],
      "relevance": "Extended IT Act to Part B States; empowered Removal of Difficulties Order."
    },
    {
      "name": "Taxation Laws (Part B States) Removal of Difficulties Order, 1950",
      "sections": [
        "para 2"
      ],
      "relevance": "All depreciation under Part B State laws or any law on profits tax taken into account for WDV under s.10(5)(b)."
    },
    {
      "name": "Notification No.19 S.R.O.477 dated 9th March 1953",
      "sections": [
        "under s.60A IT Act"
      ],
      "relevance": "Held ultra vires by High Court (not disputed)."
    },
    {
      "name": "Bhavnagar War Profits Act",
      "sections": [],
      "relevance": "Depreciation availed thereunder deductible per Removal Order para 2."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed all four appeals, upholding Bombay High Court: for 1949-50, WDV deducts hypothetical IT Act 1922 depreciation; for 1951-52, deducts Bhavnagar War Profits Act depreciation under Removal of Difficulties Order para 2.",
    "relief_granted": null,
    "costs": "with costs"
  },
  "key_quotes": [
    {
      "text": "'The words which would have been allowed to him were used to mean which should have been allowed if proper claim had been made. For, it would be meaningless to speak of a depreciation allowance being allowed without a claim.'",
      "speaker": "court",
      "significance": "Core interpretation of S.13(5)(b) Ordinance for issue i1."
    },
    {
      "text": "'Once on such satisfaction an order is made it is not again necessary for the application of the order in a particular case that difficulty must be found to have arisen.'",
      "speaker": "court",
      "significance": "Explains application of Removal of Difficulties Order for issue i2."
    },
    {
      "text": "'The omission of the words of a Part B State in this paragraph is not by way of ellipsis but a deliberate omission with the intention of including laws which could not be stated to be laws of a Part B State but had been laws in the same area at a time before they formed part of a Part B State.'",
      "speaker": "court",
      "significance": "Key to including Bhavnagar War Profits Act."
    }
  ],
  "_case_id": "1960_93",
  "_label": 0,
  "_text_length": 23897,
  "_extracted_at": "2026-02-10T19:52:30.521339"
}