{
  "metadata": {
    "case_name": "Legal Representatives of Late Annantrai P. Pattani v. Commissioner of Income-tax",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "J. L. Kapur",
      "J. C. Shah",
      "M. Hidayatullah"
    ],
    "case_number": "Civil Appeal No.232 of 1960",
    "date_of_judgment": "1960-11-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Late Mr. Annantrai P. Pattani appointed Chief Dewan of Bhavnagar State by Hazur Order dated December 10, 1937.",
      "type": "background",
      "date": "1937-12-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On January 15, 1948, Maharaja introduced responsible Government, appointed assessee as Chairman of Bhavnagar Durbar Bank with no salary.",
      "type": "background",
      "date": "1948-01-15",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "By Hazur Order dated January 22, 1948, Maharaja granted monthly pension of Rs. 2,000 to assessee in appreciation of services rendered to Maharaja and State during war and thereafter.",
      "type": "material",
      "date": "1948-01-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On March 1, 1948, Bhavnagar State merged in United States of Saurashtra; Maharaja ceased to be ruler.",
      "type": "background",
      "date": "1948-03-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On May 31, 1950, Maharaja directed Messrs. Premchand Roychand Sons to pay Rs. 5 lacs to assessee from Maharaja's account; paid on June 12, 1950.",
      "type": "material",
      "date": "1950-05-31",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On December 27, 1950, Maharaja ordered Rs. 5 lacs to be debited to Personal Expense Account as gift to ex-Diwan in consideration of loyal and meritorious services.",
      "type": "disputed",
      "date": "1950-12-27",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On March 10, 1953, Maharaja wrote letter confirming Rs. 5 lacs as gift as token of affection and regard for assessee and family, paid from private moneys.",
      "type": "disputed",
      "date": "1953-03-10",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Rs. 5 lacs assessed as taxable under s.7(1) read with Explanation 2 for assessment year 1951-52 by Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appeals to Appellate Assistant Commissioner and Income-tax Appellate Tribunal dismissed; Tribunal held taxable under s.7(1) Expl.2, relied on Dec 27, 1950 order as contemporaneous.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court answered reference against assessee, held falls within s.7(1) Expl.2.",
      "type": "procedural",
      "date": "1958-10-06",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Assessee died during High Court proceedings; legal representatives brought on record.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sum of Rs. 5 lacs has been properly brought to tax in the hands of the assessee for the assessment year 1951-52 under s.7(1) read with Explanation 2 of the Income-tax Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Rs. 5 lacs not within s.7(1) Expl.2 as it was a personal gift in token of affection and regard, not remuneration for past services; pension already granted for services.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "s.7(1) Expl.2 Income-tax Act"
    },
    {
      "id": "pa2",
      "text": "Dec 27, 1950 document not contemporaneous (written 6 months after payment, for accounting entry); Tribunal erred in treating it as such and rejecting 1953 letter.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Payment relatable to personal qualities, not services; gap of 2 years after cessation of employment and pension.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Beynon v. Thorpe; Reed v. Seymour; Moorehouse v. Dooland; David Mitchell v. CIT"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Rs. 5 lacs relatable to office/services as ex-Dewan, remuneration for past services despite being voluntary gift by former employer.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.7(1) Expl.2 Income-tax Act; P. Krishna Menon v. CIT"
    },
    {
      "id": "ra2",
      "text": "Tribunal correctly preferred contemporaneous Dec 27, 1950 order over later 1953 letter; no distinction between Maharaja and State.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Tribunal erred in treating Dec 27, 1950 document as contemporaneous; it was for accounting, 6 months after payment. Pension already generous for services.",
      "addresses_issue": "i1",
      "key_observation": "Payment was personal gift for personal qualities and esteem, not in lieu of salary."
    },
    {
      "id": "cr2",
      "text": "Distinguished P. Krishna Menon: there payments arose from ongoing vocation/teaching as causa causans; here, past services already compensated by pension.",
      "addresses_issue": "i1",
      "key_observation": "Test is whether payment accrues by virtue of office/employment or as personal gift."
    },
    {
      "id": "cr3",
      "text": "Dissent by Hidayatullah J.: Tribunal finding on evidentiary value binding; Dec 1950 order shows remuneration for past services despite 'gift' label; follows Krishna Menon.",
      "addresses_issue": "i1",
      "key_observation": "Focus on why recipient received it, not donor's motive; Maharaja's words indicate consideration of services."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rs. 5 lacs not taxable under s.7(1) read with Explanation 2 as personal gift, not profit in lieu of salary or remuneration for past services.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Beynon v. Thorpe",
      "citation": "1928 14 T.C. 1",
      "treatment": "followed",
      "relevance": "Payments as personal gifts moved by remembrance of past services already remunerated, not taxable."
    },
    {
      "case_name": "Reed v. Seymour",
      "citation": "1927 XI T.C. 625",
      "treatment": "followed",
      "relevance": "Test: personal gift or remuneration? Testimonial for personal qualities not taxable."
    },
    {
      "case_name": "Moorehouse v. Dooland",
      "citation": "1955 28 I.T.R. 86",
      "treatment": "followed",
      "relevance": "Voluntary payments taxable if by virtue of office/remuneration; personal testimonial/gift not."
    },
    {
      "case_name": "David Mitchell v. Commissioner of Income-tax",
      "citation": "1956 30 I.T.R. 701",
      "treatment": "followed",
      "relevance": "Test: appreciation of personality/character vs. services for extra profit."
    },
    {
      "case_name": "P. Krishna Menon v. Commissioner of Income-tax",
      "citation": "1959 Supp. 1 S.C.R. 133",
      "treatment": "distinguished",
      "relevance": "Payments received by virtue of vocation/teaching as remuneration, not mere personal gifts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "7(1)",
        "7(1) Explanation 2",
        "4(3)"
      ],
      "relevance": "s.7(1) Expl.2 applies to profits in lieu of salary from former employer unless solely compensation for loss of employment not remuneration for past services; s.4(3) not referred."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed by majority (Kapur and Shah JJ.); High Court judgment set aside; question referred answered in negative against Commissioner; appellants entitled to costs throughout.",
    "relief_granted": "Rs. 5 lacs not taxable; reference answered against Revenue.",
    "costs": "Appellants to have costs throughout."
  },
  "key_quotes": [
    {
      "text": "\"It is nothing but a gift moved by the remembrance of past services already efficiently remunerated as services themselves.\"",
      "speaker": "court",
      "significance": "From Beynon v. Thorpe, adopted to hold payment as personal gift."
    },
    {
      "text": "\"The real question was, is the payment in the nature of a personal gift or is it a remuneration? If the latter, it is subject to the tax if the former, it is not.\"",
      "speaker": "court",
      "significance": "Test applied from Reed v. Seymour to classify payment."
    },
    {
      "text": "\"In consideration of Shri Annantrai P. Pattani the Ex-Diwan of our Bhavnagar State having rendered loyal and meritorious services Rs. 5,00,000 are given to him as gift.\"",
      "speaker": "court",
      "significance": "Maharaja's Dec 1950 order, disputed as contemporaneous but key to Tribunal/High Court/ dissent."
    },
    {
      "text": "\"The sum of Rs. 5,00,000 was not paid to the assessee in token of appreciation for the services rendered as a Dewan of Bhavnagar State but as a personal gift for the personal qualities of the assessee.\"",
      "speaker": "court",
      "significance": "Majority holding by Kapur J."
    }
  ],
  "_case_id": "1960_119",
  "_label": 1,
  "_text_length": 33844,
  "_extracted_at": "2026-02-10T19:53:40.157569"
}