{
  "metadata": {
    "case_name": "Editor and Printer/Publisher of New Age v. State (Public Prosecutor)",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Criminal Appeal No. 130 of 1960",
    "date_of_judgment": "1960-10-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant No. 1 is the editor and Appellant No. 2 is the printer and publisher of the New Age, an English weekly news sheet published in Delhi.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellants published a news item in the issue of New Age dated November 16, 1958, under the caption 'Explosive situation in Kanpur', alleged to be false and defamatory of the Chief Minister of Uttar Pradesh to harm his reputation.",
      "type": "material",
      "date": "1958-11-16",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "On May 15, 1959, the Public Prosecutor, Kanpur, filed a complaint in the Court of Session, Kanpur, against the appellants, accompanied by an order under signature of the Home Secretary to the Government of Uttar Pradesh sanctioning under s. 198B(3)(b) CrPC the filing of complaint for offence under s. 500 IPC.",
      "type": "procedural",
      "date": "1959-05-15",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Learned Sessions Judge took cognizance of the complaint.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "After six witnesses examined on behalf of prosecution, Sessions Judge framed charge against appellants for offence of defamation under s. 500 IPC, alleging publication intending or knowing likely to harm reputation of Chief Minister.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellants applied to Allahabad High Court in Criminal Revision No. 1865 of 1959 praying to set aside order framing charge.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "High Court by judgment and order dated April 28, 1960 rejected all contentions of appellants.",
      "type": "procedural",
      "date": "1960-04-28",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appeal by special leave under Art. 136 of Constitution preferred against High Court order.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Siddiqi, assistant in Home Department UP, deposed that he received papers for sanction from Superintendent, took to Deputy Secretary who noted, then to Home Secretary G. Kaul who perused notations, papers and article, and approved draft sanction.",
      "type": "admitted",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Home Secretary was authorised to sanction complaint for defamation of a Minister of UP Government.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "High Court observations on defamatory character of publication not final; for Trial Judge to decide whether defamatory of Chief Minister in respect of his conduct in discharge of duties.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sanction by Home Secretary was accorded without applying his mind.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the publication was defamatory of the Chief Minister in respect of his conduct in discharge of duties as Chief Minister.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the Sessions Judge had jurisdiction to entertain the complaint filed by Public Prosecutor without being signed by the aggrieved person (Chief Minister), given requirements of s. 198 CrPC.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether s. 198B CrPC requires a complaint by the person aggrieved in addition to the Public Prosecutor's complaint with sanction, or provides an independent procedure.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No evidence that Home Secretary applied his mind to facts before sanctioning prosecution.",
      "supporting_facts": [
        "f3",
        "f9"
      ],
      "legal_basis": "s. 198B(3)(b) CrPC"
    },
    {
      "id": "pa2",
      "text": "Publication not defamatory of Chief Minister in respect of his conduct in discharge of duties.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s. 500 IPC; s. 198B CrPC"
    },
    {
      "id": "pa3",
      "text": "Complaint filed by Public Prosecutor not signed by aggrieved Chief Minister; Sessions Judge had no jurisdiction.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "s. 198 CrPC; s. 198B(13) CrPC"
    },
    {
      "id": "pa4",
      "text": "s. 198B(13) makes s. 198 applicable, requiring complaint by aggrieved person.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "s. 198B(13) CrPC; s. 198 CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sanction valid as Home Secretary applied mind; evidence shows papers perused and approved.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Defamatory character to be decided at trial.",
      "supporting_facts": [
        "f2",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "s. 198B provides special independent procedure; no need for complaint by aggrieved; s. 198B(13) means in addition to, not in derogation of s. 198.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "s. 198B CrPC; s. 198 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Plea that sanction without applying mind without substance; evidence of Siddiqi shows Home Secretary perused materials and approved.",
      "addresses_issue": "i1",
      "key_observation": "Home Secretary applied mind to material facts."
    },
    {
      "id": "cr2",
      "text": "High Court not deciding defamatory character finally; for Trial Judge.",
      "addresses_issue": "i2",
      "key_observation": "Whether defamatory re conduct in public functions to be decided at trial."
    },
    {
      "id": "cr3",
      "text": "Sanction document sets out facts constituting charge; evidence confirms facts placed before authority who considered and sanctioned.",
      "addresses_issue": "i1",
      "key_observation": "Mere production of sanction document insufficient if facts not apparent; here they are and mind applied."
    },
    {
      "id": "cr4",
      "text": "s. 198B prescribes special procedure for defamation of high dignitaries, Ministers, public servants re public functions: cognizance by Sessions Court on PP complaint with sanction within 6 months, notwithstanding other Code provisions.",
      "addresses_issue": "i4",
      "key_observation": "Non-obstante clause excludes s. 198."
    },
    {
      "id": "cr5",
      "text": "s. 198B(13) 'in addition to, and not in derogation of s. 198' means preserves right of aggrieved to file under s. 198; does not make s. 198B supplementary requiring aggrieved's complaint.",
      "addresses_issue": "i3",
      "key_observation": "s. 198B independent alternative remedy; otherwise confusion with dual complaints in different courts."
    },
    {
      "id": "cr6",
      "text": "Complaint under s. 198B by PP; person defamed to be examined as witness; compensation if false/frivolous/vexatious.",
      "addresses_issue": "i3",
      "key_observation": "State concerned in vindicating public servants' conduct; provides machinery without burden on individual."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sanction under s. 198B(3)(b) CrPC valid as authority applied mind to facts.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Whether publication defamatory re Chief Minister's conduct in public duties to be decided at trial.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Sessions Court has jurisdiction on PP complaint with sanction under s. 198B; no requirement for complaint signed by aggrieved under s. 198.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "s. 198B provides independent procedure, additional to but not requiring s. 198 complaint.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "s. 198",
        "s. 198B(1)",
        "s. 198B(3)",
        "s. 198B(3)(b)",
        "s. 198B(4)",
        "s. 198B(13)",
        "s. 4(h)"
      ],
      "relevance": "Special procedure for defamation of Ministers/public servants re public functions; independent of s. 198; requires PP complaint with sanction."
    },
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "s. 500",
        "Chapter XXI"
      ],
      "relevance": "Offence of defamation (not by spoken words) applied."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 136"
      ],
      "relevance": "Special leave to appeal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court rejected all contentions of appellants, upheld High Court order rejecting revision against framing of charge by Sessions Judge, and permitted trial to proceed on merits including defamatory character.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The evidence clearly discloses that the Home Secretary had applied his mind to all the material facts before him and had then granted the sanction.",
      "speaker": "court",
      "significance": "Rejects challenge to validity of sanction."
    },
    {
      "text": "Section 198B is enacted to provide machinery for vindicating the conduct of high dignitaries, Ministers and public servants when they are exposed to defamatory attacks.",
      "speaker": "court",
      "significance": "Explains purpose and public interest in s. 198B procedure."
    },
    {
      "text": "The expressions, in addition to and not in derogation of mean the same thing-that s. 198-B is an additional provision and is not intended to take away the right of a person aggrieved.",
      "speaker": "court",
      "significance": "Interprets s. 198B(13); s. 198B independent."
    }
  ],
  "_case_id": "1960_163",
  "_label": 0,
  "_text_length": 18786,
  "_extracted_at": "2026-02-10T19:54:09.245503"
}