{
  "metadata": {
    "case_name": "Petlad Turkey Red Dye Works Ltd. v. Their Workmen",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Civil Appeal No. 258 of 1958",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeal by special leave from the Award dated August 17, 1957, of the Industrial Tribunal, Bombay, in Reference IT No. 15 of 1957.",
      "type": "procedural",
      "date": "1957-08-17",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Industrial Tribunal awarded a sum of Rs. 9,839 equivalent to one month's basic wages as bonus to employees.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Employer claimed interest at 4% on Rs. 2,27,000 standing in the depreciation fund said to have been used as working capital, amounting to Rs. 32,000, to be deducted as prior charge in ascertaining available surplus under Full Bench Formula.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "If claim allowed, no surplus would remain, and employees would not be entitled to any bonus.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Industrial Tribunal opined that even if depreciation reserve was utilized as working capital, no return thereon was allowable as prior charge.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Employer in written statement claimed Rs. 32,000 as interest on reserves as working capital at 4%.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Exhibit U/1 by workers: Rs. 3,000 deductible on working capital at 2%, implying Rs. 1,50,000 reserves used as working capital.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Exhibit C/3 dated July 12, 1957, by employer: deduction of interest at 4% on reserves employed as working capital - Rs. 32,000.",
      "type": "background",
      "date": "1957-07-12",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Exhibit C/4, alternative statement by employer on July 12, 1957: similar claim of Rs. 32,000.",
      "type": "background",
      "date": "1957-07-12",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Exhibit U/3 by workmen on July 12, 1957: return at 4% on working capital of Rs. 1,66,000 allowable.",
      "type": "background",
      "date": "1957-07-12",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Balance-sheet shows sum of Rs. 2,27,000 as depreciation fund.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "No evidence on record to prove that Rs. 2,27,000 or any portion of depreciation fund was actually utilized as working capital.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether return on depreciation reserve utilized as working capital is allowable as prior charge in ascertaining available surplus under Full Bench Formula.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Rs. 2,27,000 in depreciation fund was actually used as working capital, proved by balance-sheet or otherwise.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether balance-sheet by itself proves utilization of reserves as working capital.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Return at reasonable rate allowable on any portion of reserve actually utilized as working capital, including depreciation reserves, as prior charge.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "Numerous decisions of this Court"
    },
    {
      "id": "pa2",
      "text": "Rs. 2,27,000 depreciation fund was actually used as working capital, proved by balance-sheet.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Averment that depreciation fund used as working capital implicit in claim of Rs. 32,000, not challenged by workers.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Matter should be remanded to Industrial Tribunal for opportunity to adduce evidence.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Reserves used as working capital: Rs. 1,50,000 (Exhibit U/1) or Rs. 1,66,000 (Exhibit U/3), not admitting employer's full claim including depreciation fund.",
      "supporting_facts": [
        "f7",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Industrial Tribunal wrong in disallowing return on depreciation reserve if utilized as working capital; numerous decisions allow reasonable return on any reserve so utilized.",
      "addresses_issue": "i1",
      "key_observation": "No reason to except depreciation reserves."
    },
    {
      "id": "cr2",
      "text": "No material on record to conclude that Rs. 2,27,000 or portion was used as working capital; mere claim in written statement insufficient without proof.",
      "addresses_issue": "i2",
      "key_observation": "Duty on company to prove utilization."
    },
    {
      "id": "cr3",
      "text": "Workers did not admit utilization of depreciation fund as working capital, as their calculations showed lower amounts.",
      "addresses_issue": "i2",
      "key_observation": "Clear dispute on amount."
    },
    {
      "id": "cr4",
      "text": "Balance-sheet shows statements made, but does not prove correctness; burden on employer to prove by evidence like affidavit, with opportunity for cross-examination.",
      "addresses_issue": "i3",
      "key_observation": "Courts distinguish between statement and proof; directors may make incorrect statements."
    },
    {
      "id": "cr5",
      "text": "No circumstances justify remand in this case.",
      "addresses_issue": "i2",
      "key_observation": "Insufficient material already examined."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Return allowable on depreciation reserve if actually utilized as working capital.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Balance-sheet does not by itself prove utilization of reserves as working capital; requires proof by evidence.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No proof of utilization of depreciation fund as working capital; claim disallowed.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Khandesh Spg. Weaving Mill Co., Ltd. v. The Rashtriya Girni Kamgar Sangh, Jalgaon",
      "citation": "Civil Appeal No. 257 of 1958",
      "treatment": "followed",
      "relevance": "Balance-sheet prepared by company's officers; insist on clear proof of utilization of reserves as working capital, opportunity to labour to canvass correctness."
    },
    {
      "case_name": "Indian Hume Pipe Company Ltd. v. Their Workmen",
      "citation": "1959 II L.L.J. 357",
      "treatment": "distinguished",
      "relevance": "Observation on balance-sheet not intended to lay down that balance-sheet itself proves utilization."
    },
    {
      "case_name": "Management of Trichinopoly Mills Ltd. v. National Cotton Textile Mills Workers Union",
      "citation": "Civil Appeal No. 309 of 1957",
      "treatment": "followed",
      "relevance": "Balance-sheet does not prove utilization; must be proved by affidavit or evidence with opportunity for cross-examination."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; Tribunal's award upheld as no proof of utilization of depreciation fund as working capital; no remand ordered.",
    "relief_granted": "None to appellant; employees' bonus award of Rs. 9,839 upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Numerous decisions of this Court make it abundantly clear that any portion of the reserve actually utilized as working capital in the year under consideration should be treated as entitled to a reasonable rate of return.",
      "speaker": "court",
      "significance": "Establishes allowability of return on reserves used as working capital, including depreciation."
    },
    {
      "text": "The mere fact that the statements were made can never be taken as proving that the statements were correct.",
      "speaker": "court",
      "significance": "Key distinction on evidentiary value of balance-sheet statements."
    },
    {
      "text": "the principles of equity and justice demand that an Industrial Court should insist upon a clear proof of the same and also give a real and adequate opportunity to the labour to canvass the correctness.",
      "speaker": "court",
      "significance": "From cited precedent; emphasizes proof required for working capital claims."
    }
  ],
  "_case_id": "1960_335",
  "_label": 0,
  "_text_length": 10031,
  "_extracted_at": "2026-02-10T19:55:55.950969"
}