{
  "metadata": {
    "case_name": "Balwan Singh v. Lakshmi Narain",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha C.J.",
      "Imam J.",
      "Wanchoo J.",
      "Shah J.",
      "Sarkar J."
    ],
    "case_number": "Civil Appeal No. 411 of 1959",
    "date_of_judgment": "1960-02-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Three candidates, Balwan Singh (appellant), Ram Dulari and Gaya Prasad, contested the election to the U. P. Legislative Assembly from the Akbarpur Rural Assembly Constituency No. 6, at the general elections held in 1957.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Polling of votes took place on February 28, 1957, and the result was declared on March 2, 1957. The appellant secured the highest number of votes and was declared duly elected.",
      "type": "material",
      "date": "1957-02-28",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Lakshmi Narain (first respondent), a voter, submitted an election petition to the Election Commission to declare the appellant's election void, alleging inter alia that the appellant and/or his election agent and/or others with his consent committed corrupt practices, including in Cl. f of para 9 that in villages set out in Annexure D (list of 30 villages), the appellant, his agents and workers hired and procured bullock carts and tractors for conveying women electors to and from the polling station.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Appellant in written statement contended that averments in Cl. f of para 9 were untrue, neither he nor his agents or workers hired or procured vehicles, and first respondent failed to disclose names of voters or particulars of conveyances.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "On July 15, 1957, first respondent applied for leave to amplify particulars in para 9 including Cl. f by incorporating Ann. D-1, listing nature of vehicles, owners, villages, hire paid, families of women voters.",
      "type": "procedural",
      "date": "1957-07-15",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Appellant in rejoinder submitted that application sought to introduce fresh corrupt practices, prayed deletion of Cl. f para 9.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "On July 29, 1957, Election Tribunal (District Judge, Kanpur) rejected application, struck off Cl. f para 9 and Annexure D, holding it did not give required particulars under S.83(1)(b).",
      "type": "procedural",
      "date": "1957-07-29",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "First respondent applied for review relying on Mubarak Mazdoor v. K. K. Banerji (Allahabad HC, Sept 9, 1957). Tribunal on September 13, 1957, reviewed and set aside July 29 order.",
      "type": "procedural",
      "date": "1957-09-13",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellant applied to Allahabad High Court under Art. 227 challenging review order. High Court on March 6, 1958, substantially confirmed, holding Tribunal had jurisdiction or High Court could rectify unjust order.",
      "type": "procedural",
      "date": "1958-03-06",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Pursuant to High Court order, Cl. f para 9 restored, Ann. D-1 incorporated.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Tribunal on August 16, 1958, dismissed petition, holding first respondent failed to establish corrupt practices; for Cl. f, particulars of hiring/procuring not furnished, evidence unsatisfactory.",
      "type": "procedural",
      "date": "1958-08-16",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Allahabad High Court in appeal under S.116A set aside Tribunal order, declared election void. Held petition defective for omitting date/place of hiring tractor but no prejudice; evidence of A.P. Malik (Presiding Officer), Ex.22, Raghuraj Singh, Kalika Prasad, Hanuman Singh proved tractor hired and used for conveying voters at appellant's instance.",
      "type": "material",
      "date": "1959-01-09",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Evidence: A.P. Malik saw tractor 100-150 yards from Naholi polling station, diary note on Raghuraj Singh's application (Ex.22) about tractor with red flag, Socialist Party posters, women voters. Raghuraj Singh (PW30, agent of Ram Dulari) and PW38 confirmed. Kalika Prasad (PW) and family conveyed on trailer, Radhey Shyam (appellant's agent) gave slips. Hanuman Singh (PW56) witnessed hiring bargain for Chandra Bahadur's tractor.",
      "type": "disputed",
      "date": "1957-02-28",
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the election petition was liable to be rejected for failure to set forth full particulars under S.83(1)(b) of the Representation of the People Act, specifically date, place and parties to the contract of hiring the vehicle for the corrupt practice under S.123(5).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the corrupt practice under S.123(5) was proved, particularly hiring/procuring of tractor for conveying voters to Naholi polling station.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the Tribunal's order rejecting amplification was erroneous, and High Court's confirmation under Art.227 proper.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Averments in Cl. f para 9 untrue; no hiring or procuring of vehicles; petition defective for lack of particulars of voters, conveyances, and specifically date, place, parties to hiring contract.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "S.83(1)(b) Representation of the People Act"
    },
    {
      "id": "pa2",
      "text": "First respondent's application not to amplify but introduce fresh corrupt practices; Tribunal correctly struck off Cl. f and Annexure D.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "High Court erred in disagreeing with Tribunal's appreciation of evidence; no proof of corrupt practice.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Art.136 Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant and agents hired/procured vehicles including tractor for conveying women voters in listed villages; particulars in Ann. D-1 sufficient.",
      "supporting_facts": [
        "f3",
        "f5",
        "f13"
      ],
      "legal_basis": "S.123(5) Representation of the People Act"
    },
    {
      "id": "ra2",
      "text": "Petition not defective; corrupt practice is hiring for conveyance, but full particulars of conveyance suffice; no prejudice caused.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "S.83(1)(b); Mubarak Mazdoor v. K.K. Banerji"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Corrupt practice under S.123(5) is hiring/procuring vehicle for conveyance of electors; petition must give full particulars including names, date, place of commission, but particulars of conveyance with plea of hiring suffice; contract details within special knowledge of other party.",
      "addresses_issue": "i1",
      "key_observation": "Petition substantially complies if full particulars of conveying given, even without full contract details."
    },
    {
      "id": "cr2",
      "text": "Petition not dismissed in limine for lack of particulars; Tribunal must decide objection, allow amendment/amplification under S.90(5); if parties proceed to trial without objection, cannot later dismiss for procedural defect unless material prejudice.",
      "addresses_issue": "i1",
      "key_observation": "No material prejudice to appellant; evidence admitted without objection."
    },
    {
      "id": "cr3",
      "text": "Evidence of Malik, Ex.22, Raghuraj Singh PW30/PW38, Kalika Prasad, Hanuman Singh establishes tractor hired by appellant's side, with party symbols, used to convey voters to Naholi station.",
      "addresses_issue": "i2",
      "key_observation": "Unimpeachable evidence; Tribunal erred in rejecting on fanciful theories."
    },
    {
      "id": "cr4",
      "text": "Sarkar J. concurs hiring contract essential, particulars required, but no dismissal for lack; appellant proceeded to trial without seeking particulars or objecting.",
      "addresses_issue": "i1",
      "key_observation": "Appellant cannot complain later."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Full particulars of corrupt practice under S.123(5) require details of conveyance; failure to give full hiring contract details does not render petition defective if no material prejudice and parties proceed to trial.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Corrupt practice proved; appellant's election void.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Special leave under Art.136 does not open entire case; no re-appreciation of evidence unless grave injustice.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mubarak Mazdoor v. K. K. Banerji",
      "citation": "13 E.L.R. 310 (Allahabad High Court, Sept 9, 1957)",
      "treatment": "followed",
      "relevance": "Practice for dealing with vague allegations of corrupt practices in election petitions."
    },
    {
      "case_name": "Madan Lal v. Syed Zargham Haider",
      "citation": "13 E.L.R. 456 (Allahabad High Court)",
      "treatment": "distinguished",
      "relevance": "Held corrupt practice consists in hiring/procuring, not mere conveyance; requires particulars of hiring."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "83(1)(b)",
        "123(5)",
        "90(5)",
        "90(1)",
        "90(3)",
        "116A",
        "81",
        "82",
        "117"
      ],
      "relevance": "Particulars in election petitions; definition of corrupt practices; procedure for trial and amendment."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "227",
        "136",
        "226"
      ],
      "relevance": "High Court supervisory jurisdiction; Supreme Court special leave appeals."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; High Court order upheld declaring appellant's election void due to proved corrupt practice of hiring tractor for conveying voters; no material prejudice from lack of full particulars.",
    "relief_granted": "Election of Balwan Singh declared void",
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "\"Not the contract of hiring but the fact of hiring for conveying voters to and from the polling station is declared by s.123(5) a corrupt practice.\"",
      "speaker": "court",
      "significance": "Clarifies essence of corrupt practice under S.123(5)"
    },
    {
      "text": "\"Insistence upon full particulars of corrupt practices is undoubtedly of paramount importance... but if the parties go to trial despite the absence of full particulars... the petition cannot thereafter be dismissed for want of particulars.\"",
      "speaker": "court",
      "significance": "Procedure for handling defective particulars in election petitions"
    },
    {
      "text": "\"Under the section the hiring of the vehicle for the conveyance of electors is the corrupt practice. It is of the essence of this corrupt practice that the vehicle must have been hired.\"",
      "speaker": "court",
      "significance": "Sarkar J. on essential element being hiring contract"
    }
  ],
  "_case_id": "1960_284",
  "_label": 0,
  "_text_length": 30386,
  "_extracted_at": "2026-02-10T19:55:18.450722"
}