{
  "metadata": {
    "case_name": "Receiver for the estate of Prince Mohammad Bakhtyar Shah v. Jagdish Deo Dhabal Deo",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Civil Appeal No. 81 of 1956",
    "date_of_judgment": "1960-04-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dhalbhum estate covers more than 1,000 sq. miles, partly in Midnapur and partly in Singhbhum districts, rich in minerals.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1900, Raja Satrughan Deo Dhabal Deo, predecessor of first respondent Jagdish Deo Dhabal Deo, granted permanent lease of mining rights for certain metals and minerals to Prince Mohammad Bakhtyar Shah.",
      "type": "material",
      "date": "1900-01-10",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Clause 1 of 1900 lease grants rights to prospect, raise etc. gold, silver, copper, lead, zinc, iron, mercury, mica, sulphur, copper sulphate, coal, chalk, red-earth, precious stones etc., excluding certain mouzas.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Clause 6 of 1900 lease allows lessee to take stones, lime-stones, ghuting, ballast for mining work free of cost.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Clause 16 of 1900 lease excludes stones for utensils, stones, lime-stone, ghuting etc. for buildings; lessee cannot obstruct lessor or tenants from raising/selling them or digging wells etc., but underground minerals under wells etc. covered by lease.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Raja Satrughan Deo Dhabal Deo died in 1916; before death, estate management taken over by Deputy Commissioner of Singhbhum under Chotanagpur Encumbered Estates Act.",
      "type": "background",
      "date": "1916",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On September 1, 1919, Manager of Estate granted lease of mining rights in same area to Official Receiver of Prince Mohammad Bakhtyar Shah's estate.",
      "type": "material",
      "date": "1919-09-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "1919 lease grants 'all and singular all metals and minerals of whatsoever kind or description other than those specifically comprised in and granted by the principal lease' (1900 lease), with rights/privileges as in principal lease unless contradictory.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "1919 lease covenant: pay rent/royalty as in principal lease; liberty to grant under-leases subject to clause 16 of principal lease and government rules.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "1919 lease proviso: nothing deems 1900 pattah not still valid and subsisting.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Preamble of 1919 lease: disputes arose re construction of principal lease and minerals comprised therein (e.g., whether wolfram included); to end disputes, grant lease of all minerals other than those specifically mentioned in principal lease, subject to High Court consent.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Suit commenced by first respondent on August 12, 1941, to recover rents/royalties based on 1919 lease from heirs/representatives of Prince's estate and appellant as Receiver; lessor entitled to half share of receipts; decree for accounts from January 1, 1926.",
      "type": "procedural",
      "date": "1941-08-12",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Claim pre-August 12, 1935 prima facie barred by limitation; saved by acknowledgments by then Receiver.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Defences by Receiver (only contesting defendant): (1) lessor dispossessed from part of leasehold (minerals excluded in 1900 cl.16 but included in 1919), total suspension of rents/royalties; (2) no valid acknowledgment saving limitation pre-1935.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Special Subordinate Judge, Chaibassa (Money Suit No. 3 of 1941): 1919 lease does not include cl.16 minerals of 1900; no dispossession from leasehold; suspension plea fails. Acknowledgments valid under s.19 Limitation Act by competent Receiver. Decree for accounts 1935-1941; for period to 1935, defendant to assess amount due under 1919 lease from acknowledged Rs.67,459-3-3, else Commissioner.",
      "type": "procedural",
      "date": "1946-08-31",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Receiver appealed to Patna High Court (First Appeal from Original Decree No. 2 of 1947).",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Patna HC (judgment September 24, 1952): agreed 1919 excludes cl.16 minerals, no suspension; even if included, no forcible/tortious act by lessor. Acknowledgments valid under s.19. Dismissed appeal.",
      "type": "procedural",
      "date": "1952-09-24",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Supreme Court appeal by Receiver on certificate under Art.133 Constitution.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f19",
      "text": "Acknowledgment example (Ex.21, March 7, 1931 by Official Receiver): sent statements showing Rs.4,993-6-1 royalty due 1930, cheque on acceptance; Rs.31,944-8-3 to credit upto 1929, cheque on acceptance.",
      "type": "material",
      "date": "1931-03-07",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Acknowledgment of liability upto 1935: Rs.67,459-3-3 under both leases.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether minerals specifically excluded by clause 16 of the 1900 lease were demised by the 1919 lease, entitling defendant to suspension of rents/royalties due to dispossession.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether plaintiff's claim prior to August 12, 1935 is barred by limitation, or saved by acknowledgments by the Receiver.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "1919 lease includes minerals excluded by cl.16 of 1900 lease (all metals/minerals other than those specifically comprised in and granted by principal lease means X minus Y, where X is all, Y is granted); lessor granted leases to others re those minerals, dispossessing lessee; total suspension of rents/royalties.",
      "supporting_facts": [
        "f2",
        "f5",
        "f7",
        "f8",
        "f14"
      ],
      "legal_basis": "Principles of construction: intention from disposition clause in grammatical sense; earlier clause prevails over later restrictive; ambiguity favours grantee; no need for preamble."
    },
    {
      "id": "pa2",
      "text": "Acknowledgments conditional (subject to acceptance of accounts as correct); even if not, Receiver not agent duly authorised by debtor under Explanation II s.19 Limitation Act (authority must be by debtor, not by law/court).",
      "supporting_facts": [
        "f19"
      ],
      "legal_basis": "Section 19 Limitation Act; Currimbhai Ahmedali (Bombay HC)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "1919 lease grants minerals other than those specifically comprised in and granted by 1900 lease; cl.16 exclusions remain effective; no dispossession from leasehold.",
      "supporting_facts": [
        "f5",
        "f8",
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Acknowledgments by Receivers valid under s.19 Limitation Act; not conditional; Receiver represents estate, authority to pay implies authority to acknowledge; signed personally by previous Receivers party to 1919 lease.",
      "supporting_facts": [
        "f7",
        "f19"
      ],
      "legal_basis": "Section 19 Limitation Act; Lakshmanan Chetty v. Sadayappa Chetty; Receiver fully represents owners for estate debts."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Construing 1919 lease: disposition clause ambiguous re exclusions; consider whole document. Underlease condition subjects to cl.16 principal lease implies lessee also bound; concluding proviso affirms principal lease valid/subsisting, meaningful only re exclusions; preamble re disputes on what 'mentioned' in 1900 granting clause (e.g. wolfram), not exclusions. No dispute pre-1919 re cl.16. Thus, cl.16 minerals not granted by 1919; suspension plea fails.",
      "addresses_issue": "i1",
      "key_observation": "Minerals excluded by cl.16 of principal lease remain excluded from 1919 lease."
    },
    {
      "id": "cr2",
      "text": "Acknowledgments not conditional: first sentence states dues independently; second offers payment on acceptance, not conditioning statement of liability. Receiver's prior acknowledgments signed personally; s.19 applies directly as previous Receivers derived liability; no need to decide if Receiver generally agent under Expl.II.",
      "addresses_issue": "i2",
      "key_observation": "Acknowledgments within s.19, save limitation pre-1935."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Minerals excluded by clause 16 of 1900 lease not included in 1919 lease; no basis for suspension of rents/royalties.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Acknowledgments by Receivers constitute valid acknowledgments under s.19 Limitation Act, saving claim prior to August 12, 1935.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Annapagonda v. Sangadiappa",
      "citation": "1901 Bom. L.R. 221 (F.B.)",
      "treatment": "followed",
      "relevance": "Duly authorised in Expl.II s.19 includes by law/order of court."
    },
    {
      "case_name": "Rashbehary v. Anand Ram",
      "citation": "43 Cal. 211",
      "treatment": "followed",
      "relevance": "Follows Bombay FB on authorisation for acknowledgment."
    },
    {
      "case_name": "Ramcharan Das V. Gaya Prasad",
      "citation": "30 All. 422",
      "treatment": "followed",
      "relevance": "Follows on authorisation by law/court."
    },
    {
      "case_name": "Lakshumanan v. Sadayappa",
      "citation": "A.I.R. 1919 Mad. 816",
      "treatment": "followed",
      "relevance": "Receiver can acknowledge debts."
    },
    {
      "case_name": "Thankamma v. Kunhamma",
      "citation": "A.I.R. 1919 Mad. 370",
      "treatment": "followed",
      "relevance": "Follows on authorisation."
    },
    {
      "case_name": "Currimbhai Ahmedali",
      "citation": "58 Bom. 505",
      "treatment": "distinguished",
      "relevance": "Official Assignee acknowledgment not by agent; distinguished as Receivers signed personally here."
    },
    {
      "case_name": "Lakshmanan Chetty v. Sadayappa Chetty",
      "citation": "35 M.L.J. 571",
      "treatment": "referred",
      "relevance": "Receiver represents estate for debts, can acknowledge."
    }
  ],
  "statutes_cited": [
    {
      "name": "Limitation Act",
      "sections": [
        "19"
      ],
      "relevance": "Acknowledgments save limitation; Expl.II: signed by agent duly authorised."
    },
    {
      "name": "Chotanagpur Encumbered Estates Act",
      "sections": [],
      "relevance": "Estate management taken over by Deputy Commissioner; Manager granted 1919 lease."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "133"
      ],
      "relevance": "Certificate for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, affirming Patna High Court and trial court decrees. Held 1919 lease excludes cl.16 minerals of 1900 lease, no suspension; limitation saved by valid acknowledgments. Lower courts' directions for accounts stand.",
    "relief_granted": "Decree for rendition of accounts from January 1, 1926, and payment of half share of rents/royalties due under 1919 lease.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the Manager hereby grants demised unto the Receiver all and singular all metals and minerals of whatsoever kind or description other than those specifically comprised in and granted by the principal lease.\"",
      "speaker": "court",
      "significance": "Key disposition clause of 1919 lease, central to construction issue."
    },
    {
      "text": "\"all such underleases shall be subject to ... the provision of clause 16 of the said principal lease.\"",
      "speaker": "court",
      "significance": "Condition implying cl.16 exclusions bind lessee too."
    },
    {
      "text": "\"nothing herein contained shall be deemed to show that the Pottah of the tenth day of January one thousand and nine hundred ... is not still valid and subsisting.\"",
      "speaker": "court",
      "significance": "Proviso affirming 1900 lease, esp. re exclusions."
    },
    {
      "text": "\"the minerals excluded by clause 16 of the principal lease will remain excluded from the later lease also.\"",
      "speaker": "court",
      "significance": "Core holding on lease construction."
    }
  ],
  "_case_id": "1960_147",
  "_label": 0,
  "_text_length": 33812,
  "_extracted_at": "2026-02-10T19:54:11.616749"
}