{
  "metadata": {
    "case_name": "Sheel Chandra (Hindu Undivided Family) v. Commissioner of Income-tax",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Civil Appeal No.123 of 1957",
    "date_of_judgment": "1960-04-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a Hindu undivided family with Sheel Chandra as its Karta, consisting of Sheel Chandra and his younger brother.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Sheel Chandra's father, Adishwar Lal, was Treasurer of several branches of the Central Bank of India until his death on April 16, 1950.",
      "type": "background",
      "date": "1950-04-16",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "During father's lifetime, Sheel Chandra was employed as Overseer in the Bank on salary of Rs. 400 per month.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Sheel Chandra appointed Treasurer of Delhi and sixteen other branches effective April 16, 1950, via agreement dated September 19, 1950; could be appointed to other branches in Punjab, UP, Rajasthan by mutual agreement.",
      "type": "material",
      "date": "1950-04-16",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "As Treasurer, furnished security from HUF properties: title deeds of immovable properties in Chandni Chowk, Delhi, and Government of India securities worth Rs. 75,000.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "HUF owns considerable property: income from house property Rs. 50,000 per annum, stocks, shares, Government securities.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Received Rs. 23,286 from Bank in assessment year 1951-52 as emoluments.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Income-tax Authorities held sum as income of HUF; Appellate Tribunal upheld, construing agreement as profits and gains of business, security from joint family properties.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Tribunal referred two questions under s.66(1) Indian Income-tax Act to Punjab High Court at instance of appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "High Court answered both questions against appellant on May 12, 1955: emoluments not salary but profits of business; income of HUF due to family security and father's prior role.",
      "type": "procedural",
      "date": "1955-05-12",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Agreement details: Treasurer to engage subordinate Cash Department Staff (Head Cashiers, Potdars, etc.), control/dismiss with Bank approval; responsible for receipts/payments, genuineness of documents, losses from forgeries, pledged goods staff, enquiries on customers, hundi info, bullion valuation, safe custody, etc.",
      "type": "material",
      "date": "1950-09-19",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Remuneration: Rs. 1,750 per month for all branches; additional for guaranteeing certain staff; adjustments for branch changes; staff paid by Bank per its scale.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Agreement terminable by 3 months' notice or forthwith for breach; arbitration clause; Treasurer responsible for staff acts/omissions.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on true construction of agreement between Central Bank of India and Sheel Chandra, salary and emoluments as Treasurer assessable under head 'salary' or 'profits and gains of business'.",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether Sheel Chandra's emoluments as Treasurer rightly assessed in hands of Hindu undivided family of which he is Karta.",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Provisions of agreement show Sheel Chandra was servant of Bank, not independent contractor: monthly salary, termination forthwith in certain cases, duties as directed, liability for losses.",
      "supporting_facts": [
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Agreement shows Sheel Chandra carrying on business: supplying Cash Department Staff for consideration, guaranteeing fidelity (insurance), payments for supplying staff categories, terminable by notice, arbitration, not required to serve personally.",
      "supporting_facts": [
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Emoluments income of HUF as acquired with risk/detriment to family property (security furnished); appointed due to father's role and family security.",
      "supporting_facts": [
        "f5",
        "f2",
        "f10"
      ],
      "legal_basis": "Gokul Chand v. Firm Hukum Chand; CIT v. Kalu Babu Lal Chand"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Agreement creates master-servant relationship, not employer-independent contractor: duties peculiar to Treasurers, Bank control/supervision over Treasurer and staff, integral to Bank's business; guarantees part of duty nature.",
      "addresses_issue": "i1",
      "key_observation": "Test of control/supervision (Dharangadhara Chemical Works); overall effect of agreement."
    },
    {
      "id": "cr2",
      "text": "Emoluments salary of Sheel Chandra individually, not HUF: personal qualifications/experience, no family funds expended for training, mere security furnishing not 'detriment/risk' as in precedents.",
      "addresses_issue": "i2",
      "key_observation": "No outlay/expenditure/detriment to family property; distinguished Gokul Chand, Kalu Babu."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Emoluments are salary assessable under s.7 Income-tax Act, not s.10 as profits/gains of business.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Salary is individual income of Sheel Chandra, not of HUF.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shivanandan Sharma v. Punjab National Bank Ltd.",
      "citation": "1955 1 S.C.R. 1427",
      "treatment": "followed",
      "relevance": "Similar agreement clauses held contract of service, not agency."
    },
    {
      "case_name": "Cassidy v. Ministry of Health",
      "citation": "1951 2 K.B. 343",
      "treatment": "referred",
      "relevance": "Distinction: contract of service integrates into business; contract for services accessory."
    },
    {
      "case_name": "Short v. J. & W. Henderson Ltd.",
      "citation": "62 T.L.R. 427",
      "treatment": "referred",
      "relevance": "Indicia of contract of service: selection, remuneration, control method of work, suspension/dismissal."
    },
    {
      "case_name": "Dharangadhara Chemical Works Ltd. v. State of Saurashtra",
      "citation": "1957 S.C.R. 152",
      "treatment": "followed",
      "relevance": "Test: due control/supervision by employer given nature of work."
    },
    {
      "case_name": "K.P. Bhargava v. Commissioner of Income-tax, U.P.",
      "citation": "1954 26 I.T.R. 489",
      "treatment": "distinguished",
      "relevance": "Different contract terms; guarantee commission agency."
    },
    {
      "case_name": "Lala Jeewan Lal v. Commissioner of Income-tax",
      "citation": "1953 24 I.T.R. 217",
      "treatment": "distinguished",
      "relevance": "Commission agency under Excess Profits Tax Act."
    },
    {
      "case_name": "Commissioner of Income-tax v. Kalu Babu Lal Chand",
      "citation": "1960 1 S.C.R. 320",
      "treatment": "distinguished",
      "relevance": "Karta's MD remuneration from family-financed company business."
    },
    {
      "case_name": "Gokul Chand v. Firm Hukum Chand Nath Mal",
      "citation": "1921 48 I.A. 162",
      "treatment": "distinguished",
      "relevance": "Family funds expended for qualifications; 'risk/detriment' in that context."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s.66(1)",
        "s.7",
        "s.10"
      ],
      "relevance": "Reference to High Court; salary head vs. profits/gains of business."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court judgment and order set aside. Emoluments held salary under s.7, individual income of Sheel Chandra, not HUF income under s.10.",
    "relief_granted": "High Court judgment set aside in favour of appellant.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the Treasurer in the instant case must be held to be a servant of the Bank.\"",
      "speaker": "court",
      "significance": "Core holding on employment relationship."
    },
    {
      "text": "\"mere ability to furnish a substantial security is not the sole or even the main reason for being appointed to such a responsible post.\"",
      "speaker": "court",
      "significance": "Rejects HUF income claim based on security."
    },
    {
      "text": "\"It is difficult to lay down any one test to distinguish the relationship of master and servant from that of an employer and independent contractor.\"",
      "speaker": "court",
      "significance": "Introduces multi-factor analysis."
    }
  ],
  "_case_id": "1960_271",
  "_label": 1,
  "_text_length": 22623,
  "_extracted_at": "2026-02-10T19:55:12.976390"
}