{
  "metadata": {
    "case_name": "Criminal Appeals Nos. 57 and 58 of 1960",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Criminal Appeals Nos. 57 and 58 of 1960",
    "date_of_judgment": "1960-12-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On November 29, 1957, one Sadashiv was murdered in the company yard of his house in village Nimgaon.",
      "type": "material",
      "date": "1957-11-29",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "The four appellants, armed with sticks, went to the house of the deceased, dragged him out of the house and beat him with sticks in the company yard and that as a result of the beating he died on the next day at about 5 p.m. at Bhandara Hospital.",
      "type": "material",
      "date": "1957-11-29",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "After investigation, the police submitted their report to the Magistrate under s. 173 of the Code along with the relevant documents.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "The officer in charge of the police station furnished the appellants with a copy of the report forwarded under sub-s. (1) of s. 173, the First Information Report recorded under s. 154 and all other documents or relevant extracts thereof on which the prosecution proposed to rely, including the statements recorded under sub-s. (3) of s. 161 and also intimated them of the persons the prosecution proposed to examine as its witnesses.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "The Magistrate posted the case for inquiry on February 10, 1958.",
      "type": "procedural",
      "date": "1958-02-10",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On February 10, 1958, the prosecution intimated that it did not intend to examine any witnesses in the Magistrate's Court. On behalf of the appellants no objection was raised to that course.",
      "type": "procedural",
      "date": "1958-02-10",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "The Magistrate adjourned the inquiry to February 12, 1958, as he wanted to consider whether any evidence was necessary to be recorded before commitment.",
      "type": "procedural",
      "date": "1958-02-10",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On February 12, 1958, the Magistrate reexpressed his opinion that no witness need be examined at that stage thereafter, he framed charges against accused appellants under s. 302, read with s. 34, of the Indian Penal Code, and also under s. 448 thereof and committed the appellants to the Sessions Court.",
      "type": "procedural",
      "date": "1958-02-12",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Before the learned Sessions Judge the prosecution led four types of evidence: 1) eye-witnesses, namely, P.Ws. 6, 11, 20 and 25; 2) dying declaration, Ex. P-15, supported by Wss. 18,22 and 19; 3) the identification of the appellants in jail by P.Ws. 20 and 25; and 4) recovery of various articles at the instance of the accused-appellants.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "The defence examined four witnesses.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "The learned Sessions Judge held that the prosecution case had been amply borne out and that the four appellants entered into the house of the deceased and beat him in the manner described by the prosecution witnesses. As no less than 12 contused wounds were inflicted on the deceased, which resulted in the fracture of his ribs and injury to the lung, and as the doctor opined that the death was due to shock and haemorrhage resulting from said fracture, the learned Sessions Judge held that the accused appellants were guilty of murder and convicted them under s.302, read with s. 34, Indian Penal Code, and he further convicted them under s. 448 of the Indian Penal Code for trespassing into the house of the deceased. On these findings the learned Sessions Judge sentenced the appellants to undergo imprisonment for life on the first count and for 3 months rigorous imprisonment on the second count.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The appellants preferred an appeal against their convictions and sentences to the High Court of Bombay at Nagpur.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "The learned Judges of the High Court, on a resurvey of the entire evidence, agreeing with the learned Sessions Judge, accepted the prosecution case, but they held that the appellants were guilty only under s. 304, Part 1, read with s. 34, Indian Penal Code, and in the result they reduced the sentence from life imprisonment to 10 years rigorous imprisonment in regard to appellant 1 and to 7 years rigorous imprisonment in regard to appellants 2 to 4.",
      "type": "material",
      "date": "1958-11-05",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Against the said convictions and sentences, the appellants have preferred, by special leave, appeals to this Court. Criminal Appeal No. 57 of 1960 has been preferred by the first appellant and Criminal Appeal No. 58 of 1960 by appellants 2 to 4.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "The Sessions Court and, on appeal, the High Court have not properly appreciated the evidence and the circumstances of the case in holding that the appellants had committed the offences.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "The trial and conviction of the appellants by the Sessions Court were null and void, as the Magistrate had no jurisdiction to commit the appellants to Sessions without examining witnesses under sub-s. (4) of s. 207A of the Code and that, as the order of committal was without jurisdiction, the defect was not cured either under s. 532 or s. 537 of the Code.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Interpretation of the provisions of s. 207A of the Criminal Procedure Code, particularly sub-s. (4), regarding the Magistrate's duty to examine witnesses before committal in proceedings instituted on a police report.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Sessions Court and, on appeal, the High Court have not properly appreciated the evidence and the circumstances of the case in holding that the appellants had committed the offences.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The trial and conviction of the appellants by the Sessions Court were null and void, as the Magistrate had no jurisdiction to commit the appellants to Sessions without examining witnesses under sub-s. (4) of s. 207A of the Code and that, as the order of committal was without jurisdiction, the defect was not cured either under s. 532 or s. 537 of the Code.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "s. 207A(4), s. 532, s. 537 CrPC"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The first question does not merit any consideration. Both the courts below have carefully considered the evidence adduced by the prosecution as well as the accused-appellants and have accepted the prosecution case. It is a well established practice of this Court not to interfere on questions of fact, particularly when they are concurrent findings, except under exceptional circumstances. We find no such exceptional circumstances in this case. We, therefore, reject the first contention.",
      "addresses_issue": "i1",
      "key_observation": "Concurrent findings of fact not to be interfered with absent exceptional circumstances."
    },
    {
      "id": "cr2",
      "text": "Detailed historical background of committal proceedings and introduction of s. 207A by Act XXVI of 1955 to simplify procedure in police report cases.",
      "addresses_issue": "i3",
      "key_observation": "Distinction between police report cases and others justified by prior thorough inquiry and documents furnished under s. 173."
    },
    {
      "id": "cr3",
      "text": "Under sub-s. (4) of s. 207A, the Magistrate shall take evidence of such eye-witnesses as are produced by the prosecution. The phrase 'if any' emphasizes prosecution may not produce any. Second part gives discretion to examine other witnesses if necessary in interests of justice.",
      "addresses_issue": "i3",
      "key_observation": "Prosecution not bound to produce eye-witnesses; Magistrate examines only those produced."
    },
    {
      "id": "cr4",
      "text": "Words 'other witnesses' mean witnesses other than those produced by prosecution, including eye-witnesses not produced.",
      "addresses_issue": "i3",
      "key_observation": "Discretionary power judicially exercised."
    },
    {
      "id": "cr5",
      "text": "Sub-ss. (6) and (7) do not impose condition precedent of taking evidence; 'when' denotes time, not condition. Harmonious construction avoids conflict.",
      "addresses_issue": "i3",
      "key_observation": "Magistrate can commit/discharge based on s. 173 documents without oral evidence."
    },
    {
      "id": "cr6",
      "text": "Fortified by Macherla Hanumantha Rao v. State of Andhra Pradesh, where Magistrate not obliged to record any evidence.",
      "addresses_issue": "i3",
      "key_observation": "Reasonable classification upheld."
    },
    {
      "id": "cr7",
      "text": "Propositions: 1) Bound to take only produced eye-witnesses. 2) Duty to take others if opinion in interests of justice. 3) Jurisdiction to commit/discharge on documents if no eye-witnesses examined. 4) Judicial discretion reviewable.",
      "addresses_issue": "i3",
      "key_observation": "Magistrate acted within jurisdiction here."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In a proceeding instituted on a police report, the Magistrate is bound to take evidence of only such eye-witnesses as are actually produced by the prosecution in court.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The Magistrate, if he is of opinion that it is in the interest of justice to take evidence, whether of eye-witnesses or others, he has a duty to do so.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "If the Magistrate is not of that opinion and if the prosecution has not examined any eye-witnesses, he has jurisdiction to discharge or commit the accused to sessions on the basis of the documents referred to in s. 173 of the Code.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "The discretion of the Magistrate under sub-s. (4) is a judicial discretion and, therefore, in appropriate cases the order of discharge or committal, as the case may be, is liable to be set aside by a superior court.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "M. Pavalappa v. State of Mysore",
      "citation": "A.I.R. 1957 Mysore 61",
      "treatment": "referred",
      "relevance": "View that prosecution bound to examine all eye-witnesses."
    },
    {
      "case_name": "State v. Andi Betankar",
      "citation": "A.I.R. 1959 Raj. 294",
      "treatment": "referred",
      "relevance": "View that prosecution bound to examine all eye-witnesses."
    },
    {
      "case_name": "Ghisa v. State",
      "citation": "A.I.R. 1960 All. 237",
      "treatment": "referred",
      "relevance": "View that prosecution bound to examine all eye-witnesses."
    },
    {
      "case_name": "Chandu Satyanarayana v. The State",
      "citation": "A.I.R. 1958 Orissa 241",
      "treatment": "referred",
      "relevance": "View that prosecution bound to examine all eye-witnesses."
    },
    {
      "case_name": "State v. Lakshmi Narain",
      "citation": "A.I.R. 1959 A.P.651",
      "treatment": "referred",
      "relevance": "Can discharge/commit on documents if no eye-witnesses produced."
    },
    {
      "case_name": "State of P. v. Satyavir",
      "citation": "A.I.R. 1959 All. 408",
      "treatment": "referred",
      "relevance": "Can discharge/commit on documents if no eye-witnesses produced."
    },
    {
      "case_name": "State v. Yasin",
      "citation": "A.I.R. 1958 All. 861",
      "treatment": "referred",
      "relevance": "Second part empowers examination of any witnesses not produced."
    },
    {
      "case_name": "In re Pedda Amma Muttigadu",
      "citation": "A.I.R. 1958 Cal. 341",
      "treatment": "referred",
      "relevance": "Second part empowers examination of any witnesses not produced."
    },
    {
      "case_name": "A. Ishaque v. The State",
      "citation": "A.I.R. 1959 A.P. 469",
      "treatment": "referred",
      "relevance": "Second part empowers examination of any witnesses not produced."
    },
    {
      "case_name": "Manik Chand v. The State",
      "citation": "A.I.R. 1958 Cal. 324",
      "treatment": "referred",
      "relevance": "Second part empowers examination of any witnesses not produced."
    },
    {
      "case_name": "Macherla Hanumantha Rao v. The State of Andhra Pradesh",
      "citation": "1958 S.C.R. 396",
      "treatment": "followed",
      "relevance": "Magistrate not obliged to record any evidence under s. 207A; reasonable classification."
    }
  ],
  "statutes_cited": [
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "s. 207A",
        "s. 173",
        "s. 154",
        "s. 161",
        "s. 164",
        "s. 288",
        "s. 532",
        "s. 537",
        "s. 251A"
      ],
      "relevance": "Interpretation of committal procedure on police report; Magistrate's power to commit without examining witnesses if none produced."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 302/34",
        "s. 448",
        "s. 304 Part I/34"
      ],
      "relevance": "Charges framed and convictions under these sections."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals challenging the appreciation of evidence and the validity of the committal order under s. 207A CrPC were dismissed. The Supreme Court upheld the concurrent findings on facts and held that the Magistrate had jurisdiction to commit without examining witnesses since none were produced by prosecution, interpreting s. 207A(4) accordingly. Convictions and sentences by High Court stand.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "In a proceeding instituted on a police report, the Magistrate is bound to take evidence of only such eye-witnesses as are actually produced by the prosecution in court.",
      "speaker": "court",
      "significance": "Core holding on interpretation of s. 207A(4) first part."
    },
    {
      "text": "The Magistrate, if he is of opinion that it is in the interest of justice to take evidence, whether of eye-witnesses or others, he has a duty to do so.",
      "speaker": "court",
      "significance": "Explains discretionary power under second part of s. 207A(4)."
    },
    {
      "text": "If the Magistrate is not of that opinion and if the prosecution has not examined any eye-witnesses, he has jurisdiction to discharge or commit the accused to sessions on the basis of the documents referred to in s. 173 of the Code.",
      "speaker": "court",
      "significance": "Affirms jurisdiction without oral evidence."
    },
    {
      "text": "One of the fundamental rules of interpretation is that if the words of a statute are in themselves precise and unambiguous no more is necessary than, to expound those words in their natural and ordinary sense.",
      "speaker": "court",
      "significance": "Principle of statutory interpretation applied."
    }
  ],
  "_case_id": "1960_71",
  "_label": 0,
  "_text_length": 28890,
  "_extracted_at": "2026-02-10T19:52:36.068219"
}