{
  "metadata": {
    "case_name": "Oriental Metal Pressing Works (P) Ltd. & Ors. v. Bhaskar Dadoba Thakoor & Anr.",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": "Civil Appeal No. 10 of 1960",
    "date_of_judgment": "1960-12-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dadoba Tukaram Thakoor carried on a business under the name and style of Oriental Metal Pressing Works.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On May 26, 1955, a private company was incorporated under the name of Oriental Metal Pressing Works Ltd., hereafter called the Company, to take over the aforesaid business.",
      "type": "background",
      "date": "1955-05-26",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On July 7, 1955, Dadoba transferred his business to the Company.",
      "type": "material",
      "date": "1955-07-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On the same date, an agreement was made between Dadoba and the Company by which he was appointed the managing director of the Company for life and was given the power by deed inter vivos or by will or codicil to appoint any person to be a managing director in his place and stead. Regulation 109 of the articles of the Company reproduced these provisions.",
      "type": "material",
      "date": "1955-07-07",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The shareholders of the Company were Dadoba, his brother, the respondent Bhaskar, and his two sons, the appellant Govind and the respondent Harish, of whom the first three were the directors, Dadoba being the managing director.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "This constitution of the Company continued till Dadoba's death on January 14, 1957.",
      "type": "background",
      "date": "1957-01-14",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Dadoba died leaving a will whereby he purported to appoint the appellant Govind the managing director of the Company in his place from the date of his death.",
      "type": "material",
      "date": "1957-01-14",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Shortly after Dadoba's death, disputes arose between the appellant Govind and the respondent Bhaskar.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The appellant Govind was contending that the respondent Bhaskar had ceased to be a director on account of his failure to attend the directors meetings.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Govind also purported to appoint the appellant Bhalchandra as a director.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "The respondent Bhaskar contended that he had not ceased to be a director and challenged the legality of the appointment of the appellant Bhalchandra as a director.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Bhaskar further contended that the appointment of the appellant Govind as the managing director of the Company by the will of Dadoba, was void.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "On November 22, 1957, the respondent Bhaskar filed a suit in the City Civil Court of Bombay against the Company, the appellants Govind and Bhalchandra and the respondent Harish for declarations: (a) the appointment of Govind as managing director void; (b) appointment of Bhalchandra illegal and inoperative; (c) Bhaskar was and continued to be a director.",
      "type": "procedural",
      "date": "1957-11-22",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "The learned Judge of the City Civil Court accepted all the contentions of the respondent Bhaskar and made the declarations claimed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "The Company and the appellants Govind and Bhalchandra appealed to the Bombay High Court in First Appeal No. 540 of 1958.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Judgment and decree dated February 24, 1959, of the Bombay High Court: bench of two judges differed, referred to third, majority dismissed appeal and confirmed decree of City Civil Court. Granted certificate under Art. 133(1)(c).",
      "type": "procedural",
      "date": "1959-02-24",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "While appeal pending in Supreme Court, respondent Bhaskar sold his holding in the Company to appellant Govind and has no further interest in the Company or the appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "No one appeared to contest the appeal in Supreme Court; respondent Harish not interested.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Questions whether Bhaskar continues as director and Bhalchandra legally appointed no longer live issues.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Companies Act, 1956 came into force on April 1, 1956; Dadoba made will and died after that date.",
      "type": "background",
      "date": "1956-04-01",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appointment of Govind as managing director by Dadoba's will is void under s. 312 of the Companies Act, 1956, i.e., whether 'assignment of his office' in s. 312 includes 'appointment' of a successor.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No concession made that appointment by act inter vivos is assignment within s.312; expressly withdraw any such concession.",
      "supporting_facts": [
        "f20"
      ],
      "legal_basis": "s. 312 Companies Act, 1956"
    },
    {
      "id": "pa2",
      "text": "S.312 makes void only assignment (transfer) of office, not appointment of successor.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "s. 312, s. 255 Companies Act, 1956"
    },
    {
      "id": "pa3",
      "text": "Proviso to old s.86B does not imply assignment includes appointment; new Act has s.313 as independent section, no deeming provision.",
      "supporting_facts": [],
      "legal_basis": "s. 86B Companies Act 1913; s. 313 Companies Act 1956"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appointment of Govind as managing director by will void under s.312.",
      "supporting_facts": [
        "f7",
        "f20"
      ],
      "legal_basis": "s. 312 Companies Act, 1956"
    },
    {
      "id": "ra2",
      "text": "Bhaskar had not ceased to be director; Bhalchandra's appointment illegal. (No longer pressed)",
      "supporting_facts": [
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "On plain reading, s.312 voids only assignment (transfer) of office held at time of assignment; 'his' office indicates office currently held, not future appointment to vacancy.",
      "addresses_issue": "i1",
      "key_observation": "Assignment and appointment are wholly different acts; unusual for single word to prohibit both."
    },
    {
      "id": "cr2",
      "text": "S.255 permits articles to provide for appointment of directors otherwise than by company in general meeting, including by a director upon vacancy by death, resignation etc.; appointment by will legal if articles permit.",
      "addresses_issue": "i1",
      "key_observation": "S.312 cannot conflict with s.255; assignment does not include appointment."
    },
    {
      "id": "cr3",
      "text": "Object of Act not to prevent perpetual management, as s.255 permits it in private companies and limited in public; Dadoba held nearly 43% shares, his management not detrimental.",
      "addresses_issue": "i1",
      "key_observation": "High Court view on policy defeated by narrow reading incorrect."
    },
    {
      "id": "cr4",
      "text": "Ss.254, 317 do not imply no perpetual management; s.317 inapplicable to private companies via s.315, permits reappointment.",
      "addresses_issue": "i1",
      "key_observation": "No policy against director appointing successor if articles permit."
    },
    {
      "id": "cr5",
      "text": "Proviso to old s.86B does not extend to make all appointments assignments; rule of construction from proviso does not imply enacting part includes proviso subject; old Act had similar s.83B like new s.255.",
      "addresses_issue": "i1",
      "key_observation": "Cannot derive prohibition from proviso if not in enacting part (citing West Derby case)."
    },
    {
      "id": "cr6",
      "text": "Policy of s.312: Prevent directors appointed by shareholders from assigning office, defeating shareholder choice; but where appointed per articles (like Dadoba), no such policy.",
      "addresses_issue": "i1",
      "key_observation": "Govind's appointment per articles and s.255, not offending s.312."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "'Assignment of his office' in s.312 does not include appointment of successor; appointment by will valid if articles permit and per s.255.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "The Guardians of the Poor of the West Derby Union v. The Metropolitan Life Assurance Society",
      "citation": "1897 A.C. 647, 652",
      "treatment": "followed",
      "relevance": "Cannot derive provisions into enacting part from proviso by implication."
    }
  ],
  "statutes_cited": [
    {
      "name": "Companies Act, 1956",
      "sections": [
        "s. 312",
        "s. 255",
        "s. 313",
        "s. 317",
        "s. 254",
        "s. 315"
      ],
      "relevance": "S.312 voids assignment not appointment; s.255 permits articles power to appoint directors; others on policy."
    },
    {
      "name": "Companies Act, 1913",
      "sections": [
        "s. 86B",
        "s. 83B"
      ],
      "relevance": "Analogous to new s.312; proviso does not imply broader meaning."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 133(1)(c)"
      ],
      "relevance": "Certificate granted for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal allowed on issue of Govind's appointment as managing director: declared valid, set aside lower courts' decisions holding it void. No interference with rest of judgment (issues on Bhaskar and Bhalchandra moot).",
    "relief_granted": "Declaration that appellant Govind validly appointed managing director of the Company.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It does not on the face of it, say that an appointment by a director of another person as the director in his place, would be void.\"",
      "speaker": "court",
      "significance": "Core interpretation of s.312 scope."
    },
    {
      "text": "\"The word 'his' would indicate that the office contemplated was one held by the director at the time of assignment.\"",
      "speaker": "court",
      "significance": "Linguistic reason why assignment ≠ appointment."
    },
    {
      "text": "\"Transfer and appointment are clearly entirely different things... a transfer without the passing of the thing transferred... cannot be conceived.\"",
      "speaker": "court",
      "significance": "Distinguishes concepts, rejects dual meaning."
    },
    {
      "text": "\"I am perfectly clear that if the language of the enacting part of the statute does not contain the provisions which are said to occur in it, you cannot derive these provisions by implication from a proviso.\"",
      "speaker": "court",
      "significance": "Quote from cited precedent on proviso construction."
    },
    {
      "text": "We, therefore, declare that the appellant Govind had been validly appointed the managing director of the Company.",
      "speaker": "court",
      "significance": "Final holding."
    }
  ],
  "_case_id": "1960_282",
  "_label": 1,
  "_text_length": 23901,
  "_extracted_at": "2026-02-10T19:55:20.340839"
}