{
  "metadata": {
    "case_name": "Appellants (brothers) v. Board of Revenue and Collector of Pilibhit",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The two appellants, who are brothers, held agricultural lands in the district of Pilibhit and were liable to pay agricultural income-tax under the U. P. Agricultural Income-tax Act, 1949.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellants sent their returns computing their agricultural income for the assessment years 1948-49 and 1949-50 according to the method provided by clause (b) of sub-section (2) of section 6, that is, on the basis of the gross proceeds of sale of all the produce of the lands under their cultivation, subject to the deductions stated therein.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "For the assessment year 1950-51 the appellants moved the Board of Revenue for permission to change the method of computation to the multiple method provided by clause (a) of sub-section (2) of section 6. The Board of Revenue rejected their applications.",
      "type": "procedural",
      "date": "1950-51 assessment year",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The appellants then moved two writ petitions in the High Court of Allahabad, praying for (1) a writ of mandamus directing the Board of Revenue and the Collector of Pilibhit to issue suitable forms for submitting returns as per clause (a) for 1951-52, and (2) a writ of certiorari quashing the order of the Board refusing permission. The writ petitions were dismissed by the High Court on September 9, 1952.",
      "type": "procedural",
      "date": "1952-09-09",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellants obtained certificates of fitness under article 133(1)(c) of the Constitution and filed two appeals in the Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "During pendency of High Court writs, for 1952-53, appellants again applied for permission to use clause (a) method, which was not granted. They filed two writ petitions under article 32 in Supreme Court praying for mandamus.",
      "type": "procedural",
      "date": "1952-53 assessment year",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "By U.P. Agricultural Income-tax (Amendment) Act, 1953 (U.P. Act XIV of 1953), effective July 1, 1953, the proviso to section 6(1) was deleted and substituted, giving full freedom to choose method each year, but not applicable to 1952-53 assessment.",
      "type": "background",
      "date": "1953-07-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The application to Board was noted by an officer, endorsed by Deputy Secretary with opinion to Senior Member B.V. Bhadkamkar, who approved. Note mentioned multiple method easier but variations sought to reduce tax, administrative difficulties.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the proviso to sub-section (1) of section 6 restricts variation in method of computation only for any one year, or permanently without permission of Board of Revenue.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Board of Revenue applied its mind when refusing permission to vary the method.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the proviso to section 6(1) gives unfettered discretion to Board, capable of discriminatory application violating Article 14.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The restriction imposed by the proviso on variation in the method of computation was limited to any one year and the assessee was at liberty to vary the method in any other year without permission of the Board.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Proviso to s.6(1), U.P. Agricultural Income-tax Act, 1949; scheme like Indian Income-tax Act, 1922 assessing each year"
    },
    {
      "id": "pa2",
      "text": "The Board of Revenue did not apply its mind when it refused permission; Senior Member merely signed the note without indicating reasons.",
      "supporting_facts": [
        "f3",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The proviso gives unfettered discretion to Board with no principles for guidance, capable of discriminatory application violating Article 14.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Article 14, Constitution of India"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The proviso cuts down the unfettered right to choose; once option exercised, no variation without permission of Board of Revenue; no warrant for reading limitation to one year.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Proviso to s.6(1), U.P. Agricultural Income-tax Act, 1949"
    },
    {
      "id": "ra2",
      "text": "Senior officer signing note shows approval; relevant considerations including administrative difficulties were kept in mind.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Agreed with High Court: proviso means once option exercised, no variation without permission; language unqualified, not limited to one year; scheme of s.6 gives initial option but restricts variation; no right to vary after filing return under s.15(4).",
      "addresses_issue": "i1",
      "key_observation": "Proviso must be construed with reference to language and scheme of section 6."
    },
    {
      "id": "cr2",
      "text": "Provisions of Income-tax Act, 1922 (proviso to s.2(11)(i)(a), s.13) have different language and scheme, do not help appellants.",
      "addresses_issue": "i1",
      "key_observation": "Cannot read 'in any one year' into proviso."
    },
    {
      "id": "cr3",
      "text": "Board applied mind: note considered multiple method easier, risk of tax reduction, administrative difficulties; Senior Member's signature shows approval.",
      "addresses_issue": "i2",
      "key_observation": "All relevant considerations kept in mind."
    },
    {
      "id": "cr4",
      "text": "Discretion not discriminatory per se; vested in high authority (Board); s.6 provides guidance (two methods, advantages/disadvantages, administrative difficulties); must act reasonably.",
      "addresses_issue": "i3",
      "key_observation": "Discretionary power not necessarily discriminatory; abuse not assumed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Proviso to s.6(1) requires permission of Board for any variation after initial option exercised; not limited to one year.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Board applied mind in refusing permission.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Proviso not violative of Article 14.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Matajog Dobey v. H. C. Bhari",
      "citation": null,
      "treatment": "referred",
      "relevance": "Discretionary power not necessarily discriminatory if confided to high authority."
    },
    {
      "case_name": "Ram Krishna Dalmia v. Shri Justice S. R. Tendolkar",
      "citation": null,
      "treatment": "referred",
      "relevance": "Abuse of power not easily assumed where discretion to high authority."
    }
  ],
  "statutes_cited": [
    {
      "name": "U. P. Agricultural Income-tax Act, 1949",
      "sections": [
        "Section 2(1)(b)(i,ii,iii)",
        "Section 5",
        "Section 6",
        "Section 15(4)"
      ],
      "relevance": "Governs computation of agricultural income; proviso to s.6(1) restricts variation of method after option exercised."
    },
    {
      "name": "U. P. Agricultural Income-tax (Amendment) Act, 1953 (U.P. Act XIV of 1953)",
      "sections": [
        "Proviso to Section 6(1)"
      ],
      "relevance": "Substituted proviso giving freedom to choose each year, but not applicable to relevant assessments."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 2(11)(i)(a)",
        "Section 13"
      ],
      "relevance": "Distinguished; different language and scheme from U.P. Act s.6 proviso."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14",
        "Article 32",
        "Article 133(1)(c)"
      ],
      "relevance": "Art.14: proviso not violative; Art.32: writ petitions; Art.133: certificates for appeal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals and writ petitions dismissed; High Court correctly construed proviso to s.6(1); Board applied mind; no violation of Art.14; no permission for additional evidence.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"an assessee who has once exercised his option shall not be entitled to vary the method of computation except with the permission of the Board of Revenue.\"",
      "speaker": "court",
      "significance": "Exact language of proviso to s.6(1) central to interpretation."
    },
    {
      "text": "\"The proviso must be construed with reference to the language used and the scheme of section 6.\"",
      "speaker": "court",
      "significance": "Key to rejecting limited-to-one-year interpretation."
    },
    {
      "text": "\"a discretionary power is not necessarily a discriminatory power and that abuse of power is not to be easily assumed where the discretions confided not to a petty official but to a high authority.\"",
      "speaker": "court",
      "significance": "Explains why proviso not violative of Art.14."
    }
  ],
  "_case_id": "1960_161",
  "_label": 0,
  "_text_length": 12807,
  "_extracted_at": "2026-02-10T19:54:07.177992"
}