{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Madhya Pradesh and Bhopal v. Bhopal Textiles Ltd., Bhopal",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": "Civil Appeal No. 755 of 1957",
    "date_of_judgment": "1960-10-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeal by special leave from judgment and order dated March 23, 1955, of the former Nagpur High Court in Misc. Civil Case No. 240 of 1953.",
      "type": "procedural",
      "date": "1955-03-23",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Reference under s. 66(1) of the Indian Income-tax Act, 1922. High Court answered the question in the negative: Whether the proportionate profits on the goods of the value of Rs. 4,10,785 were received or were deemed to be received in British India, in the year of account, by or on behalf of the assessee Company within the meaning of Section 4(1)(a) of the Indian Income-tax Act, 1922.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For the assessment year 1944-45, the Company which was non-resident was treated as resident and ordinarily resident under s. 4(1)(c) of the Income-tax Act.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In the year of account, it had supplied its manufactured articles either to the Government of India or its nominees at Agra, Allahabad and Delhi. Under the orders of the Government, the goods were sent direct to the persons nominated, who made the payment against the goods.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The goods were all sent from Bhopal, and the railway freight and other charges were to be borne by the buyers to whom the railway receipts made out in the name of the company/signees were sent by the Company through the Imperial Bank at Bhopal.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Bhopal Branch sent the railway receipts to branches of the Bank at Agra, Allahabad and Delhi, which collected the amounts due from the buyers, and transmitted them to the Imperial Bank, Bhopal, to the credit of the Company.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On these facts, a total sum of Rs. 4,40,373 was held by the Department to have been received in British India. Of that sum, an amount of Rs. 29,588 which represented the receipts for supplies direct to Government is no longer in dispute. The balance represents the sum of Rs. 4,10,785, which was the subject-matter of the reference.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The contention of the Company that the money was not received in British India was not accepted by the Tribunal. The Tribunal did not decide about the place of accrual.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "High Court held that property in the goods had passed to the buyers under the Indian Sale of Goods Act, 1930, so Imperial Bank of India, Bhopal, must be deemed to have received the railway receipts as agents of the buyers. Branches at Agra, Allahabad and Delhi acted as agents of the buyers when they collected the money and transmitted it to Bhopal branch. Profits not received by assessee in British India; received only when credited at Bhopal, which was not in British India.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Company handed over railway receipt to Imperial Bank at Bhopal along with a covering letter asking the Bank to deliver the railway receipt and the bill to the buyers against payment of the bill amount plus collection charges.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the proportionate profits on the goods of the value of Rs. 4,10,785 were received or were deemed to be received in British India, in the year of account, by or on behalf of the assessee Company within the meaning of Section 4(1)(a) of the Indian Income-tax Act, 1922.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The view of the Tribunal was correct that the income was received at Agra, Allahabad or Delhi from the buyers by the Imperial Bank acting as the agent of the Company.",
      "supporting_facts": [
        "f5",
        "f6",
        "f10"
      ],
      "legal_basis": "Commissioner of Income-tax v. P. M. Rathod and Company"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Railway receipts were made out in the name of the consignee, distinguishing it from CIT v. P.M. Rathod where they were to self.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Commissioner of Income-tax v. P. M. Rathod and Company"
    },
    {
      "id": "ra2",
      "text": "Agreement was that goods were to be sent from Bhopal, and price paid there. Handing over railway receipts to Bank at Bhopal was in furtherance of agreement; money ultimately obtained and handed over at Bhopal.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Need not concern with accrual or passing of property under Sale of Goods Act, as case decided on actual receipt. Doubt whether property passed absolutely to buyers, as railway receipt (document of title) handed to bank with instructions to deliver against payment.",
      "addresses_issue": "i1",
      "key_observation": "Doubt whether right of disposal parted with by Company."
    },
    {
      "id": "cr2",
      "text": "Income received at Agra, Allahabad or Delhi by Imperial Bank as agent of Company, since Company handed over railway receipts asking Bank not to hand over unless payment received. Buyers could not countermand instructions.",
      "addresses_issue": "i1",
      "key_observation": "Bank agent of Company, not buyers."
    },
    {
      "id": "cr3",
      "text": "Ruling in CIT v. P.M. Rathod applies; nothing turns on railway receipts being to consignee vs. self. Document of title remained property of Company till payment.",
      "addresses_issue": "i1",
      "key_observation": "Follows precedent."
    },
    {
      "id": "cr4",
      "text": "Agreement provided payment at Bhopal but departed from; followed mercantile practice of handing receipts to bankers for collection. Payment to agent determines place of receipt, which was British India.",
      "addresses_issue": "i1",
      "key_observation": "Rejects contention of receipt at Bhopal."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Income, profits or gains must be deemed to have been received in the taxable territories (British India).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Answer to the question ought to have been in the affirmative.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax v. P. M. Rathod and Company",
      "citation": "1960 1 S.C.R. 401",
      "treatment": "followed",
      "relevance": "Bank acts as agent of seller when instructed to deliver railway receipts against payment; buyers cannot countermand."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 66(1)",
        "s. 4(1)(a)",
        "s. 4(1)(c)"
      ],
      "relevance": "Reference under s.66(1); taxability if received/deemed received in British India under s.4(1)(a); residency under s.4(1)(c)"
    },
    {
      "name": "Indian Sale of Goods Act, 1930",
      "sections": [],
      "relevance": "High Court analyzed passing of property; Supreme Court doubts application but does not decide"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed. Question referred answered in the affirmative. Income deemed received in British India at Agra, Allahabad or Delhi through bank acting as agent of assessee.",
    "relief_granted": "Reversal of High Court judgment; affirmation of Tribunal's view on receipt in British India",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"This income was received at Agra, Allahabad or Delhi from the buyers by the Imperial Bank acting as the agent of the Company.\"",
      "speaker": "court",
      "significance": "Core holding on place of receipt"
    },
    {
      "text": "\"A railway receipt is a document of title to goods, and, for all purposes, represents the goods.\"",
      "speaker": "court",
      "significance": "Explains why property may not have passed"
    },
    {
      "text": "\"The fact of payment to the agent determines the place where the money can be said to be received by the Company.\"",
      "speaker": "court",
      "significance": "Decides taxability based on agent's location"
    }
  ],
  "_case_id": "1960_112",
  "_label": 1,
  "_text_length": 7697,
  "_extracted_at": "2026-02-10T19:53:07.747376"
}