{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Maharaja Pratapsingh Bahadur of Gidhaur",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 650 of 1957",
    "date_of_judgment": "1960-11-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee, the Maharaja Pratapsingh Bahadur of Gidhaur, had agricultural income from his zamindari for the four assessment years 1944-45 to 1947-48.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In assessing his income to income-tax, the authorities did not include in his assessable income interest received by him on arrears of rent. This was presumably so in view of the decision of the Patna High Court.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "When the Privy Council reversed the view of law taken by the Patna High Court in Commissioner of Income-tax v. Kamakhya Narayan Singh [1948] 16 I.T.R. 325, the Income-tax Officer issued notices under S. 34 of the Indian Income-tax Act for assessing the escaped income.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "These notices were issued on August 8, 1948.",
      "type": "procedural",
      "date": "1948-08-08",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The assessments after the returns were filed, were completed on August 26, 1948.",
      "type": "procedural",
      "date": "1948-08-26",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Before the notices were issued, the Income-tax Officer had not put the matter before the Commissioner for his approval, as the section then did not require it.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Section 34 was amended by the Income-tax and Business Profits Tax Amendment Act, 1948 No. 48 of 1948, which received the assent of the Governor-General on September 8, 1948.",
      "type": "background",
      "date": "1948-09-08",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The amending Act by its first section made ss. 3 to 12 of the amending Act retrospective by providing sections 3 to 12 shall be deemed to have come into force on the 30th day of March, 1948.",
      "type": "background",
      "date": "1948-03-30",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Section 8 of the amending Act substituted a new section in place of s. 34, adding a proviso: Provided that the Income-tax Officer shall not issue a notice under this sub-section unless he has recorded his reasons for doing so and the Commissioner is satisfied on such reasons that it is a fit case for the issue of such notice.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The appeals filed by the assessee were disposed of on September 14 and 15, 1951, by the Appellate Assistant Commissioner, before whom no question as regards the validity of the notices under s. 34 was raised.",
      "type": "procedural",
      "date": "1951-09-14",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The question of the validity of the notices without the approval of the Commissioner appears to have been raised before the Tribunal for the first time.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "In that appeal, the Accountant Member and the Judicial Member differed, one holding that the notices were invalid and the other, to the contrary. The President agreed with the Accountant Member that the notices were invalid, and the assessments were ordered to be set aside.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The Tribunal then stated a case and raised and referred the two questions: Whether in the circumstances of the case assessment proceedings were validly initiated under s. 34 of the Indian Income-tax Act? If so, whether in the circumstances of the case the amount received from interest on arrears of agricultural rent was rightly included in the income of the assessee?",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The High Court at Patna answered the two questions in the negative.",
      "type": "procedural",
      "date": "1956-07-13",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appeal to Supreme Court with certificate from High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in the circumstances of the case assessment proceedings were validly initiated under s. 34 of the Indian Income-tax Act?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "If so, whether in the circumstances of the case the amount received from interest on arrears of agricultural rent was rightly included in the income of the assessee?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Section 6 of the General Clauses Act, particularly cls. (b) and (c) saved the assessments as well as the notices.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Section 6 General Clauses Act; Lemm v. Mitchell [1912] A.C. 400; Eyre v. Wynn-Mackenzie [1896] 1 Ch. 135; Butcher v. Henderson [1868] L.R. 3 Q.B. 335"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The notices were invalid due to lack of Commissioner's prior approval, as required by the retrospective amendment.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": "Amended Section 34 Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 34, as it stood prior to the amendment Act No. 48 of 1948, did not lay any duty upon the Income-tax Officer to seek the approval of the Commissioner before issuing a notice under s. 34.",
      "addresses_issue": "i1",
      "key_observation": "No prior requirement for approval."
    },
    {
      "id": "cr2",
      "text": "The amending Act made ss. 3 to 12 retrospective from March 30, 1948, substituting new s.34 with proviso requiring Commissioner's satisfaction.",
      "addresses_issue": "i1",
      "key_observation": "Retrospectivity indicates different intention excluding s.6 General Clauses Act."
    },
    {
      "id": "cr3",
      "text": "The notices were issued on August 8, 1948, when on the statute book must be deemed to be existing an enactment enjoining a duty upon the Income-tax Officer to obtain prior approval of the Commissioner, and unless that approval was obtained, the notices could not be issued.",
      "addresses_issue": "i1",
      "key_observation": "Notices thus invalid."
    },
    {
      "id": "cr4",
      "text": "Lemm v. Mitchell distinguished as entirely different; no revival of right exposing to double jeopardy.",
      "addresses_issue": "i1",
      "key_observation": "Precedents not applicable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The notices which were issued were rendered void by the operation of the proviso to the amended s.34 due to retrospectivity from March 30, 1948.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax v. Kamakhya Narayan Singh",
      "citation": "1948 16 I.T.R. 325",
      "treatment": "reversed",
      "relevance": "Patna HC view reversed by Privy Council, leading to escaped income notices"
    },
    {
      "case_name": "Lemm v. Mitchell",
      "citation": "1912 A.C. 400",
      "treatment": "distinguished",
      "relevance": "Cited by petitioner but held entirely different on revival of rights"
    },
    {
      "case_name": "Eyre v. Wynn-Mackenzie",
      "citation": "1896 1 Ch. 135",
      "treatment": "referred",
      "relevance": "Cited by petitioner on General Clauses Act savings"
    },
    {
      "case_name": "Butcher v. Henderson",
      "citation": "1868 L.R. 3 Q. B. 335",
      "treatment": "referred",
      "relevance": "Cited by petitioner on General Clauses Act savings"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "Section 34",
        "Section 66(1)"
      ],
      "relevance": "Validity of initiation of assessment proceedings for escaped income; reference to High Court"
    },
    {
      "name": "Income-tax and Business Profits Tax Amendment Act, 1948 (No. 48 of 1948)",
      "sections": [
        "Section 1",
        "Section 3 to 12",
        "Section 8"
      ],
      "relevance": "Retrospective amendment of s.34 from March 30, 1948, adding proviso requiring Commissioner's approval"
    },
    {
      "name": "General Clauses Act",
      "sections": [
        "Section 6 (b), (c)"
      ],
      "relevance": "Savings for previous operations, rights etc. upon repeal, but excluded by retrospective intention"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's answer to the questions in the negative, holding the notices under s.34 invalid for lack of Commissioner's prior approval due to retrospective amendment, and the assessments set aside.",
    "relief_granted": "Assessments ordered to be set aside",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The notices were thus invalid.",
      "speaker": "court",
      "significance": "Core holding on validity of notices post-retrospective amendment"
    },
    {
      "text": "the amending Act goes further than this. It repeals the original s. 34, not from the day on which the Act received the assent of the Governor-General but from a stated day, viz., March 30, 1948, and substitutes in its place another section containing the proviso above mentioned.",
      "speaker": "court",
      "significance": "Explains why s.6 General Clauses Act does not apply"
    }
  ],
  "_case_id": "1960_239",
  "_label": 0,
  "_text_length": 6609,
  "_extracted_at": "2026-02-10T19:54:41.667088"
}