{
  "metadata": {
    "case_name": "Appellant Company v. Income-tax Authorities",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": "Civil Appeal No. 26 of 1956",
    "date_of_judgment": "1960-08-31"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a private limited Company, which was incorporated in 1945 in the former Kotah State.",
      "type": "background",
      "date": "1945",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Income-tax authorities sought to tax the appellant's profits and income for the assessment year 1950-51 corresponding to the previous year 1949-50.",
      "type": "material",
      "date": "1950-51",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Prior to the integration of Kotah State into the United State of Rajasthan in 1949, there was no income-tax law in force in Kotah State.",
      "type": "background",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Till the formation of the State of Rajasthan, there was no such law in force in any part of Rajasthan, except Bundi State.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Indian Finance Act of 1950 made the Indian Income-tax Act, 1922, applicable to the whole of India, except the State of Jammu and Kashmir, and suitably amended the Indian Income-tax Act. Rajasthan then became, from April 1, 1950, a taxable territory.",
      "type": "procedural",
      "date": "1950-04-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "One Madan Gopal Kabra moved the High Court under Art. 226 of the Constitution to restrain the taxing authorities from claiming tax for the period prior to April 1, 1950, contending that Rajasthan was not a taxable territory before that date. The High Court accepted this, but this Court in Union of India v. Madan Gopal Kabra held that the tax was leviable.",
      "type": "procedural",
      "date": "1954",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The present appellant and fourteen others filed petitions under Art. 226 of the Constitution, urging that s. 14(2)(c) of the Indian Income-tax Act, as it stood on April 1, 1950, granted an exemption, and that this exemption was not affected by the amendment of the said provision in 1953 even though retrospective from April 1, 1950, unless the Finance Act, 1950 was also amended.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The Rajasthan High Court dismissed the petition dated April 22, 1954, holding inter alia that this point was also decided by this Court against Madan Gopal Kabra.",
      "type": "procedural",
      "date": "1954-04-22",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the exemption under s.14(2)(c) of the Indian Income-tax Act, 1922 as it stood before the 1953 amendment applied to the assessment year 1950-51, or whether the retrospective amendment from April 1, 1950 abrogated the exemption.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Indian Finance Act, 1950 incorporated the Income-tax Act by reference such that subsequent amendments to the Income-tax Act do not apply unless the Finance Act is also amended.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The exemption under s.14(2)(c) stood good even after the 1953 amendment.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "s.14(2)(c) Indian Income-tax Act, 1922 (pre-1953)"
    },
    {
      "id": "pa2",
      "text": "The Indian Finance Act, 1950 incorporated the Indian Income-tax Act by reference, so subsequent amendments have no effect unless Finance Act also amended.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Indian Finance Act, 1950"
    },
    {
      "id": "pa3",
      "text": "The amendment operates from April 1, 1950, and income accrued prior to that date was still exempt.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s.14(2)(c) Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The point was already decided against the petitioners in Union of India v. Madan Gopal Kabra.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "Union of India v. Madan Gopal Kabra (1954 SCR 541)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The exemption is in respect of liability to tax in any year of assessment, and the exemption in the assessment year 1950-51 was in regard to the income in the previous year. The withdrawal of the exemption in 1950-51 adversely affected the income of 1949-50.",
      "addresses_issue": "i1",
      "key_observation": "Exemption relates to assessment year, not accrual date."
    },
    {
      "id": "cr2",
      "text": "The Indian Finance Act, 1950 applied the Income-tax Act but did not incorporate it by reference. Parliament was competent to amend retrospectively, making the exemption disappear as if never granted.",
      "addresses_issue": "i2",
      "key_observation": "No incorporation by reference; application made Rajasthan taxable territory subject to amendments."
    },
    {
      "id": "cr3",
      "text": "The fiction in the amendment obliterates the exemption with no saving clause.",
      "addresses_issue": "i1",
      "key_observation": "Purpose of amendment was to abrogate exemption from 1950-51."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The 1953 amendment to s.14(2)(c) abrogated the exemption with effect from April 1, 1950, applicable to assessment year 1950-51.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Indian Finance Act, 1950 did not incorporate Income-tax Act by reference; subsequent amendments apply.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Union of India v. Madan Gopal Kabra",
      "citation": "1954 S.C.R. 541",
      "treatment": "followed",
      "relevance": "Held tax leviable for periods prior to April 1, 1950 in Rajasthan; exemption under s.14(2)(c) abrogated from April 1, 1950 except for J&K."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s.14(2)(c)"
      ],
      "relevance": "Provided exemption for income accruing in Part B States unless received in taxable territories; amended retrospectively from 1950-04-01 to substitute 'Part B State' with 'State of Jammu and Kashmir', abrogating exemption."
    },
    {
      "name": "Indian Finance Act, 1950",
      "sections": [],
      "relevance": "Applied Income-tax Act to whole of India except J&K, making Rajasthan taxable territory from 1950-04-01."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Basis for writ petitions in High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The retrospective amendment to s.14(2)(c) abrogated the exemption for the assessment year 1950-51, and arguments regarding incorporation by reference are rejected.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The fiction in the amendment made the exemption to disappear as if it had never been granted, and unless there was a saving, the amendment must operate to obliterate the exemption.",
      "speaker": "court",
      "significance": "Explains effect of retrospective amendment on prior exemption."
    },
    {
      "text": "By that Act, the Indian Income-tax Act was applied, but the Income-tax Act was not incorporated by reference in the Indian Finance Act to become a part of it.",
      "speaker": "court",
      "significance": "Rejects incorporation by reference argument."
    }
  ],
  "_case_id": "1960_104",
  "_label": 0,
  "_text_length": 7662,
  "_extracted_at": "2026-02-10T19:52:28.773851"
}