{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. The Respondent (Assessee)",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Civil Appeal No. 419 of 1958",
    "date_of_judgment": "1960-11-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is an association of persons whose business is to hold race meetings in Calcutta on a commercial basis. It holds two series of race meetings during the two seasons of the year.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent does not own any horses and therefore does not employ jockeys but they are employed by owners and trainers of horses which are run in the races.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "It is a matter of some importance to the respondent that there should be jockeys available to the owners with sufficient skill and experience because the success of races to a considerable extent depends upon the experience and skill of a jockey who rides a horse in a race.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Because it was of the opinion that there was a risk of the jockeys becoming unavailable and that such unavailability would seriously affect its business which might result in its closing down the business, the respondent considered it expedient to remedy that defect.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In 1948, it established a school for the training of Indian boys as jockeys so that after their training they might be available for purposes of race meetings held under its auspices.",
      "type": "material",
      "date": "1948",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The school, however, did not prove a success and after having been in existence for three years it was closed down.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "During the year ending March 31, 1949, the respondent spent a sum of Rs. 62,818 on the running of its school and claimed that amount as a deduction under s. 10(2)(xv) of the Income-tax Act and also in the assessment under the Business Profits Tax for the chargeable accounting period ending March 31, 1949.",
      "type": "material",
      "date": "1949-03-31",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "This claim was disallowed by the Income Tax Officer and on appeal by Appellate Assistant Commissioner and also by the Income-tax Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "At the instance of the respondent the question was referred to the High Court under s. 66(1) of the Income-tax Act and was answered in favour of the respondent.",
      "type": "procedural",
      "date": "1957-08-20",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The Tribunal found that it was not the business of the respondent to provide jockeys to owners and trainers, that the jockeys trained in the respondents school were not bound to ride only in the races run by the respondent and that the benefit, if any, which accrued was of an enduring nature.",
      "type": "disputed",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f11",
      "text": "The respondent had been conducting race meetings since long, that it was not the case of the assessee that if it did not train jockeys they would become unavailable and that the mere policy of producing efficient Indian jockeys was not a sufficient consideration for treating the expenditure as one incurred for the business of the respondent.",
      "type": "disputed",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f12",
      "text": "Before the Appellate Assistant Commissioner, it was contended by the respondent, that the reason for incurring the expenditure was to promote efficient Indian jockeys and it was in the interest of the respondent to see that the races are not abandoned on account of the scarcity of jockeys.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in the facts and circumstances of this case, the Appellate Tribunal was right in holding that Rs. 61,818 spent by the assessee to train Indian boys as jockeys, did not constitute expenses of the business of the assessee allowable under s. 10(2)(xv)?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The question as to whether an item of expenditure is wholly and exclusively laid out for the purposes of business or not is a question of fact.",
      "supporting_facts": [],
      "legal_basis": "Eastern Investments Ltd. v. Commissioner of Income-tax, West Bengal"
    },
    {
      "id": "pa2",
      "text": "The connection between an expenditure and profit-earning of the assessee should be direct and substantial and not remote.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "To be admissible as revenue expenditure it should not be in the nature of a capital expense, i.e., it should not bring into existence an asset of an enduring nature.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The reason for incurring the expenditure was to promote efficient Indian jockeys and it was in the interest of the respondent to see that the races are not abandoned on account of the scarcity of jockeys.",
      "supporting_facts": [
        "f4",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "It was the case of the assessee that unless it trained Indian Jockeys, time may come when there may not be sufficient number of trained jockeys to ride horses in the races conducted by the assessee.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Though the question must be decided on the facts of each case, the final conclusion is one of law.",
      "addresses_issue": "i1",
      "key_observation": "In the present case the Income-tax Appellate Tribunal had misdirected itself as to the true scope and meaning of the words wholly and exclusively laid out for the purpose of the assessees business."
    },
    {
      "id": "cr2",
      "text": "The business of the respondent was to run race meetings on a commercial scale for which it is necessary to have races of as high an order as possible. For the popularity of the races run by the respondent and to make its business profitable it was necessary that there were jockeys of requisite skill and experience in sufficient numbers who would be available to the owners and trainers because without such efficient jockeys the running of race meetings would not be commercially profitable.",
      "addresses_issue": "i1",
      "key_observation": "Any expenditure which was incurred for preventing the extinction of the respondents business would, in our opinion, be expenditure wholly and exclusively laid out for the purpose of the business of the assessee and would be an allowable deduction."
    },
    {
      "id": "cr3",
      "text": "In order to justify a deduction the disbursement must be for reasons of commercial expediency it may be voluntary but incurred for the assessees business and if the expense is incurred for the purpose of the business of the assessee it does not matter that the payment also enures to the benefit of a third party.",
      "addresses_issue": "i1",
      "key_observation": "Another test is whether the transaction is properly entered into as a part of the assessees legitimate commercial undertaking in order to facilitate the carrying on of its business and it is immaterial that a third party also benefits thereby."
    },
    {
      "id": "cr4",
      "text": "There is no substance in the submission that the expenditure was in the nature of a capital expense because no asset of enduring nature was being created by this expense.",
      "addresses_issue": "i1",
      "key_observation": "The High Court has rightly held that the expenditure claimed was one which was wholly and exclusively laid out for the purpose of the respondents business. It was to prevent the threatened extinction of the business of the respondent."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The amount in dispute was laid out wholly and exclusively for the purpose of the respondents business because if the supply of jockeys of efficiency and skill failed the business of the respondent would no longer be possible. Thus the money was spent for the preservation of the respondents business.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The expenditure claimed was one which was wholly and exclusively laid out for the purpose of the respondents business.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Eastern Investments Ltd. v. Commissioner of Income-tax, West Bengal",
      "citation": "1951 S.C.R. 594",
      "treatment": "followed",
      "relevance": "Though the question must be decided on the facts of each case, the final conclusion is one of law."
    },
    {
      "case_name": "Commissioner of Income Tax v. Chandulal Keshavlal Co.",
      "citation": "1960 38 I.T.R. 601",
      "treatment": "followed",
      "relevance": "Test whether transaction properly entered into as part of assessees legitimate commercial undertaking; commercial expediency."
    },
    {
      "case_name": "British Insulated and Helsby Cables v. Atherton",
      "citation": "1926 A.C. 205",
      "treatment": "followed",
      "relevance": "Expenditure voluntarily on ground of commercial expediency to facilitate carrying on of business."
    },
    {
      "case_name": "Morgan v. Tate Lyle Ltd.",
      "citation": "1955 A.C. 21",
      "treatment": "followed",
      "relevance": "Expenditure to preserve assets and enable carrying on business is deductible."
    },
    {
      "case_name": "Strong Co. v. Woodifield",
      "citation": "1906 A.C. 448",
      "treatment": "referred",
      "relevance": "Observations of Lord Davey."
    },
    {
      "case_name": "Smith v. Incorporated Council of Law Reporting",
      "citation": "1914 3 K.B. 674",
      "treatment": "referred",
      "relevance": "Supporting preservation of business."
    },
    {
      "case_name": "Ward Co. Ltd. v. Commissioner of Taxes",
      "citation": "1923 A.C. 145",
      "treatment": "distinguished",
      "relevance": "Different statute with restrictive words."
    },
    {
      "case_name": "Boarland v. Kramat Pulai Ltd.",
      "citation": "1953 2 All E.R. 1122",
      "treatment": "distinguished",
      "relevance": "Expenditure not wholly for trade purpose."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "s. 66(1)",
        "s. 10(2)(xv)"
      ],
      "relevance": "Reference by Tribunal; allowability of expenditure as business expense."
    },
    {
      "name": "Business Profits Tax Act",
      "sections": [],
      "relevance": "Claim disallowed; decision consequential on Income-tax Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the judgment of the Calcutta High Court is dismissed. The High Court rightly held that the expenditure of Rs. 61,818/Rs. 62,818 on training jockeys was wholly and exclusively laid out for the purpose of the assessee's business and allowable under s. 10(2)(xv).",
    "relief_granted": "Deduction allowed to assessee respondent.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Any expenditure which was incurred for preventing the extinction of the respondents business would, in our opinion, be expenditure wholly and exclusively laid out for the purpose of the business of the assessee and would be an allowable deduction.\"",
      "speaker": "court",
      "significance": "Core holding on allowability of expenditure for business preservation."
    },
    {
      "text": "\"If the supply of jockeys of efficiency and skill failed the business of the respondent would no longer be possible. Thus the money was spent for the preservation of the respondents business.\"",
      "speaker": "court",
      "significance": "Explains nexus between expenditure and business necessity."
    },
    {
      "text": "\"Another test is whether the transaction is properly entered into as a part of the assessees legitimate commercial undertaking in order to facilitate the carrying on of its business and it is immaterial that a third party also benefits thereby.\"",
      "speaker": "court",
      "significance": "Test for commercial expediency from precedent."
    }
  ],
  "_case_id": "1960_167",
  "_label": 0,
  "_text_length": 13177,
  "_extracted_at": "2026-02-10T19:54:12.770483"
}