{
  "metadata": {
    "case_name": "Appellants (Rubber Plantation Company) v. Respondents (Agricultural Income-tax Authorities)",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Civil Appeals Nos. 290 to 292 of 1959",
    "date_of_judgment": "1960-12-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeals by special leave against judgment and order dated December 6, 1957, of the Kerala High Court in Agricultural Income-tax Referred Cases Nos. 15, 18 and 19 of 1955.",
      "type": "procedural",
      "date": "1957-12-06",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In Reference No. 15 of 1955 (accounting year 1952, assessment year 1953-54), area under cultivation 3453.65 acres, of which 2967.91 acres mature yielding trees and 485.74 acres immature rubber trees; expenditure on maintenance of immature trees Rs. 42,660-4-1; claim rejected by Agricultural Income-tax Tribunal; reference at instance of appellant.",
      "type": "material",
      "date": "1952",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In Reference No. 18 of 1955 (accounting year 1950, assessment year 1951-52), area under cultivation 3558.84 acres, of which 334.64 acres immature rubber trees and 3224.20 acres mature yielding trees; expenditure on upkeep of immature portion Rs. 19,056-0-9 allowed by Tribunal; reference at instance of respondent.",
      "type": "material",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In Reference No. 19 of 1955 (accounting year 1951, assessment year 1952-53), area under cultivation 3426.55 acres, of which 3091.91 acres mature yielding trees and 334.64 acres immature rubber trees; expenditure on upkeep of immature portion Rs. 59,271-9-5 allowed by Tribunal; reference at instance of respondent.",
      "type": "material",
      "date": "1951",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "High Court answered all questions in the negative and against the appellant.",
      "type": "procedural",
      "date": "1957-12-06",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellants have rubber plantations containing both mature yielding rubber trees and immature rubber plants.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Rubber trees do not yield any rubber until they are about six years old.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether under the Travancore-Cochin Agricultural Income Tax Act, 1950 in calculating the assessable agricultural income of a rubber estate containing both mature yielding rubber trees and immature rubber plants which have not come into bearing, the annual expenses incurred for the upkeep and maintenance of such immature rubber plants are a permissible deduction under s. 5(j), and specifically whether sums like Rs. 42,660-4-1 (1952), Rs. 19,056-0-9 (1950), Rs. 59,271-9-5 (1951) may be deducted.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The amount expended for the upkeep and maintenance of immature rubber trees is a permissible deduction under s. 5(j) of the Act as it was wholly and exclusively laid out for the purpose of deriving the agricultural income.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f6",
        "f7"
      ],
      "legal_basis": "Section 5(j) of Travancore-Cochin Agricultural Income Tax Act, 1950"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Amounts spent on upkeep and maintenance of immature rubber plants were not laid out or expended for the purpose of deriving the agricultural income of the accounting year concerned, as agricultural income means income obtained in that year.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Section 5(j) of Travancore-Cochin Agricultural Income Tax Act, 1950; Assam Bengal Cement Co. Ltd. v. Commissioner of Income-tax"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court erred in holding that expenditure on immature rubber plants was not for 'the' agricultural income of the accounting year; the definite article does not limit deduction to income-yielding trees of that year; expenditure was wholly and exclusively for deriving agricultural income.",
      "addresses_issue": "i1",
      "key_observation": "In a rubber estate, upkeep of immature trees is necessary for future income from the estate as a whole."
    },
    {
      "id": "cr2",
      "text": "Vallambrosa Rubber Co. Ltd. v. Farmer allowed similar expenditure on non-yielding portion of estate under English Income-tax Act.",
      "addresses_issue": "i1",
      "key_observation": "Expenditure on whole estate deductible against profits, not just yielding portion."
    },
    {
      "id": "cr3",
      "text": "Assam Bengal Cement Co. Ltd. v. Commissioner of Income-tax distinguished: that case concerned capital expenditure for acquiring asset of enduring nature, not operational expenses like upkeep of immature trees.",
      "addresses_issue": "i1",
      "key_observation": "Upkeep expenses are revenue, not capital."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Amount expended on superintendence, weeding etc. of the whole estate, including immature rubber trees, is deductible under s. 5(j) against profits earned, even if immature trees produce no return in that year.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Vallambrosa Rubber Co. Ltd. v. Farmer",
      "citation": "(1910) 5 T.C. 529",
      "treatment": "followed",
      "relevance": "Allowed deduction of expenditure on upkeep of non-yielding rubber trees against income from yielding portion."
    },
    {
      "case_name": "Assam Bengal Cement Co. Ltd. v. The Commissioner of Income-tax, West Bengal",
      "citation": "1955 1 S.C.R. 972",
      "treatment": "distinguished",
      "relevance": "Concerned capital vs. revenue expenditure for acquiring lease; not applicable to operational upkeep expenses."
    }
  ],
  "statutes_cited": [
    {
      "name": "Travancore-Cochin Agricultural Income Tax Act, 1950",
      "sections": [
        "s. 3",
        "s. 5",
        "s. 5(j)",
        "s. 60(1)"
      ],
      "relevance": "s.3 charging section; s.5 computation of agricultural income allowing deductions wholly and exclusively for purpose of deriving agricultural income (not capital or personal); s.60(1) for references to High Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; judgments and orders of High Court set aside; questions in all three references answered in favour of appellant; appellant entitled to costs in this Court and High Court.",
    "relief_granted": "Deduction of expenditure on upkeep of immature rubber trees allowed; references answered in favour of assessee.",
    "costs": "Appellant to have costs in this Court and the High Court."
  },
  "key_quotes": [
    {
      "text": "\"We find it impossible to say that the amounts spent on the upkeep and maintenance of the immature rubber plants were laid out or expended for the purpose of deriving the agricultural income, much less that they were laid out or expended wholly and exclusively for that purpose.\"",
      "speaker": "lower_court",
      "significance": "High Court's erroneous view rejected by Supreme Court."
    },
    {
      "text": "\"The agricultural income, in the context, can only mean the agricultural income obtained in the accounting year concerned and not the agricultural income of any other period.\"",
      "speaker": "lower_court",
      "significance": "Interpretation of 'the agricultural income' in s.5(j) corrected by Supreme Court."
    },
    {
      "text": "\"It is not denied that the expenditure claimed as a deduction was wholly and exclusively laid out for the purpose of deriving income but the use of the definite article 'the' before agricultural income has given rise to the interpretation...\"",
      "speaker": "court",
      "significance": "Supreme Court's clarification on scope of deduction under s.5(j)."
    },
    {
      "text": "\"...the amount expended on the superintendence, weeding etc. of the whole estate should have been allowed against the profits earned and it is no answer to the claim for a deduction that part of those expenses produced no return in that year...\"",
      "speaker": "court",
      "significance": "Core holding allowing deduction for entire estate."
    }
  ],
  "_case_id": "1960_73",
  "_label": 1,
  "_text_length": 8504,
  "_extracted_at": "2026-02-10T19:52:28.979696"
}