{
  "metadata": {
    "case_name": "Appellant v. State of Bombay",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "IMAM, J."
    ],
    "case_number": "Criminal Appeal No. 14 of 1959",
    "date_of_judgment": "1960-02-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant convicted under s. 304, Part I of the Indian Penal Code by Sessions Judge, Sorath Division, Junagadh, in Sessions Case No. 26 of 1957, and sentenced to imprisonment for life.",
      "type": "procedural",
      "date": "1957-08-31",
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "Appellant appealed to Bombay High Court at Rajkot in Criminal Appeal No. 137 of 1957; appeal admitted only on the point of sentence and sentence reduced from life imprisonment to 10 years rigorous imprisonment.",
      "type": "procedural",
      "date": "1957-11-19",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Prosecution case: Appellant caused death of Zina Hira on April 6, 1957, while deceased was returning from adjoining village; appellant accused him of theft in appellant's house, deceased denied, appellant attacked with stick having iron rings, multiple blows caused fall; doctor called from Keshod (8 miles), deceased taken to Junagadh but died on way early morning April 7.",
      "type": "material",
      "date": "1957-04-06",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Appellant pleaded not guilty, stated he was not present at scene of crime.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Eye-witness Bava Tapu saw assault, related to deceased (denied initially), informed Police Patel Keshav immediately after; Keshav corroborated, also by Natha Jiwa and Bogha Jiwa; no real motive to depose falsely.",
      "type": "material",
      "date": "1957-04-06",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Dying declaration of deceased naming appellant as assailant.",
      "type": "material",
      "date": "1957-04-07",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Recovery of stick buried underground at instance of appellant, stained with human blood per Serologist report; identified by Bava Tapu as appellant's.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "First Information by Keshav; inquired from Bava Tapu how quarrel started; no mention of theft accusation.",
      "type": "background",
      "date": "1957-04-06",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "No information of theft lodged by appellant at thana per Police Officer Priyakant.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Appellant denied deceased committed theft; brother Karsan (prosecution witness, declared hostile) stated no theft in house.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Supreme Court appeal by special leave; heard on merits after finding High Court procedure invalid.",
      "type": "procedural",
      "date": "1960-02-26",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court could admit the appeal only on the point of sentence without hearing on merits of conviction.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the evidence was sufficient to sustain conviction under s. 304 Part I IPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court could not, in law, admit appeal only on point of sentence; entitled to hearing on merits of conviction as evidence unsatisfactory, deserves acquittal.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "ss. 421 and 422 CrPC; Nafar Sheikh v. Emperor (1914 ILR 41 Cal. 606), Gaya Singh v. King Emperor (1925 ILR 4 Pat. 254), Sudhir Kumar Neogi v. Emperor (AIR 1942 Pat 46), Sheikh Rijhu v. Emperor (AIR 1931 Pat 351), Kuldip Das v. King Emperor (1932 ILR 11 Pat. 697), Bai Dhankor v. Emperor (1937 ILR Bom 365)"
    },
    {
      "id": "pa2",
      "text": "Motive of theft accusation doubtful as not in FIR, no theft report at thana, appellant and brother deny theft.",
      "supporting_facts": [
        "f8",
        "f9",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Privy Council in Dahu Raut distinguishable as notices under s.422 issued and record called under s.423; Appellate Court can hear only on sentence.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "The King-Emperor v. Dahu Raut (1935 LR 62 IA 129); s.423 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "ss.421-422 CrPC do not permit partial admission/hearing only on sentence; either summarily dismiss full appeal or issue notice and hear fully; High Court order admitting only on sentence invalid.",
      "addresses_issue": "i1",
      "key_observation": "No power to direct appeal heard only on point of sentence; follows Privy Council in Dahu Raut."
    },
    {
      "id": "cr2",
      "text": "Instead of remanding, Supreme Court heard on merits; evidence amply proves case: eye-witness Bava Tapu reliable (corroborated by Keshav, Natha Jiwa, Bogha Jiwa), dying declaration genuine, blood-stained stick recovered.",
      "addresses_issue": "i2",
      "key_observation": "Omission of theft motive in FIR minor; even without clear motive, direct evidence clear; no reason to distrust witnesses."
    },
    {
      "id": "cr3",
      "text": "Appellant guilty at least under s.304 IPC as found by trial court.",
      "addresses_issue": "i2",
      "key_observation": "Evidence establishes beyond doubt appellant struck multiple blows causing death."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellate Court cannot admit/hear appeal only on sentence; must hear full appeal on conviction and sentence if not summarily dismissed.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Evidence sufficient to convict under s.304 Part I IPC.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Nafar Sheikh v. Emperor",
      "citation": "1914 I.L.R. 41 Cal. 606",
      "treatment": "followed",
      "relevance": "On interpretation of ss.421-422 CrPC"
    },
    {
      "case_name": "Gaya Singh v. King Emperor",
      "citation": "1925 I.L.R. 4 Pat. 254",
      "treatment": "followed",
      "relevance": "On interpretation of ss.421-422 CrPC"
    },
    {
      "case_name": "Sudhir Kumar Neogi and Another v. Emperor",
      "citation": "A.I.R. 1942 Pat 46",
      "treatment": "followed",
      "relevance": "On interpretation of ss.421-422 CrPC"
    },
    {
      "case_name": "Sheikh Rijhu and Others v. Emperor",
      "citation": "A.I.R. 1931 Pat. 351",
      "treatment": "followed",
      "relevance": "On interpretation of ss.421-422 CrPC"
    },
    {
      "case_name": "The King-Emperor v. Dahu Raut",
      "citation": "1935 L.R. 62 I.A. 129",
      "treatment": "followed",
      "relevance": "Excludes partial summary dismissal; notices under s.422 and record under s.423 peremptory"
    },
    {
      "case_name": "Kuldip Das v. King Emperor",
      "citation": "1932 I.L.R. 11 Pat. 697",
      "treatment": "referred",
      "relevance": "Patna HC view pre-Dahu Raut, not necessary to consider"
    },
    {
      "case_name": "Bai Dhankor v. Emperor",
      "citation": "1937 I.L.R. Bom 365",
      "treatment": "distinguished",
      "relevance": "Bombay HC attempted resolution for sentence-only but not applicable here"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "304 Part I"
      ],
      "relevance": "Conviction for culpable homicide not amounting to murder"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "418",
        "419",
        "421",
        "422",
        "423"
      ],
      "relevance": "Governs appellate procedure: summary dismissal or full hearing; power to reduce sentence only after full hearing"
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "High Court procedure of admitting appeal only on sentence held invalid; Supreme Court heard appeal on merits and confirmed conviction under s.304 IPC, upholding guilt though not explicitly altering sentence.",
    "relief_granted": "None; conviction upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"When an appeal is filed it is an appeal against conviction and sentence and it is not permissible for an Appellate Court to direct that it shall be heard only on the question of sentence.\"",
      "speaker": "court",
      "significance": "Core holding on appellate powers under CrPC"
    },
    {
      "text": "\"The terms of the section equally exclude the possibility of partial summary dismissal, e.g., in so far as the conviction is appealed against.\"",
      "speaker": "court",
      "significance": "Quoting Privy Council in Dahu Raut on no partial hearing"
    },
    {
      "text": "\"It is clear, therefore, that the evidence in the case which we have carefully examined and see no good reason to distrust, established beyond doubt that the appellant had struck the deceased several blows with a stick and thus caused his death.\"",
      "speaker": "court",
      "significance": "Confirms sufficiency of evidence for conviction"
    }
  ],
  "_case_id": "1960_219",
  "_label": 0,
  "_text_length": 15594,
  "_extracted_at": "2026-02-10T19:54:39.400300"
}