{
  "metadata": {
    "case_name": "Appellant (Defendant No. 1) v. Sridhar (Plaintiff/Respondent No. 1) and others",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Appeal by special leave against Second Appeal No. 1720 of 1945 (High Court at Nagpur)",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On April 10, 1943, D. B. Ghaisas and his mother Ramabai entered into two contracts of sale with the appellant: one for Survey Nos. 5, 14 and 16 for Rs. 10,000 (Rs. 2,000 earnest money paid), the other for Survey No. 15/1 for Rs. 8,500 (Rs. 500 earnest money paid).",
      "type": "background",
      "date": "1943-04-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On April 16, 1943, the vendors executed a registered sale deed for Survey Nos. 5, 14 and 16, and the balance of the price was paid before the Registrar.",
      "type": "background",
      "date": "1943-04-16",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On April 22, 1943, the vendors executed a lease of Survey No. 15/1 for 14 years in favour of Kisanlal and Sitaram (defendant Nos. 2 and 3, respondents Nos. 2 and 3).",
      "type": "background",
      "date": "1943-04-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On April 24, 1943, the vendors executed a fresh agreement of sale in respect of Survey No. 15/1, to be diverted to non-agricultural purposes, after which a sale deed was to be executed; appellant to pay costs of diversion and premium.",
      "type": "background",
      "date": "1943-04-24",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On August 12, 1943, the vendors applied to the Deputy Commissioner, Akola, for diversion under s. 58 of the Berar Land Revenue Code.",
      "type": "procedural",
      "date": "1943-08-12",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On January 22, 1944, sanction for diversion was accorded subject to payment of premium of Rs. 9,222 and other conditions; appellant claims paid and deposited via Challan No. 68, but no finding by courts.",
      "type": "procedural",
      "date": "1944-01-22",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On February 1, 1944, the sale deed for Survey No. 15/1 was executed by the vendors in favour of the appellant, consideration Rs. 17,722.",
      "type": "material",
      "date": "1944-02-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent Sridhar, owner of adjacent Survey No. 15/2, brought suit for pre-emption on September 11, 1943, alleging contracts of April 10 and 24, 1943 constituted a sale subject to his occupancy right under Ch. XIV Berar Land Revenue Code; alleged price not fixed in good faith.",
      "type": "disputed",
      "date": "1943-09-11",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Trial court and District Judge held Sridhar entitled to pre-empt, fixed fair consideration at Rs. 3,306, decreed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court in Second Appeal No. 1720 of 1945 confirmed decree, held transaction was a sale subject to pre-emption, failure to execute registered deed was subterfuge, diversion proceedings pendente lite, order conditional so land not irrevocably diverted.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant filed appeal by special leave to Supreme Court against High Court judgment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a right of pre-emption had accrued to respondent Sridhar under Ch. XIV of the Berar Land Revenue Code based on contracts dated April 10 and 24, 1943, prior to execution of registered sale deed on February 1, 1944.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether 'sale' under s. 176 of the Berar Land Revenue Code has wider connotation than under s. 54 TPA, allowing pre-emption on mere contract without registered deed.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether delaying registration of sale deed to defeat pre-emption constitutes fraud.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No sale until registered deed executed on February 1, 1944; contracts created no interest or title under s. 54 TPA; suit premature as no pre-emptible transfer occurred.",
      "supporting_facts": [
        "f1",
        "f4",
        "f7",
        "f8"
      ],
      "legal_basis": "Transfer of Property Act s. 54; Registration Act ss. 17, 49"
    },
    {
      "id": "pa2",
      "text": "TPA applies in Berar since 1907, overrides personal laws; no title passes without registration for immovable property over Rs. 100.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "TPA s. 54; Berar Land Revenue Code Ch. XIV"
    },
    {
      "id": "pa3",
      "text": "No fraud in legitimate means to avoid pre-emption, such as delaying completion of sale until diversion.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Bishan Singh v. Khazan Singh (1959 S.C.R. 878)"
    },
    {
      "id": "pa4",
      "text": "If suit based on Feb 1 sale, defence of non-agricultural diversion would apply, negating pre-emption right.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Berar Land Revenue Code s. 58"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Transactions of April 10 and 24, 1943 constituted a sale subject to pre-emption; price not fixed in good faith.",
      "supporting_facts": [
        "f1",
        "f4",
        "f8"
      ],
      "legal_basis": "Berar Land Revenue Code s. 176"
    },
    {
      "id": "ra2",
      "text": "Failure to execute registered sale deed was subterfuge to defeat pre-emption; 'sale' wider than TPA s. 54.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": "Jainarayan Ramgopal Marwadi v. Balwant Maroti Shingore (A.I.R. 1939 Nag. 35); Begum v. Mohammad Yakub (1894 I.L.R. 16 All 344)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Right of pre-emption under Berar Land Revenue Code arises only on completed transfer by sale, which requires registered instrument under TPA s. 54 for property over Rs. 100; contracts alone pass no title.",
      "addresses_issue": "i1",
      "key_observation": "No transfer by sale when suit filed on Sept 11, 1943."
    },
    {
      "id": "cr2",
      "text": "'Sale' in Code must align with TPA definition where applicable; Privy Council cases distinguish as they involved completed sales or different contexts.",
      "addresses_issue": "i2",
      "key_observation": "TPA overrides Mohammedan or personal law on transfers."
    },
    {
      "id": "cr3",
      "text": "No fraud in using legitimate means to avoid weak right of pre-emption; parties may steer clear by lawful methods.",
      "addresses_issue": "i3",
      "key_observation": "Pre-emption in derogation of owner's alienation right, not favoured."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No right of pre-emption accrued prior to registered sale deed; suit not maintainable on basis of contracts alone.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Sale under pre-emption provisions governed by TPA s. 54 requiring registration.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Legitimate avoidance of pre-emption not fraudulent.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jainarayan Ramgopal Marwadi v. Balwant Maroti Shingore",
      "citation": "A.I.R. 1939 Nag. 35",
      "treatment": "distinguished",
      "relevance": "High Court view that 'sale' in s. 176 Code wider than TPA s. 54, but rejected by SC."
    },
    {
      "case_name": "Begum v. Mohammad Yakub",
      "citation": "1894 I.L.R. 16 All 344",
      "treatment": "distinguished",
      "relevance": "Observations on TPA not altering Mohammedan pre-emption law approved in limited context, but TPA governs transfers."
    },
    {
      "case_name": "Sitaram Bhaurao Deshmukh v. Jiaul Hasan Sirajul Khan",
      "citation": "1921 48 I.A. 475",
      "treatment": "distinguished",
      "relevance": "Intention determines sale date for ceremonies under Mohammedan law; involved completed sales."
    },
    {
      "case_name": "Immudipattam Thirugnana v. Peria Dorasami",
      "citation": "1900 28 I.A. 46",
      "treatment": "followed",
      "relevance": "Immovable property cannot be transferred without registered instrument."
    },
    {
      "case_name": "Jadu Lal Sahu v. Janki Koer",
      "citation": "1908 I.L.R. 35 Cal. 575",
      "treatment": "distinguished",
      "relevance": "Involved registered sale; not directly on contract vs. deed."
    },
    {
      "case_name": "Janki v. Girjadat",
      "citation": "1885 I.L.R. 7 All. 482",
      "treatment": "followed",
      "relevance": "Valid perfected sale precondition to pre-emption; contract alone insufficient."
    },
    {
      "case_name": "Bishan Singh v. Khazan Singh",
      "citation": "1959 S.C.R. 878",
      "treatment": "followed",
      "relevance": "Pre-emption weak right, defeatable by legitimate means."
    }
  ],
  "statutes_cited": [
    {
      "name": "Berar Land Revenue Code, 1928",
      "sections": [
        "Ch. XIV",
        "s. 58",
        "s. 174",
        "s. 176",
        "s. 177",
        "s. 178",
        "s. 183",
        "s. 184"
      ],
      "relevance": "Governs pre-emption rights on transfers of occupancy land by sale, mortgage, lease >15 years; right arises on notice and exercisable by suit."
    },
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [
        "s. 2",
        "s. 54"
      ],
      "relevance": "Defines sale as transfer by registered instrument for immovable property >= Rs. 100; applies in Berar since 1907, overrides personal laws."
    },
    {
      "name": "Registration Act",
      "sections": [
        "s. 17",
        "s. 49"
      ],
      "relevance": "Unregistered documents for immovable property >= Rs. 100 do not affect property or create title."
    },
    {
      "name": "Berar Land Revenue Code, 1896",
      "sections": [
        "s. 205"
      ],
      "relevance": "Earlier version extending pre-emption to sales, foreclosures, relinquishments."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by special leave, set aside the High Court decree confirming lower courts' decree for pre-emption, holding no pre-emptible sale occurred before the suit as registration under TPA s. 54 was required.",
    "relief_granted": "Appeal allowed; decrees of lower courts set aside.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Sale is there defined as transfer of ownership for a price paid or promised or part paid or part promised and in the case of sale of tangible immovable property of Rs. 100/- or more sale can only be made by a registered instrument.\"",
      "speaker": "court",
      "significance": "Explains TPA s. 54 governs completion of sale."
    },
    {
      "text": "\"The right to pre-empt the sale is not exercisable till a pre-emptible transfer has been effected and the right of pre-emption is not one which is looked upon with great favour by the courts.\"",
      "speaker": "court",
      "significance": "Underscores weak nature of pre-emption right."
    },
    {
      "text": "\"To defeat the law of pre-emption by any legitimate means is not fraud on the part of either the vendor or the vendee.\"",
      "speaker": "court",
      "significance": "Rejects fraud claim against delaying registration."
    }
  ],
  "_case_id": "1960_156",
  "_label": 1,
  "_text_length": 20322,
  "_extracted_at": "2026-02-10T19:54:12.257945"
}