{
  "metadata": {
    "case_name": "Appellants v. Income-tax Officer, Bellary, Special Circle, Bangalore",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": "Civil Appeal No. 261 of 1958",
    "date_of_judgment": "1960-07-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "For the assessment year 1948-49, the appellants failed to file a return within the prescribed time.",
      "type": "material",
      "date": "1948-49",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Income-tax Officer issued a notice to the appellants under s. 28(1)(a) of the Indian Income-tax Act to show cause why penalty should be imposed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In answer to the notice, the appellants filed a written reply.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Income-tax Officer levied a penalty of Rs. 16,000 without affording a hearing to the appellants as required by the third sub-section of s. 28.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellants appealed to the Appellate Assistant Commissioner of Income-tax, who held the order defective for lack of opportunity of being heard, set aside the order, and directed refund of the penalty if recovered.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "On receipt of the Appellate Assistant Commissioner's order, the Income-tax Officer issued a further notice calling upon the appellants to appear for an opportunity of being heard, or he would proceed on the earlier written statement.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Before the Income-tax Officer could decide, the appellants filed a petition under Art. 226 of the Constitution in Mysore High Court for writ of prohibition or other appropriate writ against the Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Mysore High Court dismissed the writ petition in limine on November 6, 1956, holding that the contention may be raised before the Income-tax authorities.",
      "type": "procedural",
      "date": "1956-11-06",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellants applied for and obtained special leave from Supreme Court, leading to this appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Income-tax Officer can continue penalty proceedings after the Appellate Assistant Commissioner set aside the penalty order for lack of hearing under s. 28(3), without an express remand.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the notice under s. 28(1)(a) ceases to be operative after the Appellate Assistant Commissioner points out the illegality.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Such proceedings could only be taken during the course of assessment proceedings, which are concluded.",
      "supporting_facts": [
        "f5",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Cited Jos Chacko Poothokaran v. I. T. O., Ernakulam Circle, where in similar circumstances, since no appeal was taken by Commissioner to Tribunal under s. 33(2), the AAC order became final and ITO could no longer proceed.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Jos Chacko Poothokaran v. I. T. O., Ernakulam Circle"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The notice issued to show cause why penalty should not be imposed did not cease to be operative despite the AAC pointing out the illegality.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "s. 28(1)(a) Indian Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Requirements of s. 28(1)(a) were completely fulfilled by failure to file return, attracting penalty proceedings.",
      "addresses_issue": "i1",
      "key_observation": "Omission to file return attracts cl. (a) of sub-s. (1) of s. 28."
    },
    {
      "id": "cr2",
      "text": "Sub-section (3) of s. 28 requires reasonable opportunity of being heard before imposing penalty; this was denied, vitiating the order mid-proceedings.",
      "addresses_issue": "i1",
      "key_observation": "Illegality supervened not at initial stage but during course of proceedings."
    },
    {
      "id": "cr3",
      "text": "AAC order set aside the defective order and directed refund, interpreted as correcting the error and leaving it open to ITO to continue from the stage of illegality; no express remand necessary.",
      "addresses_issue": "i1",
      "key_observation": "On receipt of record, open to ITO to take up matter from point illegality supervened."
    },
    {
      "id": "cr4",
      "text": "Kerala High Court decision beside the point; AAC vacated order due to illegality during assessment proceedings.",
      "addresses_issue": "i2",
      "key_observation": "Notice under s. 28(1)(a) did not cease to be operative."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Income-tax Officer can proceed to determine penalty from the stage where illegality occurred after AAC set aside the order.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The show cause notice under s. 28(1)(a) remains operative despite AAC pointing out procedural illegality.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jos Chacko Poothokaran v. I. T. O., Ernakulam Circle",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Similar circumstances where AAC order held final absent appeal to Tribunal; held beside the point as AAC vacated due to mid-proceedings illegality."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s. 28(1)(a)",
        "s. 28(3)",
        "s. 33(2)"
      ],
      "relevance": "Failure to file return attracts penalty under s.28(1)(a); hearing required under s.28(3); appeal to Tribunal under s.33(2)."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Basis for writ petition seeking prohibition against ITO."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the Mysore High Court's dismissal of the writ petition, holding that the Income-tax Officer could continue penalty proceedings from the stage of the procedural illegality after the Appellate Assistant Commissioner's order.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Sub-section (3) of s. 28, however, requires that the penalty shall not be imposed without affording to the assessee a reasonable opportunity of being heard.",
      "speaker": "court",
      "significance": "Identifies the specific statutory violation that vitiated the initial penalty order."
    },
    {
      "text": "The order of the learned Appellate Assistant Commissioner pointed out the ground on which the illegality proceeded and his order directing the refund of the penalty, if recovered, cannot but be interpreted as correcting the error and leaving it open to the Income-tax Officer to continue his proceedings from the stage at which the illegality occurred.",
      "speaker": "court",
      "significance": "Core reasoning allowing continuation of proceedings without express remand."
    },
    {
      "text": "The notice issued to the appellants to show cause why penalty should not be imposed on them did not cease to be operative, because the Appellate Assistant Commissioner pointed out an illegality which vitiated the proceeding after it was lawfully initiated.",
      "speaker": "court",
      "significance": "Key holding on persistence of the show cause notice."
    }
  ],
  "_case_id": "1960_273",
  "_label": 0,
  "_text_length": 4985,
  "_extracted_at": "2026-02-10T19:55:10.028018"
}