{
  "metadata": {
    "case_name": "Appellant (Sugar Mills Owner) v. Union (Respondent)",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO, J."
    ],
    "case_number": "Civil Appeal No. 352 of 1958",
    "date_of_judgment": "1960-12-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant owns two sugar mills.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "There was a dispute between the appellant and its workmen with respect to the employment of contract labour in the two mills.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "A notice of change under S. 42(2) of the Bombay Industrial Relations Act, No. XI of 1947 (the Act) was given to the appellant by the union representing the workmen.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The union (respondent) made two references to the industrial court, one with respect to each mill, under S. 73A of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The main demand in the references was that the system of employing contract labour should be abolished and the strength of the employees of the respective departments should be permanently increased sufficiently.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Appellant raised contentions before industrial court: (i) no jurisdiction as matter covered by item 6 of Sch. III (labour court jurisdiction); (ii) award abolishing contract labour contravenes Art. 19(1)(g).",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Industrial court held: jurisdiction under item 2 of Sch. II; no contravention of Art. 19(1)(g). Workmen of contractors not workmen of appellant.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Industrial court dealt with merits and passed orders.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Similar cases for other sugar mills decided together by industrial court.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appeals to Labour Appellate Tribunal (including by appellant mills and one union).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellate Tribunal: not covered by item 2 Sch. II; but item 6 Sch. III 'employment' restricted; abolition of contract labour far-reaching, not for labour court; jurisdiction with industrial court.",
      "type": "procedural",
      "date": "1956-07-27",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellate Tribunal: reasonableness of restriction case-specific, outside appellate power.",
      "type": "procedural",
      "date": "1956-07-27",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appellate Tribunal set aside award, remanded for early hearing in light of observations; set aside entire award in interest of justice even without union appeals.",
      "type": "procedural",
      "date": "1956-07-27",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appellant granted special leave by Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "In written statements, appellant did not dispute permanent increase, wages, hours etc., but contended workmen not employees of mills.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Unions' petitions raised permanent increase in number of persons employed.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f17",
      "text": "Secs. 3(13) and 3(14) define 'employee' and 'employer' to include contractor's employees and owner where contract for work ordinarily part of undertaking.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the industrial court had jurisdiction to decide the dispute relating to abolition of contract labour, or if it is exclusively within labour court's jurisdiction under item 6 of Sch. III.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the definition of 'industrial matter' under S. 3(18) including 'mode of employment', and power to adjudicate on abolition of contract labour, contravenes Art. 19(1)(g).",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Industrial court has no jurisdiction as matter covered by item 6 of Sch. III ('Employment including reinstatement and recruitment, unemployment of persons previously employed') which is exclusive to labour court.",
      "supporting_facts": [
        "f6",
        "f15"
      ],
      "legal_basis": "Item 6 Sch. III, Bombay Industrial Relations Act, 1947; S. 73A"
    },
    {
      "id": "pa2",
      "text": "'Employment' in item 6 Sch. III is wide, includes whether contract labour should be employed.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Item 6 Sch. III"
    },
    {
      "id": "pa3",
      "text": "Definition of industrial matter (S. 3(18)) includes 'mode of employment', enabling adjudication on abolition of contract labour, contravenes Art. 19(1)(g).",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "S. 3(18), S. 3(17), Art. 19(1)(g)"
    },
    {
      "id": "pa4",
      "text": "Under Ss. 3(13) and 3(14), contractor's employees are employees of mills; no need to abolish contract system if same terms as direct employees.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "S. 3(13), S. 3(14)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Matter covered by item 2 of Sch. II (permanent increase in number of persons employed).",
      "supporting_facts": [
        "f5",
        "f16"
      ],
      "legal_basis": "Item 2 Sch. II"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Even if ambit of 'employment' in item 6 Sch. III wide, dispute inextricably mixed with Sch. II items 2 (permanent increase), 9 (wages), 10 (hours of work/rest); raises those if contract labour not accepted as own labour force.",
      "addresses_issue": "i1",
      "key_observation": "Dispute on abolition raises Sch. II matters; unions raised permanent increase (item 2); S. 73A reference to industrial court if involves labour court matters prohibited only if exclusively so."
    },
    {
      "id": "cr2",
      "text": "Scheme: Ss. 71-72 concurrent jurisdiction; S. 73A by union to industrial court unless exclusively labour court (Sch. III); Sch. II ordinary labour court but union reference to industrial court.",
      "addresses_issue": "i1",
      "key_observation": "Industrial court has jurisdiction."
    },
    {
      "id": "cr3",
      "text": "Power to quasi-judicial tribunal to decide reasonableness of mode of employment (abolition of contract labour) after hearing parties is not unreasonable restriction on Art. 19(1)(g); tribunal assesses case facts.",
      "addresses_issue": "i2",
      "key_observation": "Quasi-judicial decision on reasonableness not unconstitutional; if contract labour reasonable, permitted; else abolished as reasonable restriction."
    },
    {
      "id": "cr4",
      "text": "Judicial/quasi-judicial decisions cannot be deemed unreasonable restrictions.",
      "addresses_issue": "i2",
      "key_observation": "S. 3(18) valid."
    },
    {
      "id": "cr5",
      "text": "On remand, industrial court may consider if abolition necessary given Ss. 3(13)/(14), if appellant assures same terms for contractor employees as direct.",
      "addresses_issue": "i2",
      "key_observation": "Alternative to abolition possible."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Industrial court has jurisdiction under S. 73A as dispute inextricably linked to Sch. II items 2,9,10.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "S. 3(18) including 'mode of employment' does not contravene Art. 19(1)(g); quasi-judicial adjudication on reasonableness valid.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bombay Industrial Relations Act, 1947",
      "sections": [
        "S. 42(2)",
        "S. 73A",
        "S. 71",
        "S. 72",
        "S. 78",
        "S. 3(18)",
        "S. 3(17)",
        "S. 3(13)",
        "S. 3(14)",
        "Sch. II (items 2,9,10)",
        "Sch. III (item 6)"
      ],
      "relevance": "Governs jurisdiction of labour/industrial courts, references by unions, definitions of industrial matter/dispute/employee/employer; court holds jurisdiction lies with industrial court and definitions valid."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 19(1)(g)"
      ],
      "relevance": "Fundamental right to carry on trade/business; restriction via adjudication on contract labour abolition held reasonable."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Court rejected appellant's contentions on jurisdiction and Art. 19(1)(g); upheld appellate tribunal's decision on jurisdiction; matter stands remanded to industrial court as per tribunal; industrial court to consider appellant's alternative submission on contractor employees.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"a question relating to abolition of contract labour is so inextricably mixed up with the question of permanent increase in the number of persons employed, their wages, hours of work and rest intervals\"",
      "speaker": "court",
      "significance": "Basis for jurisdiction holding."
    },
    {
      "text": "\"the decision whether the mode of employment in a particular case is a reasonable restriction or unreasonable one is in the hands of a quasi-judicial tribunal.\"",
      "speaker": "court",
      "significance": "Rejects Art. 19(1)(g) violation."
    },
    {
      "text": "\"If the argument on behalf of the appellant were to be accepted it would mean that judicial and quasi-judicial decisions could be unreasonable restrictions on fundamental rights\"",
      "speaker": "court",
      "significance": "Core reasoning against unconstitutionality."
    }
  ],
  "_case_id": "1960_179",
  "_label": 0,
  "_text_length": 16164,
  "_extracted_at": "2026-02-10T19:54:03.116436"
}