{
  "metadata": {
    "case_name": "Assessee (Zamindar) v. Commissioner of Income-tax",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Civil Appeal No. 424 of 1957",
    "date_of_judgment": "1960-11-30"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a Zamindar owning considerable properties.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant granted licences to prospect for Bauxite: Aluminium Corporation of India Ltd. on 20-1-1945 for 6 months, received Rs. 15,290 for assessment year 1945-46.",
      "type": "material",
      "date": "1945-01-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant granted licences to prospect for Bauxite: Indian Aluminium Co. Ltd. on 26-5-1945 for 1 year, received Rs. 1,24,789 for assessment year 1946-47.",
      "type": "material",
      "date": "1945-05-26",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant granted licences to prospect for Bauxite: Dayanand Modi on 7-5-1945 for 6 months, received Rs. 1,500 for assessment year 1947-48.",
      "type": "material",
      "date": "1945-05-07",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant granted licences to prospect for Bauxite: Indian Aluminium Co. Ltd. on 14-8-1945 for 1 year, received Rs. 70,146 for assessment year 1947-48.",
      "type": "material",
      "date": "1945-08-14",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Under the licences, licensee granted sole and exclusive right to enter, prospect, search for, mine, quarry, bore, dig and prove all Bauxite; dig pits, shafts, etc.; remove samples up to 100 tons; clear undergrowth; periods 6 months or 1 year.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Licences required minimal damage, full information to licensor, plug holes; licensor to give passage; option for 30-year mining lease on payment.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Income-tax Officer held amounts as revenue payments, taxable.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellate Assistant Commissioner held amounts as capital receipts.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Income-tax Appellate Tribunal set aside AAC order, held amounts revenue receipts, taxable; no interest in land granted.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "At instance of appellant, case referred to Patna High Court under s.66 Income-tax Act; question: whether sums Rs.15,290, 1,24,789, 1,500, 70,146 assessable as income.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Patna High Court on 25-1-1955 answered question in affirmative, held material supported Tribunal's finding of fact that amounts were revenue receipts.",
      "type": "procedural",
      "date": "1955-01-25",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sums of Rs. 15,290, Rs. 1,24,789, Rs. 1,500 and Rs. 70,146 received by the assessee are income assessable to tax under the Indian Income-tax Act, i.e., whether capital or revenue receipts.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Amounts received are capital receipts, analogous to salami or premium for grant of prospecting rights.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Precedents like Raja Bahadur Kamakshya Narain Singh v. CIT"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Amounts are revenue receipts as they represent use of licensor's capital assets by licensees, not parting with capital.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": "Greyhounds case; R.B.P. Bannerji v. CIT"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Licences granted right to prospect, search, mine Bauxite and remove up to 100 tons, not mere user of capital but realisation of capital asset; analogous to salami as single payment for right to enjoy benefits.",
      "addresses_issue": "i1",
      "key_observation": "Transaction not mere user but grant of right to portion of capital in form of Bauxite."
    },
    {
      "id": "cr2",
      "text": "Distinguished respondent cases: payments for short-term use like military requisition are revenue, but here right to extract and appropriate minerals.",
      "addresses_issue": "i1",
      "key_observation": "Nature of grant determines capital vs revenue; here transfer of right to take away Bauxite."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Amounts received are capital receipts, not revenue, and not assessable to tax.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Raja Bahadur Kamakshya Narain Singh of Ramgarh v. Commissioner of Income-tax, Bihar & Orissa",
      "citation": "1943 L.R. 70 I.A. 186",
      "treatment": "followed",
      "relevance": "Salami is capital receipt as single payment for acquisition of lease rights; royalties revenue."
    },
    {
      "case_name": "Commissioner of Income-tax, Bihar & Orissa v. Raja Bahadur Kamakshya Narain Singh",
      "citation": "1946 14 I.T.R. 738",
      "treatment": "followed",
      "relevance": "Salami for prospecting licence and mining lease rights is capital receipt."
    },
    {
      "case_name": "Province of Bihar v. Maharaja Pratap Udai Nath Sahi Deo of Ratugarh",
      "citation": "1941 9 I.T.R. 313",
      "treatment": "followed",
      "relevance": "Salami prima facie not income unless rent in advance."
    },
    {
      "case_name": "Member for the Board of Agricultural Income Tax, Assam v. Smt. Sindurani Chaudhurani",
      "citation": "1957 S.C.R. 1019",
      "treatment": "followed",
      "relevance": "Salami defined as single non-recurring payment prior to tenancy for being let into possession; capital receipt."
    },
    {
      "case_name": "Greyhounds case",
      "citation": "1936 20 T.C. 373",
      "treatment": "distinguished",
      "relevance": "Receipts for user of capital assets are revenue, but here realisation of capital."
    },
    {
      "case_name": "R. B. P. Bannerji v. Commissioner of Income-tax, Bihar & Orissa",
      "citation": "1951 19 I.T.R. 596",
      "treatment": "distinguished",
      "relevance": "Compensation for short-term military use of land is revenue as profit from use."
    },
    {
      "case_name": "Smethurst v. Davy",
      "citation": "1957 37 T.C. 593",
      "treatment": "distinguished",
      "relevance": "Decided on specific Finance Act wording, not helpful."
    },
    {
      "case_name": "Stow Bardolph Gravel Co., Ltd. v. Poole",
      "citation": "1954 35 T.C. 459",
      "treatment": "distinguished",
      "relevance": "Acquisition of unworked deposits is capital asset, not trading stock."
    },
    {
      "case_name": "Rajah Nanyam Meenakshamma v. Commissioner of Income-tax, Hyderabad",
      "citation": "1956 30 I.T.R. 286",
      "treatment": "distinguished",
      "relevance": "Fixed royalty for lease period is revenue as advance periodic payments."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s. 66",
        "s. 12"
      ],
      "relevance": "Reference to High Court under s.66; s.12 for other income in precedents."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by special leave, held High Court in error, answered the referred question in favour of appellant that amounts are capital receipts not assessable to tax.",
    "relief_granted": "Question referred answered in favour of assessee; amounts not taxable as income.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The salami, has been, rightly in their Lordships opinion, treated as a capital receipt. It is a single payment made for the acquisition of the right of the lessees to enjoy the benefits granted to them by the lease.",
      "speaker": "court",
      "significance": "From Privy Council in Kamakshya Narain Singh case, defining salami as capital."
    },
    {
      "text": "The indicia of salami are 1 its single non-recurring character and 2 payment prior to the creation of the tenancy. It is the consideration paid by the tenant for being let into possession and can be neither rent nor revenue but is a capital receipt in the hands of the landlord.",
      "speaker": "court",
      "significance": "Supreme Court's definition of salami applied to prospecting licences."
    },
    {
      "text": "In our opinion the High Court was in error and the question referred should have been decided in favour of the appellant.",
      "speaker": "court",
      "significance": "Final holding reversing High Court."
    }
  ],
  "_case_id": "1960_237",
  "_label": 1,
  "_text_length": 15010,
  "_extracted_at": "2026-02-10T19:54:41.713945"
}