{
  "metadata": {
    "case_name": "Co-operative Bank v. Commissioner of Income-tax, Bihar Orissa",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Civil Appeals Nos. 228 to 230 of 1958",
    "date_of_judgment": "1960-02-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a Bank registered under the Co-operative Societies Act, 1912 (Act II of 1912) and is deemed to be registered under the Bihar Orissa Co-operative Societies Act, 1935 (Bihar Act VI of 1935).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "One of the objects of the Bank is to carry on general business of banking not repugnant to the provisions of the Bihar Act and rules framed thereunder (Bye-Law 3(a)(vi)).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In calendar years 1945, 1946 and 1947, the appellant Bank received by way of interest on deposits with the Imperial Bank of India the sums of Rs. 7,192, Rs. 20,250 and Rs. 22,600 respectively.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "These sums relate to assessment years 1946-47, 1947-48 and 1948-49.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "These sums were not assessed when assessment was made under s. 23(3) of the Income-tax Act, but subsequently under s. 34 they were assessed as being income under the head 'other sources'.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "This order was upheld by the Appellate Assistant Commissioner and by the Income-tax Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "A case was stated to the Patna High Court under s. 66(1) of the Act, decided against the appellant on July 2, 1957, in Misc. Judicial Case No. 640 of 1955.",
      "type": "procedural",
      "date": "1957-07-02",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant showed these sums as 'other sources' in its return.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Income-tax Officer assessed the interest under s. 12 as income from 'other sources'.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellate Assistant Commissioner held that fixed deposits with Imperial Bank were held as investment apart from business; interest not exempt; exemption extends to co-operative activities only.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "In accounting year 1945, Bank invested Rs. 13,50,000 as fixed deposits, raised to Rs. 15,00,000 in 1946, realised in 1947.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Income-tax Appellate Tribunal by order dated April 11, 1955, held interest income under 'other sources', not profits of co-operative business.",
      "type": "procedural",
      "date": "1955-04-11",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court referred questions: (1) Whether receipt of interest on fixed deposits was income under 'other sources'; (2) Whether exempt under CBR Notifications No.35 dated 20-10-1934 and No.33 dated 18-08-1945.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Deposits were short-term, renewed, available as needed; under bye-laws, bank could invest surplus funds per s.19 Bihar Act (Cl.4(iii) Bye-laws).",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the investment by a Co-operative Bank of its assets in fixed deposits falls within the term 'business' and is therefore assessable under s.10, or is an investment the interest from which falls under 'other sources' under s.12.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the receipt of interest from fixed deposits was exempt from taxation under CBR Notification No.35 dated 20th October 1934 and No.33 dated 18th August 1945.",
      "framed_by": "high_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Deposits made not for investment but to have cash continuously available for business purposes; intimately connected with business; interest is profits from business activities.",
      "supporting_facts": [
        "f3",
        "f14"
      ],
      "legal_basis": "Notification under s.60 Income-tax Act; Bye-Law 3(a)(vi); Punjab Co-operative Bank Ltd. v. CIT"
    },
    {
      "id": "pa2",
      "text": "Business of bank is dealing in money and credit; laying out moneys in deposits with other banks is mode of conducting business; serves to earn interest on idle funds and meet demands.",
      "supporting_facts": [
        "f2",
        "f11"
      ],
      "legal_basis": "Privy Council in Punjab Co-operative Bank Ltd. v. CIT (1940) 8 ITR 635"
    },
    {
      "id": "pa3",
      "text": "Finding on nature of deposits is question of law, not fact.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Fixed deposits were investments of surplus funds apart from business; interest from such investments not part of business profits; exemption only for co-operative activities.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "CBR Notifications; Hoshiarpur Central Co-operative Bank v. CIT; Madras Central Urban Bank Ltd. v. CIT; other cases"
    },
    {
      "id": "ra2",
      "text": "Moneys laid out in deposits cannot be termed carrying on business; income from other sources.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "s.12 Income-tax Act; Madras Provincial Co-operative Bank Ltd. v. CIT; etc."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Business of a bank consists of dealing in money and credit; keeping sufficient cash or easily realizable deposits/securities is normal step in banking business.",
      "addresses_issue": "i1",
      "key_observation": "Placing funds in deposits with other banks is normal mode of conducting banking business to earn interest on non-immediately required funds and meet demands."
    },
    {
      "id": "cr2",
      "text": "Deposits fell due at short intervals, available if needed; not shown to be 'surplus' under bye-laws taking it out of banking business.",
      "addresses_issue": "i1",
      "key_observation": "Such deposits are part of circulating capital and normal course of banking business."
    },
    {
      "id": "cr3",
      "text": "Cited cases distinguished: they involved mandatory or non-business investments like Govt securities not part of banking stock-in-trade.",
      "addresses_issue": "i1",
      "key_observation": "Unlike those, deposits here are integral to banking operations."
    },
    {
      "id": "cr4",
      "text": "s.12 is residuary; applies only after excluding prior heads like business.",
      "addresses_issue": "i1",
      "key_observation": "Interest arises from business, exempt under Notification as profits of co-operative society."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Interest on fixed deposits is income from business under s.10, not 'other sources' under s.12; falls within exempted 'profits of a Co-operative Society' under the Notification.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court erred in holding interest not arising from business of the Bank.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Punjab Co-operative Bank Ltd. v. Commissioner of Income-tax, Punjab",
      "citation": "1940 8 I.T.R. 635",
      "treatment": "followed",
      "relevance": "Business of bank includes dealing in money/credit; keeping realizable deposits normal banking practice."
    },
    {
      "case_name": "Hoshiarpur Central Co-operative Bank Ltd. v. Commissioner of Income-tax",
      "citation": "1933 24 I.T.R. 346",
      "treatment": "distinguished",
      "relevance": "Profits from non-object activities not exempt; inapplicable here as deposits part of banking objects."
    },
    {
      "case_name": "Madras Central Urban Bank Ltd. v. Commissioner of Income Tax",
      "citation": "I.L.R. 52 Mad. 640 (F.B.)",
      "treatment": "distinguished",
      "relevance": "Interest from mandatory Govt securities not business profits."
    },
    {
      "case_name": "Madras Provincial Co-operative Bank Ltd. v. Commissioner of Income Tax",
      "citation": "I.L.R. 56 Mad. 837 (F.B.)",
      "treatment": "distinguished",
      "relevance": "Interest from Govt securities not business income."
    },
    {
      "case_name": "Commissioner of Income-tax, Burma v. Bengalee Urban Co-operative Credit Society Ltd.",
      "citation": "1934 2 I.T.R. 121",
      "treatment": "distinguished",
      "relevance": "Interest from securities may be business if part of business; remanded for consideration."
    },
    {
      "case_name": "Commissioner of Income Tax, Madras v. Madras Provincial Co-operative Bank Ltd.",
      "citation": "I.L.R. 1943 Mad. 390",
      "treatment": "distinguished",
      "relevance": "Interest from debentures not business profits."
    },
    {
      "case_name": "Cochin Cottage Industries Co-operative Marketing Society Ltd. v. Commissioner of Income Tax",
      "citation": "1956 30 I.T.R. 356",
      "treatment": "distinguished",
      "relevance": "Profit from non-members not exempt."
    },
    {
      "case_name": "Surat Peoples Co-operative Bank Ltd. v. Commissioner of Income-tax",
      "citation": "1958 33 I.T.R. 396",
      "treatment": "referred",
      "relevance": "Profits from sale of securities as stock-in-trade exempt."
    },
    {
      "case_name": "Commissioner of Income-tax v. Basant Rai Takhat Singh",
      "citation": null,
      "treatment": "followed",
      "relevance": "Heads under s.6 mutually exclusive; s.12 residuary."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "s.10",
        "s.12",
        "s.23(3)",
        "s.34",
        "s.60",
        "s.66(1)",
        "s.6",
        "s.8",
        "s.9"
      ],
      "relevance": "Interest assessed under s.12 'other sources'; court holds business under s.10; s.12 residuary; exemption under notification per s.60."
    },
    {
      "name": "Co-operative Societies Act, 1912",
      "sections": [],
      "relevance": "Bank registered/deemed thereunder."
    },
    {
      "name": "Bihar and Orissa Co-operative Societies Act, 1935",
      "sections": [
        "s.19"
      ],
      "relevance": "Bye-laws permit investment of surplus per s.19; general banking business."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; judgment and order of High Court set aside; interest on deposits held to be business profits exempt under the Notification.",
    "relief_granted": "Assessments quashed insofar as including interest as taxable 'other sources' income.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the business of a Bank essentially consists of dealing with money and credit. Depositors put their money in the Bank... the Bank has always to keep sufficient cash or easily realizable securities.\"",
      "speaker": "court",
      "significance": "Defines core of banking business including deposits."
    },
    {
      "text": "\"That is a normal step in the carrying on of the banking business. In other words that is an act done in what is truly the carrying on or carrying out of a business.\"",
      "speaker": "court",
      "significance": "Holds deposits integral to banking."
    },
    {
      "text": "\"The moneys laid out in the form of deposits... would not cease to be a part of the circulating capital of the appellant nor would they cease to form part of its banking business.\"",
      "speaker": "court",
      "significance": "Interest forms business profits."
    }
  ],
  "_case_id": "1960_183",
  "_label": 1,
  "_text_length": 20139,
  "_extracted_at": "2026-02-10T19:54:08.279715"
}