{
  "metadata": {
    "case_name": "Appellants v. State of Madras",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "KAPUR, J."
    ],
    "case_number": "Civil Appeals Nos. 490 and 491 of 1958",
    "date_of_judgment": "1960-11-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are merchants dealing in cotton yarn.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellants obtained a license under s. 5 of the Madras General Sales Tax Act, 1939, exempting them from sales tax on sale of cotton yarn and handloom cloth subject to restrictions and conditions.",
      "type": "material",
      "date": "1941-03-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "License was renewed for following years.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On September 20, 1944, Commercial Tax Authorities made a surprise inspection of appellants' premises and discovered two separate sets of accounts; one used for returns to Department, other showed black-market activities.",
      "type": "material",
      "date": "1944-09-20",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Balakrishna Chetty prosecuted and sentenced to six months imprisonment for offence connected with breach of Cotton Yarn Control Order.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Deputy Commercial Tax Officer made assessments: for 1943-44, tax Rs. 37,039; for 1944-45, Rs. 3,140.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellants appealed against assessments unsuccessfully; revisions also failed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On August 24, 1945, appellants brought suit for declaration and injunction regarding first assessment (1943-44), alleging it was against the Act.",
      "type": "procedural",
      "date": "1945-08-24",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On September 2, 1946, similar suit brought regarding second assessment (1944-45).",
      "type": "procedural",
      "date": "1946-09-02",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Suits decreed by Subordinate Judge of Salem.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Decrees confirmed on appeal by District Judge of Salem.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "State of Madras took appeals to Madras High Court (Second Appeals Nos. 2038 and 2039 of 1950); by judgment dated February 18, 1955, decrees set aside by common judgment.",
      "type": "procedural",
      "date": "1955-02-18",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appellants brought present appeals to Supreme Court by certificate of High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Interpretation of the words 'subject to' in s. 5 of the Madras General Sales Tax Act, 1939: whether observance of conditions of the license was necessary for availability of exemption under s. 5, or if holding a license was sufficient notwithstanding contravention of conditions.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "As long as they held the licence it was immaterial if they were guilty of any infraction of the law; they were not liable to assessment of sales-tax; only penalty was cancellation of licence or criminal penalty already suffered.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "s. 5 of the Act"
    },
    {
      "id": "pa2",
      "text": "In spite of breaches of terms and conditions of licence, having a licence was sufficient for exemption under the Act.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s. 5 of the Act"
    },
    {
      "id": "pa3",
      "text": "Words 'subject to' do not mean conditional upon but liable to the rules and provisions of the Act.",
      "supporting_facts": [],
      "legal_basis": "s. 5 of the Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "On true interpretation of the Act and rules, observance of conditions of the license was necessary for availability of exemption under s. 5; appellants contravened those conditions and were liable to pay tax notwithstanding the license.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "s. 5, s. 13 of the Act; Rules 5, 8"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 3 is charging section; s. 5 gives exemption subject to restrictions and conditions prescribed; holding license subject to such does not entitle to exemption if conditions breached.",
      "addresses_issue": "i1",
      "key_observation": "Exemption under licence is conditional upon observance of conditions prescribed and restrictions imposed by Act and rules."
    },
    {
      "id": "cr2",
      "text": "Under s. 13, dealer and licensed person must keep true and correct accounts; r. 5 requires application for licence to avail exemption; licence form subject to Act and rules requiring true accounts and returns.",
      "addresses_issue": "i1",
      "key_observation": "Appellants contravened by maintaining two sets of accounts."
    },
    {
      "id": "cr3",
      "text": "Words 'subject to' mean 'conditional upon'; otherwise s. 5 meaningless; licensee exempt only as long as conforms to conditions.",
      "addresses_issue": "i1",
      "key_observation": "Appellants found to have contravened provisions of Act and rules; not exempt from assessment."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Exemption under s. 5 is conditional upon observance of conditions of licence, Act and rules; non-observance makes dealer liable to tax under s. 3 notwithstanding licence.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Madras General Sales Tax Act, 1939",
      "sections": [
        "s. 2(b)",
        "s. 2(f)",
        "s. 3",
        "s. 5",
        "s. 13"
      ],
      "relevance": "s. 3 charging section for tax; s. 5 exemption subject to conditions; s. 13 requires true accounts; definitions applied."
    },
    {
      "name": "Madras General Sales Tax Rules",
      "sections": [
        "R. 5",
        "R. 8"
      ],
      "relevance": "R. 5 requires licence application in Form I to avail exemption; R. 8 allows cancellation for breach; conditions include true accounts."
    },
    {
      "name": "Cotton Yarn Control Order",
      "sections": [],
      "relevance": "Breach led to prosecution of Balakrishna Chetty."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals, upholding the Madras High Court judgment setting aside the lower courts' decrees in favour of appellants; held appellants liable to sales tax assessments for 1943-44 and 1944-45 due to breach of licence conditions.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the exemption under the licence is conditional upon the observance of the conditions prescribed and upon the restrictions which are imposed by and under the Act whether in the rules or in the licence itself\"",
      "speaker": "court",
      "significance": "Core interpretation of 'subject to' in s. 5"
    },
    {
      "text": "\"This contention, in our opinion, is wholly untenable.\"",
      "speaker": "court",
      "significance": "Rejection of petitioners' main argument on licence sufficiency despite breaches."
    },
    {
      "text": "\"The use of the words subject to has reference to effectuating the intention of the law and the correct meaning, in our opinion, is conditional upon.\"",
      "speaker": "court",
      "significance": "Definitive ruling on phrase 'subject to' in s. 5."
    }
  ],
  "_case_id": "1960_238",
  "_label": 0,
  "_text_length": 8552,
  "_extracted_at": "2026-02-10T19:54:30.728322"
}