{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. The Assessee (registered firm)",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "KAPUR, J."
    ],
    "case_number": "Civil Appeal No. 312 of 1959",
    "date_of_judgment": "1960-12-06"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is a registered firm carrying on business as commission agents.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent was treated as the agent of a non-resident principal Haji Mohamed Syed Ali Barbari of Port Sudan.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The respondent carried on the business of export of cloth and kariana (miscellaneous goods) to Aden, Saudi Arabia and Sudan.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The non-resident principal sent cotton to the respondent and other merchants for sale in India.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "For the years 1942-43, 1943-44, 1944-45 and 1945-46, the respondent firm was treated as the agent of the non-resident principal under s. 43 of the Income-tax Act for the purpose of income-tax and Excess Profits Tax.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The respondent firm had to pay in all Rs. 3,78,491 under s. 42(1) of the Act and after allowing for the amounts which were in its hands the account of the principal non-resident showed a debit balance of Rs. 3,20,162.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "For the year of assessment, 1953-54, the respondent firm treated this amount as a bad debt and claimed it as a deductible loss to be set off against profits.",
      "type": "procedural",
      "date": "1953-54",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The Income-tax Officer treated this claim as one under s. 10(2)(xv) of the Act and disallowed it.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Appellate Assistant Commissioner treated it as one under s. 10(2)(xi) of the Act and disallowed it.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On appeal to the Income-tax Appellate Tribunal it was held to be a bad debt and an allowable deduction as it was incurred as a result of the business activities which the respondent firm was carrying on with the non-resident principal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "At the instance of the Commissioner of Income-tax, the case was stated to the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The High Court of Bombay modified the question and answered it in the affirmative, i.e., in favour of the assessee and against the appellant, holding that the amount was a deductible loss under s. 10(1) of the Act.",
      "type": "procedural",
      "date": "1956-08-23",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case the amount of Rs. 3,20,162 is an allowable deduction under Section 10(2)(xi) or 10(2)(xv) of the Income-tax Act?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The amount is not an allowable deduction under s. 10(2)(xv) or s. 10(2)(xi), and also not under s. 10(1) as it is not a business loss of the assessee but a liability imposed due to deeming provisions under s. 42.",
      "supporting_facts": [
        "f6",
        "f8",
        "f9"
      ],
      "legal_basis": "Sections 10(1), 10(2)(xi), 10(2)(xv), 42(1), 42(2)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The respondent was carrying on foreign trade with close connection to the non-resident principal, attracting s. 42(1), and the loss is incidental to its business, allowable under s. 10(1), or as bad debt under s. 10(2)(xi).",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": "Sections 10(1), 10(2)(xi), 42(1), 42(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The allowability depends on the nature of the liability imposed on the respondent firm under s. 42(2); it is not a business loss of the assessee as it arises from the business of the non-resident principal due to deeming provisions.",
      "addresses_issue": "i1",
      "key_observation": "The loss must spring directly from and be incidental to the assessee's own business, not merely connected or imposed by statute on another’s business."
    },
    {
      "id": "cr2",
      "text": "Even if not specifically under s. 10(2), deductions reflect true profits under s. 10(1), but only commercial losses incidental to the assessee's business qualify.",
      "addresses_issue": "i1",
      "key_observation": "Liability under s. 42 is not a trading debt or loss in the respondent's business."
    },
    {
      "id": "cr3",
      "text": "Distinguishes Badridas Daga as there the loss was from agent's misappropriation in assessee's business; here, liability is statutory deeming for non-resident's business.",
      "addresses_issue": "i1",
      "key_observation": "Loss must arise out of carrying on of the business and be incidental to it, not any loss with some connection."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The amount Rs. 3,20,162 is not an allowable deduction under s. 10(2)(xi), 10(2)(xv) or s. 10(1) as it is not a business loss of the assessee.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gresham Life Assurance Society V. Styles",
      "citation": "1892 3 T.C. 185",
      "treatment": "followed",
      "relevance": "Profits to be understood in natural commercial sense."
    },
    {
      "case_name": "Commissioner of Income-tax v. Sir S. M. Chitnavis",
      "citation": "1932 L.R. 59 I.A. 290",
      "treatment": "followed",
      "relevance": "In ascertaining true profits, all losses incidental to business must be deducted."
    },
    {
      "case_name": "Badridas Daga v. Commissioner of Income-tax",
      "citation": "1959 S.C.R. 690",
      "treatment": "distinguished",
      "relevance": "Loss from agent's embezzlement incidental to business; distinguished as here loss not from assessee's business activities."
    },
    {
      "case_name": "Curtis J. G. Oldfield Ltd.",
      "citation": "1925 9 T.C. 319",
      "treatment": "referred",
      "relevance": "Embezzlement by managing director not a trading loss or bad debt."
    },
    {
      "case_name": "Lords Dairy Farm Ltd. v. Commissioner of Income-tax, Bombay",
      "citation": "1955 27 I.T.R. 700",
      "treatment": "distinguished",
      "relevance": "Embezzlement by employee is trading loss; but bad debt must be debt in law; not applicable here."
    },
    {
      "case_name": "Calcutta Co., Ltd. v. Commissioner of Income-tax",
      "citation": "1959 37 I.T.R.",
      "treatment": "followed",
      "relevance": "Profits in commercial sense; deductions if incidental to business per trading principles."
    },
    {
      "case_name": "C.I.R. v. Hagart Burn Murdoch",
      "citation": null,
      "treatment": "referred",
      "relevance": "Loan by solicitors to client company not incidental to profession, hence not deductible."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "10(1)",
        "10(2)(xi)",
        "10(2)(xv)",
        "42(1)",
        "42(2)",
        "43"
      ],
      "relevance": "Deduction claimed under 10(2)(xi)/(xv), argued under 10(1); liability imposed under 42(1)/(2) treating assessee as agent under 43."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal by the Commissioner is allowed, the judgment and order of the Bombay High Court dated August 23, 1956 is set aside, and the question is answered against the respondent (assessee).",
    "relief_granted": "Question answered in favour of appellant (Commissioner)",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The loss becomes allowable if it springs directly from and is incidental to the business of the assessee.\"",
      "speaker": "court",
      "significance": "Core test for deductibility under s. 10(1)"
    },
    {
      "text": "\"In order to be deductible the loss must be in the nature of a commercial loss and... must spring directly out of it and must really be incidental to the business itself.\"",
      "speaker": "court",
      "significance": "Defines when a loss qualifies as business loss"
    },
    {
      "text": "\"when a claim is made for a deduction for which there is no specific provision in s. 10(2), whether it is admissible or no will depend on whether... it can be said to arise out of the carrying on of the business and to be incidental to it.\"",
      "speaker": "court",
      "significance": "Quotes and applies Badridas Daga principle"
    }
  ],
  "_case_id": "1960_296",
  "_label": 1,
  "_text_length": 13272,
  "_extracted_at": "2026-02-10T19:56:05.222775"
}