{
  "metadata": {
    "case_name": "Alembic Chemical Works Co. Ltd. v. its workmen",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 475 of 1960",
    "date_of_judgment": "1960-12-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeal by special leave from the Award dated March 31, 1960, of the Industrial Tribunal, Bombay, in Reference I.T. No. 227 of 1959.",
      "type": "procedural",
      "date": "1960-03-31",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Industrial dispute between the appellant, the Alembic Chemical Works Co. Ltd., and the respondents, its workmen, related to a single demand made by the respondents with regard to leave.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Demand consisted of three parts: (a) one month's privilege leave with full salary and dearness allowance on completion of eleven months service in a year with right to accumulate up to six months; (b) one month's sick leave with full salary and dearness allowance for each year of service with right to accumulate for the entire period of service; (c) every workman entitled to take leave in proportion to the number of days he is in service at the time of application.",
      "type": "material",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f4",
      "text": "Dispute referred by the Government of Bombay for adjudication before the Industrial Tribunal under s. 10(1)(d) of the Industrial Disputes Act XIV of 1947.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Tribunal considered contentions raised by appellant against respondents' demands, took into account awards or agreements in comparable concerns, and made its award.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Tribunal ordered for privilege leave: up to 3 completed years of service - 16 days per year; up to 9 completed years - 22 days per year; thereafter one month for every 11 months of service; accumulation up to three years.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Tribunal ordered 15 days sick leave in a year with full pay and dearness allowance, right to accumulate up to 45 days; medical certificate demanded if sick leave for three days or less.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Tribunal made direction on third item concerning leave in proportion.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Before Tribunal, appellant contended on propriety, reasonableness of demand, and practice in comparable concerns.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f10",
      "text": "Before Supreme Court, privilege leave provision attacked on ground Tribunal had no jurisdiction due to s.79 of Factories Act, 1948.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f11",
      "text": "Respondents governed by provisions of Factories Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Point of s.79 not raised before Tribunal, but permitted by Supreme Court as point of law on admitted facts.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Award purports to make provisions for privilege leave in excess of annual leave sanctioned by s.79 Factories Act.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Appellant contended provision for privilege leave introduces discrimination between clerical staff covered by present reference and operatives covered by earlier awards of same Tribunal, where similar claim rejected.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f15",
      "text": "Appellant's standing orders make different provisions for operatives (manual work) and clerical staff.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Comparable concerns and awards make distinction between operatives and clerical staff.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Industrial Tribunal had jurisdiction to award privilege leave in excess of that provided under s.79 of the Factories Act, 1948, or does s.79 standardize annual leave with wages such that no additions can be made by award?",
      "framed_by": "appellant"
    },
    {
      "id": "i2",
      "text": "Whether the award introduces discrimination between clerical staff and operatives?",
      "framed_by": "appellant"
    },
    {
      "id": "i3",
      "text": "Whether liberal provisions for privilege and sick leave are opposed to modern trend in industrial thought?",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Tribunal had no jurisdiction to award privilege leave in excess of s.79 Factories Act, as s.79 makes exhaustive, self-contained, standardized provisions for annual leave with wages; no additions by contract or award.",
      "supporting_facts": [
        "f10",
        "f11",
        "f13"
      ],
      "legal_basis": "s.79 Factories Act, 1948"
    },
    {
      "id": "pa2",
      "text": "Provision for privilege leave discriminates between clerical staff (covered here) and operatives (earlier award rejected similar claim), disturbing industrial peace.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Liberal provisions for privilege and sick leave opposed to modern industrial thought; unduly generous leave affects production.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "s.78(1) Factories Act saves only pre-existing laws/awards/agreements/contracts.",
      "supporting_facts": [],
      "legal_basis": "s.78(1) Factories Act"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.79(1) prima facie provides for minimum leave, not maximum; no language like 'not more than' used.",
      "addresses_issue": "i1",
      "key_observation": "Even on plain construction, difficult to hold s.79 prescribes standardized maximum leave."
    },
    {
      "id": "cr2",
      "text": "Beneficent construction preferred for welfare legislation like Factories Act; s.79 capable of construction as minimum, furthering policy of better amenities for workmen.",
      "addresses_issue": "i1",
      "key_observation": "Policy of Act is to provide reasonable provisions for health, safety, welfare of workmen."
    },
    {
      "id": "cr3",
      "text": "s.78(1) saves rights under any other law, award, agreement, contract, including future ones; proviso allows longer leave; negatives standardization.",
      "addresses_issue": "i1",
      "key_observation": "s.78 recognizes exceptions, inconsistent with standardization which permits no exceptions."
    },
    {
      "id": "cr4",
      "text": "s.84 allows exemption if factory leave rules not less favourable, contemplating better amenities, including future ones.",
      "addresses_issue": "i1",
      "key_observation": "Postulates existence of better leave amenities than Chapter VIII."
    },
    {
      "id": "cr5",
      "text": "History of amendments shows Act making more liberal provisions over time.",
      "addresses_issue": "i1",
      "key_observation": "From no holidays with pay in 1934, to 10 days, to present s.79."
    },
    {
      "id": "cr6",
      "text": "Distinction between operatives (manual) and clerical staff justified; appellant's standing orders and comparable concerns/awards make such distinction.",
      "addresses_issue": "i2",
      "key_observation": "No discrimination; practice shows distinction generally made."
    },
    {
      "id": "cr7",
      "text": "Tribunals must consider national economy and production, but provisions not unsustainable or violent departure from practice; no interference under Art.136.",
      "addresses_issue": "i3",
      "key_observation": "Tribunal familiar with trends; considered relevant awards/agreements."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s.79 Factories Act provides minimum annual leave, not standardized maximum; Tribunal has jurisdiction to award more via award.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No discrimination in granting privilege leave to clerical staff distinct from operatives.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No basis to interfere with Tribunal's liberal leave provisions as not unreasonable or against trend.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 10(1)(d)"
      ],
      "relevance": "Basis for reference of dispute to Tribunal"
    },
    {
      "name": "Factories Act, 1948",
      "sections": [
        "s. 79",
        "s. 78",
        "s. 84"
      ],
      "relevance": "Provisions for annual leave with wages; interpreted as minimum, not maximum; ss.78,84 allow more generous leave by awards etc."
    },
    {
      "name": "Factories Act, 1934 (Act 25 of 1934)",
      "sections": [
        "s. 34"
      ],
      "relevance": "Historical context; no provision for holidays with pay initially"
    },
    {
      "name": "Amending Act 3 of 1945",
      "sections": [
        "s. 49A",
        "s. 49B"
      ],
      "relevance": "Introduced holidays with pay (10 days after 12 months); s.49A saved other laws/awards etc."
    },
    {
      "name": "Amending Act 25 of 1954",
      "sections": [
        "s. 79",
        "s. 78"
      ],
      "relevance": "Enacted present s.79; added 'annual' to s.78 proviso"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The challenge to the Tribunal's award on jurisdiction under s.79 Factories Act fails; no discrimination or basis for interference found; appeal dismissed.",
    "relief_granted": "Tribunal award upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "s. 79 of the Act has made exhaustive and self-contained provisions with regard to the granting of annual leave with wages... neither the employer voluntarily, nor an Industrial Tribunal by its award, can add to the leave prescribed by the said section.",
      "speaker": "petitioner_counsel",
      "significance": "Appellant's main contention on jurisdiction rejected by court"
    },
    {
      "text": "the provision prima facie sounds like a provision for the minimum rather than for the maximum leave which may be awarded to the worker.",
      "speaker": "court",
      "significance": "Core interpretation of s.79 as minimum leave"
    },
    {
      "text": "in construing the provisions of a welfare legislation courts should adopt what is sometimes described as a beneficent rule of construction.",
      "speaker": "court",
      "significance": "Principle applied to prefer employee-beneficial construction"
    },
    {
      "text": "unless it appears that the impugned provisions cannot be sustained on any reasonable ground or that they mark a violent departure from the prevailing practice or trend, we would be reluctant to interfere.",
      "speaker": "court",
      "significance": "Standard for interference with Tribunal award under Art.136"
    }
  ],
  "_case_id": "1960_68",
  "_label": 0,
  "_text_length": 20654,
  "_extracted_at": "2026-02-10T19:52:27.712717"
}