{
  "metadata": {
    "case_name": "Income-tax Officer v. Respondent Company (Alwaye Spinning Mills)",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Civil Appeal No. 311 of 1959",
    "date_of_judgment": "1960-12-13"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is a limited company which owns a spinning mills at Alwaye.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "It commenced business in January, 1951, and its first accounting year ended on December 31, 1951, and the relevant assessment year is 1952-53.",
      "type": "background",
      "date": "1951-01-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "It filed its return showing an income Rs. 3,21,284 without taking into account the amount allowable under s. 15C of the Act.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "On February 2, 1953, the net assessable income of the respondent was determined at Rs. 1,47,083 after deducting Rs. 1,79,081 under s. 15C.",
      "type": "procedural",
      "date": "1953-02-02",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The respondent declared a dividend of Rs. 4,72,415 which attracted the application of s. 2 of the Finance Act, 1952, read with Part B, proviso ii of First Schedule and thus it became liable to the payment of additional income tax.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "This fact was overlooked by the Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "After giving notice under s. 35 of the Act, the Income-tax Officer by an order dated January 25, 1954, rectified this error and imposed an additional tax at the rate of one anna in the rupee.",
      "type": "procedural",
      "date": "1954-01-25",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "He later discovered that this was also erroneous and the rate should have been 5 annas in a rupee. By an order dated August 12, 1954, he rectified the error.",
      "type": "procedural",
      "date": "1954-08-12",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Under s. 18A, advance income tax had to be paid and the respondent company had deposited only Rs. 5,000 and therefore became liable to penal interest under s. 18A(8) of the Act.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "By the same order this omission to impose penal interest was corrected and this error was thus rectified.",
      "type": "procedural",
      "date": "1954-08-12",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Against this order the respondent company went in revision under s. 33A(2) to the Commissioner of Income-tax but the revision was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Thereupon the respondent company filed a petition in the High Court of Kerala under Art. 226 of the Constitution on the ground that s. 35 of the Act did not apply and that on the merits additional tax could not be imposed.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "The High Court by its judgment dated October 31, 1955 held that the orders made were without jurisdiction and therefore granted a writ of certiorari quashing the orders.",
      "type": "procedural",
      "date": "1955-10-31",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appeal to Supreme Court pursuant to a certificate of the High Court of Kerala.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "The applicability of s. 35 of the Indian Income-tax Act for rectification of mistakes apparent from the record.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the errors regarding additional tax under Finance Act 1952 and penal interest under s. 18A(8) were mistakes apparent from the record.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the levy of penal interest under s. 18A(8) for failure to make advance deposit under s. 18A(3) was without jurisdiction.",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Income-tax Officer had jurisdiction under s. 35 to rectify mistakes apparent from the record, including errors of fact or law discovered upon examination.",
      "supporting_facts": [
        "f7",
        "f8",
        "f10"
      ],
      "legal_basis": "s. 35 Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "s. 35 applies only to evident errors apparent on the face of the record without need for extraneous matter, akin to O. 47 r. 1 CPC; applicability of proviso ii Part B First Schedule Finance Act 1952 is complex and debatable, not apparent.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "s. 35 Income-tax Act; O. 47 r. 1 CPC; Chitaley's CPC"
    },
    {
      "id": "ra2",
      "text": "Levy of penal interest under s. 18A(8) was without jurisdiction.",
      "supporting_facts": [
        "f10",
        "f13"
      ],
      "legal_basis": "s. 18A(8) Income-tax Act"
    },
    {
      "id": "ra3",
      "text": "Applicability of proviso ii Part B First Schedule Finance Act 1952 questioned, relying on CIT v. Elphinstone Spinning etc.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Finance Act 1952; CIT v. Elphinstone Spinning Weaving Mills Co. Ltd."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court erred in equating s. 35 Income-tax Act with O. 47 r. 1 CPC; language and scope differ. s. 35 allows rectification of mistakes apparent from record within 4 years, including examination of record and evidence; errors of fact or law rectifiable.",
      "addresses_issue": "i1",
      "key_observation": "Power under s. 35 not limited like review under CPC."
    },
    {
      "id": "cr2",
      "text": "Cites Maharana Mills: mistake not one discovered by argument but upon examining record; entitled to rectify if enhances assessment after notice.",
      "addresses_issue": "i1",
      "key_observation": "Initial mistake in written down value rectifiable."
    },
    {
      "id": "cr3",
      "text": "Cites M.K. Venkatachalam: error due to retrospective amendment is apparent from record.",
      "addresses_issue": "i1",
      "key_observation": "Misapplication of law, even retrospective, rectifiable."
    },
    {
      "id": "cr4",
      "text": "s. 18A(8) is mandatory: on regular assessment, if no advance payment, interest to be added.",
      "addresses_issue": "i3",
      "key_observation": "ITO required to calculate and add interest."
    },
    {
      "id": "cr5",
      "text": "Distinguishes respondent's cases: different facts, e.g., no total income or no preceding profits.",
      "addresses_issue": "i2",
      "key_observation": "Finance Act applicable here."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s. 35 empowers ITO to rectify errors apparent from record, including errors of fact or law upon examination; not restricted like CPC O.47 r.1.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Orders under s.35 regarding additional tax and penal interest valid and within jurisdiction.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "s.18A(8) mandatory, levy of penal interest proper.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Maharana Mills Private Ltd. v. Income-tax Officer, Porbandar",
      "citation": "1959 36 I.T.R. 350",
      "treatment": "followed",
      "relevance": "Scope of s.35: rectification of mistakes apparent from record upon examination, not argument."
    },
    {
      "case_name": "M. K. Venkatachalam v. Bombay Dyeing Manufacturing Co. Ltd.",
      "citation": "1958 34 I.T.R. 143",
      "treatment": "followed",
      "relevance": "Error due to retrospective law amendment is apparent from record and rectifiable under s.35."
    },
    {
      "case_name": "Commissioner of Income-tax v. Elphinstone Spinning Weaving Mills Co. Ltd.",
      "citation": "1960 40 I.T.R. 142",
      "treatment": "distinguished",
      "relevance": "No total income, Finance Act inapplicable; facts differ."
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay City v. Jalgaon Electric Supply Co. Ltd.",
      "citation": "1960 40 I.T.R. 184",
      "treatment": "distinguished",
      "relevance": "No profit in preceding year, fiction failed; facts differ."
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay City v. Khatau Makanji Spinning and Weaving Co. Ltd.",
      "citation": "1960 40 I.T.R. 189",
      "treatment": "distinguished",
      "relevance": "Additional tax not on total income; facts differ."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s. 35",
        "s. 15C",
        "s. 18A(8)",
        "s. 18A(3)",
        "s. 18A(6)",
        "s. 33A(2)"
      ],
      "relevance": "s.35 for rectification of apparent mistakes; s.15C deduction allowed; s.18A(8) mandatory penal interest for advance tax shortfall."
    },
    {
      "name": "Finance Act, 1952",
      "sections": [
        "s. 2",
        "Part B, proviso ii of First Schedule"
      ],
      "relevance": "Additional income tax on dividend exceeding undistributed profits."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "High Court petition for writ of certiorari."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "O. 47, r. 1"
      ],
      "relevance": "Analogized by High Court but distinguished by SC for review scope."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court held the High Court order erroneous, reversed it, upheld Income-tax Officer's orders under s.35 rectifying additional tax and imposing penal interest under s.18A(8) as within jurisdiction.",
    "relief_granted": "Appeal allowed; High Court writ quashed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The power under section 35 is no doubt limited to rectification of mistakes which are apparent from the record. A mistake contemplated by this section is not one which is to be discovered as a result of an argument...",
      "speaker": "court",
      "significance": "Defines scope of s.35, distinguishing from debate."
    },
    {
      "text": "s. 18A(8) ... is mandatory. It provides- Where, on making the regular assessment, the Income-tax Officer finds that no payment of tax has been made... interest... shall be added to the tax...",
      "speaker": "court",
      "significance": "Establishes mandatory nature of penal interest levy."
    },
    {
      "text": "The restrictive operation of the power of review under O. 47 R. 1, Civil Procedure Code is not applicable in the case of s. 35 of the Act.",
      "speaker": "court",
      "significance": "Rejects High Court's analogy to CPC review."
    }
  ],
  "_case_id": "1960_127",
  "_label": 1,
  "_text_length": 9206,
  "_extracted_at": "2026-02-10T19:53:15.146889"
}