{
  "metadata": {
    "case_name": "M/s. Muller & Phipps India Ltd. v. K. C. Sud",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Civil Appeal No. 147 of 1960",
    "date_of_judgment": "1960-04-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Sud was a workman of the appellant company, M/s. Muller & Phipps India Ltd.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Sud was retrenched by the company on January 31, 1958.",
      "type": "material",
      "date": "1958-01-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "At the time of retrenchment, a reference on the question of introduction of a gratuity scheme for the workmen of the company was pending before the Industrial Tribunal, with reference dated June 28, 1957.",
      "type": "background",
      "date": "1957-06-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "An application by Sud against the order of retrenchment under S. 33A failed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Industrial Tribunal made an award framing a gratuity scheme applicable from June 28, 1957: On death or incapacity, half a month's basic salary or wages for each year of continuous service to employee/heirs; on voluntary retirement/resignation after five years, same; on termination of service by the company, half a month's basic salary or wages for each year of completed service.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Sud made an application under s. 33C(2) of the Industrial Disputes Act claiming gratuity under the award, as retrenchment amounted to termination of service; he had completed two years of service; basic wage at retrenchment Rs. 80.42 np.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Labour Court, Delhi, in L.C.A. No. 53/1959 dated May 18, 1959, computed amount due to Sud by way of gratuity as Rs. 80.42 np.",
      "type": "procedural",
      "date": "1959-05-18",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Sud had already received retrenchment compensation in accordance with s. 25F of the Industrial Disputes Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondent is entitled to recover gratuity under the scheme in addition to the compensation already received under s. 25F of the Industrial Disputes Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Gratuity claimed is in essence the same as compensation for retrenchment; allowing gratuity in addition to s. 25F compensation would give double benefit for the same event (retrenchment), which is unfair to the employer and against the Industrial Disputes Act.",
      "supporting_facts": [
        "f2",
        "f8"
      ],
      "legal_basis": "Section 25F of the Industrial Disputes Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Retrenchment amounted to termination of service within the meaning of the award; entitled to half a month's basic salary for each year of completed service (Rs. 80.42 np. for two years).",
      "supporting_facts": [
        "f2",
        "f5",
        "f6"
      ],
      "legal_basis": "Gratuity scheme under Industrial Tribunal award; s. 33C(2) of the Industrial Disputes Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Gratuity under schemes is a retirement benefit to help after retirement whatever the cause; retrenchment compensation under s. 25F is relief for sudden termination to tide over unemployment; nothing in law prevents double benefit unless scheme provides otherwise; depends on construction of scheme terms.",
      "addresses_issue": "i1",
      "key_observation": "Cited Indian Hume Pipe Co. v. Its Workers for general principle allowing double benefit."
    },
    {
      "id": "cr2",
      "text": "In Brahmachari Research Institute v. Its Workmen, gratuity for retrenchment as such was in lieu of s. 25F; distinguished here as no specific provision for retrenchment; scheme covers termination by company generally, without distinguishing retrenchment.",
      "addresses_issue": "i1",
      "key_observation": "Reasonable conclusion: gratuity intended in addition to s. 25F compensation, not in lieu."
    },
    {
      "id": "cr3",
      "text": "Workmen urged distinct provision for retrenchment but Tribunal provided for three classes without special retrenchment clause; retrenchment falls under termination but gratuity additional.",
      "addresses_issue": "i1",
      "key_observation": "Labour Court right in holding entitlement to gratuity despite s. 25F payment."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Gratuity under the award is distinct from and in addition to retrenchment compensation under s. 25F; respondent entitled to gratuity of Rs. 80.42 np.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Indian Hume Pipe Co. v. Its Workers",
      "citation": "1960 2 S.C.R. 32",
      "treatment": "followed",
      "relevance": "Gratuity and retrenchment compensation have different objects; double benefit permissible unless scheme provides otherwise; construction of scheme terms decisive."
    },
    {
      "case_name": "Brahmachari Research Institute v. Its Workmen",
      "citation": "1960 2 S.C.R. 45",
      "treatment": "distinguished",
      "relevance": "Gratuity specifically for retrenchment as such was in lieu of s. 25F; differs from present award lacking specific retrenchment provision."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act",
      "sections": [
        "s. 33C",
        "s. 33A",
        "s. 25F"
      ],
      "relevance": "s. 33C(2) for recovery of gratuity under award; s. 33A application failed; s. 25F retrenchment compensation received; gratuity additional unless scheme specifies lieu."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against Labour Court order granting Rs. 80.42 np. gratuity dismissed; held respondent entitled to gratuity under Tribunal award in addition to s. 25F retrenchment compensation.",
    "relief_granted": "Gratuity of Rs. 80.42 np. upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the gratuity which the respondent claims on the basis of the award is distinct from and in addition to the retrenchment compensation he has received.\"",
      "speaker": "court",
      "significance": "Core holding allowing double benefit."
    },
    {
      "text": "\"there was nothing in law to prevent a workman from getting double benefit, one under a gratuity scheme and the other as retrenchment compensation.\"",
      "speaker": "court",
      "significance": "Principle from Indian Hume Pipe case applied."
    }
  ],
  "_case_id": "1960_26",
  "_label": 0,
  "_text_length": 9441,
  "_extracted_at": "2026-02-10T19:51:43.946281"
}