{
  "metadata": {
    "case_name": "State of Bombay v. Respondent (Milk Vendor)",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Ayyangar J."
    ],
    "case_number": "Criminal Appeal No. 56 of 1959",
    "date_of_judgment": "1960-08-31"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent owned a milk shop within the Municipal limits of the city of Baroda.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Food Inspector of the Municipality visited the shop on July 9, 1956 and purchased milk for analysis.",
      "type": "material",
      "date": "1956-07-09",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The milk sample was sent to the Public Analyst, whose report stated that the sample was adulterated.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Inspector applied to the Chief Officer, Borough Municipality, Baroda, for consent to institute criminal proceedings under the Prevention of Food Adulteration Act, 1954.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Chief Officer gave written consent on October 13, 1956, to the initiation of prosecution against the respondent.",
      "type": "procedural",
      "date": "1956-10-13",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The consent stated: 'Under authority vested in the Chief Officer of the Baroda Borough Municipality sanction is hereby given for instituting prosecution against the following milk vendors for contravening the provisions of Government of India's Prevention of Food Adulteration Act, 1954.' It listed the respondent's name, address, and date of offence, and noted it was after reviewing the Milk Analysis Report and other documents.",
      "type": "material",
      "date": "1956-10-13",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Complaint instituted charging respondent with offence under s.16 read with s.7 of the Act for selling adulterated food.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Baroda Municipal Borough authorized the Chief Officer and Health Officer by resolution No. 222 dated May 7, 1956, to grant sanction under the Act.",
      "type": "background",
      "date": "1956-05-07",
      "source": "magistrate"
    },
    {
      "id": "f9",
      "text": "Case tried by Special Judicial Magistrate, First Class, Baroda. Accused denied guilt and raised objection under s.20(1) that prosecution incompetent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Magistrate overruled objections, held accused guilty, sentenced to fine of Rs. 300/- and in default rigorous imprisonment for three months.",
      "type": "procedural",
      "date": "1957-06-07",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appeal to Sessions Judge, Baroda (Criminal Appeal No. 33 of 1957). Sessions Judge set aside conviction relying on Cannanore Milk Supply case, holding only State Government competent.",
      "type": "procedural",
      "date": "1957-06-07",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "State filed appeal to Bombay High Court, converted to Criminal Revision No. 1671 of 1957. High Court affirmed Sessions Judge, holding consent invalid as it did not name the Food Inspector.",
      "type": "procedural",
      "date": "1957-12-18",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Supreme Court granted special leave for appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Construction of s.20(1) of the Prevention of Food Adulteration Act, 1954: Whether prosecution can be instituted with written consent of local authority or person authorized by it, and whether such consent must name the person instituting the complaint.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Prosecution competent under s.20(1) as consent given by Chief Officer authorized by local authority; written consent need not name the complainant, analogous to s.197 CrPC.",
      "supporting_facts": [
        "f5",
        "f6",
        "f8"
      ],
      "legal_basis": "s.20(1) Prevention of Food Adulteration Act, 1954; s.197 CrPC (analogy)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Prosecution incompetent due to non-compliance with s.20(1).",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.20(1) Prevention of Food Adulteration Act, 1954"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Agrees with High Court that s.20(1) allows prosecution by or with written consent of State Government, local authority, or person authorized by either; rejects Sessions Judge's view limiting to State Government only.",
      "addresses_issue": "i1",
      "key_observation": "Plain grammatical meaning includes consents from local authorities due to commas."
    },
    {
      "id": "cr2",
      "text": "Written consent need not name the complainant; statute does not prescribe it, reason is to prevent frivolous prosecutions by requiring authority to apply mind to facts, not to specify complainant.",
      "addresses_issue": "i1",
      "key_observation": "Consent is for specified prosecution, not to a person; Analyst's report was considered."
    },
    {
      "id": "cr3",
      "text": "Sub-section distinguishes between authorities who can institute directly and those requiring consent; emphasis on consent to prosecution, not to person.",
      "addresses_issue": "i1",
      "key_observation": "Consent filed with complaint, not available to all; no administrative control issue even if name specified."
    },
    {
      "id": "cr4",
      "text": "Distinguishes Cannanore case as requiring rewrite of statute.",
      "addresses_issue": "i1",
      "key_observation": "Madras HC view impossible without inserting 'by' before local authority."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Prosecution instituted validly under s.20(1) with written consent of Chief Officer authorized by local authority; consent need not name the Food Inspector.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Cannanore Milk Supply Co-operative Society, In re",
      "citation": "1956 2 M.L.J. 465",
      "treatment": "distinguished",
      "relevance": "Rejected Sessions Judge's reliance; its construction requires rewriting s.20(1) to exclude local authority consents."
    }
  ],
  "statutes_cited": [
    {
      "name": "Prevention of Food Adulteration Act, 1954",
      "sections": [
        "s.20(1)",
        "s.16",
        "s.7"
      ],
      "relevance": "Central issue on s.20(1) requiring written consent for prosecution; offence under s.16 r/w s.7 for adulterated food."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s.197"
      ],
      "relevance": "Analogy for sanction not needing to name complainant, though decision rested on Act's terms."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order set aside; Sessions Judge's order reversed; Magistrate's conviction and sentence of Rs.300 fine or 3 months RI restored, as prosecution validly instituted under s.20(1).",
    "relief_granted": "Conviction and sentence restored in favour of State.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"No prosecution for an offence under this Act shall be instituted except by, or with the written consent of, the State Government or a local authority or a person authorised in this behalf by the State Government or a local authority.\"",
      "speaker": "court",
      "significance": "Exact text of s.20(1) interpreted by Court."
    },
    {
      "text": "The plain grammatical meaning of this section is that the written consent may be of the State Government, or a local authority, or a person authorised in that behalf by the State Government or local authority.",
      "speaker": "court",
      "significance": "Court's construction allowing consents from local authorities."
    },
    {
      "text": "To read by implication that before granting a written consent, the authority competent to initiate a prosecution should apply its mind to the facts of the case and satisfy itself that a prima facie case exists... but the further implication that the complainant must be named... does not follow.",
      "speaker": "court",
      "significance": "Core reasoning why naming complainant not required."
    }
  ],
  "_case_id": "1960_35",
  "_label": 1,
  "_text_length": 15436,
  "_extracted_at": "2026-02-10T19:51:49.972785"
}