{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Elphinstone Spinning and Weaving Mills Co. Ltd.",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": "Civil Appeal No. 427 of 1957",
    "date_of_judgment": "1960-05-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "For the assessment year 1951-52 (previous year calendar year 1950), the assessee Company was found to have incurred a loss of Rs. 2,19,848.",
      "type": "material",
      "date": "1950-12-31",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In that year, the assessee Company had made profits, but depreciation allowance under Income-tax Act was Rs. 7,84,063, converting profit into loss for income-tax purposes.",
      "type": "material",
      "date": "1950-12-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The assessee Company declared dividends amounting to Rs. 3,29,062.",
      "type": "material",
      "date": "1950-12-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Income-tax Officer treated the dividend amount as excess dividend and levied additional income-tax of Rs. 41,132-12-0 under Paragraph B of Part I of First Schedule to Indian Finance Act, 1951.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Assessee's contention that it was not liable to pay additional income-tax was not accepted by Income-tax Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Bombay High Court in reference under s.66(1) of Indian Income-tax Act answered first question (liability to additional income-tax) in negative and left second question unanswered.",
      "type": "procedural",
      "date": "1955-09-09",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appeal to Supreme Court on certificate granted by Bombay High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the assessee Company was liable to pay additional income-tax?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If the answer to question No. 1 is in the affirmative, whether the levy of the additional income-tax is ultra vires?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court ought to have read Paragraph B as modified by intention or treated it as independent charging section.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "Paragraph B of Part I of First Schedule to Finance Act, 1951; precedents like Curtis v. Stovin, CIT v. Teja Singh"
    },
    {
      "id": "pa2",
      "text": "Tax imposed on excess dividend; where income is nil or negative, whatever paid is excess dividend.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "Proviso to Paragraph B; Commissioners of Inland Revenue v. South Georgia Co. Ltd."
    },
    {
      "id": "pa3",
      "text": "Proviso prescribes varying rates; fiction of excess dividend from undistributed profits of preceding years makes profits take place of total income.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "Proviso to Paragraph B"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Inasmuch as there was no income at all which was taxable, the words 'on the total income' did not apply and no additional income-tax could be charged.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Indian Income-tax Act s.3; Finance Act, 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "If there is no income, no question of applying a rate to total income; no income-tax or super-tax can result. Expression 'total income' means total income as determined under Income-tax Act.",
      "addresses_issue": "i1",
      "key_observation": "Liability to tax imposed by Income-tax Act s.3; Finance Act prescribes rates."
    },
    {
      "id": "cr2",
      "text": "Proviso to discourage disproportionate dividends; ceiling of nine annas in rupee of total income; additional tax on excess, but charged on total income.",
      "addresses_issue": "i1",
      "key_observation": "When total income is negative, words like 'total income', 'profits liable to tax' cease to have meaning."
    },
    {
      "id": "cr3",
      "text": "Cannot ignore words as surplusage or drafting error; courts cannot supply omission by legislature in taxing statutes.",
      "addresses_issue": "i1",
      "key_observation": "Relies on Cape Brandy Syndicate, Wolfson v. CIR; rejects strained construction."
    },
    {
      "id": "cr4",
      "text": "Proviso not independent charging section; only prescribes rates applicable to total income under s.3 of Income-tax Act.",
      "addresses_issue": "i1",
      "key_observation": "Additional tax is difference between rates; no words making excess dividend into income independently."
    },
    {
      "id": "cr5",
      "text": "Fiction of excess dividend from preceding years cannot make profits replace non-existent total income of previous year.",
      "addresses_issue": "i1",
      "key_observation": "Fiction limited to its purpose."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Assessee Company not liable to pay additional income-tax as there was no total income (loss after depreciation).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Second question does not survive.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Curtis v. Stovin",
      "citation": "1889 22 Q.B. 513",
      "treatment": "distinguished",
      "relevance": "Words read to give sensible meaning consistent with intention."
    },
    {
      "case_name": "Commissioner of Income-tax v. Teja Singh",
      "citation": "1959 35 I.T.R. 408 S.C.",
      "treatment": "referred",
      "relevance": "Avoid construction making section nugatory; statute must be workable."
    },
    {
      "case_name": "Whitney v. Commissioners of Inland Revenue",
      "citation": "1925 10 T.C. 88",
      "treatment": "followed",
      "relevance": "Interpretation to secure workable statute unless crucial omission."
    },
    {
      "case_name": "Special Commissioners of Income-tax v. Linsleys Ltd.",
      "citation": "1958 37 T.C. 677",
      "treatment": "distinguished",
      "relevance": "Obvious drafting error in description ignored."
    },
    {
      "case_name": "Commissioners of Inland Revenue v. South Georgia Co. Ltd.",
      "citation": "1958 37 T.C. 725",
      "treatment": "distinguished",
      "relevance": "Nil profits; different scheme where tax on net relevant distributions."
    },
    {
      "case_name": "The Cape Brandy Syndicate v. The Commissioners of Inland Revenue",
      "citation": "1920 12 T.C. 358",
      "treatment": "followed",
      "relevance": "In taxing measures, only look at language; no room for intendment."
    },
    {
      "case_name": "Wolfson v. Commissioners of Inland Revenue",
      "citation": "1949 31 T.C. 141",
      "treatment": "followed",
      "relevance": "No strained meaning to close loopholes; give reasonable meaning."
    },
    {
      "case_name": "McGregor Balfour Ltd. v. Commissioner of Income-tax",
      "citation": "1950 36 I.T.R. 65 S.C.",
      "treatment": "referred",
      "relevance": "Words apt to impose charge unless deemed income."
    },
    {
      "case_name": "Rajputana Agencies Ltd. v. Commissioner of Income-tax",
      "citation": "1959 35 I.T.R. 168",
      "treatment": "distinguished",
      "relevance": "No support for appellant."
    },
    {
      "case_name": "Commissioner of Income-tax v. Calcutta National Bank Ltd.",
      "citation": "1959 37 I.T.R. 171",
      "treatment": "distinguished",
      "relevance": "Schedule beyond purpose not applicable here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s. 66(1)",
        "s. 3",
        "s. 23A(1)",
        "s. 18(3D)",
        "s. 18(3E)",
        "s. 2(6A)"
      ],
      "relevance": "Reference under s.66(1); charging section s.3; total income determination; excess dividend definition and fiction."
    },
    {
      "name": "Indian Finance Act, 1951",
      "sections": [
        "s. 2",
        "First Schedule Paragraph B"
      ],
      "relevance": "Rates of tax including additional income-tax on excess dividends; total income as per Income-tax Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Bombay High Court's answer to first question in negative; assessee not liable for additional income-tax due to absence of total income (loss); second question does not survive.",
    "relief_granted": "No additional income-tax payable by assessee.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "If there is no income, there is no question of applying a rate to the total income and no income-tax or super-tax can possibly result.",
      "speaker": "court",
      "significance": "Core reasoning on absence of chargeable income."
    },
    {
      "text": "The Courts cannot, except rarely and in clear cases, help the draftsman by a favourable construction.",
      "speaker": "court",
      "significance": "Limits judicial role in taxing statutes."
    },
    {
      "text": "There seems to be no logic, there seems to be no reason nor principle why a distinction should be made between the cases of two such companies. But if life is no logic, income-tax is much less so.",
      "speaker": "court",
      "significance": "Acknowledges anomaly but adheres to literal interpretation (quoting High Court)."
    }
  ],
  "_case_id": "1960_29",
  "_label": 0,
  "_text_length": 27630,
  "_extracted_at": "2026-02-10T19:51:51.364999"
}