{
  "metadata": {
    "case_name": "State of Uttar Pradesh v. Dr. Ram Manohar Lohia",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO J."
    ],
    "case_number": "Criminal Appeal No. 76 of 1956",
    "date_of_judgment": "1960-01-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, Dr. Ram Manohar Lohia, is the General Secretary of the Socialist Party of India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The U. P. Government enhanced the irrigation rates for water supplied from canals to cultivators.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The party to which the respondent belongs resolved to start an agitation against the said enhancement for the alleged reason that it placed an unbearable burden upon the cultivators.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Pursuant to the policy of his party, the respondent visited Farrukhabad and addressed two public meetings wherein he made speeches instigating the audience not to pay enhanced irrigation rates to the Government.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On July 4, 1954, at 10 p.m. he was arrested and produced before the City Magistrate, Farrukhabad, who remanded him for two days.",
      "type": "procedural",
      "date": "1954-07-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "After investigation, the Station Officer, Kaimganj, filed a charge-sheet against the respondent before Sri P. R. Gupta, a Judicial Officer at Farrukhabad.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On July 6, 1954, the Magistrate went to the jail to try the case against the respondent, but the latter took objection to the trial being held in the jail premises.",
      "type": "procedural",
      "date": "1954-07-06",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "When the Magistrate insisted upon proceeding with the trial, the respondent obtained an adjournment on the ground that he would like to move the High Court for transfer of the case from the file of the said Magistrate.",
      "type": "procedural",
      "date": "1954-07-06",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Thereafter the respondent filed a petition before the High Court for a writ of habeas corpus on the ground, among others, that s. 3 of the U. P. Special Powers Act, 1932, hereinafter called the Act, was void under the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In the first instance the petition came up for disposal before a division bench of the High Court at Allahabad consisting of Desai and Chaturvedi JJ. Elaborate arguments were addressed before them concerning a wide field.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The learned Judges delivered differing judgments expressing their views on the main points raised before them. They referred the matter to the Chief Justice for obtaining the opinion of a third Judge on the following two points: (i) Was the provision of s. 3 of the U. P. Special Powers Act of 1932 making it penal for a person by spoken words to instigate class of persons not to pay dues recoverable as arrears of land revenue, inconsistent with Art. 19(1)(a) of the Constitution on the 26th of January, 1950? and (ii) if so, was it in the interests of public order?",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The petition was placed before Agarwala, J., as a third Judge, who agreeing with Desai, J., gave the following answers: Question No. (i) The provision of sections of the U. P. Special Powers Act, 1932, making it penal for a person by spoken words to instigate a class of persons not to pay dues recoverable as arrears of land revenue, was inconsistent with Article 19(1)(a) of the Constitution on the 26th January, 1950. Question No. (ii) The restrictions imposed by section 3 of the U. P. Special Powers Act, 1932, were not in the interests of public order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "In the usual course the matter was placed before the two learned Judges who first heard the case and they, on the basis of the majority view, allowed the petition and directed the respondent to be released.",
      "type": "procedural",
      "date": "1954-08-27",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The State has preferred the present appeal against the said order of the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The Act was originally passed in the year 1932 during the British rule. In an attempt to offset the campaign of non-payment of taxes and other forms of agitation resorted to by the Congress Party, originally it was put on the statute book for one year but in 1940 when the State was under the Governors rule, the Act was made permanent.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Under the Act, ss. 1 and 2 came into effect immediately on the passing of the Act and S. (1)(2) enabled the Government by notification to extend all or any of the remaining sections to any district or to any part of a district in the United Provinces.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "After the Constitution, the Act was not repealed but was allowed to continue, with necessary adaptations, in the statute book.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Between April and June, 1954, the State Government extended the provisions of the Act to 33 districts including Farrukhabad district.",
      "type": "background",
      "date": "1954-04 to 1954-06",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "This appeal raises the question of interpretation of the words 'in the interest of public order' in Art. 19(2) of the Constitution.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Was the provision of s. 3 of the U. P. Special Powers Act of 1932 making it penal for a person by spoken words to instigate class of persons not to pay dues recoverable as arrears of land revenue, inconsistent with Art. 19(1)(a) of the Constitution on the 26th of January, 1950?",
      "framed_by": "lower_court"
    },
    {
      "id": "i3",
      "text": "If so, was it in the interests of public order?",
      "framed_by": "lower_court"
    },
    {
      "id": "i4",
      "text": "Whether s. 3 of the U. P. Special Powers Act, 1932 is void under Art. 19(1)(a) read with Art. 19(2).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The legislature can make laws placing reasonable restrictions on the rights of a citizen to freedom of speech and expression in the interests of public order among other grounds. The words 'in the interests of public order' are wider in connotation than the words 'for the maintenance of public order'.",
      "supporting_facts": [
        "f2",
        "f15"
      ],
      "legal_basis": "Art. 19(2)"
    },
    {
      "id": "pa2",
      "text": "The avowed object of s. 3 of the Act was to prevent persons from instigating others to break the laws imposing a liability upon a person or class of persons to pay taxes and other dues to the State, any authority or to any land-owner. The impugned section was enacted in the interests of public order and therefore the section was protected by Art. 19(2) of the Constitution.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s. 3 U.P. Special Powers Act, 1932; Art. 19(2)"
    },
    {
      "id": "pa3",
      "text": "The phrase 'in the interest of public order' is of a wider connotation than the words 'for the maintenance of public order' and, therefore, any breach of law which may have the tendency, however remote, to disturb the public order would be covered by the said phrase.",
      "supporting_facts": [],
      "legal_basis": "Ramji Lal Modi v. The State of U.P."
    },
    {
      "id": "pa4",
      "text": "The section is severable and if so severed, the section may be made to function within the limited field that stands the test of Art. 19(2) of the Constitution, by reading it to apply only to instigation of a class of persons.",
      "supporting_facts": [],
      "legal_basis": "Art. 13(1); Art. 19(2)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Supported the majority view of the High Court that s.3 is inconsistent with Art. 19(1)(a) and the restrictions are not in the interests of public order.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The learned Advocate General stated that he did not propose to canvass the correctness of the majority view that the effect of the passing of the Act did not ipso facto deprive a citizen of his freedom of speech guaranteed under Art. 19(1)(a) and its validity should be tested by the provisions of Art. 19(2) thereof. He did not concede the validity of the finding in this regard but assumed its correctness for the purpose of this case.",
      "addresses_issue": "i4",
      "key_observation": "Assumed for purpose of case that validity tested under Art. 19(2)."
    },
    {
      "id": "cr2",
      "text": "To sustain the existing law or a new law made by the State under cl. (2) of Art. 19, two conditions should be complied with: (i) the restrictions imposed must be reasonable and (ii) they should be in the interests of public order.",
      "addresses_issue": "i1",
      "key_observation": "Two conditions for validity under Art. 19(2)."
    },
    {
      "id": "cr3",
      "text": "Public order has a very wide connotation. Order is the basic need in any organised society. It implies the orderly state of society or community in which citizens can peacefully pursue their normal activities of life.",
      "addresses_issue": "i1",
      "key_observation": "Definition of public order."
    },
    {
      "id": "cr4",
      "text": "Public order is synonymous with public peace, safety and tranquillity.",
      "addresses_issue": "i1",
      "key_observation": "Narrowed meaning in context of Art. 19(2)."
    },
    {
      "id": "cr5",
      "text": "The expression 'in the interests of' makes the ambit of protection very wide, but does not mean any remote or fanciful connection. There must be intimate connection; restrictions must have reasonable relation to the object and not go in excess.",
      "addresses_issue": "i1",
      "key_observation": "Proximate nexus required."
    },
    {
      "id": "cr6",
      "text": "The limitation imposed in the interests of public order to be a reasonable restriction, should be one which has a proximate connection or nexus with public order, but not one far-fetched, hypothetical or problematical or too remote in the chain of its relation with the public order.",
      "addresses_issue": "i1",
      "key_observation": "Test from Rex v. Basudeva."
    },
    {
      "id": "cr7",
      "text": "Have the acts prohibited under s. 3 any proximate connection with public safety or tranquility? The section casts a wide net including innocent and guilty, bona fide and mala fide advice. There is no proximate or even foreseeable connection between such instigation and the public order.",
      "addresses_issue": "i4",
      "key_observation": "No proximate nexus for s.3."
    },
    {
      "id": "cr8",
      "text": "Fundamental rights cannot be controlled on such hypothetical and imaginary considerations. Unless there is a proximate connection between the instigation and the public order, the restriction is neither reasonable nor in the interest of public order.",
      "addresses_issue": "i4",
      "key_observation": "s.3 infringing Art. 19(1)(a)."
    },
    {
      "id": "cr9",
      "text": "The doctrine of severability does not apply as the language is wide enough to cover restrictions both within and without constitutionally permissible limits, and possibility of application for purposes not sanctioned cannot be ruled out. Even with suggested severance to 'class of persons', defects remain.",
      "addresses_issue": "i4",
      "key_observation": "Section not severable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s. 3 of the U.P. Special Powers Act, 1932 is void as infringing the fundamental right guaranteed under Art. 19(1)(a) of the Constitution.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Public order is synonymous with public safety and tranquillity; it is the absence of disorder involving breaches of local significance in contradistinction to national upheavals.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "There must be proximate and reasonable nexus between the speech and the public order; s.3 does not establish such nexus in most cases comprehended by it.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "The provisions of the section are so inextricably mixed up that it is not possible to apply the doctrine of severability.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "The prosecution of the respondent under that section is void.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Romesh Thappar v. The State of Madras",
      "citation": "1950 S.C.R. 594",
      "treatment": "followed",
      "relevance": "Interpreted 'security of the State' narrowly; public order equated with public tranquillity; minor breaches not covered."
    },
    {
      "case_name": "Brij Bhushan v. The State of Delhi",
      "citation": "1950 S.C.R. 605",
      "treatment": "followed",
      "relevance": "Followed Romesh Thappar; dissenting view on wider public order."
    },
    {
      "case_name": "State of Bihar v. Shailabala Devi",
      "citation": "1952 S.C.R. 654",
      "treatment": "referred",
      "relevance": "Explained Romesh Thappar post-amendment; incitement to violence covered."
    },
    {
      "case_name": "Ramji Lal Modi v. The State of U.P.",
      "citation": "1957 S.C.R. 860",
      "treatment": "distinguished",
      "relevance": "'In the interests of' wider than 'for maintenance of', but requires proximate connection."
    },
    {
      "case_name": "Virendra v. The State of Punjab",
      "citation": "1958 S.C.R. 308",
      "treatment": "referred",
      "relevance": "Words 'in the interests of' of great amplitude."
    },
    {
      "case_name": "Rex v. Basudeva",
      "citation": "A.I.R. 1950 F.C. 67",
      "treatment": "followed",
      "relevance": "Connection must be real and proximate, not remote."
    },
    {
      "case_name": "Chintaman Rao v. The State of Madhya Pradesh",
      "citation": "1950 S.C.R. 759",
      "treatment": "followed",
      "relevance": "Wide language covering impermissible restrictions not severable."
    },
    {
      "case_name": "R. M. D. Chamarbaugwalla v. The Union of India",
      "citation": "1957 S.C.R. 930",
      "treatment": "distinguished",
      "relevance": "Doctrine of severability; rules of construction where clear demarcation possible."
    },
    {
      "case_name": "Cantwell v. Connecticut",
      "citation": "1940 310 U.S. 296",
      "treatment": "referred",
      "relevance": "Breach of peace includes conduct menacing public order; clear and present danger."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 19(1)(a)",
        "Article 19(2)",
        "Article 13(1)"
      ],
      "relevance": "Freedom of speech; reasonable restrictions in interests of public order; laws inconsistent with Part III void to extent of inconsistency."
    },
    {
      "name": "U. P. Special Powers Act, 1932",
      "sections": [
        "Section 3",
        "Section 2",
        "Section 4",
        "Section 1(2)"
      ],
      "relevance": "Punishment for instigation not to pay liability; definition of liability; recovery as arrears; extension to districts. Held void under Art. 19(1)(a)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's order allowing the habeas corpus petition and directing release of the respondent. Held s.3 of U.P. Special Powers Act, 1932 void as imposing unreasonable restrictions on freedom of speech under Art. 19(1)(a) lacking proximate nexus to public order. Prosecution under s.3 void. State's appeal dismissed.",
    "relief_granted": "Upheld High Court order directing release of respondent; s.3 struck down.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Public order is synonymous with public peace, safety and tranquillity.\"",
      "speaker": "court",
      "significance": "Defines scope of 'public order' under Art. 19(2)."
    },
    {
      "text": "\"The connection contemplated must, in our view, be real and proximate, not far-fetched or problematical.\"",
      "speaker": "court",
      "significance": "Test for nexus between restriction and public order."
    },
    {
      "text": "\"Unless there is a proximate connection between the instigation and the public order, the restriction, in our view, is neither reasonable nor is it in the interest of public order.\"",
      "speaker": "court",
      "significance": "Core holding striking down s.3."
    },
    {
      "text": "\"So long as the possibility of its being applied for purposes not sanctioned by the Constitution cannot be ruled out, it must be held to be wholly unconstitutional and void.\"",
      "speaker": "court",
      "significance": "On non-severability of wide provisions."
    }
  ],
  "_case_id": "1960_133",
  "_label": 0,
  "_text_length": 38009,
  "_extracted_at": "2026-02-10T19:53:22.583484"
}