{
  "metadata": {
    "case_name": "Appellant (Defendant No. 1) v. Sridhar (Respondent No. 1)",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur J."
    ],
    "case_number": "Civil Appeal No. 167 of 1955",
    "date_of_judgment": "1960-08-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On April 10, 1943, D. B. Ghaisas and his mother Ramabai entered into two contracts of sale with the appellant: one for Survey Nos. 5, 14 and 16 for Rs. 10,000 (Rs. 2,000 earnest money paid), and the other for Survey No. 15/1 for Rs. 8,500 (Rs. 500 earnest money paid).",
      "type": "material",
      "date": "1943-04-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On April 16, 1943, the vendors executed a registered sale deed for Survey Nos. 5, 14 and 16, and the balance of the price was paid before the Registrar.",
      "type": "material",
      "date": "1943-04-16",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On April 22, 1943, the vendors executed a lease of Survey No. 15/1 for 14 years in favour of Kisanlal and Sitaram (defendant Nos. 2 and 3, respondents Nos. 2 and 3).",
      "type": "material",
      "date": "1943-04-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On April 24, 1943, the vendors executed a fresh agreement of sale in respect of Survey No. 15/1, to be diverted to non-agricultural purposes, after which a sale deed was to be executed; appellant to pay costs of diversion and premium.",
      "type": "material",
      "date": "1943-04-24",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On August 12, 1943, the vendors applied to the Deputy Commissioner, Akola, for diversion under s. 58 of the Berar Land Revenue Code.",
      "type": "procedural",
      "date": "1943-08-12",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On January 22, 1944, sanction for diversion was accorded subject to payment of premium of Rs. 9,222 and other conditions. Appellant's case is that vendors were paid this money for deposit, deposited via Challan No. 68, but no finding in favour of appellant.",
      "type": "disputed",
      "date": "1944-01-22",
      "source": "appellant | court"
    },
    {
      "id": "f7",
      "text": "On February 1, 1944, the sale deed for Survey No. 15/1 was executed by the vendors in favour of the appellant for consideration of Rs. 17,722.",
      "type": "material",
      "date": "1944-02-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent Sridhar, owner of Survey No. 15/2 (co-occupancy), brought suit for pre-emption on September 11, 1943, alleging contracts of April 10 and 24, 1943 constituted a sale subject to his prior right, and price not fixed in good faith.",
      "type": "procedural",
      "date": "1943-09-11",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Trial court and District Judge held Sridhar entitled to pre-empt, fair consideration Rs. 3,306, decreed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court in Second Appeal No. 720 of 1945 (judgment November 22, 1951) confirmed decree, holding transaction was a sale subject to pre-emption, failure to execute deed a subterfuge, diversion proceedings pendente lite and conditional.",
      "type": "procedural",
      "date": "1951-11-22",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a right of pre-emption had accrued to respondent Sridhar under Chapter XIV of the Berar Land Revenue Code, 1928, prior to the execution of the registered sale deed on February 1, 1944, based on contracts dated April 10 and 24, 1943.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether 'sale' under s. 176 of the Berar Land Revenue Code has a wider connotation than under s. 54 of the Transfer of Property Act, and whether contracts constitute a sale triggering pre-emption.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the transactions were a subterfuge or fraud to defeat pre-emption rights.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No sale until registered sale deed executed on February 1, 1944; contracts do not pass title under s. 54 TP Act, which applies in Berar and overrides personal law; suit premature as no pre-emptible transfer occurred.",
      "supporting_facts": [
        "f1",
        "f4",
        "f7",
        "f8"
      ],
      "legal_basis": "Transfer of Property Act, s. 54; Registration Act, ss. 17, 49"
    },
    {
      "id": "pa2",
      "text": "No fraud in delaying registration to avoid pre-emption; lawful to defeat weak right of pre-emption by legitimate means; if suit based on Feb 1 sale, defence on diversion would apply.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Bishan Singh v. Khazan Singh"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Transactions of April 10 and 24, 1943 constituted a sale subject to pre-emption; failure to execute registered deed a subterfuge; price not fixed in good faith; 'sale' in Code wider than TP Act.",
      "supporting_facts": [
        "f1",
        "f4",
        "f8"
      ],
      "legal_basis": "Berar Land Revenue Code, Ch. XIV; Begum v. Mohammad Yakub; Jainarayan Ramgopal Marwadi v. Balwant Maroti Shingore"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Right of pre-emption under Berar Land Revenue Code arises only on completed sale; TP Act s. 54 governs transfers in Berar, requires registration for immovable property >= Rs.100; contracts create no interest or title.",
      "addresses_issue": "i1",
      "key_observation": "No title passes without registered instrument; suit filed before sale deed, no pre-emptible transfer."
    },
    {
      "id": "cr2",
      "text": "'Sale' under Code interpreted consistently with TP Act; precedents like Begum distinguished as not overriding statutory transfer requirements; pre-emption right weak, can be avoided by lawful means.",
      "addresses_issue": "i2",
      "key_observation": "Mohammedan law inapplicable where TP Act in force."
    },
    {
      "id": "cr3",
      "text": "No fraud; parties entitled to legitimate avoidance; equities not in favour of pre-emptor.",
      "addresses_issue": "i3",
      "key_observation": "Right in derogation of owner's alienation right."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No right of pre-emption arises until valid sale under s. 54 TP Act (registered deed); contracts insufficient.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "TP Act governs transfers; personal/customary law subordinate.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "No fraud in lawful avoidance of pre-emption.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Begum v. Mohammad Yakub",
      "citation": "1894 I.L.R. 16 All. 344",
      "treatment": "distinguished",
      "relevance": "Observations on 'sale' under Mohammedan law not overriding TP Act registration requirement."
    },
    {
      "case_name": "Sitaram Bhaurao Deshmukh v. Jiaul Hasan Sirajul Khan",
      "citation": "1921 48 I.A. 475",
      "treatment": "distinguished",
      "relevance": "Intention determines sale date for ceremonies, but registered deeds existed; approves looking to intention but subject to TP Act."
    },
    {
      "case_name": "Immudipattam Thirugnana O. Kondema Naik v. Peria Dorasami",
      "citation": "1900 28 I.A. 46",
      "treatment": "followed",
      "relevance": "Immoveable property cannot be transferred except by registered instrument."
    },
    {
      "case_name": "Janki v. Girjadat",
      "citation": "1885 I.L.R. 7 All. 482",
      "treatment": "followed",
      "relevance": "Valid perfected sale precondition to pre-emption; contracts insufficient."
    },
    {
      "case_name": "Bishan Singh v. Khazan Singh",
      "citation": "1959 S.C.R. 878",
      "treatment": "followed",
      "relevance": "Pre-emption weak right, defeatable by legitimate means."
    },
    {
      "case_name": "Jainarayan Ramgopal Marwadi v. Balwant Maroti Shingore",
      "citation": "A.I.R. 1939 Nag. 35",
      "treatment": "distinguished",
      "relevance": "High Court view on wider 'sale' under Code, but overruled by TP Act application."
    }
  ],
  "statutes_cited": [
    {
      "name": "Berar Land Revenue Code, 1928",
      "sections": [
        "s. 58",
        "s. 174",
        "s. 176",
        "s. 177",
        "s. 178",
        "s. 183",
        "s. 184",
        "Ch. XIV"
      ],
      "relevance": "Governs pre-emption rights on transfers of occupancy land by sale, mortgage, lease >15 years; right vests in co-occupants via suit."
    },
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [
        "s. 2",
        "s. 54"
      ],
      "relevance": "Defines sale as transfer by registered instrument for immovable property >= Rs.100; applies in Berar, overrides personal law."
    },
    {
      "name": "Registration Act",
      "sections": [
        "s. 17",
        "s. 49"
      ],
      "relevance": "Unregistered documents affecting immovable property >= Rs.100 ineffective and inadmissible."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal by special leave allowed; High Court decree and subordinate courts' decrees set aside; no right of pre-emption arose before registered sale deed, suit premature.",
    "relief_granted": "Decree of pre-emption suit reversed in favour of appellant.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Under s. 54 of the Transfer of Property Act a contract for sale does not of itself create any interest in or charge on immovable property and consequently the contract in the instant case created no interest in favour of the vendee and the proprietary title did not validly pass.\"",
      "speaker": "court",
      "significance": "Core holding on why no pre-emption right accrued."
    },
    {
      "text": "\"The right to pre-empt the sale is not exercisable till a pre-emptible transfer has been effected and the right of pre-emption is not one which is looked upon with great favour by the courts.\"",
      "speaker": "court",
      "significance": "Explains judicial reluctance and permissibility of avoidance."
    },
    {
      "text": "\"To defeat the law of pre-emption by any legitimate means is not fraud on the part of either the vendor or the vendee.\"",
      "speaker": "court",
      "significance": "Rejects fraud allegation."
    }
  ],
  "_case_id": "1960_91",
  "_label": 1,
  "_text_length": 20726,
  "_extracted_at": "2026-02-10T19:52:31.096604"
}