{
  "metadata": {
    "case_name": "Appellant v. Respondents",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO, J."
    ],
    "case_number": "Civil Appeal No. 38 of 1960",
    "date_of_judgment": "1960-04-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant had executed two usufructuary mortgages with respect to two properties situate in Ferozepore city in favour of the respondents in 1946.",
      "type": "material",
      "date": "1946",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant also took both properties on lease on the same date.",
      "type": "material",
      "date": "1946",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "An application was filed by the respondents under s. 13 of the Displaced Persons (Debts Adjustment) Act, No. LXX of 1951, for recovery of the principal sum due as well as the rent which was said to be in arrears.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "The application was resisted by the appellant on various grounds, one of which was that no such application lay as the liability was not a debt under the Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "The tribunal negatived the contention of the appellant and passed a preliminary decree for sale. Six months time was allowed to the appellant to pay the decretal amount, failing which the respondents were at liberty to get a final decree prepared and bring the properties to sale.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The appellant went in appeal to the High Court but the appeal was dismissed (judgment and order dated June 15, 1954, in First Appeal from Order No. 149 of 1953).",
      "type": "procedural",
      "date": "1954-06-15",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Letters Patent Appeal No. 52 of 1954 was dismissed by the Punjab High Court on October 6, 1958.",
      "type": "procedural",
      "date": "1958-10-06",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The appellant applied for and was granted special leave by this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the liability created under a mortgage is a debt within the meaning of s. 2(6) of the Displaced Persons (Debts Adjustment) Act, 1951.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The liability under a mortgage is not a pecuniary liability and therefore s. 2(6) will not apply to a mortgage debt.",
      "supporting_facts": [],
      "legal_basis": "s. 2(6) of the Displaced Persons (Debts Adjustment) Act, 1951"
    },
    {
      "id": "pa2",
      "text": "The scheme of the Act shows that mortgages in relation to properties situate in what is now India are not covered by the Act at all.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "sub-cl. (b) of s. 2(6); proviso to sub-cl. (b); ss. 16, 17 of the Act"
    },
    {
      "id": "pa3",
      "text": "s. 16(5) requires a creditor to elect to be treated as an unsecured creditor before taking benefit of the Act.",
      "supporting_facts": [],
      "legal_basis": "s. 16(5) of the Act"
    },
    {
      "id": "pa4",
      "text": "If mortgage debts on property situate in India were covered, there is no machinery like s. 16 for enforcement of the creditor's rights.",
      "supporting_facts": [],
      "legal_basis": "ss. 10, 13 of the Act"
    },
    {
      "id": "pa5",
      "text": "Empowering displaced creditor under s. 2(6)(c) and s. 13 for mortgage debt would cause hardship to prior or subsequent mortgagees as they cannot be joined under O. XXXIV r. 1 CPC.",
      "supporting_facts": [],
      "legal_basis": "s. 25 of the Act; O. XXXIV r. 1 CPC"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Debt is defined in s. 2(6) as meaning any pecuniary liability... The words pecuniary liability will cover any liability which is of a monetary nature.",
      "addresses_issue": "i1",
      "key_observation": "A mortgage debt creates a pecuniary liability upon the mortgagor as per definition in s. 58 of Transfer of Property Act."
    },
    {
      "id": "cr2",
      "text": "Sub-cl. (c) of s. 2(6) to be taken independently; covers debt due to displaced person from any other person.",
      "addresses_issue": "i1",
      "key_observation": "Mortgage debt falls within pecuniary liability under sub-cl. (c)."
    },
    {
      "id": "cr3",
      "text": "Sub-cl. (b) deals with special situation for properties in West Pakistan linked to s. 16; does not cut down plain meaning of sub-cl. (c).",
      "addresses_issue": "i1",
      "key_observation": "Sub-cl. (b) itself shows pecuniary liability includes mortgage debt."
    },
    {
      "id": "cr4",
      "text": "s. 16(5) only for mortgages on property in West Pakistan; s. 17 for movables; s. 21 general scaling down.",
      "addresses_issue": "i1",
      "key_observation": "Nothing cuts down amplitude of s. 2(6)(c)."
    },
    {
      "id": "cr5",
      "text": "Machinery under ss. 10, 11, 13, 14, 28 for enforcement; s. 3 overriding provision.",
      "addresses_issue": "i1",
      "key_observation": "Provision exists for mortgage debts on Indian property."
    },
    {
      "id": "cr6",
      "text": "Rights of prior or puisne mortgagees not affected by decree under s. 13, similar to CPC O. XXXIV.",
      "addresses_issue": "i1",
      "key_observation": "No prejudice to other mortgagees."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A mortgage debt creates a pecuniary liability and is a debt within s. 2(6), covered under sub-cl. (c) for displaced creditor against any other person.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": null,
      "citation": null,
      "treatment": null,
      "relevance": null
    }
  ],
  "statutes_cited": [
    {
      "name": "Displaced Persons (Debts Adjustment) Act, 1951",
      "sections": [
        "s. 2(6)",
        "s. 3",
        "s. 10",
        "s. 11",
        "s. 13",
        "s. 14",
        "s. 15",
        "s. 16",
        "s. 17",
        "s. 21",
        "s. 25",
        "s. 28"
      ],
      "relevance": "Defines debt to include mortgage liability under sub-cl. (c) of s. 2(6); provides machinery for claims, decrees, execution; overriding effect; special provisions for Pakistan properties do not exclude Indian mortgages."
    },
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [
        "s. 58"
      ],
      "relevance": "Definition of mortgage shows it secures pecuniary liability."
    },
    {
      "name": "Displaced Persons Institution of Suits Act, 1948",
      "sections": [
        "s. 4"
      ],
      "relevance": "Repealed; previously excepted suits on immovable property, omitted in 1951 Act."
    },
    {
      "name": "Displaced Persons Legal Proceedings Act, 1949",
      "sections": [
        "s. 6"
      ],
      "relevance": "Repealed; used 'decrees for payment of money', changed to 'proceedings in respect of any debt' in 1951 Act."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "O. XXXIV r. 1"
      ],
      "relevance": "Joinder of mortgagees in mortgage suits; rights of prior/puisne mortgagees not affected if not joined."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Punjab High Court judgments upholding the tribunal's preliminary decree for sale under s. 13 of the Act is dismissed, as the Court holds that the mortgage liability is a debt within s. 2(6)(c) of the Act.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Debt means any pecuniary liability, whether payable presently or in future...\"",
      "speaker": "court",
      "significance": "Core definition interpreted to include mortgage debts."
    },
    {
      "text": "\"The words pecuniary liability will cover any liability which is of a monetary nature.\"",
      "speaker": "court",
      "significance": "Key holding that mortgage creates pecuniary liability."
    },
    {
      "text": "\"We are therefore of opinion that s. 2(6) clearly includes a mortgage debt and under sub-cl. (c) thereof a displaced person to whom such a debt is due...\"",
      "speaker": "court",
      "significance": "Direct resolution of the issue in favor of respondents."
    }
  ],
  "_case_id": "1960_150",
  "_label": 0,
  "_text_length": 15667,
  "_extracted_at": "2026-02-10T19:54:04.594520"
}