{
  "metadata": {
    "case_name": "Burn & Co. Ltd. v. Workmen",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeals Nos. 195 and 196 of 1959",
    "date_of_judgment": "1960-03-30"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Disputes between the company and the workmen on various matters referred to the Third Industrial Tribunal, West Bengal, in Case No. VIII-7 of 1956. Award dated April 15, 1957.",
      "type": "procedural",
      "date": "1957-04-15",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Company introduced incentive bonus for manual workers including Sarkars and Checkers, but no provision for clerical and subordinate staff.",
      "type": "background",
      "date": null,
      "source": "company"
    },
    {
      "id": "f3",
      "text": "Workmen claimed incentive bonus for clerical and subordinate staff, pointing out that other concerns like Indian Iron and Steel Co. Ltd. at Burnpur, Bridge and Roof Co. (India) Limited, Howrah, and Tatas pay it to them.",
      "type": "disputed",
      "date": null,
      "source": "workmen"
    },
    {
      "id": "f4",
      "text": "Company resisted claim on grounds: (i) clerical staff get higher Bengal Chamber of Commerce dearness allowance than manual workers; (ii) clerical and subordinate staff do not actually produce anything.",
      "type": "disputed",
      "date": null,
      "source": "company"
    },
    {
      "id": "f5",
      "text": "Tribunal held that higher dearness allowance to clerks not reason for total exclusion; subordinate staff get same dearness allowance as manual workers; not justification for total exclusion despite not directly producing goods, especially as other comparable concerns pay it. Ordered company to extend incentive bonus scheme to clerical and subordinate staff and lay down rates and conditions.",
      "type": "material",
      "date": "1957-04-15",
      "source": "tribunal"
    },
    {
      "id": "f6",
      "text": "Workmen claimed cash benefit of annas eight per head per working day for period canteen was not in operation.",
      "type": "disputed",
      "date": null,
      "source": "workmen"
    },
    {
      "id": "f7",
      "text": "Tiffin allowance of annas eight granted by award dated July 24, 1953. Workmen keen on canteen before award, but keenness disappeared after. Company took steps to start canteen even before award and pursued vigorously after, but workmen objected to arrangements, some objections fantastic.",
      "type": "background",
      "date": "1953-07-24",
      "source": "tribunal"
    },
    {
      "id": "f8",
      "text": "Tribunal examined history of tiffin allowance, considered all points raised by workmen, concluded workmen not eligible to tiffin allowance of annas eight per head per working day having regard to circumstances.",
      "type": "material",
      "date": "1957-04-15",
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "Correspondence between workmen and company shows workmen preferred tiffin allowance over canteen after grant.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether incentive bonus scheme should be extended to clerical and subordinate staff, who do not directly produce goods.",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether workmen entitled to cash benefit of annas eight per head per working day for period canteen was not in operation.",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Clerical staff get higher Bengal Chamber of Commerce dearness allowance; clerical and subordinate staff do not produce anything and their work does not increase with production; introduction of incentive bonus is management function.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "Titaghur Paper Mills Co. Ltd. v. Their Workmen"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Clerical and subordinate staff should get incentive bonus like manual workers; other comparable concerns pay it; entitled to eight annas tiffin allowance when canteen not working.",
      "supporting_facts": [
        "f3",
        "f6",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Work of clerical and subordinate staff increases with higher production, though not in proportion; they take part economically in production; no reason to exclude them altogether; other concerns pay it; higher DA not reason to deprive; tribunal directed extension with rates/conditions to be laid down, not same as manual workers.",
      "addresses_issue": "i1",
      "key_observation": "Where incentive bonus in force for majority, tribunal can extend to remainder; different from imposing new scheme."
    },
    {
      "id": "cr2",
      "text": "Tribunal examined tiffin allowance history exhaustively; workmen not eligible given circumstances; correspondence shows preference for allowance over canteen.",
      "addresses_issue": "i2",
      "key_observation": "Tribunal's conclusion correct; no reason to interfere."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No reason to interfere with tribunal's order extending incentive bonus to clerical and subordinate staff.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Workmen not eligible to eight annas tiffin allowance per head per working day.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Titaghur Paper Mills Co. Ltd. v. Their Workmen",
      "citation": "1959 SUPP. 2 S.C.R. 1012",
      "treatment": "distinguished",
      "relevance": "Incentive bonus introduction is management function when imposing for first time; here scheme already exists for majority."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Both appeals dismissed; no interference with tribunal's award on incentive bonus extension to clerical/subordinate staff or rejection of eight annas tiffin allowance claim.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"there can be no doubt that economically speaking the clerical staff and the subordinate staff also take part in the production and there is no reason therefore for excluding them altogether from the scheme of incentive bonus.\"",
      "speaker": "court",
      "significance": "Justifies extension of incentive bonus."
    },
    {
      "text": "\"We can see no reason why where an incentive bonus is in force in a concern for the majority of its workmen, the tribunal should not be able to extend the same to the remainder of the workmen.\"",
      "speaker": "court",
      "significance": "Distinguishes from imposing new scheme; upholds tribunal power."
    }
  ],
  "_case_id": "1960_222",
  "_label": 0,
  "_text_length": 7622,
  "_extracted_at": "2026-02-10T19:54:29.451349"
}