{
  "metadata": {
    "case_name": "State of Andhra v. Respondent",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "AYYANGAR, J."
    ],
    "case_number": "Civil Appeal No. 506 of 1957",
    "date_of_judgment": "1960-12-08"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent joined the Madras Police Force as a Constable on September 1, 1939.",
      "type": "background",
      "date": "1939-09-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent became a permanent Head Constable in 1946.",
      "type": "background",
      "date": "1946",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The respondent was promoted to officiate as a Sub-Inspector on October 1, 1947, when his probation commenced.",
      "type": "procedural",
      "date": "1947-10-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "By order dated September 24, 1950, the respondent was declared to have satisfactorily completed his period of probation and was brought to the A list with effect from September 10, 1950, as an approved probationer fit for confirmation as Sub-Inspector when substantive vacancies arose.",
      "type": "procedural",
      "date": "1950-09-10",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On August 3, 1952, the District Superintendent of Police, Krishna, issued an order reverting the respondent to the rank of Head Constable with effect from August 14, 1952, for lack of sufficient vacancies in Sub-Inspectors posts.",
      "type": "procedural",
      "date": "1952-08-14",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The reversion was confined to the respondent alone but extended to a very large number of officiating Sub-Inspectors promoted from Head Constables.",
      "type": "background",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The reverted officers petitioned the Inspector-General of Police; on January 15, 1953, the IGP issued a memorandum stating that direct recruits and promoted Sub-Inspectors have separate seniority, and reversion of promotees was in order.",
      "type": "procedural",
      "date": "1953-01-15",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The respondent submitted a memorial to Government challenging the distinction between direct recruits and promotees, but obtained no redress.",
      "type": "procedural",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The respondent filed Writ Petition No. 524 of 1953 under Art. 226 before High Court of Madras seeking mandamus to refrain from enforcing reversion and consider confirmation based on seniority in approved probationers list.",
      "type": "procedural",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Balakrishna Iyer J. allowed the writ petition, directing State to forbear from reversion if petitioner by seniority among promotees can be included in the 30 per cent.",
      "type": "procedural",
      "date": "1955-07-21",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "State appealed (Writ Appeal No. 122 of 1954), transferred to High Court of Andhra; appeal dismissed holding no violation of rule 5 on juniority.",
      "type": "procedural",
      "date": "1955-07-21",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "State obtained certificate under Art. 133(1)(c) and filed this appeal.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Reversion alleged not punitive but administrative; respondent later duly promoted to substantive Sub-Inspector post.",
      "type": "admitted",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "During police action in Hyderabad, large number of direct recruits as Sub-Inspectors given assurance they would not be reverted; temporary posts abolished post-action, necessitating absorption of direct recruits.",
      "type": "background",
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "At time of reversion, proportion of promotees was less than 25 per cent, more than 75 per cent direct recruits.",
      "type": "disputed",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Was there a violation of Rule 3 of the Service Rules when the respondent was reverted, as proportion of rank-promotees was less than 30 per cent?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Rule 4 was violated by confirming more junior direct recruits to substantive posts in preference to senior rank-promotees like respondent?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Rule 5 was violated in the reversion order?",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "If Service Rules violated, do breaches constitute infringement of legal rights entitling remedy in courts?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Rule 3 entitles promotee-Sub-Inspectors to minimum 30 per cent of cadre strength; violated as promotees <25 per cent at reversion.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Rule 3, Annexure I"
    },
    {
      "id": "pa2",
      "text": "After initial recruitment and probation commencement, no distinction between direct recruits and promotees; unified force, substantive appointments by inter se seniority per Rule 4.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Rule 4"
    },
    {
      "id": "pa3",
      "text": "Reversions must follow Rule 5(a) juniority without distinction; respondent senior to some direct recruits, reverted out of turn.",
      "supporting_facts": [
        "f5",
        "f15"
      ],
      "legal_basis": "Rule 5(a)"
    },
    {
      "id": "pa4",
      "text": "Government bound to retain all rank-promotee approved probationers until substantive vacancies.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Service Rules"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Rule 3 fixes maximum ('up to, not more than') 30 per cent for promotees, no minimum; no violation if below 30 per cent.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Rule 3, Annexure I"
    },
    {
      "id": "ra2",
      "text": "Proportions in Rule 3 apply at confirmation stage; direct recruits and promotees separate categories till absorption as full members; seniority within each group.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Rule 3, Rule 4"
    },
    {
      "id": "ra3",
      "text": "No violation of Rule 5(a) as separate categories; alternatively, Rule 5(b) applies due to exceptional administrative inconvenience from Hyderabad police action direct recruits assurances and post abolition.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Rule 5(b)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Words 'up to, not more than 30 per cent' in Rule 3 fix maximum for promotees (ceiling), no minimum, especially as no limit on direct recruits; proportion <30 per cent no violation.",
      "addresses_issue": "i1",
      "key_observation": "Construction erroneous to read as minimum; endorses Andhra HC view."
    },
    {
      "id": "cr2",
      "text": "Direct recruits and promotees separate categories until absorption as full members; Rule 4 seniority within groups, not inter se; no violation in confirming junior direct recruits first.",
      "addresses_issue": "i2",
      "key_observation": "Integration only post-confirmation; Rule 3 proportions operate at absorption."
    },
    {
      "id": "cr3",
      "text": "Rule 5(a) juniority separate per category; alternatively, Rule 5(b) 'exceptional administrative inconvenience' applies due to Hyderabad direct recruits assurances and post abolitions.",
      "addresses_issue": "i3",
      "key_observation": "Facts accepted; reversion justified even if Rule 5(a) infringed."
    },
    {
      "id": "cr4",
      "text": "No obligation to retain in officiating posts; Rule 5(a) allows reversion of approved probationers.",
      "addresses_issue": "i3",
      "key_observation": "Cannot import legal obligation to avoid hardship."
    },
    {
      "id": "cr5",
      "text": "No need to decide if Service Rule breach gives enforceable right as no breach found.",
      "addresses_issue": "i4",
      "key_observation": "Question does not arise."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rule 3 fixes maximum 30 per cent promotees, no minimum guaranteed.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Separate categories (direct vs promotee) until confirmation; no unified seniority for Rule 4.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Reversions valid under Rule 5(a) (separate juniority) or Rule 5(b) (admin inconvenience).",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(c)",
        "Article 226",
        "Article 311(2)"
      ],
      "relevance": "Certificate for appeal; writ jurisdiction; contention on reduction in rank abandoned."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "s. 243"
      ],
      "relevance": "Rules framed under for Madras Police Subordinate Service."
    },
    {
      "name": "Rules relating to the Madras Police Subordinate Service",
      "sections": [
        "Rule 3",
        "Rule 4",
        "Rule 5"
      ],
      "relevance": "Regulate recruitment, probation, confirmation, reversion; central to dispute."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court judgment and order dated July 21, 1955 set aside; Writ Petition No. 524 of 1953 dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'up to, not more than 30 per cent' merely fix the maximum percentage of rank-promotees in the category, leaving it to the appointing authorities to adopt any percentage below this figure.",
      "speaker": "court",
      "significance": "Core holding on Rule 3 construction."
    },
    {
      "text": "The order of discharge laid down in sub-rule (a) may be departed from in cases where such order would involve excessive expenditure on travelling allowance or exceptional administrative inconvenience.",
      "speaker": "court",
      "significance": "Justifies reversion under Rule 5(b)."
    },
    {
      "text": "direct recruits and rank-promotees belonged to distinct classes the juniority for reversion had to be determined separately for each class.",
      "speaker": "court",
      "significance": "Rejects unified category pre-confirmation."
    }
  ],
  "_case_id": "1960_132",
  "_label": 1,
  "_text_length": 27405,
  "_extracted_at": "2026-02-10T19:53:18.894629"
}