{
  "metadata": {
    "case_name": "Charandas Haridas & Anr. v. Commissioner of Income-tax",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 108 of 1957",
    "date_of_judgment": "1960-03-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are Charandas Haridas (Karta of HUF consisting of wife, three sons and himself) and Chinubhai Haridas (Karta of HUF consisting of wife, son and himself). Cases identical with consolidated reference.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Charandas Haridas was partner in six managing agency firms in six Mills. Income received as partner previously assessed as income of HUF.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On December 31, 1945, Charandas Haridas acting for his three minor sons and himself and Shantaben, his wife, entered into oral agreement for partial partition: gave one pie share to daughter Pratima in managing agency commission from two of six agencies; balance plus shares in other agencies divided into five equal shares.",
      "type": "material",
      "date": "1945-12-31",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Agreement effective from January 1, 1946, beginning of fresh accounting year.",
      "type": "material",
      "date": "1946-01-01",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "On September 11, 1946, Charandas Haridas acting for himself and minor sons, and Shantaben executed memorandum of partial partition reciting oral agreement.",
      "type": "material",
      "date": "1946-09-11",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Memorandum states: family received commission from Vijaya Mills Co. Ltd. and Gopal Mills Co. Ltd.; one pie given to Pratima; remaining commissions and from other mills partitioned orally on Samvat 2002 Magsar Vadi 12 (31-12-1945); commissions accruing from 1-1-46 to be absolute property of each one-fifth share.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "In assessment years 1947-48 and 1948-49, Charandas Haridas claimed income as separate income of divided members, not HUF.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Income-tax Officer assessed income as HUF; appeal to Appellate Assistant Commissioner unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Income-tax Appellate Tribunal held division was of income only, not assets; agreements with managed companies unchanged; arrangement not binding on Department; document a farce.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Tribunal declined to state case under s.66(1); Charandas moved Bombay High Court, obtained order under s.66(2).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Question referred: Whether there were materials to justify the finding of the Tribunal that the income in the share of the commission agency of the Mills was the income of the Hindu undivided family?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Bombay High Court on February 16, 1955, answered affirmatively: materials existed; method of partition insufficient; source of income remained united.",
      "type": "procedural",
      "date": "1955-02-16",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court refused leave to appeal; special leave obtained from Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there were materials to justify the finding of the Tribunal that the income in the share of the commission agency of the Mills was the income of the Hindu undivided family?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the partial partition by dividing income from managing agency commissions effectively divided the assets for Income-tax purposes, disrupting the HUF status for those assets?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Hindu undivided family cannot be a partner of a firm; Karta as partner cannot insist other members be received as partners; only mode of partition was to divide income, which had effect in law of dividing assets for Income-tax purposes.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Partnership Act; Hindu law"
    },
    {
      "id": "pa2",
      "text": "HUF ceased to exist in respect of these assets after January 1, 1946; cannot be assessed as such.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Assets not divided in fact; income accrued to HUF at moment of accrual; subsequent partition of income does not affect position.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Income-tax Act"
    },
    {
      "id": "ra2",
      "text": "Family could have partitioned by allotting agencies severally, appointing receiver, etc., but did not; division only of income after accrual.",
      "supporting_facts": [
        "f2",
        "f12"
      ],
      "legal_basis": "Hindu law; Partnership Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Three branches of law: Partnership (HUF not partner), Hindu law (permits partial partition), Income-tax law (assesses based on Hindu law status post-partition).",
      "addresses_issue": "i2",
      "key_observation": "Partition effective under Hindu law changes family status; no HUF for those assets post-partition."
    },
    {
      "id": "cr2",
      "text": "Document genuine, not sham; fully effective between members; no other mode of partition possible without dissolving firms; division into separate interests achieved.",
      "addresses_issue": "i1",
      "key_observation": "No materials justify Tribunal's finding; income not of HUF."
    },
    {
      "id": "cr3",
      "text": "Income-tax law looks to Hindu law, not Partnership Act; post-disruption, income accrues to separated members.",
      "addresses_issue": "i2",
      "key_observation": "Karta's partner position unchanged vis-a-vis firm, but family status altered."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Partial partition effective; no Hindu undivided family in respect of these assets post-January 1, 1946; income not assessable as HUF income.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Question answered in negative: no materials to justify Tribunal's finding.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pichappa v. Chokalingam",
      "citation": "A.I.R. 1934 P.C. 192",
      "treatment": "followed",
      "relevance": "Managing member entering partnership with stranger does not make family unit partner; only actual contractual members are partners."
    },
    {
      "case_name": "Appovier v. Rama Subba Aiyan",
      "citation": "1866 11 M.I.A. 75",
      "treatment": "followed",
      "relevance": "Division of produce into distinct shares effects conversion of tenancy and change of family status."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s. 66(1)",
        "s. 66(2)"
      ],
      "relevance": "Reference procedure; Tribunal's refusal to state case and High Court's direction."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court's answer reversed; no materials justified Tribunal's finding that income was HUF's; respondents to pay costs of two assessees here and below.",
    "relief_granted": "Appeal allowed with costs",
    "costs": "Respondents to pay costs of the two assessees here and below."
  },
  "key_quotes": [
    {
      "text": "\"There is nothing in the Indian Income-tax law or the law of Partnership which prevents the members of a Hindu joint family from dividing any asset.\"",
      "speaker": "court",
      "significance": "Core holding on permissibility of partial partition for IT purposes."
    },
    {
      "text": "\"The Income-tax law before the partition takes no account, factually, of the position of the Karta, and assesses not him qua partner but as representing the Hindu undivided family.\"",
      "speaker": "court",
      "significance": "Explains basis of pre-partition assessment and change post-partition."
    },
    {
      "text": "\"In the face of the finding that this was a genuine document and not a sham, and that it effectually divided the income and in the circumstances, the assets, the question answers itself in the negative.\"",
      "speaker": "court",
      "significance": "Direct resolution of referred question."
    }
  ],
  "_case_id": "1960_83",
  "_label": 1,
  "_text_length": 16178,
  "_extracted_at": "2026-02-10T19:52:25.971239"
}