{
  "metadata": {
    "case_name": "Writ Petition No. 170 of 1959",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "IMAM J."
    ],
    "case_number": "Writ Petition No. 170 of 1959",
    "date_of_judgment": "1960-01-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner was detained by an order dated May 4, 1959, of the Central Government under s. 3 of the Preventive Detention Act, 1950.",
      "type": "procedural",
      "date": "1959-05-04",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Grounds of detention dated May 7, 1959, were served on the petitioner.",
      "type": "procedural",
      "date": "1959-05-07",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Petitioner's case was considered by the Advisory Board constituted by the Central Government under s. 8 of the Act.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On the report of the Advisory Board, the Central Government by order dated June 23, 1959, directed that the petitioner be detained until May 4, 1960.",
      "type": "procedural",
      "date": "1959-06-23",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Grounds of detention contained 5 grounds upon which Central Government was satisfied it was necessary to detain petitioner as likely to act in manner prejudicial to security of India and relations of India with foreign powers.",
      "type": "material",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Central Government considered it against public interest to disclose facts or particulars as to dates, persons, places, nature of activities and assistance given by petitioner other than those mentioned in grounds.",
      "type": "material",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Specimen despatches sent by petitioner and reports in newspaper published in Pakistan annexed to grounds.",
      "type": "material",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Petitioner engaged in propaganda against Government of India and Government of State of Jammu and Kashmir in manner to bring them into hatred and contempt.",
      "type": "disputed",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Petitioner sent despatches for publication in foreign newspaper containing false, incomplete, one-sided and misleading information about administration of J&K, policy of GoI re J&K, conditions in India and J&K.",
      "type": "disputed",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Despatches published prominently in newspaper with large circulation in Pakistan and other countries, prejudicial to India and her cause re J&K and relations with foreign powers.",
      "type": "disputed",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Petitioner in regular touch and closely associated with persons hostile to India's cause re J&K and engaged in activities prejudicial to security of India.",
      "type": "disputed",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Cumulative effect of petitioner's activities prejudicial to relations of India with foreign powers in general and re J&K and public order therein.",
      "type": "material",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Extracts from despatches annexed to grounds disclose sufficient particulars to enable petitioner to make representation to Advisory Board.",
      "type": "admitted",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Petition under Art. 32 filed against order of detention dated June 23, 1959.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Petition heard on January 4, 1960, intimated dismissal, reasons to follow.",
      "type": "procedural",
      "date": "1960-01-04",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Pakistan is a foreign power for purposes of s.3 of Preventive Detention Act, 1950, despite Constitution (Declaration as to Foreign State) Order, 1950.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether grounds of detention are vague and insufficient to enable effective representation.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether grounds disclose acts prejudicial to security of India (incitement to violence or subversion).",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether Advisory Board procedure violated natural justice by hearing respondent first and not supplying copies of further materials.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Order of detention confined to preventing acts prejudicial to relations with foreign powers and security of India; Pakistan not a foreign state per Art.367(3) and Order, so not foreign power; invalid ground vitiates entire order.",
      "supporting_facts": [
        "f5",
        "f12"
      ],
      "legal_basis": "Art.367(3), Constitution (Declaration as to Foreign State) Order, 1950; Art.392(3)"
    },
    {
      "id": "pa2",
      "text": "No extracts or grounds disclose incitement to violence or subversion, so not prejudicial to security of India.",
      "supporting_facts": [
        "f5",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Grounds vague: e.g., ground 1 outside scope; ground 2 no specifics on falsity or policy; grounds 3-4 no particulars on India's cause re J&K.",
      "supporting_facts": [
        "f5",
        "f8",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Advisory Board heard respondent's case first in petitioner's absence; copies of further materials not supplied, violating natural justice.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Pakistan is a foreign power despite Order; distinction between 'Foreign State' for Constitution purposes and 'foreign powers' in Act; Commonwealth members sovereign and independent in foreign affairs.",
      "addresses_issue": "i1",
      "key_observation": "Relations with Pakistan are foreign affairs; Order does not affect construction of 'foreign powers' in s.3 Act or List I item 9."
    },
    {
      "id": "cr2",
      "text": "Grounds sufficient as extracts from despatches annexed provide particulars for representation; vagueness contentions lack substance.",
      "addresses_issue": "i2",
      "key_observation": "Extracts disclose sufficient grounds for detention."
    },
    {
      "id": "cr3",
      "text": "Ground 1 within scope as bringing governments into hatred/contempt involves security of India; activities prejudicial to relations with foreign powers in general, not just Pakistan.",
      "addresses_issue": "i3",
      "key_observation": "J&K affairs of interest to foreign powers beyond Pakistan."
    },
    {
      "id": "cr4",
      "text": "s.10 Act permits Board to call further info from government before hearing detenue; no violation of natural justice; public interest non-disclosure valid under Art.22(6); no factual assertion proven.",
      "addresses_issue": "i4",
      "key_observation": "Petition does not assert, affidavit does not admit, hearing order."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Pakistan is a foreign power under s.3 Preventive Detention Act; grounds valid and sufficient.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Grounds of detention not vague; extracts provide sufficient particulars.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Activities prejudicial to security of India and relations with foreign powers.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Advisory Board procedure complies with Act and natural justice; non-disclosure in public interest.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": null,
      "citation": null,
      "treatment": null,
      "relevance": "Certain decisions of this Court on invalid ground vitiating order (mentioned but not specified)"
    }
  ],
  "statutes_cited": [
    {
      "name": "Preventive Detention Act, 1950",
      "sections": [
        "s.3",
        "s.8",
        "s.9",
        "s.10"
      ],
      "relevance": "Basis for detention order, Advisory Board procedure; authorizes detention for acts prejudicial to security of India or relations with foreign powers."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.32",
        "Art.367(3)",
        "Art.392(3)",
        "Art.22(6)",
        "Art.18(2),(3),(4)",
        "Art.19(2)",
        "Art.102(1)(d)",
        "Art.191(1)(d)"
      ],
      "relevance": "Writ petition for fundamental rights; definition of Foreign State; public interest non-disclosure; List I item 9 on foreign affairs."
    },
    {
      "name": "Constitution (Declaration as to Foreign State) Order, 1950",
      "sections": [
        "Clause 2"
      ],
      "relevance": "Declares Commonwealth countries not Foreign States for Constitution purposes; does not affect 'foreign powers' in Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Petition under Art.32 dismissed; detention order upheld as valid under Preventive Detention Act; grounds sufficient and Pakistan a foreign power.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Pakistan must be regarded as a foreign power, although that country may be a part of the Commonwealth as India is.\"",
      "speaker": "court",
      "significance": "Core holding on status of Pakistan under the Act."
    },
    {
      "text": "\"They disclose sufficient grounds for the action taken by the Central Government in detaining the petitioner.\"",
      "speaker": "court",
      "significance": "Validity of detention grounds affirmed."
    },
    {
      "text": "\"There is nothing in s.10 which offends against the principles of natural justice.\"",
      "speaker": "court",
      "significance": "Rejects procedural challenge."
    }
  ],
  "_case_id": "1960_3",
  "_label": 0,
  "_text_length": 18341,
  "_extracted_at": "2026-02-10T19:51:52.986681"
}