{
  "metadata": {
    "case_name": "Certain Cotton Textile Mills in Ahmedabad v. Textile Labour Association, Ahmedabad",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo J.",
      "Gajendragadkar J.",
      "Sarkar J.",
      "Mudholkar J.",
      "Subba Rao J."
    ],
    "case_number": "Civil Appeals Nos. 351-356 and 358-369 of 1960",
    "date_of_judgment": "1960-12-07"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Agreement between Textile Labour Association and Ahmedabad Mill-owners Association on June 27, 1955, for payment of bonus for years 1953 to 1957.",
      "type": "background",
      "date": "1955-06-27",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Agreement provided for bonus based on available surplus after prior charges, with minimum 4.8% and maximum 25% of basic wages, provisions for set-off and set-on.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Disputes arose about bonus for 1958 after agreement ended.",
      "type": "material",
      "date": "1958-12-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Notice of change under s. 42 of Bombay Industrial Relations Act given by Textile Labour Association on July 21, 1959, claiming bonus for 1958.",
      "type": "procedural",
      "date": "1959-07-21",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "66 references under s. 73-A of the Act to Industrial Court for arbitration.",
      "type": "procedural",
      "date": "1959",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Industrial Court considered all 66 references together, concluded agreement worked fairly, extended it for 1958, directed parties to file bonus calculations.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "52 applications for special leave, 34 withdrawn, 18 appeals remain; 14 mills accepted, 48 out of picture.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Total 66 cotton textile mills in Ahmedabad.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Industrial Court was right in law in extending the 1955 Agreement for the year 1958, given the law on bonus laid down by this Court in Associated Cement Companies Ltd. v. The Workmen.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the formula under the Agreement departs vitally from the Full Bench formula approved by this Court.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Jurisdiction of Industrial Court to impose new obligations or extend agreements in bonus disputes.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "In view of the law laid down as to bonus by this Court in Associated Cement Companies Ltd. v. The Workmen, it was not open to Industrial Court to extend the Agreement for 1958 as that would be against the concept of bonus as understood in industrial law.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "Associated Cement Companies Ltd. v. The Workmen (1959 S.C.R. 925); Full Bench formula in Mill-owners Association, Bombay v. The Rashtriya Mill Mazdoor Sangh"
    },
    {
      "id": "pa2",
      "text": "Formula under Agreement departs in vital aspects from Full Bench formula: rehabilitation differs, provides minimum bonus even if no surplus or loss, set-off and set-on treat years interdependently.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Associated Cement Companies Ltd. v. The Workmen"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Agreement worked fairly, substantially in accord with long-standing practice, extension essential for industrial peace.",
      "supporting_facts": [
        "f1",
        "f6",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Agreement does not violate Supreme Court law; provides for bonus linked to profits on industry-cum-region basis over multiple years with set-on/set-off; reasonable minimum/maximum.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Full Bench formula principles preserved"
    },
    {
      "id": "ra3",
      "text": "Fifth kind of bonus: goodwill bonus for industrial peace.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Industrial tribunals can impose new obligations or extend agreements for industrial peace, but power conditioned by subject-matter and existing industrial law; cannot overlook law on bonus.",
      "addresses_issue": "i3",
      "key_observation": "Cites Federal Court and SC precedents affirming jurisdiction but limited by law."
    },
    {
      "id": "cr2",
      "text": "Profit bonus concept: available surplus after prior charges (depreciation, taxes, return on capital, rehabilitation); no surplus, no bonus. Full Bench formula approved, to be applied without revision.",
      "addresses_issue": "i1",
      "key_observation": "Agreement departs vitally: rehabilitation (1947 block only), minimum bonus despite no surplus/loss, set-off/set-on vs. self-sufficient year."
    },
    {
      "id": "cr3",
      "text": "No industry-cum-region approach for bonus; each unit's surplus determines bonus, as in Agreement itself.",
      "addresses_issue": "i2",
      "key_observation": "Distinguishes wage cases; sugar awards not true uniform bonus."
    },
    {
      "id": "cr4",
      "text": "No goodwill bonus by tribunal; presupposes employer's free will.",
      "addresses_issue": "i1",
      "key_observation": "Contradicts concept if imposed."
    },
    {
      "id": "cr5",
      "text": "Dissent (Subba Rao J.): Agreement lawful, links bonus to profits via set-on/set-off on industry basis; Industrial Court can extend for peace; does not violate Full Bench formula.",
      "addresses_issue": "i1",
      "key_observation": "Scheme beneficent, adopted widely; promotes peace."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Industrial Court cannot extend Agreement departing vitally from Full Bench formula; must apply Full Bench formula as approved in Associated Cement Companies.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No scope for industry-cum-region or goodwill bonus imposition in profit bonus cases.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Remand to Industrial Court to decide bonus for 1958 per Full Bench formula.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Associated Cement Companies Ltd. v. The Workmen",
      "citation": "1959 S.C.R. 925",
      "treatment": "followed",
      "relevance": "Approves Full Bench formula for profit bonus; basis for rejecting extension of deviating agreement."
    },
    {
      "case_name": "Mill-owners Association, Bombay v. The Rashtriya Mill Mazdoor Sangh",
      "citation": "1950 2 L.L.J. 1247",
      "treatment": "followed",
      "relevance": "Evolves Full Bench formula for bonus."
    },
    {
      "case_name": "Muir Mills Co. Ltd. v. Suti Mills Mazdoor Union",
      "citation": "1955 1 S.C.R. 991",
      "treatment": "followed",
      "relevance": "Defines conditions for bonus claim: wages short of living, industry profits."
    },
    {
      "case_name": "Western India Automobile Association v. Industrial Tribunal, Bombay",
      "citation": "1949 F.C.R. 321",
      "treatment": "followed",
      "relevance": "Industrial tribunal can create new obligations/extend agreements for peace."
    },
    {
      "case_name": "Rohtas Industries Ltd. v. Brijnandan Pandey",
      "citation": "1956 S.C.R. 800",
      "treatment": "followed",
      "relevance": "Tribunal not fettered like civil court; can modify contracts for peace."
    },
    {
      "case_name": "Patna Electric Supply Co. v. Patna Electric Supply Workers Union",
      "citation": "1959 Supp. 2 S.C.R. 761",
      "treatment": "followed",
      "relevance": "Can impose new obligations for social justice and peace."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Industrial Relations Act, No. XI of 1947",
      "sections": [
        "s. 73-A",
        "s. 42"
      ],
      "relevance": "References for arbitration; notice of change for bonus disputes."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; Industrial Court's order extending 1955 Agreement for 1958 set aside as against bonus law; matter remanded to Industrial Court to determine bonus per Full Bench formula in Associated Cement Companies case.",
    "relief_granted": "Remand for fresh decision on bonus using Full Bench formula",
    "costs": "No order as to costs"
  },
  "key_quotes": [
    {
      "text": "It would in our opinion be not open to an industrial court or tribunal to ignore this law as to bonus and to extend an agreement for payment of bonus, which is against the basic concept of bonus as laid down by the decisions of this Court.",
      "speaker": "court",
      "significance": "Core holding rejecting extension of deviating agreement."
    },
    {
      "text": "There is no doubt therefore that it is open to an industrial court in an appropriate case to impose new obligations on the parties before it or modify contracts in the interest of industrial peace.",
      "speaker": "court",
      "significance": "Affirms tribunal jurisdiction but limits by law."
    },
    {
      "text": "Bonus is not a deferred wage.",
      "speaker": "court",
      "significance": "From Muir Mills; clarifies profit bonus nature."
    }
  ],
  "_case_id": "1960_281",
  "_label": 1,
  "_text_length": 71138,
  "_extracted_at": "2026-02-10T19:55:14.578175"
}