{
  "metadata": {
    "case_name": "Non-Resident Assessee v. Income Tax Officer, Bombay City",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 408 of 1957",
    "date_of_judgment": "1960-10-18"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant was a non-resident for the purposes of the Indian Income Tax Act, 1922.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Certain dividend income accrued to the appellant within the taxable territory of British India in the assessment years 1943-44, 1944-45, 1946-47 and 1947-48.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellant did not submit returns of his income for those assessment years.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Income Tax Officer, Bombay City, served notices under s. 34 read with s. 22(2) of the Act: for 1943-44 on March 27, 1952; for 1944-45 on February 16, 1953; for 1946-47 on April 4, 1951; for 1947-48 on April 2, 1952.",
      "type": "procedural",
      "date": "1951-04-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Assessments completed: for 1943-44, 1944-45 and 1947-48 on May 6, 1953; for 1946-47 on March 19, 1952.",
      "type": "procedural",
      "date": "1952-03-19",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Orders of assessment confirmed by the Appellate Assistant Commissioner and by the Income Tax Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "At the instance of the appellant, the Tribunal drew up a statement of the case under s. 66(1) and submitted to the Bombay High Court two questions.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "High Court answered the first question in the negative and observed that the second question did not arise.",
      "type": "procedural",
      "date": "1955-09-28",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appeal preferred by the appellant with special leave under Art. 136 of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the notices issued under s. 22(2) of the Act read with s. 34 of the Act for the assessment years 1943-44, 1944-45, 1946-47 and 1947-48 were served after the period of limitation prescribed by s. 34 of the Act?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If the answer to Question No. 1 is in the affirmative, whether the assessments for the years in question were invalid in law?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the proceedings for assessment were commenced within the period of limitation prescribed for serving notice of assessment under s. 34(1)(a) of the Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The notices for assessment were, even though he had not made a return of his income for the years in question, governed not by cl. (1)(a) of s. 34, but by cl. (1)(b) of s. 34.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "s. 34(1)(b) of the Indian Income Tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "Being a resident outside the taxable territory in the years of assessment, a general notice under s. 22(1) did not give rise to a liability to submit a return, and his inaction did not amount to omission or failure to submit a return, inviting the applicability of s. 34(1)(a).",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "s. 22(1), s. 34(1)(a)"
    },
    {
      "id": "pa3",
      "text": "Omission or failure to make a return can only arise qua a non-resident, if no return is filed after service of an individual notice under s. 22(2).",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "s. 22(2)"
    },
    {
      "id": "pa4",
      "text": "A notice under s. 22(1) imposes an obligation upon persons resident within the taxable territory and not upon non-residents, support from s. 1(2) which extended the Act to British India.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "s. 22(1), s. 1(2)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The notices issued by the Income Tax Officer for the years in question were issued within eight years from the end of the years of assessment and if cl. (1)(a) of s. 34 applied, the assessment was not barred by the law of limitation.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s. 34(1)(a)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The expression 'every person whose total income during the previous year exceeded the maximum amount which is not chargeable to income-tax' in s. 22(1) includes all persons who are liable to pay tax and there is nothing in the section or in its context which exempts non-residents from liability to submit a return pursuant to a notice thereunder.",
      "addresses_issue": "i3",
      "key_observation": "s. 22(1) applies to non-residents with income in taxable territory."
    },
    {
      "id": "cr2",
      "text": "The fact that a non-resident assessee may not come to know of the general notice issued under s. 22(1) is not a ground for not giving effect to the plain words used in the section.",
      "addresses_issue": "i3",
      "key_observation": "Plain words of s. 22(1) bind all persons with taxable income."
    },
    {
      "id": "cr3",
      "text": "In terms, the clause read with r. 18 requires every person who has taxable income to submit his return, and if he fails to do so, under s. 34 of the Act the Income Tax Officer may commence proceedings for assessment within the period prescribed by cl. (1)(a).",
      "addresses_issue": "i3",
      "key_observation": "Failure to submit return under s. 22(1) triggers s. 34(1)(a)."
    },
    {
      "id": "cr4",
      "text": "s. 34(1)(b) applies only to those cases where there is no omission or failure to make a return of the income or to make a full and true disclosure of facts material to the assessment.",
      "addresses_issue": "i3",
      "key_observation": "s. 34(1)(b) not applicable here due to omission under s. 22(1)."
    },
    {
      "id": "cr5",
      "text": "To the appellant though non-resident income had admittedly accrued in the taxable territory and that income exceeded the maximum amount not chargeable to income-tax. The appellant not having submitted a return in pursuance of the notice issued under s. 22(1) the Income Tax Officer was competent under s. 34(1)(a) to issue notice at any time within eight years of the end of the year of assessment.",
      "addresses_issue": "i3",
      "key_observation": "Competence under s. 34(1)(a) confirmed."
    },
    {
      "id": "cr6",
      "text": "Once a notice is given by publication in the press and in the prescribed manner under s. 22(1), every person whose income exceeds the maximum amount exempt from tax is obliged to submit a return and if he does not do so, it will be deemed that there was omission on his part to make a return within the meaning of s. 34(1)(a).",
      "addresses_issue": "i3",
      "key_observation": "Omission deemed for non-submission after general notice."
    },
    {
      "id": "cr7",
      "text": "There is no warrant for the submission that s. 22(1) applies to residents only and that an obligation to make a return on the part of a non-resident can only arise if a notice under sub-s. (2) is served.",
      "addresses_issue": "i3",
      "key_observation": "s. 22(1) applies to non-residents."
    },
    {
      "id": "cr8",
      "text": "Under sub-s. (2) it is open to the Income Tax Officer to serve a special notice upon any person requiring him to furnish a return in the prescribed form, but that provision does not derogate from the liability arising under sub-s. (1) to submit a return.",
      "addresses_issue": "i3",
      "key_observation": "s. 22(2) additional, not exclusive."
    },
    {
      "id": "cr9",
      "text": "The Income Tax Act extends by s. 1(2) to the taxable territory and not beyond but within that territory, the Income Tax Officer has power to tax income which accrues, arises or is received.",
      "addresses_issue": "i3",
      "key_observation": "Territorial application includes non-residents' income therein."
    },
    {
      "id": "cr10",
      "text": "The submission that a person liable to pay tax but resident outside the taxable territory must be served with a special notice under s. 22(2) before his inaction in the matter of making a return may be deemed omission within the meaning of s. 34(1) is without force. There is no such express provision made by the statute and none can be implied from the context.",
      "addresses_issue": "i3",
      "key_observation": "No requirement for special notice to non-residents."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The proceedings for assessment were properly commenced within the period of limitation prescribed by s. 34(1)(a) from the close of the year of assessment.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The High Court was right in holding that the proceedings for assessment were properly commenced within the period of limitation.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act, 1922",
      "sections": [
        "s. 1(2)",
        "s. 22(1)",
        "s. 22(2)",
        "s. 34(1)(a)",
        "s. 34(1)(b)",
        "s. 34",
        "s. 66(1)"
      ],
      "relevance": "Governs issuance of notices, limitation for escaped assessment, obligation to file returns, and reference to High Court. Notices valid under s. 34(1)(a) due to omission to file return under s. 22(1)."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 136"
      ],
      "relevance": "Special leave to appeal to Supreme Court granted."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the High Court's decision that the assessment notices were issued within the limitation period under s. 34(1)(a) of the Indian Income Tax Act, 1922, as the non-resident appellant's failure to file returns pursuant to the general notice under s. 22(1) constituted an omission attracting the 8-year limitation period.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The expression every person whose total income during the previous year exceeded the maximum amount which is not chargeable to income-tax in s. 22(1) includes all persons who are liable to pay tax and there is nothing in the section or in its context which exempts non-residents from liability to submit a return pursuant to a notice thereunder.",
      "speaker": "court",
      "significance": "Clarifies applicability of s. 22(1) to non-residents."
    },
    {
      "text": "Once a notice is given by publication in the press and in the prescribed manner under s. 22(1), every person whose income exceeds the maximum amount exempt from tax is obliged to submit a return and if he does not do so, it will be deemed that there was omission on his part to make a return within the meaning of s. 34(1)(a).",
      "speaker": "court",
      "significance": "Defines 'omission' for limitation under s. 34(1)(a)."
    },
    {
      "text": "The High Court was therefore right in holding that the proceedings for assessment were properly commenced within the period of limitation prescribed by s. 34(1)(a) from the close of the year of assessment.",
      "speaker": "court",
      "significance": "Final holding upholding assessments."
    }
  ],
  "_case_id": "1960_50",
  "_label": 0,
  "_text_length": 8085,
  "_extracted_at": "2026-02-10T19:51:57.401785"
}