{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Managing Agent of Keshav Mills Ltd.",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur J."
    ],
    "case_number": "Civil Appeal No. 167 of 1958",
    "date_of_judgment": "1960-02-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "By an agreement dated September 23, 1935, the respondent partnership firm was appointed the Managing Agent of Keshav Mills Ltd.",
      "type": "background",
      "date": "1935-09-23",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By cl. 4 of the agreement, Managing Agent entitled to commission of 4% on sale proceeds of cloth, yarn or other goods manufactured and sold, and 15% on bills for ginning, pressing, dyeing, bleaching, labour bills etc., exclusive of other charges.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Commission credited every six months with 6% interest per annum.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Total commission for accounting year 1950: Rs. 3,09,114.",
      "type": "material",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "During accounting year 1950, at oral request of Board of Directors of Managed Company, Managing Agent agreed to accept only Rs. 1,00,000 as commission, credited at end of 1950.",
      "type": "material",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Income-tax Officer and Appellate Assistant Commissioner held Rs. 3,09,114 accrued and taxable.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appeal to Income-tax Appellate Tribunal; Tribunal held Rs. 3,09,114 accrued but Rs. 1,00,000 taxable, Rs. 2,09,114 allowable under s.10(2)(xv) as foregone in interest of Managed Company. Past waivers also noted.",
      "type": "procedural",
      "date": "1953-02-26",
      "source": "tribunal"
    },
    {
      "id": "f8",
      "text": "Reference to Bombay High Court under s.66(1) at instance of appellant on two questions.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f9",
      "text": "High Court inclined to favour appellant but directed supplementary statement from Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Letter from Managing Agent dated September 18, 1951 to ITO: Only Rs. 1,00,000 accrued due to variation of terms; nothing foregone; to strengthen financial position of Managed Company (capital Rs.30 lacs + dep Rs.14 lacs = Rs.44 lacs vs block debit >Rs.48 lacs).",
      "type": "material",
      "date": "1951-09-18",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Tribunal supplementary statement dated May 3, 1954: No oblique motive; remission bona fide; expenditure wholly/exclusively for Managing Agent's business; foregone for business considerations/commercial expediency; interests linked - stronger Managed Company benefits Managing Agent via future commission.",
      "type": "material",
      "date": "1954-05-03",
      "source": "tribunal"
    },
    {
      "id": "f12",
      "text": "Basic facts from statement/documents: Unsatisfactory finances per balance sheet ending Dec 31, 1950; past partial/whole commission remittances when profits unsatisfactory; 1950 profits Rs.5,72,192 after Rs.1,00,000 commission (would be Rs.3,63,078 if full - lowest since 1940, highest commission); not bounty; accepted at instance of Chairman.",
      "type": "material",
      "date": "1950-12-31",
      "source": "tribunal"
    },
    {
      "id": "f13",
      "text": "High Court held Tribunal finding one of fact, supported by evidence; answered s.10(2)(xv) question in favour of Managing Agent.",
      "type": "procedural",
      "date": "1955-02-15",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances, the sum of Rs. 2,09,114 was assessable in the hands of the assessee as its income.",
      "framed_by": "appellant"
    },
    {
      "id": "i2",
      "text": "If the answer to question (i) is in the affirmative, whether the said sum is an allowable deduction from the assessee's income under Section 10(2)(xv) of the Act.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No evidence that Rs. 2,09,114 foregone was wholly and exclusively laid out for purpose of Managing Agent's business; past waivers in interest of Managed Company; must look at direct concern of Managing Agent, not remoter/indirect benefits to it via Managed Company.",
      "supporting_facts": [
        "f7",
        "f13"
      ],
      "legal_basis": "s.10(2)(xv); Tata Sons Ltd. v. CIT; Union Cold Storage Co. Ltd. v. Jones"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Only Rs. 1,00,000 accrued due to variation of terms at request of Chairman to strengthen Managed Company's finances; remission bona fide, for commercial expediency, interests linked for future larger commission.",
      "supporting_facts": [
        "f5",
        "f10",
        "f11",
        "f12"
      ],
      "legal_basis": "s.10(2)(xv); Atherton v. British Insulated & Helsby Cables Ltd."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Whether expenditure under s.10(2)(xv) is question of fact for Tribunal; if evidence supports finding that laid out wholly/exclusively for assessee's business, admissible.",
      "addresses_issue": "i2",
      "key_observation": "Tribunal finding supported by evidence (financial position, past practice, linked interests, commercial expediency); not bounty or oblique."
    },
    {
      "id": "cr2",
      "text": "Deduction allowable if for commercial expediency, voluntary, to facilitate assessee's business; immaterial if third party benefits; direct vs indirect not strict if for assessee's trade.",
      "addresses_issue": "i2",
      "key_observation": "Cases distinguish: allowable if nexus to assessee's business (e.g. Eastern Investments); not if solely for another's (e.g. Odhams)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rs. 2,09,114 allowable deduction under s.10(2)(xv) as laid out wholly and exclusively for assessee's business for commercial expediency.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Tata Sons Ltd. v. Commissioner of Income-tax, Bombay",
      "citation": "1950 18 I.T.R. 460",
      "treatment": "distinguished",
      "relevance": "Payment to increase Managed Company's efficiency/profits thereby Managing Agent's commission; nexus exists."
    },
    {
      "case_name": "Union Cold Storage Company Ltd. v. Jones",
      "citation": "8 T.C. 725",
      "treatment": "distinguished",
      "relevance": "Insurance premiums not deductible as assets used for another's business; must be for assessee's trade, not reflex benefit."
    },
    {
      "case_name": "Eastern Investments Ltd. v. Commissioner of Income-tax, West Bengal",
      "citation": "1951 S.C.R. 594",
      "treatment": "followed",
      "relevance": "Transaction for commercial expediency to facilitate business; immaterial if third party benefits, absent fraud."
    },
    {
      "case_name": "Odhams Press Ltd. v. Cook",
      "citation": "23 T.C. 233",
      "treatment": "distinguished",
      "relevance": "Writing off subsidiary's loss not wholly for assessee's trade."
    },
    {
      "case_name": "Ushers Wiltshire Brewery Ltd. v. Bruce",
      "citation": "6 T.C. 399",
      "treatment": "followed",
      "relevance": "Payment may inure to third party if for assessee's trade."
    },
    {
      "case_name": "Atherton v. British Insulated & Helsby Cables Ltd.",
      "citation": "10 T.C. 155",
      "treatment": "followed",
      "relevance": "Voluntary expenditure for commercial expediency, indirectly facilitating business, deductible."
    },
    {
      "case_name": "Smith v. Incorporated Council of Law Reporting",
      "citation": "6 T.C. 477",
      "treatment": "referred",
      "relevance": "Supports commercial expediency test."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s. 66(1)",
        "s. 10(2)(xv)"
      ],
      "relevance": "Reference under s.66(1); deduction if wholly/exclusively for business per s.10(2)(xv)"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court and Tribunal; Rs. 2,09,114 foregone by Managing Agent is deductible under s.10(2)(xv) as expenditure for commercial expediency in assessee's business.",
    "relief_granted": "Deduction allowed to respondent Managing Agent",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It was assumed that what was in the interest of the managed company was in the interest of the managing agent. The interests of the managing agent and the managed company are, so to say, linked up.\"",
      "speaker": "tribunal",
      "significance": "Explains basis for finding of commercial expediency and linked interests."
    },
    {
      "text": "\"In the absence of a suggestion of fraud this is not relevant at all... The test... is not whether the other party benefited... but whether it was properly entered into as a part of the appellant's legitimate commercial undertaking.\"",
      "speaker": "court",
      "significance": "From Eastern Investments; core test for deductibility."
    },
    {
      "text": "\"Thus in cases like the present one in order to justify deduction the sum must be given up for reasons of commercial expediency... so long as it is incurred for the assessee's benefit the deduction would be claimable.\"",
      "speaker": "court",
      "significance": "Summarizes holding applying to facts."
    }
  ],
  "_case_id": "1960_246",
  "_label": 0,
  "_text_length": 23827,
  "_extracted_at": "2026-02-10T19:55:15.070651"
}