{
  "metadata": {
    "case_name": "State of Madhya Pradesh & Anr. v. Baldeo Prasad",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 271 of 1956",
    "date_of_judgment": "1960-10-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Act was passed in 1946 and came into force on September 7, 1946. It was subsequently amended and the amended Act came into force on November 24, 1950.",
      "type": "background",
      "date": "1946-09-07",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant 1 (State of Madhya Pradesh) issued a proclamation under S. 3 on August 10, 1954, specifying the limits of Police Stations Parasia and Jamai and Chhindwara Town as proclaimed area.",
      "type": "procedural",
      "date": "1954-08-10",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Proclamation renewed in November, 1954 and February, 1955.",
      "type": "procedural",
      "date": "1954-11",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On May 9, 1955, appellant 1 issued a fresh proclamation specifying the whole of the Chhindwara District as the proclaimed area, to remain in force till August 8, 1955.",
      "type": "procedural",
      "date": "1955-05-09",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Second appellant (District Magistrate, Chhindwara) received reports from the District Superintendent of Police, Chhindwara, against the respondent.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Second appellant ordered issue of a notice to respondent to show cause why action should not be taken against him under s. 4, requiring appearance on April 29, 1955. Respondent served but did not appear.",
      "type": "procedural",
      "date": "1955-04-29",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Second appellant sent a report to appellant 1 on April 30, 1955, submitting the case with a draft order for approval under the first proviso to s. 4(1).",
      "type": "procedural",
      "date": "1955-04-30",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Second appellant issued a fresh notice against the respondent under s. 4 on May 24, 1955.",
      "type": "procedural",
      "date": "1955-05-24",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Respondent appeared in person on May 30, 1955, and was given time to file his written statement which he did on June 4, 1955. Case fixed for hearing on June 22, 1955.",
      "type": "procedural",
      "date": "1955-05-30",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "State Government (appellant 1) passed an order on June 16, 1955, under s. 4-A directing that the respondent shall, except as permitted by the second appellant from time to time, not remain in any place in Chhindwara District until August 8, 1955.",
      "type": "material",
      "date": "1955-06-16",
      "source": "state"
    },
    {
      "id": "f11",
      "text": "On June 22, 1955, the second appellant communicated the said order to the respondent and directed him to leave the District before 10 a.m. on June 23, 1955.",
      "type": "procedural",
      "date": "1955-06-22",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Respondent appealed to appellant 1 to cancel the order. First appellant treated it as a representation under s. 6 and rejected it on July 9, 1955.",
      "type": "procedural",
      "date": "1955-07-09",
      "source": "state"
    },
    {
      "id": "f13",
      "text": "Respondent filed writ petition No. 249 of 1955 in Nagpur High Court under Art. 226 challenging validity of orders dated June 16 and June 22, 1955, inter alia on ground that the Act is ultra vires.",
      "type": "procedural",
      "date": "1955-07-08",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "High Court by judgment and order dated August 2, 1955, upheld respondent's plea, held ss. 4 and 4-A invalid, and whole Act invalid.",
      "type": "procedural",
      "date": "1955-08-02",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Central Provinces and Berar Goondas Act X of 1946 as amended by Madhya Pradesh Act XLIX of 1950, particularly ss. 4 and 4-A, is ultra vires and invalid as invading fundamental rights under Art. 19(1)(d) and (e) read with Art. 13, and not saved by Art. 19(5).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court erred in concluding that the restrictions imposed by the Act do not attract Art. 19(5). The Act relates to public order, within legislative competence. Purpose is to safeguard individual rights and protect public against prejudicial activities of goondas in proclaimed areas for limited duration, thus prima facie within Art. 19(5).",
      "supporting_facts": [
        "f1",
        "f2",
        "f4"
      ],
      "legal_basis": "Art. 19(5); Entry I List II Seventh Schedule to 1935 Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Act invades fundamental rights under Art. 19(1)(d) and (e) and is invalid under Art. 13.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": "Art. 19(1)(d), 19(1)(e), Art. 13"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Ss. 4 and 4-A suffer from serious infirmities: no provision requiring District Magistrate to first decide if person is a 'goonda'; vague inclusive definition of 'goonda' provides no guidance; hearing under s.4(2) does not contemplate enquiry into whether person is goonda. These leave unfettered discretion, making restrictions unreasonable and outside Art. 19(5).",
      "addresses_issue": "i1",
      "key_observation": "Primary condition precedent is that person must be goonda, but no obligation on authority to satisfy itself thereof; definition affords no assistance."
    },
    {
      "id": "cr2",
      "text": "Obligation to determine if person is goonda is not implicit; statute must expressly require it for preventive actions restricting fundamental rights.",
      "addresses_issue": "i1",
      "key_observation": "Silence on condition precedent constitutes infirmity taking it out of Art. 19(5)."
    },
    {
      "id": "cr3",
      "text": "Contrast with Bombay statutes (s.27 City Police Act 1902; ss.56,57 Bombay Police Act 1951) which provide clear provisions and safeguards, upheld by this Court.",
      "addresses_issue": "i1",
      "key_observation": "Possible to check mischief with specific safeguards for innocents."
    },
    {
      "id": "cr4",
      "text": "Purpose of Act above reproach, but operative sections' infirmities so serious that Act not saved by Art. 19(5); if ss.4,4-A invalid, whole Act falls.",
      "addresses_issue": "i1",
      "key_observation": "Restrictions unreasonable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Ss. 4 and 4-A invalid due to infirmities; restrictions unreasonable, not saved by Art. 19(5); whole Act invalid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gurbachan Singh v. The State of Bombay",
      "citation": "1952 S.C.R. 737",
      "treatment": "followed",
      "relevance": "Upheld s.27 City of Bombay Police Act, 1902 for dispersal of gangs."
    },
    {
      "case_name": "Bhagubhai Dullabhabhai Bhandari v. The District Magistrate, Thana",
      "citation": "1956 S.C.R. 533",
      "treatment": "followed",
      "relevance": "Confirmed s.56 Bombay Police Act, 1951."
    },
    {
      "case_name": "Hari Khemu Gawali v. The Deputy Commissioner of Police, Bombay",
      "citation": "1956 S.C.R. 506",
      "treatment": "followed",
      "relevance": "Confirmed s.57 Bombay Police Act, 1951; shows how clear provisions with safeguards can validly check undesirable activities."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Provinces and Berar Goondas Act X of 1946 (as amended by Madhya Pradesh Act XLIX of 1950)",
      "sections": [
        "2",
        "3",
        "4",
        "4-A",
        "6"
      ],
      "relevance": "Operative provisions for control of goondas in proclaimed areas held invalid for vagueness and lack of safeguards."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "132",
        "226",
        "19(1)(d)",
        "19(1)(e)",
        "19(5)",
        "13"
      ],
      "relevance": "Act held to unreasonably restrict rights under Art.19(1)(d),(e), not saved by Art.19(5)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; correctness of High Court's conclusion that ss.4 and 4-A are invalid and whole Act falls to the ground upheld.",
    "relief_granted": "High Court's order quashing orders under ss.4 and 4-A upheld implicitly.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The failure of the section to make a provision in that behalf undoubtedly constitutes a serious infirmity in its scheme.",
      "speaker": "court",
      "significance": "Highlights key defect: no procedure to determine if person is goonda."
    },
    {
      "text": "The restrictions which it allows to be imposed on the exercise of the fundamental right of a citizen guaranteed by Art. 19(1)(d) and (e) must in the circumstances be held to be unreasonable.",
      "speaker": "court",
      "significance": "Core holding on unreasonableness under Art.19(5)."
    },
    {
      "text": "If the operative sections are invalid the whole Act must fall.",
      "speaker": "court",
      "significance": "Reason for striking down entire Act."
    }
  ],
  "_case_id": "1960_235",
  "_label": 0,
  "_text_length": 21316,
  "_extracted_at": "2026-02-10T19:54:35.233048"
}