{
  "metadata": {
    "case_name": "Messrs. Swadesamitran Ltd., Madras v. their workmen",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On August 26, 1950, the respondents addressed a charter of demands to the appellant containing eleven demands, intimating that if not granted, they would go on strike.",
      "type": "background",
      "date": "1950-08-26",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant informed respondents it was working at a loss, retrenchment and rationalisation under consideration, promised sympathetic consideration when financial condition improved; demands withdrawn.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On January 24, 1951, respondents addressed communication with thirteen demands coupled with strike threat; copy sent to State Government requesting reference to tribunal.",
      "type": "background",
      "date": "1951-01-24",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Conciliation Officer found demands not justified, reported on February 22, 1951.",
      "type": "procedural",
      "date": "1951-02-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondents repeated request for reference; Government ordered on April 24, 1951, no case for reference.",
      "type": "procedural",
      "date": "1951-04-24",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant effecting retrenchment due to steep rise in newsprint prices, scarcity of supplies, Government of India price-page schedule, progressive mechanisation by installing linotype machines.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Respondents' Union called strike ballot; decided to strike, notice issued on May 9, 1951.",
      "type": "background",
      "date": "1951-05-09",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant appealed not to precipitate, promised consideration of demands, warned strike notice refusal to work would deem resignation.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Conciliation Officer advised respondents not to strike.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Respondents went on strike on May 30, 1951.",
      "type": "material",
      "date": "1951-05-30",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Before strike, services of 39 workmen terminated by notice as retrenchment effective May 18, 1951.",
      "type": "material",
      "date": "1951-05-18",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Respondents filed writ petition in Madras High Court for reference under s.10(1)(c); allowed, but appeal modified to direction under s.12(5).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Strike called off June 12, 1951; offered to resume work, but appellant engaged new hands, re-engaged only some.",
      "type": "material",
      "date": "1951-06-12",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "On November 3, 1951, three items including justification of retrenchment of 39 workmen referred to Industrial Tribunal Madras under s.10(1)(c).",
      "type": "procedural",
      "date": "1951-11-03",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Industrial Tribunal held strike unjustified, retrenchment justified though last come first go not strictly followed, preference to mechanically inclined with good eyesight; no unfair practice; no relief.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Labour Appellate Tribunal found findings on bona fides and validity not justified; remanded for four points including compliance with last come first go and unfair practice/victimisation.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Post-remand, Industrial Tribunal: necessity and extent justified, no mala fides; but last come first go not observed for 15 out of 39; ordered reinstatement of 15 without back wages; no order for 24.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Labour Appellate Tribunal: confirmed retrenchment of 39 justified but last come first go not followed, no justification to depart; reinstated 15 with half back wages; 24 compensation half month's wages per year of service.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Labour Appellate Tribunal erred in directing reinstatement despite finding retrenchment necessary and bona fide, and strike unjustified.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether Labour Appellate Tribunal exceeded jurisdiction by inquiring into validity and reasonableness of selection for retrenchment.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether principle of 'last come first go' was complied with in retrenchment, and if departed, whether justified.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether reinstatement appropriate relief or only compensation; quantum of compensation.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Labour Appellate Tribunal erred in directing reinstatement inconsistent with findings of bona fides, necessity of retrenchment, and unjustified strike; interference only if mala fide.",
      "supporting_facts": [
        "f15",
        "f17",
        "f18"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Retrenchment is normal management function; once necessity made out, discretion in selection absolute; tribunal exceeded jurisdiction by scrutinising selection.",
      "supporting_facts": [
        "f6",
        "f11"
      ],
      "legal_basis": "J.K. Iron Steel Co. Ltd. v. Its Workmen (Civil Appeal No. 266 of 1958)"
    },
    {
      "id": "pa3",
      "text": "Even if retrenchment of 15 unjustified, reinstatement not proper; compensation instead; compensation to 24 unjustified.",
      "supporting_facts": [
        "f17",
        "f18"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Retrenchment of 39 workmen violated 'last come first go' principle without justification; amounted to unfair labour practice or victimisation.",
      "supporting_facts": [
        "f11",
        "f17"
      ],
      "legal_basis": "Industrial rule of last come first go; s.25G Industrial Disputes Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Two aspects: (1) necessity for retrenchment of 39 justified (unjustified strike, financial reasons); bona fides established. (2) Selection must follow 'last come first go' unless valid reasons with evidence; departure for 15 not justified.",
      "addresses_issue": "i1",
      "key_observation": "Bona fides in necessity irrelevant to fairness in selection; no inconsistency in findings."
    },
    {
      "id": "cr2",
      "text": "Management prerogative to retrench if justified, but must ordinarily follow 'last come first go'; departure allowed for efficiency, reliability etc., with reliable evidence; onus on employer to justify.",
      "addresses_issue": "i2",
      "key_observation": "Departure without justification can itself indicate mala fides or unfair practice."
    },
    {
      "id": "cr3",
      "text": "Appellant's evidence (testimony of Mr. Lakshminarasimhan, statements T-1, T-2) from memory, no contemporaneous records; defects attributed not satisfactory; personal knowledge doubted; specific cases demonstrably unsatisfactory.",
      "addresses_issue": "i3",
      "key_observation": "Tribunal correctly rejected evidence; retrenchment of 15 unfair labour practice."
    },
    {
      "id": "cr4",
      "text": "Improper retrenchment entitles to reinstatement; new hands or delay no bar; compensation quantum discretionary.",
      "addresses_issue": "i4",
      "key_observation": "Consistent with precedents on wrongful dismissal/discharge."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Industrial tribunals have jurisdiction to examine compliance with 'last come first go' and justification for departure; onus on employer.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Departure from 'last come first go' without sound reasons amounts to unfair labour practice; reinstatement and compensation upheld.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Reinstatement proper for improper retrenchment despite new hands or delay.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Indian Navigation Industrials, Alleppey And Certain Workmen",
      "citation": "1952 II L.L.J. 611",
      "treatment": "followed",
      "relevance": "Accepted and applied principle of last come first go in retrenchment."
    },
    {
      "case_name": "Cuttack Electric Supply Co. Ltd. And Their Workmen",
      "citation": "1954 I L.L.J. 723",
      "treatment": "followed",
      "relevance": "Accepted and applied principle of last come first go in retrenchment."
    },
    {
      "case_name": "Shaparia Dock and Steel Company And Their Workers",
      "citation": "1954 II L.L.J. 208",
      "treatment": "followed",
      "relevance": "Accepted and applied principle of last come first go in retrenchment."
    },
    {
      "case_name": "J.K. Iron Steel Co. Ltd. v. Its Workmen",
      "citation": "Civil Appeal No. 266 of 1958 decided on 11-2-1960",
      "treatment": "referred",
      "relevance": "Departure from last come first go without sound reasoning not bona fide; does not support absolute management discretion."
    },
    {
      "case_name": "The Punjab National Bank Ltd. v. The All-India Punjab National Bank Employees Federation",
      "citation": null,
      "treatment": "followed",
      "relevance": "Reinstatement not defeated by lapse of time or fresh hands in wrongful dismissal."
    },
    {
      "case_name": "National Transport and General Co. Ltd. v. The Workmen",
      "citation": "Civil Appeal No. 312 of 1956 decided on January 22, 1957",
      "treatment": "followed",
      "relevance": "Reinstatement not defeated by lapse of time or fresh hands in wrongful dismissal/discharge/retrenchment."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 10(1)(c)",
        "s. 12(5)",
        "s. 25G"
      ],
      "relevance": "Reference for adjudication; government duties; statutory recognition of 'last come first go' with reasons for departure."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; upheld Labour Appellate Tribunal's order reinstating 15 workmen with half back wages and awarding compensation to remaining 24 retrenched workmen at half month's wages per year of service.",
    "relief_granted": "Reinstatement of 15 workmen with half back wages; compensation to 24 workmen.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the ordinary industrial rule of retrenchment is last come first go, and where other things are equal this rule has to be followed by the employer in effecting retrenchment.\"",
      "speaker": "court",
      "significance": "Core holding on retrenchment principle and exceptions."
    },
    {
      "text": "\"departure from the ordinary industrial rule of retrenchment without any justification may itself, in a proper case, lead to the inference that the impugned retrenchment is the result of ulterior considerations.\"",
      "speaker": "court",
      "significance": "Justifies tribunal interference and finding of unfair practice."
    },
    {
      "text": "\"Ordinarily, if a workman has been improperly and illegally retrenched he is entitled to claim reinstatement.\"",
      "speaker": "court",
      "significance": "Affirms relief of reinstatement."
    }
  ],
  "_case_id": "1960_140",
  "_label": 0,
  "_text_length": 21674,
  "_extracted_at": "2026-02-10T19:53:18.482877"
}