{
  "metadata": {
    "case_name": "Messrs. Bhaichand Amolukh Co. v. Commissioner of Income-tax",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Bhaichand Amolukh Vora started a firm in 1910 as principal agents for insurance companies. Partners: Bhaichand Vora, Chhotalal Bhaichand, Nathubhai Patel.",
      "type": "background",
      "date": "1910",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Bhaichand Vora died in 1948; surviving partners Chhotalal Bhaichand and Nathubhai Patel continued the firm.",
      "type": "material",
      "date": "1948",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Nathubhai Patel died in 1949; firm thereafter consisted of Chhotalal Bhaichand and his wife Bai Lalitaben.",
      "type": "material",
      "date": "1949",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Business of the firm treated as sole business of Chhotalal Bhaichand; wife's income included in his under section 16(3) of Income-tax Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Insurance Amendment Act, 1950 (No. 67 of 1950) added section 42B to Insurance Act, 1938, prohibiting insurers from appointing principal agents after 7 years from commencement.",
      "type": "background",
      "date": "June 1950",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Chhotalal Bhaichand accepted job as assistant manager of New India Assurance Company and withdrew from the firm.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Old firm reconstituted from January 1, 1953 (deed executed April 22, 1953). Partners: Bai Manibai (mother of Chhotalal) - 5 annas, Mr. Khambatta - 3 annas, Mr. Premchand D. Parikh - 3 annas. Minors Jayant and Harshad (sons of Chhotalal) admitted to benefits - 1.5 annas each. Balance 2 annas for reserve fund.",
      "type": "material",
      "date": "1953-01-01",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Application for registration of new firm under section 26A of Income-tax Act for assessment year 1954-55 (calendar year 1953).",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Income-tax Officer (ITO) declined registration on September 30, 1954: firm belonged to Chhotalal; no formal transfer; no interest in goodwill for Khambatta and Premchand; no consideration for Manibai and minors; goodwill reason fallacious; cheque for Rs. 6,400 to Manibai traced to Chhotalal.",
      "type": "procedural",
      "date": "1954-09-30",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellate Assistant Commissioner (AAC) ordered registration on appeal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Tribunal set aside AAC order, held Manibai and minors not real partners; partnership consisted of Chhotalal, Premchand, Khambatta; restored ITO order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Firm applied for reference; Tribunal declined, setting out 18 questions.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court under section 66(2): declined first question on genuineness; referred second recast question on whether Tribunal should have directed assessment on unregistered firm of Chhotalal, Premchand, Khambatta.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "No adjustment entries in books on Chhotalal's exit; business carried on as before.",
      "type": "disputed",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f15",
      "text": "Khambatta and Premchand (employee and agent) had no right to goodwill; reserved for Manibai.",
      "type": "disputed",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f16",
      "text": "Monthly drawings of Premchand and Khambatta limited to Rs. 300, equal to past remuneration.",
      "type": "disputed",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f17",
      "text": "Old bank accounts continued; one operated by Chhotalal, others by new partners under power-of-attorney not withdrawn.",
      "type": "disputed",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f18",
      "text": "No new letters of appointment from insurance companies; no written communication.",
      "type": "disputed",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f19",
      "text": "Lalitabai (Chhotalal's wife) disappeared; no mention in new deed.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Manibai's explanation for Rs. 5,000 spent on charities not accepted.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court erred in refusing to call for a reference on the question: Whether the Tribunal's finding that the partnership is not genuine but in reality between Chhotalal, Premchand and Khambatta is supported by material or based on conjectures, suspicions, etc.?",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "In view of Tribunal's finding of partnership between Chhotalal, Premchand and Khambatta, whether Tribunal ought to have directed assessment on that unregistered firm instead of restoring ITO order.",
      "framed_by": "high_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No materials to support Tribunal's finding that firm seeking registration was a pretense; Tribunal acted on suspicions, conjecture, surmises.",
      "supporting_facts": [
        "f14",
        "f15",
        "f16",
        "f17",
        "f18"
      ],
      "legal_basis": "Dhirajlal Girdharilal v. CIT, Omar Salay Mohamed Sait v. CIT, Lalchand Bhagat Ambica Ram v. CIT, Umacharan Shaw Bros. v. CIT"
    },
    {
      "id": "pa2",
      "text": "High Court erred in not calling for reference on first question.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "There was material for Tribunal's finding; order considered all facts fairly.",
      "supporting_facts": [
        "f19"
      ],
      "legal_basis": "Homi Jehangir Gheesta v. CIT"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Material existed for Tribunal's finding: no adjustment entries, no communication to insurers, bank accounts not transferred, power-of-attorney not cancelled, Lalitabai disappeared.",
      "addresses_issue": "i1",
      "key_observation": "Decision of Tribunal that firm not real cannot be said to be founded on no material."
    },
    {
      "id": "cr2",
      "text": "Tribunal's order read as whole shows fair consideration; not vitiated by defects in cited cases; no need to examine sentence by sentence.",
      "addresses_issue": "i1",
      "key_observation": "Tribunal considers probabilities from facts, not conjectures."
    },
    {
      "id": "cr3",
      "text": "Speculation on motive did not materially affect finding; case falls within Gheesta ruling.",
      "addresses_issue": "i1",
      "key_observation": "Solid facts support Tribunal."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court not in error in refusing reference on first question; material supported Tribunal's finding on sham partnership.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dhirajlal Girdharilal v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "referred",
      "relevance": "Tribunal findings not to be based on conjecture; appellant claimed Tribunal vitiated by such defects."
    },
    {
      "case_name": "Omar Salay Mohamed Sait v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "referred",
      "relevance": "Similar to above."
    },
    {
      "case_name": "Lalchand Bhagat Ambica Ram v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "referred",
      "relevance": "Similar to above."
    },
    {
      "case_name": "Umacharan Shaw Bros. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "referred",
      "relevance": "Similar to above."
    },
    {
      "case_name": "Homi Jehangir Gheesta v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Read Tribunal order as whole; consider if facts fairly considered; case falls within this ruling."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "16(3)",
        "26A",
        "66(2)"
      ],
      "relevance": "Wife's income inclusion; firm registration application; reference to High Court."
    },
    {
      "name": "Insurance Act, 1938",
      "sections": [
        "42B"
      ],
      "relevance": "Added by Amendment 1950; prohibited principal agents after 7 years."
    },
    {
      "name": "Insurance Amendment Act, 1950 (No. 67 of 1950)",
      "sections": null,
      "relevance": "Amended Insurance Act by adding section 42B."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal against High Court's refusal to refer the first question, holding there was material for Tribunal's finding and no error in not referring the genuineness issue. Second question to be decided later.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the alleged partnership with Manibai and admitting Jayant and Harshad to the profits of the partnership was nothing short of a farce.\"",
      "speaker": "tribunal",
      "significance": "Tribunal's key finding on sham nature."
    },
    {
      "text": "\"It is in reality a partnership between the assessee, Premchand and Khambatta. Manibai and the two minor sons are bogus parties.\"",
      "speaker": "tribunal",
      "significance": "Core holding of Tribunal on partners."
    },
    {
      "text": "\"We must read the order of the Tribunal as a whole to determine whether every material fact... has been considered fairly.\"",
      "speaker": "court",
      "significance": "Standard from Gheesta case applied."
    }
  ],
  "_case_id": "1960_121",
  "_label": 0,
  "_text_length": 14328,
  "_extracted_at": "2026-02-10T19:53:13.909631"
}