{
  "metadata": {
    "case_name": "Shree Changdeo Sugar Mills Ltd. v. Commissioner of Income-tax",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 380 of 1957",
    "date_of_judgment": "1960-12-07"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeal filed by Shree Changdeo Sugar Mills Ltd. on certificate by Bombay High Court from judgment and order dated March 8, 1956, in Income-tax Reference No. 4 of 1956.",
      "type": "procedural",
      "date": "1956-03-08",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Assessment year 1948-49; s. 23A of Income-tax Act (prior to amendment by Finance Act, 1955) applied.",
      "type": "background",
      "date": "1948-49",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Company distributed dividends to extent of 60 per cent of its profits; Income-tax Officer passed order under s. 23A.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Company appealed to Appellate Assistant Commissioner, who dismissed appeal; further appeal to Tribunal unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Issued, subscribed and paid-up capital: 60,000 shares distributed as: Directors 41,500 shares; Managing Agency Firm 2,300 shares; Mysore Merchants Ltd. 11,880 shares; Others 4,320 shares.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Question: whether assessee company deemed a company in which public substantially interested (held 25 per cent of voting power). High Court answered negative, following Raghuvanshi Mills v. CIT.",
      "type": "disputed",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f7",
      "text": "Mysore Merchants Ltd. held 11,880 shares; if held by public along with 4,320 others, public would hold 25 per cent voting power.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "High Court held shares of Mysore Merchants Ltd. not held by public.",
      "type": "disputed",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f9",
      "text": "Mysore Merchants Ltd. had no assessable income in corresponding year, suffered loss; private company, public not substantially interested.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Cl. 14 of Part B States Taxation Concessions Order, 1950: provisions of s. 23A not applied to profits/gains of previous year ending before appointed day unless State law contained corresponding provision.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether at relevant time assessee company deemed a company in which public substantially interested (25 per cent voting power), particularly whether directors' holding counted as public.",
      "framed_by": "high_court"
    },
    {
      "id": "i2",
      "text": "Whether shares held by Mysore Merchants Ltd. could be said to be held by public for purpose of third proviso to s. 23A.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Directors' holding should not prevent company being one in which public substantially interested.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Raghuvanshi Mills v. CIT (disagreed by SC)"
    },
    {
      "id": "pa2",
      "text": "Mysore Merchants Ltd. shares held by public as: public substantially interested in it; no assessable profits; did not distribute 60 per cent; s. 23A not applicable.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "Third proviso and Explanation to s. 23A"
    },
    {
      "id": "pa3",
      "text": "Cl. 14 of Part B States Taxation Concessions Order, 1950 prevents application of s. 23A to Mysore Merchants Ltd.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Part B States Taxation Concessions Order, 1950, cl. 14"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Directors' holding means not substantially interested by public.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Raghuvanshi Mills v. CIT"
    },
    {
      "id": "ra2",
      "text": "Mysore Merchants Ltd. shares not held by public as it is private company where public not substantially interested.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "Explanation to s. 23A ('not including a company to which this sub-section applies')"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Bombay High Court test in Raghuvanshi Mills incorrect; correct test set out in that appeal (decided today); applies here.",
      "addresses_issue": "i1",
      "key_observation": "Directors' holding not the correct test."
    },
    {
      "id": "cr2",
      "text": "For Mysore Merchants Ltd., paramount condition is public substantially interested (25% voting power); admitted private company, public not interested.",
      "addresses_issue": "i2",
      "key_observation": "Shares held by it cannot be counted as public holding due to exclusion in Explanation."
    },
    {
      "id": "cr3",
      "text": "Cl. 14 concessions do not detract from s. 23A application for determining if shares beneficially held by public; company may avail concession but still fall within s. 23A for other purposes.",
      "addresses_issue": "i2",
      "key_observation": "Concession confers benefit but does not negative test."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Company not one where directors' holding alone determines lack of public interest; correct test as in Raghuvanshi Mills.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Shares of Mysore Merchants Ltd. (private company) not held by public per Explanation to s. 23A.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Raghuvanshi Mills Ltd. v. Commissioner of Income-tax",
      "citation": "1953 24 I.T.R. 338",
      "treatment": "distinguished",
      "relevance": "High Court followed it to hold directors' shares not public; SC held incorrect test, remanded that appeal."
    },
    {
      "case_name": "Raghuvanshi Mills Ltd. v. Commissioner of Income-tax, Bombay",
      "citation": "1961 2 S.C.R. 978",
      "treatment": "followed",
      "relevance": "SC decision today sets correct test; applies here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s. 23A",
        "third proviso to s. 23A",
        "Explanation to s. 23A"
      ],
      "relevance": "Applied to determine if company in which public substantially interested; whether Mysore Merchants shares count as public."
    },
    {
      "name": "Part B States Taxation Concessions Order, 1950",
      "sections": [
        "cl. 14"
      ],
      "relevance": "Prevents s. 23A application to certain profits but does not affect test for public interest in shares."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Appeal allowed; case remitted to High Court to decide question in light of observations in Raghuvanshi Mills case decided today.",
    "relief_granted": "Remitted to High Court for reconsideration.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The paramount condition is that even in that Company the public should be beneficially interested in 25 per cent. of the voting power.",
      "speaker": "court",
      "significance": "Key test for whether shares of another company count as public holding."
    },
    {
      "text": "We have heard Civil Appeal No. 30 of 1957 from the decision of the Bombay High Court in the Raghuvanshi Mills case, in which judgment has been pronounced today, and have held that that is not the correct test to apply.",
      "speaker": "court",
      "significance": "Overrules High Court's approach on directors' shares."
    }
  ],
  "_case_id": "1960_306",
  "_label": 1,
  "_text_length": 7880,
  "_extracted_at": "2026-02-10T19:55:51.809400"
}