{
  "metadata": {
    "case_name": "Amritlal Nagji & Ors. v. Jayantilal Doshi",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 121 of 1956",
    "date_of_judgment": "1960-05-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellants are two brothers, Amritlal and Mohanlal Nagji, and their mother, Bai Jakal Arjan. The three appellants and respondent 2, Nagji Govind, the father of appellants 1 and 2 and the husband of appellant 3, constitute an undivided Hindu family.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent 2 executed a mortgage deed in favour of respondent 1, Jayantilal Doshi, in respect of the joint family property for Rs. 2,000 on February 5, 1946.",
      "type": "material",
      "date": "1946-02-05",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent 2 had speculated in gold and silver and had thereby lost a large amount of money which he sought to make up by borrowing amounts from several creditors. One of such creditors was Dharsi Shamji to whom Rs. 2,000 were payable by respondent 2. The impugned mortgage had been executed by respondent 2 for the payment of the said debt of Rs. 2,000.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "In 1950, respondent 1 sued respondent 2 on his mortgage, obtained a decree for sale and filed an application for execution for sale of the mortgaged property.",
      "type": "procedural",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellants filed suit on April 30, 1951, claiming declaration that the decree passed in mortgage suit Civil Suit No. 589 of 1949 in favour of respondent 1 was not binding in respect of the 3/4th share of the appellants and perpetual injunction restraining respondent 1 from executing the decree in respect of their share.",
      "type": "procedural",
      "date": "1951-04-30",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Trial court found mortgaged property was coparcenary property of the family, mortgage executed to pay off immoral debt from speculative losses, respondent 1 made no enquiries, decreed suit for appellants.",
      "type": "procedural",
      "date": "1952-04-29",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "District Judge, Rajkot in Civil Appeal No. 4 of 1952 agreed with trial court findings and dismissed appeal.",
      "type": "procedural",
      "date": "1952-04-29",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Saurashtra High Court in Civil Second Appeal No. 82 of 1952 agreed property was joint family, no enquiry by respondent 1, assumed debt immoral but held appellants must prove respondent 1's notice of immorality, no evidence, allowed appeal and dismissed suit.",
      "type": "procedural",
      "date": "1953-01-29",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Respondents pleaded mortgage for binding family debts, no substance in immoral debt plea, mortgaged property not undivided family property.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "If a Hindu son wants to challenge an alienation made by his father to pay his antecedent debt, is it necessary for him to prove not only that the said antecedent debt was immoral but also that the alienee had notice of the immoral character of the said debt?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Principles of Hindu Law do not justify requiring sons to prove alienee's knowledge of immoral character of antecedent debt. Doctrine of pious obligation based on spiritual considerations for vyavaharik debts only; onus already heavy, adding notice requirement makes it impossible.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "Texts of Usanas, Mitakshara on Yajnavalkya; avyavaharik debts not payable by sons"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Mortgage executed for payment of debts binding on family; no substance in plea of immoral debts; mortgaged property not property of undivided Hindu family.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Follows Privy Council in Suraj Bunsi Koer: sons must prove antecedent debt immoral and alienee had notice thereof. Principle of stare decisis applies after long acceptance; protects bona fide alienees; not expedient to revisit based on ancient texts alone.",
      "addresses_issue": "i1",
      "key_observation": "Propositions from Suraj Bunsi Koer correctly represent Hindu Law; judicial decisions part of evolved Hindu Law incorporating equity."
    },
    {
      "id": "cr2",
      "text": "Trial and District Court erred by not requiring proof of alienee's notice; High Court correctly applied law assuming debt immoral but finding no evidence of notice.",
      "addresses_issue": "i1",
      "key_observation": "Sons' onus includes proving alienee's knowledge to challenge alienation for antecedent immoral debt."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "To challenge father's alienation of joint family property for antecedent debt, sons must prove debt was immoral or illegal and alienee had notice of its immoral character.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Suraj Bunsi Koer v. Sheo Proshad Singh",
      "citation": "1879 L.R. 6 I.A. 88",
      "treatment": "followed",
      "relevance": "Laid down propositions that sons must prove antecedent debt immoral and purchaser's notice thereof to recover alienated ancestral property."
    },
    {
      "case_name": "Girdharee Lal v. Kantoo Lal and Muddun Thakoor v. Kantoo Lal",
      "citation": "1874 L.R. 1 I.A. 321",
      "treatment": "referred",
      "relevance": "Held son cannot challenge alienation unless antecedent debt shown immoral; purchaser at execution sale not bound beyond decree."
    },
    {
      "case_name": "Hunooman Persad Panday v. Mussummat Babooee Munraj Koonweree",
      "citation": "1856 6 M.I.A. 393",
      "treatment": "followed",
      "relevance": "Freedom of son from obligation respects nature of debt, not estate."
    },
    {
      "case_name": "Brij Narain v. Mangla Prasad",
      "citation": "1923 L.R. 51 I.A. 129",
      "treatment": "followed",
      "relevance": "Father may burden estate by mortgage to discharge antecedent debt if not immoral; sons must show immorality and alienee's notice."
    },
    {
      "case_name": "Sat Narain v. Das",
      "citation": "1936 L.R. 63 I.A. 384",
      "treatment": "referred",
      "relevance": "Doctrine of pious obligation based on spiritual duty, not creditor benefit."
    },
    {
      "case_name": "Sat Narain v. Behari Lal",
      "citation": "1924 L.R. 52 I.A. 22",
      "treatment": "followed",
      "relevance": "Approved propositions from Suraj Bunsi Koer."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Saurashtra High Court decree dismissing the appellants' suit is dismissed, upholding that appellants failed to prove respondent 1's notice of the immoral character of the antecedent debt.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Where ancestral property has been alienated... the sons have to prove not only that the antecedent debts were immoral but also that the purchasers had notice that they were so contracted.",
      "speaker": "court",
      "significance": "Restates core proposition from Suraj Bunsi Koer upheld by Supreme Court."
    },
    {
      "text": "The basis of the doctrine is thus spiritual and its sole object is to confer spiritual benefit on the father. It is not intended in any sense for the benefit of the creditor.",
      "speaker": "court",
      "significance": "Explains foundation of pious obligation, limiting to vyavaharik debts."
    }
  ],
  "_case_id": "1960_31",
  "_label": 0,
  "_text_length": 32548,
  "_extracted_at": "2026-02-10T19:51:55.174469"
}