{
  "metadata": {
    "case_name": "The Company (Appellant) v. Respondents Nos. 1 to 4",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": "Civil Appeal No. 513 of 1958",
    "date_of_judgment": "1960-02-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents Nos. 1 to 4 are shareholders in the company which is the appellant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondents made an application against the appellant and its directors under s. 153-C of the Companies Act, 1913 before that Act was repealed on April 1, 1956.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Application made to the Court of the District Judge of Poona which had been empowered to exercise jurisdiction under the Act of 1913 by a notification issued by the Government of Bombay under s. 31 of that Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Before the application could be disposed of by the District Judge, Poona, the Act of 1913 was repealed and re-enacted on April 1, 1956, by the Companies Act of 1956.",
      "type": "procedural",
      "date": "1956-04-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On or about June 28, 1956, the appellant made an application to the District Judge of Poona for an order dismissing the application under s. 153-C of the Act of 1913 on the ground that on the repeal of that Act the Court had ceased to have jurisdiction.",
      "type": "procedural",
      "date": "1956-06-28",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "District Judge of Poona dismissed the appellant's application (Misc. Petition No. 2 of 1956 dated October 17, 1956).",
      "type": "procedural",
      "date": "1956-10-17",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant appealed to the High Court of Bombay (First Appeal No. 600 of 1956), which dismissed the appeal on November 20, 1957.",
      "type": "procedural",
      "date": "1957-11-20",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appeal by special leave to the Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Paid up capital of the appellant is more than Rs. 1,00,000.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The application under s. 153-C of the Act of 1913 contained a prayer in the alternative for the winding up of the appellant.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Provisions of s. 153-C of the Act of 1913 have been substantially re-enacted by ss. 397 to 407 of the Act of 1956.",
      "type": "admitted",
      "date": null,
      "source": "parties"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the proceeding before the District Judge of Poona under s. 153-C of the Act of 1913 can be continued in spite of the repeal of the Act of 1913 by the Act of 1956.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the notification under s. 31 of the Act of 1913 empowering the District Judge of Poona continues to have force after repeal in view of s. 10 of the Act of 1956 and s. 24 of the General Clauses Act.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The proceeding under s. 153-C of the Act of 1913 had not been saved by ss. 645 to 657 of the Act of 1956.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Sections 645 to 657 of Companies Act, 1956"
    },
    {
      "id": "pa2",
      "text": "Section 6 of the General Clauses Act does not apply as the Act of 1956 indicates a different intention to destroy the rights and liabilities under s. 153-C, particularly s. 647.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 6 General Clauses Act; Section 647 Companies Act, 1956"
    },
    {
      "id": "pa3",
      "text": "Section 10 of Act 1956 and s. 24 General Clauses Act mean the notification under s. 31 Act 1913 ceases to have force as District Court cannot be empowered for companies with paid-up capital over Rs. 1,00,000 for reliefs under ss. 397-407 or winding up.",
      "supporting_facts": [
        "f3",
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "Section 10 Companies Act, 1956; Section 24 General Clauses Act; Sections 397-407 Companies Act, 1956"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The proceeding can be continued under s. 6 of the General Clauses Act as preserved by s. 658 of the Act of 1956.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 6 General Clauses Act; Section 658 Companies Act, 1956"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 6 of the General Clauses Act applies to preserve rights, liabilities and proceedings under the repealed Act of 1913 unless different intention appears; s. 658 of Act 1956 expressly provides it does not prejudice application of s. 6.",
      "addresses_issue": "i1",
      "key_observation": "s. 153-C created rights and liabilities which are preserved."
    },
    {
      "id": "cr2",
      "text": "Act 1956 contains fresh legislation but does not manifest intention to destroy old rights; s. 647 only saves winding up proceedings and does not indicate contrary intention per State of Punjab v. Mohar Singh.",
      "addresses_issue": "i1",
      "key_observation": "Mention in s. 647 does not prejudice s. 6 per s. 658."
    },
    {
      "id": "cr3",
      "text": "Substantial re-enactment of s. 153-C in ss. 397-407 indicates no intention to destroy rights.",
      "addresses_issue": "i1",
      "key_observation": "Parties agreed on re-enactment."
    },
    {
      "id": "cr4",
      "text": "s. 10 Act 1956 deals only with jurisdiction under new Act and does not destroy old rights or affect pending proceedings under s. 6.",
      "addresses_issue": "i2",
      "key_observation": "Contrary intention must show intent to destroy rights."
    },
    {
      "id": "cr5",
      "text": "s. 24 General Clauses Act continues notifications unless inconsistent, but does not cancel them; jurisdiction continues under s. 6 for pending proceeding.",
      "addresses_issue": "i2",
      "key_observation": "If not, s. 6 would be infructuous."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The proceeding under s. 153-C of the Act of 1913 can be continued notwithstanding repeal by Act of 1956 in view of s. 6 General Clauses Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "District Judge of Poona continues to have jurisdiction.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Punjab v. Mohar Singh",
      "citation": "1955 1 S.C.R. 893",
      "treatment": "followed",
      "relevance": "s. 6 applies even with fresh legislation in repealing Act unless it manifests intention to destroy old rights and liabilities."
    }
  ],
  "statutes_cited": [
    {
      "name": "Companies Act, 1913",
      "sections": [
        "s. 153-C",
        "s. 31"
      ],
      "relevance": "Created rights/liabilities for shareholders against company/directors; jurisdiction via notification."
    },
    {
      "name": "Companies Act, 1956",
      "sections": [
        "s. 10",
        "s. 397-407",
        "s. 555(7)",
        "s. 644-658",
        "s. 647",
        "s. 658"
      ],
      "relevance": "Repeals 1913 Act; saving provisions; preserves s. 6 Gen Clauses; jurisdiction limits; re-enacts s. 153-C substantially."
    },
    {
      "name": "General Clauses Act, 1897",
      "sections": [
        "s. 6",
        "s. 24"
      ],
      "relevance": "Preserves proceedings on repeal unless different intention; continues notifications on re-enactment."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, holding that the proceeding under s. 153-C of the Companies Act, 1913 before the District Judge, Poona can continue despite repeal by the Companies Act, 1956, in view of s. 6 of the General Clauses Act.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Section 6 of the General Clauses Act provides that where an Act is repealed, then, unless a different intention appears, the repeal shall not affect any right or liability acquired or incurred under the repealed enactment or any legal proceeding in respect of such right or liability\"",
      "speaker": "court",
      "significance": "Core principle applied to preserve the proceeding."
    },
    {
      "text": "\"Section 658 of the Act of 1956 expressly provides that, The mention of particular matters in ss. 645 to 657 or in any other provision of this Act shall not prejudice the general application of s.6 of the General Clauses Act\"",
      "speaker": "court",
      "significance": "Confirms applicability of s. 6 despite savings in new Act."
    },
    {
      "text": "\"It seems to us that since under s. 6 of the General Clauses Act the proceeding in respect of the application under s. 153-C of the Act of 1913 may be continued after the repeal of that Act, it follows that the District Judge of Poona continues to have jurisdiction\"",
      "speaker": "court",
      "significance": "Concludes on jurisdiction."
    }
  ],
  "_case_id": "1960_137",
  "_label": 0,
  "_text_length": 10845,
  "_extracted_at": "2026-02-10T19:53:07.986886"
}