{
  "metadata": {
    "case_name": "Debendra Nath Dutta v. Income-tax Investigation Commission and Union of India",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Appeal by special leave against report in R.C. No. 332A",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Captain N. N. Dutta was the managing director of Bengal Immunity Co. Ltd. and made large profits during the last war which were neither disclosed nor detected by the Income-tax Department, thus escaping income-tax on concealed income.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On March 23, 1949, the Commission made a report to the Central Government under section 5(4) of the Act asking for reference of Captain N. N. Dutta's case to itself.",
      "type": "procedural",
      "date": "1949-03-23",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Commission directed search of four premises belonging to or occupied by Captain N. N. Dutta and his relations, resulting in possession of complete sets of books containing receipts and disbursements of secret profits.",
      "type": "material",
      "date": "1949-03-23",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Captain N. N. Dutta's case was R.C. No. 332A and investigated after reference by Central Government.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Captain N. N. Dutta offered full disclosure and to pay tax due but died on April 6, 1949, leaving brothers, nephews, nieces as per pedigree: Krishna Kumar Dutta (elder brother), Debendra Nath Dutta (appellant, younger brother), Charunalini Dutta (widow of another elder brother), etc.",
      "type": "material",
      "date": "1949-04-06",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Substantial portion of concealed profits invested by Captain N. N. Dutta in names of nephews (sons of Kamini Kumar Dutta and their wives), niece Maya, widowed sister-in-law Charunalini Dutta, in Government securities and bank deposits.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Kamini Kumar Dutta and appellant Debendra Nath Dutta brought on record as legal representatives.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Kamini Kumar Dutta wrote to Commission that he had no connection with brother's business but as legal representative accepted obligation to pay in full and advised sons to disclose and pay.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Total concealed income earned and received by Captain N. N. Dutta during 1940-41 to 1947-48 found to be Rs. 58,24,023, accepted by Kamini Kumar Dutta and appellant.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant took no part in enquiry but after completion was summoned, informed of amount, invited to examine materials; accepted amount but submitted he had no assets of deceased.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On July 5, 1949, Kamini Kumar Dutta's branch applied for composition under section 8A; Commission recommended settlement for recovery purposes only for that branch, not appellant; recommended allocation of concealed income equally over 8 years and concession for that branch; amount from branch Rs. 29,74,480.",
      "type": "procedural",
      "date": "1949-07-05",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Commission's report clarified appellant not party to composition; Government entitled to recover full tax from him if assets found in his possession.",
      "type": "procedural",
      "date": "1949-11-16",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Central Government order under section 8(2) dated November 19, 1949, directing proceedings under Income-tax Act and Excess Profits Tax Act against Kamini Kumar Dutta and appellant for aggregate income Rs. 58,24,023.",
      "type": "procedural",
      "date": "1949-11-19",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Central Government order under section 8A dated November 21, 1949, accepting settlement with Kamini Kumar Dutta's branch, directing demand notices and proceedings.",
      "type": "procedural",
      "date": "1949-11-21",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On March 24, 1950, Income-tax Officer passed 8 income-tax, 6 excess profits tax, 2 business profits tax assessment orders, each for 1/8 of total concealed sum; assessees both brothers.",
      "type": "procedural",
      "date": "1950-03-24",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Kamini Kumar Dutta's branch paying per composition terms, liability substantially discharged.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Appellant applied to Commissioner under section 8(5) on April 15, 1950, for reference to High Court of 15 questions (reduced to 3); submitted 16 applications for 16 orders; Commissioner rejected on October 3, 1951, no question of law.",
      "type": "procedural",
      "date": "1950-04-15",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Appellant applied to High Court under section 8(5) read with section 66(2) IT Act; rules issued but discharged on March 3, 1952.",
      "type": "procedural",
      "date": "1952-03-03",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Special leave against High Court order refused by Supreme Court on September 28, 1953.",
      "type": "procedural",
      "date": "1953-09-28",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Special leave granted against Commission's report dated November 16, 1949, and orders thereon.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the composition/settlement made with Kamini Kumar Dutta and his branch under section 8A of the Act discharges the tax liability of all legal representatives including the appellant, given the joint liability under section 24B(1) of the Income-tax Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the liability of legal representatives for tax on concealed income of the deceased is joint and indivisible such that settlement with one group extinguishes liability for others.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Effect of section 24B(1) of Income-tax Act is that liability of executors/legal representatives is same as deceased, tax is one and joint; composition with one legal representative (Kamini Kumar Dutta branch) discharges all heirs, no further liability on appellant or assets coming to him.",
      "supporting_facts": [
        "f5",
        "f7",
        "f9",
        "f11"
      ],
      "legal_basis": "Section 24B(1) Income-tax Act; Shaikh Sahad v. Krishna Mohan Basak; Kasi Kinkar Sen v. Satyendra Nath Bhadra; section 43 Contract Act; Salmonds Jurisprudence"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Composition under section 8A applies only to the person offering it (Kamini Kumar Dutta branch), closing investigation only as to them; appellant not party, liable for balance tax on assets in his possession.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "Sections 8(2), 8A(1) of the Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Cited cases have no application as no question of enforcing contractual liability; tax liability determined by provisions of the Act.",
      "addresses_issue": "i1",
      "key_observation": "No contractual liability enforcement; tax per Act."
    },
    {
      "id": "cr2",
      "text": "Under section 8(2), Central Government directed proceedings against heirs of deceased for Rs. 58,24,023; section 8A settlement only for applicant, closes investigation only for them.",
      "addresses_issue": "i2",
      "key_observation": "Settlement personal to offeror."
    },
    {
      "id": "cr3",
      "text": "Both brothers admitted liability; assessments divided total tax Rs. 52,34,663 into 8 parts; composition ends liability for that branch only; appellant liable for balance on assets possessed.",
      "addresses_issue": "i2",
      "key_observation": "Balance tax remains recoverable."
    },
    {
      "id": "cr4",
      "text": "Appeal incompetent unnecessary to decide as no substance.",
      "addresses_issue": "i1",
      "key_observation": "No merit."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Composition under section 8A operates only for the person offering it; does not discharge other legal representatives; appellant liable for unpaid tax on deceased's assets.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Provisions of sections 8(2) and 8A(1) of the Act govern; joint liability under IT Act does not override specific settlement provisions.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shaikh Sahad v. Krishna Mohan Basak",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Held heirs as one body for rent decree, not joint contract; inapplicable here."
    },
    {
      "case_name": "Kasi Kinkar Sen v. Satyendra Nath Bhadra",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Joint or several promise per intention; one heir not liable for entire rent; inapplicable."
    }
  ],
  "statutes_cited": [
    {
      "name": "Taxation on Income (Investigation Commission) Act, 1947",
      "sections": [
        "3",
        "5(4)",
        "8(2)",
        "8A(1)",
        "8(5)"
      ],
      "relevance": "Governs reference, reports, orders for proceedings, compositions settling cases for applicants only."
    },
    {
      "name": "Income-tax Act",
      "sections": [
        "24B(1)",
        "29",
        "66(2)"
      ],
      "relevance": "Legal representatives' liability same as deceased; demand notices; reference to High Court."
    },
    {
      "name": "Excess Profits Tax Act, 1940",
      "sections": [],
      "relevance": "Proceedings directed for assessment."
    },
    {
      "name": "Business Profits Tax Act",
      "sections": [],
      "relevance": "Assessment orders passed."
    },
    {
      "name": "Indian Contract Act",
      "sections": [
        "43"
      ],
      "relevance": "Cited but distinguished; inapplicable to tax liability."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against Commission's report and Central Government orders dismissed as without merit; composition with one branch does not discharge appellant's liability for balance tax on deceased's concealed income.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the settlement is with and in regard to the person who offers the settlement and the investigation is closed in regard to him alone.\"",
      "speaker": "court",
      "significance": "Core holding on scope of section 8A composition."
    },
    {
      "text": "\"the appellant will be liable for the payment of only the balance and to the extent that he has in his possession any of the assets of the deceased\"",
      "speaker": "court",
      "significance": "Defines appellant's remaining liability."
    },
    {
      "text": "\"these cases have no application to the facts of the present case, because no question of enforcing any contractual liability... arises here.\"",
      "speaker": "court",
      "significance": "Rejection of petitioner's precedents."
    }
  ],
  "_case_id": "1960_286",
  "_label": 0,
  "_text_length": 13534,
  "_extracted_at": "2026-02-10T19:55:18.503982"
}