{
  "metadata": {
    "case_name": "Department v. Respondent Firm",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent was a firm carrying on a business of purchasing and selling paper, stationery and other things and manufacturing books, exercise books, diaries etc. and for the purpose of its business it had a printing press.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The business was carried on and the press housed in a building belonging to its partners where the latter also resided.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "This building was requisitioned by the Government in September, 1943, for the duration of the war.",
      "type": "material",
      "date": "1943-09",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The respondent had thereupon to shift its business to another place where it was restarted sometime later.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The respondent claimed compensation for the requisition on various accounts and was paid various sums.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "One of the claims was made in these words: 'On account of the compulsory vacation of the premises disturbance and loss of business on the basis of two years at Rs. 2,29,450 per annum Rs. 4,58,900.'",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "On this head the Government paid Rs. 57,435.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The letter which accompanied and explained the respondents claim stated: 'If we take a fresh construction of our factory on temporary basis, this means time and therefore one of the biggest items in the Details of Claim has got to be included.'",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The letter further stated: 'As a result of the evacuation and in the absence of any premises we have been forced to warehouse our machines which are now idle and unproductive unless we are reinstated immediately in some temporary place and given electric connection and given the other facilities, we estimate that our business will suffer at least for a period of two years and we have gauged that item on that basis.'",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Another part of the respondents letter stated: 'When we think of our competitors in the open market who would go far ahead on account of our absence we feel we shall have a strong uphill struggle whilst re-establishing ourselves when we have reached the normal stage of business.'",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "The Tribunal found that it had not been proved that the respondent had actually suffered any loss and that the payment was on account of compulsory vacation of premises from such vacation a loss of profit might reasonably be presumed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether a certain sum received by the respondent was a capital receipt or a revenue receipt",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "whether this sum of Rs. 57,435 was liable to income-tax and excess profits tax",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The requisition did not cause any injury to any of the tangible capital assets of the respondents business.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "There was no claim for injury to any such goodwill. Goodwill is a question of fact, it may exist, it may not exist. Since it does not follow that every business has a goodwill, a loss to such goodwill has at least to be claimed and in the absence of such a claim it would follow that there was no such goodwill.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Hill v. Fearis"
    },
    {
      "id": "pa3",
      "text": "The claim was for loss of business computed at two years loss of profits, explained by compulsory vacation of premises causing disturbance and loss of business.",
      "supporting_facts": [
        "f6",
        "f8",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "There was injury to its profit making apparatus, namely loss to the goodwill, that is to say, the benefit that the respondents business derived from its connection with the building where it was carried on.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Van den Berghs Ltd. v. Clark"
    },
    {
      "id": "ra2",
      "text": "The claim for compulsory vacation of the premises was for the injury to the goodwill.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is clear that the requisition did not cause any injury to any of the tangible capital assets of the respondents business. Indeed, it is not contended that there was any injury to any of them.",
      "addresses_issue": "i1",
      "key_observation": "No injury to tangible capital assets."
    },
    {
      "id": "cr2",
      "text": "The words in which the claim was made: There is no mention of any loss to goodwill there. The claim for compulsory vacation of the premises was mentioned as explaining how the disturbance and loss of business had been occasioned.",
      "addresses_issue": "i1",
      "key_observation": "Claim framed for loss of profits, not goodwill."
    },
    {
      "id": "cr3",
      "text": "The letter accompanying the claim shows it was only claiming loss of profit for two years during which it did not expect to be able to restart its business. No hint of claim for loss of goodwill.",
      "addresses_issue": "i1",
      "key_observation": "Letter confirms claim for loss of profits due to stoppage."
    },
    {
      "id": "cr4",
      "text": "The Tribunal's observation that the payment is on account of the compulsory vacation of the premises does not show it thought the payment was on account of loss of goodwill, but because actual loss not proved, loss of profit presumed.",
      "addresses_issue": "i1",
      "key_observation": "Tribunal did not consider goodwill."
    },
    {
      "id": "cr5",
      "text": "The portion of the letter about competitors going ahead refers to stoppage of business, not loss of goodwill.",
      "addresses_issue": "i1",
      "key_observation": "No reference to goodwill in letter."
    },
    {
      "id": "cr6",
      "text": "The sum of Rs. 57,435 had not been received by the respondent for any injury to any of its capital assets. It was received as compensation for loss of profits for the period during which the respondents business would remain stopped before it could be re-started at a new premises.",
      "addresses_issue": "i1",
      "key_observation": "Payment is for loss of profits, hence revenue receipt."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The sum was clearly a revenue receipt and liable to income-tax and excess profits tax.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "As it was a trading receipt, it cannot be held exempt from tax under section 4(3)(vii) of the Income-tax Act.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Van den Berghs Ltd. v. Clark",
      "citation": null,
      "treatment": "referred",
      "relevance": "Example of profit making apparatus apart from tangible capital assets"
    },
    {
      "case_name": "Hill v. Fearis",
      "citation": null,
      "treatment": "followed",
      "relevance": "Goodwill is a question of fact, it may exist, it may not exist"
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "4(3)(vii)"
      ],
      "relevance": "Trading receipt cannot be held exempt from tax under this provision"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Court answered both the questions framed in the case in the negative, holding that the sum of Rs. 57,435 is a revenue receipt liable to income-tax and excess profits tax, in favour of the Department.",
    "relief_granted": "None specified; questions answered against respondent",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "If that injury was to the respondents capital assets then the receipt would be a capital receipt. If, on the other hand, the injury was to the respondents trading, then it would be a revenue receipt.",
      "speaker": "court",
      "significance": "Defines test for capital vs revenue receipt"
    },
    {
      "text": "It is perfectly plain that it was only claiming loss of profit for two years during which it did not expect to be able to restart its business.",
      "speaker": "court",
      "significance": "Interprets the claim and letter as for loss of profits only"
    },
    {
      "text": "In the result we answer both the questions framed in this case in the negative.",
      "speaker": "court",
      "significance": "Final determination against the respondent"
    }
  ],
  "_case_id": "1960_84",
  "_label": 1,
  "_text_length": 8814,
  "_extracted_at": "2026-02-10T19:52:33.737626"
}