{
  "metadata": {
    "case_name": "Successors of Sardar Nihal Singh v. Successors of Raja Durga Narain Singh",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA J."
    ],
    "case_number": "Civil Appeal No. 216 of 1954",
    "date_of_judgment": "1960-08-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On March 1, 1924, Sardar Nihal Singh, the predecessor of the appellant, borrowed a sum of rupees one lakh from Raja Durga Narain Singh, predecessor of the respondents, on mortgage of a house in Butlergunj, Lucknow and also the entire Zamindari interest in a village Parsera. Interest was 8 per cent. per annum compound with six monthly rests.",
      "type": "material",
      "date": "1924-03-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1932 Raja Durga Narain Singh brought a suit for recovery of Rs. 1,83,791-5-9 on account of principal and interest due on the mortgage, by sale of the mortgaged property.",
      "type": "procedural",
      "date": "1932",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Subordinate Judge, Lucknow, made a preliminary decree declaring the amount due to the plaintiff on the mortgage calculated up to March 29, 1932 to be Rs. 1,83,791-5-9 up to the date of the suit, Rs. 49,280-2-6 as the amount due on account of interest thereupon from March 19, 1932, the date of the suit to March 29, 1935, the date fixed for payment. A sum of Rs. 4,314-2-9 was awarded as the costs of the suit. The defendant was ordered to pay this total sum of Rs. 2,37,385-11-0 before the 29th day of March, 1935, with future interest at 6 per cent. per annum simple on the principal sum of rupees one lakh.",
      "type": "procedural",
      "date": "1935-03-29",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The amount not having been paid on that date, the Court on an application made by the mortgagee-decree-holder made a final decree on May 9, 1935, directing sale of the property for recovery of the sum of Rs. 2,37,503-5-6 with future interest as in the preliminary decree, this sum being the total of Rs. 2,37,305-11-0 of the preliminary decree, Rs. 116-10-1 the interest from March 30, 1935, and rupee one the costs of the final decree.",
      "type": "procedural",
      "date": "1935-05-09",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "An application for revision under s. 115 of the Code of Civil Procedure in connection with this decree was rejected by the Chief Court of Oudh on April 20, 1937.",
      "type": "procedural",
      "date": "1937-04-20",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "On October 26, 1936, an application had been made by Sardar Nihal Singh under s. 4 of the U. P. Encumbered Estates Act, requesting the provisions of the Act to be applied to him.",
      "type": "procedural",
      "date": "1936-10-26",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "After this application came before the Special Judge in accordance with the provisions of s. 6, the mortgagee-decreeholder Raja Durga Narain Singh filed a written statement of his claim on September 30, 1937, and stated that the amount due to him on the basis of his decree was Rs. 2,51,904-8-6 including Rs. 14,300 as interest subsequent to the final decree till September 30, 1937, and a sum of Rs. 51-3-0 the costs in his favour by the Oudh Chief Court when rejecting the mortgagors application for revision.",
      "type": "procedural",
      "date": "1937-09-30",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The applicant contested this claim pleading that the principal amount borrowed from the claimant being rupees one lakh the claimant was not entitled to recover any sum as interest thereupon in excess of the principal amount under s. 14 of the Encumbered Estates Act.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The Special Judge rejected the plea and held that the claimant was entitled to Rs. 2,37,503-5-6 for which the final decree was passed, and also Rs. 51-3-0 as costs in the matter of revision application and further to 6 per cent. per annum interest on rupees one lakh from May 29, 1935, the date of the final decree till the date of the application under the Encumbered Estates Act, i.e., October 26, 1936. Accordingly he gave the claimant a simple money decree for Rs. 2,46,338-8-6 with proportionate costs and future interest at the rate of 4 per cent. per annum simple from the date of application till realisation.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "On appeal, the Chief Court of Oudh rejected the appellants contention that the Special Judge was bound by s. 14 of the Act to limit the decree to a sum of rupees two lakhs only and held that in so far as the preliminary decree found Rs. 1,83,791-5-9 as the amount due on the mortgage on March 29, 1932, it was not inconsistent with s. 14 of the Encumbered Estates Act, and so the Special Judge was bound to accept this finding under s. 15. It held however that in so far as this decree allowed interest pendente lite on the above amount from March 19, 1932, to March 29, 1935, at 8% per annum, it was inconsistent with sub-s. (7) of s. 14. The Chief Court accordingly held that this interest pendente lite must be reduced to 4 1/4% simple. After saying that a sum of Rs. 4,314-2-9 would be added on account of costs, rupee one should be added on account of the costs of the final decree and Rs. 51-3-0 as costs of a revision application, the Court held that the principal amount of Rs. 1,00,000 shall carry interest from March 29, 1935, till the date of application under s. 4 of the Encumbered Estates Act, viz., October 26, 1936, and that the aggregate of these figures shall carry interest from October 27, 1936, till realisation at 4 per cent. per annum. It directed a decree for the sum thus found to be substituted for that passed by the Subordinate Judge.",
      "type": "procedural",
      "date": "1946-09-26",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appeal from the judgment and decree dated September 26, 1946, of the former Chief Court of Avadh at Lucknow, in First Appeal No. 7 of 1940.",
      "type": "procedural",
      "date": "1946-09-26",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "An application for leave to appeal to the Privy Council against this decree was made on January 13, 1947. This application was disposed of on April 14, 1953. Holding that the valuation of the suit was well over Rs. 20,000 and the value of the appeal to the Supreme Court was Rs. 41,971-2-9 the Chief Court gave, in view of the modification made by it in the lower courts decree, a certificate that the case fulfils the requirements of s. 110 of the Code of Civil Procedure and that the applicant had a right to appeal to the Supreme Court. On the strength of that certificate the present appeal was filed.",
      "type": "procedural",
      "date": "1953-04-14",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "When the appeal came up for hearing before a Bench of four judges of this Court Mr. Andley, on behalf of the respondents stated that in this case he was raising a constitutional point. Thereupon the Court directed that the matter be posted before the Constitution Bench.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in determining the amount due on the basis of a loan which has been the subject of a decree, the Special Judge under s.15 of the U.P. Encumbered Estates Act, 1934, must accept the findings of the Court which passed the decree except in so far as they are inconsistent with s.14, particularly s.14(4)(a) which limits interest due on the date of the application under s.4 to not exceeding the principal still due on that date.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The claimant was not entitled to recover any sum as interest thereupon in excess of the principal amount under s. 14 of the Encumbered Estates Act. The Special Judge was bound by s. 14 of the Act to limit the decree to a sum of rupees two lakhs only.",
      "supporting_facts": [
        "f1",
        "f8"
      ],
      "legal_basis": "Section 14 of the U. P. Encumbered Estates Act, 1934"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The amount due to him on the basis of his decree was Rs. 2,51,904-8-6. All that is necessary to save inconsistency with sub-s. 14(4)(a) is that the principle that the amount of interest shall not exceed the amount of the unpaid principal has been followed, in passing the decree and the fact that the result of the finding would be that on the date of the application u/s.4 of the Act the interest due would exceed the portion of the principal unpaid on such date is of no consequence.",
      "supporting_facts": [
        "f3",
        "f4",
        "f7"
      ],
      "legal_basis": "Section 15 of the U. P. Encumbered Estates Act, 1934"
    },
    {
      "id": "ra2",
      "text": "The Special Judge has merely to see whether the Civil Court that passed the decree could have passed the decree which it did pass if that court had had to apply the provisions of s. 14, treating the date of the institution of the suit as the date of the application.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 15 of the U. P. Encumbered Estates Act, 1934"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The requirement of sub-s. 4(a) of s. 14 is that the amount of interest held to be due on the date of the application shall not exceed that portion of the principal which may still be found to be due on the date of the application. The words 'on the date of the application' cannot be ignored. Where the consequence of the finding of the court which passed the decree is that the provisions of s. 14(4)(a) about the amount of interest due on the date of the application not exceeding the unpaid principal on that date are contravened, the finding should be held to be inconsistent with these provisions.",
      "addresses_issue": "i1",
      "key_observation": "The Special Judge is even where there has been a decree by a civil court in respect of a loan bound to follow the provisions of s. 14(4)(a) of the Act so that the amount of interest which he can hold to be due on the date of the application must not exceed the portion of the principal found to be due on the date of the application."
    },
    {
      "id": "cr2",
      "text": "The view in Pandit Ramsagar Prasad v. Mst. Shayama (A.I.R. 1939 Oudh 75) followed by the Chief Court is wrong. The Full Bench decision in Rukun-uddin v. Lachhmi Narain (I.L.R. 1945 All. 307) on inconsistency with U.P. Agriculturists Relief Act is correct as per s.14(4)(c).",
      "addresses_issue": "i1",
      "key_observation": "Special Judge must modify findings inconsistent with ss.4(a),5,6 of s.14, including treating date of application for interest limit."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Special Judge should have held the amount of interest due on the date of the application, i.e., October 26, 1936, to amount to rupees one lakh only, that being the principal which was still due on that date. The proper decree is one for rupees two lakhs for the loan with permissible interest, plus Rs. 4,314-2-9, Rs. 51-3-0 and rupee one on account of costs, that is, for a total sum of Rs. 2,04,366-5-9 with proportionate costs with interest pendente lite and future interest at the rate of 4 per cent per annum simple from the date of the application till realisation.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pandit Ramsagar Prasad v. Mst. Shayama",
      "citation": "A.I.R. 1939 Oudh 75",
      "treatment": "doubted",
      "relevance": "View that Special Judge checks inconsistency as if suit date is application date is wrong."
    },
    {
      "case_name": "Rukun-uddin v. Lachhmi Narain",
      "citation": "I.L.R. 1945 All. 307",
      "treatment": "followed",
      "relevance": "Finding on interest under U.P. Agriculturists Relief Act inconsistent with s.14(4)(c) and not binding on Special Judge."
    }
  ],
  "statutes_cited": [
    {
      "name": "United Provinces Encumbered Estates Act, 1934",
      "sections": [
        "Section 4",
        "Section 6",
        "Section 9",
        "Section 14",
        "Section 15",
        "Section 27"
      ],
      "relevance": "Core statute interpreted; s.15 requires acceptance of prior decree findings unless inconsistent with s.14, esp. s.14(4)(a) limiting interest to principal on application date; s.14(7) for decree terms."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 115",
        "Section 110"
      ],
      "relevance": "Revision application rejected; certificate for appeal granted."
    },
    {
      "name": "United Provinces Agriculturists Relief Act, 1934",
      "sections": [],
      "relevance": "Provisions not applicable under s.14(4)(c) of Encumbered Estates Act."
    },
    {
      "name": "Usurious Loans Act, 1918",
      "sections": [],
      "relevance": "Special Judge to apply if beneficial under s.14(4)(b)."
    },
    {
      "name": "U. P. Zamindars Debts Reduction Act, 1953",
      "sections": [
        "Section 4"
      ],
      "relevance": "Later amendment to s.15 not relevant."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, decrees of courts below set aside, substituted a simple money decree for Rs. 2,04,366-5-9 (Rs. 2 lakhs principal + interest + costs Rs. 4,314-2-9 + Rs. 51-3-0 + Re. 1) with proportionate costs, pendente lite and future interest at 4% p.a. simple from October 26, 1936 till realisation.",
    "relief_granted": "Simple money decree capping total at principal plus limited interest and costs, no sale of property.",
    "costs": "proportionate costs"
  },
  "key_quotes": [
    {
      "text": "\"In determining the amount due on the basis of a loan which has been the subject of a decree the Special Judge shall accept the findings of the Court which passed the decree except in so far as they are inconsistent with the provisions of s. 14.\"",
      "speaker": "court",
      "significance": "Key statutory provision interpreted."
    },
    {
      "text": "\"The requirement of sub-s. 4(a) of s. 14 is that the amount of interest held to be due on the date of the application shall not exceed that portion of the principal which may still be found to be due on the date of the application. The words 'on the date of the application' cannot be ignored.\"",
      "speaker": "court",
      "significance": "Crux of reasoning on s.14(4)(a) applicability despite prior decree."
    },
    {
      "text": "\"Our conclusion therefore is that the Special Judge is even where there has been a decree by a civil court in respect of a loan bound to follow the provisions of s. 14(4)(a) of the Act.\"",
      "speaker": "court",
      "significance": "Holding that prior decree does not override s.14(4)(a) benefit."
    }
  ],
  "_case_id": "1960_38",
  "_label": 1,
  "_text_length": 20074,
  "_extracted_at": "2026-02-10T19:51:57.159284"
}