{
  "metadata": {
    "case_name": "State of Bombay v. Ratilal Vadilal Bros.",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 429 of 1959",
    "date_of_judgment": "1960-11-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents, Ratilal Vadilal Bros., are commission agents doing business as clearing and transport contractors.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On June 25, 1954, respondents applied to the Collector of Sales Tax, Bombay, under ss. 27(a), (b) and (c) of the Bombay Sales Tax Act, 1953, describing their business and citing one instance, for determination whether they could be called dealers within the Act.",
      "type": "procedural",
      "date": "1954-06-25",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Collector of Sales Tax held by order that respondents were dealers and required to register under the Act.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "On appeal, Sales Tax Tribunal, Bombay, by order dated December 6, 1957, allowed the appeal and set aside the Collector's order, holding respondents were not dealers.",
      "type": "procedural",
      "date": "1957-12-06",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "After Colliery Control Order, 1945 came into force, no person could acquire or purchase coal from a colliery except under authority of Central Government via priority certificate from State Coal Controller.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Under Colliery Control Order, del credere agents were allowed to act and charge commission of one rupee per ton of coal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "One Nanalal Karsandas, a brick manufacturer, allotted priority certificate in respect of 22 tons of coal on June 17, 1954.",
      "type": "material",
      "date": "1954-06-17",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Karsandas dealt with M/s. S.C. Rungta Colliery, Burhar, through the respondents.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Consignment was in the name of Karsandas, but bill sent by Colliery to respondents.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Respondents made out bill to Karsandas, charging in addition to Colliery's bill amount, Rs. 22 as their commission.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Liability to pay Colliery rested upon respondents, but they claimed to act as mere middlemen between Colliery and Karsandas.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Respondents' business was along these lines with other constituents also.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Priority certificate made out in name of respondents but shows consumer as consignee.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "No sale by Colliery to respondents, but directly to Karsandas through agency of respondents.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "In bill to Karsandas, respondents mentioned he was consignee and they charged only middlemen's commission.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondents were carrying on the business of selling goods (coal) in the State of Bombay so as to be 'dealers' within the definition in the Bombay Sales Tax Act, 1953.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Respondents were dealers within the Act and required to register.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Bombay Sales Tax Act, 1953, definition of 'dealer'"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "They were mere middlemen or agents arranging sale between Colliery and disclosed purchaser Karsandas, guaranteeing payment as del credere agents, not carrying on business of selling coal.",
      "supporting_facts": [
        "f11",
        "f12",
        "f14",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under Colliery Control Order, no sale of coal could take place except to holder of priority certificate; sale otherwise in contravention.",
      "addresses_issue": "i1",
      "key_observation": "No sale by Colliery to respondents, but directly to Karsandas through their agency."
    },
    {
      "id": "cr2",
      "text": "Respondents never became owners by purchase from Colliery, as they could not buy without certificate.",
      "addresses_issue": "i1",
      "key_observation": "Position of respondents merely that of agents arranging sale to disclosed purchaser, guaranteeing payment."
    },
    {
      "id": "cr3",
      "text": "There were not two sales; only one sale by Colliery to consumer.",
      "addresses_issue": "i1",
      "key_observation": "No business of selling coal disclosed in instance cited."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Respondents not 'dealers' under Bombay Sales Tax Act, 1953, as they did not carry on business of selling goods.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bombay Sales Tax Act, 1953",
      "sections": [
        "s. 27(a), (b), (c)",
        "s. 34(1) read with ss. 30(1) and (2)",
        "definition of 'dealer'"
      ],
      "relevance": "Governs determination if respondents are dealers required to register; definition requires carrying on business of selling goods."
    },
    {
      "name": "Colliery Control Order, 1945",
      "sections": [],
      "relevance": "Regulated coal sales requiring priority certificates; no sale possible without; del credere agents permitted with commission."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Tribunal's order setting aside the Collector's decision, holding respondents not dealers under the Act on the facts presented.",
    "relief_granted": "Appeal dismissed; respondents not required to register as dealers.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'dealer means any person who carries on the business of selling goods in the State of Bombay, whether for commission, remuneration or otherwise'",
      "speaker": "court",
      "significance": "Definition central to determining if respondents are dealers."
    },
    {
      "text": "There were not two sales involved there was only one sale, and that was by the Colliery to the consumer.",
      "speaker": "court",
      "significance": "Key reasoning rejecting dual sales and classifying respondents as agents."
    },
    {
      "text": "The position of the respondents was merely that of agents, arranging the sale to a disclosed purchaser, though guaranteeing payment to the Colliery on behalf of their principal.",
      "speaker": "court",
      "significance": "Defines respondents' role, resolving they are not dealers."
    }
  ],
  "_case_id": "1960_305",
  "_label": 0,
  "_text_length": 5616,
  "_extracted_at": "2026-02-10T19:55:51.407463"
}