{
  "metadata": {
    "case_name": "Krishna Flour Mills v. Income-tax Authorities",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "M. Kasturi Ranga Setty (K. R. Setty) was a member of a joint Hindu family. On a partition between himself and his two brothers, two flour mills belonging to the family became his separate property from June 1, 1948. These were Krishna Flour Mills and Elgin Electric Flour Mills (in which K. R. Setty had only a lessee's interest).",
      "type": "background",
      "date": "1948-06-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "K. R. Setty was assessed under the Mysore Income-tax Act as karta of the joint Hindu family until the assessment year 1949-50, before the Indian Income-tax Act, 1922, was brought into force in Mysore on April 1, 1950.",
      "type": "background",
      "date": "1949-50",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Even before the disruption of the joint family, Venkataramana Setty (V. Setty), brother-in-law of K. R. Setty, was managing the business of the two mills. He was paid a salary of about Rs. 6,000 per annum, increased in the account year 1948-49 to Rs. 10,000 per annum. This salary was credited in his name in the accounts of the mills.",
      "type": "background",
      "date": "1948-49",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On November 16, 1949, a partnership deed was executed effective from July 1, 1949, between K. R. Setty, his wife Nagaratnamma, and V. Setty for Krishna Flour Mills. Partnership originally for five years, extended to March 31, 1955.",
      "type": "material",
      "date": "1949-11-16",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Nagaratnamma contributed Rs. 50,000 as her share of capital from her stridhanam money, credited to her account. V. Setty contributed Rs. 40,000 from amounts standing to his credit representing accumulated past salary.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Partners had equal shares in profits and losses; business conducted by K. R. Setty assisted by V. Setty. Firm registered with Registrar of Firms on November 23, 1949.",
      "type": "admitted",
      "date": "1949-11-23",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant applied under section 26A for registration for 1950-51 and 1951-52; rejected by ITO on March 18, 1954 as not genuine, confirmed in appeals.",
      "type": "procedural",
      "date": "1954-03-18",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Renewed applications for 1952-53, 1953-54, 1954-55 rejected by ITO on February 26, 1955, confirmed by AAC on June 30, 1955.",
      "type": "procedural",
      "date": "1955-02-26",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Tribunal dismissed appeals on March 24, 1956, finding firm not genuine.",
      "type": "procedural",
      "date": "1956-03-24",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Tribunal refused reference under section 66(1). High Court dismissed petitions under section 66(2) on October 8, 1958.",
      "type": "procedural",
      "date": "1958-10-08",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Tribunal found: (1) two new partners contributed capital as stated; (2) V. Setty's capital account showed accumulated profits of about 2 lakhs 1948-1954, withdrawals Rs.3,000/year in 1950-51, higher later; (3) 1950-51 withdrawals for household expenses as he lived with brother-in-law; (4) later withdrawals for similar plus house improvement purchased 1945; (5) no full details of spending; (6) Nagaratnamma withdrew no profits; (7) she was ordinary Hindu housewife.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "K. R. Setty corresponded with IT authorities as proprietor even after partnership commencement, but details not on record.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances found by the Tribunal, there was material to conclude that the partnership firm constituted by the deed dated November 16, 1949, was not genuine?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether a question of law arises out of the Tribunal's order that the firm is not genuine and not registerable under section 26A?",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No materials on which assessing authorities could draw inference that firm not genuine; finding based on suspicion, conjecture and surmises.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Section 66(2) of Indian Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "On facts found by Tribunal, apart from suspicion, no such inference reasonably follows; materials point one way, no person acting judicially could reach Tribunal's finding.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Question regarding which appellant moved High Court under section 66(2) is different from what is now canvassed; whether firm genuine is normally question of fact; adding 'right in law' does not make it question of law.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Grievance is that facts found do not reasonably lead to Tribunal's conclusion, based on suspicion and surmise.",
      "addresses_issue": "i2",
      "key_observation": "Tribunal listed facts but inference unreasonable; no conduct inter se indicating not genuine beyond family relation."
    },
    {
      "id": "cr2",
      "text": "Underlying assumption that partnership with wife and brother-in-law suspect, wife saves profits, brother-in-law does not spend fully, implies bogus; unreasonable, not justified by partnership law or common experience.",
      "addresses_issue": "i1",
      "key_observation": "Books not held false; contributions admitted; V. Setty managed business and lived with K.R. Setty."
    },
    {
      "id": "cr3",
      "text": "No finding that Rs.50,000 not Nagaratnamma's stridhan; Tribunal accepted contributions as stated.",
      "addresses_issue": "i1",
      "key_observation": "Correspondence not detailed on record."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A question of law arises: whether on facts and circumstances found, material to conclude partnership not genuine.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Tribunal's inference unreasonable and not justified.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "26A",
        "66(1)",
        "66(2)"
      ],
      "relevance": "Registration of firm; reference to High Court on question of law"
    },
    {
      "name": "Mysore Income-tax Act",
      "sections": [],
      "relevance": "Assessments prior to April 1, 1950"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; High Court order of October 8, 1958 set aside; Tribunal directed to state case on the question whether on facts found, material to conclude firm not genuine, and refer to High Court.",
    "relief_granted": "Direction for reference to High Court",
    "costs": "Appellant entitled to costs of High Court and Supreme Court; one set of costs."
  },
  "key_quotes": [
    {
      "text": "\"On the above facts, we do not find it difficult to reach a conclusion that the partnership claimed on the basis of the deed dated November 16, 1949, is not genuine and that the deed is a document not intended to be acted upon.\"",
      "speaker": "lower_court",
      "significance": "Tribunal's conclusion held unreasonable by Supreme Court"
    },
    {
      "text": "\"The actual conduct of the parties inter se is the essential point to bear in mind for this purpose.\"",
      "speaker": "lower_court",
      "significance": "Highlights lack of evidence on inter se conduct"
    },
    {
      "text": "\"On the materials placed before us, we consider that such an inference is unreasonable and not justified either by partnership law or common human experience.\"",
      "speaker": "court",
      "significance": "Court's key rejection of Tribunal's reasoning"
    }
  ],
  "_case_id": "1960_313",
  "_label": 1,
  "_text_length": 11438,
  "_extracted_at": "2026-02-10T19:55:56.644012"
}