{
  "metadata": {
    "case_name": "Lokmanya Mills v. Municipality of Barsi",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeals Nos. 125 to 129 of 1957",
    "date_of_judgment": "1961-03-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Lokmanya Mills (appellants) are a company registered under the Indian Companies Act holding land City Survey No. 2554 within the Municipal Borough of Barsi on which are constructed buildings of the factory, warehouses, bungalows and other structures appurtenant to the factory.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent is the Municipality of Barsi constituted under the Bombay Municipal Boroughs Act, 1925, entitled by s. 73 to levy a rate on lands and buildings and also a water-rate.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Under prior rules, house-tax and water-tax were levied on buildings and non-agricultural lands on their annual letting value at uniform rates whether for residential, business or manufacturing purposes.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1944, the Municipality resolved to enhance the assessment of lands and buildings; after correspondence with the Commissioner, resolved that rental value for levying rates on mills and factories be fixed at Rs. 40 for every 100 square feet.",
      "type": "material",
      "date": "1944",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Notices under s. 75(b) issued inviting objections; after obtaining approval of Government of Bombay, new rules operative from April 1, 1947.",
      "type": "procedural",
      "date": "1947-04-01",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Relevant rules: Rule 2A for assessment of house-tax on lands, buildings etc. at rates in Schedule; Rule 2B for Government buildings; Rule 2C for mills, factories and buildings relating thereto at Rs. 40 per 100 sq ft or part thereof for every floor, ground floor or cellar; Explanation includes warehouses etc. but not residential bungalows; Note: other buildings assessed at ordinary rate.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Municipality prepared assessment list under new scheme for factory buildings and related buildings, issued notices of demand for house-tax and water-tax.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Appellants paid tax under protest and filed five suits in Civil Judge, Junior Division, Barsi to recover excess over old scheme.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Principal issue in suits: validity of Rule 2C.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Trial court held Rule 2C valid and dismissed suits.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "District Court at Sholapur in appeal declared Rule 2C illegal and ultra vires, restrained Municipality by injunction.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Bombay High Court set aside District Court decree, held Rule 2C not ultra vires.",
      "type": "procedural",
      "date": "1952-10-07",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appeals to Supreme Court by special leave from Bombay High Court judgment.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether by Rule 2C the Municipality is entitled to collect tax leviable as a rate after computing the annual letting value solely on the area of the factory and buildings related thereto.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Rule 2C is invalid and ultra vires as it computes valuation on floor area, not on annual letting value or capital value as required by the Act.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": "Bombay Municipal Boroughs Act, 1925 ss. 73, 75, 78-84; definition of annual letting value in s. 3(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Rule 2C validly levies rate based on valuation in proportion to floor area; supported by precedents and sanctioned by Government.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Bombay Municipal Boroughs Act, 1925; The Madras and Southern Mahratta Railway Co. v. Bezwada Municipality; Borough Municipality of Amalner v. Pratap Spinning Weaving and Manufacturing Co."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 2C assesses rate on valuation computed on floor area, not on capital value or annual letting value which postulates rent a hypothetical tenant may reasonably pay; ignores recognised methods of valuation.",
      "addresses_issue": "i1",
      "key_observation": "Arbitrarily fixes annual letting value with no relation to actual rental; renders taxpayer's right to challenge valuation illusory as objections restricted to area not value."
    },
    {
      "id": "cr2",
      "text": "Madras Railway case inapplicable as it concerned recognised methods for open lands not covered by proviso; here method not recognised.",
      "addresses_issue": "i1",
      "key_observation": "Bezwada Municipality used capital value method permitted."
    },
    {
      "id": "cr3",
      "text": "Amalner case approach impermissible; no evidence factories alike or uniform rate fair; assumes uniformity of return per sq ft for dissimilar structures.",
      "addresses_issue": "i1",
      "key_observation": "Deprives statutory right to object to valuation."
    },
    {
      "id": "cr4",
      "text": "Motiram case: lump sum water-tax not a rate under s. 73.",
      "addresses_issue": "i1",
      "key_observation": "Supports that improper valuation invalidates levy."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rule 2C framed by Municipality under Bombay Municipal Boroughs Act, 1925 is ultra vires and invalid as it does not base valuation on capital or annual letting value but arbitrarily on floor area.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "The Madras and Southern Mahratta Railway Co., Ltd. v. The Bezwada Municipality",
      "citation": "I.L.R. 1945 Mad 1",
      "treatment": "distinguished",
      "relevance": "Rejected contention that only specific proviso methods allowed; permitted recognised methods for annual value on open lands, unlike arbitrary floor area here."
    },
    {
      "case_name": "The Borough Municipality of Amalner v. The Pratap Spinning Weaving and Manufacturing Co. Ltd., Amalner",
      "citation": "I.L.R. 1952 Bom. 918",
      "treatment": "disagreed",
      "relevance": "Upheld similar rules as not capricious; Court holds approach impermissible, no evidence of fairness or uniformity."
    },
    {
      "case_name": "Motiram Keshavdas v. Ahmedabad Municipal Borough",
      "citation": "1942 Bom. L.R. 280",
      "treatment": "referred",
      "relevance": "Lump sum water-tax not a rate under s. 73; supports invalidity of improper valuation methods."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Municipal Boroughs Act, 1925",
      "sections": [
        "s. 58",
        "s. 73",
        "s. 75",
        "s. 76",
        "s. 78",
        "s. 79",
        "s. 80",
        "s. 81",
        "s. 82",
        "s. 83",
        "s. 84",
        "s. 3(1)"
      ],
      "relevance": "Authorises rates on lands/buildings based on capital or annual letting value; prescribes procedure for assessment lists and objections; Rule 2C deviates by using floor area."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; decrees of Bombay High Court set aside; decrees of District Court of Sholapur restored with costs in this Court and High Court.",
    "relief_granted": "Restoration of District Court decree declaring Rule 2C ultra vires and injunction restraining Municipality from demands based on Rule 2C; refund of excess tax implied.",
    "costs": "Costs in this Court and the High Court."
  },
  "key_quotes": [
    {
      "text": "The Municipality ignored both the methods of valuation and adopted a method not sanctioned by the Act.",
      "speaker": "court",
      "significance": "Core holding on invalidity of floor area method."
    },
    {
      "text": "By prescribing valuation computed on the area of the factory building, the Municipality not only fixed arbitrarily the annual letting value which bore no relation to the rental which a tenant may reasonably pay, but rendered the statutory right of the tax-payer to challenge the valuation illusory.",
      "speaker": "court",
      "significance": "Explains vice of Rule 2C: arbitrariness and deprivation of objection rights."
    }
  ],
  "_case_id": "1961_416",
  "_label": 1,
  "_text_length": 13997,
  "_extracted_at": "2026-02-10T19:35:58.581063"
}