{
  "metadata": {
    "case_name": "Balaji v. Income Tax Authorities",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Petition No. 240 of 1960",
    "date_of_judgment": "1961-08-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The petitioner, Balaji, his six sons and his wife, by name Godawaribai, constituted a Joint Hindu family. The family was a trading family and it had, besides business in money lending, considerable agricultural lands.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On November 23, 1946, two of his sons became divided from the family.",
      "type": "material",
      "date": "1946-11-23",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In the year 1951, through the intervention of mediators the other members of the family were also divided and another major member started a separate business on his own.",
      "type": "material",
      "date": "1951",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Thereafter, the petitioner and his wife formed themselves into a partnership to carry on their business and admitted their three minor sons to the benefits thereof.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On September 22, 1952, a partnership deed was executed giving an equal share to each of the partners.",
      "type": "material",
      "date": "1952-09-22",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On the basis of the partnership deed, in respect of the assessment year 1952-53 the petitioner filed two applications before the Income-tax Officer, Wardha, one under s. 25-A of the Act for recognizing the partition, and the other under s. 26-A for registration of the firm. Both the applications were finally ordered by the Income-tax Appellate Tribunal, Bombay, by its order dated September 3, 1958, that is, the partition was recognized and the firm was granted registration.",
      "type": "procedural",
      "date": "1958-09-03",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "For the assessment years 1953-54 and 1954-55 also, the Income-tax Department registered the firm under s. 26-A of the Act. The assessment proceedings in respect of the said three years are pending before the concerned Income-tax authorities.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "For the assessment year 1955-56 also, the Income-tax Officer allowed the registration of the firm, but determined the total income of the petitioner at Rs. 2,44,625 as against the total income returned by him at Rs. 58,232.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The disparity arose because, while the assessee excluded from his total income the income of the partnership falling to the shares of his wife and three minor sons, the Income-tax Officer included the share income of his wife and three minor sons in the said business in the total income of the petitioner.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The petitioner, by the present petition, challenges the constitutional validity of s.16(3)(a)(i) and (ii) of the Act, and prays for a declaration that the said provisions are ultra vires the Constitution and for the issue of a writ of certiorari quashing the assessment order dated March 15, 1960, and for the issue of a writ of prohibition restraining the respondents from including the share income of his wife and minor children from the partnership firm in his total income and taxing the same in his hands.",
      "type": "procedural",
      "date": "1960-03-15",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appropriate Legislature had the competence to enact s. 16(3)(a)(i) and (ii) of the Indian Income-tax Act, 1922, under Entry 54 of the Federal Legislative List.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether s. 16(3)(a)(i) and (ii) violates the doctrine of equality before the law enshrined in Art. 14 of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether s. 16(3)(a)(i) and (ii) violates Art. 19(1)(f) and (g) of the Constitution.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Entry 54 in the Federal Legislative List did not confer on the Legislature any power to tax A on the income of B, therefore the sub-section was ultra vires the Legislature.",
      "supporting_facts": [],
      "legal_basis": "Entry 54, Government of India Act, 1935; Item 82, List I, Seventh Schedule, Constitution"
    },
    {
      "id": "pa2",
      "text": "The sub-section violates Art. 14 as there is no intelligible differentia with rational relation to the object; no reasonable basis to distinguish partnerships with wife/minors from others.",
      "supporting_facts": [],
      "legal_basis": "Art. 14, Constitution"
    },
    {
      "id": "pa3",
      "text": "The provision infringes Art. 19(1)(f) and (g) by depriving the husband of property (tax on wife's income) and imposing unreasonable restriction on right to carry on business, preventing pooling of family resources.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Art. 19(1)(f) and (g), Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The express terms of Entry 54 do not restrict legislative power to tax only the income of the person assessed; income can be taxed with incidence on another person, especially with intimate nexus between individual, wife, and minor sons.",
      "supporting_facts": [],
      "legal_basis": "Entry 54"
    },
    {
      "id": "ra2",
      "text": "Distinction between taxability and machinery of collection; sufficient nexus justifies incidence on father.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "The provisions constitute reasonable restrictions under Art. 19(1)(f) and (g) in the interest of general public to prevent tax evasion.",
      "supporting_facts": [],
      "legal_basis": "Art. 19(5), Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Leaves open the broad question of legislative competence but holds s.16(3)(a)(i) and (ii) is within competence as it prevents evasion of tax, citing Income-tax Enquiry Commission recommendations and device of taking wife/minors into partnership to lighten tax burden.",
      "addresses_issue": "i1",
      "key_observation": "Sub-section (3)(a)(i) and (ii) was enacted for preventing evasion of tax and was well within the competence of the Federal Legislature."
    },
    {
      "id": "cr2",
      "text": "Classification based on partnerships with wife/minors is reasonable under Art. 14 as it targets prevalent evasion device; no subclassification between genuine/non-genuine needed to avoid defeating purpose; distinguishes Hoeper case due to no partnership there and different social context in India.",
      "addresses_issue": "i2",
      "key_observation": "The Legislature selected for the purpose of classification only that group of persons who in fact are used as a cloak to perpetrate fraud on taxation."
    },
    {
      "id": "cr3",
      "text": "Tax laws must pass Art. 19 test if infringing fundamental rights; however, restrictions are reasonable as limited to prevent evasion, do not affect inter se rights, and offset by public benefit; applies test from V.G. Row case considering nature of right, purpose, urgency, etc.",
      "addresses_issue": "i3",
      "key_observation": "The provisions of s. 16(3) of the Act impose an unreasonable restriction on the fundamental rights of the petitioner under Art. 19(1)(f) and (g) of the Constitution."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S.16(3)(a)(i) and (ii) is within legislative competence as it prevents tax evasion.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "S.16(3)(a)(i) and (ii) does not violate Art. 14.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "S.16(3)(a)(i) and (ii) imposes reasonable restrictions under Art. 19(1)(f) and (g).",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "B. M. Amina Umma v. Income-tax Officer, Kozhikode",
      "citation": "1954 26 I.T.R. 137",
      "treatment": "followed",
      "relevance": "Answered competence question in favour of Department; sustained provision on reasonable classification."
    },
    {
      "case_name": "Sardar Baldev Singh v. Commissioner of Income Tax, Delhi and Ajmer",
      "citation": "1961 1 S.C.R. 482, 493",
      "treatment": "referred",
      "relevance": "Entry 54 authorises laws to prevent tax evasion; question left open."
    },
    {
      "case_name": "Albert A. Hoeper v. Tax Commissioner of Wisconsin",
      "citation": "1931 76 L. Ed. 248, 251",
      "treatment": "distinguished",
      "relevance": "Struck down adding wife's separate income to husband's; distinguished as no partnership and different context."
    },
    {
      "case_name": "Mohammad Yasin v. The Town Area Committee, Jalalabad",
      "citation": "1952 S.C.R. 572",
      "treatment": "followed",
      "relevance": "Licence fee bye-law infringing Art. 19(1)(g) invalid."
    },
    {
      "case_name": "Himmatlal Harilal Mehta v. The State of Madhya Pradesh",
      "citation": "1954 S.C.R. 1122",
      "treatment": "followed",
      "relevance": "Threat to realise ultra vires tax infringes Art. 19(1)(g)."
    },
    {
      "case_name": "Kavalappara Kottarathil Kochuni Moopil Nair v. State of Madras",
      "citation": "1960 3 S.C.R. 887, 911",
      "treatment": "followed",
      "relevance": "Law must satisfy legislative competence and not abridge fundamental rights."
    },
    {
      "case_name": "Kunnathat Thathunni Moopil Nair v. State of Kerala",
      "citation": "1961 3 S.C.R. 77",
      "treatment": "followed",
      "relevance": "Land tax Act void under Art. 14 and 19(1)(f)."
    },
    {
      "case_name": "State of Madras v. V. G. Row",
      "citation": "1952 S.C.R. 597",
      "treatment": "followed",
      "relevance": "Test of reasonableness of restrictions under Art. 19."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 16(3)(a)(i)",
        "Section 16(3)(a)(ii)",
        "Section 25A",
        "Section 26A"
      ],
      "relevance": "Inclusion of wife's/minor's partnership share in individual's income to prevent evasion; registration and partition recognition."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 14",
        "Article 19(1)(f)",
        "Article 19(1)(g)",
        "Article 265",
        "Article 13"
      ],
      "relevance": "Writ jurisdiction; equality; right to property/business; no tax without authority of valid law."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Entry 54, Federal Legislative List"
      ],
      "relevance": "Power to tax income other than agricultural; identical to Item 82, List I."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court rejected all contentions of the petitioner, upheld the constitutional validity of Section 16(3)(a)(i) and (ii) of the Indian Income-tax Act, 1922, as within legislative competence, not violating Articles 14 or 19(1)(f) and (g), and dismissed the writ petition.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Sub-section (3)(a)(i) and (ii) was therefore enacted for preventing evasion of tax and was well within the competence of the Federal Legislature.\"",
      "speaker": "court",
      "significance": "Holds provision intra vires on narrow ground of anti-evasion."
    },
    {
      "text": "\"The Legislature, therefore, selected for the purpose of classification only that group of persons who in fact are used as a cloak to perpetrate fraud on taxation.\"",
      "speaker": "court",
      "significance": "Justifies classification under Art. 14."
    },
    {
      "text": "\"We cannot say that the provisions of s. 16(3) of the Act impose an unreasonable restriction on the fundamental rights of the petitioner under Art. 19(1)(f) and (g) of the Constitution.\"",
      "speaker": "court",
      "significance": "Rejects Art. 19 challenge."
    }
  ],
  "_case_id": "1961_299",
  "_label": 0,
  "_text_length": 27306,
  "_extracted_at": "2026-02-10T19:34:11.434401"
}