{
  "metadata": {
    "case_name": "State of Bihar v. Karam Chand Thapar and Brothers Limited",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar, J."
    ],
    "case_number": "Civil Appeal No. 209 of 1959",
    "date_of_judgment": "1961-04-07"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant (State of Bihar) and respondents (Karam Chand Thapar and Brothers Limited, a company registered under Indian Companies Act) entered into three contracts for construction of aerodrome, hangars, buildings, stores and other works at Ranchi: Contract No. 21 of 1942 dated November 5, 1942; Contracts Nos. 6 and 8 dated April 5, 1943.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "After works completed, disputes arose over bills; referred to arbitration of Col. A. W. S. Smith by agreement dated February 6, 1948.",
      "type": "material",
      "date": "1948-02-06",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Arbitrator made award on June 4, 1948, sent copies to parties and court.",
      "type": "procedural",
      "date": "1948-06-04",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondents filed petition under ss. 17 and 20 of Arbitration Act, 1940 for decree in terms of award; appellant filed objections; registered as Title Suit No. 53 of 1951.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Arbitrator sent signed copy of award to Additional Subordinate Judge, Ranchi; notices under s. 14(2) issued; appellant applied to set aside award.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondents' petition under ss. 17/20 dismissed; proceedings continued as Title Suit No. 53/1951.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Additional Subordinate Judge, Ranchi passed decree in terms of award except part in excess of claim.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellant appealed to Patna High Court; High Court confirmed decree, granted certificate under Arts. 132 and 133 of Constitution.",
      "type": "procedural",
      "date": "1956-10-05",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Government notification dated April 1, 1937 under s. 175(3) GOI Act 1935 authorizing classes of officers to execute contracts on behalf of Governor of Bihar.",
      "type": "background",
      "date": "1937-04-01",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Correspondence: July 26, 1947 - Secretary (Mr. Murrel) to Col. Smith proposing appointment as arbitrator; Col. Smith agreed, suggested amending contract cl. 23.",
      "type": "background",
      "date": "1947-07-26",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "September 5, 1947 - Secretary to Col. Smith: opinion of Legal Remembrancer needed.",
      "type": "background",
      "date": "1947-09-05",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "January 19, 1948 - Col. Smith ready to act, again suggested amending contract.",
      "type": "background",
      "date": "1948-01-19",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "January 27, 1948 - Secretary to Col. Smith: Legal Remembrancer opined agreement per Arbitration Act; draft enclosed. Same date, Executive Engineer (K. Lall) to respondents to execute agreement.",
      "type": "background",
      "date": "1948-01-27",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Agreement executed February 6, 1948 by K. Lall (Executive Engineer, Ranchi Division) and respondents.",
      "type": "material",
      "date": "1948-02-06",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "February 25, 1948 - Secretary informed arbitrator of modifications in consultation with Government Pleader; directed Executive Engineer to make corrections and sign.",
      "type": "background",
      "date": "1948-02-25",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Copy to Government insufficiently stamped (not produced); copy to respondents seized by police (unavailable); court copy stamped and validated by respondents under s. 35 Stamp Act.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was a valid agreement of reference to arbitration binding on the Government under s. 175(3) of Government of India Act, 1935.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether a decree could be passed on the unstamped copy of the award filed in court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Agreement for reference to arbitration dated February 6, 1948 does not comply with s. 175(3) GOI Act 1935: not executed by person authorized by Governor per notification dated April 1, 1937 (falls under item 12, not item 2; Executive Engineer K. Lall not competent).",
      "supporting_facts": [
        "f9",
        "f14"
      ],
      "legal_basis": "Section 175(3) Government of India Act, 1935; Government notification April 1, 1937"
    },
    {
      "id": "pa2",
      "text": "Award is nullity without valid reference; no decree should be passed thereon.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Copy of award filed in court is unstamped 'certified copy'; cannot be validated under s. 35 Stamp Act (validation only for original); secondary evidence inadmissible.",
      "supporting_facts": [
        "f3",
        "f16"
      ],
      "legal_basis": "Section 35 Indian Stamp Act, 1899"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Agreement relates to execution of works (item 2 of notification) or Executive Engineer specifically authorized.",
      "supporting_facts": [
        "f9",
        "f14"
      ],
      "legal_basis": "Section 175(3) GOI Act 1935; notification"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Agreement expressed to be made by Governor of Bihar, formally executed by K. Lall and respondents; K. Lall authorized by Governor via Secretary's correspondence (from inception, Secretary acted on behalf of Government, directed execution). Even if misconception about notification item, specific ad hoc authorization suffices; s. 175(3) does not prescribe mode of conferment.",
      "addresses_issue": "i1",
      "key_observation": "Secretary directed Executive Engineer to execute; intention to treat as part of original contract."
    },
    {
      "id": "cr2",
      "text": "Arbitrator prepared award in triplicate, signed all, sent one each to parties and court: court copy is original instrument, not 'certified copy' (misdescription does not alter character); validated under s. 35 Stamp Act.",
      "addresses_issue": "i2",
      "key_observation": "Copy to parties are counterparts; not secondary evidence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Agreement dated February 6, 1948 executed by person authorized by Governor; valid reference to arbitration.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Court copy of award is original; properly validated; decree can be passed thereon.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rajah of Bobbili v. Inuganti China Sitaramasani Garu",
      "citation": null,
      "treatment": "followed",
      "relevance": "Copy of instrument cannot be validated under s. 35 Stamp Act if original not produced; but here court copy is original."
    }
  ],
  "statutes_cited": [
    {
      "name": "Arbitration Act, 1940",
      "sections": [
        "Sections 14(2)",
        "17",
        "20"
      ],
      "relevance": "Filing of award, petition for decree in terms of award."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Section 175(3)"
      ],
      "relevance": "Requirements for contracts by Governor: expressed by Governor, executed by authorized persons."
    },
    {
      "name": "Indian Stamp Act, 1899",
      "sections": [
        "Section 35"
      ],
      "relevance": "Validation of unstamped/insufficiently stamped documents produced in court."
    },
    {
      "name": "Indian Companies Act",
      "sections": [],
      "relevance": "Respondents registered as company."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Articles 132",
        "133"
      ],
      "relevance": "Certificate for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding Patna High Court and Subordinate Judge decrees in terms of arbitrator's award (except excess part disallowed below); held valid arbitration agreement and valid decree on filed award copy.",
    "relief_granted": "Decree in terms of award (as modified below)",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Under this section, a contract entered into by the Governor of a Province must satisfy three conditions. It must be expressed to be made by the Governor it must be executed and the execution should be by such persons and in such manner as the Governor might direct or authorise.\"",
      "speaker": "court",
      "significance": "Explains requirements of s. 175(3) GOI Act."
    },
    {
      "text": "\"Having carefully gone through the correspondence, we agree with the learned Judges of the High Court that the Executive Engineer had been authorised by the Governor acting through his Secretary to execute the agreement for reference to arbitration.\"",
      "speaker": "court",
      "significance": "Core holding on authorization."
    },
    {
      "text": "\"There cannot, in our opinion, be any doubt that it is the original and not a copy of the award. What the arbitrator did was to prepare the award in triplicate, sign all of them and send one each to the party and the third to the court.\"",
      "speaker": "court",
      "significance": "Distinguishes court copy as original for Stamp Act."
    }
  ],
  "_case_id": "1961_39",
  "_label": 0,
  "_text_length": 15615,
  "_extracted_at": "2026-02-10T19:29:40.625607"
}