{
  "metadata": {
    "case_name": "Appellants (Tenants) v. Respondent (Landlord)",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 49 of 1961",
    "date_of_judgment": "1961-04-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants executed a rent note on September 11, 1942, under which they were in occupation of the premises in dispute. The period of the tenancy was 15 years, and it expired by efflux of time on March 14, 1957.",
      "type": "background",
      "date": "1942-09-11",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Landlord filed a suit on April 25, 1957, for possession of the premises, in the Court of the Joint Civil Judge Junior Division, Erandol.",
      "type": "procedural",
      "date": "1957-04-25",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Under s. 6 of the Bombay Rents, Hotel and Lodging House Rates Control Act, 1947, a notification was issued applying Part II of the Act to the area where the property is situated, dated 16th August, 1958.",
      "type": "material",
      "date": "1958-08-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellants claimed protection of s. 12 in Part II of the Act, which deprived the landlord of the right of possession under certain circumstances.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Civil Judge framed three preliminary issues: (1) Whether this Court has jurisdiction to try the suit? (2) Whether the plaintiff's suit for possession is maintainable in view of the Notification issued by the Government of Bombay on 16th August, 1958, applying Part II of the Act? (3) If no, what order?. These issues were decided against the appellants.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellants filed a revision petition before the High Court of Bombay (Civil Revision Application No. 320 of 1959), which was dismissed by Naik, J. on August 11, 1960.",
      "type": "procedural",
      "date": "1960-08-11",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Under orders of this Court, the judgment of the Civil Judge was stayed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether by virtue of the first proviso to s. 50 of the Act, all the provisions of Part II including s. 12 were expressly made applicable to all suits and proceedings.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether by virtue of s. 12(1) of the Act, which applied independently by the extension of the Act to the area where the property is situate, the suit was rendered incompetent and the landlord deprived of his remedy of possession.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "By the latter part of the proviso to s. 50, all the provisions of Part II were extended to this area, and all pending suits and proceedings were governed, no matter when filed.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5"
      ],
      "legal_basis": "First proviso to s. 50 of Bombay Rents, Hotel and Lodging House Rates Control Act, 1947"
    },
    {
      "id": "pa2",
      "text": "The notification extending Part II of the Act to this area had the same effect independently of the first proviso to s. 50.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "s. 6 and Part II of Bombay Rents, Hotel and Lodging House Rates Control Act, 1947"
    },
    {
      "id": "pa3",
      "text": "s. 12(1) prohibits a landlord from recovering possession so long as the tenant pays or is ready and willing to pay the standard rent and permitted increases, if any, and observes other conditions of tenancy consistent with the Act; applies to present case.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": "s. 12(1) of Bombay Rents, Hotel and Lodging House Rates Control Act, 1947"
    },
    {
      "id": "pa4",
      "text": "If first proviso to s. 50 limited to suits pending on date of passing of Act, s. 12(1) on its own terms is applicable retrospectively.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s. 12(1) of Bombay Rents, Hotel and Lodging House Rates Control Act, 1947"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "s. 12 of the Act was prospective and did not apply to pending cases.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Nilkanth Ramachandra v. Rasiktal (1949) 51 Bom. L.R. 280; Chandrasingh Manibhai v. Surjit Lal Sadhamal Chhabda 1951 S.C.R. 221"
    },
    {
      "id": "ra2",
      "text": "Proviso to s. 50 should be read as qualifying only the substantive enactment, excepting out of the preceding portion; applies only to suits pending at time of repeal.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Craies on Statute Law; Mullins v. Treasurer of Surrey (1880) 5 Q.B.D. 170"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "First proviso to s. 50 is a saving clause dealing with effect of repeal; takes matter out of s. 7 Bombay General Clauses Act; need not decide its scope as second contention succeeds.",
      "addresses_issue": "i1",
      "key_observation": "Proviso saves pending suits and applies provisions of Act to them, but not necessary to resolve here."
    },
    {
      "id": "cr2",
      "text": "s. 12(1) enacts a rule of decision: landlord not entitled to possession if tenant pays or is ready to pay standard rent etc.; applies at time decree would be passed, thus to pending suits.",
      "addresses_issue": "i2",
      "key_observation": "Word 'tenant' includes statutory tenants continuing in possession; sub-s.(1) retrospective unlike sub-ss.(2),(3) which are prospective."
    },
    {
      "id": "cr3",
      "text": "Previous decisions (Nilkanth and Chandrasingh) concerned sub-ss.(2),(3) only, not sub-s.(1); a section may be prospective in parts and retrospective in others.",
      "addresses_issue": "i2",
      "key_observation": "Language of s.12(1) operates when decree passed, applies to pending and future suits."
    },
    {
      "id": "cr4",
      "text": "Tenants expressed readiness and willingness to pay, fulfil requirements of s.12(1); landlord not entitled to possession.",
      "addresses_issue": "i2",
      "key_observation": "Appellants as statutory tenants protected."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s. 12(1) applies to pending suits; no decree for possession can be passed if tenant complies with conditions.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Two preliminary issues answered in favour of appellants; decisions of High Court and Civil Judge erroneous and set aside.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Nilkanth Ramachandra v. Rasiktal",
      "citation": "(1949) 51 Bom. L.R. 280",
      "treatment": "distinguished",
      "relevance": "Full Bench held s.12 prospective; followed by High Court but distinguished as concerned sub-ss.(2),(3) not (1)"
    },
    {
      "case_name": "Chandrasingh Manibhai v. Surjit Lal Sadhamal Chhabda",
      "citation": "1951 S.C.R. 221",
      "treatment": "distinguished",
      "relevance": "Approved Full Bench view on s.12; but concerned sub-ss.(2),(3) not (1)"
    },
    {
      "case_name": "Rhondda Urban Council v. Taff Vale Railway",
      "citation": "1909 A.C. 253",
      "treatment": "referred",
      "relevance": "Proviso can be substantive enactment adding to prior sections"
    },
    {
      "case_name": "Mullins v. Treasurer of Surrey",
      "citation": "1880 5 Q.B.D. 170",
      "treatment": "referred",
      "relevance": "Proviso qualifies enacting part; natural presumption"
    },
    {
      "case_name": "Fitzgerald v. Champneys",
      "citation": "1861 2 J. H. 3170 E.R. 958",
      "treatment": "referred",
      "relevance": "Saving clauses not used to construe Acts; safeguard rights"
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Rents, Hotel and Lodging House Rates Control Act, 1947",
      "sections": [
        "s. 6",
        "s. 12(1)",
        "s. 12(2)",
        "s. 12(3)",
        "s. 11(3)",
        "s. 50 (first proviso)"
      ],
      "relevance": "Part II extended to area; s.12(1) protects tenant paying standard rent in pending suits; proviso transfers pending suits and applies Act provisions"
    },
    {
      "name": "Bombay Rent Restriction Act, 1939",
      "sections": [],
      "relevance": "Repealed by s.50 of 1947 Act"
    },
    {
      "name": "Bombay Rents, Hotel Rates and Lodging House Rates Control Act, 1944",
      "sections": [],
      "relevance": "Repealed by s.50 of 1947 Act"
    },
    {
      "name": "Bombay General Clauses Act",
      "sections": [
        "s. 7"
      ],
      "relevance": "Would apply to pending proceedings absent proviso to s.50"
    },
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [
        "s. 106"
      ],
      "relevance": "Manner of serving notice under s.12(2)"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; orders of Bombay High Court and Civil Judge set aside; two preliminary issues answered in favour of appellants; suit not to be decided in conformity with Supreme Court judgment (no possession to landlord).",
    "relief_granted": "Protection under s.12(1); suit cannot be decreed for possession.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A landlord shall not be entitled to the recovery of possession of any premises so long as the tenant pays, or is ready and willing to pay, the amount of the standard rent and permitted increases, if any, and observes and performs the other conditions of the tenancy...\"",
      "speaker": "court",
      "significance": "Core of s.12(1) protecting tenants; applies to pending suits"
    },
    {
      "text": "\"The point of time when the sub-section will operate is when the decree for recovery of possession would have to be passed.\"",
      "speaker": "court",
      "significance": "Explains retrospective effect of s.12(1) to pending suits"
    },
    {
      "text": "\"The contention of the respondent that the operation of s.12(1) is limited to suits filed after the Act comes into force in a particular area cannot be accepted.\"",
      "speaker": "court",
      "significance": "Rejects respondent's key argument; holds applicability to pre-extension suits"
    }
  ],
  "_case_id": "1961_195",
  "_label": 1,
  "_text_length": 18166,
  "_extracted_at": "2026-02-10T19:32:53.041612"
}