{
  "metadata": {
    "case_name": "Jagannath Agarwala v. State of Orissa",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeals Nos. 666 and 667 of 1957",
    "date_of_judgment": "1961-03-08"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In the year 1943 the Maharaja of Mayurbhanj entered into an agreement or arrangement with Jagannath Agarwala for establishing a business for the manufacture of industrial alcohol and essential oils and for purchases of wheat and barley in the Punjab.",
      "type": "background",
      "date": "1943",
      "source": "appellant"
    },
    {
      "id": "f2",
      "text": "Civil Appeal No. 666 of 1957 relates to the establishment of the manufacturing business: agreed that capital required would be contributed by the parties in equal shares, and that the profit and loss would also be shared equally.",
      "type": "material",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "As regards the purchases (Civil Appeal No. 667 of 1957), the appellant was to advance such money as might be required, and the State of Mayurbhanj was to provide necessary permits and facilities for transport.",
      "type": "material",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f4",
      "text": "In furtherance of this agreement, the appellant established a factory and started the business, but the Maharaja, instead of contributing his share of the capital, asked the appellant to do so on his behalf, promising to pay him the amount. The factory was constructed, went into production, but later closed down, suffering a total loss of Rs. 2,80,875-9-3. Claim against Maharaja and State: Rs. 1,40,400 odd.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "For purchases, the appellant advanced a sum of Rs. 50,000 and also incurred a further expenditure of Rs. 3,741-7-9. The State failed in its promise of procuring necessary permits and facilities for transport, appellant sold foodgrains in Punjab, incurred loss of Rs. 14,844-0-3. Maharaja promised to pay.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "From January 1, 1949, Mayurbhanj State merged with Province of Orissa. Government of Orissa promulgated Administration of Mayurbhanj State Order, 1949 under s. 4 of Extra Provincial Jurisdiction Act, 1947 (47 of 1947).",
      "type": "procedural",
      "date": "1949-01-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Clause 9 of the Order provided for notification calling pecuniary claims against State or Ruler in his capacity as Ruler, to be notified within 3 months; claims to be submitted with particulars and documents; officer to enquire and decide, confirmed by Administrator, final and not question-able in court; no court jurisdiction over such claims.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant preferred two claims to Claims Officer.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f9",
      "text": "Claims Officer report June 20, 1951 on first claim: entitled to Rs. 1,37,785-13-7-1/2 plus interest at 4% from 1-4-43 to 28-2-49 and thereafter till repayment.",
      "type": "admitted",
      "date": "1951-06-20",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Claims Officer report November 5, 1951 on second claim: substantiated Rs. 14,844-0-3 plus interest Rs. 5,303-14-0.",
      "type": "admitted",
      "date": "1951-11-05",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "June 28, 1952, Memorandum from Deputy Secretary, Board of Revenue, Orissa: claims rejected as barred by limitation.",
      "type": "procedural",
      "date": "1952-06-28",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Appellant applied for review; on November 8, 1952 asked to produce documents showing continuing businesses and law on limitation; Board declined review on April 2, 1953.",
      "type": "procedural",
      "date": "1952-11-08",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Even before merger, Revenue Minister, Mayurbhanj State rejected claim by order October 26, 1948: no formation of Joint Stock Company or written agreement.",
      "type": "procedural",
      "date": "1948-10-26",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Two petitions under Art. 226 filed; High Court of Orissa dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the rejection of the claims by the Board of Revenue without serving notice and affording a hearing to the appellant violated principles of natural justice.",
      "framed_by": "appellant"
    },
    {
      "id": "i2",
      "text": "Whether the act of State had come to an end, given the invitation for claims under the Order and the Claims Officer's recommendation in favour.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Decision of Claims Officer should have gone to Board of Revenue as a whole, not single Member; should have been served notice and given hearing before rejection of favourable report.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11",
        "f14"
      ],
      "legal_basis": "Principles of natural justice; Shivji Nathubai v. Union of India; New Prakash Transport Co. Ltd. v. New Suwarna Transport Co. Ltd.; Nagendra Nath Bora v. Commissioner of Hills Division; Gullapalli Nageswara Rao v. Andhra Pradesh State Road Transport Corporation"
    },
    {
      "id": "pa2",
      "text": "Act of State over when new Sovereign invited claims under law and Claims Officer admitted them; further consideration must comply with natural justice.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8",
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Within four corners of the Order, entitled to proper hearing; Board asked for documents on limitation but no viva voce hearing.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Clause 9 of Administration of Mayurbhanj State Order, 1949"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Rejection of claim was an act of State; new Sovereign cannot be compelled by municipal courts to accept liability of old Ruler; enquiry as State chose, no hearing compelled.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Dalmia Dadri Cement Co. Ltd. v. Commissioner of Income-tax; State of Saurashtra v. Memon Haji Ismail Haji; Vale Singh Ji Joravar Singh v. Secretary of State for India"
    },
    {
      "id": "ra2",
      "text": "Claims barred by limitation.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Act of State ceases only upon express or implied admission of claim by new Sovereign; municipal courts have no jurisdiction otherwise. Here, claims invited for investigation, not acceptance; Claims Officer not part of courts; no acceptance by Government.",
      "addresses_issue": "i2",
      "key_observation": "Enquiry for benefit of State, not conferring rights; Government could reject even favourable report."
    },
    {
      "id": "cr2",
      "text": "Appellant fully heard by Claims Officer; Board gave opportunity on limitation by asking documents/arguments; no compulsion for viva voce hearing under law.",
      "addresses_issue": "i1",
      "key_observation": "Not a trial or judicial enquiry; judging with rigour of civil suit inappropriate."
    },
    {
      "id": "cr3",
      "text": "Third Member competent; first point conceded.",
      "addresses_issue": "i1",
      "key_observation": "Appellant accepted High Court decision."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Act of State doctrine applies; no acceptance of claims, so rejection valid and not justiciable in municipal courts.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No violation of natural justice warranting writ; sufficient opportunity given.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shivji Nathubai v. Union of India",
      "citation": "1960 2 S.C.R. 775",
      "treatment": "referred",
      "relevance": "Cited by appellant on natural justice"
    },
    {
      "case_name": "New Prakash Transport Co. Ltd. v. New Suwarna Transport Co. Ltd.",
      "citation": "1957 S.C.R. 98",
      "treatment": "referred",
      "relevance": "Cited by appellant on natural justice"
    },
    {
      "case_name": "Nagendra Nath Bora v. Commissioner of Hills Division and Appeals, Assam",
      "citation": "1958 S.C.R. 1240",
      "treatment": "referred",
      "relevance": "Cited by appellant on natural justice"
    },
    {
      "case_name": "Gullapalli Nageswara Rao v. Andhra Pradesh State Road Transport Corporation",
      "citation": "1959 Supp. 1 S.C.R. 319",
      "treatment": "referred",
      "relevance": "Cited by appellant on natural justice"
    },
    {
      "case_name": "Dalmia Dadri Cement Co. Ltd. v. Commissioner of Income-tax",
      "citation": "1959 S.C.R. 729",
      "treatment": "followed",
      "relevance": "Act of State continues until admission of claim"
    },
    {
      "case_name": "State of Saurashtra v. Memon Haji Ismail Haji",
      "citation": "1960 1 S.C.R. 537",
      "treatment": "followed",
      "relevance": "Municipal courts no jurisdiction without admission"
    },
    {
      "case_name": "Vale Singh Ji Joravar Singh v. Secretary of State for India",
      "citation": "1924 L.R. 51 I.A. 357",
      "treatment": "followed",
      "relevance": "Rejection after enquiries still act of State; no plea needed"
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Petitions for writs of mandamus etc. dismissed"
    },
    {
      "name": "Extra Provincial Jurisdiction Act, 1947",
      "sections": [
        "Section 4"
      ],
      "relevance": "Promulgated Administration of Mayurbhanj State Order, 1949"
    },
    {
      "name": "Administration of Mayurbhanj State Order, 1949",
      "sections": [
        "Clause 9"
      ],
      "relevance": "Procedure for claims against State/Ruler; finality of Administrator's decision; no court jurisdiction"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals against the High Court of Orissa's dismissal of Art. 226 petitions fail. Act of State doctrine applies as no admission of claims; no violation of natural justice sufficient for writ.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "unless the new Sovereign, either expressly or impliedly admits the claim., the municipal courts have no jurisdiction in the matter.",
      "speaker": "court",
      "significance": "Core holding on act of State doctrine"
    },
    {
      "text": "To judge such an action with the same rigour with which a judicial enquiry or trial is judged is to convert the enquiry into a civil suit.",
      "speaker": "court",
      "significance": "Distinguishes enquiry from judicial proceeding; no strict natural justice required"
    },
    {
      "text": "the act of State could not be said to have come to an end, when the Government allowed claims to be preferred, or when their own Officer made his report.",
      "speaker": "court",
      "significance": "Clarifies when act of State ends"
    }
  ],
  "_case_id": "1961_244",
  "_label": 0,
  "_text_length": 15044,
  "_extracted_at": "2026-02-10T19:33:29.696209"
}