{
  "metadata": {
    "case_name": "Purshotam Lal Dhawan v. Diwan Chaman Lal",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Civil Appeal No. 754 of 1957",
    "date_of_judgment": "1961-03-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Purshotam Lal Dhawan belongs to Dhawan Group of evacuees who owned large extents of properties in West Pakistan and were allotted different extents of land in village Kharwan.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Diwan Chaman Lal, respondent No. 1, was a displaced person from West Pakistan who owned considerable properties and was allotted 152.9 acres of land in village Kharwan in Tehsil Jagadhri, District Ambala on September 1, 1949.",
      "type": "material",
      "date": "1949-09-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Before possession was taken by allottees, Hari Chand and Khilla Ram filed applications dated November 14, 1949, and November 11, 1949, for re-allotment on ground that soil was not of uniform quality and allotment on block basis not justified.",
      "type": "procedural",
      "date": "1949-11-11",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Additional Deputy Commissioner, Ambala, recommended splitting land into four blocks, accepted by Director-General, Rural Rehabilitation on December 2, 1949; village divided into four blocks and re-allotted.",
      "type": "procedural",
      "date": "1949-12-02",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Due to re-allotment, first respondent could not get entire allotment in one block in Kharwan and was given land in different blocks and villages.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "First respondent filed review application before Deputy Commissioner, Ambala on September 27, 1950, praying restoration of original allotment of September 1, 1949; rejected on May 12, 1951.",
      "type": "procedural",
      "date": "1950-09-27",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Against rejection, first respondent preferred revision to Additional Custodian, Rural, Jullundur, dismissed on August 25, 1952.",
      "type": "procedural",
      "date": "1952-08-25",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "First respondent filed revision to Custodian-General on October 10 (or 30), 1952; initially only Custodian made party, Dhawan Group impleaded by Deputy Custodian-General on August 25, 1953; notices issued.",
      "type": "procedural",
      "date": "1952-10-10",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Additional Deputy Custodian-General, by order dated September 29, 1954, cancelled allotment in favour of Dhawan Group in respect of excess area and directed land to be used for consolidation of first respondent's allotment in Kharwan.",
      "type": "procedural",
      "date": "1954-09-29",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Order of Additional Custodian communicated to first respondent on September 11, 1952.",
      "type": "procedural",
      "date": "1952-09-11",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Deputy Custodian-General observed Dhawan Group had no verified claim for excess area, failed to produce Parcha Claim copies; reports showed claims not traceable, no order of allotment forthcoming.",
      "type": "disputed",
      "date": "1952-08-07",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Factum of allotment to appellant was never questioned throughout proceedings.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the revision to the Deputy Custodian-General was barred by time insofar as the Dhawan Group was concerned.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Deputy Custodian-General had power to cancel the allotment made to the appellant on or before July 22, 1952.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Revision to Deputy Custodian-General barred by time against Dhawan Group as filed October 10/30, 1952 against Additional Custodian's order of August 25, 1952, communicated September 11, 1952; Dhawan Group impleaded October 1953 without excusing delay; Rule 31(5) prescribes 60 days ordinarily.",
      "supporting_facts": [
        "f7",
        "f8",
        "f10"
      ],
      "legal_basis": "Rule 31(5); Section 5 Limitation Act principle"
    },
    {
      "id": "pa2",
      "text": "Deputy Custodian-General had no power to cancel allotment made on December 2, 1949, as Rule 14(6) limits power for allotments on quasi-permanent basis except certain circumstances; applies to Custodian-General.",
      "supporting_facts": [
        "f4",
        "f9"
      ],
      "legal_basis": "Section 11; Rule 14(6)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No allotment made in favour of appellant, no scope for invoking Rule 14.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 27 confers plenary power on Custodian-General to call for records at any time, suo motu or on application; 'at any time' uncontrolled by time factor; Rule 31(5) 'ordinarily within 60 days' is rule of guidance, not limitation; discretion to entertain beyond 60 days reasonably exercised here.",
      "addresses_issue": "i1",
      "key_observation": "Revision filed in time initially; Dhawan Group impleaded later with opportunity to be heard per proviso to s.27; no perversity."
    },
    {
      "id": "cr2",
      "text": "Rule 14(6) bans Custodian from cancelling quasi-permanent rural allotments except specified cases, but proviso lifts ban for revisions under s.26/27 within prescribed time against orders on/before July 22, 1952; prescribed time per Rule 31(5) is 60 days ordinarily, entertainable in discretion; applies to Custodian-General.",
      "addresses_issue": "i2",
      "key_observation": "Allotment before July 22, 1952; power exists."
    },
    {
      "id": "cr3",
      "text": "Deputy Custodian-General's observations do not record clear finding of no allotment; factum never questioned; dispose on basis allotment existed.",
      "addresses_issue": "i2",
      "key_observation": "Allotment to appellant admitted."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Custodian-General's revisional power under s.27 uncontrolled by time limit; Rule 31(5) directory.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Custodian-General can cancel pre-July 22, 1952 allotments in revision under s.27 per proviso to Rule 14(6).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Administration of Evacuee Property Act",
      "sections": [
        "Section 11",
        "Section 27",
        "Section 56",
        "Section 26"
      ],
      "relevance": "Confers powers to cancel allotments (s.11), plenary revisional jurisdiction at any time (s.27), rule-making (s.56), lower custodian revision (s.26)"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against Deputy Custodian-General's order of September 29, 1954 setting aside lower orders and cancelling excess allotment to Dhawan Group for respondent's consolidation dismissed; both contentions overruled; no other points raised.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'The phrase at any time indicates that the power of the Custodian-General is uncontrolled by any time factor, but only by the scope of the Act within which he functions.'",
      "speaker": "court",
      "significance": "Interprets s.27 as having no time limit for revision"
    },
    {
      "text": "'The use of the word ordinarily indicates that the period of sixty days is not a period of limitation but only a rule of guidance for the petitioners as well as for the Custodian-General.'",
      "speaker": "court",
      "significance": "Clarifies Rule 31(5) as directory"
    }
  ],
  "_case_id": "1961_28",
  "_label": 0,
  "_text_length": 15974,
  "_extracted_at": "2026-02-10T19:29:36.687295"
}