{
  "metadata": {
    "case_name": null,
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "SARKAR, J."
    ],
    "case_number": "Criminal Appeal No. 129 of 1960",
    "date_of_judgment": "1961-04-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant who had earlier left India, returned on a passport granted by the Government of Pakistan on May 16, 1953.",
      "type": "background",
      "date": "1953-05-16",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "He had a visa endorsed on his passport by the Indian authorities permitting him to stay in India for three months and this permission was later extended upto November 15, 1953.",
      "type": "material",
      "date": "1953-11-15",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "He did not return to Pakistan within that date.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Convicted under s. 14 of the Foreigners Act, 1946, by a Sub-Divisional Magistrate on March 14, 1959, and sentenced to rigorous imprisonment for one year.",
      "type": "procedural",
      "date": "1959-03-14",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "His appeal to a Sessions Judge was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The High Court at Allahabad, on being moved in revision (Criminal Revision No. 697 of 1959), refused to interfere with the order of the Sessions Judge by judgment and order dated March 9, 1960.",
      "type": "procedural",
      "date": "1960-03-09",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The appellant had been convicted for breach of paragraph 7 of the Foreigners Order of 1948, issued under s. 3 of the Foreigners Act.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Paragraph 7 requires that every foreigner entering India on the authority of a visa issued in pursuance of the Indian Passport Act, 1920, shall obtain from the appropriate authority a permit indicating the period during which he is authorised to remain in India and shall, unless that period is extended, depart from India before its expiry.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The appellant was born at Allahabad at a time when it was within His Britannic Majesty's Dominion.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant could be convicted of a breach of paragraph 7 of the Foreigners Order, 1948, as it applies to a foreigner entering India on the authority of a visa issued in pursuance of the Indian Passport Act, 1920, meaning a person who was a foreigner on the date of his entry into India.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the appellant was a foreigner on the date of his entry into India in 1953, based on the definition in s. 2(a) of the Foreigners Act, 1946, as he was a natural-born British subject under s. 1(1)(a) of the British Nationality and Status of Aliens Act, 1914.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Paragraph 7 of the Foreigners Order applies to a foreigner entering India on the authority of a visa issued in pursuance of the Indian Passport Act and overstaying the period for which he is permitted to stay in India. The foreigner contemplated in this paragraph is a person who was a foreigner on the date of his entry into India.",
      "supporting_facts": [
        "f1",
        "f2",
        "f7",
        "f8"
      ],
      "legal_basis": "Paragraph 7 of the Foreigners Order, 1948"
    },
    {
      "id": "pa2",
      "text": "The appellant was not a foreigner on the date of entry because he came within cl. (1) of the definition of foreigner in s. 2(a) of the Foreigners Act, 1946, as he was a natural-born British subject within s. 1(1)(a) of the British Nationality and Status of Aliens Act, 1914.",
      "supporting_facts": [
        "f1",
        "f9"
      ],
      "legal_basis": "s. 2(a) Foreigners Act, 1946 (as in 1953); s. 1(1)(a) British Nationality and Status of Aliens Act, 1914"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The appellant overstayed the visa period till November 15, 1953, hence prosecution under paragraph 7 of the Foreigners Order.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Paragraph 7 Foreigners Order, 1948; s. 14 Foreigners Act, 1946"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The contention of the appellant is plainly correct. The paragraph contemplates a foreigner entering India, and therefore, a person who at the date of the entry was a foreigner. The word 'foreigner' in paragraph 7 has the same meaning as that word has in the Foreigners Act.",
      "addresses_issue": "i1",
      "key_observation": "Paragraph 7 contemplates a foreigner at the date of entry."
    },
    {
      "id": "cr2",
      "text": "The definition of 'foreigner' in s. 2(a) of the Foreigners Act as it stood in 1953 excludes natural-born British subjects as defined in s. 1(1)(a) of the British Nationality and Status of Aliens Act, 1914. The appellant was born at Allahabad within His Majesty's Dominion, so he was a natural-born British subject and not a foreigner at entry.",
      "addresses_issue": "i2",
      "key_observation": "Appellant was not a foreigner in 1953."
    },
    {
      "id": "cr3",
      "text": "He could not have committed a breach of paragraph 7 of the Foreigners Order.",
      "addresses_issue": "i1",
      "key_observation": "No breach as not a foreigner."
    },
    {
      "id": "cr4",
      "text": "The definition of foreigner was amended with effect from January 19, 1957, by Act 11 of 1957 to mean a person who is not a citizen of India, but no observation on its effect on appellant's status post-1953.",
      "addresses_issue": "i2",
      "key_observation": "Case only concerns 1953 status."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "On the date of his entry into India the appellant was a natural-born British subject and, therefore, not a foreigner. He could not have committed a breach of paragraph 7 of the Foreigners Order.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No question as to the effect of the amended definition of foreigner (post-1957) on the appellant's status falls for decision.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Foreigners Act, 1946",
      "sections": [
        "s. 14",
        "s. 2(a)",
        "s. 3(2)(e)"
      ],
      "relevance": "Conviction under s.14 for breach of Order under s.3; definition of foreigner as in 1953 excludes natural-born British subjects; power to order foreigner not to remain in India"
    },
    {
      "name": "Foreigners Order, 1948",
      "sections": [
        "paragraph 7"
      ],
      "relevance": "Requires foreigner entering on visa to obtain permit and depart before expiry unless extended; breach alleged"
    },
    {
      "name": "Indian Passport Act, 1920",
      "sections": [],
      "relevance": "Visa issued in pursuance thereof triggers para 7"
    },
    {
      "name": "British Nationality and Status of Aliens Act, 1914",
      "sections": [
        "s. 1(1)(a)"
      ],
      "relevance": "Defines natural-born British subjects as persons born within His Majesty's Dominion and allegiance"
    },
    {
      "name": "Act 11 of 1957",
      "sections": [],
      "relevance": "Amended definition of foreigner w.e.f. January 19, 1957, to mean person not citizen of India"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed and the conviction of the appellant and sentence passed on him are set aside.",
    "relief_granted": "Conviction and sentence set aside",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The contention of the appellant is plainly correct. The paragraph contemplates a foreigner entering India, and therefore, a person who at the date of the entry was a foreigner.",
      "speaker": "court",
      "significance": "Core reasoning upholding appellant's contention on applicability of para 7"
    },
    {
      "text": "That the appellant was born at Allahabad at a time when it was within his Britannic Majesty’s Dominion is not in dispute. That being so, we think that it must be held that ... the appellant was a natural-born British subject and, therefore, not a foreigner.",
      "speaker": "court",
      "significance": "Determines appellant's status at entry, leading to acquittal"
    },
    {
      "text": "We wish to make it clear that we have said nothing as to the effect of the amended definition of a foreigner on the status of the appellant.",
      "speaker": "court",
      "significance": "Limits scope of judgment to 1953 status only"
    }
  ],
  "_case_id": "1961_203",
  "_label": 1,
  "_text_length": 4952,
  "_extracted_at": "2026-02-10T19:32:37.988597"
}