{
  "metadata": {
    "case_name": "Appellant (purchaser, brother-in-law of Nanappa Naicker) v. Smt. Engammal",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "S. V. N. Nanappa Naicker and his sons were adjudged insolvents on an application of Smt. Engammal (respondent).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Insolvents preferred appeal to High Court of Madras, dismissed on April 17, 1953.",
      "type": "procedural",
      "date": "1953-04-17",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Official receiver took steps to sell insolvents' property: lot 1 - 145 acres 10 cents dry land and masonry house; lot 2 - 8 acres and odd dry land. Both subject to mortgage with encumbrance of Rs. 17,200/-.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Official receiver fixed September 28, 1953, for auction sale. Fifteen creditors present including son of respondent. No request for postponement. Highest bid lot 1: Rs. 4500/- by appellant (brother-in-law of Nanappa Naicker); lot 2: Rs. 70/- by appellant. Total Rs. 4570/-.",
      "type": "procedural",
      "date": "1953-09-28",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Official receiver did not close sale on Sept 28, hoping higher offers, postponed to various dates up to October 26, 1953. Respondent's son present on all dates, no higher offer from respondent.",
      "type": "procedural",
      "date": "1953-09-28 to 1953-10-26",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On October 26, 1953, application by respondent to postpone sale for three months due to drought and low prices for agricultural lands.",
      "type": "procedural",
      "date": "1953-10-26",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Official receiver refused postponement as no higher offer from respondent, knocked down properties to appellant.",
      "type": "procedural",
      "date": "1953-10-26",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On November 18, 1953, respondent applied under s. 68 Provincial Insolvency Act to set aside sale: inadequate price due to drought, stringency in money market; hoped Rs. 15,000/- excl. encumbrances if postponed 3-4 months; offered Rs. 7500/-+ if postponed; alleged collusion between official receiver, insolvent, appellant.",
      "type": "procedural",
      "date": "1953-11-18",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Debts due to creditors: Rs. 30,000/-.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Application opposed by official receiver (best efforts, no higher bid, denied collusion/irregularity) and appellant.",
      "type": "procedural",
      "date": null,
      "source": "official_receiver"
    },
    {
      "id": "f11",
      "text": "Subordinate Judge allowed application under s.68: price low, prejudices general body of creditors.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appeal to District Judge under s.75: allowed, set aside Subordinate Judge. No irregularity/collusion; respondent's son present, could have bid higher; price not low (criticized Sub Judge's valuation based on mortgage double, insolvent's Rs.80,000 valuation exaggerated; no proper valuation method used).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Revision to High Court under proviso to s.75. Respondent offered Rs.9,000/- deposit, start bid at Rs.9,000/-, pay Rs.1,000/- to appellant for loss if fresh auction.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "High Court allowed revision on respondent's terms: price not unconscionably low but low considering extent/nature; Rs.9,000/-+ better for creditors. Did not consider if District Judge's order according to law.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f15",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Insolvents valued properties at Rs.80,000/- (exaggerated); mortgaged for over Rs.20,000/- in 1936; deposited Rs.2,000/- annually to High Court to retain possession during appeal.",
      "type": "background",
      "date": "1936",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court had jurisdiction under proviso to s.75 to interfere with District Judge's order without concluding that it was not according to law.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Scope of court's power under s.68 to interfere with official receiver's sale under s.59A: grounds like fraud, collusion, irregularity, or grossly inadequate price.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court had no jurisdiction to interfere unless District Judge's order not according to law; High Court did not apply mind to this, swayed by respondent's offer 3 years later (prices may have risen).",
      "supporting_facts": [
        "f14",
        "f13"
      ],
      "legal_basis": "Proviso to s.75 Provincial Insolvency Act"
    },
    {
      "id": "pa2",
      "text": "No irregularity, collusion, or inadequate price justified setting aside sale.",
      "supporting_facts": [
        "f4",
        "f5",
        "f7",
        "f12"
      ],
      "legal_basis": "s.68 Provincial Insolvency Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Court's power under s.68 wider than in execution sales; Subordinate Judge right to set aside, High Court right to restore.",
      "supporting_facts": [
        "f8",
        "f11"
      ],
      "legal_basis": "s.68 Provincial Insolvency Act"
    },
    {
      "id": "ra2",
      "text": "Even if High Court did not expressly consider, SC should uphold if price was low in 1953 circumstances.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Power under s.68 judicial, exercised on principles: prioritize creditors, then insolvent, then purchaser; interfere only on good grounds (fraud/collusion, irregularity affecting price, grossly inadequate price). Wider than execution but not arbitrary.",
      "addresses_issue": "i2",
      "key_observation": "No fraud/collusion/irregularity found by lower courts; only ground was low price, but not justified."
    },
    {
      "id": "cr2",
      "text": "Subordinate Judge's low price finding flawed: no proper valuation (relied on exaggerated Rs.80,000, doubling 1936 mortgage); ignored encumbrance details; no recognized valuation method. District Judge correctly reversed.",
      "addresses_issue": "i1",
      "key_observation": "District Judge's order according to law."
    },
    {
      "id": "cr3",
      "text": "High Court did not address if District Judge's order according to law; impressed by 3-year later offer (prices may risen); lacked jurisdiction to interfere.",
      "addresses_issue": "i1",
      "key_observation": "No sufficient material to find appellant's price low in 1953."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court jurisdiction under proviso s.75 arises only if District Judge's order not according to law; here it was according to law, so no interference.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No grounds under s.68 to set aside receiver's sale: no fraud/collusion/irregularity/grossly inadequate price proven.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Provincial Insolvency Act, No. V of 1920",
      "sections": [
        "s. 59A",
        "s. 68",
        "s. 75"
      ],
      "relevance": "s.59A empowers receiver to sell; s.68 allows court control over receiver's acts (wider grounds for interference); proviso s.75 limits High Court revision to orders not according to law."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by special leave, set aside High Court's order, restored District Judge's order upholding the sale to appellant.",
    "relief_granted": "Sale to appellant confirmed; High Court's direction for fresh auction set aside.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the power under s. 68 is a judicial power and must be exercised on well recognised principles, justifying interference with an act of the receiver\"",
      "speaker": "court",
      "significance": "Defines scope of s.68: not arbitrary, requires good judicial grounds."
    },
    {
      "text": "\"there must be judicial grounds on which the court will act in setting aside the sale decided upon by the official receiver... fraud or collusion... irregularities... price fetched may still be so low\"",
      "speaker": "court",
      "significance": "Lists specific grounds for interfering with receiver's sale."
    },
    {
      "text": "\"the High Court would have no jurisdiction to interfere with that order\" (if District Judge's order according to law)",
      "speaker": "court",
      "significance": "Core holding on High Court's limited revisional jurisdiction under s.75 proviso."
    }
  ],
  "_case_id": "1961_423",
  "_label": 1,
  "_text_length": 16535,
  "_extracted_at": "2026-02-10T19:36:08.594401"
}