{
  "metadata": {
    "case_name": "Corporation of Calcutta v. Owners of Premises No. 296, Bowbazzar Street",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Civil Appeal No. 268 of 1958",
    "date_of_judgment": "1961-08-08"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents are the owners of premises No. 296, Bowbazzar Street, Calcutta.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Corporation of Calcutta fixed the annual valuation of the premises at Rs. 14,093, to take effect from the second quarter of 1950-51, based on Rs. 1,450 as the monthly rental value.",
      "type": "material",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Notice of the assessment based on the said annual valuation was served on the respondents on June 20, 1950.",
      "type": "procedural",
      "date": "1950-06-20",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent No. 1 filed objections to the assessment under s. 139 of the Calcutta Municipal Act, 1923.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Under the West Bengal Premises Rent Control Temporary Provisions Act, 1950 (W.B. XVII of 1950), the standard rent of the premises was fixed by the Rent Controller at Rs. 550 per month with effect from April 1951, and at Rs. 632-8-0 per month with effect from August 1951.",
      "type": "material",
      "date": "1951-04-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "One of the objections raised was that the Corporation had no power to fix the annual valuation at a figure higher than the standard rent.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "The Special Officer disallowed all objections and confirmed the assessment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Respondent No. 1 appealed to the Court of Small Causes, Calcutta, where the learned Small Causes Judge allowed the appeal and fixed the annual valuation at Rs. 6,831 based on the standard rent of Rs. 632-8-0 per month.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Corporation of Calcutta appealed to the Calcutta High Court, which by majority agreed with the Small Causes Judge and dismissed the appeal.",
      "type": "procedural",
      "date": "1956-06-15",
      "source": "high_court"
    },
    {
      "id": "f10",
      "text": "Appeal to Supreme Court by certificate from the order of the High Court at Calcutta.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "True interpretation of s. 127A of the Calcutta Municipal Act, 1923, particularly whether the Corporation is bound to take into consideration the standard rent fixed under the Rent Control Act in fixing annual valuation.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Precise meaning of the phrase 'at the time of assessment' occurring in s. 127A of the Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under s. 127A of the Act the Corporation has to ascertain only the hypothetical rent realisable from a hypothetical tenant at the time of assessment and not the actual rent payable at that time by any tenant, and therefore it is not bound to take into consideration the standard rent fixed under the Rent Control Act.",
      "supporting_facts": [
        "f2",
        "f7"
      ],
      "legal_basis": "s. 127A, Calcutta Municipal Act, 1923; Poplar Assessment Committee v. Roberts (1922)"
    },
    {
      "id": "pa2",
      "text": "Subsidiary point as to the precise meaning of the phrase 'at the time of assessment' occurring in s. 127A of the Act.",
      "supporting_facts": [],
      "legal_basis": "s. 127A, Calcutta Municipal Act, 1923"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Corporation had no power to fix the annual valuation at a figure higher than the standard rent fixed under the Rent Control Act.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "West Bengal Premises Rent Control Temporary Provisions Act, 1950; s. 127A, Calcutta Municipal Act, 1923"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The criterion under s. 127A is the rent realisable by the landlord from a hypothetical tenant, which is the value of the property to the owner, not the value in the hands of the tenant.",
      "addresses_issue": "i1",
      "key_observation": "Gross annual rent at which the land or building might at the time of assessment reasonably be expected to let from year to year."
    },
    {
      "id": "cr2",
      "text": "A landlord cannot reasonably be expected to let a building for a rent higher than the standard rent under the Rent Control Act, as receipt of higher rent is penal and irrecoverable.",
      "addresses_issue": "i1",
      "key_observation": "Law of the land with penal consequences places an upper limit on reasonable rent expectations."
    },
    {
      "id": "cr3",
      "text": "Distinction from English law: Under Indian Act, letting value to landlord is standard; hypothetical rent cannot exceed statutory limit as open market excludes black market.",
      "addresses_issue": "i1",
      "key_observation": "Poplar case distinguished due to differences in rating principles and penal nature of Indian Rent Control Act."
    },
    {
      "id": "cr4",
      "text": "Agrees with High Court majority that 'at the time of assessment' commences with valuation under B. 131 and ends with determination of objection under s. 140.",
      "addresses_issue": "i2",
      "key_observation": "Event during this period may be relied upon."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rental value cannot be fixed higher than the standard rent under the Rent Control Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "'At the time of assessment' means the period from making of valuation under B. 131 to determination of objection under s. 140.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bengal Nagpur Railway Company Limited v. Corporation of Calcutta",
      "citation": "1946 L.R. 74 I.A. 1",
      "treatment": "followed",
      "relevance": "Emphasized rent realisable by landlord, not value to tenant; rejected hypothetical tenancy precluding occupation."
    },
    {
      "case_name": "Secretary of State v. Madras Municipality",
      "citation": "1886 I.L.R. 10 Mad. 38",
      "treatment": "followed",
      "relevance": "Value of property to owner measured by rent worth to hypothetical tenant."
    },
    {
      "case_name": "Corporation of Calcutta v. Ashutosh De",
      "citation": "1927 31 C.W.N. 864",
      "treatment": "followed",
      "relevance": "Accepted principle of value to owner in construing s. 127A."
    },
    {
      "case_name": "Poplar Assessment Committee v. Roberts",
      "citation": "1922 2 A.C. 93",
      "treatment": "distinguished",
      "relevance": "Distinguished due to differences in English rating law (occupation value) vs. Indian letting value to owner; penal nature of Indian rent control."
    },
    {
      "case_name": "Mongharam Jiwandas v. Municipal Corporation of the City of Bombay",
      "citation": "I.L.R. 1951 Bom. 713",
      "treatment": "distinguished",
      "relevance": "Followed Poplar but rejected as not appreciating distinction between English and Indian law."
    },
    {
      "case_name": "The Madurai Municipality v. Kamakshisundaram Chettiar",
      "citation": "1955 11 M.L.J. 369",
      "treatment": "distinguished",
      "relevance": "Followed Poplar but rejected similarly."
    },
    {
      "case_name": "The Municipal Corporation of the City of Rangoon v. The Surati Bara Bazzar Company Limited",
      "citation": "1923 I.L.R. 1 Rang. 668",
      "treatment": "followed",
      "relevance": "Distinguished Poplar based on rating law differences."
    }
  ],
  "statutes_cited": [
    {
      "name": "Calcutta Municipal Act, 1923",
      "sections": [
        "s. 127A",
        "s. 139",
        "s. 140",
        "B. 131",
        "s. 128"
      ],
      "relevance": "Basis for fixing annual value as gross annual rent reasonably expected to let; objections and appeals process."
    },
    {
      "name": "West Bengal Premises Rent Control Temporary Provisions Act, 1950 (W.B. XVII of 1950)",
      "sections": [
        "s. 3",
        "s. 9",
        "s. 33A",
        "s. 10(b)"
      ],
      "relevance": "Fixes standard rent; excess rent irrecoverable and penal; upper limit on reasonable rent."
    },
    {
      "name": "Calcutta Municipal Act, 1951 (W.B. XXXIII of 1951)",
      "sections": [
        "s. 168(1)"
      ],
      "relevance": "Proviso explicitly limits annual value to standard rent under Rent Control Act of 1950."
    },
    {
      "name": "Calcutta Rent Act, 1920 (Ben. III of 1920)",
      "sections": [
        "s. 26"
      ],
      "relevance": "Previously prohibited assessment above standard rent; historical context."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's dismissal of the Corporation's appeal, holding that under s. 127A of the Calcutta Municipal Act, 1923, the annual value cannot exceed the standard rent fixed under the Rent Control Act, 1950, and confirmed the interpretation of 'at the time of assessment'.",
    "relief_granted": "Annual valuation fixed at Rs. 6,831 based on standard rent upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the annual value of land, and the annual value of any building erected for letting purposes or ordinarily let, shall be deemed to be the gross annual rent at which the land or building might at the time of assessment reasonably be expected to let from year to year\"",
      "speaker": "court",
      "significance": "Core provision interpreted by the court."
    },
    {
      "text": "\"A landlord cannot reasonably be expected to let a building for a rent higher than the standard rent.\"",
      "speaker": "court",
      "significance": "Key holding limiting valuation to standard rent due to penal consequences."
    },
    {
      "text": "\"the value of the property to the owner is the standard in making the assessment thereunder.\"",
      "speaker": "court",
      "significance": "Principle distinguishing Indian from English rating law."
    }
  ],
  "_case_id": "1961_61",
  "_label": 0,
  "_text_length": 20621,
  "_extracted_at": "2026-02-10T19:30:36.249326"
}