{
  "metadata": {
    "case_name": "Standard Vacuum Refining Co. of India Ltd. v. Its Workmen",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeals Nos. 416 of 1958 and 19 of 1959",
    "date_of_judgment": "1961-01-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Industrial dispute between Standard Vacuum Refining Co. of India Ltd. (appellant in CA 416/58) and its workmen (respondents in CA 416/58, appellants in CA 19/59) relating to claim for bonus for the year commencing January 1, 1956, and ending December 31, 1956.",
      "type": "background",
      "date": "1956-01-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondents claimed bonus equivalent to nine months total earnings inclusive of all allowances and overtime and extra-time earnings.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Conciliation officer attempted conciliation under s. 12(4) of Industrial Disputes Act, 1947; efforts failed, failure report submitted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Government of Bombay referred dispute to Industrial Tribunal, Bombay under s. 12(5) of the Act in Reference I.T. No. 218 of 1957; Award dated January 13, 1958.",
      "type": "procedural",
      "date": "1958-01-13",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondents include 648 employees: 524 operatives and 124 clerical cadre.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Before Tribunal, respondents alleged appellant admitted capacity to pay entire bonus claim during conciliation and urged no need for Full Bench formula; claimed not paying living wage, large gap exists.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Appellant denied admitting capacity to pay entire claim; denied entitlement to bonus as paying living wage, no gap; provided calculations of average wages; voluntarily paid three months basic wages as bonus.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Tribunal found material insufficient for definite opinion on living wage; observed dispute not relating to wage scales, living wage illusive concept; held wages fair but gap exists in large number of cases; awarded five months basic earnings excluding dearness and other allowances and overtime as bonus.",
      "type": "material",
      "date": "1958-01-13",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellant agreed to apply decision to subsequent years until 1963; specific agreement for five years thereafter on wage-structure and bonus.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Average wages: operatives Rs. 273.65 np., clerks Rs. 370.11 np., total Rs. 301.16 np. (including basic, dearness allowance, amenities).",
      "type": "material",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant is paying a living wage to the respondents, rendering them not entitled to any bonus.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "What is the quantum of bonus to be awarded to the respondents.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Denied admitting capacity to pay entire bonus; paying living wage, no gap between actual and living wage, so no entitlement to bonus; supported by average wage calculations exceeding estimated living wage of Rs. 192.50 np.; relied on Textile Labour Committee 1940 report (Rs. 50-55 living wage then, indexed by 3.5).",
      "supporting_facts": [
        "f7",
        "f10"
      ],
      "legal_basis": "Full Bench formula; decisions of this Court and tribunals"
    },
    {
      "id": "pa2",
      "text": "Tribunal's finding on living wage vague; should have made definite finding; request remand for further evidence rejected by court.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Five months bonus too high; suggest ceiling on bonus to discourage excessive claims.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant admitted capacity during conciliation; no need for Full Bench formula; not paying living wage, large gap; bonus to fill gap; wages approximate need-based minimum Rs. 209.70 np. per Tripartite resolution 1957.",
      "supporting_facts": [
        "f6",
        "f5"
      ],
      "legal_basis": "15th Indian Labour Conference resolution July 1957; Health Bulletin No. 23"
    },
    {
      "id": "ra2",
      "text": "Tribunal erred in not awarding higher than five months basic wages.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Tribunal's approach to living wage partly justified as material meagre; oil companies' plea consistently rejected; no remand as appellant knew implications.",
      "addresses_issue": "i1",
      "key_observation": "Material insufficient; plea academic given voluntary payments and agreements."
    },
    {
      "id": "cr2",
      "text": "Living wage dynamic, idealistic concept per Art. 43; includes frugal comfort, education, insurance, etc.; not reached in underdeveloped economy; averages (Rs. 273-370) below living wage, above need-based minimum.",
      "addresses_issue": "i1",
      "key_observation": "Textile Committee 1940 figure Rs. 50-55 was need-based minimum, not living wage; indexing defective."
    },
    {
      "id": "cr3",
      "text": "Rejected precedents relying on Textile report as erroneous; prior tribunals correctly rejected plea.",
      "addresses_issue": "i1",
      "key_observation": "No employer yet proved living wage; bonus valid till then."
    },
    {
      "id": "cr4",
      "text": "No ceiling on bonus; depends on facts, wages, profits; five months strikes fair balance; no interference.",
      "addresses_issue": "i2",
      "key_observation": "Tribunal considered relevant factors."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant not paying living wage; gap exists; entitled to bonus.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Five months basic earnings bonus award upheld as reasonable.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Muir Mills Co. Ltd. v. Suti Mills Mazdoor Union, Kanpur",
      "citation": "1955 1 S.C.R. 991",
      "treatment": "followed",
      "relevance": "Labour contribution to profits; bonus fills wage gap."
    },
    {
      "case_name": "Sree Meenakshi Mills Ltd. v. Their Workmen",
      "citation": "1958 S.C.R. 878, 884",
      "treatment": "followed",
      "relevance": "Full Bench formula conditions for bonus."
    },
    {
      "case_name": "Express Newspapers Private Ltd. v. The Union of India",
      "citation": "1959 S.C.R. 12, 79-82",
      "treatment": "followed",
      "relevance": "Idealistic concept of living wage per Art. 43."
    },
    {
      "case_name": "Standard Vacuum Oil Company v. Their Workmen",
      "citation": "1952 1 L.L.J. 839",
      "treatment": "distinguished",
      "relevance": "Erroneously used Textile report for living wage."
    },
    {
      "case_name": "Burmah-Shell, etc., Oil Companies in Madras v. Their Employees",
      "citation": "1954 1 L.L.J. 782",
      "treatment": "distinguished",
      "relevance": "Erroneously relied on Textile report."
    },
    {
      "case_name": "Workers of S.V.O.C. Ltd. Standard Vacuum Employees Union v. Standard Vacuum Oil Co. Ltd.",
      "citation": "1957 1 L.L.J. 165",
      "treatment": "distinguished",
      "relevance": "Same error on Textile report."
    },
    {
      "case_name": "Burmah-Shell Oil Storage and Distributing Co. of India, Ltd., Bombay v. Their Workmen",
      "citation": "1953 2 L.L.J. 246",
      "treatment": "followed",
      "relevance": "Living wage not affordable yet; no excessive bonus."
    },
    {
      "case_name": "Standard Vacuum Oil Company v. Their Employees",
      "citation": "1954 1 L.L.J. 484",
      "treatment": "followed",
      "relevance": "No need for exact living wage figure for bonus."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 12(4)",
        "s. 12(5)"
      ],
      "relevance": "Conciliation failure report and reference to Tribunal."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 43"
      ],
      "relevance": "Directive Principle for living wage, conditions of work."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Both cross-appeals dismissed; Tribunal's award of five months basic earnings as bonus upheld; company's plea of paying living wage rejected; no bonus entitlement denied.",
    "relief_granted": "None; award upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the concept of a living wage is not a static concept; it is expanding and the content of its constituents and their respective contents are bound to expand and widen with the development and growth of national economy.",
      "speaker": "court",
      "significance": "Defines living wage as dynamic and idealistic."
    },
    {
      "text": "in an under-developed country it would be idle to describe any wage structure as containing the ideal of the living wage.",
      "speaker": "court",
      "significance": "Rejects claim in Indian context."
    },
    {
      "text": "awarding five months bonus strikes a fair balance between the conflicting standards of the workmen and the company.",
      "speaker": "lower_court",
      "significance": "Basis for upholding quantum."
    }
  ],
  "_case_id": "1961_98",
  "_label": 0,
  "_text_length": 55932,
  "_extracted_at": "2026-02-10T19:30:33.977844"
}