{
  "metadata": {
    "case_name": "Appellant Firm (Import/Export Merchants) v. Respondent Company (Cotton Spinning and Weaving Mill)",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Das Gupta J."
    ],
    "case_number": "Civil Appeal No. 331 of 1956",
    "date_of_judgment": "1961-02-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "By a contract in writing dated August 9, 1950, entered into at Bombay, the appellants agreed to sell to the respondent 50,000 lbs. of Italian Staple Fibre Cotton at Rs. 1,350/- per Candy Ex docks, Shipment October November 1950.",
      "type": "material",
      "date": "1950-08-09",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Of the contracted quantity, 10,000 lbs. was delivered to and accepted by the respondent company on October 31, 1950.",
      "type": "admitted",
      "date": "1950-10-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The balance 40,000 lbs. was not delivered by the appellants.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Respondent brought suit for damages alleging wrongful failure to deliver the balance goods.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Appellants admitted failure to deliver but pleaded exemption under printed term 16 due to intermediary parties (suppliers) failing to supply and circumstances beyond control; also that shipment time not guaranteed and not of essence.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Trial Judge held shipment time guaranteed except delay in import licence (obtained in good time), time of essence, no intermediary failure, no adequate contract by appellants; awarded damages to respondent.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Bombay High Court Appeal No. 97 of 1954 dismissed on March 11, 1955, confirming trial judge.",
      "type": "procedural",
      "date": "1955-03-11",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellants obtained special leave for Supreme Court appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellants had contract with Italian suppliers for 200,000 lbs. August 1950 shipment (later extended to September); 50,000 lbs. arrived in October 1950, of which 40,000 lbs. to earlier contract, 10,000 to this contract.",
      "type": "background",
      "date": "1950-08",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Appellants had another contract August 4, 1950, with Italian suppliers for 300,000 lbs. November December 1950; received 70,000 lbs., nothing delivered to respondent.",
      "type": "background",
      "date": "1950-08-04",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Earlier contract with Italian suppliers cancelled end of September 1950.",
      "type": "background",
      "date": "1950-09",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Remarks column in contract: 'This contract is subject to import licence and therefore the shipment date is not guaranteed.'",
      "type": "material",
      "date": "1950-08-09",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "No delay in obtaining import licence.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the shipment date October-November 1950 was guaranteed.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether time of shipment was of the essence of the contract.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether appellants had adequate contracts with Italian suppliers which, if not broken, would enable timely supply of 40,000 lbs.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Shipment date was not guaranteed.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Printed terms and remarks column"
    },
    {
      "id": "pa2",
      "text": "Shipment time was not of the essence of the contract.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Printed term 2"
    },
    {
      "id": "pa3",
      "text": "Contracts with Italian suppliers were adequate to obtain supplies in good time if not broken.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Bilasiram Thakurdas v. Gubbay; Phoenix Mills Ltd. v. Madhavdas Rupchand"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Shipment time guaranteed except for import licence delay, which did not occur; time of essence.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "No adequate contracts by appellants with suppliers; primary failure due to appellants' lack of readiness.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Manuscript remarks 'This contract is subject to import licence and therefore the shipment date is not guaranteed' means shipment date not guaranteed only to extent of import licence delay; since no such delay, shipment Oct-Nov 1950 guaranteed; time of essence in commercial contracts.",
      "addresses_issue": "i1",
      "key_observation": "Word 'therefore' links non-guarantee specifically to import licence; manuscript prevails over print."
    },
    {
      "id": "cr2",
      "text": "Printed term 2 provides options for non-shipment, indicating time is of essence; clauses 7 and 9 do not alter this.",
      "addresses_issue": "i2",
      "key_observation": "Provisions for notice, cancellation or extension with allowances presuppose guaranteed shipment time."
    },
    {
      "id": "cr3",
      "text": "Seller must show adequate contract entitling timely supply; mere chance insufficient; must do all in power.",
      "addresses_issue": "i3",
      "key_observation": "Non-delivery due to own default in contracting if not entitled to timely supply."
    },
    {
      "id": "cr4",
      "text": "Earlier Italian contract cancelled by end September; November-Dec contract allows shipment till Dec end, no evidence of instalment requiring spread; contract not produced.",
      "addresses_issue": "i3",
      "key_observation": "No entitlement to goods before Dec 15, 1950 (contract period +15 days cl.7)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Shipment time October-November 1950 guaranteed as no import licence delay.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Time of shipment is of the essence of the contract.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Appellants had no adequate contract with suppliers entitling them to timely supply.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bilasiram Thakurdas v. Gubbay",
      "citation": "1915 I.L.R. 43 Cal. 305",
      "treatment": "referred",
      "relevance": "Instalment contract required shipments spread over July-Dec 1914."
    },
    {
      "case_name": "Phoenix Mills Ltd. v. Madhavdas Rupchand",
      "citation": "1916 24 Bom. L.R. 142",
      "treatment": "referred",
      "relevance": "Delivery during Oct-Nov as ready, reasonable quantities at a time."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed confirming Bombay High Court; appellants liable for damages for breach of contract by wrongful non-delivery of 40,000 lbs.; damages as assessed by commissioner.",
    "relief_granted": "Damages to respondent as per trial court assessment by commissioner",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'This contract is subject to import licence, and therefore the shipment date is not guaranteed.'",
      "speaker": "court",
      "significance": "Key contract term interpreted to limit non-guarantee to import licence delay only."
    },
    {
      "text": "In commercial contracts, time is ordinarily of the essence of the contract.",
      "speaker": "court",
      "significance": "Establishes default rule applied here."
    },
    {
      "text": "Before the seller could be heard to say that the non-supply was due to default on the part of his suppliers... the seller is bound to show that he himself did all in his power to ensure timely supply.",
      "speaker": "court",
      "significance": "Defines burden on seller for exemption."
    }
  ],
  "_case_id": "1961_348",
  "_label": 0,
  "_text_length": 17564,
  "_extracted_at": "2026-02-10T19:34:42.367186"
}