{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "RAGHUBAR DAYAL, J."
    ],
    "case_number": "Criminal Appeal No. 119 of 1960",
    "date_of_judgment": "1961-04-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeal by special leave from the judgment and order dated April 14, 1960, of the Madras High Court in Cr. Misc. Petition No. 246 of 1960.",
      "type": "procedural",
      "date": "1960-04-14",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Madras High Court dismissed the application for quashing the commitment of the case against the appellant to the Court of Session for trial.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Offences: criminal conspiracy to cheat under s. 120-B read with s. 420, Indian Penal Code, and offence of forgery committed in pursuance of that conspiracy.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Criminal conspiracy alleged to have been committed at Calcutta.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Other offences in pursuance of the conspiracy alleged to have been committed within the jurisdiction of the Court of Session at Madras.",
      "type": "admitted",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Quashing of the commitment sought on the ground that Courts at Madras had no jurisdiction to try the offence of conspiracy.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the offence of conspiracy alleged to have been committed at Calcutta can be tried by the Court of Session at Madras.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Courts at Madras had no jurisdiction to try the offence of conspiracy alleged to have been committed at Calcutta.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In Purushottamdas Dalmia v. The State of West Bengal, held that the Court having jurisdiction to try the offence of criminal conspiracy can also try offences committed in pursuance of that conspiracy even if those offences were committed outside the jurisdiction of that Court, as the provisions of s. 239, Criminal Procedure Code, are not controlled by the provisions of s. 177, Criminal Procedure Code, which do not create an absolute prohibition against the trial of offences by a Court other than the one within whose jurisdiction the offence is committed.",
      "addresses_issue": "i1",
      "key_observation": "Provisions of s. 239 CrPC not controlled by s. 177 CrPC."
    },
    {
      "id": "cr2",
      "text": "On a parity of reasoning, the Court having jurisdiction to try the offences committed in pursuance of the conspiracy, can try the offence of conspiracy even if it was committed outside its jurisdiction.",
      "addresses_issue": "i1",
      "key_observation": "Parity of reasoning applies vice versa."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Court of Session at Madras having jurisdiction to try the offences committed in pursuance of the conspiracy can try the offence of conspiracy even though committed at Calcutta.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Purushottamdas Dalmia v. The State of West Bengal",
      "citation": "1962 2 S.C.R. 101",
      "treatment": "followed",
      "relevance": "Court with jurisdiction over conspiracy offences can try pursuance offences outside jurisdiction; parity for reverse."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 120-B",
        "s. 420"
      ],
      "relevance": "Offences of criminal conspiracy to cheat and forgery in pursuance thereof."
    },
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "s. 239",
        "s. 177"
      ],
      "relevance": "s. 239 provisions not controlled by s. 177; no absolute prohibition on trial outside jurisdiction."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed. Supreme Court upheld the Madras High Court's order refusing to quash the commitment, confirming that the Court of Session at Madras has jurisdiction to try the conspiracy offence committed at Calcutta.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the Court having jurisdiction to try the offence of criminal conspiracy can also try offences committed in pursuance of that conspiracy even if those offences were committed outside the jurisdiction of that Court",
      "speaker": "court",
      "significance": "Key holding from cited precedent applied."
    },
    {
      "text": "On a parity of reasoning, the Court having jurisdiction to try the offences committed in pursuance of the conspiracy, can try the offence of conspiracy even if it was committed outside its jurisdiction.",
      "speaker": "court",
      "significance": "Direct resolution of the issue."
    }
  ],
  "_case_id": "1961_371",
  "_label": 0,
  "_text_length": 2256,
  "_extracted_at": "2026-02-10T19:34:34.592565"
}