{
  "metadata": {
    "case_name": "Defendant (Appellant) v. Smt. Vimala (Respondent)",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "SHAH, J."
    ],
    "case_number": "Civil Appeal No. 624 of 1960",
    "date_of_judgment": "1961-02-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Smt. Vimala (plaintiff) filed suit No. 73 of 1956 in the court of the Subordinate Judge, South Kanara, for decree for possession of lands, buildings, house-sites in Sch. A, movable properties in Sch. B, possession, management and account of properties in Sch. C, and institutions in Sch. D alleged to be private family religious endowments.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Plaintiff's father Shri Dharmasthala Manjayya Heggade died on August 31, 1955, entitling plaintiff to the suit properties, but defendant wrongfully possessed himself of those properties.",
      "type": "background",
      "date": "1955-08-31",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Plaintiff valued properties in Schs. C and D under s. 28 of Madras Court-fees and Suits Valuation Act, 1955 at Rs. 21,000/- and paid court-fee of Rs. 275/-. Lands in Sch. A valued at 30 times assessment, buildings separately.",
      "type": "procedural",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f4",
      "text": "On June 28, 1956, Subordinate Judge held Rs. 34,577/- court-fee paid by plaintiff adequate on office objection.",
      "type": "procedural",
      "date": "1956-06-28",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "On September 9, 1956, defendant filed written statement objecting to valuation and court-fee.",
      "type": "procedural",
      "date": "1956-09-09",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Trial court raised issue on adequacy of court-fee.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On February 13, 1957, defendant applied for Commissioner to value properties; court dismissed and declared fee adequate.",
      "type": "procedural",
      "date": "1957-02-13",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "In Revision Petition 272 of 1957 to High Court of Judicature at Bangalore, HC set aside order, directed trial court to ascertain value, appoint Commissioner if needed, decide afresh.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Subordinate Judge appointed Commissioner, who submitted report; defendant objected, further and supplemental reports submitted.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Subordinate Judge held Sch. D properties ex-commercial, fixed court-fee for possession; Sch. D trust properties, s.28 applied as rival trustees dispute; houses on revenue lands at market value or 30 times assessment; Sch. A lands Rs. 7,74,665/-, house-sites Rs. 27,625/-. Plaintiff paid additional fee.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Plaintiff and defendant filed separate revision petitions to High Court of Mysore; HC heard Advocate-General, confirmed Subordinate Judge except for Nelliyadi Beedu, directed trial court to determine if ex-commercial after evidence.",
      "type": "procedural",
      "date": "1960-05-30",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Defendant preferred appeal to Supreme Court by special leave under Art. 136 against High Court order in Civil Revision Petition No. 1098 of 1959.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the defendant has a right to invoke the revisional jurisdiction of the High Court under s.115 CPC against an order determining the adequacy of court-fee paid by the plaintiff on the plaint.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether s.12(2) of Madras Court-fees and Suits Valuation Act, 1955 invests the defendant with a right to move the High Court in revision on court-fee adequacy.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "By Act 14 of 1955 (Madras Court-fees and Suits Valuation Act), defendant invested with right not only to contest in trial court adequacy of court-fee but also to move High Court in revision if order contrary to his submission passed.",
      "supporting_facts": [
        "f5",
        "f7",
        "f8",
        "f11"
      ],
      "legal_basis": "s.12(2) of Madras Court-fees and Suits Valuation Act, 1955"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Court-fees Act enacted to collect revenue for State, not to arm contesting party with weapon to obstruct trial. Question of adequate court-fee primarily between plaintiff and State; defendant has no grievance to invoke revision.",
      "addresses_issue": "i1",
      "key_observation": "Defendant may contest valuation in trial court but has no right to move superior court by appeal or revision against order on court-fee."
    },
    {
      "id": "cr2",
      "text": "s.115 CPC revisional jurisdiction conditioned by cls. (a) to (c); no refusal/assumption of jurisdiction or illegality by trial court.",
      "addresses_issue": "i1",
      "key_observation": "Defendant honestly believing inadequate fee paid still has no right to revision."
    },
    {
      "id": "cr3",
      "text": "s.12(2) only enables defendant to raise contention on court-fee to assist court; no provision enables defendant to move HC in revision. s.19 allows enquiry/commission but does not arm defendant to obstruct suit via revision.",
      "addresses_issue": "i2",
      "key_observation": "High Court grievously erred in entertaining revision applications on court-fee at instance of defendant."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Defendant has no right to move High Court in revision against trial court's order adjudging court-fee payable on plaint.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "s.12(2) of Madras Court-fees Act does not confer such revisional right on defendant.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Madras Court-fees and Suits Valuation Act, 1955 (Act 14 of 1955)",
      "sections": [
        "s. 12(2)",
        "s. 28",
        "s. 19"
      ],
      "relevance": "Governs valuation and court-fee on plaint; enables defendant to plead insufficiency but does not allow revision to HC."
    },
    {
      "name": "Court-fees Act",
      "sections": [],
      "relevance": "Enacted to collect revenue for State, not for defendant to obstruct trial."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s. 115"
      ],
      "relevance": "Limits High Court's revisional jurisdiction; not invocable by defendant on court-fee adequacy."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 136"
      ],
      "relevance": "Basis for special leave appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court held that the High Court erred in entertaining the defendant's revision petition on the question of adequacy of court-fee paid by the plaintiff, as such matters are primarily between the plaintiff and the State, and the defendant has no locus standi to seek revision under s.115 CPC.",
    "relief_granted": "Appeal allowed; High Court order set aside implicitly by criticizing error in entertaining revision.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Court-fees Act was enacted to collect revenue for the benefit of the State and not to arm a contesting party with a weapon of defence to obstruct the trial of an action.",
      "speaker": "court",
      "significance": "Core principle distinguishing purpose of court-fee legislation."
    },
    {
      "text": "Whether proper court-fee is paid on a plaint is primarily a question between the plaintiff and the State.",
      "speaker": "court",
      "significance": "Establishes lack of defendant's locus standi."
    },
    {
      "text": "The High Court grievously erred in entertaining revision applications on questions of court-fee at the instance of the defendant.",
      "speaker": "court",
      "significance": "Direct holding against High Court's action."
    }
  ],
  "_case_id": "1961_421",
  "_label": 0,
  "_text_length": 9166,
  "_extracted_at": "2026-02-10T19:36:06.975195"
}