{
  "metadata": {
    "case_name": "Hiralal Patni v. Loonkaran Sethiya & Ors.",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Civil Appeal No.110 of 1961",
    "date_of_judgment": "1961-04-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Three spinning mills and one flour mill at Agra collectively known as Johns Mills, originally owned by John family or predecessors, at time of proceedings owned by: Hiralal Patni and Munni Lal Mehra (19/40th share), Gambhirmal Pandiya Private Ltd (8/40th), Messrs. John & Co (11/40th), I.E. John (2/40th).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Seth Loonkaran Sethiya (respondent No.1) advanced large amounts to Messrs. John & Co on security of its business assets and stocks.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Sethiya filed O.S. No.76 of 1949 on April 18, 1949 in Civil Judge, Agra against John & Co for recovery by sale of assets; partners of John & Co (defendants 1st set), partners of Johns Jain & Co (defendants 2nd set, including Hiralal Patni as defendant 5) made parties.",
      "type": "procedural",
      "date": "1949-04-18",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Pending suit, Sethiya applied under O.XL r.1 CPC for Receiver; Civil Judge appointed two joint Receivers on May 21, 1949 to run three spinning mills.",
      "type": "procedural",
      "date": "1949-05-21",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Hiralal Patni appealed HC Allahabad; HC modified on August 22, 1949 confining Receivers to share of John & Co (defendants 1st set) in Johns Jain Mehra Co for protection and preservation; Receivers not to interfere with running mills except under express court orders if security jeopardized.",
      "type": "procedural",
      "date": "1949-08-22",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Sethiya applied for Receiver over Hiralal Patni property; Civil Judge on December 1, 1951 directed Receivers to take possession of appellant's share in mills; appeal filed to HC, operation stayed.",
      "type": "procedural",
      "date": "1951-12-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Civil Judge passed preliminary decree on April 5, 1954 against defendants to deposit Rs.18,00,152 or plaintiff apply for final decree for sale of business assets; right for personal decree if proceeds insufficient; Receivers to continue until discharged.",
      "type": "procedural",
      "date": "1954-04-05",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Civil Judge prepared scheme for running mills on March 25, 1955; parties appealed to HC.",
      "type": "procedural",
      "date": "1955-03-25",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "HC on August 23, 1955 discharged Civil Judge's Receivers, appointed another Receiver; appeals against scheme compromised, parties agreed to lease mills from Receiver for 3 years.",
      "type": "procedural",
      "date": "1955-08-23",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Receiver executed lease of flour mill to Hiralal Patni on January 14, 1956 for 3 years; appellant to deliver premises to Receiver on expiry.",
      "type": "procedural",
      "date": "1956-01-14",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Final decree for sale of properties made on March 14, 1956, silent on Receiver.",
      "type": "procedural",
      "date": "1956-03-14",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Hiralal Patni applied to HC on September 29, 1958 for extension of lease by 3 years; rejected January 16, 1959 as stopgap, Receiver to make fresh arrangement under Civil Judge supervision.",
      "type": "procedural",
      "date": "1958-09-29",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Receiver applied to Civil Judge January 17, 1959 for instructions to dispossess appellant; appellant objected claiming owner rights; Civil Judge disallowed, held Receiver authority from preliminary decree, directed auction lease for 2 years.",
      "type": "procedural",
      "date": "1959-01-17",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Auction held, appellant highest bidder, paid and executed lease.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appellant appealed Civil Judge order to HC Allahabad; HC dismissed on October 14, 1960 confirming Civil Judge directing Official Receiver to take possession.",
      "type": "procedural",
      "date": "1960-10-14",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Application for discharge of Receiver pending in lower court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "On true construction of relevant orders, does Receiver have power to dispossess appellant to prevent working flour mill?",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "After passing of final decree, can Receiver continue to exercise powers re rights of parties, or only for accounting and discharge of debts?",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Can appellant, holding over after expiry of lease from Receiver, be dispossessed only by suit or by summary procedure?",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Receiver has no power to dispossess appellant in way preventing working flour mill; orders put Receivers in supervisory control only, not possession.",
      "supporting_facts": [
        "f5",
        "f6",
        "f9"
      ],
      "legal_basis": "Construction of orders dated 21.5.1949, 22.8.1949, 1.12.1951"
    },
    {
      "id": "pa2",
      "text": "After final decree, Receiver may continue for accounting/discharge of debts but cannot exercise powers re rights of parties.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Appellant acquired right under lease, continued in possession after expiry; dispossession only by suit, not summary procedure.",
      "supporting_facts": [
        "f10",
        "f13",
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "HC order 22.8.1949 put Receivers in charge of entire property of defendants 1st set (incl share in mills) for protection; prohibited running mills without express orders; Civil Judge order 1.12.1951 extended to 2nd set similarly; preliminary decree directed Receivers continue till discharged.",
      "addresses_issue": "i1",
      "key_observation": "Flour mill of appellant put in possession of Receiver; appellant ran under compromise formula."
    },
    {
      "id": "cr2",
      "text": "Receiver does not cease automatically on final decree unless specified; preliminary decree expressly continued Receivers till discharged; final decree silent, suit not fully terminated (personal decree possible); authorities (Halsbury, Kerr, High, Woodroffe) support continuation.",
      "addresses_issue": "i2",
      "key_observation": "Receivers entitled to function till discharged."
    },
    {
      "id": "cr3",
      "text": "Under O.XL r.1 CPC, court may direct Receiver (officer of court) to remove party from possession; lease part of compromise scheme for running mills, express term to redeliver on expiry; summary process competent as appellant party to suit, no conflicting claims.",
      "addresses_issue": "i3",
      "key_observation": "Court can direct redelivery post-expiry without suit; distinguished cases where lease independent or collusion alleged."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Receiver in possession of flour mill; appellant tenant under Receiver via compromise lease.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Receivership continues post-final decree till discharged, per preliminary decree and authorities.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Court competent under O.XL r.1 to direct summary dispossession post-lease expiry in this context.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Krista Chandra Ghose v. Krista Sakha Ghose",
      "citation": "I.L.R. 36 Cal. 52 (1908)",
      "treatment": "distinguished",
      "relevance": "Summary order not for setting aside lease on collusion; suit needed."
    },
    {
      "case_name": "Nanakchand v. Pannalal",
      "citation": "A.I.R. 1951 Raj. 152",
      "treatment": "distinguished",
      "relevance": "Receiver cannot recover rent summarily like landlord; suit needed."
    },
    {
      "case_name": "Loonkaran v. I.N. John",
      "citation": "A.I.R. 1961 All. 59",
      "treatment": "followed",
      "relevance": "Court power to eject summarily post-expiry/undertaking where submitted to jurisdiction."
    },
    {
      "case_name": "Sivarajan v. Official Receiver, Quilon District",
      "citation": "I.L.R. 1953 T.C. 30",
      "treatment": "followed",
      "relevance": "Summary eviction post-expiry where lease requires unconditional surrender."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order XL Rule 1",
        "Order XL Rule 1(1)(b)",
        "Order XL Rule 1(1)(d)",
        "Order XL Rule 1(2)",
        "Section 51(d)"
      ],
      "relevance": "Appointment, powers, removal by Receiver; continuation post-decree."
    },
    {
      "name": "United Provinces Industrial Disputes Act",
      "sections": [
        "Section 3"
      ],
      "relevance": "Collector power to arrange running of mills."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court rejected all three contentions of appellant, upheld High Court judgment confirming Civil Judge order directing Receiver to take possession of flour mill from appellant post-lease expiry; observations not to affect pending Receiver discharge application.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "This case illustrates how the enforcement of an interlocutory order appointing a Receiver made in the interest of all the parties concerned could be obstructed and the object of the order itself be defeated by dilatory tactics adopted by one party or other.",
      "speaker": "court",
      "significance": "Highlights purpose of receivership and delays."
    },
    {
      "text": "We hold on a construction of the relevant orders that the flour mill of the appellant was also put in the possession of the Receiver and that the appellant was running the said mill under the compromise formula.",
      "speaker": "court",
      "significance": "Core holding on possession."
    },
    {
      "text": "The Court, in our view, was legally competent to confer a power on the Receiver under Order XL, r. 1(1)(d), of the Code of Civil Procedure to recover the property from the appellant.",
      "speaker": "court",
      "significance": "Justifies summary dispossession."
    }
  ],
  "_case_id": "1961_42",
  "_label": 0,
  "_text_length": 35298,
  "_extracted_at": "2026-02-10T19:29:51.207176"
}