{
  "metadata": {
    "case_name": "V. R. Subramanyam v. B. Thayappa",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeals Nos. 321 and 322 of 1956",
    "date_of_judgment": "1961-02-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "V. R. Subramanyam, the appellant, is the owner of plot No. 29, Subedar Chattram Road in Bangalore.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "B. Thayappa, the respondent, is a building contractor.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant entrusted respondent with constructing a house and shops on the plot per written agreement dated October 1, 1942, modified October 6, 1942: six shops abutting public road, main building at rear, out-house, garage according to site plan.",
      "type": "material",
      "date": "1942-10-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Remuneration rates: Rs. 4-2-0 per square foot for R.C.C. roofing constructions, Rs. 3-2-0 per square foot for tiled construction.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Bangalore Municipality did not sanction proposed plan; altered plan sanctioned: shops deleted, out-house area increased, puja room on ground floor and extra room on first floor added, compound wall to be constructed.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondent carried out substantial construction work according to plan; appellant paid Rs. 20,200 and delivered building materials.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Disputes arose: appellant claimed defective work and compensation for repairs; respondent claimed compensation for extra work not expressly provided in agreement.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Each party set up an oral agreement about remuneration for extra work not included in original agreement.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant filed suit O.S. 54 of 1946-47 in Subordinate Judge, Bangalore (transferred to Principal District Judge) for Rs. 8,515-4-0 for defective work and delay.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Respondent filed suit No. 55 of 1946-47 (transferred to Principal District Judge) for Rs. 5,988-12-0 for work done less Rs. 20,200 received.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Respondent filed suit No. 117 of 1945-46 for Rs. 15,001-10-9 with interest and notice charges for out-house, godown, first floor room, flight of steps, and value of materials wrongfully removed by appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Trial court (Principal District Judge, Bangalore, judgment January 9, 1948): decreed appellant Rs. 3,000 in O.S. 54/1946-47; respondent Rs. 2,989-6-0 in 55/1946-47 and Rs. 13,329-10-9 in 117/1945-46.",
      "type": "procedural",
      "date": "1948-01-09",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Six appeals to Mysore High Court in Regular Appeals Nos. 3,24,13,25,49 of 1948 from trial court decrees.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Mysore High Court (judgment September 21, 1951): reversed decree in O.S. 54/1946-47, dismissed appellant's claim; set aside decrees in 55/1946-47 and 117/1945-46, remanded to District Court for commissioner (qualified engineer) to determine amounts for extra work per directions.",
      "type": "procedural",
      "date": "1951-09-21",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Dispute relates to construction of out-house, garage, puja room, room on first floor, staircase, compound wall.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "District Judge awarded respondent: Rs. 4-2-0 per sq ft for constructions except compound wall (Rs. 5 per running foot + additional).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "High Court: respondent entitled to prevailing market rates for constructions not covered by agreements; negatived oral agreement for extra rates; for out-house, puja room, upper floor room: Rs. 4-2-0 + extras; substantial variation for garage: rates current end 1943; stairs: lump sum or cubical content; extras per Exs. VII, VIIa per Ex. II rates.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether respondent entitled to compensation on quantum meruit basis under s.70 Contract Act for extra work despite failure to prove pleaded oral agreement.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether High Court erred in directing assessment of compensation for additional work per rates in Ex. II.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether appellant entitled to equitable set-off for defective work in respondent's suits.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Since High Court found no proof of oral agreement pleaded by respondent, suits should have been dismissed; no award on quantum meruit which was not claimed; must succeed or fail on pleaded case.",
      "supporting_facts": [
        "f7",
        "f8",
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "High Court erred in directing assessment per rates in Ex. II.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Appellant entitled to claim loss from defective work by equitable set-off in respondent's suits.",
      "supporting_facts": [
        "f7",
        "f9",
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Claimed compensation at certain rates for extra work; set up oral agreement for remuneration at prevailing market rates.",
      "supporting_facts": [
        "f7",
        "f8",
        "f10",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Both parties set up conflicting oral agreements not accepted by High Court; party rendering non-gratuitous service entitling to compensation for value; respondent entitled to compensation for extra constructions under s.70 Contract Act even without proving express oral agreement; no substantial departure from claim.",
      "addresses_issue": "i1",
      "key_observation": "Respondent made additional constructions not gratuitously."
    },
    {
      "id": "cr2",
      "text": "Rates in Ex. II were current market rates admitted by appellant's witness T.S. Narayana Rao, not excessive; direction to Commissioner to use these rates restricts enquiry scope, no serious error.",
      "addresses_issue": "i2",
      "key_observation": "Rates approved by appellant's witness."
    },
    {
      "id": "cr3",
      "text": "Appellant claimed defects in separate substantive suit dismissed by High Court; no appeal against that decree; no plea of equitable set-off raised in written statements of companion suits.",
      "addresses_issue": "i3",
      "key_observation": "Cannot reagitate dismissed claim."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Respondent entitled to compensation under s.70 Contract Act on quantum meruit for extra work not covered by written agreement, despite failure to prove oral agreement.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court direction to assess extra work per Ex. II rates proper.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No equitable set-off for appellant's defective work claim.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Contract Act",
      "sections": [
        "70"
      ],
      "relevance": "Entitles compensation quantum meruit for non-gratuitous services where benefit obtained, even without proved express agreement."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "136"
      ],
      "relevance": "Special leave granted for appeals to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals against High Court's remand order directing commissioner to assess respondent's extra work compensation per specified rates, upholding High Court's dismissal of appellant's defect claim and refusal of set-off.",
    "relief_granted": "None to appellant; High Court remand upheld for respondent.",
    "costs": "Appeals dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"If a party to a contract has rendered service to the other not intending to do so gratuitously and the other person has obtained some benefit, the former is entitled to compensation for the value of the services rendered by him.\"",
      "speaker": "court",
      "significance": "Explains basis for quantum meruit under s.70 Contract Act."
    },
    {
      "text": "\"By awarding a decree for compensation under the Statute and not under the oral contract pleaded, there was in the circumstances of this case no substantial departure from the claim made by the respondent.\"",
      "speaker": "court",
      "significance": "Justifies award despite not proving pleaded oral agreement."
    }
  ],
  "_case_id": "1961_181",
  "_label": 0,
  "_text_length": 10688,
  "_extracted_at": "2026-02-10T19:31:59.325924"
}