{
  "metadata": {
    "case_name": "Appellants v. Custodian General and Ors.",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Civil Appeal No. 340 of 1958",
    "date_of_judgment": "1961-04-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants and respondents Nos. 4 and 5 are residents of village Baland, Tehsil and District Rohtak, and are members of the body of proprietors of that village.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Village Baland is divided between three estates; the plot in suit is in the estate known as Barsan.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Fakira, a mendicant and a number-proprietor, had his house on the plot in suit.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In January 1950, the Custodian of Evacuee Property issued a notice under s. 7 of the Administration of Evacuee Property Ordinance No. XXVII of 1949, stating that the appellants were in unauthorised possession of the house of Fakira, a Muslim evacuee, and that they should either vacate the house or show cause to the contrary.",
      "type": "procedural",
      "date": "1950-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellants filed objections to the notice.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Deputy Custodian of Evacuee Property, by order dated September 3, 1950, rejected the objections and declared the house to be evacuee property after enquiry through the Revenue Assistant Rehabilitation.",
      "type": "procedural",
      "date": "1950-09-03",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellants appealed to the Additional Custodian, Evacuee Property, who ordered further enquiry to ascertain whether Mumtaz, son of Fakira, had been in occupation up to the date of migration of Muslims post-partition.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Enquiry revealed Mumtaz continued to reside in village Baland and a son was born to him in July 1947.",
      "type": "material",
      "date": "1947-07",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Additional Custodian agreed with the Deputy Custodian's order that the property was evacuee property.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellants filed revision before Custodian General, dismissed on June 17, 1952; observed sufficient evidence that Mumtaz in possession up to July 1947.",
      "type": "procedural",
      "date": "1952-06-17",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellants filed writ petition in Punjab High Court under Art. 226 challenging Deputy Custodian's order on grounds of no notice/opportunity and no jurisdiction due to wajib-ul-arz provisions.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "High Court Single Judge held provisions of Administration of Evacuee Property Act, 1950 complied with, referred question of number-proprietor's site vesting to larger Bench, citing need to reconsider Joti Parshad v. Bhawani Lal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Division Bench held right of number-proprietor to occupy village site was a right in property vesting in Custodian if number-proprietor became evacuee; writ petition dismissed on July 3, 1953.",
      "type": "procedural",
      "date": "1953-07-03",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Wajib-ul-arz states: No number-proprietor can settle or build without consent of estate owner; obtains land/house from proprietor, lives as long as pleases; on abandonment, house falls to proprietor; no customary right to sell/mortgage without consent; if dies heirless, reverts to proprietor; mendicants are number-proprietors.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Fakira occupied site and probably built house himself with permission; heritable/transferable only with consent.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Fakira and son Mumtaz migrated to Pakistan at partition, abandoning village.",
      "type": "material",
      "date": "1947",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Fakira had any such right in the property in suit which could vest in the Custodian on Fakira or his son Mumtaz becoming an evacuee.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Scope of s. 18 of the Administration of Evacuee Property Act, 1950.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Fakira was a tenant or licensee under wajib-ul-arz.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether migration to Pakistan at partition amounts to abandonment under wajib-ul-arz.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Fakira had no such right which could vest in Custodian on account of terms of wajib-ul-arz and his being a licensee.",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": "Wajib-ul-arz; house of number-proprietor vests in proprietary body on leaving village"
    },
    {
      "id": "pa2",
      "text": "Deputy Custodian gave no notice or opportunity; no jurisdiction due to wajib-ul-arz.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "S. 18 of Administration of Evacuee Property Act rebuts contention; Fakira's right vests in Custodian.",
      "supporting_facts": [
        "f8",
        "f10",
        "f16"
      ],
      "legal_basis": "Section 18, Administration of Evacuee Property Act, 1950"
    },
    {
      "id": "ra2",
      "text": "Migration to Pakistan does not amount to abandonment under wajib-ul-arz as it contemplates voluntary abandonment, not under force.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "Wajib-ul-arz"
    },
    {
      "id": "ra3",
      "text": "Fakira was lessee, not licensee, per Associated Hotels of India v. R. N. Kapoor.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Associated Hotels of India v. R. N. Kapoor"
    },
    {
      "id": "ra4",
      "text": "Licensee's rights vest as 'property'; if evacuee returns, could demand possession.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "Definition of evacuee property"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S. 18(1) applies only to occupancy rights of tenants; extinguishes such rights on becoming evacuee notwithstanding contrary laws; Fakira not a tenant.",
      "addresses_issue": "i2",
      "key_observation": "Provisions of s. 18 apply to occupancy rights of a tenant; if not tenant, s. 18 does not apply."
    },
    {
      "id": "cr2",
      "text": "Fakira not tenant; occupied site, built house with permission; right to occupy heritable/transferable only with consent per wajib-ul-arz; no interest making him tenant.",
      "addresses_issue": "i3",
      "key_observation": "Fakira had no such right in site as would make him tenant."
    },
    {
      "id": "cr3",
      "text": "S. 18 does not override wajib-ul-arz; Fakira's right ended on abandonment.",
      "addresses_issue": "i1",
      "key_observation": "Provisions of sub-s. (1) of s. 18 do not apply to Fakira's rights."
    },
    {
      "id": "cr4",
      "text": "Migration to Pakistan is voluntary abandonment though due to circumstances; left village as better to do so.",
      "addresses_issue": "i4",
      "key_observation": "Abandonment is voluntary though volition arises from circumstances beyond control."
    },
    {
      "id": "cr5",
      "text": "Associated Hotels distinguishes lease (interest in property, exclusive possession) from licence (use without legal possession); wajib-ul-arz grants no interest, mere right to occupy; no transfer right.",
      "addresses_issue": "i3",
      "key_observation": "No interest created in Fakira; just heritable right to occupy for residence."
    },
    {
      "id": "cr6",
      "text": "Even if rights vest as 'property', extinguished by wajib-ul-arz; Fakira had no right when Act 1950 came into force.",
      "addresses_issue": "i1",
      "key_observation": "Property could not have been evacuee property."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Fakira did not possess any such right in the land in suit which could vest in the Custodian; property in suit is not evacuee property.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Provisions of s. 18 apply only to occupancy rights of tenants.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Fakira was not a tenant but had mere licensee-like right under wajib-ul-arz, extinguished on abandonment via migration.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Associated Hotels of India v. R. N. Kapoor",
      "citation": "1960 1 S.C.R. 368",
      "treatment": "referred",
      "relevance": "To distinguish lease from licence: substance over form, intention, exclusive possession prima facie lease but negatable; no interest/support for Fakira as lessee."
    },
    {
      "case_name": "Joti Parshad v. Bhawani Lal",
      "citation": null,
      "treatment": "doubted",
      "relevance": "High Court decision requiring re-consideration on whether number-proprietor's site vests in Custodian."
    }
  ],
  "statutes_cited": [
    {
      "name": "Administration of Evacuee Property Ordinance, 1949",
      "sections": [
        "Section 7"
      ],
      "relevance": "Notice issued declaring unauthorised possession of evacuee house."
    },
    {
      "name": "Administration of Evacuee Property Act, 1950 (Act XXXI of 1950)",
      "sections": [
        "Section 18"
      ],
      "relevance": "Scope limits to tenants' occupancy rights; does not apply to Fakira; substituted by Act XI of 1953 deemed always existing."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Writ petition filed in High Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal by special leave allowed; orders of Custodian General, Additional Custodian, Deputy Custodian and High Court quashed; property held not evacuee property vesting in Custodian.",
    "relief_granted": "Quashing of orders declaring house as evacuee property",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The sole question for determination in this case is whether Fakira had any such right in the property in suit which could vest in the Custodian on Fakira or his son Mumtaz becoming an evacuee.",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "We therefore hold that the provisions of s. 18 apply to the occupancy rights of a tenant.",
      "speaker": "court",
      "significance": "Key interpretation limiting s. 18 scope."
    },
    {
      "text": "Fakira, a number-proprietor, had no such right in the site as would make him a tenant of it.",
      "speaker": "court",
      "significance": "Determines Fakira's status, excluding s. 18 application."
    },
    {
      "text": "We are therefore of opinion that Fakira did not possess any such right in the land in suit which could vest in the Custodian and that therefore the property in suit is not evacuee property.",
      "speaker": "court",
      "significance": "Final holding in favor of appellants."
    }
  ],
  "_case_id": "1961_326",
  "_label": 1,
  "_text_length": 14057,
  "_extracted_at": "2026-02-10T19:34:15.559976"
}