{
  "metadata": {
    "case_name": "Appellants v. Respondents",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J.",
      "RAGHUBAR DAYAL, J."
    ],
    "case_number": "Civil Appeal No. 219 of 1958",
    "date_of_judgment": "1961-05-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant and respondents 1 and 2 are brothers.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On August 17, 1948, the appellant, respondents 1 and 2 and their mother by a registered deed of agreement referred their dispute regarding the partition of two houses in the city of Banaras to two arbitrators, respondents 3 and 4.",
      "type": "material",
      "date": "1948-08-17",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Within 10 days of the reference, the said arbitrators gave notice to the parties and began to take evidence i.e., they entered on the reference.",
      "type": "procedural",
      "date": "1948-08-end",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On July 25, 1949, Rajwanti, the mother of the appellant and respondents 1 and 2 died, and the arbitrators did not proceed with the inquiry.",
      "type": "material",
      "date": "1949-07-25",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On August 31, 1950, i.e., more than one year after the death of Rajwanti, the appellant gave a notice to the arbitrators requesting them to proceed with the reference and give the award at an early date.",
      "type": "procedural",
      "date": "1950-08-31",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On October 1, 1950, i.e., within 4 months from the date of the notice, the arbitrators made an award and it was duly registered.",
      "type": "procedural",
      "date": "1950-10-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On January 23, 1951, the appellant filed an application under ss. 14(2) and 17 of the Act in the Court of the Civil Judge, Banaras, praying that the said award be filed and be made a rule of the court. The said application was registered as a suit the appellant was placed in the position of plaintiff and the respondents in that of defendants.",
      "type": "procedural",
      "date": "1951-01-23",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The respondents raised various objections to the said application one of the objections was that the award was not given within the time fixed by law.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The learned Civil Judge rejected the objections and made a decree in terms of the award.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "On appeal, the High Court came to the conclusion that the award was made after the expiry of the period of limitation, and on that finding set aside the decree of the learned Civil Judge and dismissed the suit with costs.",
      "type": "procedural",
      "date": "1954-01-05",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Construction of r. 3 of the First Schedule to the Arbitration Act, 1940: whether the period of four months for making the award runs from entering on the reference or from a subsequent notice to act given after expiry of four months from entering on the reference.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "r. 3 of the First Schedule to the Act provides for alternative periods within which arbitrators have to make their award, that under the second alternative an award could be made within 4 months from the date of notice issued by a party calling upon the arbitrators to act, and that, as in the present case the notice to act was given by the appellant to the arbitrators on August 31, 1950, the award made by them on October 3, 1950, was within the time prescribed.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "r. 3 First Schedule, Arbitration Act 1940"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The award was not given within the time fixed by law.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "r. 3 First Schedule, Arbitration Act 1940"
    },
    {
      "id": "ra2",
      "text": "An arbitrator can act even after four months, though the award cannot be filed without getting an extension of time from the court.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 3 of the Act makes the period prescribed in the First Schedule for making an award a term of the arbitration agreement. Rule 3 of the First Schedule to the Act is couched in a mandatory form and it imposes a duty on the arbitrators to make their award within one or other of the three alternative periods mentioned therein.",
      "addresses_issue": "i1",
      "key_observation": "r.3 imposes mandatory time limits."
    },
    {
      "id": "cr2",
      "text": "The words 'entering on the reference' in the first clause and 'to act' in the second clause are not synonymous; 'act' is more comprehensive than 'enter on the reference'.",
      "addresses_issue": "i1",
      "key_observation": "Distinction between the phrases, citing Baring Gould case."
    },
    {
      "id": "cr3",
      "text": "A wide construction without limitation would defeat the purpose of r.3, which is to prescribe a time limit in the interest of expeditious disposal. Notice to act can only be given if arbitrator is legally bound to act; after 4 months from entering on reference, cannot.",
      "addresses_issue": "i1",
      "key_observation": "Limitation on second alternative to prevent indefinite extension."
    },
    {
      "id": "cr4",
      "text": "The second alternative in r. 3 can be invoked only where notice to act given before arbitrators entered on reference or after entering but before 4 months expired. Legal position: notice before or after entry, but if after entry within 4 months, award within 4 months from notice.",
      "addresses_issue": "i1",
      "key_observation": "Formulated legal position in points (a)-(d)."
    },
    {
      "id": "cr5",
      "text": "In present case, notice given long after expiry of 4 months from entering on reference, so arbitrators could no longer act; should have applied for extension under s.28.",
      "addresses_issue": "i1",
      "key_observation": "Notice invalid as post-4 months."
    },
    {
      "id": "cr6",
      "text": "Raghubar Dayal J. (concurring): Period runs from entering on reference; subsequent notice does not restart period. Unilateral notice cannot extend time indefinitely.",
      "addresses_issue": "i1",
      "key_observation": "No fresh start from subsequent notice; citing Baring Gould."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Notice to act given after expiry of four months from entering on the reference does not revive the arbitrators' authority to make award within four months from such notice; proper course is to seek extension under s.28.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Baring Gould Sharpington Combined Pick and Shovel Syndicate",
      "citation": "1899 2 Ch. D. 80",
      "treatment": "followed",
      "relevance": "Distinction between 'called on to act' and 'enter on the reference'; notice to appoint umpire is 'act'."
    },
    {
      "case_name": "Sardar Mal Hardat Rai v. Sheo Bakhsh Rai Sri Narain",
      "citation": "1922 I.L.R. 44 All. 432",
      "treatment": "referred",
      "relevance": "Two clauses alternative; if entered on reference, time from that date."
    }
  ],
  "statutes_cited": [
    {
      "name": "Arbitration Act, 1940",
      "sections": [
        "Section 3",
        "Section 14(2)",
        "Section 17",
        "Section 28",
        "Rule 3 of First Schedule"
      ],
      "relevance": "Implied terms of arbitration agreement; time limits for award; filing and enforcement of award; court extension of time."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed with costs, upholding the High Court's decision that the award was made after expiry of the limitation period under r.3 First Schedule to the Arbitration Act, 1940.",
    "relief_granted": null,
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "\"The word act is certainly more comprehensive than the words enter on the reference.\"",
      "speaker": "court",
      "significance": "Key distinction in interpreting r.3 alternatives."
    },
    {
      "text": "\"A party can ask the arbitrator to act if he is legally bound to act under the reference. If after the expiry of four months from the date of entering on the reference an arbitrator can no longer act, a notice given thereafter cannot ask him to act.\"",
      "speaker": "court",
      "significance": "Limits scope of second alternative in r.3."
    },
    {
      "text": "\"If they are called on to act as arbitrators, it must mean that they are called on to do an act as arbitrators... Being called on to do anything as an arbitrator is being called on to act.\"",
      "speaker": "court",
      "significance": "Quote from Baring Gould case explaining 'to act'."
    }
  ],
  "_case_id": "1961_56",
  "_label": 0,
  "_text_length": 19871,
  "_extracted_at": "2026-02-10T19:30:38.591483"
}