{
  "metadata": {
    "case_name": "Salig Ram v. Munshi Ram",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Pedigree: Heman had sons Karori, Laghi, Maghi, Jai Dayal (issueless), Gobind, Ata, Nanak Chand, Santu. Nanak Chand had sons Hans Raj and Salig Ram. Hans Raj had son Munshi Ram (natural father). Munshi Ram adopted by Ata.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Munshi Ram adopted by Ata in 1918 before death of natural father Hans Raj in 1920.",
      "type": "material",
      "date": "1918",
      "source": "admitted"
    },
    {
      "id": "f3",
      "text": "Hans Raj predeceased natural grandfather Nanak Chand who died in 1939.",
      "type": "material",
      "date": "1939",
      "source": "admitted"
    },
    {
      "id": "f4",
      "text": "Munshi Ram brought suit for possession of one-half share of property left by natural grandfather Nanak Chand as heir according to Zamindara custom. Parties are Brahmins claiming joint possession.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Suit resisted by Salig Ram, other son of Nanak Chand, claiming Munshi Ram not entitled per personal law or Riwaj-i-am of Amritsar district.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Trial court decreed suit for Munshi Ram. Appeal to District Judge dismissed. Second appeal to Punjab High Court dismissed. Special leave granted by Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "No dispute about property of Santu; appeal concerns only property of Nanak Chand.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Hans Raj never succeeded to property of Nanak Chand.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Munshi Ram, adopted by Ata before Hans Raj's death, is entitled to one-half share in property of natural grandfather Nanak Chand per Zamindara custom of Brahmins in Amritsar district, despite presence of uncle Salig Ram.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Hindu law applies in first instance or custom at variance must be proved; what is the precise Zamindara custom regarding adopted son's inheritance rights in natural family.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether principle of representation allows Munshi Ram to step into shoes of predeceased father Hans Raj for succession to Nanak Chand's property.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Munshi Ram not entitled to share in Nanak Chand's property either according to personal law or Riwaj-i-am of Amritsar district.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5"
      ],
      "legal_basis": "Hindu law; Riwaj-i-am of Amritsar district (1865)"
    },
    {
      "id": "pa2",
      "text": "Para 48 of Rattigan's Digest only mentions general Punjab custom; Riwaj-i-am of Amritsar prevails as specific.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Rattigan's Digest para 48; Riwaj-i-am Amritsar"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Entitled to one-half share as heir of Nanak Chand per Zamindara custom; adoption by Ata during lifetime of Hans Raj but retains rights in natural family per para 48 Rattigan.",
      "supporting_facts": [
        "f1",
        "f2",
        "f4"
      ],
      "legal_basis": "Zamindara custom; Rattigan's Digest para 48"
    },
    {
      "id": "ra2",
      "text": "Succeeds on principle of representation, stepping into shoes of Hans Raj who would have succeeded if alive.",
      "supporting_facts": [
        "f3",
        "f8"
      ],
      "legal_basis": "Principle of representation"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under Punjab Laws Act s.5, Hindu law applies first to Hindus; custom at variance must be proved by party asserting it. No presumption for custom.",
      "addresses_issue": "i2",
      "key_observation": "Quantum of proof small for general custom, larger for special."
    },
    {
      "id": "cr2",
      "text": "Adoption per custom during Hans Raj lifetime severs rights in natural family unless dvyamushyayana (not claimed); under Hindu law, no right to Nanak Chand's property.",
      "addresses_issue": "i1",
      "key_observation": "Munshi Ram claims custom overrides."
    },
    {
      "id": "cr3",
      "text": "Para 48 Rattigan: Adopted heir ordinarily does not lose right to natural family as against collaterals but does not succeed in presence of natural brothers.",
      "addresses_issue": "i2",
      "key_observation": "Applies to adoption."
    },
    {
      "id": "cr4",
      "text": "Riwaj-i-am Amritsar 1865: Adopted son not sharer among brothers in natural father's property. Presumption of correctness; prevails over general custom for Brahmins (no females affected).",
      "addresses_issue": "i2",
      "key_observation": "Confused entries but Brahmins statements support succession only if no brothers."
    },
    {
      "id": "cr5",
      "text": "Claim not to Hans Raj's property (where custom might favor as no other son) but to Nanak Chand's; Hans Raj never succeeded.",
      "addresses_issue": "i1",
      "key_observation": "No direct succession."
    },
    {
      "id": "cr6",
      "text": "Principle of representation: Munshi Ram deemed Hans Raj at Nanak Chand's death; then Nanak Chand leaves two sons (Salig Ram and deemed Hans Raj/Munshi Ram); but adopted away with brother present, excluded even under para 48.",
      "addresses_issue": "i3",
      "key_observation": "Representation fully worked out excludes Munshi Ram."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Neither under Hindu law nor Zamindara custom (para 48 Rattigan or Amritsar Riwaj-i-am) can Munshi Ram succeed to Nanak Chand's property.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Among Brahmins of Amritsar, adopted son succeeds to natural father's property only if no other son.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Principle of representation deems Munshi Ram as Hans Raj, but with brother Salig Ram, excluded.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Daya Ram v. Sohel Singh",
      "citation": "1906 P.R. No. 110",
      "treatment": "followed",
      "relevance": "Person asserting custom must prove it governs over personal law."
    },
    {
      "case_name": "Abdul Hussein Khan v. Bibi Sona Dero",
      "citation": "1917 L.R. 45 I.A. 10",
      "treatment": "approved",
      "relevance": "Approved observations on proof of custom under Punjab Laws Act s.5."
    },
    {
      "case_name": "Ujagar Singh v. Mst. Jeo",
      "citation": "1959 Supp. 2 S.C.R. 781",
      "treatment": "followed",
      "relevance": "Hindu law applies first; custom must be proved."
    },
    {
      "case_name": "Jai Kaur v. Sher Singh",
      "citation": null,
      "treatment": "followed",
      "relevance": "Presumption of correctness for Riwaj-i-am entries over general custom."
    },
    {
      "case_name": "Mt. Subhani v. Nawab",
      "citation": null,
      "treatment": "referred",
      "relevance": "Weak presumption for Riwaj-i-am adversely affecting females; not applicable here."
    },
    {
      "case_name": "Majja Singh v. Ram Singh",
      "citation": "1879 P.R. No. 43",
      "treatment": "distinguished",
      "relevance": "Jats, not Brahmins; only son case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Punjab Laws Act, No. IV of 1872",
      "sections": [
        "Section 5 (clauses a, b)"
      ],
      "relevance": "Rule of decision: Custom if proved and not contrary to justice; else Hindu law for Hindus."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; decrees of courts below set aside; suit of plaintiff-respondent Munshi Ram dismissed so far as property of Nanak Chand is concerned.",
    "relief_granted": "Dismissal of suit regarding Nanak Chand's property",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"where the parties are Hindus, the Hindu law would apply in the first instance and whosoever asserts a custom at variance with the Hindu law shall have to prove it\"",
      "speaker": "court",
      "significance": "Establishes presumption for Hindu law over custom."
    },
    {
      "text": "\"An heir appointed in the manner above described ordinarily does not thereby lose his right to succeed to property in his natural family, as against collaterals, but does not succeed in the presence of his natural brothers.\"",
      "speaker": "court",
      "significance": "Quotes para 48 Rattigan's Digest on adoption effect."
    },
    {
      "text": "\"if Munshi Ram is to succeed by the application of the principle of representation it would follow that Munshi Ram would really be deemed to be Hans Raj at the time of the death of Nanak Chand.\"",
      "speaker": "court",
      "significance": "Rejects partial application of representation principle."
    },
    {
      "text": "\"neither under Hindu law nor under the custom recorded in para. 48 can Munshi Ram succeed to the property of Nanak Chand.\"",
      "speaker": "court",
      "significance": "Core holding."
    }
  ],
  "_case_id": "1961_193",
  "_label": 1,
  "_text_length": 12867,
  "_extracted_at": "2026-02-10T19:32:10.202949"
}