{
  "metadata": {
    "case_name": "Appellants v. Respondents Nos. 4 to 9",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Civil Appeal No. 457/58",
    "date_of_judgment": "1961-05-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellants and their father Nand Singh were displaced persons from West Pakistan and got allotment of some land in the village Raikot, District Ludhiana on a temporary basis.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Each of the appellants 1 to 3 was allotted 8-1/3 standard acres of land on a quasi-permanent basis in village Raikot.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Nand Singh was entitled to 41 standard acres and 7 units, temporarily allotted in Raikot, but allotted the same acreage in village Hambran, 25 or 30 miles from Raikot.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Nand Singh made an application for revising the order allotting him land in Hambran; he died in 1951 during pendency; appellants as legal representatives continued the application, which was rejected.",
      "type": "procedural",
      "date": "1951",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Revision against rejection was rejected on ground that after July 22, 1952, Additional Custodian not competent to cancel allotment except on grounds in r.14(6).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Respondents 4 to 9 owned lands in Chak No. 127, G.B. Jaranwala, District Lyallpur; displaced persons; allotted certain lands in village Karodian as quasi-permanent allottees.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Revenue papers from Pakistan showed respondents 4 to 9 entitled to urban allotment; Deputy Commissioner (Deputy Custodian) cancelled their Karodian allotment in 1952 and proposed allotment to others.",
      "type": "material",
      "date": "1952",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant No. 2, Gopal Singh, on behalf of father Nand Singh, applied to Director of Relief and Rehabilitation (Additional Custodian) to shift Nand Singh's allotment from Hambran to Karodian.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Additional Custodian shifted Nand Singh's allotment to Karodian and also shifted appellants 1 to 3's allotments from Raikot to Karodian, consolidating family lands; appellants obtained possession.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Respondents 4 to 9 allotted urban lands, more valuable and superior quality.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Respondents 4 to 9 did not prefer application for review of cancellation or Additional Custodian's order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Six months later, respondents 4 to 9 applied to Additional Custodian to shift back to Karodian, claiming Pakistan land rural; did not make appellants parties.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Additional Custodian held he could not cancel appellants' allotment under r.14(6); recommended to Custodian General by memo dated October 14, 1953.",
      "type": "procedural",
      "date": "1953-10-14",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Deputy Custodian General sent back case, observing restoration would cause chain of cancellations; Custodian General also incompetent post r.14(6).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Additional Custodian then heard and dismissed respondents' application on merits.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Respondents 4 to 9 preferred revision before Custodian General; Deputy Custodian General granted it, set aside appellants' allotment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Appellants moved Punjab High Court under Art. 226; single Judge dismissed petition.",
      "type": "procedural",
      "date": "1956-09-12",
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "Letters Patent Appeal No. 38 of 1955 dismissed by Division Bench.",
      "type": "procedural",
      "date": "1956-09-12",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Notification No. R.0.1290 dated July 22, 1952 amended r.14(6) of Administration of Evacuee Property Rules, 1950, limiting cancellation of quasi-permanent rural evacuee property allotments.",
      "type": "background",
      "date": "1952-07-22",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "During hearing, note of approach by Speaker of Punjab Assembly to Deputy Custodian General on behalf of respondents; High Court report exonerated both.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether after July 22, 1952 the Custodian of Evacuee Property in the State of Punjab or the Custodian General hearing an appeal from an order made by the Custodian after July 22, 1952 has the power to cancel an allotment of rural evacuee property on a quasi-permanent basis except upon the grounds set out in r.14(6) of the Administration of Evacuee Property Rules, 1950 as amended by Notification No. R.0.1290 dated July 22, 1952.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "After July 22, 1952, Additional Custodian not competent to cancel quasi-permanent allotment except on grounds in r.14(6); this applies to Custodian General on revision.",
      "supporting_facts": [
        "f5",
        "f13",
        "f14",
        "f16"
      ],
      "legal_basis": "r.14(6) Administration of Evacuee Property Rules, 1950 as amended July 22, 1952"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Allotment to respondents 4-9 wrongly cancelled; duty of Custodian to restore lands; r.14(6) does not preclude Deputy Custodian General from exercising powers under s.27 of Administration of Evacuee Property Act to cancel post-July 22, 1952 allotment.",
      "supporting_facts": [
        "f7",
        "f12"
      ],
      "legal_basis": "s.27 Administration of Evacuee Property Act; inherent power for restitution"
    },
    {
      "id": "ra2",
      "text": "r.14(6) only precludes cancellation of pre-amendment allotments except on specified grounds; does not bar cancellation of post-July 22, 1952 allotments.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "language of r.14(6); second proviso to r.14(6); s.10 Administration of Evacuee Property Act"
    },
    {
      "id": "ra3",
      "text": "Appellants' allotment bad as based on invalid cancellation of respondents' allotment contravening r.14(6).",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Amended r.14(6) places limitation on Custodian's power to cancel quasi-permanent rural evacuee property allotments post-July 22, 1952; only on specified grounds; restitution not within exceptions, abrogating any inherent power.",
      "addresses_issue": "i1",
      "key_observation": "Power to rectify wrong must exist or be conferred; here restricted by statute."
    },
    {
      "id": "cr2",
      "text": "Custodian General under s.27 can only correct legality/propriety within what lower authority permitted; cannot do what prohibited.",
      "addresses_issue": "i1",
      "key_observation": "Limitations of r.14(6) bind Custodian General."
    },
    {
      "id": "cr3",
      "text": "r.14(6) applies to all allotments post-amendment; no justification for restricting to pre-amendment allotments; s.10 powers subject to rules.",
      "addresses_issue": "i1",
      "key_observation": "Plain language of sub-rule; proviso clarifies pre-1952 revisions only."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Post July 22, 1952, Custodian or Custodian General lacks power to cancel quasi-permanent rural evacuee property allotment except on grounds in r.14(6); High Court erred in holding otherwise.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Administration of Evacuee Property Act",
      "sections": [
        "s.10",
        "s.26",
        "s.27",
        "s.56(2)(i)"
      ],
      "relevance": "s.27 empowers Custodian General to review legality/propriety but subject to rules; s.10 powers subject to rules; s.56 enables rules on cancellation"
    },
    {
      "name": "Administration of Evacuee Property Rules, 1950",
      "sections": [
        "r.14(6)"
      ],
      "relevance": "Amended July 22, 1952 limits cancellation of quasi-permanent rural allotments to specified grounds"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.133(1)(c)",
        "Art.226"
      ],
      "relevance": "Basis for appeal and High Court petition"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed with costs; orders of Punjab High Court (single Judge and Division Bench) and Deputy Custodian General quashed.",
    "relief_granted": "Quashing of orders cancelling appellants' allotment; restoration of status quo in their favour.",
    "costs": "Costs awarded to appellants"
  },
  "key_quotes": [
    {
      "text": "The amended sub-rule has placed a limitation on the powers of the Custodian to cancel allotment of rural evacuee property on a quasi-permanent basis. The result is that an allotment of such land can be cancelled only in the circumstances specified in that sub-rule.",
      "speaker": "court",
      "significance": "Core holding on effect of r.14(6) amendment"
    },
    {
      "text": "He has no power to do something which the Custodian or District Judge could not have done or was prohibited from doing.",
      "speaker": "court",
      "significance": "Limits Custodian General's revisional power under s.27"
    },
    {
      "text": "We do not find any justification for placing such a restricted interpretation upon the plain language of the Sub-rule.",
      "speaker": "court",
      "significance": "Rejects respondents' interpretation of r.14(6)"
    }
  ],
  "_case_id": "1961_141",
  "_label": 1,
  "_text_length": 14394,
  "_extracted_at": "2026-02-10T19:31:17.630709"
}