{
  "metadata": {
    "case_name": "Defendant No. 12 (Appellant) v. Defendants 1-11 (Respondents)",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Civil Appeal No. 36 of 1958",
    "date_of_judgment": "1961-04-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "A suit for partition was filed against defendants 1 to 10 and 12, members of a joint family.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Defendant number 1 was father of the appellant, who was then a minor.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Defendant number 11 was an outsider, he being a partner in the partnership shop of the family.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Parties other than defendant number 11 referred the matters in difference to an arbitrator.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The arbitrator filed the award in Court on February 18, 1948.",
      "type": "procedural",
      "date": "1948-02-18",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On February 21, 1948, the Civil Judge adjourned the matter for parties say to the arbitrators report, to March 22, 1948.",
      "type": "procedural",
      "date": "1948-02-21",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On March 16, 1948, an application was presented on behalf of defendant number 1 praying that certain papers and documents be called for from the arbitrator.",
      "type": "procedural",
      "date": "1948-03-16",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On March 22, 1948, an application was presented on behalf of defendant number 1 praying for 15 days time for going through the papers and documents which he had asked the arbitrator to send to the Court and to intimate his say regarding the arbitrators award. The Court granted the request.",
      "type": "procedural",
      "date": "1948-03-22",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Defendant number 1 filed his say about the arbitrators report on April 2, 1948.",
      "type": "procedural",
      "date": "1948-04-02",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Defendant number 1 withdrew his contentions on March 31, 1949.",
      "type": "procedural",
      "date": "1949-03-31",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Neither the objections filed on April 2, nor the other applications purported to have been filed on behalf of defendant number 12.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On February 17, 1948, defendant number 1 filed an application stating that an arbitrator is to be appointed and it is impossible for him to put forth proper contentions, requesting cancellation of his appointment as guardian of the minor defendant 12 and appointment of his mother Dhondavvabai as guardian.",
      "type": "procedural",
      "date": "1948-02-17",
      "source": "defendant_1"
    },
    {
      "id": "f13",
      "text": "His resignation from guardianship was accepted on April 13, 1948.",
      "type": "procedural",
      "date": "1948-04-13",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Dhondavvabai, the mother of the minor defendant number 12, was appointed guardian on June 16, 1948.",
      "type": "procedural",
      "date": "1948-06-16",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On September 5, 1948, a summons purporting to be for settlement of issues, was served on her.",
      "type": "procedural",
      "date": "1948-09-05",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "On September 7, 1948, she applied for, and was granted, one months time for submitting the written statement with regard to the claim and the award.",
      "type": "procedural",
      "date": "1948-09-07",
      "source": "guardian"
    },
    {
      "id": "f17",
      "text": "On October 7, 1948, she applied for, and was granted, another one months time for the same purpose.",
      "type": "procedural",
      "date": "1948-10-07",
      "source": "guardian"
    },
    {
      "id": "f18",
      "text": "On November 9, 1948, she filed a written statement on behalf of defendant number 12, with regard to the suit and the award, questioning the validity of the award and praying that it be declared null and void.",
      "type": "procedural",
      "date": "1948-11-09",
      "source": "guardian"
    },
    {
      "id": "f19",
      "text": "On August 24, 1949, the Civil Judge ordered that the award be filed, that a decree be drawn up in terms of the award and that the decree should further contain the terms as to the Bombay shop run in partnership with defendant number 11.",
      "type": "procedural",
      "date": "1949-08-24",
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "Civil Judge noted that none of the parties except defendant number 1 put in any objections to the award, that defendant number 1 filed his objections beyond the period of limitation and subsequently withdrew them and that the objections filed by the guardian-ad-litem of defendant number 12 on November 9, 1948, was also filed beyond the period of limitation.",
      "type": "procedural",
      "date": "1949-08-24",
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "Defendant number 12 appealed to the Bombay High Court, which dismissed the appeal holding that it was incompetent as the order of the Civil Judge did not amount to an order refusing to set aside an award.",
      "type": "procedural",
      "date": "1954-01-07",
      "source": "high_court"
    },
    {
      "id": "f22",
      "text": "High Court held that issue of formal notice under sub-s. 2 of s. 14 was not necessary for commencement of limitation period under Art. 158 and objections under s. 33 amounted to objections for setting aside.",
      "type": "procedural",
      "date": "1954-01-07",
      "source": "high_court"
    },
    {
      "id": "f23",
      "text": "Appeal to Supreme Court on certificate under Art. 133(1)(c) granted by Bombay High Court.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether limitation for filing an application to set aside the award began to run against the appellant-defendant number 12 from a date more than a month before November 9, 1948, when a written statement on his behalf was filed stating that the award be declared null and void.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether notice under sub-section 2 of s. 14 of the Arbitration Act of the filing of the award requires a notice in writing or oral intimation to pleaders suffices.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the order of the Civil Judge amounted to an order refusing to set aside the award and therefore appealable to the High Court under s. 39(1)(vi) of the Arbitration Act.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether the objection that the award was illegal and without jurisdiction because the arbitrator included property not within his authority should be considered.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No notice in writing was issued by the Court to the appellant or his guardian intimating that the award has been filed in Court. Therefore, the period of limitation never began to run against him. There could be no date of service of notice when no notice had been issued.",
      "supporting_facts": [
        "f5",
        "f14",
        "f15",
        "f18"
      ],
      "legal_basis": "Art. 158 Limitation Act; s.14(2) Arbitration Act"
    },
    {
      "id": "pa2",
      "text": "The objection filed on November 9, 1948 was within limitation.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": "Art. 158 Limitation Act"
    },
    {
      "id": "pa3",
      "text": "The award was illegal and without jurisdiction as arbitrator included property not within scope of authority.",
      "supporting_facts": [
        "f19"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Limitation began to run from February 21, 1948, the date on which the Court adjourned the case for parties say to March 22, 1948, and in any case from September 7, 1948, when his guardian applied for time after receiving summons.",
      "supporting_facts": [
        "f6",
        "f16"
      ],
      "legal_basis": "Art. 158 Limitation Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Notice under s.14(2) Arbitration Act need not be in writing; oral communication of filing to pleaders suffices as notice to parties per O.III r.5 CPC. Intimation given on Feb 21, 1948 to pleaders present.",
      "addresses_issue": "i1",
      "key_observation": "The expression 'give notice' means giving intimation; notice to pleader is notice to party."
    },
    {
      "id": "cr2",
      "text": "Even if notice on Sept 7, 1948, objection on Nov 9 beyond 30 days.",
      "addresses_issue": "i1",
      "key_observation": "Objection filed beyond limitation."
    },
    {
      "id": "cr3",
      "text": "No party filed timely objection praying for setting aside; hence Civil Judge's order not a refusal to set aside, no appeal lies under s.39(1)(vi).",
      "addresses_issue": "i3",
      "key_observation": "High Court correctly held appeal incompetent."
    },
    {
      "id": "cr4",
      "text": "Jurisdiction objection not pressed before trial court, cannot be raised in appeal.",
      "addresses_issue": "i4",
      "key_observation": "Presumed given up."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Intimation to pleaders on February 21, 1948 amounted to service of notice of filing award; objection on November 9, 1948 barred by limitation under Art.158.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Civil Judge's order not refusing to set aside award as no timely objection filed; appeal to High Court incompetent.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Objection on award's jurisdiction not entertainable as not pressed in trial court.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Arbitration Act, 1940",
      "sections": [
        "s.14(1)",
        "s.14(2)",
        "s.33",
        "s.39(1)(vi)",
        "s.42"
      ],
      "relevance": "Governing filing of award, notice, objections, appeals; notice under s.14(2) need not be written."
    },
    {
      "name": "Limitation Act",
      "sections": [
        "Art. 158 First Schedule"
      ],
      "relevance": "30-day limitation from date of service of notice of filing award."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 133(1)(c)"
      ],
      "relevance": "Basis for certificate granting appeal to Supreme Court."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "O. III r. 5"
      ],
      "relevance": "Notice to pleader deemed notice to party."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court agreed with Bombay High Court that objections to award were time-barred, no proper notice of refusal to set aside award for appealability, and jurisdiction objection not pressed; appeal dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The notice which the Court is to give to the parties of the filing of the award need not be a notice in writing. The notice can be given orally.",
      "speaker": "court",
      "significance": "Core holding on nature of notice under s.14(2) Arbitration Act."
    },
    {
      "text": "Notice to the counsel of the filing of the award means or amounts to notice to the party.",
      "speaker": "court",
      "significance": "Relies on CPC O.III r.5 for deeming notice."
    },
    {
      "text": "To construe the expression as meaning only a written notice served formally on the party... will stultify the whole object which underlies the process of arbitration - the speedy decision of a dispute.",
      "speaker": "court",
      "significance": "Policy reason against requiring formal written notice."
    }
  ],
  "_case_id": "1961_196",
  "_label": 0,
  "_text_length": 13901,
  "_extracted_at": "2026-02-10T19:32:49.675482"
}