{
  "metadata": {
    "case_name": "Collector of Customs, Baroda v. Digvijavasinhji Spinning and Weaving Mills Ltd., Jamnagar",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Criminal Appeal No. 74 of 1960",
    "date_of_judgment": "1961-04-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent imported 275 cases of secondhand looms under one consignment and 175 cases of second-hand textile waste to plant machinery under another consignment from Pondicherry.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent held licences for import of goods of a lesser value than the value of these consignments.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Collector of Customs, Baroda, ordered the said goods to be confiscated under s. 167(8) of the Sea Customs Act, 1878, and in lieu of confiscation an option was given to the respondent to pay a fine of Rs. 22,918 and Rs. 16,000 in respect of the two consignments.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On the ground that the respondent had understated the value of the goods imported under the first consignment, the Collector imposed a penalty of Rs. 500 under s. 167(37)(c) of the Act.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Against the said order, the respondent preferred two appeals to the Central Board of Revenue and the said Board by its order dated January 15, 1954, set aside the orders of the Collector and instead imposed a penalty of Rs. 22,918 in regard to the first consignment and Rs. 16,000 in regard to the other under s. 167(8) of the Act but the penalty of Rs. 500 was however maintained.",
      "type": "procedural",
      "date": "1954-01-15",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In revision the Government of India modified the order of the Central Board of Revenue by cancelling the penalty of Rs. 500 and in other respects it confirmed the order of the said Board.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The respondent cleared the goods on executing a bond in favour of the appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "As the respondent did not pay the penalty, the appellant, acting under s. 193 of the Act, notified the default in writing to the First Class Magistrate at Jamnagar so that the penalty might be recovered in the manner prescribed by the said section as if the said penalty was a fine inflicted by the Magistrate himself.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On the said requisition the Magistrate issued warrants of attachment against the respondent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The respondent filed a petition before the Magistrate for the cancellation of the said warrants on the ground that the order of the Central Board of Revenue was illegal and also on the ground that the appellant had no jurisdiction to take action under s. 193 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The Magistrate, by his order dated May 8, 1956, held that the appellant could validly realize the said amounts under the machinery provided under s. 193 of the Act.",
      "type": "procedural",
      "date": "1956-05-08",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Against the said order of the Magistrate the respondent preferred an appeal to the Sessions Judge, Halar, Jamnagar, but it was later converted into a revision and was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On revision to the Bombay High Court at Rajkot against that order, the High Court by judgment and order dated August 8, 1957, held that as the penalty was imposed by the Central Board of Revenue, the appellant could not realize the said amounts under s. 193 of the Act; it also expressed an opinion that the final order of the appellate authority was without jurisdiction as it was not shown that consent of the owner of the goods ordered to be confiscated had been obtained by the Central Board of Revenue before the order commuting the confiscation to penalty was passed; set aside and cancelled the warrants of attachment issued by the Magistrate.",
      "type": "procedural",
      "date": "1957-08-08",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order of the Central Board of Revenue imposing penalty in substitution of that of an officer of Customs could be enforced by the latter officer under s. 193 of the Sea Customs Act, 1878.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Chief Customs Authority (Central Board of Revenue) is an 'officer of Customs' within the meaning of s. 193 of the Act.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the Central Board of Revenue obtained the consent of the owner of the goods before commuting confiscation to penalty under s. 190 of the Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "s. 193 of the Act should be liberally construed with a view to effectuate the intention of the legislature and if so construed the order of the Central Board of Revenue made in substitution of that of an officer of Customs could be enforced by the latter officer under the said section.",
      "supporting_facts": [
        "f5",
        "f6",
        "f8"
      ],
      "legal_basis": "s. 193 Sea Customs Act, 1878"
    },
    {
      "id": "pa2",
      "text": "An order made by the Chief Customs Authority imposing a penalty shall be deemed in law to be an order made by the original authority, that is, the Collector of Customs and, therefore, the said order for the purpose of enforcement shall be treated as the order of the Collector of Customs.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Principle that appeal is continuation of original proceedings"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Central Board of Revenue was not an officer of Customs within the meaning of s. 193 of the Act and therefore its order could not be enforced under the said section by an officer of Customs.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "s. 193, s. 3, s. 182 Sea Customs Act, 1878"
    },
    {
      "id": "ra2",
      "text": "Even if the Board, being the Chief Customs Authority, could be considered to be an officer of Customs within the meaning of those words, the said Chief Customs Authority only could enforce the said order and not the Collector of Customs.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s. 193 Sea Customs Act, 1878"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under the Act the goods, whose importation or exportation is prohibited or restricted by the provisions of the Act, are liable to be confiscated and also the person concerned is liable to a penalty; the Collector of Customs can make an order confiscating the said goods as well as imposing a penalty on the person concerned; in an appeal against that order, the Chief Customs Authority can modify the said order, but it has no power to increase the burden.",
      "addresses_issue": "i1",
      "key_observation": "Scheme of the Act shows no scope for realization of any penalty imposed for the first time by the Chief Customs Authority."
    },
    {
      "id": "cr2",
      "text": "Section 182 of the Act enumerates the different officers of Customs who are empowered to adjudge a question of penalty, but the Chief Customs Authority is not included in that list; s. 3(a) of the Act defines Chief Customs-authority to mean the Central Board of Revenue, which is a statutory authority and it is inappropriate to call it an officer of Customs; it would be more in accord with the scheme of the Act to construe the words 'an officer of Customs' as an officer of the Customs who is authorized to adjudicate in the first instance on the question of confiscation, increased rate of duty or penalty under s. 182 of the Act.",
      "addresses_issue": "i2",
      "key_observation": "Chief Customs Authority is not an 'officer of Customs' within the meaning of s. 193."
    },
    {
      "id": "cr3",
      "text": "In the absence of any statutory fiction, it is not permissible to treat the order made by one authority as that made by another authority; the order of the Chief Customs Authority imposing a penalty for the first time cannot be treated to be an order of the Collector of Customs within the meaning of s. 193 of the Act.",
      "addresses_issue": "i1",
      "key_observation": "Principle that appeal is continuation does not make appellate order deemed as original authority's order."
    },
    {
      "id": "cr4",
      "text": "The Chief Customs Authority has power under s. 190 of the Act to commute the order of confiscation to a penalty not exceeding the value of the goods confiscated, subject to obtaining consent of the owner; the order dated January 15, 1954, does not ex facie show that it was made under s. 190 with consent; in the absence of any evidence, it has not been established that the Chief Customs Authority made its order under s. 190 of the Act with the consent of the respondent.",
      "addresses_issue": "i3",
      "key_observation": "No proof of consent for commutation under s. 190."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Chief Customs Authority (Central Board of Revenue) is not an 'officer of Customs' who has adjudged a penalty within the meaning of s. 193 of the Sea Customs Act, 1878, and therefore the Collector of Customs cannot enforce the penalty imposed by the Board under s. 193.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The order of the Chief Customs Authority dated January 15, 1954, purporting to impose penalty under s. 167(8) does not establish fulfilment of the condition of consent under s. 190 for commutation of confiscation to penalty.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rangaswamy v. Alagayammal",
      "citation": "A.I.R. 1915 Mad. 1133",
      "treatment": "referred",
      "relevance": "Principle that appeal is continuation of suit."
    },
    {
      "case_name": "Kristnamachariar v. Mangammal",
      "citation": "1902 I.L.R. 26 Mad. 91, 95-96",
      "treatment": "referred",
      "relevance": "Principle that appeal is continuation of suit."
    },
    {
      "case_name": "Lachmeshwar Prasad Shukul v. Keshwar Lal Chaudhuri",
      "citation": "1940 F.C.R. 84",
      "treatment": "referred",
      "relevance": "Principle that appeal is continuation of suit, but distinguished as not making appellate order deemed original authority's."
    }
  ],
  "statutes_cited": [
    {
      "name": "Sea Customs Act, 1878",
      "sections": [
        "s. 3",
        "s. 19",
        "s. 167(8)",
        "s. 167(37)(c)",
        "s. 182",
        "s. 183",
        "s. 188",
        "s. 190",
        "s. 190A",
        "s. 191",
        "s. 193"
      ],
      "relevance": "Governs importation restrictions, confiscation, penalties, appeals, revisions, commutation, and enforcement of penalties; key issue on interpretation of s. 193 and whether Board is 'officer of customs'; s. 190 requires consent for commutation."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Bombay High Court's order setting aside the warrants of attachment, holding that the penalty imposed by the Central Board of Revenue could not be enforced by the Collector under s. 193 as the Board is not an 'officer of customs', and there was no evidence of consent under s. 190 for commutation; this does not preclude the State from establishing consent in appropriate proceedings.",
    "relief_granted": "Warrants of attachment set aside and cancelled.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is one of the well established rules of construction that if the words of a statute are in themselves precise and unambiguous no more is necessary than to expound those words in their natural and ordinary sense, the words themselves in such case best declaring the intention of the legislature.",
      "speaker": "court",
      "significance": "Principle of statutory construction applied to interpret s. 193."
    },
    {
      "text": "Where alternative constructions are equally open that alternative is to be chosen which will be consistent with the smooth working of the system which the statute purports to be regulating and that alternative is to be rejected which will introduce uncertainty, friction or confusion into the working of the system.",
      "speaker": "court",
      "significance": "Principle guiding construction of s. 193 in light of Act's scheme."
    },
    {
      "id": "kq3",
      "text": "In the absence of any statutory fiction giving rise to that result, it is not permissible to treat the order made by one authority as that made by another authority.",
      "speaker": "court",
      "significance": "Rejects deeming Board's order as Collector's for enforcement under s. 193."
    }
  ],
  "_case_id": "1961_129",
  "_label": 0,
  "_text_length": 17951,
  "_extracted_at": "2026-02-10T19:31:20.589017"
}