{
  "metadata": {
    "case_name": "Petitioner (Dealer) v. Sales Tax Assessing Authority",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "SARKAR, J."
    ],
    "case_number": "Writ Petition No. 120 of 1959",
    "date_of_judgment": "1961-04-07"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The petitioner is a dealer registered under the Punjab General Sales Tax Act.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The petitioner filed returns of his sale turnovers for the four quarters of the financial year ending on March 31, 1955, and for the four quarters of the financial year ending on March 31, 1956.",
      "type": "admitted",
      "date": "1955-03-31",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "In respect of each year the Sales Tax Assessing Officer served three successive notices on him on March 7, 1958, April 4, 1958, and August 18, 1959, requiring him to attend with the documents and other evidence in support of his returns.",
      "type": "procedural",
      "date": "1958-03-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In the last notice on August 18, 1959, it was stated that on failure to produce the documents and other evidence mentioned, the case would be decided on best judgment assessment basis.",
      "type": "procedural",
      "date": "1959-08-18",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The petitioner did not comply with any of the notices.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "After the receipt of the last notice, the petitioner presented this petition under Art. 32 of the Constitution challenging the right of the authorities to make a best judgment assessment.",
      "type": "procedural",
      "date": "1959-08-18",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The assessing officer had not proceeded to make any assessment on the petitioner at the date of any of the notices.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Under r. 20 of the rules, a registered dealer like the petitioner had to furnish returns quarterly. The rules define return period as the period for which returns are prescribed to be furnished by a dealer.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Sales Tax authorities had the right to proceed to make a best judgment assessment after the three years within which such assessment could be made had expired.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "At the date of the last notice (August 18, 1959), the Sales Tax authorities had no right to proceed to make any best judgment assessment as the three years within which only such assessment could be made had expired before then.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": "s. 11(4) of the Punjab General Sales Tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The learned counsel for the respondent frankly conceded that he found it difficult to contend to the contrary.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sub-section 4 of s. 11 deals with the case of a dealer who has furnished returns and fails to comply with notice to produce evidence; the Assessing Authority shall within three years after the expiry of such period, proceed to assess to the best of his judgment the amount of the tax due.",
      "addresses_issue": "i1",
      "key_observation": "The contention of the petitioner is well founded."
    },
    {
      "id": "cr2",
      "text": "The three years have to be counted from the expiry of the period in respect of which returns had been furnished, which for the petitioner refers to the quarters (return periods under r. 20).",
      "addresses_issue": "i1",
      "key_observation": "The last quarter ended on March 31, 1956, so authority could not proceed after March 31, 1959."
    },
    {
      "id": "cr3",
      "text": "The notices given on August 18, 1959, that best judgment assessments would be made in respect of quarters constituting the financial years 1955 and 1956 were futile as no such assessments could be made after March 31, 1959.",
      "addresses_issue": "i1",
      "key_observation": "The power cannot be exercised after the three years have gone by."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Assessing Authority cannot make a best judgment assessment under s. 11(4) after three years from the expiry of the relevant return period (quarter).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Punjab General Sales Tax Act",
      "sections": [
        "s. 11(1)",
        "s. 11(2)",
        "s. 11(4)",
        "s. 10(3)"
      ],
      "relevance": "Governs assessment procedure based on returns, notices for evidence, and time limit for best judgment assessment."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 32"
      ],
      "relevance": "Basis for writ petition for enforcement of Fundamental Rights."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The petition is allowed. A writ will issue restraining the respondent from making any best judgment assessment on the petitioner for sales tax for any quarter of the financial years 1955 and 1956.",
    "relief_granted": "Writ restraining best judgment assessment for quarters of financial years 1955 and 1956.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It seems to us that the contention of the petitioner is well founded.",
      "speaker": "court",
      "significance": "Court agrees with petitioner's interpretation of limitation period."
    },
    {
      "text": "The three years have to be counted from the expiry of the period mentioned... that is the period in respect of which returns had been furnished by the dealer.",
      "speaker": "court",
      "significance": "Key reasoning on computation of limitation period under s.11(4)."
    },
    {
      "text": "The notices given on August 18, 1959... were futile. No such assessments could be made in respect of any of these quarters after March 31, 1959.",
      "speaker": "court",
      "significance": "Direct holding invalidating the notices."
    }
  ],
  "_case_id": "1961_324",
  "_label": 1,
  "_text_length": 6337,
  "_extracted_at": "2026-02-10T19:33:57.263582"
}