{
  "metadata": {
    "case_name": "State of Punjab v. Barkat Ram",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J.",
      "J. L. Kapur, J.",
      "T. K. Subba Rao, J."
    ],
    "case_number": "Criminal Appeal No. 45 of 1959",
    "date_of_judgment": "1961-08-30"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Barkat Ram was the engine driver of 78 Down Train which reached Amritsar at about 4-15 P.M. on June 8, 1957. The train came from Pakistan.",
      "type": "background",
      "date": "1957-06-08",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In consequence of information received with respect to the smuggling of gold by the engine crew, the Land Customs staff boarded the engine at Atari and other staff surrounded the engine on its arrival at Amritsar.",
      "type": "procedural",
      "date": "1957-06-08",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "The engine was searched and a quantity of gold was recovered, having been found lying concealed underneath the coal in the front part of the coal tender in the engine.",
      "type": "material",
      "date": "1957-06-08",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "The respondent was further interrogated at the Customs Station and, as a result of further search, another quantity of gold was recovered from the rear part of the coal tender.",
      "type": "material",
      "date": "1957-06-08",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "A document, Ex. P.E., dated June 5, 1957, was recovered. This document was shown to the respondent on June 9, 1957, and the respondent inscribed on this document Ex. P. D1 to the effect 'the letter is the same which Tawaqual Shah had given to me yesterday. The same to be delivered to Ghulam Mohd. who has come from Pakistan and has stayed at Grand Hotel.'",
      "type": "material",
      "date": "1957-06-05",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "On June 9, 1957, Barkat Ram made statement Ex. P.K. to Manohar Singh Bedi, Inspector of Customs, stating: 'As usual on the 8th June, 1957, I took two bundles of Indian Currency from Ghulam Mohd. at Amritsar to Pakistan and when I brought 65 bars of gold from Tawakal Shah, from Pakistan, the Customs Officers recovered these 65 bars of gold from the engine at the Railway Station, Amritsar. I had kept concealed these 65 bars of gold in the engine in the presence of Shri Ram Murti and Shri Jagan Nath, my two Firemen, at the Loco Shed, Lahore. I was to deliver this gold to Ghulam Mohd. at Amritsar.'",
      "type": "material",
      "date": "1957-06-09",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "A second statement Ex. P.G. was made to the same Customs Inspector on June 17, 1957, similar to the first, adding that he was to get Rs. 200 against the delivery of gold.",
      "type": "material",
      "date": "1957-06-17",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "On the complaint of the Assistant Collector of Land Customs, Amritsar, Barkat Ram tried for offences punishable under s. 23(1) of the Foreign Exchange Regulation Act, 1947, and under s. 167(81) of the Sea Customs Act, 1878, as amended in 1955.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "He was convicted by the Magistrate. The conviction was confirmed by the appellate Court (Additional Sessions Judge, Amritsar).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The conviction was set aside on revision by the Punjab High Court in Criminal Revision No. 599 of 1958, judgment dated October 9, 1958, holding Customs Officers were police officers u/s 25 Evidence Act, confessional statements inadmissible, no other evidence, and s.27 not applicable.",
      "type": "procedural",
      "date": "1958-10-09",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Superintendent, Land Customs, Amritsar, received information that some gold would be smuggled from Pakistan to India by the engine crew of the train coming to Amritsar from Lahore that evening.",
      "type": "background",
      "date": "1957-06-08",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "On enquiry by Customs officials, the engine crew stated that 100 tolas of gold was kept hidden underneath the coal in the tender of the engine.",
      "type": "material",
      "date": "1957-06-08",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "After recovering the gold, Barkat Ram was arrested and taken to Customs office for interrogation. On interrogation, disclosed gold for delivery to Ghulam Mohd.",
      "type": "material",
      "date": "1957-06-08",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Two days later Ghulam Mohd. was also arrested at Amritsar. During the enquiry, Barkat Ram and Ghulam Mohd. made statements before Customs officials admitting guilt.",
      "type": "material",
      "date": "1957-06-10",
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a Customs Officer, either under the Land Customs Act, 1924 or under the Sea Customs Act, 1878, is a police officer within the meaning of that expression in s. 25 of the Indian Evidence Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether s. 27 of the Evidence Act applies to the facts of the case.",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Customs Officers to whom confessional statements were made were not police officers within the meaning of s. 25 Evidence Act. Mere conferment of powers to arrest, search, record evidence for contraventions does not make them police officers, even if powers of Officer-in-charge of Police Station under CrPC Ch. XIV conferred.",
      "supporting_facts": [
        "f3",
        "f4",
        "f6",
        "f7"
      ],
      "legal_basis": "s. 25 Indian Evidence Act; Land Customs Act s.9; Sea Customs Act"
    },
    {
      "id": "pa2",
      "text": "Duties and powers of Customs Officers differ from police: for revenue protection, preventing smuggling, not crime prevention/detection generally.",
      "supporting_facts": [
        "f2",
        "f8"
      ],
      "legal_basis": "Police Act 1861 ss.20,23,25; Sea Customs Act preamble, s.167, s.182"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Officers on whom powers of police are conferred are really police officers, nomenclature irrelevant.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "s. 25 Indian Evidence Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Police duties for prevention/detection of crime, maintaining law/order (Police Act). Customs Officers for levy/realisation of duties, preventing smuggling, revenue protection. Powers limited, different character.",
      "addresses_issue": "i1",
      "key_observation": "Powers of Customs Officers not for crime prevention but revenue safeguarding."
    },
    {
      "id": "cr2",
      "text": "Customs Officers not members of police force. Expression 'police officer' in s.25 not so wide as to include those with some similar powers. Object of s.25 to exclude confessions to regular police due to past malpractices.",
      "addresses_issue": "i1",
      "key_observation": "Legislature did not intend to include future agencies for smuggling detection."
    },
    {
      "id": "cr3",
      "text": "Sea Customs Act distinguishes police officers (ss.180,184). Customs enquiries judicial (s.171A). Incongruous if confessional statements usable by Customs but inadmissible in court.",
      "addresses_issue": "i1",
      "key_observation": "Customs Officers act judicially in some proceedings."
    },
    {
      "id": "cr4",
      "text": "Dissent (Subba Rao J.): Customs Officers exercise police powers/duties for prevention/detection of offences under Act (ss.169,170A,171,171A,173,178). Nomenclature irrelevant; substance matters. Test: officer with substantially police powers/duties is police officer u/s.25.",
      "addresses_issue": "i1",
      "key_observation": "Reasons for excluding police confessions apply equally to Customs Officers."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Customs Officers are not police officers within the meaning of s.25 Indian Evidence Act.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Confessional statements to Customs Officers admissible. Conviction legal.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Maqbool Hussain's Case",
      "citation": "1953 S.C.R. 730",
      "treatment": "followed",
      "relevance": "Powers of Customs for levy of duties, not criminal; reference to Magistrate for warrants."
    },
    {
      "case_name": "Thomas Dana v. State of Punjab",
      "citation": "1959 Supp. 1 S.C.R. 274",
      "treatment": "followed",
      "relevance": "Customs proceedings revenue nature, limited powers, not criminal court."
    },
    {
      "case_name": "R. v. Hurribole",
      "citation": "1876 I.L.R. 1 Cal. 207",
      "treatment": "referred",
      "relevance": "'Police officer' in wide/popular sense, not narrow."
    },
    {
      "case_name": "Ameen Sharif v. Emperor",
      "citation": "1934 I.L.R. 61 Cal. 607",
      "treatment": "distinguished",
      "relevance": "Officers exercising police powers only when doing so are police officers."
    },
    {
      "case_name": "Leo Roy Frey v. Superintendent, District Jail, Amritsar",
      "citation": "1958 S.C.R. 822",
      "treatment": "followed",
      "relevance": "Customs Officers act judicially."
    },
    {
      "case_name": "Shewpujanrai Indrasanrai Ltd. v. Collector of Customs",
      "citation": "1959 S.C.R. 821",
      "treatment": "followed",
      "relevance": "Customs Officers act judicially."
    },
    {
      "case_name": "Nanoo v. Emperor",
      "citation": "1927 I.L.R. 51 Bom. 78",
      "treatment": "referred",
      "relevance": "Abkari officers with police powers are police officers."
    },
    {
      "case_name": "Public Prosecutor v. Paramasivam",
      "citation": "A.I.R. 1953 Mad. 91",
      "treatment": "referred",
      "relevance": "Excise officer with police powers is police officer."
    },
    {
      "case_name": "Radha Kishun Marwari v. King Emperor",
      "citation": "1932 I.L.R. 12 Pat. 46",
      "treatment": "doubted",
      "relevance": "Excise officer not police officer; too narrow view."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Evidence Act, 1872",
      "sections": [
        "Section 25",
        "Section 27"
      ],
      "relevance": "Confessions to police officers inadmissible; whether Customs Officers are police officers."
    },
    {
      "name": "Land Customs Act, 1924",
      "sections": [
        "Section 9(1)"
      ],
      "relevance": "Applies Sea Customs Act provisions for land customs levy."
    },
    {
      "name": "Sea Customs Act, 1878",
      "sections": [
        "Sections 167 to 193",
        "Section 167(81)",
        "Section 169",
        "Section 170A",
        "Section 171",
        "Section 171A",
        "Section 173",
        "Section 178",
        "Section 180",
        "Section 182",
        "Section 184"
      ],
      "relevance": "Offences, powers of search, arrest, summon for smuggling prevention/detection; distinguishes police."
    },
    {
      "name": "Foreign Exchange Regulation Act, 1947",
      "sections": [
        "Section 23(1)"
      ],
      "relevance": "Offence for which convicted."
    },
    {
      "name": "Police Act, 1861",
      "sections": [
        "Section 1",
        "Sections 17,18,20,21,22,23,25"
      ],
      "relevance": "Defines police, duties for crime prevention/detection."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "Chapter XIV",
        "Section 5(2)"
      ],
      "relevance": "Powers of Officer-in-charge of Police Station; subject to special Acts."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed by majority. Order of acquittal set aside. Conviction and sentence under s.23(1) FERA 1947 and s.167(81) Sea Customs Act restored. No opinion on officers with CrPC Ch.XIV powers.",
    "relief_granted": "Restoration of conviction by Magistrate confirmed by Sessions Judge",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We are of opinion that the contention for the appellant is sound and that the Customs Officers are not police officers within the meaning of that term in s. 25 of the Evidence Act.",
      "speaker": "court",
      "significance": "Majority holding on main issue."
    },
    {
      "text": "The powers of customs officers are really not for such purpose. Their powers are for the purpose of checking the smuggling of goods and the due realisation of customs duties...",
      "speaker": "court",
      "significance": "Distinguishes duties of Customs vs Police."
    },
    {
      "text": "A police officer within the meaning of s. 25 of the Evidence Act may be defined thus: An officer, by whatever designation he is called, on whom a statute substantially confers the powers and imposes the duties of the police is a police officer within the meaning of s. 25 of the Evidence Act.",
      "speaker": "court",
      "significance": "Dissenting judge's test for 'police officer'."
    }
  ],
  "_case_id": "1961_388",
  "_label": 1,
  "_text_length": 52785,
  "_extracted_at": "2026-02-10T19:35:21.999319"
}