{
  "metadata": {
    "case_name": "National Cement Mines Industries Ltd. v. Commissioner of Income-tax",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 84 of 1958",
    "date_of_judgment": "1961-01-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are a public limited company incorporated to carry on the business of cement and lime manufacture, limestone supply, acquire rights and concessions pertaining to limestone, coal and surface lands, work mines or quarries, deal with clay and bauxite.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Karanpura Company obtained three leases on November 29, 1930: first for mining limestone from Maharaja Pratap Narain Udai Nath Shah Deo in certain villages in Dewarkhand; second from Maharaj Kumar Nand Kishore Nath Shah Deo for surface rights; third from Maharaj Kumar Raj Kishore Nath Shah Deo for surface rights in Hoyer village. Each for 30 years.",
      "type": "material",
      "date": "1930-11-29",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On March 17, 1932, Karanpura Company conveyed rights and options under the three leases to the appellants.",
      "type": "material",
      "date": "1932-03-17",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On September 30, 1934, appellants acquired limestone and surface rights in village Umedanda for 95 years from Maharaja Pratap Narain Uday Nath Shah Deo and Maharaj Kumar Raj Kishore Nath Shah Deo.",
      "type": "material",
      "date": "1934-09-30",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On September 30, 1934, appellants entered bauxite option agreement with Maharaja Pratap Narain Uday Nath Shah Deo for first option on bauxite deposits in certain villages.",
      "type": "material",
      "date": "1934-09-30",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On September 30, 1934, appellants entered agreement with Maharaja Pratap Narain Uday Nath Shah Deo for first option on limestone beds in Tori District.",
      "type": "material",
      "date": "1934-09-30",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "By agreement dated September 30, 1934, between Karanpura Company, Maharaja Pratap Narain Udai Nath Shah Deo (with consent of Maharaj Kumars), royalties under original deeds of November 29, 1930 reduced and periods extended to 99 years from original date.",
      "type": "material",
      "date": "1934-09-30",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "By deed dated May 7, 1935, appellants conveyed to Dewarkhand Cement Company Ltd. (later Associated Cement Ltd.) benefits of four leases and two agreements for unexpired periods, for Rs. 25,000 present consideration plus covenants.",
      "type": "material",
      "date": "1935-05-07",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In year of account June 1, 1944 to May 31, 1945, appellants received Rs. 77,820 from Associated Cement Ltd. under first covenant of deed (0-13 As. per ton of cement manufactured from limestone won from lands and sold).",
      "type": "material",
      "date": "1944-06-01 to 1945-05-31",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Income-tax Officer included Rs. 77,820 in appellants' total assessable income for assessment year 1946-47.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Order of Income-tax Officer confirmed by Appellate Assistant Commissioner and Income-tax Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Tribunal referred question to Calcutta High Court: Whether on proper construction of Deed of Assignment dated May 7, 1935, and facts, Tribunal right in holding Rs. 77,820 revenue receipt assessable.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f13",
      "text": "Calcutta High Court judgment and order dated December 22/23, 1955 in I.T.R. No. 24 of 1953.",
      "type": "procedural",
      "date": "1955-12-22/23",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appellants' principal objects include carrying business of manufacturing cement/lime, sale of limestone; authorised to sell/lease/dispose property; acquired Karanpura rights, obtained extensions, transferred to Associated Cement Ltd.; carrying on business in 1944-45.",
      "type": "admitted",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f15",
      "text": "Deed of May 7, 1935 includes covenants by Associated Cement Ltd.: pay 13 annas per ton cement sold from limestone won; restrictions on selling fluxstone below price; pay half profit on fluxstone sales; pay half royalty from TISCO; minimum payments; pay rents/royalties/indemnify; not use stone/clay for lime; not prejudice leases; etc.",
      "type": "material",
      "date": "1935-05-07",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on proper construction of Deed of Assignment dated May 7, 1935, and facts, the sum of Rs. 77,820 represented a receipt of revenue nature assessable as such.",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Receipt under clause 1 of deed dated May 7, 1935 is capital payment.",
      "supporting_facts": [
        "f8",
        "f9",
        "f15"
      ],
      "legal_basis": "Minister of National Revenue v. Catherine Spooner; Trustees of Earl Haig v. Commissioners of Inland Revenue; Nethersole v. Withers; Commissioners of Inland Revenue v. Marine Steam Turbine Co. Ltd."
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Transaction not outright sale, lease, or joint venture; appellants did not part with all rights; consideration fixed Rs.25,000 plus annual payments fluctuating with business; numerous restrictions on transferee; commercial transaction sharing profits of Associated Cement Ltd.'s activities.",
      "addresses_issue": "i1",
      "key_observation": "Inability to categorise definitively irrelevant; assess commercial nature: capital repayment vs revenue; guided by principles distinguishing capital/revenue receipts."
    },
    {
      "id": "cr2",
      "text": "Cited cases on capital: instalment repayments on property sale not taxable; annuities for definite period taxable; share of profits/royalties/mineral rights/sales percentages taxable as income.",
      "addresses_issue": "i1",
      "key_observation": "Name given by parties irrelevant; determine from contract terms and circumstances."
    },
    {
      "id": "cr3",
      "text": "Distinguished appellant cases: Spooner was sale with uncertainty; Haig exhausted asset; Nethersole lump sum for copyright sale; Turbine not business.",
      "addresses_issue": "i1",
      "key_observation": "Appellants did not sell entirety; retained rights; commercial profit-sharing."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The receipt is of revenue nature, taxable as income.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Foley v. Fletcher",
      "citation": "1858 3 H. N. 769",
      "treatment": "followed",
      "relevance": "Instalments of purchase price on property sale are capital, not taxable."
    },
    {
      "case_name": "Secretary of State in Council of India v. Andrew Scoble",
      "citation": "1903 A.C. 299",
      "treatment": "followed",
      "relevance": "Instalments of purchase price capital."
    },
    {
      "case_name": "Oswald v. Kirkcaldy Magistrates",
      "citation": "1919 S.C. 147",
      "treatment": "followed",
      "relevance": "Instalments capital."
    },
    {
      "case_name": "Commissioners of Inland Revenue v. Ramsay",
      "citation": "1935 20 T.C. 79",
      "treatment": "followed",
      "relevance": "Instalments capital."
    },
    {
      "case_name": "State of Bihar v. Sir Kameshwar Singh",
      "citation": "1952 21 I.T.R. 382",
      "treatment": "followed",
      "relevance": "Annuity for definite period taxable."
    },
    {
      "case_name": "Captain Maharajkumar Gopal Saran v. Commissioner of Income-tax",
      "citation": "1935 3 I.T.R. 237 P.C.",
      "treatment": "followed",
      "relevance": "Annuity taxable."
    },
    {
      "case_name": "Chadwick v. Pearl Life Assurance Co.",
      "citation": "1905 2 K.B. 507",
      "treatment": "followed",
      "relevance": "Annuity taxable."
    },
    {
      "case_name": "William John Jones v. Commissioners of Inland Revenue",
      "citation": "1919 7 T.C. 310",
      "treatment": "followed",
      "relevance": "Share of profits taxable."
    },
    {
      "case_name": "Raja Bahadur Kamakshya Narain Singh v. Commissioner of Income-tax",
      "citation": "1943 L.R. 70 I.A. 180",
      "treatment": "followed",
      "relevance": "Mineral royalty taxable."
    },
    {
      "case_name": "Commissioners of Inland Revenue v. 36149 Holdings Ltd.",
      "citation": "1943 25 T.C. 173",
      "treatment": "followed",
      "relevance": "Percentage on sales taxable."
    },
    {
      "case_name": "Delage v. Nugget Polish Co. Ltd.",
      "citation": "1906 2 Times Law Reports 454",
      "treatment": "followed",
      "relevance": "Percentage of gross profits taxable."
    },
    {
      "case_name": "Minister of National Revenue v. Catherine Spooner",
      "citation": "1933 A.C. 684",
      "treatment": "distinguished",
      "relevance": "Oil payments part of sale price due to uncertainty; capital."
    },
    {
      "case_name": "Trustees of Earl Haig v. Commissioners of Inland Revenue",
      "citation": "1939 22 T.C. 725",
      "treatment": "distinguished",
      "relevance": "Share of royalties for using diaries exhausted asset; capital."
    },
    {
      "case_name": "Nethersole v. Withers",
      "citation": "1948 28 T.C. 501",
      "treatment": "distinguished",
      "relevance": "Lump sum for film rights on copyright; capital."
    },
    {
      "case_name": "Commissioners of Inland Revenue v. Marine Steam Turbine Co. Ltd.",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "No trade/business; not assessable."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "s. 3"
      ],
      "relevance": "Determines assessability of receipts as annual profits/gains."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court held the receipt of Rs. 77,820 as revenue in nature, assessable to tax, upholding the Tribunal and High Court.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The distinction between a capital receipt and revenue receipt though fine is real.",
      "speaker": "court",
      "significance": "Core principle for distinguishing taxability."
    },
    {
      "text": "It is not the nature of the receipt under the general law but in commerce that is material.",
      "speaker": "court",
      "significance": "Focus on commercial character for income-tax."
    },
    {
      "text": "The transaction was substantially a commercial transaction for sharing the profits of the commercial activities of the Associated Cement Ltd.",
      "speaker": "court",
      "significance": "Conclusion on revenue nature."
    }
  ],
  "_case_id": "1961_380",
  "_label": 0,
  "_text_length": 23287,
  "_extracted_at": "2026-02-10T19:35:29.771703"
}