{
  "metadata": {
    "case_name": "Garment Cleaning Works, Bombay v. Workmen",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 621 of 1960",
    "date_of_judgment": "1961-04-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Two demands made by the respondents, the workmen of the appellant company, the Garment Cleaning Works, Bombay, were referred for industrial adjudication to the industrial tribunal under s. 10 of the Industrial Disputes Act, XIV of 1947. These demands were for gratuity and provident fund respectively.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The tribunal has framed a gratuity scheme and has passed an order that the appellant should draw up a scheme of provident fund on the lines of the model provident fund scheme drawn by the Government under the Employees Provident Funds Act, 1952 (XIX of 1952), with a rate of company contribution of 6 1/4 per cent. of total wages.",
      "type": "material",
      "date": "1960-01-15",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Appeal by special leave from the Award dated January 15, 1960, of the Industrial Tribunal, Bombay, in Reference No. 94 of 1959.",
      "type": "procedural",
      "date": "1960-01-15",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Clause ii(a) of the gratuity scheme provides that on retirement or resignation of a workman after ten years service ten days consolidated wages for each years service should be awarded as gratuity.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Clause iv of the gratuity scheme provides that if a workman is dismissed or discharged for misconduct causing financial loss to the works gratuity to the extent of the loss should not be paid to the workman concerned.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Clause v of the gratuity scheme provides that for calculating years of service the entire service of the workmen should be taken into account.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "When the appellant produced its balance-sheet and other relevant papers it claimed privilege under s. 21 of the Industrial Disputes Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The Tribunal observed that the appellant has made good profits, its future is assured, it has capacity to build up adequate reserves.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the gratuity scheme framed by the Tribunal is valid, particularly regarding industry-cum-region basis, Clause ii(a) (10 years service for resignation gratuity), Clause iv (forfeiture for misconduct causing financial loss), and Clause v (service calculation).",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Tribunal properly assessed the appellant's financial capacity before directing a provident fund scheme on the lines of the model scheme under the Employees Provident Funds Act at 6 1/4% contribution.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The problem of starting gratuity scheme should have been considered on an industry-cum-region basis.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Bharatkhand Textile Mfg. Co. Ltd. Ors. v. The Textile Labour Association, Ahmedabad (1960) 3 S.C.R. 329"
    },
    {
      "id": "pa2",
      "text": "No gratuity should be admissible under Clause ii(a) until fifteen years service on resignation.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Express Newspapers Private Ltd. Anr. v. The Union of India Ors. (1959) S.C.R. 12, 154; s.5(1)(a)(iii) Working Journalists Conditions of Service and Miscellaneous Provisions Act, 1955"
    },
    {
      "id": "pa3",
      "text": "Clause iv is inconsistent with principles of gratuity as retrial benefit based on long and meritorious service; misconduct disqualifies claim, analogous to retrenchment benefit and provident fund rules.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "s.2(oo) Industrial Disputes Act; Rule 71 Employees Provident Funds Scheme Rules"
    },
    {
      "id": "pa4",
      "text": "Service in Clauses i, ii, iii, v refers to continuous service.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Tribunal did not properly assess financial obligation and capacity; has no reserve, borrowed large loans; remand requested waiving s.21 privilege.",
      "supporting_facts": [
        "f2",
        "f7",
        "f8"
      ],
      "legal_basis": "s.21 Industrial Disputes Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Position not disputed that service referred to in clauses i, ii and iii refers to continuous service.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Industry-cum-region basis is permissible but not mandatory; unit basis common and valid. Bharatkhands case does not support contention.",
      "addresses_issue": "i1",
      "key_observation": "It is one thing to hold that the gratuity scheme can in a proper case be framed on industry-cum-region basis, and another thing to say that industry-cum-region basis is the only basis."
    },
    {
      "id": "cr2",
      "text": "Clause ii(a) with 10 years minimum not unreasonable; Express Newspapers observation not rule of universal application.",
      "addresses_issue": "i1",
      "key_observation": "The observation was not intended to lay down a rule of universal application in regard to all gratuity schemes."
    },
    {
      "id": "cr3",
      "text": "Clause iv valid; gratuity earned for service rendered, not gratuitous; forfeiture only to extent of financial loss caused by misconduct reasonable, as in recent tribunal awards.",
      "addresses_issue": "i1",
      "key_observation": "If gratuity is earned by an employee for long and meritorious service it is difficult to understand why the benefit thus earned... should not be available to the employee even though... guilty of misconduct which entails his dismissal."
    },
    {
      "id": "cr4",
      "text": "Clarify that service in clauses i, ii, iii refers to continuous service.",
      "addresses_issue": "i1",
      "key_observation": "We would accordingly make it clear that the service referred to in clauses i, ii and iii refers to continuous service."
    },
    {
      "id": "cr5",
      "text": "Tribunal justified in not discussing figures due to s.21 privilege claim; no basis to interfere or remand as appellant chose privilege.",
      "addresses_issue": "i2",
      "key_observation": "If the appellant wanted the tribunal to consider the figures and state its conclusions... it need not have claimed privilege under s. 21 at the trial."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Gratuity scheme upheld as valid, with clarification that service in clauses i, ii, iii is continuous.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Direction for provident fund scheme on model lines upheld; no interference.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bharatkhand Textile Mfg. Co. Ltd. Ors. v. The Textile Labour Association, Ahmedabad",
      "citation": "1960 3 S.C.R. 329",
      "treatment": "distinguished",
      "relevance": "Does not mandate industry-cum-region basis for gratuity schemes; holds it permissible but not exclusive."
    },
    {
      "case_name": "Express Newspapers Private Ltd. Anr. v. The Union of India Ors.",
      "citation": "1959 S.C.R. 12, 154",
      "treatment": "distinguished",
      "relevance": "Observation on 15 years service not binding rule for all gratuity schemes."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 10",
        "s. 2(oo)",
        "s. 21"
      ],
      "relevance": "Referral for adjudication; definition of retrenchment; privilege for financial documents."
    },
    {
      "name": "Employees Provident Funds Act, 1952",
      "sections": [],
      "relevance": "Model provident fund scheme to be followed; Rule 71 of Scheme Rules for deductions on misconduct."
    },
    {
      "name": "Working Journalists Conditions of Service and Miscellaneous Provisions Act, 1955",
      "sections": [
        "s. 5(1)(a)(iii)"
      ],
      "relevance": "Provision struck down as unconstitutional; incidental observation on gratuity."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal challenging the Industrial Tribunal's gratuity scheme and direction for provident fund scheme is dismissed. Gratuity scheme upheld with clarification on continuous service. No interference with provident fund direction due to privilege claim.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is one thing to hold that the gratuity scheme can in a proper case be framed on industry-cum-region basis, and another thing to say that industry-cum-region basis is the only basis on which gratuity scheme can be framed.",
      "speaker": "court",
      "significance": "Rejects mandatory industry-cum-region basis for gratuity."
    },
    {
      "text": "Gratuity is not paid to the employee gratuitously or merely as a matter of boon. It is paid to him for the service rendered by him to the employer, and when it is once earned it is difficult to understand why it should necessarily be denied to him whatever may be the nature of misconduct for his dismissal.",
      "speaker": "court",
      "significance": "Justifies gratuity as earned benefit not wholly forfeited for misconduct."
    }
  ],
  "_case_id": "1961_243",
  "_label": 0,
  "_text_length": 12320,
  "_extracted_at": "2026-02-10T19:33:27.898606"
}