{
  "metadata": {
    "case_name": "Indore Iron and Steel Registered Stock-holders Association Private Ltd. v. State of Madhya Bharat",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeals Nos. 509 and 510 of 1960",
    "date_of_judgment": "1961-07-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a registered Association whose constituent members carry on business generally in fabricated iron and steel material and more particularly in iron sheets, plain or corrugated, bars, rods, light and heavy structurals, nails, joints, wire nails and all kinds and varieties of wire, and pipes at Indore and Ratlam.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The State of Madhya Bharat, by its Act No. 30 of 1950, imposed sales tax in the territory of Madhya Bharat on the sales of goods therein specified with effect from May 1, 1950.",
      "type": "material",
      "date": "1950-05-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Under Act No. 30 of 1950, the Commissioner of Sales Tax, Madhya Bharat, and the Sales Tax Officer, Indore, were appointed authorities for the assessment of tax leviable under the Act and for its recovery.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Section 3 of the Act is the charging section providing for the incidence of taxation.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Section 4(2) provides that no tax shall be payable under the Act on the sale of goods specified in the second column of Sch. 1 on conditions mentioned in column 3. Iron and steel appears in Sch. 1 as item 39.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Section 5 prescribes the rate of tax recoverable as notified by Government, not less than 1/2 per cent or more than 6 per cent.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Section 4(3) authorises Government by notification to modify Sch. 1 from time to time. Section 5(2) authorises Government to notify goods and point of sale for tax.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On May 22, 1950, a notification was issued under s. 5(2) specifying articles taxed, stage of sale, and rate. Item 27 dealt with goods manufactured from metals except gold and silver or from more than one metal except circles and sheets of copper, brass and aluminium. Tax at Rs. 3-2-0 per cent payable by producer or importer.",
      "type": "material",
      "date": "1950-05-22",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Article 286(3) of the Constitution came into force.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Parliament passed Act 52 of 1952 (Essential Goods Declaration and Regulation of Tax on Sale or Purchase Act) on August 9, 1952. Section 2 declares goods in Schedule essential for life of community, item 14: iron and steel.",
      "type": "material",
      "date": "1952-08-09",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On October 24, 1953, State issued two notifications: first provided no tax on sale of iron and steel (item 39 in Schedule). Second notification item 9: every kind of metal excluding iron, steel, gold and silver, and goods prepared from any metal other than gold and silver, utensils and wires etc., excluding circles and sheets of copper, brass and aluminium.",
      "type": "material",
      "date": "1953-10-24",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "It is common ground that under the October 24, 1953 notification, articles dealt in by constituents of appellant are liable to sales tax.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appellant wrote to Sales Tax Officer claiming exemption from sales tax for goods dealt in by its constituent members, plea rejected, members called upon to pay sales tax on individual turnover.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Appellant filed two writ petitions under Art. 226 in High Court of Madhya Bharat at Indore: Civil Misc. Cases Nos. 26 of 1954 and 48 of 1955, challenging validity of assessment orders for 1953-54 and 1954-55.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appellant's case in High Court: articles covered by parliamentary declaration in s.2 of Act 52/1952, no longer liable to sales tax.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Respondents resisted: notification of October 24, 1953 valid, item 27 brings articles within Sales Tax Act.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f17",
      "text": "High Court upheld respondents' plea, rejected appellant's contentions, dismissed writ petitions on October 26, 1956.",
      "type": "procedural",
      "date": "1956-10-26",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Present appeals to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the words 'iron and steel' in s.2 of Act 52 of 1952 include articles made exclusively of iron and steel in which steel merchants normally trade, as understood in commercial sense.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the impugned notification of October 24, 1953 contravenes Art. 286(3) of the Constitution in light of the parliamentary declaration under Act 52 of 1952.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Section 2 of Act 52/1952 covers iron and steel as understood in commercial sense, not narrow dictionary meaning; includes articles exclusively made from iron and steel where identity not lost, i.e., all articles made exclusively of iron and steel in which steel merchants normally trade.",
      "supporting_facts": [
        "f1",
        "f10"
      ],
      "legal_basis": "Art. 286(3); legislative history including Iron and Steel Control of Production and Distribution Order, 1941; s.2(d) s.3 Second Schedule; Essential Supplies (Temporary Powers) Act 1946 s.2(a)(vii); Essential Commodities Act 1955 s.2(a)(vi)"
    },
    {
      "id": "pa2",
      "text": "Object of Art. 286(3) is to safeguard consumer interest in essential articles; narrow meaning would not serve purpose.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Art. 286(3)"
    },
    {
      "id": "pa3",
      "text": "Articles dealt in by constituents covered by parliamentary declaration, hence exempt from sales tax under impugned notifications.",
      "supporting_facts": [
        "f1",
        "f11",
        "f12",
        "f14",
        "f15"
      ],
      "legal_basis": "s.2 Act 52/1952; Art. 286(3)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Notification of October 24, 1953 valid; item 27 in list notified brings articles in question within mischief of Sales Tax Act.",
      "supporting_facts": [
        "f8",
        "f11",
        "f12",
        "f16"
      ],
      "legal_basis": "Madhya Bharat Act 30/1950 s.5(2)"
    },
    {
      "id": "ra2",
      "text": "Words 'iron and steel' in Entry 14 Sch. to Act 52/1952 do not include articles made of iron and steel such as those concerned.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "s.2 Act 52/1952"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Even assuming arguendo that 'iron and steel' receives broad commercial interpretation contended by appellant and covers articles in question, impugned notification does not contravene Art. 286(3).",
      "addresses_issue": "i2",
      "key_observation": "Art. 286(3) invoked only if three conditions satisfied: (1) impugned law made by State Legislature post-Constitution; (2) imposes/authorises tax on goods already declared essential by Parliament pre-enactment; (3) post-Constitution."
    },
    {
      "id": "cr2",
      "text": "Act 30/1950 satisfies first condition (post-Constitution, notification under it), but not second: parliamentary declaration on Aug 9, 1952 post-dates Act 30/1950 (eff. May 1, 1950); declaration prospective, cannot retrospectively invalidate pre-existing law.",
      "addresses_issue": "i2",
      "key_observation": "Art. 286(3) contemplates pre-existing declaration at time of State law; s.3 Act 52/1952 confirms prospective operation for laws made after its commencement."
    },
    {
      "id": "cr3",
      "text": "High Court correctly held notifications outside purview of Art. 286(3) and s.3 Act 52/1952.",
      "addresses_issue": "i2",
      "key_observation": "Impugned notification consistent with Act 30/1950."
    },
    {
      "id": "cr4",
      "text": "No need to decide scope of 'iron and steel' as appellant fails on second contention.",
      "addresses_issue": "i1",
      "key_observation": "Appellant must succeed on both points for appeals to succeed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Impugned notifications do not contravene Art. 286(3); valid under Madhya Bharat Sales Tax Act 30/1950.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Art. 286(3) applies prospectively to State laws made after parliamentary declaration of essential goods.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sardar Soma Singh v. The State of Pepsu and Union of India",
      "citation": "1954 S.C.R. 955",
      "treatment": "followed",
      "relevance": "Art. 286(3) contemplates post-constitutional law; pre-commencement laws unaffected; s.3 Act 52/1952 does not affect prior ordinances."
    },
    {
      "case_name": "Firm of A. Gowrishankar v. Sales Tax Officer, Secunderabad",
      "citation": "A.I.R. 1958 S.C. 883",
      "treatment": "followed",
      "relevance": "Supports that law contemplated by Art. 286(3) must be post-Constitutional."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madhya Bharat Sales Tax Act No. 30 of 1950",
      "sections": [
        "Section 3",
        "Section 4",
        "Section 5"
      ],
      "relevance": "Imposed sales tax; delegated power to notify rates, goods, schedules; basis for impugned notifications upheld as valid."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 286(3)",
        "Article 226"
      ],
      "relevance": "Art. 286(3) restricts State tax on essential goods post-parliamentary declaration unless assented by President; not contravened here; writ under Art. 226 filed and dismissed."
    },
    {
      "name": "Essential Goods (Declaration and Regulation of Tax on Sale or Purchase) Act 52 of 1952",
      "sections": [
        "Section 2",
        "Section 3",
        "Schedule Item 14"
      ],
      "relevance": "Declares iron and steel essential; s.3 prospective, affects only State laws post its commencement."
    },
    {
      "name": "Iron and Steel (Control of Production and Distribution) Order, 1941",
      "sections": [
        "s. 2(d)",
        "s. 3",
        "Second Schedule"
      ],
      "relevance": "Cited in legislative history for broad meaning of iron and steel."
    },
    {
      "name": "Essential Supplies (Temporary Powers) Act XXIV of 1946",
      "sections": [
        "s. 2(a)(vii)"
      ],
      "relevance": "Cited in legislative history for broad meaning of iron and steel."
    },
    {
      "name": "Essential Commodities Act 10 of 1955",
      "sections": [
        "s. 2(a)(vi)"
      ],
      "relevance": "Cited in legislative history for broad meaning of iron and steel."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals are dismissed. The High Court orders upholding the validity of the sales tax notifications issued under Madhya Bharat Sales Tax Act 30 of 1950 are affirmed, as they do not contravene Art. 286(3) despite the subsequent parliamentary declaration on iron and steel.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is clear that even if we were to accept Mr. Sastri's contention in regard to the denotation of the words 'iron and steel' as used by the relevant provisions of the Act it would still have to be shown by the appellant that the impugned notification is invalid because it contravenes the provisions of Art. 286(3).\"",
      "speaker": "court",
      "significance": "Highlights that appellant must prove both coverage and contravention for success."
    },
    {
      "text": "\"Article 286(3) contemplates that if in the face of an existing parliamentary declaration about the essential character of a commodity the Legislature of a State purports to impose or authorise the imposition of a tax on such commodity the enactment would be invalid unless reserved for President and assented.\"",
      "speaker": "court",
      "significance": "Core interpretation: requires pre-existing declaration for Art. 286(3) to apply."
    },
    {
      "text": "\"This provision also shows that the declaration made by the Act was intended to be prospective in operation and it would affect laws made after the commencement of the Act.\"",
      "speaker": "court",
      "significance": "Confirms s.3 Act 52/1952 prospective; prior laws unaffected."
    }
  ],
  "_case_id": "1961_427",
  "_label": 0,
  "_text_length": 17383,
  "_extracted_at": "2026-02-10T19:36:06.672980"
}