{
  "metadata": {
    "case_name": "Commissioner of Excess Profits Tax v. Assessees (Firm carrying on business at Kurnool)",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 270 of 1960",
    "date_of_judgment": "1961-03-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessees are a firm carrying on business at Kurnool, of manufacturing ground-nut oil and cake.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Under the Madras General Sales Tax Act IX of 1939, the assessees were entitled to a rebate of sales tax paid on goods purchased by them and used in the manufacturing process.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The assessees maintained their books of account according to the Samvat Year ending with Diwali. The system of accounting was a mixture of mercantile and cash. Purchases and sales of goods on credit were duly entered in the books of account. The sales tax actually recovered by the tax authorities was debited when paid and amounts if any refunded were credited when received.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The assessees had adopted the system which was permitted by the Act of paying tax calculated on the turnover of the previous year of account. Under this system, tax was provisionally assessed by the Sales Tax Officer on the basis of the turnover of the previous year, and thereafter the liability was adjusted at the end of the year of account in the light of the actual turnover of that year, and of rebate allowed in respect of groundnuts pressed into oil.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Official year ended 31-3-1942: Provisional demand Rs. 2,679; Final demand Rs. 1,872; Refund Rs. 807.",
      "type": "material",
      "date": "1942-03-31",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Official year ended 31-3-1943: Provisional demand Rs. 3,046; Final demand Rs. 2,863; Additional levy Rs. 183.",
      "type": "material",
      "date": "1943-03-31",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Official year ended 31-3-1944: Provisional demand Rs. 14,509; Final demand Rs. 18,402; Additional levy Rs. 3,893.",
      "type": "material",
      "date": "1944-03-31",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Official year ended 31-3-1945: Provisional demand Rs. 47,276; Final demand Rs. 20,037; Additional levy Rs. 27,239.",
      "type": "material",
      "date": "1945-03-31",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Official year ended 31-3-1946: Provisional demand Rs. 45,315; Final demand Rs. 13,379; Refund Rs. 31,936.",
      "type": "material",
      "date": "1946-03-31",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "For the assessment year 1946-47 corresponding to the year of account October 18, 1944 to November 4, 1945, the assessees claimed in their assessment to income-tax to deduct Rs. 49,633 being the amount of sales-tax paid under a provisional assessment.",
      "type": "material",
      "date": "1944-10-18",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "In the year ending 31-3-1945, the assessees had paid Rs. 47,276 as sales-tax provisionally assessed. They also had paid in that year Rs. 3,894 in adjustment of the liability for the previous year towards sales-tax due. After giving credit for Rs. 1,537 received as rebate, the total sales-tax liability under the provisional assessment was Rs. 49,633.",
      "type": "material",
      "date": "1945-03-31",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The Income-tax Officer accepted this claim, and debited it from the income in the assessment year 1946-47 in assessing the taxable income of the assessees. Deduction of sales-tax actually paid under provisional assessment less rebates was permitted by the Income-tax Officer not only in the assessment year 1946-47 but also in the earlier years.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The Excess Profits Tax Officer had also adopted for the chargeable accounting period prior to October 18, 1944 the same method of computation, but for the chargeable accounting period October 18,1944 to November 4, 1945, the Excess Profits Tax Officer allowed out of the amount of Rs. 47,276 debited to sales tax only Rs. 17,055 as properly attributable to that period in computing the Excess Profits Tax liability.",
      "type": "procedural",
      "date": "1944-10-18",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "According to the Excess Profits Tax Officer, the excess amount paid under the provisional assessment i.e., Rs. 30,221 could not be taken into account, because under r. 12 of Sch. 1 of the Excess Profits Tax Act, expenditure in excess of the amount reasonable and necessary for the business was not a permissible deduction.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "In appeal against the order of the Excess Profits Tax Officer, the Tribunal affirmed the order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Against the order passed by the Tribunal confirming the order of the Excess Profits Tax Officer, the assessees applied for and obtained an order referring the following question to the High Court of Judicature of Andhra Pradesh.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The High Court answered the question in the negative by judgment and order dated February 21, 1956, in Case Reference No. 4 of 1955.",
      "type": "procedural",
      "date": "1956-02-21",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "It is manifest that the assessees had not altered the method according to which their accounts were maintained. Year after year, they were paying tax provisionally assessed by the Sales-tax Officer on the turnover of the previous year subject to adjustment at the close of the year of account.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "This system of payment of tax under provisional assessments was not adopted with a view to evade tax liability. Nor was recovery of the amounts ordered to be refunded to the assessees delayed because of any deliberate inaction on the part of the assessees. It is not found that excess tax on inflated returns was paid in anticipation of the repeal of the Excess Profits Tax Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there are materials for the Tribunal to hold that the aforesaid sales-tax payments of Rs. 30,221 were unreasonable and unnecessary having due regard to the requirements of the business and not consequently deductible under r. 12 of Sch. 1 of the Excess Profits Tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The rules relating to advance provisional assessment and levy of tax framed under the Madras General Sales Tax Act, 1939 were inconsistent with the provisions of the Act and the assessees should have raised this contention and have obtained a decision from the court before paying tax on provisional assessment and not having done so, payments made cannot be regarded as either reasonable or necessary.",
      "supporting_facts": [
        "f4",
        "f14"
      ],
      "legal_basis": "In re M. P. Kumraswami Raja [1955] 6 Sales Tax Cases 113 (Madras High Court declared scheme ultra vires)"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The assessees for reasons of convenience adopted, as they were entitled under the Madras General Sales Tax Act, a system of payment of tax on provisional assessment based on the turnover of the previous year subject to final adjustment to be made at the end of the year. The assessees could opt for the system of paying sales-tax on provisional assessment, but the liability to pay tax imposed was on that account not voluntarily incurred.",
      "addresses_issue": "i1",
      "key_observation": "This system produced no direct benefit to the business and judged in retrospect, it undoubtedly reduced the taxable income but if otherwise the payment was reasonable and necessary having regard to the requirements of the business, it was not liable to be ignored."
    },
    {
      "id": "cr2",
      "text": "The reasonableness and necessity of the expenditure sought to be deducted in assessing Excess Profits Tax liability must be adjudged in the light of commercial expediency.",
      "addresses_issue": "i1",
      "key_observation": "The payments made by the assessees were in discharge of obligation imposed lawfully and were necessary for the proper conduct of the business."
    },
    {
      "id": "cr3",
      "text": "By s. 10 of the Madras General Sales Tax Act, the assessees were obliged within 15 days from the date of service of the notice of assessment to pay tax and in default, the amount was liable to be recovered as if it were an arrear of land revenue. Again, by s. 15, if the assessees failed to submit the return as required by the provisions of the Act or the rules made thereunder or failed to pay the tax within the time prescribed, they were liable to be penalised.",
      "addresses_issue": "i1",
      "key_observation": "Payments made in satisfaction of liability which arises by virtue of the assessment made by the Sales Tax Officer cannot be called unreasonable."
    },
    {
      "id": "cr4",
      "text": "Payment of sales-tax as assessed being obligatory and necessary for the purpose of carrying on the business, it must in our opinion be deemed to satisfy the requirements of r. 12 of Sch. 1 of the Excess Profits Tax Act.",
      "addresses_issue": "i1",
      "key_observation": "The Excess Profits Tax Officer was in error in thinking that the tax paid was in excess of the requirements of the business."
    },
    {
      "id": "cr5",
      "text": "The Tribunal was in error in holding that by seeking to deduct only the tax properly attributable to the actual turnover during the chargeable accounting period, the Excess Profits Tax Officer was not seeking to disturb the method of accounting which was followed by the assessees and was accepted by the taxing authorities for many years.",
      "addresses_issue": "i1",
      "key_observation": "The Excess Profits Tax Officer was in error."
    },
    {
      "id": "cr6",
      "text": "The reasonableness or the necessity of payments under r. 12 Sch. 1 of the Excess Profits Tax Act must be ascertained in the light of what may be regarded as commercially expedient and not on any legalistic considerations.",
      "addresses_issue": "i1",
      "key_observation": "It would not be expected of a businessman to start a litigation in respect of a tax which the Legislature of the State was competent to levy on the ground that the method devised for computing the tax liability was ultra vires."
    },
    {
      "id": "cr7",
      "text": "The tax was duly assessed and paid and the reasonableness and necessity must be adjudged in the light of the circumstances then prevailing and not in the light of subsequent developments.",
      "addresses_issue": "i1",
      "key_observation": "Since the Madras High Court's decision in In re Kumaraswami Raja's case, the Madras Legislature by the Madras General Sales Tax Amendment Act VIII of 1955 retrospectively validated the levy."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Payment of sales-tax as assessed being obligatory and necessary for the purpose of carrying on the business, it must be deemed to satisfy the requirements of r. 12 of Sch. 1 of the Excess Profits Tax Act. The sales-tax payments of Rs. 30,221 were reasonable and necessary and consequently deductible.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "In re M. P. Kumraswami Raja",
      "citation": "1955 6 Sales Tax Cases 113",
      "treatment": "distinguished",
      "relevance": "Madras High Court declared scheme of taxation on provisional assessment under Madras General Sales Tax Act ultra vires, but Supreme Court holds reasonableness judged by commercial expediency at the time, not subsequent legal developments"
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras General Sales Tax Act, 1939",
      "sections": [
        "s. 10",
        "s. 15"
      ],
      "relevance": "Obliged assessees to pay provisional tax within 15 days, recoverable as land revenue arrears, with penalties for default; permitted system of provisional assessment based on previous year turnover"
    },
    {
      "name": "Excess Profits Tax Act",
      "sections": [
        "r. 12 of Sch. 1",
        "s. 21"
      ],
      "relevance": "No deduction for expenses in excess of amount reasonable and necessary for business; reasonableness judged by commercial expediency"
    },
    {
      "name": "Income-tax Act",
      "sections": [
        "s. 66A(2) and (3)"
      ],
      "relevance": "Provision for appeal to Supreme Court from High Court order on reference"
    },
    {
      "name": "Madras General Sales Tax (Amendment) Act, 1955",
      "sections": [
        "Act VIII of 1955"
      ],
      "relevance": "Retrospectively validated provisional assessments and levy of tax notwithstanding initial inconsistency between Act and Rules"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court held that the provisional sales tax payments were reasonable and necessary expenditures deductible under r. 12 Sch. 1 of the Excess Profits Tax Act, affirming the High Court's answer and dismissing the appeal by the Commissioner.",
    "relief_granted": "Deduction of Rs. 49,633 sales tax paid under provisional assessment allowed for Excess Profits Tax computation",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The reasonableness and necessity of the expenditure sought to be deducted in assessing Excess Profits Tax liability must be adjudged in the light of commercial expediency.",
      "speaker": "court",
      "significance": "Core test applied to determine deductibility under r. 12 Sch. 1"
    },
    {
      "text": "Payment of sales-tax as assessed being obligatory and necessary for the purpose of carrying on the business, it must in our opinion be deemed to satisfy the requirements of r. 12 of Sch. 1 of the Excess Profits Tax Act.",
      "speaker": "court",
      "significance": "Direct holding allowing the deduction"
    }
  ],
  "_case_id": "1961_319",
  "_label": 0,
  "_text_length": 10321,
  "_extracted_at": "2026-02-10T19:34:16.607845"
}