{
  "metadata": {
    "case_name": "Heirs of Pyare Mohan Bannerji v. Uttarpara Hitakari Sabha",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Civil Appeal No. 147 of 1958",
    "date_of_judgment": "1961-04-18"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Pyare Mohan Bannerji died in October 1874 leaving behind him considerable property.",
      "type": "background",
      "date": "1874-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Pyare Mohan Bannerji executed a will dated February 12, 1874, making various bequests, including the payment of certain amounts to the first respondent, Uttar-para Hitakari Sabha.",
      "type": "material",
      "date": "1874-02-12",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "After his death, his widow held the property for life till her death on March 25, 1945.",
      "type": "background",
      "date": "1945-03-25",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Thereafter, the property went into the possession of the appellants, who are the heirs at law of the testator.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On March 17, 1950, the first respondent, Uttarpara Hitakari Sabha filed an application in the High Court of Judicature at Allahabad under s. 10 of the Official Trustees Act (Act II of 1913) claiming that the late Pyare Mohan Bannerji had created a trust by his will and praying that an official trustee be appointed to be the trustee of the properties of the trust. This was registered as Testamentary Case No. 9 of 1950.",
      "type": "procedural",
      "date": "1950-03-17",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellants contested the claim of the Sabha and contended, inter alia, that no trust had been created by the testator and that the appellants, being the legal heirs of the testator, were entitled to succeed to the entire property left by him.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Mootham, J., who heard the said case at the first instance, held that by his last will Pyare Mohan Bannerji created a trust in favour of the Sabha, and appointed the Official Trustee a trustee of all the properties left by Pyare Mohan Bannerji specified in Schedule B to the petition.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "On appeal, a division bench of the said High Court, consisting of Malik, C. J., and Agarwala, J., agreed with Mootham, J., that the will created a trust in favour of the Sabha but held that the Sabha was entitled only to a half share in the cash and properties pertaining to the estate of the said testator, and appointed the Official Trustee as trustee only in regard to the said share.",
      "type": "procedural",
      "date": "1955-01-04",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The first respondent accepted that position, but the appellants preferred the present appeal against the judgment of the High Court in so far as it went against them.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "At present it is common case that all the relatives for whom provision was made in the will passed away, that there are no daughters of testator's nephew and that the Sabha is the only institution entitled to receive the amounts provided for under the will.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "We are, therefore, only concerned with the question whether a trust was created in favour of the first respondent or not, on the happening of the last contingency, namely, the testator leaving no children and his nephew no sons.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the will created a trust or a charge in favour of the first respondent.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under the will no trust but only a charge was created in favour of the first respondent and, therefore, the first respondent could not invoke in aid the provisions of S. 10 of the [Official Trustees] Act.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "Section 10 of the Official Trustees Act"
    },
    {
      "id": "pa2",
      "text": "The first respondent had to spend the moneys for specified objects and not the legal heirs and contended that the first respondent might be in the position of a trustee in respect of the amounts received from the legal heirs, but the legal heirs were not trustees in respect of the charity.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The late Pyare Mohan Bannerji had created a trust by his will.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Section 10 of the Official Trustees Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The concepts of trust and charge are well defined. A trust is an obligation annexed to the ownership of property, and arising out of a confidence reposed in and accepted by the owner or declared and accepted by him, for the benefit of another... Where property of one person is made security for the payment of money to another, the latter person is said to have a charge on the property.",
      "addresses_issue": "i1",
      "key_observation": "Definitions from Indian Trusts Act and distinctions cited from authorities."
    },
    {
      "id": "cr2",
      "text": "The test laid down... Where property is given to a person upon condition that he does a certain act or confers a certain benefit on another person, the condition may constitute a trust if it is directed to be, or must necessarily be, performed and satisfied out of the property... A charge does not in itself create a trust, but it may do so if it is coupled with other trusts or the context otherwise so requires.",
      "addresses_issue": "i1",
      "key_observation": "Tests from Halsbury, Sugden, cases like Wybrants and Bailey."
    },
    {
      "id": "cr3",
      "text": "A trust may be created in language sufficient to show the intention, and no technical words are necessary; the said intention must be gathered from a fair reading of the provisions of the document.",
      "addresses_issue": "i1",
      "key_observation": "Fundamental rule of construction."
    },
    {
      "id": "cr4",
      "text": "Detailed provisions of the will under different contingencies: property given to wife and nephew subject to annuities and charges; various shares to sons if born, ultimately to legal heirs subject to payment of annuities and charges, with Sabha's share increasing, up to half net income in last contingency for specified charitable purposes perpetually.",
      "addresses_issue": "i1",
      "key_observation": "On last contingency (no issue), testator more interested in charities; amount payable to Sabha or successor institution for permanent charity; legal heirs under fiduciary obligation."
    },
    {
      "id": "cr5",
      "text": "That object would not be achieved if the first respondent was placed in the position of a creditor with a charge on the property with an off chance of the charge being defeated by a bona fide purchaser... Having regard to the circumstances... the fluctuating amount the donees had to pay, the permanent nature of the charity and the declared intention of the testator to pay as much as half the net income towards the carrying out of the said charitable object, we hold that the legal heirs took the property of the testator subject to a trust rather than a charge.",
      "addresses_issue": "i1",
      "key_observation": "Trust impresses fiduciary character, especially for charity to fluctuating body."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The legal heirs took the property of the testator subject to a trust rather than a charge.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The conclusion arrived at by the High Court is correct.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioners of Charitable Donations and Bequests v. Wybrants",
      "citation": "1845 69 R.R. 278",
      "treatment": "followed",
      "relevance": "A charge may create a trust depending on the nature of the charge, especially for charities."
    },
    {
      "case_name": "Bailey v. Ekins",
      "citation": "7 Ves. 319",
      "treatment": "followed",
      "relevance": "A charge of debts is a devise of the estate pro tanto upon trust to pay the debts; powerful for charities to fluctuating body like poor of parish."
    }
  ],
  "statutes_cited": [
    {
      "name": "Official Trustees Act, 1913",
      "sections": [
        "Section 10"
      ],
      "relevance": "High Court may appoint Official Trustee if property subject to trust and no trustee willing or capable; only applicable if trust created, not charge."
    },
    {
      "name": "Indian Trusts Act",
      "sections": null,
      "relevance": "Definition of trust as obligation annexed to ownership arising out of confidence for benefit of another."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, holding that the will created a trust in favour of the Sabha for half the net income on the last contingency, affirming the High Court's appointment of the Official Trustee for that share.",
    "relief_granted": "High Court order upheld; Official Trustee as trustee for Sabha's half share.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A trust is an obligation annexed to the ownership of property, and arising out of a confidence reposed in and accepted by the owner or declared and accepted by him, for the benefit of another...",
      "speaker": "court",
      "significance": "Defines trust distinguishing from charge."
    },
    {
      "text": "We hold that the legal heirs took the property of the testator subject to a trust rather than a charge.",
      "speaker": "court",
      "significance": "Core holding resolving the main issue."
    },
    {
      "text": "It certainly is not necessary to use the word trust in order to create an express trust.",
      "speaker": "court",
      "significance": "From Wybrants; no technical words needed for trust."
    }
  ],
  "_case_id": "1961_373",
  "_label": 0,
  "_text_length": 16106,
  "_extracted_at": "2026-02-10T19:34:40.158601"
}