{
  "metadata": {
    "case_name": "M/s. Jeewanlal (1929) Ltd. v. Workmen",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dispute arose in 1950 between appellant M/s. Jeewanlal (1929) Ltd. and its workmen regarding certain demands.",
      "type": "background",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Dispute referred for adjudication, resulting in award by Industrial Tribunal on April 28, 1951, in Reference No. 168 of 1950, which inter alia provided for a gratuity scheme.",
      "type": "procedural",
      "date": "1951-04-28",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Employee Bhanu Bala joined appellant's service in 1929.",
      "type": "background",
      "date": "1929",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Bhanu Bala remained absent from duty without permission or leave from February 14, 1945, to the end of October 1945, causing a break in continuity of nearly 8 1/2 months.",
      "type": "material",
      "date": "1945-02-14 to 1945-10-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Resignation submitted by Bhanu Bala accepted by appellant on August 31, 1957.",
      "type": "material",
      "date": "1957-08-31",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant contended Bhanu Bala not entitled to gratuity under 1951 award scheme due to break in service; offered Rs. 1,165 on compassionate grounds.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Bhanu Bala claimed Rs. 2,282.50 as gratuity and refused appellant's offer.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Demand led to industrial dispute; Bhanu Bala filed application before First Labour Court at Bombay under s. 33C of Industrial Disputes Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Labour Court decided in favour of Bhanu Bala, directed appellant to pay Rs. 1,781.80 as gratuity.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellant filed writ petition in Bombay High Court under Arts. 226 and 227, contending Labour Court lacked jurisdiction; writ allowed, Labour Court order quashed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Government of Bombay referred question of interpretation of 'continuous service' in 1951 award to Industrial Court under s. 36A(1) of Industrial Disputes Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Industrial Court held: 'continuous service' means service not broken or interrupted by termination of contract of employment by employer or employee or by operation of law.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Gratuity scheme in 1951 award: On voluntary retirement or resignation after 15 years continuous service - gratuity at half month's wages per year up to 10 months.",
      "type": "material",
      "date": "1951-04-28",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Appellant challenged Industrial Court's interpretation in appeal by special leave to Supreme Court under s. 36A(2) reference context.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Interpretation of 'continuous service' in clause (iii) of gratuity scheme in 1951 award: whether unauthorised absence of 8 1/2 months from Feb 14, 1945 to end Oct 1945 breaks continuity for resignation gratuity after 15 years.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Unauthorised absence from work normally causes break in service; employee after such absence resuming not entitled to claim continuous service.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "s. 49B(1) and explanation, Indian Factories Act, 1934; s. 79(1) and explanation 1, Indian Factories Act, 1948 (pre-1954 amendment)"
    },
    {
      "id": "pa2",
      "text": "Buckingham and Carnatic case supports that continuity interrupted by illegal strike.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Buckingham and Carnatic Co. Ltd. v. Workers (1953 S.C.R. 219); s. 2(q) Industrial Disputes Act, 1947"
    },
    {
      "id": "pa3",
      "text": "Definition in s. 2(eee) Industrial Disputes Act supports unauthorised absence breaks continuity.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s. 2(eee), Industrial Disputes Act, 1947"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "'Continuous service' as used in 1951 award means service not broken or interrupted by termination of contract by employer/employee or operation of law.",
      "supporting_facts": [
        "f4",
        "f5",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Statutory definitions from Factories Act and ID Act not automatically applicable to interpret award; must examine on principle.",
      "addresses_issue": "i1",
      "key_observation": "Words may have different meanings in different contexts; decisions on other statutes not precedents."
    },
    {
      "id": "cr2",
      "text": "Continuous service in gratuity scheme context postulates continuance of master-servant relationship.",
      "addresses_issue": "i1",
      "key_observation": "Resignation/termination by employer ends service; absence without leave does not automatically end continuity unless long unauthorised absence infers abandonment."
    },
    {
      "id": "cr3",
      "text": "Participation in illegal strike may not break continuity unless leads to dismissal per standing orders.",
      "addresses_issue": "i1",
      "key_observation": "Whether break occurred is question of fact based on circumstances."
    },
    {
      "id": "cr4",
      "text": "Tribunal's view substantially right, but add: long unauthorised absence may infer abandonment, causing break.",
      "addresses_issue": "i1",
      "key_observation": "Modification to tribunal's interpretation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "'Continuous service' means service where master-servant relationship continues, not broken by termination/resignation/operation of law; unauthorised absence breaks only if infers abandonment.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Buckingham and Carnatic Co. Ltd. v. Workers of the Buckingham and Carnatic Co. Ltd.",
      "citation": "1953 S.C.R. 219",
      "treatment": "distinguished",
      "relevance": "Held continuity interrupted by illegal strike under Factories Act s.49B(1), but different context from award."
    },
    {
      "case_name": "Budge Budge Municipality v. P. R. Mukherjee",
      "citation": "1953 1 L.L.J. 195, 198",
      "treatment": "followed",
      "relevance": "Same words may mean different things in different contexts; other statutes' interpretations not binding precedents."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 36A(2)",
        "s. 36A(1)",
        "s. 33C",
        "s. 2(q)",
        "s. 2(eee)"
      ],
      "relevance": "Reference for interpretation; jurisdiction; definition of continuous service not automatically applicable to award."
    },
    {
      "name": "Indian Factories Act, 1934",
      "sections": [
        "s. 49B(1) and explanation"
      ],
      "relevance": "Definition of continuous service argued by petitioner but held inapplicable to award context."
    },
    {
      "name": "Indian Factories Act, 1948",
      "sections": [
        "s. 79(1) and explanation 1 (pre-1954 amendment)"
      ],
      "relevance": "Definition of continuous service argued by petitioner but held inapplicable."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Arts. 226",
        "Art. 227"
      ],
      "relevance": "Basis for writ petition quashing Labour Court order."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; Industrial Tribunal's award confirmed with modification that long unauthorised absence may infer abandonment of service, causing break in continuity.",
    "relief_granted": "None; affirmation of lower tribunal's interpretation with clarification.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'continuous service as used by the tribunal when it framed the award in question mean service not broken or interrupted by the termination of the contract of employment by either the employer or the employee or by operation of law.'",
      "speaker": "lower_court",
      "significance": "Industrial Court's interpretation upheld by Supreme Court."
    },
    {
      "text": "Continuous service in the context of the scheme of gratuity framed by the tribunal in the earlier reference postulates the continuance of the relationship of master and servant between the employer and his employees.",
      "speaker": "court",
      "significance": "Core holding on meaning of 'continuous service'."
    },
    {
      "text": "if an employee continues to be absent from duty without obtaining leave and in an unauthorised manner for such a long period of time that an inference may reasonably be drawn from such absence that by his absence he has abandoned service, then such long unauthorised absence may legitimately be held to cause a break in the continuity of service.",
      "speaker": "court",
      "significance": "Key modification to tribunal's view."
    }
  ],
  "_case_id": "1961_355",
  "_label": 0,
  "_text_length": 9814,
  "_extracted_at": "2026-02-10T19:34:41.596085"
}