{
  "metadata": {
    "case_name": "Ramratan, Hansraj and Maniram v. State",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Criminal Appeal No. 248 of 1960",
    "date_of_judgment": "1961-09-13"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Bad blood between Ramratan appellant and family of Bhimsen due to panchayat elections where they supported rival candidates.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Ramratan prosecuted under s.307 IPC sometime before, Bhimsen cited as prosecution witness, causing enmity.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Bhimsen and father Jawanaram brought gram for sale to Pili Bangan on night of May 7/8, 1959. Bhimsen returned to village and came back at 10/11 A.M. on May 8 on tractor-trolley with brother Ram Partap.",
      "type": "material",
      "date": "1959-05-08",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Gram stacked in front of Roopram's shop in mandi for sale through Roopram. Ram Partap wandered away, leaving Jawanaram and Bhimsen.",
      "type": "material",
      "date": "1959-05-08",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Shortly before 3 P.M. on May 8, 1959, while gram weighed by Lekhram, three appellants (Ramratan, Hansraj, Maniram) and two others (Moman, Ramsingh) armed with guns arrived.",
      "type": "material",
      "date": "1959-05-08",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Ramratan shouted enemy should not escape as Bhimsen tried to enter Roopram's shop. Ramratan fired at Bhimsen from 5 feet, injuring and killing him soon after.",
      "type": "material",
      "date": "1959-05-08",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Jawanaram raised hands asking not to kill Bhimsen; Hansraj fired at Jawanaram causing wound on left hand with compound fracture. Maniram fired at Jawanaram but he dropped, pellets hit Lekhram behind him.",
      "type": "material",
      "date": "1959-05-08",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Assailants ran away. Roopram shut shop during incident, came out after, informed by Jawanaram of five assailants' names.",
      "type": "material",
      "date": "1959-05-08",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Jawanaram asked Roopram to send telegram to police station Suratgarh, then went to police outpost but met Ramsingh constable en route and made report Ex. P-1.",
      "type": "procedural",
      "date": "1959-05-08",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Report Ex. P-1 recorded by Ramsingh constable shortly after incident around 3 P.M., Ram Partap arrived while recording.",
      "type": "procedural",
      "date": "1959-05-08",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Jawanaram sent to hospital, injuries examined at 3:30 P.M.",
      "type": "procedural",
      "date": "1959-05-08",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Ramsingh constable went to spot, found Bhimsen's body. Head-constable returned at 5 P.M., Sub-Inspector at 6 P.M. took over investigation.",
      "type": "procedural",
      "date": "1959-05-08",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Appellants denied committing offence, claimed false implication due to enmity, examined no evidence in defence.",
      "type": "disputed",
      "date": null,
      "source": "appellants"
    },
    {
      "id": "f14",
      "text": "Prosecution witnesses: Jawanaram (full story), Ram Partap (saw from hiding), Roopram (shut shop, heard shots, told names by Jawanaram after), Lekhram (saw incident but couldn't identify accused, turned hostile).",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Sessions Judge convicted three appellants on Jawanaram's evidence alone, acquitted two others on benefit of doubt. Sentenced Ramratan to death, others life imprisonment.",
      "type": "procedural",
      "date": "1960-10-31",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Rajasthan High Court dismissed appeal, confirmed death sentence, accepted Jawanaram's evidence corroborated by Roopram under s.6 and s.157 Evidence Act.",
      "type": "procedural",
      "date": "1960-10-31",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Roopram's statement that Jawanaram told him immediately after incident the names of five assailants is admissible under s.6 or s.157 of Indian Evidence Act to corroborate Jawanaram.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether solitary testimony of Jawanaram sufficient to convict appellants in circumstances of case.",
      "framed_by": "appellants"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in holding Roopram's statement admissible under s.6 and s.157 Evidence Act to corroborate Jawanaram, as Jawanaram did not state in court he told Roopram the names.",
      "supporting_facts": [
        "f14",
        "f16"
      ],
      "legal_basis": "Mt. Misri v. Emperor (AIR 1934 Sind 100); Nazar Singh v. State (AIR 1951 Pepsu 66); s.157 Evidence Act"
    },
    {
      "id": "pa2",
      "text": "Without Roopram, only solitary evidence of Jawanaram connects appellants to crime, insufficient in circumstances.",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": "Vemireddy Satyanarayan Reddy v. State of Hyderabad (1956 SCR 247)"
    },
    {
      "id": "pa3",
      "text": "Jawanaram unreliable: introduced Ram Partap in FIR though Sessions Judge disbelieved his presence before 6 PM; FIR not at 3 PM but up to 6 PM; named five but two acquitted.",
      "supporting_facts": [
        "f9",
        "f10",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Roopram's statement admissible under s.157 Evidence Act as former statement of Jawanaram relating to same fact (identity of assailants) made at or about time of incident, proved by Roopram; no need for Jawanaram to testify he made it to Roopram.",
      "addresses_issue": "i1",
      "key_observation": "S.157 requires only: (1) witness testimony on fact; (2) former statement on same fact at/about time or before authority. Overrules Mt. Misri and Nazar Singh."
    },
    {
      "id": "cr2",
      "text": "Roopram independent witness; corroborates incident and identities via Jawanaram's prior statement.",
      "addresses_issue": "i1",
      "key_observation": "Corroborates in two ways: incident occurred; former statement on assailants."
    },
    {
      "id": "cr3",
      "text": "Not solitary uncorroborated testimony; courts can rely on single witness unless prudence demands corroboration (Vadivelu Thevar). Jawanaram not accomplice-like.",
      "addresses_issue": "i2",
      "key_observation": "Vemireddy observations context-specific to near-accomplice."
    },
    {
      "id": "cr4",
      "text": "Ram Partap present by 10/11 AM, arrived during FIR recording ~3 PM. FIR timing confirmed by hospital at 3:30 PM and constable's evidence.",
      "addresses_issue": "i2",
      "key_observation": "No reason to disbelieve; Sessions Judge should have called outpost records."
    },
    {
      "id": "cr5",
      "text": "Two acquittals: benefit of doubt as less active; does not falsify Jawanaram on three appellants.",
      "addresses_issue": "i2",
      "key_observation": "Both lower courts accepted Jawanaram after scrutiny."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Roopram's evidence of Jawanaram's immediate post-incident statement admissible under s.157 Evidence Act to corroborate court testimony on assailants' identity.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Single witness testimony reliable if credible; here corroborated and accepted by two lower courts.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Appellants rightly convicted of murder.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mt. Misri v. Emperor",
      "citation": "AIR 1934 Sind 100",
      "treatment": "overruled",
      "relevance": "Held s.157 requires witness to testify to prior statement; court disagrees."
    },
    {
      "case_name": "Nazar Singh v. The State",
      "citation": "AIR 1951 Pepsu 66",
      "treatment": "overruled",
      "relevance": "Same as above; wrongly decided."
    },
    {
      "case_name": "Vemireddy Satyanarayan Reddy v. State of Hyderabad",
      "citation": "1956 SCR 247",
      "treatment": "distinguished",
      "relevance": "Corroboration needed for sole near-accomplice witness; not applicable here."
    },
    {
      "case_name": "Vadivelu Thevar v. State of Madras",
      "citation": "1957 SCR 981",
      "treatment": "followed",
      "relevance": "Courts may act on single witness unless prudence demands corroboration; case-specific."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 307"
      ],
      "relevance": "Prior prosecution of Ramratan causing enmity."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "Section 6",
        "Section 157"
      ],
      "relevance": "Admissibility of Roopram's evidence to corroborate Jawanaram."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed. Convictions and sentences upheld: Ramratan to death (fired fatal shot, leader, direct enmity), Hansraj and Maniram to life imprisonment. No extenuating circumstances for Ramratan.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In order to corroborate the testimony of a witness, any former statement made by such witness relating to the same fact, or at about the time when the fact took place... may be proved.\"",
      "speaker": "court",
      "significance": "Explains requirements of s.157 Evidence Act."
    },
    {
      "text": "\"There is nothing in s.157 which requires that before the corroborating witness deposes to the former statement the witness to be corroborated must also say in his testimony in court that he had made that former statement.\"",
      "speaker": "court",
      "significance": "Core holding overruling prior cases on corroboration."
    },
    {
      "text": "\"As a general rule a court may act on the testimony of a single witness, though uncorroborated.\"",
      "speaker": "court",
      "significance": "Principle from Vadivelu Thevar applied."
    }
  ],
  "_case_id": "1961_153",
  "_label": 0,
  "_text_length": 25885,
  "_extracted_at": "2026-02-10T19:31:23.776207"
}