{
  "metadata": {
    "case_name": "Additional Settlement Commissioner and State of Bombay v. Yeshwant Madhao Mahajan",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 281 of 1959",
    "date_of_judgment": "1961-11-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dhanora is an Izara village in Taluka Pusad, State of Madhya Pradesh, total area 2,375 acres 3 gunthas; 2,283 acres 28 gunthas assessed land, remaining 91 acres 15 gunthas unassessed.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Surat Singh, proprietor of village Dhanora, by sale deed dated May 24, 1947, conveyed undivided half share in village to Yeshwant Madhao Mahajan for Rs. 25,000.",
      "type": "material",
      "date": "1947-05-24",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On same day, May 24, 1947, Surat Singh executed kabulayat lease deed for five years in respect of same undivided half share for cultivation at annual rental of Rs. 3,000.",
      "type": "material",
      "date": "1947-05-24",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Madhya Pradesh Abolition of Proprietary Rights (Estates, Mahals, Alienated Lands) Act, 1 of 1951 enacted; brought into operation on March 14, 1951.",
      "type": "background",
      "date": "1951-03-14",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Village Dhanora vested in State Government by operation of s. 3 of the Act.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Compensation Officer, Yeotmal, started enquiry about assessment of compensation for village Dhanora.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Mahajan claimed before Compensation Officer to retain possession of half share in all fallow lands in village, leased under deed dated May 24, 1947 to Surat Singh, on plea that these were home farm.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Compensation Officer rejected Mahajan's claim; order confirmed in appeal by Additional Settlement Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Mahajan applied to High Court of Judicature at Nagpur under Art. 226, Misc. Petition No. 288 of 1954, for quashing orders of Compensation Officer and Additional Settlement Commissioner, declaration that lands in Schedule A were home-farm, and writ of mandamus against State of Madhya Pradesh for possession.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "High Court judgment and order dated October 12, 1955: quashed order of Additional Settlement Commissioner insofar as it related to undivided half share in Survey Nos. 1 to 91 except those in possession of specified tenants and already recognised as home-farm; directed Compensation Officer to decide claim in light of judgment.",
      "type": "procedural",
      "date": "1955-10-12",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "State of Bombay substituted for State of Madhya Pradesh by virtue of States Reorganization Act, 1956.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Additional Settlement Commissioner and State of Bombay appealed to Supreme Court with special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Dispute relates to half share in lands in village which remained fallow on date of notification under s. 3 of Act.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Lands specified in Schedule A to petition were lying fallow on crucial date; each assessed.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether undivided half share in fallow lands held by lessee (Surat Singh) from superior holder (Mahajan) can be regarded as home-farm land under s. 2(g)(3)(ii) of the Act, entitling Mahajan to retain possession under s. 4(2).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether undivided interest in land constitutes a 'holding' for purposes of home-farm definition.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether land lying fallow otherwise than in accordance with usual agricultural practice can be home-farm.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "In respect of undivided interest in land, superior holder not entitled to benefit of s. 4(2) because it is not a holding.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": "s. 2(g)(3), Berar Land Revenue Code definition of holding"
    },
    {
      "id": "pa2",
      "text": "Land lying fallow at date of vesting otherwise than in accordance with usual agricultural practice cannot be regarded as home-farm.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": "s. 2(g)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Lands were under personal cultivation of superior holder (Mahajan) including land allowed to lie fallow, held by lessee from superior holder; qualify as home-farm under s. 2(g)(3)(ii).",
      "supporting_facts": [
        "f2",
        "f3",
        "f7",
        "f14"
      ],
      "legal_basis": "s. 2(g)(3)(ii), s. 4(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Mahajan was proprietor of undivided half share by sale deed; granted lease for cultivation to Surat Singh; lands in Schedule A lying fallow but held by lessee from superior holder, covered by s. 2(g)(3)(ii); entitled to s. 4(2) benefit.",
      "addresses_issue": "i1",
      "key_observation": "Undivided interest qualifies as part of holding; lease for cultivation evidences intention for agricultural use, lessee's default does not deprive lessor of statutory benefit."
    },
    {
      "id": "cr2",
      "text": "Survey numbers in Schedule A are holdings per Berar Land Revenue Code (parcel separately assessed); part or undivided interest in holding can be home-farm if meets cl. (ii) or (iii) of s. 2(g)(3).",
      "addresses_issue": "i2",
      "key_observation": "Expression 'holding' includes such per Berar Code; no requirement for entire holding."
    },
    {
      "id": "cr3",
      "text": "No substance in contention that fallow land not per usual practice excluded; s. 4(2) has no express or implied exclusion for fallow lands held by lessee for cultivation.",
      "addresses_issue": "i3",
      "key_observation": "Grant of lease for cultivation means lands to be retained by proprietor under s. 4(2)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Undivided half share in fallow lands held by lessee from superior holder qualifies as home-farm under s. 2(g)(3)(ii); proprietor entitled to retain possession under s. 4(2).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Undivided interest in land constitutes 'holding' for home-farm purposes.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Fallow lands held under lease for cultivation are home-farm notwithstanding lessee's non-cultivation.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Madhya Pradesh Abolition of Proprietary Rights (Estates, Mahals, Alienated Lands) Act, 1 of 1951",
      "sections": [
        "s. 2(g)",
        "s. 3",
        "s. 4(1)",
        "s. 4(2)",
        "s. 7",
        "s. 8",
        "Schedule I"
      ],
      "relevance": "Vesting of proprietary rights in State; exception for home-farm lands retained by proprietor; definition of home-farm land."
    },
    {
      "name": "Berar Land Revenue Code, 1928",
      "sections": [
        "definition of 'holding'"
      ],
      "relevance": "Definition of 'holding' applied via s. 2(d) of MP Act: parcel separately assessed or held under one lease."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Basis for High Court writ petition."
    },
    {
      "name": "States Reorganization Act, 1956",
      "sections": [],
      "relevance": "Substitution of State of Bombay for Madhya Pradesh."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court order; held that High Court was right in directing Compensation Officer to treat the lands as home-farm and decide claim accordingly; appellants' contentions rejected.",
    "relief_granted": "High Court's direction to Compensation Officer confirmed; Mahajan entitled to retain possession of half share in specified fallow lands as home-farm.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Prima facie the claim of Mahajan was covered by cl. (g) (3) (ii) of s. 2 of the Act, and Mahajan was entitled to the benefit of the exception in s. 4 (2).\"",
      "speaker": "court",
      "significance": "Affirms Mahajan's prima facie entitlement to home-farm status."
    },
    {
      "text": "\"That a half share in the village... was granted to Surat Singh on lease for cultivation cannot be gainsaid in view of the express contents of the kabulayat.\"",
      "speaker": "court",
      "significance": "Confirms lease evidenced intention for cultivation, qualifying as home-farm."
    },
    {
      "text": "\"The High Court was right in holding that the words of cl. (ii) of s. 2 (g) (3) were explicit and a survey number which was lying fallow but was held by a lessee from the superior holder fell within the definition of home-farm.\"",
      "speaker": "court",
      "significance": "Endorses High Court's interpretation and rejects appeal."
    }
  ],
  "_case_id": "1961_308",
  "_label": 0,
  "_text_length": 9542,
  "_extracted_at": "2026-02-10T19:34:14.944645"
}