{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "RAGHUBAR DAYAL, J."
    ],
    "case_number": "Criminal Appeal No. 226 of 1959",
    "date_of_judgment": "1961-04-24"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant applied to the Patna University for permission to appear at the 1954 M. A. Examination in English as a private candidate, representing that he was a graduate having obtained his B.A. Degree in 1951 and that he had been teaching in a certain school.",
      "type": "material",
      "date": "1954",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In support of his application, he attached certain certificates purporting to be from the Headmaster of the School, and the Inspector of Schools.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The University authorities accepted the appellants statements and gave permission and wrote to him asking for the remission of the fees and two copies of his photograph.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellant furnished these and on April 9, 1954, proper admission card for him was despatched to the Headmaster of the School.",
      "type": "procedural",
      "date": "1954-04-09",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Information reached the University about the appellants being not a graduate and being not a teacher.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Inquiries were made and it was found that the certificates attached to the application were forged, that the appellant was not a graduate and was not a teacher and that in fact he had been de-barred from taking any University examination for a certain number of years on account of his having committed corrupt practice at a University examination.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The matter was reported to the police which, on investigation, prosecuted the appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The appellant was acquitted of the charge of forging those certificates, but was convicted of the offence of attempting to cheat.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The High Court at Patna dismissed the appellants appeal against his conviction under s. 420, read with s. 511, of the Indian Penal Code.",
      "type": "procedural",
      "date": "1958-09-23",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the facts found amount to the appellants committing an attempt to cheat the University or just making preparations to cheat the University.",
      "framed_by": "appellant"
    },
    {
      "id": "i2",
      "text": "Whether even if the appellant had obtained the admission card and appeared at the M. A. Examination, no offence of cheating under s. 420, Indian Penal Code, would have been committed as the University would not have suffered any harm to its reputation.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The facts found did not amount to the appellants committing an attempt to cheat the University but amounted just to his making preparations to cheat the University.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "s. 511, Indian Penal Code"
    },
    {
      "id": "pa2",
      "text": "Even if the appellant had obtained the admission card and appeared at the M. A. Examination, no offence of cheating under s. 420, Indian Penal Code, would have been committed as the University, would not have suffered any harm to its reputation.",
      "supporting_facts": [
        "f1",
        "f6"
      ],
      "legal_basis": "s. 415, s. 420, Indian Penal Code"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The appellant by false representations deceived the University and induced the authorities to issue the admission card, which, if the fraud had not been detected, would have been ultimately delivered to the appellant.",
      "addresses_issue": "i1",
      "key_observation": "Deception occurred and induced delivery of property (admission card)."
    },
    {
      "id": "cr2",
      "text": "The offence of cheating is defined in s. 415, IPC: deceived fraudulently or dishonestly to deliver property or induce to do/omit something causing/likely to cause damage/harm.",
      "addresses_issue": "i2",
      "key_observation": "Admission card is property of immense value to the candidate."
    },
    {
      "id": "cr3",
      "text": "There is no doubt that the appellant, by making false statements, did deceive the University and intended to make it give permission and deliver admission card.",
      "addresses_issue": "i1",
      "key_observation": "Card is property as per precedents."
    },
    {
      "id": "cr4",
      "text": "Attempt begins when preparations are complete and culprit commences to do something with intention of committing offence and which is a step towards commission.",
      "addresses_issue": "i1",
      "key_observation": "Dispatching application with false statements is commencement of attempt."
    },
    {
      "id": "cr5",
      "text": "The appellant not only sent application but remitted fees and sent photos, leading to issuance of card.",
      "addresses_issue": "i1",
      "key_observation": "Gone beyond preparation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A person commits attempt when (i) he intends to commit offence and (ii) having made preparations, does an act towards its commission; such act need not be penultimate but during course of committing.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Admission card is property; deception induced its delivery.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Queen Empress v. Appasami",
      "citation": "1889 I.L.R. 12 Mad. 151",
      "treatment": "followed",
      "relevance": "Ticket entitling accused to enter examination room is property."
    },
    {
      "case_name": "Queen Empress v. Soshi Bhushan",
      "citation": "1893 I.L.R. 15 All. 210",
      "treatment": "followed",
      "relevance": "Written certificate of attendance and fees payment is property under s. 463 IPC."
    },
    {
      "case_name": "The Queen v. Ramsarun Chowbey",
      "citation": "1872 4 N.W.P. 46",
      "treatment": "referred",
      "relevance": "Act done with intention for purpose of committing offence, leading immediately to commission."
    },
    {
      "case_name": "In the matter of the petition of R. MacCrea",
      "citation": "I.L.R. 15 All. 173",
      "treatment": "followed",
      "relevance": "s. 511 covers acts after preparations complete, towards commission; attempt may comprise series of acts."
    },
    {
      "case_name": "Queen v. Paterson",
      "citation": "I.L.R. 1 All. 316",
      "treatment": "distinguished",
      "relevance": "Publication of banns not attempt to bigamy."
    },
    {
      "case_name": "Regina v. Padala Venkatasami",
      "citation": "1881 I.L.R. 3 Mad. 4",
      "treatment": "referred",
      "relevance": "Preparation of copy and stamped paper not attempt to forgery."
    },
    {
      "case_name": "In the matter of the petition of Riasat Ali",
      "citation": "1881 I.L.R. 7 Cal. 352",
      "treatment": "referred",
      "relevance": "Ordering printing of forms not attempt until act towards making false document."
    },
    {
      "case_name": "Reg. v. Chessman",
      "citation": "Lee Caves Rep. 145",
      "treatment": "referred",
      "relevance": "If actual transaction commenced which would end in crime if not interrupted, it is attempt."
    },
    {
      "case_name": "M'Pherson's Case",
      "citation": null,
      "treatment": "referred",
      "relevance": "Attempt conveys that if succeeded, offence would be committed."
    },
    {
      "case_name": "In re Amrita Bazar Patrika Press Ltd.",
      "citation": "1920 I.L.R. 47 Cal. 100",
      "treatment": "referred",
      "relevance": "Attempt is act in part execution of design, more than preparation."
    },
    {
      "case_name": "Reg. v. Collins",
      "citation": "Dears B. 202",
      "treatment": "referred",
      "relevance": "Attempt if not prevented would result in consummation."
    },
    {
      "case_name": "In re T. Munirathnam Reddi",
      "citation": "A.I.R. 1955 And. Prad. 118",
      "treatment": "referred",
      "relevance": "Distinction between preparation and attempt; crucial test if last act would constitute crime."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 420",
        "s. 511",
        "s. 415",
        "s. 463",
        "s. 494"
      ],
      "relevance": "Conviction under s.420 r/w s.511 for attempt to cheat; definition of cheating in s.415; attempt in s.511."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Patna High Court order dismissing appeal against conviction under s.420 r/w s.511 IPC is dismissed. The acts of appellant constituted attempt to cheat by deception to obtain admission card, which is property.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The moment he commences to do an act with the necessary intention, he commences his attempt to commit the offence.",
      "speaker": "court",
      "significance": "Defines start of attempt under s.511 IPC."
    },
    {
      "text": "The admission card as such has no pecuniary value, but it has immense value to the candidate for the examination.",
      "speaker": "court",
      "significance": "Holds admission card as 'property' for cheating offence."
    },
    {
      "text": "A person commits the offence of attempt to commit a particular offence when (i) he intends to commit that particular offence and (ii) he, having made preparations and with the intention to commit the offence, does an act towards its commission.",
      "speaker": "court",
      "significance": "Summary of law on attempt under s.511 IPC."
    }
  ],
  "_case_id": "1961_291",
  "_label": 0,
  "_text_length": 22435,
  "_extracted_at": "2026-02-10T19:34:12.319080"
}