{
  "metadata": {
    "case_name": "Binani Commercial Co. Ltd. v. Ramanlal Maganlal Mehta",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 371 of 1957",
    "date_of_judgment": "1961-05-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is Ms. Binani Commercial Co. Ltd., a Limited Company carrying on business in Bombay as metal merchants, bankers and commission agents.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent carries on business in Bombay under the name and style of Ms. Balasinor Export and Import Co., and also as Ms. Ramanlal and Sons.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In January 1952 the appellant agreed to sell to the respondent 300 tons of Electrolytic Zinc at the rate of Rs. 171 per cwt. against delivery orders issued under the regulations of the Metal Traders Association, Ltd., for Posh Sudi 15 delivery January 12, 1952.",
      "type": "material",
      "date": "1952-01-12",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The respondent promised to pay for the said goods by January 21, 1952 and to take delivery thereafter.",
      "type": "material",
      "date": "1952-01-21",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "The respondent paid to the appellant several sums aggregating Rs. 1,56,000 as a deposit for the price of the said goods.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant tendered the said goods to the respondent whereupon he arranged to take delivery of only 160 tons and made payments on account.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The appellant then tendered the balance of 140 tons to the respondent but the respondent failed and neglected to take delivery of the said balance and to pay for it.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "As a result of the respondents default in taking delivery the appellant had to sell the balance in the falling market at Rs. 81 per cwt., resulting in loss of Rs. 93,053-3-0 or damages of Rs. 88,229-3-0.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Appellant filed suit on Original Side of Bombay High Court to recover Rs. 93,053-3-0 or alternatively damages of Rs. 88,229-3-0 for breach of contract.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Respondent resisted claim principally on ground that transaction contravened Supply and Prices of Goods Act, 1950 and cl. b of Government of India Notification No. 14-32/17/50 dated September 2, 1950, making contract void and illegal.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Suit tried by Coyajee, J.; principal defence tried as preliminary issue; held defence not good, contract valid; proceeded to merits, found for appellant, referred to Commissioner for accounts.",
      "type": "procedural",
      "date": "1955-08-22",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Respondent appealed to Bombay High Court (Appeal No. 49 of 1955); Division Bench allowed appeal, held contract invalid, dismissed suit with costs.",
      "type": "procedural",
      "date": "1955-08-22",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appellant obtained certificate from High Court and appealed to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "No declaration was given by the respondent to the appellant before the agreement to sell was made.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appellant's counsel Mr. Mistree conceded before trial court and appeal court that if maximum validly prescribed under notification, respondent's defence valid and appellant out of court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the contract for sale of 300 tons of Electrolytic Zinc is void and illegal for contravening s.5(1)(c) of Supply and Prices of Goods Act, 1950 read with notification under s.4(1)(c) dated September 2, 1950.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether the notification under s.4(1)(c) validly fixes maximum quantity which may in one transaction be sold to any person.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether s.5(1)(c) applies to agreements to sell or only to actual sales.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Notification does not fix maximum quantity as required by s.4(1)(c) because it does not specify arithmetical immutable quantity; hence invalid.",
      "supporting_facts": [
        "f3",
        "f14"
      ],
      "legal_basis": "Supply and Prices of Goods Act, 1950 s.4(1)(c)"
    },
    {
      "id": "pa2",
      "text": "Notification inconsistent with s.4(2)(a) as it does not fix maxima differently for classes of dealers/producers.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Supply and Prices of Goods Act, 1950 s.4(2)(a)"
    },
    {
      "id": "pa3",
      "text": "Notification refers only to 'sale' not 'agreement to sell'; thus agreement valid, and respondent cannot rely on own default in not giving declaration.",
      "supporting_facts": [
        "f3",
        "f14"
      ],
      "legal_basis": "Supply and Prices of Goods Act, 1950 s.4(1)(c), s.5(1)(c)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Transaction for 300 tons (non-ferrous metal) contravenes notification under s.4(1)(c) as no declaration obtained from buyer that quantity does not exceed requirements for three months; exceeds 1 ton limit; thus violates s.5(1)(c); contract void.",
      "supporting_facts": [
        "f3",
        "f14"
      ],
      "legal_basis": "Supply and Prices of Goods Act, 1950 s.4(1)(c), s.5(1)(c); Notification No. 14-32/17/50 cl.b dated 2.9.1950"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Act passed under Art.249 Constitution to control prices and supply of essential goods in national interest; ss.4(1)(c) and 5(1)(c) scheme fixes maximum quantity per transaction via notification, prohibits sale/agreement to sell/offer exceeding it.",
      "addresses_issue": "i1",
      "key_observation": "Notification validly fixes two ceilings: up to 1 ton without declaration; beyond with declaration re 3 months requirements."
    },
    {
      "id": "cr2",
      "text": "Rejects argument that maximum must be arithmetical immutable quantity; s.4(2)(a) enables variable maxima by locality/classes.",
      "addresses_issue": "i2",
      "key_observation": "Realistic for varied goods/circumstances; notification consistent with s.4(1)(c)."
    },
    {
      "id": "cr3",
      "text": "s.5(1)(c) prohibits dealer/producer from selling/agreeing to sell/offering exceeding maximum fixed under s.4(1)(c) notification; hits agreement to sell immediately.",
      "addresses_issue": "i3",
      "key_observation": "No distinction between agreement to sell and actual sale; appellant's counsel conceded if maximum valid, defence succeeds."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Notification under s.4(1)(c) validly fixes maximum quantity for sale of non-ferrous metals in one transaction.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Contract contravenes s.5(1)(c) read with notification as no declaration obtained for sale exceeding 1 ton; void and unenforceable.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "s.5(1)(c) applies to agreements to sell, not just actual sales.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Supply and Prices of Goods Act, 1950 (70 of 1950)",
      "sections": [
        "s.2",
        "s.3",
        "s.4",
        "s.5",
        "s.6",
        "s.7",
        "s.8",
        "s.13",
        "s.16"
      ],
      "relevance": "Regulates supply, prices, possession, sale of controlled goods; s.4(1)(c) fixes max quantity per transaction; s.5(1)(c) prohibits contravening sales/agreements; contract held void thereunder."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.249"
      ],
      "relevance": "Empowers Parliament to legislate on State List matters in national interest for control of prices/supply."
    },
    {
      "name": "Government of India Notification No. 14-32/17/50",
      "sections": [
        "cl. b"
      ],
      "relevance": "Issued 2.9.1950 under s.4(1)(c); no sale of non-ferrous metals >1 ton without buyer's declaration re 3 months requirements; contract violates it."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upholds Bombay High Court Division Bench; contract invalid under Supply and Prices of Goods Act, 1950; appellant's suit dismissed.",
    "relief_granted": null,
    "costs": "High Court ordered suit dismissed with costs (upheld)."
  },
  "key_quotes": [
    {
      "text": "\"Once the maximum is thus fixed by a notified order s. 5 immediately comes into operation, and it provides that in regard to commodities the maximum quantity of which has been determined by a notified order under s. 4(1)(c) there is a prohibition against agreement to sell, offer for sale, or sale...\"",
      "speaker": "court",
      "significance": "Explains combined operation of ss.4(1)(c), notification, s.5(1)(c) hitting agreements to sell."
    },
    {
      "text": "\"The scheme of the two sections is plain... the agreement to sell the goods or the offer for the sale of such goods above the maximum specified in the notification... is immediately hit, not by virtue of the notification as such but by the combined operation of the provisions of s. 4(1)(c) and the notification...\"",
      "speaker": "court",
      "significance": "Core holding on why agreement to sell is invalid."
    }
  ],
  "_case_id": "1961_407",
  "_label": 0,
  "_text_length": 19310,
  "_extracted_at": "2026-02-10T19:35:25.308514"
}