{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Madras v. S.A.S. Marimuthu Nadar",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeals Nos. 427 and 428 of 1960",
    "date_of_judgment": "1961-08-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, S.A.S. Marimuthu Nadar, was the manager of a Hindu undivided family consisting of Marimuthu Nadar, his two major sons and two minor sons.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On August 16, 1946, the family divided, and a firm came into existence. Marimuthu Nadar and his two major sons took 4/16th share each and the two minor sons were admitted to the benefits of partnership to the extent of 2/16th share each.",
      "type": "material",
      "date": "1946-08-16",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For the assessment year 1949-50 (previous year ended on August 16, 1948), the share of profits of Marimuthu Nadar from the partnership was Rs. 9,812, while the share of profits of his two minor sons was Rs. 8,124 and Rs. 8,381.",
      "type": "material",
      "date": "1948-08-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The income of the minors was added to the total income of Marimuthu Nadar under s.16(3)(a)(ii) of the Income-tax Act.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Marimuthu Nadar was granted earned income relief only to the extent of his own individual share of the profits from the partnership.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In the assessment year 1950-51, the elder of the two minor sons had become major, and it was only the share of the remaining minor son which was included in the total income of Marimuthu Nadar.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In 1950-51, Marimuthu Nadar's share of profits was Rs. 12,344 and that of his minor son, Rs. 10,143. He was given earned income relief only on his share of the profits but not on the share of the profits of the minor son.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Marimuthu Nadar appealed to the Appellate Assistant Commissioner and also to the Income-tax Appellate Tribunal but his appeals were unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "At the instance of Marimuthu Nadar, the Tribunal referred the question to the Madras High Court (Referred No. 28 of 1953).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Madras High Court by judgment dated August 28, 1956, answered the question in the affirmative and in favour of the assessee.",
      "type": "procedural",
      "date": "1956-08-28",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The Commissioner of Income-tax, Madras, appealed with a certificate under s.66A(2) of the Indian Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "There is no dispute about the amounts involved, no dispute about the inclusion of the share of the profits of the minors from the partnership, in the total income of the father.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the assessee is entitled to earned income relief on the share income of the two minor sons for 1949-50 assessment year and on the share income of one minor son for 1950-51 assessment year included in the computation of the total income of assessee under the provisions of section 16(3)(a)(ii) of the Income-tax Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Earned income relief can only be granted to the father in respect of his own individual share of profits and not in respect of the share of the minor or minors.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Section 2(6AA) of the Income-tax Act; in view of the definition of earned income in s.2(6AA), only that portion of income was entitled to this relief which satisfied the condition that it was earned by the person to whom it belonged before its inclusion; minor must have been actively engaged in the conduct of the business."
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Inasmuch as the profits were earned by Marimuthu Nadar working as a partner actively engaged in the conduct of the business and the share of the minors was included in his total income, the definition justified the inclusion of the minors' share in the amount, on which earned income relief could be claimed.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f6",
        "f7"
      ],
      "legal_basis": "Section 2(6AA) of the Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The general intention behind s.2(6AA) is to give to an assessee earned income relief in respect of the income of another person included in his total income under the provisions of this Act. 'Such income' refers to earned income determined in the same manner as under the earlier part of the definition.",
      "addresses_issue": "i1",
      "key_observation": "Earned income requires it to be income of an assessee who is an individual or unregistered firm, chargeable under Profits and gains of business where carried on by the assessee or as active partner."
    },
    {
      "id": "cr2",
      "text": "The two conditions were satisfied by Marimuthu Nadar in respect of his own share. For minors' share, the Department contends it must be earned by the minor actively, but a minor cannot be actively engaged as partner.",
      "addresses_issue": "i1",
      "key_observation": "Section applies where assessee (father) is actively engaged; equity in giving relief to person who earned the income though belonging to another."
    },
    {
      "id": "cr3",
      "text": "The section can only be read as enacting that for purposes of earned income relief, such income will be included which, though it is the income of another person, has been earned by the assessee or where the assessee is a partner actively engaged in the conduct of the business.",
      "addresses_issue": "i1",
      "key_observation": "No violence to language; condition that assessee worked actively as partner applicable to latter part."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The assessee is entitled to earned income relief on the share income of the minors included in his total income under s.16(3)(a)(ii), as the assessee-father was actively engaged as partner in the conduct of the business.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "16(3)(a)(ii)",
        "2(6AA)",
        "66A(2)",
        "14(2)",
        "60"
      ],
      "relevance": "Inclusion of minors' income in father's total income; definition of earned income relief; reference to High Court; exemption provisions"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Madras High Court's answer in favour of the assessee, holding that earned income relief is admissible on the minors' share income included in the father's total income since the father was actively engaged as a partner in the business.",
    "relief_granted": "Earned income relief granted to assessee on minors' shares",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The general intention behind the section... is to give to an assessee, earned income relief in respect of the income of another person, included in his total income under the provisions of this Act.",
      "speaker": "court",
      "significance": "Explains purpose of s.2(6AA)"
    },
    {
      "text": "In our opinion, the section can only be read as enacting that for purposes of earned income relief, such income will be included which, though it is the income of another person, has been earned by the assessee...",
      "speaker": "court",
      "significance": "Core holding on interpretation of 'such income' and active engagement by assessee"
    },
    {
      "text": "In our opinion, the High Court was right in the answer which it gave.",
      "speaker": "court",
      "significance": "Affirms High Court decision in favour of assessee"
    }
  ],
  "_case_id": "1961_65",
  "_label": 0,
  "_text_length": 10965,
  "_extracted_at": "2026-02-10T19:30:29.181613"
}