{
  "metadata": {
    "case_name": "Union of India v. Respondents",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Civil Appeal No. 322 of 1960",
    "date_of_judgment": "1961-08-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Babu Ram was the owner of Flat No. 5, Aggarwal Building, Connaught Circus, New Delhi. Respondents 1 to 6 are his sons and widow.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By an order dated April 14, 1943, the Government of India requisitioned the said flat under r.75-A of the Defence of India Rules for a period of one year from April 15, 1943 to April 14, 1944.",
      "type": "material",
      "date": "1943-04-14",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The said flat was put in the occupation of one Hardie of the Indian National Airways.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The period of requisition was extended from time to time, and finally by an order dated April 2, 1946, the flat was requisitioned from April 15, 1946, until further orders of the Central Government.",
      "type": "material",
      "date": "1946-04-02",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After Mr. Hardie vacated the flat, it was allotted to other officers.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Babu Ram requested the Government from time to time to de-requisition the said flat for his personal use. He represented that he was suffering from heart trouble and was continuously keeping indifferent health, that two of his sons had got married, and that in those circumstances it had become impossible for him to continue to live in their small house in a narrow lane but the Government of India rejected his request on the ground that on surrender by the officers of the Indian National Airways it would be required for allotment to Central Government officers.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Babu Ram died on October 24, 1951.",
      "type": "background",
      "date": "1951-10-24",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "It appears that four or five months in 1947 the flat was vacant and thereafter it was occupied by refugees from West Pakistan. It was afterwards given to the present respondent No. 7, Triveni Kala Sangam.",
      "type": "material",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On November 4, 1952, respondent No. 1 again requested the Government to de-requisition the flat mainly on the ground that the said flat was not in use of the officers of the Central Government but was put in possession of Triveni Kala Sangam, which was a private dance and music school.",
      "type": "procedural",
      "date": "1952-11-04",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "As no reply was given to that request, the said respondent sent a reminder on June 26, 1953, and to that he received a reply to the effect that the matter is receiving attention and further communication will follow in due course.",
      "type": "procedural",
      "date": "1953-06-26",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On September 16, 1953, the Government informed the first respondent that he could execute a lease deed in favour of the Government in respect of the said flat.",
      "type": "procedural",
      "date": "1953-09-16",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The respondents filed a petition for a writ of mandamus in the High Court of Punjab. The petition was heard by Falshaw, J., and the learned Judge issued a writ of mandamus on October 19, 1954, directing the appellants to put the respondents in possession of the flat.",
      "type": "procedural",
      "date": "1954-10-19",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Against the said order, on November 26, 1954, the appellants filed a Letters Patent appeal in the Circuit Bench of the Punjab High Court at Delhi. The appeal was filed within 30 days from the date of the said order after excluding the time taken for obtaining certified copies of the necessary documents but more than 20 days thereafter.",
      "type": "procedural",
      "date": "1954-11-26",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The appeal was heard by a division bench consisting of the Chief Justice and Mehar Singh, J. The learned Judges held that the appeal was filed out of time and that there was no sufficient reason for excusing the delay. They also went into the merits of the case and agreed with Falshaw, J., that a case had been made out for issuing a writ. With the result that the appeal was dismissed on November 21, 1957.",
      "type": "procedural",
      "date": "1957-11-21",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "What is the period of limitation prescribed for an appeal against an order of a Single Judge of the Punjab High Court to a division bench of the same High Court?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If the appeal was preferred out of time, was there a sufficient cause for excusing the delay in preferring the appeal?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Are the respondents not legally entitled to ask the Central Government to de-requisition the said premises under the 1952 Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Letters Patent appeal, it having been filed within 30 days from the date of the judgment of Falshaw, J., was within time, and that, in any view, having regard to the fluid state of the law on the question whether the time prescribed by the Limitation Act or the rule by the High Court would govern that appeal, there was sufficient cause for excusing the delay.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Rule 4 of High Court Rules; Art. 151 Limitation Act"
    },
    {
      "id": "pa2",
      "text": "The requisition made under r.75-A of the Defence of India Rules was continued under s.3 of the Requisitioned Land Continuance of Powers Act, 1947, whereunder the appropriate Government was given the power to use or deal with a requisitioned land in such manner as may appear to it to be expedient, that in exercise of the said power the said Government put Triveni Kala Sangam in possession of the same, and that under s.24(2) of the Requisitioning and Acquisitioning of Immovable Property Act, 1952, the said requisition shall be deemed to be property requisitioned under s.3 of the said Act and that under the said section the said purpose must be deemed to be a public purpose, being the purpose of the Union and, as that purpose did not cease to exist, the respondents are not entitled to ask for de-requisition of the said flat.",
      "supporting_facts": [
        "f2",
        "f4",
        "f8"
      ],
      "legal_basis": "r.75-A Defence of India Rules; s.3 1947 Act; s.24(2), s.3, s.6 1952 Act"
    },
    {
      "id": "pa3",
      "text": "The purpose for which the building is now utilised, namely for the Triveni Kala Sangam, is a public purpose being the purpose of the Union, within the meaning of s. 3 of the Act, and, therefore, the respondents are not entitled for de-requisition under the proviso to s. 6 of the Act.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s.3 1952 Act; State of Bombay v. Ali Gulshan"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Seeks to sustain the order of the High Court both on the question of limitation as well as on merits.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": "Art. 151 Limitation Act prevails over r.4 HC Rules"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 4 is made by the High Court in exercise of the legislative power conferred upon the said High Court under cl. 27 of the Letters Patent. As the said rule is a law made in respect of special cases covered by it, it would certainly be a special law within the meaning of s. 29(2) of the Limitation Act. Article 151 must be read subject to the special law.",
      "addresses_issue": "i1",
      "key_observation": "r. 4 of High Court Rules is a special law under s.29(2) Limitation Act, prescribes 30 days limitation for Letters Patent appeal."
    },
    {
      "id": "cr2",
      "text": "In this view, the second question does not fall to be considered in this appeal.",
      "addresses_issue": "i2",
      "key_observation": "Appeal within time under r.4."
    },
    {
      "id": "cr3",
      "text": "The fiction created by s. 24(2) of the 1952 Act would operate only upon the requisition already made. The validity of the requisition could be judged on the basis of the pre-existing statutes. The requisition of a property made for public purposes under r.75-A of the Rules would be deemed to be a requisition under s. 3 of the Act. Even if s. 5 of the Act was excluded, the proviso to s. 6 of the Act would be attracted. Under that proviso, where the purposes for which any requisitioned property was being used ceased to exist, the Central Government shall release the property.",
      "addresses_issue": "i3",
      "key_observation": "Original purposes under Defence of India Rules (securing defence, public safety etc.) ceased to exist; flat used for private school, not those purposes."
    },
    {
      "id": "cr4",
      "text": "The criterion is not whether a particular purpose for which a building was used when the Act came into force was a public purpose, but whether it was requisitioned for one of the purposes mentioned in r.75-A of the Rules. If those purposes ceased to exist, the proviso to s. 6 made it obligatory for the Government to release the property.",
      "addresses_issue": "i3",
      "key_observation": "Current use by Triveni Kala Sangam not relevant; original war/emergency purposes lapsed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under cl. 27 of the Letters Patent, the High Court has power to make a rule prescribing the period of limitation for a Letters Patent appeal against an order of a single Judge made in exercise of the original jurisdiction of the High Court, and by reason of cl.37 thereof, the said rule is subject to the provisions of the Limitation Act but the Limitation Act itself saves the operation of the said rule. With the result that r. 4 applies to such an appeal.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "The respondents are legally entitled to ask the Central Government to de-requisition the said premises under the 1952 Act as the purpose for which the property was requisitioned ceased to exist.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Punjab Co-operative Bank Ltd. v. Official Liquidators, Punjab Cotton Press Company, Ltd. in liquidation",
      "citation": "A.I.R. 1941 Lahore 57 (F.B.)",
      "treatment": "followed",
      "relevance": "Statutory rules framed by High Court under cl. 27 Letters Patent are a special law under s.29 Limitation Act."
    },
    {
      "case_name": "State of Bombay v. Ali Gulshan",
      "citation": "1955 2 S.C.R. 867",
      "treatment": "referred",
      "relevance": "Cited by appellant but court did not express opinion on its validity in this context."
    }
  ],
  "statutes_cited": [
    {
      "name": "Defence of India Rules",
      "sections": [
        "Rule 75-A"
      ],
      "relevance": "Original requisition for purposes of defence, public safety etc.; expediency limited to those purposes."
    },
    {
      "name": "Requisitioned Land (Continuance of Powers) Act, 1947 (Act No. 17 of 1947)",
      "sections": [
        "s.3"
      ],
      "relevance": "Continued requisition under original purposes; power to use/deal as expedient limited to r.75-A(2) purposes."
    },
    {
      "name": "Requisitioning and Acquisitioning of Immovable Property Act, 1952 (XXX of 1952)",
      "sections": [
        "s.3",
        "s.6",
        "s.24"
      ],
      "relevance": "Deemed continuation of prior requisition; proviso to s.6 mandates release if original purpose ceases."
    },
    {
      "name": "Indian Limitation Act, 1908",
      "sections": [
        "s.29(2)",
        "Art. 151"
      ],
      "relevance": "s.29(2) saves special law (HC Rule 4) prescribing 30 days for Letters Patent appeal over Art.151's 20 days."
    },
    {
      "name": "Letters Patent for the High Court of Lahore",
      "sections": [
        "Clause 27",
        "Clause 37"
      ],
      "relevance": "Power to make rules on limitation; rules subject to but saved by Limitation Act."
    },
    {
      "name": "Rules and Orders of the High Court of Punjab",
      "sections": [
        "Rule 4"
      ],
      "relevance": "30 days limitation for Letters Patent appeal; special law."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Punjab High Court judgment confirming writ of mandamus directing Union of India to restore possession of the flat to respondents 1-6 is dismissed. High Court order upheld on merits; limitation issue resolved in appellant's favour but does not affect outcome.",
    "relief_granted": "Writ of mandamus upheld; Union of India directed to restore possession of flat to respondents 1-6.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"If r. 4 is a special law, the Limitation Act itself must be deemed to prescribe the period of limitation mentioned under that rule for the class of cases covered by the said rule, and to that extent the rule derogates from Art. 151 of the First Schedule to the Limitation Act.\"",
      "speaker": "court",
      "significance": "Core reasoning on why HC Rule 4 (30 days) applies over Limitation Act Art.151 (20 days)."
    },
    {
      "text": "\"Under that proviso, where the purposes for which any requisitioned property was being used ceased to exist, the Central Government shall, unless the property is acquired under section 7 release that property, as soon as may be, from requisition.\"",
      "speaker": "court",
      "significance": "Triggers mandatory de-requisition as original Defence of India purposes had ceased."
    },
    {
      "text": "\"The criterion is not, therefore, whether a particular purpose for which a building was used when the Act came into force was a public purpose, being the purpose of the Union, within the meaning of s.3 of the 1952 Act, but whether it was requisitioned for one of the purposes mentioned in r.75-A of the Rules.\"",
      "speaker": "court",
      "significance": "Rejects appellant's argument on current use; focuses on original requisition purpose."
    }
  ],
  "_case_id": "1961_329",
  "_label": 0,
  "_text_length": 24966,
  "_extracted_at": "2026-02-10T19:34:55.307389"
}