{
  "metadata": {
    "case_name": "Director of Central Bhowra Colliery Co. v. Chief Inspector of Mines",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Das Gupta, J."
    ],
    "case_number": "Criminal Appeal No. 131 of 1959",
    "date_of_judgment": "1961-02-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On February 20, 1958, there occurred in the Central Bhowra Colliery, in Dhanbad in Bihar an accident as a result of which 23 persons lost their lives.",
      "type": "material",
      "date": "1958-02-20",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "After an inquiry under s.24 of the Mines Act, 1952, into the causes of and the circumstances attending the accident, and the publication of the report of the inquiry, a complaint was prepared by the Regional Inspector of Mines, Dhanbad, under the direction of the Chief Inspector of Mines, Dhanbad, before the Sub-Divisional Officer, Dhanbad, against the appellant for an offence under s.74 of the Mines Act, 1952, for contravention of regulations 107 and 127 of the Coal Mines Regulations, 1957.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "The Central Bhowra Colliery belongs, and belonged at the relevant date to a private company, viz., M/s. Central Bhowra Colliery Co., Private Limited. The appellant is and was a shareholder and a director of this company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After the Sub-Divisional Officer took cognizance of the complaint and issued processes against him, the appellant made an application to the Patna High Court under Art. 226 of the Constitution, for the issue of an appropriate writ for quashing the criminal proceedings. This application was summarily dismissed.",
      "type": "procedural",
      "date": "1958-11-21",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appeal by special leave from the judgment and order dated November 21, 1958, of the Patna High Court in M.J.C. No. 805 of 1958.",
      "type": "procedural",
      "date": "1958-11-21",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "It was not disputed before us that when the Regulations were framed, no Board as required under s.12 had been constituted, and so, necessarily there had been no reference to any Board as required under s.59.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "It has been stated before us however on behalf of the respondents that the Mining Boards constituted under s.10 of the Mines Act, 1923, were continuing to operate at the time these regulations were framed and that there was full consultation with these Mining Boards before these regulations were framed.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether s.76 of the Mines Act, 1952, in pursuance of which the appellant, who was not himself the owner of the colliery company, but only one of the directors and shareholders has been prosecuted, is void as it violates Art.14 of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Coal Mines Regulations, 1957, are invalid having been framed in contravention of s.59(3) of the Mines Act, 1952.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether consultation with Mining Boards constituted under s.10 of the Mines Act, 1923, would be sufficient compliance with s.59(3) of the Mines Act, 1952.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "s.76 of the Mines Act, 1952, is void as it violates Art.14 of the Constitution on the assumption that the word 'any one' in s.76 means only one of the directors, and only one of the shareholders.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Article 14 of the Constitution; s.76 Mines Act 1952"
    },
    {
      "id": "pa2",
      "text": "The Coal Mines Regulations, 1957, are invalid having been framed in contravention of s.59(3) of the Mines Act, 1952, as provisions of s.12 and s.59 are mandatory and no Mining Board was constituted under s.12 of the 1952 Act.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "ss.12, 59 Mines Act 1952"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Mining Boards constituted under s.10 of the Mines Act, 1923, were continuing to operate at the time these regulations were framed and that there was full consultation with these Mining Boards before these regulations were framed.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s.10 Mines Act 1923; s.59(3) Mines Act 1952"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The word 'any one' in s.76 should be interpreted as 'every one'. Thus under s.76 every one of the shareholders of a private company owning the mine, and every one of the directors of a public company owning the mine is liable to prosecution. No question of violation of Art.14 therefore arises.",
      "addresses_issue": "i1",
      "key_observation": "Interpretation from Criminal Appeals Nos. 98 to 106 of 1959."
    },
    {
      "id": "cr2",
      "text": "The provisions in s.59(3) of the Mines Act, 1952, are mandatory. No general rule can be laid down for deciding whether any particular provision in a statute is mandatory... But in each case the court has to decide the legislative intent... An examination of all the relevant circumstances... leads us to the conclusion that the legislative intent was to insist on these provisions for consultation with the Mining Board as a prerequisite for the validity of the regulations.",
      "addresses_issue": "i2",
      "key_observation": "Language emphatic; scheme of Act; public benefit; s.60 provides for emergencies."
    },
    {
      "id": "cr3",
      "text": "As there is no sufficient material before us to decide the question, whether in fact the Mining Boards constituted under s.10 of the 1923 Act were functioning... and whether these Boards were consulted... we have not thought fit to consider here the further question whether if such consultation had taken place that would be sufficient compliance with s.59(3) of the 1952 Act.",
      "addresses_issue": "i3",
      "key_observation": "Factual dispute requires determination by lower court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The word 'any one' in s.76 Mines Act 1952 means 'every one'; no violation of Art.14.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Provisions of s.59(3) Mines Act 1952 are mandatory; regulations invalid without compliance.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Validity of Coal Mines Regulations 1957 depends on factual determination of consultation with 1923 Act Mining Boards and whether that suffices.",
      "resolves_issue": "i3",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Criminal Appeals Nos. 98 to 106 of 1959 (Chief Inspector of Mines etc.)",
      "citation": "1962 1 S.C.R. 9",
      "treatment": "followed",
      "relevance": "Interpreted 'any one' in s.76 as 'every one'"
    },
    {
      "case_name": "State of U.P. v. Manbodhan Lal Srivastava",
      "citation": "1958 S.C.R. 533",
      "treatment": "distinguished",
      "relevance": "Art.320(3) consultation not mandatory; distinguished due to differences in scheme and s.60"
    },
    {
      "case_name": "Montreal Street Railway Company v. Normandin",
      "citation": "1917 A.C. 170",
      "treatment": "distinguished",
      "relevance": "Principle on directory provisions; not applicable here as s.60 averts inconvenience"
    }
  ],
  "statutes_cited": [
    {
      "name": "Mines Act, 1952",
      "sections": [
        "s.12",
        "s.24",
        "s.57",
        "s.58",
        "s.59",
        "s.60",
        "s.74",
        "s.76"
      ],
      "relevance": "Governing inquiry, complaint, prosecution liability, rule-making procedure held mandatory in s.59(3)"
    },
    {
      "name": "Coal Mines Regulations, 1957",
      "sections": [
        "reg.107",
        "reg.127"
      ],
      "relevance": "Alleged contravention leading to prosecution"
    },
    {
      "name": "Mines Act, 1923",
      "sections": [
        "s.10"
      ],
      "relevance": "Mining Boards under this Act allegedly consulted"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.14",
        "Art.226"
      ],
      "relevance": "Art.14 challenge to s.76 dismissed; Art.226 for High Court writ"
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Criminal proceedings remitted to Sub-Divisional Magistrate to decide whether there was consultation with Mining Boards under s.10 Mines Act 1923 before framing Coal Mines Regulations 1957, and if so, whether such consultation sufficed under s.59(3) Mines Act 1952, for disposal in accordance with law.",
    "relief_granted": "Proceedings not quashed; remanded for factual determination on regulations' validity",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the word 'any one' should be interpreted there as 'every one'. Thus under s.76 every one of the shareholders of a private company owning the mine... is liable to prosecution.\"",
      "speaker": "court",
      "significance": "Resolves Art.14 challenge to s.76"
    },
    {
      "text": "\"we are of opinion that the provisions in s.59(3) of the Mines Act, 1952, are mandatory.\"",
      "speaker": "court",
      "significance": "Core holding on mandatory nature of consultation"
    },
    {
      "text": "\"the proper course... is to direct that the criminal proceedings pending in the court of the sub-divisional magistrate be disposed of... after deciding the question whether there was consultation with Mining Boards constituted under s.10 of the Mines Act, 1923...\"",
      "speaker": "court",
      "significance": "Directs remand for factual inquiry"
    }
  ],
  "_case_id": "1961_238",
  "_label": 1,
  "_text_length": 19647,
  "_extracted_at": "2026-02-10T19:33:26.854146"
}