{
  "metadata": {
    "case_name": "Civil Appeals Nos. 201 and 202 of 1961",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Civil Appeals Nos. 201 and 202 of 1961",
    "date_of_judgment": "1961-12-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On November 14, 1951, an order was made by the Company Judge in the Patna High Court for the winding up of the Gaya Sugar Mills Ltd.",
      "type": "procedural",
      "date": "1951-11-14",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On October 6, 1953, an order was made by the learned Judge for action to be taken under s. 153 of the Indian Companies Act.",
      "type": "procedural",
      "date": "1953-10-06",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Mr. G. C. Banerjee, appointed Chairman, held separate meetings of the debenture-holders, secured creditors and unsecured creditors.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In the meeting of unsecured creditors, thirty unsecured creditors either in person or through proxy attended and took part; a resolution proposed by Standard Vacuum Oil Company and seconded by Shri K. C. Agarwal was passed by majority in number as well as three-fourth in value.",
      "type": "material",
      "date": null,
      "source": "chairman_report"
    },
    {
      "id": "f5",
      "text": "Arjun Prasad, claiming to represent Bhandani Bros. and Hindustan Coal Company Ltd., cast votes on behalf of these two companies in support of the resolution.",
      "type": "disputed",
      "date": null,
      "source": "chairman_report"
    },
    {
      "id": "f6",
      "text": "No objection was taken at the meeting to the validity of these votes by any creditors who opposed the resolution; Chairman proceeded on the basis that votes were validly cast.",
      "type": "procedural",
      "date": null,
      "source": "chairman_report"
    },
    {
      "id": "f7",
      "text": "It is not disputed that if these votes were validly cast, the requisite majority of three-fourths in value would be obtained.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "At final hearing before the Court, objection taken by creditors opposing the scheme that votes cast by Arjun Prasad were not valid and requisite majority not obtained.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Company Judge held there was sufficient explanation for not raising objection earlier, entertained it; on merits, resolutions authorising Arjun Prasad sufficient to make his voting valid; rejected objection.",
      "type": "procedural",
      "date": "1958-05-16",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Division Bench of Patna High Court allowed appeal, held delay does not entitle ignoring legal defect, votes not valid; set aside Company Judge's order on this part; rejected contention no appeal lay to HC; gave certificate under Art. 133(1)(a) for SC appeal.",
      "type": "procedural",
      "date": "1958-05-16",
      "source": "high_court"
    },
    {
      "id": "f11",
      "text": "Resolutions passed by Bhandani Brothers and Hindustan Coal Company authorising Arjun Prasad to attend the meeting of unsecured creditors and vote on their behalf.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "No proxy in accordance with Rule 150 given by the two creditor companies.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether from the decision of the Company Judge an appeal lay to the Supreme Court or to the High Court.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the objection to the validity of the votes, not taken earlier, should be allowed at the final hearing.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether resolutions passed by creditor companies authorising Arjun Prasad to attend and vote made his voting valid voting of the companies under s.153 of Indian Companies Act, 1913.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appeal from Company Judge lay directly to Supreme Court, not High Court.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": "s.153(7) Indian Companies Act 1913"
    },
    {
      "id": "pa2",
      "text": "Objection to validity of votes not having been taken earlier should not be allowed at final hearing.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Resolutions by creditor companies authorising Arjun Prasad to attend and vote made his attendance the companies' presence in person and voting valid; directors manage business and can delegate.",
      "supporting_facts": [
        "f5",
        "f11"
      ],
      "legal_basis": "s.153 Indian Companies Act 1913; General Clauses Act 1897; In re Kelantan Coco; s.80 Indian Companies Act 1913"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Votes cast by Arjun Prasad on behalf of Bhandani Brothers and Hindustan Coal Company not valid.",
      "supporting_facts": [
        "f5",
        "f11",
        "f12"
      ],
      "legal_basis": "s.153 Indian Companies Act 1913; Patna High Court Rules 144, 150"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appeal from Company Judge exercising original jurisdiction under Companies Act lies to High Court per Letters Patent Clause 10, not Supreme Court.",
      "addresses_issue": "i1",
      "key_observation": "s.153(7) provides appeal to authority hearing appeals from the Court (High Court); s.3 defines Court as High Court."
    },
    {
      "id": "cr2",
      "text": "Delay in raising objection deplorable but laches cannot justify disobeying Act; Court cannot ignore if requisite majority not obtained on valid votes.",
      "addresses_issue": "i2",
      "key_observation": "If votes invalid, no three-fourth majority, no further action under s.153."
    },
    {
      "id": "cr3",
      "text": "Creditor corporation cannot be present 'in person' under 1913 Act without statutory provision; resolutions do not make attendance 'in person'; no proxy under Rule 150; s.187(1)(b) of 1956 Act not applicable.",
      "addresses_issue": "i3",
      "key_observation": "Agreement only of those present in person or by proxy; company not physical person."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appeal from Company Judge lay to High Court, not Supreme Court.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Objection to invalid votes can be entertained despite delay.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Votes cast by Arjun Prasad not valid votes of the two creditor companies.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "In re Kelantan Coco, Limited and Reduced",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Dealt with representative under s.68 Companies Consolidation Act 1908 for quorum at members' meeting, not creditor company voting."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Companies Act, 1913",
      "sections": [
        "s. 3",
        "s. 153",
        "s. 153(2)",
        "s. 153(7)",
        "s. 80",
        "s. 246"
      ],
      "relevance": "Governs winding up, creditors' meetings, voting in person or by proxy, appeals from Company Judge."
    },
    {
      "name": "Companies Act, 1956",
      "sections": [
        "s. 187(1)(b)",
        "s. 187(2)"
      ],
      "relevance": "New provision for company representative at creditors' meeting, not applicable to 1913 Act case."
    },
    {
      "name": "General Clauses Act, 1897",
      "sections": [
        "definition of 'person'"
      ],
      "relevance": "Company is 'person' but does not enable presence 'in person' without further provision."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 133(1)(a)"
      ],
      "relevance": "Certificate for appeal to Supreme Court granted by High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals, upheld Patna High Court decision that votes cast by Arjun Prasad for Bhandani Brothers and Hindustan Coal Company were invalid, no requisite majority under s.153.",
    "relief_granted": null,
    "costs": "with costs"
  },
  "key_quotes": [
    {
      "text": "a company which is not a physical person cannot be present at any place in person.",
      "speaker": "court",
      "significance": "Core reasoning on why creditor company cannot vote 'in person' without proxy or statutory provision."
    },
    {
      "text": "Laches on the part of some creditors cannot however justify the Chairman or the Court in disobeying the requirements of the Act.",
      "speaker": "court",
      "significance": "Rejects waiver argument despite delay in objection."
    },
    {
      "text": "The conclusion of the High Court that the votes cast by Arjun Prasad on behalf of the two companies... were not valid votes in our opinion, correct.",
      "speaker": "court",
      "significance": "Affirms High Court on main issue."
    }
  ],
  "_case_id": "1961_276",
  "_label": 0,
  "_text_length": 13919,
  "_extracted_at": "2026-02-10T19:33:28.867403"
}