{
  "metadata": {
    "case_name": "State of Uttar Pradesh v. Descendant of Harnarain Singh",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "SHAH, J."
    ],
    "case_number": "Civil Appeal No. 529 of 1958",
    "date_of_judgment": "1961-08-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Under a treaty between the East India Company and Nawab Asafuddaula, the Province of Banaras was ceded about the year 1775 to the East India Company.",
      "type": "background",
      "date": "1775",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Company granted a sanad to Raja Chet Singh, conferring rights and powers previously held by him afresh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Raja Chet Singh granted in jagir pargana Syudpore Bhettree in perpetuity to his Diwan Ousan Singh as remuneration for services.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "East India Company confirmed the grant made by Raja Chet Singh to Ousan Singh.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Raja Chet Singh succeeded by Raja Mahip Narain Singh who executed a sanad affirming the grant to Ousan Singh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Land revenue settlements made in Province of Banaras about 1789-90, but jagirs including Syudpore Bhettree excluded.",
      "type": "background",
      "date": "1789-1790",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Ousan Singh died in or about 1800, succeeded by son Sheo Narain Singh.",
      "type": "background",
      "date": "1800",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In enquiry by Collector of Ghazipore under Regulation 11 of 1819, declared grant to Ousan Singh for life only, not heritable or transferable.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Collector's decision confirmed by Commissioner of Bihar and Banaras, subject to recommendation that Sheo Narain Singh maintained in possession for life.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Government in 1828 directed detailed settlement with village zamindars, offered Sheo Narain Singh allowance for life of one-half of revenue assessed.",
      "type": "procedural",
      "date": "1828",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Sheo Narain Singh declined offer and commenced action in civil court contesting validity of resumption order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Government resolved in July 1830 to revise resumption order, ordered Sheo Narain Singh considered Tahsildar of parganas Syudpore Bhettree, office hereditary so long as conditions not infringed.",
      "type": "material",
      "date": "1830-07",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Sheo Narain Singh died before resolution communicated, succeeded by son Harnarain Singh who withdrew suit and signed compromise incorporating terms.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "On August 19, 1831, Secretary to Government requested preparation of sanad granting parganas on istimrar tenure to Harnarain Singh and heirs in perpetuity on condition of paying 3/4ths of Jamma, with provisions for proprietary claims, Tahsildar office hereditary, 1/4th deduction for separated villages.",
      "type": "material",
      "date": "1831-08-19",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Harnarain Singh refused to accept sanad and Tahsildar office on those terms.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Proceedings for settlement commenced; on November 16, 1832, Settlement Officer reported summary settlement: 166 mahals with zamindars (revenue Rs. 1,28,196), 12 mahals with jagirdar (gross Rs. 22,840, reduced to Rs. 17,130).",
      "type": "procedural",
      "date": "1832-11-16",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Board of Revenue suggested Harnarain Singh receive 1/4th of net collections after deducting Tahsil expenses (Rs. 36,322-8-), recommended sanad conferring pension in perpetuity.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Letter dated September 13, 1837: Lt. Governor suggested remission of 1/4th on 12 mahals (Jamma Rs. 17,130), pension of 1/4th net collections on 166 mahals (Rs. 30,612-8-0).",
      "type": "material",
      "date": "1837-09-13",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Letter dated October 19, 1837: Lt. Governor adopted Board's recommendation, allowance Rs. 30,612-8-0 out of net Jamma Rs. 1,28,960; remission on 12 mahals.",
      "type": "material",
      "date": "1837-10-19",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Letter dated September 14, 1838: Government intended clear fourth of net revenue as pension to Muqurrureedar; arrangement for remission on certain mauzas for convenience; Muqurrureedar owner during life, responsibility for Jumma.",
      "type": "material",
      "date": "1838-09-14",
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Formal sanad contemplated but never issued; allowance paid through Treasury since 1838 to Harnarain Singh and descendants, called malikana, pension or share in revenue.",
      "type": "admitted",
      "date": "1838",
      "source": "court"
    },
    {
      "id": "f22",
      "text": "In 1951, U.P. Legislature enacted Uttar Pradesh Zamindari Abolition and Land Reforms Act 1 of 1951; revenue authorities stopped payment relying on s.6(b).",
      "type": "procedural",
      "date": "1951",
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Respondent (descendant of Harnarain Singh) filed Writ Petition No. 464 of 1954 in Allahabad High Court for mandamus to continue payment of allowance/malikana/pension.",
      "type": "procedural",
      "date": "1954",
      "source": "court"
    },
    {
      "id": "f24",
      "text": "High Court judgment dated March 6, 1956: rejected preliminary objections, held right not an estate, not acquired, no compensation needed; predecessors granted allowance in lieu of abandoning land revenue rights.",
      "type": "procedural",
      "date": "1956-03-06",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the right of the respondent to receive the allowance under the arrangement of 1838 was extinguished as a consequence of vesting of Syudpore Bhettree parganas in the State under s.4 of U.P. Zamindari Abolition and Land Reforms Act, 1951, particularly under s.6(b).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The allowance is an estate or right/privilege in respect of land or land revenue under s.6(b), liable to determination; respondent was proprietor in 12 mahals which vested; entire allowance affected.",
      "supporting_facts": [
        "f21",
        "f22",
        "f24"
      ],
      "legal_basis": "U.P. Zamindari Abolition Act s.3(8), s.4, s.6(b); U.P. Land Revenue Act s.32, s.78"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Right to receive pension/allowance/malikana not an estate; no nexus to zamindari system; not land, immovable property or estate; no compensation contemplated; third party contract right unaffected.",
      "supporting_facts": [
        "f21",
        "f23"
      ],
      "legal_basis": "U.P. Zamindari Abolition Act s.4, s.6; no provision for such compensation in ss.37-45"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Allowance not an estate under s.3(8) as not area in registers; first part of s.6(b) inapplicable.",
      "addresses_issue": "i1",
      "key_observation": "Right to Rs.30,612-8-0 not interest in land or revenue of 166 mahals; granted as consideration for relinquishing jagir rights; measured by 1/4th net revenue but not a right in respect thereof."
    },
    {
      "id": "cr2",
      "text": "For 12 mahals, respondent proprietor; remission of revenue was right in respect of land revenue which determined under s.6(b); cannot convert to positive payment post-vesting.",
      "addresses_issue": "i1",
      "key_observation": "Difference of Rs.5710 was remission; right vested in State."
    },
    {
      "id": "cr3",
      "text": "s.6(b) extinguishes grants/confirmations of title to land or rights/privileges in respect of land/land revenue; allowance not such, as consideration for settlement of claim; no compensation provision supports non-extinguishment.",
      "addresses_issue": "i1",
      "key_observation": "Preamble aims to abolish intermediaries' rights in estates; respondent not intermediary qua allowance; s.45 machinery not extending acquisition."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court right in holding allowance of Rs.30,612-8-0 (for 166 mahals) not extinguished by s.6(b); but wrong for Rs.5710 remission on 12 mahals, which determined.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Uttar Pradesh Zamindari Abolition and Land Reforms Act, 1951",
      "sections": [
        "s.3(8)",
        "s.4",
        "s.6(a)-(j)",
        "s.37-40",
        "s.42",
        "s.44",
        "s.45"
      ],
      "relevance": "Defined estate, vesting, consequences including extinguishment of grants/rights in land/revenue; compensation assessment; applied to hold partial extinguishment"
    },
    {
      "name": "U.P. Land Revenue Act, 1901",
      "sections": [
        "s.32(a)-(e)",
        "s.78"
      ],
      "relevance": "Registers for estate definition; assignees of land revenue; no application to pargana"
    },
    {
      "name": "Regulation 11 of 1819",
      "sections": [],
      "relevance": "Enquiry into proprietary rights; held grant for life only"
    },
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [
        "s.73"
      ],
      "relevance": "Exceptions for attachments/mortgages"
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal allowed in part; High Court order modified: petition dismissed insofar as remission of land revenue on 12 mahals (Rs.5710 approx.); confirmed for allowance of Rs.30,612-8-0 as pension not extinguished.",
    "relief_granted": "Mandamus for payment of Rs.30,612-8-0 annually; no relief for 12 mahals remission.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the allowance was not in respect of land or its revenue it was granted as consideration for settlement of a claim litigated in a civil court relating to that land.\"",
      "speaker": "court",
      "significance": "Distinguishes allowance from right in land/revenue under s.6(b)"
    },
    {
      "text": "\"Absence of a provision in the Act for payment of compensation for a right such as the one claimed by the respondent strongly supports the plea that the right is not intended to be acquired or extinguished.\"",
      "speaker": "court",
      "significance": "Interprets legislative intent; supports non-extinguishment of pension"
    },
    {
      "text": "\"what the Government intended to give is a clear fourth of the net revenue of the Pargana to the Muqurrureedar as pension.\"",
      "speaker": "court",
      "significance": "Quotes 1838 letter characterizing allowance as pension"
    }
  ],
  "_case_id": "1961_149",
  "_label": 0,
  "_text_length": 29306,
  "_extracted_at": "2026-02-10T19:31:24.078130"
}