{
  "metadata": {
    "case_name": "Appellants v. Respondents",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO, J."
    ],
    "case_number": "Civil Appeal No. 497 of 57",
    "date_of_judgment": "1961-05-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents brought a suit with respect to ten plots of land and claimed a declaration that the property belonged to them and prayed for possession of the plots by ejectment of the defendants appellants and for mesne profits.",
      "type": "material",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f2",
      "text": "Besides the appellants, there was another set of defendants to the suit from whom the respondents purchased the property.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellant had taken a loan from the other defendants on a mortgage bond on the basis of which, those defendants instituted a suit in 1932.",
      "type": "background",
      "date": "1932",
      "source": "respondents"
    },
    {
      "id": "f4",
      "text": "This suit was decreed against the appellants, and thereafter the other defendants got the mortgaged property sold by auction in execution and purchased it themselves in 1936.",
      "type": "procedural",
      "date": "1936",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Thereafter the other defendants entered into possession of the property, delivery of which was made to them by court.",
      "type": "procedural",
      "date": "1936",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The other defendants sold the property to the respondents in 1943.",
      "type": "material",
      "date": "1943",
      "source": "respondents"
    },
    {
      "id": "f7",
      "text": "Thereafter the respondents came into possession of the property.",
      "type": "material",
      "date": "1943",
      "source": "respondents"
    },
    {
      "id": "f8",
      "text": "The appellants however began to create trouble from 1942.",
      "type": "disputed",
      "date": "1942",
      "source": "respondents"
    },
    {
      "id": "f9",
      "text": "After the sale to the respondents, the appellants created further trouble which led to proceedings in a criminal court under s. 144 of the Code of Criminal Procedure and the appellants were forbidden from going to the property in dispute.",
      "type": "procedural",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f10",
      "text": "Later on, the appellants were bound down under s. 107 of the Code of Criminal Procedure to keep the peace.",
      "type": "procedural",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f11",
      "text": "In 1945, there was a murder in connection with this property on account of which some of the appellants were tried by the court of session but were acquitted.",
      "type": "background",
      "date": "1945",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "There were further troubles over the crop of these plots in 1945.",
      "type": "disputed",
      "date": "1945",
      "source": "respondents"
    },
    {
      "id": "f13",
      "text": "Eventually after their acquittal by the court of session, the appellants took possession of the property by forcibly dispossessing the respondents.",
      "type": "material",
      "date": "1945",
      "source": "respondents"
    },
    {
      "id": "f14",
      "text": "Consequently the respondents filed the suit out of which this appeal has arisen in July 1946.",
      "type": "procedural",
      "date": "1946-07",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The trial court accepted the case put forward on behalf of the respondents and decreed the suit for possession and ordered that mesne profits would be determined subsequently.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "There was then an appeal by the present appellants to the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The High Court dismissed the appeal except as to one plot with respect to which the suit of respondents was dismissed.",
      "type": "procedural",
      "date": "1955-10-10",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "As the decree was of variance the High Court granted a certificate.",
      "type": "procedural",
      "date": "1955-10-10",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "The only points urged before us by learned counsel for the appellants is with respect to three plots out of the ten which were the subject matter of the suit: 1060, 427 and 1128.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Re Plot No. 1060: The final decree contains ten plots including plot No. 160 but not 1060. Sale certificate also mentions 160 not 1060.",
      "type": "disputed",
      "date": null,
      "source": "appellants"
    },
    {
      "id": "f21",
      "text": "The High Court held that No. 160 is a mistake for 1060, misdescription not disputed identity, as khata number, area, boundaries correspond with 1060.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f22",
      "text": "In the writ of delivery of possession to respondents' predecessors as well as in the sale deed to respondents, correct plot 1060 mentioned.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "There is no plot bearing No. 160 in khata No. 97.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f24",
      "text": "Re Plot No. 427: Originally mortgaged with two other plots in 1920 with the other defendants for Rs. 400.",
      "type": "background",
      "date": "1920",
      "source": "appellants"
    },
    {
      "id": "f25",
      "text": "Later, the mortgagor usufructuarily mortgaged this plot with a number of others with Ramzan Mian and another in 1927 for Rs. 2,500. This mortgage deed does not show that any money was left with the mortgagees to redeem the plots mortgaged with the other defendants.",
      "type": "background",
      "date": "1927",
      "source": "appellants"
    },
    {
      "id": "f26",
      "text": "Soon after the mortgage in favour of Ramzan Mian, the mortgage in favour of the other defendants was redeemed by payment through Nizamud-din and Shams-ud-din on behalf of Ramzan Mian.",
      "type": "disputed",
      "date": "1927",
      "source": "appellants"
    },
    {
      "id": "f27",
      "text": "Ramzan Mian and another were not made parties to the suit of 1932.",
      "type": "disputed",
      "date": "1932",
      "source": "appellants"
    },
    {
      "id": "f28",
      "text": "Finding of the High Court: whatever evidence on record shows that at any rate in 1935 the appellants were in possession of plot No. 427.",
      "type": "admitted",
      "date": "1935",
      "source": "lower_court"
    },
    {
      "id": "f29",
      "text": "Re Plot No. 1128: The case of the appellants with respect to this plot is similar to the case with reference to plot 427.",
      "type": "disputed",
      "date": null,
      "source": "appellants"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether plot No. 1060 was included in the final decree for sale and sale certificate despite being listed as 160, or is it a case of misdescription vs disputed identity.",
      "framed_by": "appellants"
    },
    {
      "id": "i2",
      "text": "Whether appellants can claim subrogation or possession of plot No. 427 on behalf of Ramzan Mian et al due to 1927 mortgage, lack of parties in 1932 suit, and redemption of prior mortgage.",
      "framed_by": "appellants"
    },
    {
      "id": "i3",
      "text": "Whether appellants can claim similar rights for plot No. 1128 as for plot 427.",
      "framed_by": "appellants"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Plot 1060 was neither included in the final decree for sale nor in the sale certificate (listed as 160), so courts below wrong in granting possession to respondents.",
      "supporting_facts": [
        "f20"
      ],
      "legal_basis": "Rambhadra Naidu v. Kadiriyasami Naicker (1921 L.R. 48 I.A. 155)"
    },
    {
      "id": "pa2",
      "text": "For plot 427: Ramzan Mian et al subrogated after redeeming 1920 mortgage; not parties to 1932 suit; no evidence 1927 mortgage redeemed; purchasers got subject to 1927 mortgage; appellants entitled to possession through them.",
      "supporting_facts": [
        "f24",
        "f25",
        "f26",
        "f27"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Similar case for plot 1128 as plot 427.",
      "supporting_facts": [
        "f29"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "For plot 1060: Mere misdescription (omission of zero), identity clear from khata, area, boundaries matching 1060; no plot 160 exists; mentioned correctly in delivery writ and sale deed.",
      "supporting_facts": [
        "f21",
        "f22",
        "f23"
      ],
      "legal_basis": "Thakar Barmha v. Jiban Ram Marwari (1913 L.R. 41 I.A. 38); Gossain Das Kundu v. Mrittunjoy Agnan Sardar (1913 18 C.L.J. 541)"
    },
    {
      "id": "ra2",
      "text": "Appellants' right and title in plot 427 completely gone; cannot claim subrogation for Ramzan Mian; no evidence 1927 mortgage subsisting in 1932 or appellants in possession for them.",
      "supporting_facts": [
        "f28"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rambhadra Naidu distinguished: facts different, here no need to go beyond sale certificate/final decree; mere misdescription as area, khata, boundaries tally with 1060, no plot 160 exists.",
      "addresses_issue": "i1",
      "key_observation": "Where boundaries and plot number given, mistake in plot number is mere misdescription not affecting identity."
    },
    {
      "id": "cr2",
      "text": "Appellants cannot raise subrogation for Ramzan Mian: no agreement in 1927 deed for subrogation, no money left to redeem prior. No evidence 1927 mortgage subsisting in 1932 or appellants holding for them. High Court finding: appellants in possession 1935.",
      "addresses_issue": "i2",
      "key_observation": "Cannot positively hold mortgage subsisting without proof."
    },
    {
      "id": "cr3",
      "text": "Similar to plot 427, contention fails for plot 1128.",
      "addresses_issue": "i3",
      "key_observation": "No other evidence or points urged."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Plot 1060 included despite misdescription of number as 160; identity established.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No subrogation or possession rights for appellants re plot 427; no proof of subsisting mortgage or possession on behalf of mortgagees.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Appellants' contention fails for plot 1128.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rambhadra Naidu v. Kadiriyasami Naicker",
      "citation": "1921 L.R. 48 I.A. 155",
      "treatment": "distinguished",
      "relevance": "Certificates of sale not to be loosely construed; but facts different, no need to go beyond documents here."
    },
    {
      "case_name": "Thakar Barmha v. Jiban Ram Marwari",
      "citation": "1913 L.R. 41 I.A. 38",
      "treatment": "followed",
      "relevance": "Misdescription treated as irregularity if identity clear; not case of disputed identity."
    },
    {
      "case_name": "Gossain Das Kundu v. Mrittunjoy Agnan Sardar",
      "citation": "1913 18 C.L.J. 541",
      "treatment": "referred",
      "relevance": "Misdescription of area; boundaries prevail."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 144",
        "s. 107"
      ],
      "relevance": "Proceedings against appellants for trouble over property."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s. 47"
      ],
      "relevance": "Mentioned in Rambhadra Naidu re no suit possible."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed as contentions re plots 1060, 427 and 1128 fail; upholds High Court decree for possession to respondents except one plot already dismissed by High Court.",
    "relief_granted": "None to appellants; possession and mesne profits to respondents upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the High Court was right in holding that this is a case of misdescription only and that the identity of the property sold is well established namely, that it is plot No. 1060.\"",
      "speaker": "court",
      "significance": "Core holding on plot 1060 misdescription."
    },
    {
      "text": "\"there can be no question of subrogation even if it was open to the appellants to raise that point before us on behalf of Ramzan Mian and another.\"",
      "speaker": "court",
      "significance": "Rejects subrogation claim for plot 427."
    },
    {
      "text": "\"As no other point was urged before us, the whole appeal fails.\"",
      "speaker": "court",
      "significance": "Final disposition of appeal."
    }
  ],
  "_case_id": "1961_206",
  "_label": 0,
  "_text_length": 15703,
  "_extracted_at": "2026-02-10T19:32:51.701235"
}