{
  "metadata": {
    "case_name": "M/s. Gordon Woodroffe Leather Manufacturing Co. Ltd. v. Commissioner of Income-tax",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "KAPUR, J."
    ],
    "case_number": "Civil Appeal No. 62 of 1961",
    "date_of_judgment": "1961-12-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "M/s. Gordon Woodroffe Co. Madras Ltd. was incorporated as a private limited company in 1922 and became the Managing Agent of the public limited company M/s. Gordon Woodroffe Leather Manufacturing Company Ltd., which is the assessee.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "J.H. Philips was employee in the Managing Agent Company from 1922 to 1935 and from 1935 became an employee of the appellant company and became its Director from 1940.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On March 22, 1949, J.H. Philips wrote a letter to the appellant company expressing his intention to resign from the Board as from April 4, 1949 upon his retirement from employment.",
      "type": "material",
      "date": "1949-03-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On March 24, 1949, the Board of Directors passed a resolution accepting his resignation and deciding to pay a gratuity of Rs. 50,000/- (appellant company Rs. 40,000/- and Managing Agent Rs. 10,000/-) in appreciation of his long and valuable services.",
      "type": "material",
      "date": "1949-03-24",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On April 4, 1949, the Board resolution was confirmed and an Extraordinary General Meeting passed a resolution to the same effect.",
      "type": "material",
      "date": "1949-04-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Before the end of accounting year October 31, 1949, Rs. 40,000/- was paid to J.H. Philips.",
      "type": "material",
      "date": "1949-10-31",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The amount was claimed as deduction under s.10(2)(xv) for assessment year 1950-51.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Income-tax Officer disallowed the deduction as there was no pension scheme, payment voluntary, and entry in books indicated capital payment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellate Assistant Commissioner upheld the disallowance.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Income-tax Appellate Tribunal upheld: gratuity for long services, no acceptance of lower salary in expectation, no such practice, remunerated by graduated salary and 2-1/2% commission on profits, no expectancy of recompense, debited to appropriation account not profit and loss account.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "At instance of appellant, case referred to High Court under s.66(1) with question: Whether Rs.40,000/- paid to J.H. Philips was an admissible deduction under s.10(2)(xv).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Madras High Court answered against appellant on December 20, 1956, in Case Referred No. 85 of 1953: payment voluntary, no evidence of expectation or contemplation, not in future interest of business.",
      "type": "procedural",
      "date": "1956-12-20",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sum of Rs. 40,000/- paid to Mr. J. H. Philips on his retirement from the service of the Company was an admissible deduction under Section 10(2)(xv) of the Income-tax Act, 1922.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The amount was paid as a matter of commercial expediency and in the interest of the Company as an inducement to other employees that if they rendered service similarly they would be rewarded.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "s.10(2)(xv)"
    },
    {
      "id": "pa2",
      "text": "Decisive test is whether such payments are likely in future and made as incentive to employees; Company acted without oblique motive and in good faith.",
      "supporting_facts": [],
      "legal_basis": "J.P. Hancok v. General Reversionary Investment Company Ltd.; J.W. Smith v. The Incorporated Council of Law Reporting for England and Wales"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No pension scheme, payment voluntary, entry in books as capital payment.",
      "supporting_facts": [
        "f8",
        "f10"
      ],
      "legal_basis": "s.10(2)(xv)"
    },
    {
      "id": "ra2",
      "text": "Gratuity for long services, no lower salary in expectation, no practice, remunerated by salary and commission, no expectancy, debited to appropriation account.",
      "supporting_facts": [
        "f2",
        "f10"
      ],
      "legal_basis": "s.10(2)(xv)"
    },
    {
      "id": "ra3",
      "text": "Payment on retirement for past services, voluntary, no evidence of expectation or future business interest; must satisfy tests of future interest and connection to further conduct of business.",
      "supporting_facts": [
        "f4",
        "f12"
      ],
      "legal_basis": "s.10(2)(xv)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "On the findings, payment does not fall within s.10(2)(xv): not pursuant to any scheme, not expected by recipient, voluntary in recognition of past service, no practice in company, did not affect quantum of salary.",
      "addresses_issue": "i1",
      "key_observation": "Paid not to facilitate business or as commercial expediency but in recognition of long and faithful service."
    },
    {
      "id": "cr2",
      "text": "Distinguished J.P. Hancok (practice of pensions known, affected salary rates) and J.W. Smith (practice of gratuities).",
      "addresses_issue": "i1",
      "key_observation": "Proper test: was payment made as matter of practice affecting salary quantum, or employee expectation of gratuity, or on ground of commercial expediency to facilitate business."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Gratuity payment of Rs.40,000/- not admissible deduction under s.10(2)(xv) as it was voluntary recognition of past services without practice, expectation, or link to commercial expediency for business.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "J.P. Hancok v. General Reversionary Investment Company Ltd.",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Practice of granting pensions known to employees, affected salary rates; lump sum for annuity held deductible."
    },
    {
      "case_name": "J.W. Smith v. The Incorporated Council of Law Reporting for England and Wales",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Practice of granting gratuities; held proper deduction."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "10(2)(xv)",
        "66(1)"
      ],
      "relevance": "Deduction for expenditure wholly and exclusively for business; reference to High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave against Madras High Court judgment dismissed; Rs.40,000/- gratuity not deductible under s.10(2)(xv).",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In the case of a payment of a gratuity to a retiring employee recognition of his past services, with nothing more cannot, in our opinion satisfy the requirements of Section 10(2)(xv), even if those requirements are judged from the view point of commercial expediency.\"",
      "speaker": "lower_court",
      "significance": "High Court's test for deductibility under s.10(2)(xv)"
    },
    {
      "text": "The proper test to apply in this case is, was the payment made as a matter of practice which affected the quantum of salary or was there an expectation by the employee of getting a gratuity or was the sum of money expended on the ground of commercial expediency and in order indirectly to facilitate the carrying on of the business.",
      "speaker": "court",
      "significance": "Supreme Court's decisive test for gratuity deductibility"
    }
  ],
  "_case_id": "1961_401",
  "_label": 0,
  "_text_length": 9204,
  "_extracted_at": "2026-02-10T19:35:14.938279"
}