{
  "metadata": {
    "case_name": "Ranjit Singh v. Commissioner of Income-tax, Lucknow and Others",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das, J."
    ],
    "case_number": "Writ Petition No. 85 of 1959",
    "date_of_judgment": "1961-04-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In 1948 the Central Government referred a number of cases in which the petitioner was concerned to the Income-tax Investigation Commission set up under the Taxation on Income (Investigation Commission) Act, 1947.",
      "type": "background",
      "date": "1948",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On May 30, 1948, the Secretary of the Commission issued a notice to the petitioner to furnish a list of businesses or concerns in which the petitioner was interested and to produce the account books, registers etc. relating thereto. The petitioner complied with the notice.",
      "type": "procedural",
      "date": "1948-05-30",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "An Authorised Official appointed by the Commission commenced an investigation into the cases in February, 1949, and submitted a report to the Commission.",
      "type": "procedural",
      "date": "1949-02",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Commission heard the petitioner and on April 16, 1949, submitted a report under s. 8-A(1) of the Act finding total tax payable on undisclosed income upto March 31, 1947 as Rs. 6,61,917 recoverable from Mr. Ranjit Singh and family assets, including properties acquired between 1939 and 1947 in names of wife and sons; recommended no penalty and time for payment.",
      "type": "material",
      "date": "1949-04-16",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On November 7, 1949, the petitioner, his wife and two sons submitted a petition to the Commission accepting the findings and offering to pay Rs. 6,61,917 in instalments: Rs.1,00,000 by 31/3/1951, Rs.2,31,000 by 31/3/1952, Rs.3,30,917 by 30/6/1952, with conditions for extension and default.",
      "type": "admitted",
      "date": "1949-11-07",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "On November 21, 1949, Central Government accepted the report and terms of settlement and passed order under s. 8-A(2) directing demand notice under s.29 of Indian Income-tax Act, 1922, and enforcement proceedings.",
      "type": "procedural",
      "date": "1949-11-21",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Demand notice issued to petitioner on December 2, 1949 (as alleged by respondents); petitioner alleges received in or about April, 1950.",
      "type": "disputed",
      "date": "1949-12-02",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Certain payments made by petitioner in pursuance of demand notice but unable to make full payment within stipulated periods, resulting in whole outstanding amount becoming immediately payable per settlement terms.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Properties of petitioner and family attached by Collectors of Dehra Dun, Kanpur and Lucknow in pursuance of orders from Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "On June 8, 1959, petitioner filed writ petition challenging legality of demand notice dated December 2, 1949, and subsequent proceedings.",
      "type": "procedural",
      "date": "1959-06-08",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Petitioner paid part of tax on different dates without objection to receipt date until 1959.",
      "type": "background",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the demand notice dated December 2, 1949, and subsequent proceedings violate Art.14 of the Constitution as being retrospective or discriminatory after coming into force of Constitution on January 26, 1950.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether after order under s.8-A(2), a fresh assessment was necessary for recovery proceedings.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Date of receipt of demand notice by petitioner.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Demand notice received after Constitution came into force (April 1950), and proceedings violate fundamental rights under Arts.14, 19(1)(g), 31; specifically Art.14 equal protection as treated differently from other contractual debtors to State, with drastic recovery under s.46 IT Act.",
      "supporting_facts": [
        "f7",
        "f10"
      ],
      "legal_basis": "Articles 14, 19(1)(g), 31 of Constitution"
    },
    {
      "id": "pa2",
      "text": "After Central Government order under s.8-A(2), fresh assessment necessary; none made, so recovery illegal.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.8-A Taxation on Income (Investigation Commission) Act, 1947; Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Constitution prospective, not retrospective; all proceedings including demand notice completed before January 26, 1950; petitioner informed early December 1949.",
      "supporting_facts": [
        "f6",
        "f7",
        "f11"
      ],
      "legal_basis": "Constitution prospective"
    },
    {
      "id": "ra2",
      "text": "No fresh assessment required under s.8-A(2); provides for direct enforcement and recovery as arrears of income-tax under ss.44,46 IT Act.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "s.8-A(2) Taxation on Income (Investigation Commission) Act, 1947"
    },
    {
      "id": "ra3",
      "text": "No violation of Art.14; petitioner in special class of tax evaders under uniform procedure, not general debtors.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Article 14 of Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Constitution prospective, not retrospective; all proceedings including service of demand notice completed before January 26, 1950; petitioner's claim of April 1950 receipt rejected based on records and conduct.",
      "addresses_issue": "i1",
      "key_observation": "Proceedings against petitioner culminating in service of notice of demand completed before Constitution."
    },
    {
      "id": "cr2",
      "text": "No fresh assessment required under s.8-A(2); scheme provides for enforcement of settlement terms directly as arrears of income-tax via ss.44,46 IT Act, without assessment.",
      "addresses_issue": "i2",
      "key_observation": "Sub-s.(2) ends by deeming sum as income-tax arrears for recovery under ss.44,46."
    },
    {
      "id": "cr3",
      "text": "No discrimination under Art.14; petitioner belongs to special class of tax evaders settling under s.8-A, treated uniformly; recovery as income-tax arrears reasonable, not like general contractual debtors.",
      "addresses_issue": "i1",
      "key_observation": "Classification reasonable having just relation to object; legislature may prescribe recovery for government dues equally."
    },
    {
      "id": "cr4",
      "text": "Earlier decisions invalidated discriminatory procedures post-Constitution; here all pre-Constitution, including settlement and demand notice.",
      "addresses_issue": "i1",
      "key_observation": "Vital distinction: everything concluded before Constitution."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Constitution does not apply retrospectively to pre-Constitution proceedings; demand notice and enforcement valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No fresh assessment required under s.8-A(2) for recovery of settlement sums as income-tax arrears.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No violation of Art.14; reasonable classification of tax evaders, uniform recovery procedure.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Suraj Mall Mohta and Co. v. A. V. Visvanatha Sastri and Another",
      "citation": "1954",
      "treatment": "followed",
      "relevance": "Held s.5(4) of Act void under Art.14."
    },
    {
      "case_name": "Shree Meenakshi Mills Ltd., Madurai v. V. Viswanatha Sastri and Another",
      "citation": "1955 1 S.C.R. 787",
      "treatment": "followed",
      "relevance": "Held s.5(1) of Act bad under Art.14 for allowing selective reference."
    },
    {
      "case_name": "M. CT. Muthiah and two Others v. The Commissioner of Income-tax, Madras and Another",
      "citation": "1955 2 S.C.R. 1247",
      "treatment": "followed",
      "relevance": "Invalidated pending investigations and assessments post-Constitution under Act."
    },
    {
      "case_name": "Basheshar Nath v. The Commissioner of Income-tax, Delhi Rajasthan and Another",
      "citation": "1959 Supp. 1 S.C.R. 528",
      "treatment": "distinguished",
      "relevance": "Settlement post-Constitution via discriminatory procedure invalid; distinguished as here pre-Constitution."
    },
    {
      "case_name": "Syed Qasim Razvi v. The State of Hyderabad and Others",
      "citation": "1953 S.C.R. 589",
      "treatment": "referred",
      "relevance": "Principle not applicable as discriminatory process continued post-Constitution in Basheshar."
    }
  ],
  "statutes_cited": [
    {
      "name": "Taxation on Income (Investigation Commission) Act, 1947 (Act XXX of 1947)",
      "sections": [
        "s.5(1)",
        "s.5(4)",
        "s.8(1)",
        "s.8(2)",
        "s.8-A(1)",
        "s.8-A(2)"
      ],
      "relevance": "Set up Commission; reports, settlements, government orders directing demand and enforcement; provisions held discriminatory post-Constitution in parts."
    },
    {
      "name": "Indian Income-tax Act, 1922 (XI of 1922)",
      "sections": [
        "s.23(5)(a) second proviso",
        "s.24B",
        "s.25A(2) proviso",
        "s.29",
        "s.34",
        "s.44",
        "s.46"
      ],
      "relevance": "Demand notice, recovery as arrears, attachments; applied to enforce settlement sums."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.14",
        "Art.19(1)(g)",
        "Art.31",
        "Art.32"
      ],
      "relevance": "Fundamental rights claimed violated; Art.14 equal protection central issue."
    },
    {
      "name": "Indian Income-tax Amendment Act, 33 of 1954",
      "sections": [
        "amending s.34 IT Act 1922"
      ],
      "relevance": "Post-Suraj Mall amendment leading to challenge of s.5(1)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The writ petition challenging the demand notice and recovery proceedings as violative of Art.14 is dismissed; all proceedings completed pre-Constitution, no discrimination or need for fresh assessment; enforcement valid.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the Constitution is prospective and not retrospective.\"",
      "speaker": "court",
      "significance": "Core reason rejecting challenge to pre-Constitution proceedings."
    },
    {
      "text": "\"The petitioner belongs to a special class who had evaded payment of Income-tax and had entered into a settlement to pay the amount due as income-tax or arrear of income-tax.\"",
      "speaker": "court",
      "significance": "Justifies classification under Art.14."
    },
    {
      "text": "\"barring the cases of persons which were already concluded by reports made by the Commission and the directions given by the Central Government under section 8(2) of the Act XXX of 1947... those cases which were pending on the 26th January 1950... would be hit by Article 14.\"",
      "speaker": "court",
      "significance": "From Muthiah case, distinguishing pending vs concluded cases."
    }
  ],
  "_case_id": "1961_201",
  "_label": 0,
  "_text_length": 20926,
  "_extracted_at": "2026-02-10T19:32:45.218694"
}