{
  "metadata": {
    "case_name": "Appellant v. Respondents",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "RAGHUBAR DAYAL, J."
    ],
    "case_number": "Civil Appeal No. 236 of 1959",
    "date_of_judgment": "1961-05-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On August 9, 1950, the appellant applied to the State Government, Madhya Pradesh, for the grant of a prospecting licence for manganese ore over an area of 83.18 acres, comprising khasra No. 1 of mouza Seoni Bhondki.",
      "type": "material",
      "date": "1950-08-09",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The State Government granted the prospecting licence for this area on June 18, 1951 and intimated that the prospecting licence form which was pending approval by the Union Government, would be executed in due course.",
      "type": "material",
      "date": "1951-06-18",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On April 21, 1951, respondent No. 3 applied for the grant of mining lease over 32 acres out of the aforesaid area of 83.18 acres.",
      "type": "material",
      "date": "1951-04-21",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On October 20, 1951, the State Government informed respondent No. 3 that area had been already granted to the appellant under prospecting licence, and it was not available to him.",
      "type": "procedural",
      "date": "1951-10-20",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On November 26, 1951, respondent No. 3 applied for review to the Union Government under r. 57 of the Mineral Concession Rules, 1949.",
      "type": "procedural",
      "date": "1951-11-26",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On September 5, 1952, the Union Government wrote to the State Government that its order regarding the grant of prospecting licence to the appellant over an area of 83.18 acres should be modified to the extent that the area granted under the prospecting licence be restricted to the virgin area of 51.18 acres, as the area of 32 acres had been previously held under a mining lease by Messrs Akbar Ali Munwar Ali and had not by then been thrown open for regrant. It was further directed that area of 32 acres be thrown open for re-grant.",
      "type": "material",
      "date": "1952-09-05",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In consequence of this direction by the Union Government, the State Government modified its order dated June 18, 1951, granting the prospecting licence to the appellant and restricted that licence to the virgin area of 51.18 acres only.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Some time in April 1953, applications were invited for the grant of mining lease with respect to the area of 32 acres.",
      "type": "procedural",
      "date": "1953-04",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The appellant submitted an application for the grant of the mining lease for 83.18 acres.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The respondent No. 3 did not file any fresh application.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On April 30, 1954, the Government granted a mining lease for manganese ore over an area of 51.18 acres and did not grant the lease for the area of 32 acres, stating in its letter to the Deputy Commissioner that area had been granted to respondent No. 3 under mining lease, as directed by the Union Government, under r. 57 of the Mineral Concession Rules.",
      "type": "material",
      "date": "1954-04-30",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Sometime thereafter, on May 17, 1954, the appellant filed the petition under Art. 226 of the Constitution in the High Court, praying for the quashing of the order of the Union Government, respondent No. 2, granting 32 acres of area in dispute to respondent No. 3, by the issue of a writ of certiorari and also for the issue of direction that the appellant was entitled to the mining lease in respect of that area.",
      "type": "procedural",
      "date": "1954-05-17",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The High Court dismissed this petition on February 24, 1956, holding that in order to give the relief prayed for it was essential that the order of the Union Government quashed and, as the High Court could not reach it, it would be incongruous to direct the State Government to ignore the order of the Union Government.",
      "type": "procedural",
      "date": "1956-02-24",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "On April 7, 1954, the Union Government passed an order cancelling the orders of the State Government dated October 20, 1951, and directing the State Government to grant a mining lease for manganese ore over an area of 32 acres to respondent No. 3, provided he was otherwise eligible.",
      "type": "material",
      "date": "1954-04-07",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court had jurisdiction to quash the order of the Union Government granting 32 acres to respondent No. 3 and direct the State Government to grant mining lease to the appellant.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Union Government passed its order without notice to the appellant or opportunity to be heard on the review application filed by respondent No. 3.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the Union Government had jurisdiction to pass the order dated April 7, 1954, under r. 57 when no review application by respondent No. 3 was pending, as it had been disposed of on September 5, 1952.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the State Government's order granting mining lease is independent or subject to Union Government's review order.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order of the Union Government was not an order within its jurisdiction inasmuch as it passed it without issuing notice to the appellant or affording him an opportunity to be heard on the review application filed by respondent No. 3.",
      "supporting_facts": [
        "f5",
        "f14"
      ],
      "legal_basis": "r. 57 of the Mineral Concession Rules, 1949"
    },
    {
      "id": "pa2",
      "text": "The Union Government had no jurisdiction to pass the order dated April 7, 1954, under r. 57 of the Rules when, in fact, no application for review by respondent No. 3 was pending before it, as the review application filed by respondent No. 3 on November 26, 1951, had been disposed of by the Union Government on September 5, 1952.",
      "supporting_facts": [
        "f5",
        "f6",
        "f14"
      ],
      "legal_basis": "r. 57 of the Mineral Concession Rules, 1949"
    },
    {
      "id": "pa3",
      "text": "The effective order is ultimately of the State Government and therefore can be quashed by the High Court.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The review application was not finally disposed of by the letter dated September 5, 1952; the Union Government never treated the review proceedings as disposed of, and respondent No. 3 was informed the matter was under consideration.",
      "supporting_facts": [
        "f6",
        "f14"
      ],
      "legal_basis": "r. 57 of the Mineral Concession Rules, 1949"
    },
    {
      "id": "ra2",
      "text": "The State Government has the power to grant mining lease under the Rules, but subject to orders on review by the Union Government; its order is final subject to Union Government order.",
      "supporting_facts": [
        "f11",
        "f14"
      ],
      "legal_basis": "Mineral Concession Rules, 1949"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The High Court of Nagpur could not quash the order of the Union Government as it did not exercise territorial jurisdiction over the Union Government.",
      "addresses_issue": "i1",
      "key_observation": "High Court could not issue directions prayed for even if it could, till the order of the Union Government granting the mining lease of 32 acres to respondent No. 3 was set aside."
    },
    {
      "id": "cr2",
      "text": "The question of Union order without notice was not raised before High Court and would not have been within High Court's jurisdiction.",
      "addresses_issue": "i2",
      "key_observation": "Unnecessary to consider points urged for the appellant."
    },
    {
      "id": "cr3",
      "text": "The review application was not finally disposed of on September 5, 1952; the letter conveyed an order disposing of the review, but proceedings continued under consideration until April 7, 1954.",
      "addresses_issue": "i3",
      "key_observation": "Union Government never treated review as disposed of."
    },
    {
      "id": "cr4",
      "text": "State Government's granting of lease is subject to Union Government's review order; State only effectuates Union order which remains final.",
      "addresses_issue": "i4",
      "key_observation": "Contention that effective order is of State Government not open to appellant."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court lacked territorial jurisdiction to quash Union Government's order.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Review proceedings were pending before Union Government on April 7, 1954.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "State Government's order effectuates Union Government's final order under review powers.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for writ petition filed by appellant in High Court"
    },
    {
      "name": "Mineral Concession Rules, 1949",
      "sections": [
        "r. 57"
      ],
      "relevance": "Governs review applications; Union Government directed modification and grant under this rule"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the High Court order dismissing the Art. 226 petition is dismissed as having no force. High Court lacked jurisdiction to quash Union Government order or direct State Government to ignore it.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "This appeal has no force.",
      "speaker": "court",
      "significance": "Concludes dismissal of appeal"
    },
    {
      "text": "The order of the Union Government could not be quashed by the High Court of Bombay, as it did not exercise territorial jurisdiction over the Union Government.",
      "speaker": "court",
      "significance": "Core reason for upholding High Court dismissal"
    },
    {
      "text": "When the Union Government directed the grant of the mining lease for an area of 32 acres to respondent No. 3, the State Government had to order such grant, in accordance with the directions of the Union Government.",
      "speaker": "court",
      "significance": "Clarifies hierarchy of authority under rules"
    }
  ],
  "_case_id": "1961_207",
  "_label": 0,
  "_text_length": 7306,
  "_extracted_at": "2026-02-10T19:32:51.028904"
}