{
  "metadata": {
    "case_name": "Heirs of Abdul Wahid v. Syed Unnissa and Ors.",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 512 of 1957",
    "date_of_judgment": "1961-02-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In village of Cavelong, District Chingleput, State of Madras, ancient Durgah with appurtenant Masjid, granted two villages in inam by Nawab of Carnatic for maintenance.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Income of institution after expenses shared by descendants in four families in equal shares; by custom, females and persons claiming through females excluded, distributed amongst males descended in male line.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In original suit No. 27 of 1940, Subordinate Judge Chingleput, scheme framed for administration of Durgah and Masjid, Board of trustees appointed; provision for distribution of surplus income amongst members of four families.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Genealogy: Sheik Mohammad's descendants include Fakruddin (received 1/8th share of income, entitled to perform Urs once in eight years); Fakruddin died in 1921 leaving wife Sulaiman Bi (plaintiff No. 2) and daughters Rahmat Unnissa (defendant No. 2) and Syed Unnissa (plaintiff No. 1). Nayeemuddin died unmarried; Abdul Wahid son of Nayeemuddin.",
      "type": "background",
      "date": "1921",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In 1926, Fakruddin's turn to perform Urs; performed on behalf of widow and daughters by their deputies.",
      "type": "material",
      "date": "1926",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "In 1934, next Urs turn obstructed by Abdul Wahid (son of Nayeemuddin, other branch of Sheik Mohammad's family).",
      "type": "disputed",
      "date": "1934",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Suit No. 156 of 1937 filed by plaintiffs 1 and 2 (Syed Unnissa and Sulaiman Bi) in District Munsif Chingleput for declaration of entitlement to enjoy properties, manage Durgah, perform Urs every eight years since 1934, receive incomes etc., and injunction against Abdul Wahid.",
      "type": "procedural",
      "date": "1937",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Rahmat Unnissa (eldest daughter) impleaded as defendant No. 2; Abdul Wahid (defendant No. 1) died during pendency, defendants 4 to 10 brought on record as heirs excluding daughter of Abdul Wahid.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Trial Judge and first appellate court held immemorial custom precluding plaintiffs from performing services or sharing income etc.; suit dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Madras High Court in Second Appeal No. 2349 of 1946 (judgment dated August 29, 1952) held Shariat Act 1937 applies, income shared per personal law; suit not barred by limitation, maintainable; decree in favor of plaintiffs.",
      "type": "procedural",
      "date": "1952-08-29",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Plaintiff No. 1 was 19 years old at date of suit.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Plaintiffs not in enjoyment of Fakruddin's share since 1921.",
      "type": "material",
      "date": "1921",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Trial court found duties of offices (Peshimam, Khatib, Mujavar) could be performed through deputies.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether suit as framed for declaration and injunction is maintainable.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether suit barred by limitation.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether immemorial custom excluding females from sharing income and performing services prevails, or Shariat Act 1937 as amended applies.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether Shariat Act applies retrospectively to pending suits.",
      "framed_by": "court"
    },
    {
      "id": "i5",
      "text": "Whether under Muslim Personal Law females excluded from performing duties of Peshimam, Khatib, Mujavar even through deputies.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Immemorial custom precludes females from performing services or sharing income, emoluments, perquisites; office of Peshimam, Khatib, Mujavar only by males.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Suit barred by limitation (more than 12 years from Fakruddin's death).",
      "supporting_facts": [
        "f4",
        "f12"
      ],
      "legal_basis": "Indian Limitation Act"
    },
    {
      "id": "pa3",
      "text": "Suit for mere declaration not maintainable.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Specific Relief Act s. 42"
    },
    {
      "id": "pa4",
      "text": "Even under Muslim Personal Law, females excluded from duties of Peshimam etc., cannot perform through deputies.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Muslim Personal Law (Shariat)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Entitled to share in income and perform Urs per their turn as heirs of Fakruddin.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Suit for declaration with consequential injunction is maintainable, not mere declaration simpliciter.",
      "addresses_issue": "i1",
      "key_observation": "Injunction is further relief under s. 42 Specific Relief Act."
    },
    {
      "id": "cr2",
      "text": "Suit not barred by limitation; governed by Art. 120 Limitation Act; right to sue accrues on infringement or threat; trustees not denying rights, mere denial by defendants does not start limitation.",
      "addresses_issue": "i2",
      "key_observation": "Plaintiff 1 saved by ss. 6,8 Limitation Act due to minority; trustees willing to pay legitimate shares."
    },
    {
      "id": "cr3",
      "text": "Immemorial custom inapplicable post Shariat Act 1937; s.2 mandates Muslim Personal Law notwithstanding custom in specified matters including trusts, wakfs.",
      "addresses_issue": "i3",
      "key_observation": "Amended by Madras Act 18 of 1949 explicitly includes wakfs without exception for charities."
    },
    {
      "id": "cr4",
      "text": "Shariat Act applies to pending suits/proceedings; retrospective operation from language overriding customs; not affecting finally decided cases.",
      "addresses_issue": "i4",
      "key_observation": "Presumption against retrospectivity rebutted by explicit language."
    },
    {
      "id": "cr5",
      "text": "Plea on females excluded from offices even via deputies not raised before High Court; trial court found duties performable by deputies; no evidence income conditional on performing duties.",
      "addresses_issue": "i5",
      "key_observation": "Plaintiffs entitled to income share under Shariat Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Suit maintainable as declaration with injunction.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Suit not barred by limitation.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Shariat Act 1937 as amended applies, overriding custom; plaintiffs entitled to share income as heirs.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Shariat Act applies retrospectively to pending proceedings.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kunj Behari Prasadji Purshottam Prasadji v. Keshavlal Hiralal",
      "citation": "I.L.R. 1904 XXVIII Bom. 567",
      "treatment": "followed",
      "relevance": "Suit for declaration and injunction maintainable under s.42 Specific Relief Act."
    },
    {
      "case_name": "Syed Roshan Ali v. Mt. Behmat Bibi",
      "citation": "A.I.R. 1943 Lah. 219",
      "treatment": "distinguished",
      "relevance": "Rejected view that Shariat Act does not take away pre-1937 rights; overlooked explicit retrospective language."
    }
  ],
  "statutes_cited": [
    {
      "name": "Shariat Act, 1937",
      "sections": [
        "s. 2"
      ],
      "relevance": "Mandates Muslim Personal Law (Shariat) notwithstanding custom in intestate succession, trusts, wakfs etc.; amended by Madras Act 18 of 1949."
    },
    {
      "name": "Specific Relief Act",
      "sections": [
        "s. 42"
      ],
      "relevance": "Injunction as further relief makes declaration suit maintainable."
    },
    {
      "name": "Indian Limitation Act",
      "sections": [
        "ss. 6, 8",
        "Art. 120"
      ],
      "relevance": "Minority extension for plaintiff 1; 6 years from accrual of right to sue for declaration and injunction."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 136"
      ],
      "relevance": "Special leave appeal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Madras High Court decree; applied Shariat Act overriding custom; plaintiffs entitled to declaration of rights to share income, perform Urs etc., and injunction; appeal dismissed.",
    "relief_granted": "Declaration and injunction to respondents (original plaintiffs) upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Notwithstanding any customs or usage to the contrary... the rule of decision in cases where the parties are Muslims shall be the Muslim Personal Law (Shariat).\"",
      "speaker": "court",
      "significance": "Core provision of Shariat Act s.2 overriding custom."
    },
    {
      "text": "The period of six years prescribed by art. 120 has to be computed from the date when the right to sue accrues and there could be no right to sue until there is an accrual of the right asserted... and its infringement.",
      "speaker": "court",
      "significance": "Explains why limitation does not bar suit."
    },
    {
      "text": "The intention of the legislature appears to be clear the Act applies to all suits and proceedings which were pending on the date when the Act came into operation.",
      "speaker": "court",
      "significance": "Holds retrospective application to pending cases."
    }
  ],
  "_case_id": "1961_237",
  "_label": 0,
  "_text_length": 14546,
  "_extracted_at": "2026-02-10T19:32:46.867813"
}