{
  "metadata": {
    "case_name": "Sub-Divisional Magistrate, Dhenkanal v. High Court of Orissa",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was Sub-Divisional Magistrate at Dhenkanal in 1957.",
      "type": "background",
      "date": "1957",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In a criminal matter, Magistrate III class, Dhenkanal passed order under s. 522 CrPC putting complainant Golam Mohammed in possession of property, executed on October 14, 1955.",
      "type": "material",
      "date": "1955-10-14",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Order confirmed by Additional District Magistrate in appeal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "High Court set aside the order in revision on August 27, 1957.",
      "type": "material",
      "date": "1957-08-27",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Opposite party Sarif Beg made application on November 20, 1957 before appellant for redelivery of possession, opposed by Golam Mohammed.",
      "type": "procedural",
      "date": "1957-11-20",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Application heard on November 21, 1957, order reserved till November 23, 1957, adjourned to November 27, 1957.",
      "type": "procedural",
      "date": "1957-11-21",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On November 27, 1957, application allowed, compliance directed by December 2, 1957.",
      "type": "material",
      "date": "1957-11-27",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Golam Mohammed made application to High Court for review of its previous order, admitted by P. V. Balakrishna Rao J. on November 25, 1957, with interim stay of proceedings before Sub-Divisional Magistrate, but no direction to communicate by telegram.",
      "type": "procedural",
      "date": "1957-11-25",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "On November 26, 1957, application with illegible signature made to Magistrate stating High Court stayed further proceedings, accompanied by telegram addressed to Mr. Neelakanth Misra, Pleader, Dhenkanal: 'Golam Mohammads case further proceedings stayed, Ram.'",
      "type": "disputed",
      "date": "1957-11-26",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Sub-Divisional Magistrate was out of headquarters on November 25, 1957; second officer directed application be placed before him on return.",
      "type": "procedural",
      "date": "1957-11-25",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "On November 27, 1957, Sub-Divisional Magistrate endorsed on application: 'No action can be taken on telegram, File.' and proceeded to deliver order on restitution.",
      "type": "material",
      "date": "1957-11-27",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Copy of High Court order received at Dhenkanal on November 28, 1957; Sub-Divisional Magistrate absent, second officer entered: 'Seen. A.D.Ms D.S. No. 326 dated 28-11-57. In Cr. Misc. Case No. 90/57 Honble High Court has stayed further proceedings. Stay further proceedings. Put up before S.D.M. Inform parties.' No writ for re-delivery issued.",
      "type": "material",
      "date": "1957-11-28",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "On perusal of records on August 18, 1958 [text says 1957, likely error], High Court ordered notice to appellant on August 25, 1958 to show cause why committed for contempt.",
      "type": "procedural",
      "date": "1958-08-25",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Appellant filed lengthy statement explaining facts, no intention to disobey, order passed because application not accompanied by affidavit or signed by complainant/lawyer, acted in good faith, tendered apology if found guilty.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "High Court regarded apology as conditional, not accepted; found appellant guilty of contempt, sentenced to fine of Rs. 100; dismissed review application.",
      "type": "material",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether it is necessary to make the Chief Justice and Judges of the High Court parties to an appeal against conviction for contempt of court.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Sub-Divisional Magistrate committed contempt of court by disobeying the High Court's stay order.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Had no slightest intention to disobey High Court orders; passed order on November 27, 1957 because complainant's application for stay not accompanied by affidavit nor signed by complainant or lawyer.",
      "supporting_facts": [
        "f9",
        "f11",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No intention to prejudice course of justice; acted in good faith in discharge of official duties; tendered apology.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant guilty of contempt by disobeying stay order despite knowledge via application and telegram.",
      "supporting_facts": [
        "f9",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Apology was conditional and not accepted.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Judges of High Court not interested parties like litigants; no warrant for making Chief Justice and Judges parties to appeals against contempt convictions; practice should be discontinued; title should be 'In re: the alleged contemnor'.",
      "addresses_issue": "i1",
      "key_observation": "Judges merely decide matters like in any suit or appeal."
    },
    {
      "id": "cr2",
      "text": "For subordinate court to be guilty of contempt by disobeying superior court order, disobedience must be intentional with knowledge of order from authorised or authentic source.",
      "addresses_issue": "i2",
      "key_observation": "No room for inferring intention without knowledge; ignorance or accidental disobedience not contempt."
    },
    {
      "id": "cr3",
      "text": "Application had illegible signature, not countersigned by pleader, no affidavit; telegram addressed to pleader with no indication of sender's authority (who is 'Ram?'); not from court or authorised advocate.",
      "addresses_issue": "i2",
      "key_observation": "No guarantee of truth; Magistrate entitled to ignore."
    },
    {
      "id": "cr4",
      "text": "On receiving official copy on November 28, proceedings stayed and no writ issued, showing no intention to disobey.",
      "addresses_issue": "i2",
      "key_observation": "Status quo maintained upon authentic knowledge."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Practice of making Chief Justice and Judges parties to contempt appeals discontinued; proceedings titled 'In re: alleged contemnor'.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Refusal to act on telegram and application did not amount to contempt of court as knowledge not from authentic source and no intentional disobedience.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ambard v. Attorney-General for Trinidad and Tobago",
      "citation": "1936 A.C. 322",
      "treatment": "referred",
      "relevance": "Attorney General made party to appeal from contempt conviction."
    }
  ],
  "statutes_cited": [
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "s. 522"
      ],
      "relevance": "Order under this section for possession executed and later set aside."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court's conviction for contempt set aside; Sub-Divisional Magistrate not guilty of contempt.",
    "relief_granted": "Conviction and sentence quashed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Before a subordinate court can be found guilty of disobeying the order of the superior court and thus to have committed contempt of court, it is necessary to show that the disobedience was intentional.\"",
      "speaker": "court",
      "significance": "Defines essential element for contempt by subordinate court."
    },
    {
      "text": "\"The knowledge must, however, be obtained from a source which is either authorised or otherwise authentic.\"",
      "speaker": "court",
      "significance": "Clarifies requirement for valid knowledge of order."
    },
    {
      "text": "\"We, therefore, hold that his refusal to act on the telegram did not amount to contempt of court.\"",
      "speaker": "court",
      "significance": "Direct holding on facts."
    }
  ],
  "_case_id": "1961_118",
  "_label": 1,
  "_text_length": 11541,
  "_extracted_at": "2026-02-10T19:31:16.353713"
}