{
  "metadata": {
    "case_name": "Public limited company (aluminium manufacturer) v. Income-tax Appellate Tribunal",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "S. K. DAS J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee, appellant, is a public limited company with its registered office in Calcutta. Its principal business is the manufacture of aluminium ingots, sheets circles, aluminium alloys, etc., and production of various aluminium or alloy products.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Under a deed of agreement dated January 31, 1947, made with the appellant the Aluminium Laboratories Ltd., Montreal, Canada, a foreign company, having laboratories and research facilities in Canada and the United Kingdom agreed in consideration of an annual retainer fee to provide regularly and diligently technical and engineering informations, advice and service, etc., to the appellant on the basis of research carried on in their laboratories.",
      "type": "background",
      "date": "1947-01-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The remuneration which the foreign company had to be paid was payable at Montreal in Canadian dollars.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The sums payable to the foreign company were chargeable to income-tax, the liability to deduct and pay tax under section 18(3A) and 18(3B) arose not when the sums were credited to the account of the foreign company but at the time of actual physical payment.",
      "type": "procedural",
      "date": null,
      "source": "appellate_assistant_commissioner"
    },
    {
      "id": "f5",
      "text": "Income-tax Appellate Tribunal, Calcutta Bench, by order dated May 29, 1956, disallowed the assessee's claim for deducting a sum of Rs. 1,24,199 odd under section 10(2)(xv) of the Indian Income-tax Act, 1922.",
      "type": "procedural",
      "date": "1956-05-29",
      "source": "income_tax_appellate_tribunal"
    },
    {
      "id": "f6",
      "text": "In consequence of the Tribunal's decision, the appellant paid the amount on or about April 16, 1953.",
      "type": "procedural",
      "date": "1953-04-16",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The appellant requested the foreign company to reimburse the tax paid on its behalf, but the foreign company repudiated its liability.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The appellant treated the sum of Rs. 1,24,199 odd paid to Government as an extra expenditure incurred in its business and claimed a deduction in respect thereof under section 10(2)(xv) of the Act in the assessment proceedings for the year 1954-55.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The Income-tax Officer disallowed the claim. Appeal to Appellate Assistant Commissioner unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "income_tax_officer"
    },
    {
      "id": "f10",
      "text": "Appeal to Income-tax Appellate Tribunal resulted in order dated May 29, 1956, disallowing the claim.",
      "type": "procedural",
      "date": "1956-05-29",
      "source": "income_tax_appellate_tribunal"
    },
    {
      "id": "f11",
      "text": "Appellant applied to Tribunal under section 66(1) for reference to High Court on whether the sum was deductible under section 10(2)(xv); rejected on ground question did not arise from order.",
      "type": "procedural",
      "date": null,
      "source": "income_tax_appellate_tribunal"
    },
    {
      "id": "f12",
      "text": "High Court of Calcutta rejected appellant's application under section 66(2).",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f13",
      "text": "Appellant moved Supreme Court for special leave to appeal from Tribunal order dated May 29, 1956; special leave granted by order dated February 10, 1958.",
      "type": "procedural",
      "date": "1958-02-10",
      "source": "supreme_court"
    },
    {
      "id": "f14",
      "text": "No special leave asked for or granted in respect of subsequent orders of Board and High Court under section 66.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in the circumstances, special leave to appeal from the decision of the Tribunal dated May 29, 1956, was properly given under article 136 of the Constitution and whether the appellant is entitled to ask this court to exercise its discretion under the said article when it did not move against the subsequent orders of the Board and the High Court under section 66 of the Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The sum of Rs. 1,24,199 odd paid as tax on behalf of foreign company was an extra expenditure incurred in business as a matter of commercial expedience and necessity, deductible under section 10(2)(xv).",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Section 10(2)(xv) of Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Preliminary objection: special leave to appeal from Tribunal order dated May 29, 1956 not properly granted under Art 136 since appellant did not move against subsequent orders of Board and High Court under s.66.",
      "supporting_facts": [
        "f11",
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": "Article 136 of Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The question arose as a preliminary objection and fell for consideration in very similar circumstances in Civil Appeals Nos. 170-172 of 1959, judgment delivered same day.",
      "addresses_issue": "i1",
      "key_observation": "This appeal heard along with those, full arguments heard."
    },
    {
      "id": "cr2",
      "text": "Following the decision in Civil Appeals Nos. 170-172 of 1959, special leave to appeal from Tribunal decision dated May 29, 1956 was not properly granted and appellant not entitled to invoke Art 136 when did not challenge subsequent orders.",
      "addresses_issue": "i1",
      "key_observation": "Special leave improperly granted."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Special leave to appeal from the decision of the Tribunal dated May 29, 1956, was not properly granted under Article 136 and the appellant is not entitled to ask the court to exercise its power under Article 136 when it did not move against the subsequent orders of the Board and the High Court.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Civil Appeals Nos. 170-172 of 1959",
      "citation": null,
      "treatment": "followed",
      "relevance": "Decision in very similar circumstances, judgment delivered same day; this appeal heard along with them."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "10(2)(xv)",
        "18(3A)",
        "18(3B)",
        "66(1)",
        "66(2)"
      ],
      "relevance": "Deduction claimed under 10(2)(xv); tax deduction liability under 18(3A),(3B); reference applications under 66(1),(2)"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "136"
      ],
      "relevance": "Special leave to appeal invoked under Article 136"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal dismissed on preliminary objection holding that special leave from Tribunal order dated May 29, 1956 was not properly granted under Article 136 as appellant did not challenge subsequent orders of Board and High Court under section 66.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "special leave to appeal from the decision of the Tribunal dated May 29, 1956, was not properly granted in this case and the appellant is not entitled to ask us to exercise our power under article 136",
      "speaker": "court",
      "significance": "Core holding on preliminary objection dismissing the appeal"
    }
  ],
  "_case_id": "1961_325",
  "_label": 0,
  "_text_length": 5107,
  "_extracted_at": "2026-02-10T19:34:08.985868"
}