{
  "metadata": {
    "case_name": "V. N. M. Arunachala Nadar v. Commissioner of Income Tax",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, J."
    ],
    "case_number": "Civil Appeals Nos. 540, 541 to 544 of 1960",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Arunachala Nadar was the karta of a Hindu undivided family consisting of himself and his ten sons. Four sons (Ayyamperumal, Rathinasabapathy, Durairaja and Rajamanickam) were adults born to first wife; six sons by second wife were minors in 1942.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Up to accounting year 1942-43, the HUF was the assessee with businesses: grocery and two oil mills at Virudhunagar, grocery at Tuticorin, oil mills at Madurai, commission business in grocery at Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Four adult sons separated from the family after accounting year ending January 27, 1942. Partition divided family into two groups: four adult sons and appellant with six minor sons. Properties divided into two halves.",
      "type": "material",
      "date": "1942-01-27",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Appellant's group took businesses at Virudhunagar and Madurai; adult sons took Tuticorin and Bombay. Partition effected in presence of Mr. C. S. Subbiah Nadar of Virudhunagar.",
      "type": "material",
      "date": "1942-01-27",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Document recording partition executed on August 10, 1942.",
      "type": "procedural",
      "date": "1942-08-10",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On January 28, 1942, three adult sons commenced business as V. N. M. A. Ayyamperumal Nadar Bros.; fourth son Rajamanickam started separate business. Appellant started new business with minor sons, closing old businesses and opening fresh accounts.",
      "type": "material",
      "date": "1942-01-28",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant wrote to Income-tax Officer on October 14, 1942, informing of partition and that only Virudhunagar and Madurai businesses belonged to him post-partition.",
      "type": "procedural",
      "date": "1942-10-14",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "On August 10, 1943, appellant replied to notice for 1943-44 return as karta, stating family business stopped on 14th Thai Vishu (approx. Jan 27, 1942), adult sons separated, requested separate forms under section 25A.",
      "type": "procedural",
      "date": "1943-08-10",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Income-tax Officer passed order on October 31, 1945, under section 25A recognizing partition on January 27, 1942.",
      "type": "procedural",
      "date": "1945-10-31",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "After partition, appellant started new business in paddy and rice at Kumbakonam with Sadagopa Pillai as employee.",
      "type": "background",
      "date": "1942",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "For accounting year starting February 8, 1943, appellant formed partnerships: one at Madurai with Rathnaswamy (nephew), one at Kumbakonam with Pillai. Deeds dated January 10, 1944, reciting formation on February 8, 1943.",
      "type": "material",
      "date": "1943-02-08",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "References by Income-tax Appellate Tribunal, Madras: Ref No. 68 of 1953 under s.8(1) Excess Profits Tax Act for periods Feb 7, 1943 to Mar 31, 1946; Ref No. 58 of 1953 under s.10A for period Jan 28, 1942 to Feb 7, 1943.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court answered both questions in affirmative against assessee.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Assets and liabilities pooled and divided into two halves on January 27, 1942; old books closed, new books opened January 28, 1942.",
      "type": "admitted",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appellant in complete control of Madurai and Kumbakonam businesses; finances contributed by him; income assessed at Virudhunagar.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of the case there was a change in the persons carrying on the business within the meaning of section 8(1) of the Excess Profits Tax Act?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether on the facts and in the circumstances of the case there is any material to justify the finding of the Tribunal that the main purpose in constituting the two firms was the avoidance or reduction of liability to excess profits tax within the meaning of section 10A of the Excess Profits Tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Partition was partial: adult coparceners exercised right to become divided, took shares and left; status of appellant and minor sons unaffected as undivided HUF.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Hindu law principles on partial partition"
    },
    {
      "id": "pa2",
      "text": "No general partition as whole family did not divide; reunion with minors would not be possible post-general partition.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "Hindu law on reunion (citing Balabux v. Rakhmabai)"
    },
    {
      "id": "pa3",
      "text": "Partnerships at Madurai and Kumbakonam not for avoidance of EPT; due to old age.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Complete general partition occurred; old family business discontinued, new businesses started by groups; evidenced by conduct, letters, closing/opening of accounts, s.25A order.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8",
        "f9",
        "f14"
      ],
      "legal_basis": "Section 25A Income-tax Act, 1922; facts in statement of case"
    },
    {
      "id": "ra2",
      "text": "Main purpose of partnerships was avoidance/reduction of EPT liability: timing, appellant's control, finance contribution, assessment at Virudhunagar, books of account.",
      "supporting_facts": [
        "f10",
        "f11",
        "f15"
      ],
      "legal_basis": "Section 10A Excess Profits Tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Facts found by authorities (pooled assets/liabilities, closed old books, new books opened, representations to ITO, s.25A order) indicate general partition and change in persons carrying business, not mere secession.",
      "addresses_issue": "i1",
      "key_observation": "Statement of case facts unambiguously support High Court's affirmative answer; academic Hindu law questions secondary."
    },
    {
      "id": "cr2",
      "text": "Partition deed records past event; conduct of parties (stopping family business, new starts) confirms general partition.",
      "addresses_issue": "i1",
      "key_observation": "Facts borne out by evidence; no interference in reference proceedings."
    },
    {
      "id": "cr3",
      "text": "For partnerships: Tribunal findings on control, finance, timing, assessment supported by evidence; main purpose was EPT avoidance, purely question of fact.",
      "addresses_issue": "i2",
      "key_observation": "Overwhelming evidence; High Court correctly upheld."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "There was a change in the persons carrying on the business within s.8(1) Excess Profits Tax Act due to general partition.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Main purpose in constituting two firms was avoidance/reduction of EPT liability under s.10A.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Balabux v. Rakhmabai",
      "citation": null,
      "treatment": "referred",
      "relevance": "On possibility of reunion by guardian on behalf of minor coparcener post-separation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "Section 66(2)",
        "Section 25A"
      ],
      "relevance": "Reference to High Court; recognition of partition."
    },
    {
      "name": "Excess Profits Tax Act",
      "sections": [
        "Section 8(1)",
        "Section 10A"
      ],
      "relevance": "Change in persons carrying business; avoidance of tax liability."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "All appeals dismissed upholding High Court's answers to references in favor of revenue; no interference with factual findings of Tribunal.",
    "relief_granted": null,
    "costs": "Dismissed with costs; respondent entitled to costs in all appeals in one set."
  },
  "key_quotes": [
    {
      "text": "Factually, did the Hindu undivided family continue its existence after 27th January, 1942, for purpose of assessment of income-tax, is the real question for determination.",
      "speaker": "court",
      "significance": "Frames core factual issue overriding academic Hindu law questions."
    },
    {
      "text": "The facts found unambiguously support the answer given by the High Court.",
      "speaker": "court",
      "significance": "Justifies upholding Tribunal's findings on general partition."
    },
    {
      "text": "Whether or not the main purpose in constituting the two firms was the avoidance or reduction of liability to excess profits tax is, in our opinion, more a question of fact than a mixed question of fact and law.",
      "speaker": "court",
      "significance": "Confirms no interference with factual conclusion on tax avoidance."
    }
  ],
  "_case_id": "1961_333",
  "_label": 0,
  "_text_length": 24424,
  "_extracted_at": "2026-02-10T19:34:49.226069"
}