{
  "metadata": {
    "case_name": "Bhagwan Dayal v. Mst. Reoti Devi",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Civil Appeal No. 448 of 1958",
    "date_of_judgment": "1961-09-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Pt. Lachhman Prasad had sons Pt. Kashi Ram and Pt. Jwala Prasad. Jwala Prasad had sons Raghubar Dayal, Banwari Lal, Ram Lal, Bhagwan Dayal, and daughter Mat. Dayavati. Raghubar Dayal married Mst. Reoti Devi and had son Ajudhia Prasad.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Date of death of Lachhman Prasad not in record. Jwala Prasad died in 1908, Kashi Ram in 1924, Ram Lal in 1914, Banwari Lal in 1914, Raghubar Dayal in 1933.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Ancestral house of the family in village Naugaien, district Farrukhabad. Ancestral properties in Schedule A comprised lands and houses with income about Rs.80-100 per year.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Kashi Ram left ancestral home long ago, joined military services at Gwalior and thereafter police service around 1895, gave up service and started business at Agra with his savings in 1885.",
      "type": "material",
      "date": "1885",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Raghubar Dayal joined Kashi Ram in business in 1889 at age 8-9 years, Bhagwan Dayal between 1893-1902.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Kashi Ram, Raghubar Dayal and Bhagwan Dayal jointly acquired properties: Schedule B during lifetime of Kashi Ram, Schedule C after his death, Schedule D after Raghubar Dayal's death.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Kashi Ram executed will on September 13, 1919 bequeathing all properties to nephews Raghubar Dayal and Bhagwan Dayal in equal shares, asserting they were his self-acquisitions.",
      "type": "material",
      "date": "1919-09-13",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Kashi Ram executed deed of agreement on October 4, 1909 stating all properties self-acquired.",
      "type": "material",
      "date": "1909-10-04",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Bhagwan Dayal admits Ram Lal and Banwari Lal were separate from him.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Reoti Devi's marriage about 30 years before suit; at that time Kashi Ram and Jwala Prasad lived separately in Naugaien, cultivating separately.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Names of different family members including Reoti Devi entered in Government accounts against different portions of ancestral property.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Suit No. 15 of 1939 by Reoti Devi in Revenue Court for half share in income of mauza Chaoli against Bhagwan Dayal. Issue of title referred to Civil Court (District Munsif) under s.271 Agra Tenancy Act; Munsif held against Bhagwan Dayal; Revenue Court decreed for Reoti Devi; appeals dismissed up to High Court.",
      "type": "procedural",
      "date": "1939",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Bhagwan Dayal filed suit in Civil Judge Agra for declaration of absolute title to Schedules B, C, D properties and injunction against execution of decree in Suit No.15/1939.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Civil Judge Agra: res judicata only for half share in Chaoli; partition in larger family; no reunion of three; Kashi Ram's will valid; reunion between Raghubar and Bhagwan; declared title except half Chaoli.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Allahabad High Court (Agarwala J.): no partition evidence; three not joint family unit, properties bequeathed to brothers as co-tenants; no res judicata. Gurtu J.: separation; uncle+nephews cannot form joint family; no reunion; res judicata. Appeal allowed, suit dismissed.",
      "type": "procedural",
      "date": "1954-05-07",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "After Raghubar Dayal's death, Reoti Devi's name mutated in revenue records for her husband's share in some properties including Chaoli, Chak Soyam, Chaharum.",
      "type": "material",
      "date": "1933",
      "source": "respondent"
    },
    {
      "id": "f17",
      "text": "Numerous documents (sale deeds, mortgages, bonds, decrees) from 1903-1923 describe Kashi Ram, Raghubar Dayal, Bhagwan Dayal without mentioning joint family status.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Post-1924 documents between brothers also no joint family mention except self-serving plaints to avoid succession certificates.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether judgment in Revenue Suit No.15/1939 operates as res judicata in present suit.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there was partition in the family of Lachhman Prasad.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether there was reunion between Kashi Ram, Raghubar Dayal and Bhagwan Dayal.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether Kashi Ram, uncle, and two nephews from different branch can constitute a joint Hindu family unit and hold acquired properties as joint family property with survivorship.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Lachhman Prasad family joint Hindu family, no partition; Kashi Ram, Raghubar Dayal, Bhagwan Dayal jointly started business at Agra, acquired properties as joint family property; after deaths, survivorship to Bhagwan Dayal.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "Hindu law (Mitakshara)"
    },
    {
      "id": "pa2",
      "text": "Alternatively, even if partition, reunion inferred from conduct of three members.",
      "supporting_facts": [
        "f6",
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Revenue Suit No.15/1939 finding not res judicata as Revenue Court not competent for present suit; decided by Civil Court.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "S.11 CPC; Agra Tenancy Act s.271"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Family of Lachhman Prasad divided; Kashi Ram started business with self-acquisitions; bequeathed to nephews by will; brothers held as co-tenants, not joint family.",
      "supporting_facts": [
        "f4",
        "f7",
        "f8",
        "f16"
      ],
      "legal_basis": "Hindu law"
    },
    {
      "id": "ra2",
      "text": "Revenue Court decision in Suit No.15/1939 operates as res judicata; exclusive jurisdiction.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Agra Tenancy Act ss.227,230,271; general res judicata principles"
    },
    {
      "id": "ra3",
      "text": "Uncle and nephews cannot form distinct joint family; no reunion possible.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Hindu law (Mitakshara)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Revenue Suit No.15/1939 not res judicata: present suit not within exclusive jurisdiction of Revenue Court under Agra Tenancy Act s.230 (not for declaration of title and injunction); Revenue Court not competent for present suit under CPC s.11.",
      "addresses_issue": "i1",
      "key_observation": "Civil Court jurisdiction not ousted; decision by referred Civil Court but Revenue Court incompetent for this suit."
    },
    {
      "id": "cr2",
      "text": "Partition in larger family proved by conduct: separate living, cultivation, partial income shares, separate families of brothers, mutations, no disputes over income, Kashi Ram's will and deed asserting self-acquisitions.",
      "addresses_issue": "i2",
      "key_observation": "Presumption of jointness rebutted by course of conduct over 50 years."
    },
    {
      "id": "cr3",
      "text": "No reunion: heavy burden not discharged; documents show no joint family assertion, self-acquisitions by Kashi Ram; joint purchases as co-sharers/partners; self-serving statements post-death; mutations in widow's name.",
      "addresses_issue": "i3",
      "key_observation": "Conduct consistent with partnership/co-tenancy, not reunion intent."
    },
    {
      "id": "cr4",
      "text": "Uncle (Kashi Ram from one branch) and two nephews (sons of brother Jwala Prasad) cannot form subordinate joint family unit; coparcenary creature of law, not by agreement except reunion; acquisitions governed by contract, pass by inheritance, not survivorship.",
      "addresses_issue": "i4",
      "key_observation": "Hindu law recognizes only full family or branches as corporate units; no joint tenancy except recognized cases."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Revenue Court decree in Suit No.15/1939 does not operate as res judicata.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Partition occurred in Lachhman Prasad's family.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No reunion between Kashi Ram, Raghubar Dayal, Bhagwan Dayal.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Members from different branches cannot constitute joint family for acquisitions; properties of Kashi Ram, Raghubar Dayal, Bhagwan Dayal held as co-tenants, pass by inheritance to Reoti Devi.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Venkatarama Rao v. Venkayya",
      "citation": "AIR 1954 Mad 788",
      "treatment": "followed",
      "relevance": "Revenue court finding not binding in civil suit outside exclusive jurisdiction."
    },
    {
      "case_name": "Palani Ammal v. Muthuvenkatacharla Moniagar",
      "citation": "1924 LR 52 IA 83",
      "treatment": "followed",
      "relevance": "Reunion must be strictly proved."
    },
    {
      "case_name": "Balabux Ladhuram v. Bukhmabai",
      "citation": "1903 LR 30 IA 190",
      "treatment": "referred",
      "relevance": "Reunion rare, strictly proved."
    },
    {
      "case_name": "Sudarsanam Maistri v. Narasimhulu Maistri",
      "citation": "1902 ILR 25 Mad 149",
      "treatment": "followed",
      "relevance": "Members of different branches cannot form corporate joint family unit."
    },
    {
      "case_name": "Chakra Kannan v. Kunhi Pokker",
      "citation": "1916 ILR 39 Mad 317",
      "treatment": "followed",
      "relevance": "Subordinate groups cannot be created by agreement."
    },
    {
      "case_name": "Official Assignee v. Neelambal Ammal",
      "citation": "65 MLJ 798",
      "treatment": "followed",
      "relevance": "Cannot impress joint family incidents on acquired property by some members."
    },
    {
      "case_name": "Himmat Bahadur v. Bhawani Kunwar",
      "citation": "1908 ILR 30 All 352",
      "treatment": "followed",
      "relevance": "Accepts no subordinate unit from different branches."
    },
    {
      "case_name": "Jogeshwar Narain Deo v. Ram Chund Dutt",
      "citation": "1896 LR 23 IA 37",
      "treatment": "followed",
      "relevance": "Joint tenancy unknown except undivided family property."
    },
    {
      "case_name": "Bahu Rani v. Rajendra Bakhsh Singh",
      "citation": "1933 LR 60 IA 95",
      "treatment": "followed",
      "relevance": "Restates no joint tenancy."
    },
    {
      "case_name": "Nathu Lal v. Babu Ram",
      "citation": "1935 LR 63 IA 155",
      "treatment": "distinguished",
      "relevance": "All members of joint family, not some from branches."
    },
    {
      "case_name": "Sham Narain v. Court of Wards",
      "citation": "1873 20 WR 197",
      "treatment": "overruled",
      "relevance": "Wrongly allowed two of three brothers to form joint unit."
    },
    {
      "case_name": "Rampershead Tewarry v. Sheochurn Doss",
      "citation": "1866 10 MIA 490",
      "treatment": "distinguished",
      "relevance": "All brothers of undivided family."
    }
  ],
  "statutes_cited": [
    {
      "name": "Agra Tenancy Act, 1926",
      "sections": [
        "Section 227",
        "Section 230",
        "Section 271"
      ],
      "relevance": "Exclusive jurisdiction for co-sharer profit suits; title issue referral to Civil Court; no ouster for declaration suits."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Section 11",
        "Section 264"
      ],
      "relevance": "Res judicata requires competency; CPC applies to Tenancy Act suits with modifications."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court dismissal of suit; found partition, no reunion, uncle+nephews not joint family; properties B,C,D held as co-tenants, Reoti Devi entitled to husband's share by inheritance.",
    "relief_granted": "None to appellant",
    "costs": "Not specified"
  },
  "key_quotes": [
    {
      "text": "The Mitakshara doctrine of joint family is founded upon the existence of an undivided family, as a corporate body and the possession of property by such corporate body.",
      "speaker": "court",
      "significance": "Explains coparcenary as creature of law, not agreement."
    },
    {
      "text": "Coparcenary is a creature of Hindu law and cannot be created by agreement of parties except in the case of reunion.",
      "speaker": "court",
      "significance": "Core holding on no sub-unit from different branches."
    },
    {
      "text": "If a particular matter is one which does not fall within the exclusive jurisdiction of the revenue court, then a decision of a revenue court on such a matter... cannot be binding on the parties in a civil court.",
      "speaker": "court",
      "significance": "Rejects res judicata from Revenue Court."
    }
  ],
  "_case_id": "1961_335",
  "_label": 0,
  "_text_length": 75767,
  "_extracted_at": "2026-02-10T19:34:50.630627"
}