{
  "metadata": {
    "case_name": "State of Jammu and Kashmir v. Respondent",
    "case_year": 1957,
    "court": "Supreme Court of India",
    "judges": [
      "SARKAR, J."
    ],
    "case_number": "Civil Appeal No. 31 of 1957",
    "date_of_judgment": "1961-02-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is a Civil Engineer who held various positions under the appellant, the Government of the State of Jammu and Kashmir.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On September 8, 1954, while the respondent was holding the post of Development Commissioner, he was placed under suspension by an order made by the appellant.",
      "type": "procedural",
      "date": "1954-09-08",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "At one stage of his career, the respondent held a job of some responsibility in the Sindh Valley Hydro Electric Scheme from 1949 till he was transferred from the work in 1953.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Sindh Valley Hydro Electric Scheme was for generating electric power by dams erected in the Sindh water course and for using the water for irrigation purposes. The work on this Scheme commenced some time ago.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellant was dissatisfied with the progress of the work and the manner in which it had been carried out and decided to establish a Commission of Inquiry to investigate: (i) progressive rise in the estimates, (ii) defective planning and delay in execution, (iii) other irregularities; and to fix responsibility and make recommendations.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Pending the investigation, various officers associated with the planning and execution of the Scheme including the respondent were placed under suspension on September 8, 1954.",
      "type": "procedural",
      "date": "1954-09-08",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On October 20, 1954, a Commission was set up by the appellant consisting of various persons.",
      "type": "procedural",
      "date": "1954-10-20",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Commission made certain enquiries and submitted its report to the appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On February 12, 1955, the appellant passed an order demoting the respondent to the post of a Divisional Engineer, purporting to act on the basis of the Commission's report.",
      "type": "procedural",
      "date": "1955-02-12",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On May 12, 1955, the respondent moved the High Court of Jammu and Kashmir under Art. 32(2A) of the Constitution for a writ directing the appellant to give effect to the order dated February 12, 1955, and to recognise him as the Chief Engineer, his substantive post when suspended, with effect from the date of suspension and with all emoluments.",
      "type": "procedural",
      "date": "1955-05-12",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The High Court issued the writ as prayed on September 27, 1955.",
      "type": "procedural",
      "date": "1955-09-27",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The respondent alleged that the Commission did not conduct the enquiry according to rules of natural justice; he was not informed of charges or given proper hearing.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "The respondent alleged that the appointment of the Commission could only have been made under s. 2 of the Public Servants (Inquiries) Act, 1977 (Kashmir era), and provisions of this Act were not observed.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "The respondent alleged that he could be reduced in rank only in accordance with the procedure in Kashmir Civil Service Rules (State Council Order No. 81-C of 1939) and this procedure was not followed.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "The High Court took the view that the Kashmir Civil Service Rules had the status of law.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Articles 226 and 311(2) of the Constitution of India had not been applied to the State of Jammu and Kashmir at any material time.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court had power under Art. 32(2A) to issue the writ, as it can only be exercised for enforcement of fundamental rights conferred by Part III.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether failure to follow Kashmir Civil Service Rules in demoting the respondent amounted to violation of Art. 14 (right to equal protection of laws).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The orders suspending and demoting him were invalid because the Commission did not conduct enquiry according to rules of natural justice; respondent not informed of charges or given proper hearing.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Appointment of Commission only under s. 2 Public Servants (Inquiries) Act, 1977 (Kashmir), but provisions not observed.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "s. 2 Public Servants (Inquiries) Act, 1977 (Kashmir)"
    },
    {
      "id": "pa3",
      "text": "Reduction in rank only per procedure in Kashmir Civil Service Rules (1939), which was not followed; this denied equal protection of laws under Art. 14.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Kashmir Civil Service Rules; Art. 14"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Even assuming Rules are law and procedure not followed, it is mere breach of law, not violation of Art. 14 unless discriminatory denial to respondent while given to others.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Art. 14, 32(2A)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Proceed on basis that High Court was right that Rules have status of law and respondent's allegations substantiated.",
      "addresses_issue": "i2",
      "key_observation": "Assumption for argument"
    },
    {
      "id": "cr2",
      "text": "High Court power under Art. 32(2A) only for enforcement of fundamental rights in Part III.",
      "addresses_issue": "i1",
      "key_observation": "Art. 32(2A) limited to fundamental rights"
    },
    {
      "id": "cr3",
      "text": "Only claimed fundamental right violation is Art. 14; but breach of Rules/law by Government does not amount to denial of equal protection unless others similarly situated given benefit and denied designly to respondent.",
      "addresses_issue": "i2",
      "key_observation": "No authority or principle supports every Government breach of law = Art. 14 violation; no such allegation here."
    },
    {
      "id": "cr4",
      "text": "Respondent's petition does not show violation of any fundamental right; High Court had no power under Art. 32(2A).",
      "addresses_issue": "i1",
      "key_observation": "Simple ground to allow appeal"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Breach of service rules or law by State does not constitute violation of Art. 14 (equal protection) unless discriminatory treatment compared to others.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court lacks jurisdiction under Art. 32(2A) without violation of fundamental right.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 32(2A)",
        "Art. 14",
        "Art. 226",
        "Art. 311(2)"
      ],
      "relevance": "Art. 32(2A) limits High Court writ power to enforcement of fundamental rights; Art. 14 invoked but not violated; Arts. 226, 311(2) not applied to J&K."
    },
    {
      "name": "Public Servants (Inquiries) Act, 1977 (Kashmir era)",
      "sections": [
        "s. 2"
      ],
      "relevance": "Alleged basis for Commission but procedure not followed."
    },
    {
      "name": "Kashmir Civil Service Rules",
      "sections": null,
      "relevance": "Procedure for reduction in rank allegedly not followed; assumed to have status of law."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed; High Court judgment and order set aside as High Court lacked jurisdiction under Art. 32(2A) without violation of fundamental right.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Otherwise, every breach of law by a Government would amount to a denial of the equal protection of the laws.",
      "speaker": "court",
      "significance": "Core reasoning why breach of rules != Art. 14 violation."
    },
    {
      "text": "The High Court can act under cl. (2A) of Art. 32 only to enforce a fundamental right.",
      "speaker": "court",
      "significance": "Defines limit of High Court jurisdiction under Art. 32(2A)."
    },
    {
      "text": "It is not the respondent's case that other servants of the appellant had been given the benefit of those Rules and such benefit has been designly denied only to him.",
      "speaker": "court",
      "significance": "No evidence of discriminatory denial required for Art. 14."
    }
  ],
  "_case_id": "1961_240",
  "_label": 1,
  "_text_length": 7184,
  "_extracted_at": "2026-02-10T19:33:28.676370"
}