{
  "metadata": {
    "case_name": "Tirumalachetti Rajaram v. Father and Alienees",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Tirumalachetti Rajaram filed a suit in forma pauperis in the Court of the Subordinate Judge, Chittoor, for his half share in the properties which once belonged to the joint family consisting of himself and his father.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant impleaded his father and several alienees from him.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant's case was that the alienations effected by his father as well as the sales held in execution proceedings against his father were not binding on him and so his share in the properties covered by the said alienations was not affected by them.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Trial court rejected his contention that the alienations did not bind him, upheld all the alienations and so dismissed his suit.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "On appeal the High Court of Madras reversed the trial court's decree in respect of alienations which covered items 2, 10 and 14 in Schedule A as well as item 5 in the Schedule B.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "High Court held that the alienations in respect of these items did not bind the appellant's share and so a preliminary decree for partition was passed in his favour in respect of the said items.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The rest of the decree passed by the trial court was confirmed by High Court.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellant then applied to the High Court for a certificate under Art. 133(1) of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "High Court rejected the application on the ground that the decree sought to be appealed from was one of affirmance and there was no substantial question of law raised by the proposed appeal, following Chittam Subba Rao v. Vela Mankanni Chilamayya I.L.R. 1953 Mad. 1.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellant applied for and obtained special leave from this Court (Supreme Court).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "It is common ground that the test of valuation prescribed by Art. 133(1)(a) is satisfied in this case.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "If the appellate decree passed by the High Court makes a variation in the decision of the trial Court under appeal in favour of a party who intends to prefer an appeal against the said appellate decree, can the said decree be said to affirm the decision of the trial court under Art. 133(1) of the Constitution?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The view taken by the Madras High Court in the case of Chittam Subba Rao I.L.R. 1953 Mad. 1 proceeds on a misconstruction of the relevant clause in Art. 133(1).",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Article 133(1) of the Constitution"
    },
    {
      "id": "pa2",
      "text": "If the appellate decree of the High Court makes a variation in the decision of the trial court against the intending appellant the appellate decree is not a decree of affirmance but variation, and this position is not affected even if the variation in question is to a very small extent and may be of very minor significance.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Article 133(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The words 'judgment, decree or final order appealed from' denote that part of the judgment, decree or final order in appeal which is intended to be challenged in the proposed appeal to this Court; the word 'decree' refers to the part of the decree under appeal; a decree has to be split up into different parts.",
      "supporting_facts": [],
      "legal_basis": "Article 133(1)"
    },
    {
      "id": "ra2",
      "text": "In cases where different causes of action and different claims and reliefs have been combined different decrees are in fact passed though in form there may be one paper on which one decree is drawn; the decree appealed from must mean the decree under appeal dealing with the subject-matter or matter in dispute proposed to be brought to this Court by the intending appellant.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "Code of Civil Procedure"
    },
    {
      "id": "ra3",
      "text": "The word 'decision' does not mean the whole of the decision but the decision on that part of the controversy between the parties which is brought to this Court in appeal.",
      "supporting_facts": [],
      "legal_basis": "Order 20, rr. 4 and 5 CPC; Order 41, r. 33 CPC"
    },
    {
      "id": "ra4",
      "text": "The Constitution intended to restrict the right of the appellant to come to this Court and not to widen it.",
      "supporting_facts": [],
      "legal_basis": "Article 133(1)(a), Article 133(3)"
    },
    {
      "id": "ra5",
      "text": "Majority of the High Courts have taken the view that an appellate decree which makes a variation in favour of the intending appellant is a decree of affirmance.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In construing the relevant clause it is necessary to bear in mind that the clause under discussion deals with the constitutional right of the litigant to make an appeal to this Court and so it would be inappropriate to adopt a technical or pedantic approach; reading the clause as a whole and giving the material words their plain grammatical meaning, the test of affirmance can best be satisfied if we take the appellate decree in its entirety and enquire whether the said decree affirms the decision of the trial court considered in its entirety.",
      "addresses_issue": "i1",
      "key_observation": "If there is a variation made by the appellate decree in the decision of the trial court the appellate decree is not a decree of affirmance whether the variation is made in favour of the intending appellant or against him and whether the variation made is minor or major."
    },
    {
      "id": "cr2",
      "text": "The construction on which the argument that decree refers to part under appeal is based is far too technical and artificial; normally, in each suit there is one decree, and so it would be inconsistent with the scheme of the Code to divide the decree into several parts.",
      "addresses_issue": "i1",
      "key_observation": "The normal, natural and reasonable construction is to hold that it refers not merely to that part of the decree which is sought to be challenged but the entire decree from which the appeal arises."
    },
    {
      "id": "cr3",
      "text": "Both the decree and the decision referred to in the clause mean the decree and the decision respectively taken as a whole and not in part.",
      "addresses_issue": "i1",
      "key_observation": "Supported by Privy Council in Rajah Tasadduq Rasul Khan v. Manik Chand where decision means decision of the suit as a whole."
    },
    {
      "id": "cr4",
      "text": "The test prescribed by Art. 133(1)(a) is an independent additional test and its effect has to be judged by interpreting the words used; it cannot control the meaning of the word decree in the relevant clause.",
      "addresses_issue": "i1",
      "key_observation": "Similarly for substantial question of law."
    },
    {
      "id": "cr5",
      "text": "Adoption of the literal construction would not lead to anomalous consequences; consistent with principle underlying doctrine of affirmance where two courts agree; variation shows disagreement.",
      "addresses_issue": "i1",
      "key_observation": "Doctrine confined to complete affirmance not partial."
    },
    {
      "id": "cr6",
      "text": "Sharp conflict in High Courts; duty of SC to construe and decide which view prevails; not bound by stare decisis here.",
      "addresses_issue": "i1",
      "key_observation": "Majority view not binding given conflict."
    },
    {
      "id": "cr7",
      "text": "If appellate decree confirms decision of trial court but merely makes variation in regard to costs such variation would not affect character as affirmance; but variation in interest does as it is part of dispute.",
      "addresses_issue": "i1",
      "key_observation": "Variation by concession, consent or withdrawal does not affect."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In determining the question as to whether the appellate decree passed by the High Court affirmed the decision of the trial court the appellate decree must be considered as a whole in relation to the decision of the trial court similarly considered as a whole; if there is a variation made in the appellate decree in the decision of the trial court it is not a decree of affirmance and this is not affected either by the extent of the variation made or by the fact that the variation is made in favour of the intending appellant and not against him.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chittam Subba Rao v. Vela Mankanni Chilamayya",
      "citation": "I.L.R. 1953 Mad. 1",
      "treatment": "distinguished",
      "relevance": "Madras Full Bench decision followed by HC below; SC holds it misinterprets Art. 133(1) by splitting decree"
    },
    {
      "case_name": "Rajah Tasadduq Rasul Khan v. Manik Chand",
      "citation": "1902 L.R. 30 I.A. 35",
      "treatment": "followed",
      "relevance": "Privy Council: decision means decision of the suit as a whole, not grounds; affirmance even on different grounds"
    },
    {
      "case_name": "Dhirendra Nath Sarkar v. Nischintapore Co.",
      "citation": "1916 36 I.C. 398 (22 C.W.N. 192)",
      "treatment": "distinguished",
      "relevance": "Calcutta HC on multiple decrees for limitation under Art. 182 Expl.1 Limitation Act; confined to that context"
    },
    {
      "case_name": "Raja Sree Nath Roy Bahadur v. The Secretary of State for India in Council",
      "citation": "1904 8 C.W.N. 294",
      "treatment": "distinguished",
      "relevance": "Calcutta Full Bench: looked to substance of appeal for affirmance under s.596 CPC 1882"
    },
    {
      "case_name": "Annapurnabai v. Ruprao",
      "citation": "1924 L.R. 51 I.A. 319",
      "treatment": "followed",
      "relevance": "Privy Council: variation in favour of appellant means not affirmance under s.110 CPC"
    },
    {
      "case_name": "Narendra Lal Das Chaudhury v. Gopendra Lal Das Chaudhury",
      "citation": "A.I.R. 1927 Cal. 543",
      "treatment": "distinguished",
      "relevance": "Calcutta HC limited Annapurnabai to amount disputes; introduced substance test"
    },
    {
      "case_name": "Rani Fateh Kunwar v. Raja Durbijai Singh",
      "citation": "I.L.R. 1952 2 All. 605",
      "treatment": "referred",
      "relevance": "Allahabad majority adopted similar approach to Madras"
    },
    {
      "case_name": "Union of India v. Kanahaya Lal Sham Lal",
      "citation": "I.L.R. 1957 Punj. 255",
      "treatment": "followed",
      "relevance": "Punjab Full Bench adopted literal view"
    },
    {
      "case_name": "Kanak Sunder v. Ram Lakhan",
      "citation": "I.L.R. 1956 35 Pat. 499",
      "treatment": "followed",
      "relevance": "Patna majority adopted literal view"
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)",
        "Article 133(1)(a)",
        "Article 133(1)(b)",
        "Article 133(1)(c)",
        "Article 133(3)"
      ],
      "relevance": "Governs certificate for appeal to Supreme Court; key clause on affirmance interpreted literally as whole decree"
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s. 110",
        "s. 596 (1882 Code)",
        "s. 2",
        "s. 34",
        "s. 35",
        "Order 20 rr. 4 and 5",
        "Order 41 r. 33"
      ],
      "relevance": "Predecessor provisions to Art. 133; decree definition; judgments; interest and costs orders affect or not affirmance"
    },
    {
      "name": "Limitation Act, 1908",
      "sections": [
        "Art. 182 cl. 5, Expl. 1"
      ],
      "relevance": "Distinguished; allows splitting decrees in execution context, not applicable to Art. 133"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed; the order passed by the High Court by which the appellant's application for certificate has been refused is set aside; the matter is sent back to the High Court for disposal in accordance with law.",
    "relief_granted": "High Court order refusing certificate set aside; remitted for reconsideration",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "If the appellate decree affirms the decree of the trial court it is a decree of affirmance if there is a variation made by the appellate decree in the decision of the trial court the appellate decree is not a decree of affirmance and this position would not be affected whether the variation is made in favour of the intending appellant or against him.",
      "speaker": "court",
      "significance": "Core holding on construction of Art. 133(1) affirmance test"
    },
    {
      "text": "the natural, obvious and prima facie meaning of the word decision is decision of the suit by the Court, and that that meaning should be given to it in the section.",
      "speaker": "court",
      "significance": "Citing Privy Council on 'decision' meaning whole suit decision"
    },
    {
      "text": "in the opinion of their Lordships the contention of the petitioners' counsel as to the effect of s. 110 of the Code of Civil Procedure is correct, and the petitioners had a right of appeal.",
      "speaker": "court",
      "significance": "Privy Council in Annapurnabai supporting non-affirmance on variation in favour"
    }
  ],
  "_case_id": "1961_135",
  "_label": 1,
  "_text_length": 43335,
  "_extracted_at": "2026-02-10T19:31:25.662206"
}