{
  "metadata": {
    "case_name": "Income-tax Officer v. M/s. Bhikaji Dadabhai Co.",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 434 of 1960",
    "date_of_judgment": "1961-02-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "M/s. Bhikaji Dadabhai Co. (assessees) owned an oil mill at Khammamath in the area of the former State of Hyderabad.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For the year of assessment Fasli 1357 (October 1, 1946, to September 30, 1947), the assessees returned an income of Rs. 50,384/-.",
      "type": "admitted",
      "date": "1946-10-01",
      "source": "assessee"
    },
    {
      "id": "f3",
      "text": "The Income-tax Officer found that the books of account maintained by the assessees were unreliable and by his order dated February 10, 1950, assessed their total income at Rs. 1,63,131/-.",
      "type": "material",
      "date": "1950-02-10",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Income-tax Officer issued a notice to the assessees under s. 40 of the Hyderabad Income-tax Act on December 22, 1949, requiring them to show cause why penalty should not be imposed.",
      "type": "procedural",
      "date": "1949-12-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "By order dated October 31, 1951, the Income-tax Officer directed the assessees to pay by way of penalty Rs. 42,000/- in addition to the tax.",
      "type": "material",
      "date": "1951-10-31",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "This penalty order was confirmed in appeal by the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Income-tax Appellate Tribunal observed that by virtue of s. 13(1) of the Indian Finance Act, 1950, the Hyderabad Income-tax Act had ceased to have effect and the power to impose penalty under s. 40 was not saved, so dismissed the appeal holding no appeal lay.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f8",
      "text": "At the instance of the assessees, the Tribunal referred questions to the High Court of Judicature at Hyderabad.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The High Court answered the first and third questions in the negative and the second in the affirmative, holding the Appellate Assistant Commissioner had power to entertain the appeal and directed the Tribunal to set aside the penalty order.",
      "type": "procedural",
      "date": "1956-10-04",
      "source": "high_court"
    },
    {
      "id": "f10",
      "text": "Appeal by special leave to the Supreme Court against the High Court's order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "State of Hyderabad merged with the Indian Union during the pendency of the proceedings before the Income-tax Officer.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on 31-10-1951, the Income-tax Officer, Warrangal Circle, had the power to impose a penalty under s. 40 of the Hyderabad Income-tax Act in respect of the assessment for the year 1357 F.?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether the assessee had a right to appeal against the order of the Income-tax Officer imposing the penalty?",
      "framed_by": "tribunal"
    },
    {
      "id": "i3",
      "text": "If the Appellate Assistant Commissioner did not have jurisdiction to hear the appeal, whether the order of the Appellate Assistant Commissioner is a nullity and therefore the order of the Income-tax Officer erroneous, though it may stand until it is set aside by a competent authority?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The power to impose penalty under s.40 Hyderabad IT Act was saved by s.13(1) Finance Act 1950 for purposes of levy, assessment and collection of income-tax for prior periods, and penalty is part of that process.",
      "supporting_facts": [
        "f3",
        "f5",
        "f11"
      ],
      "legal_basis": "s.13(1) Indian Finance Act 1950; Hyderabad Income-tax Act s.40"
    },
    {
      "id": "pa2",
      "text": "Even if ITO erred, appeal lay to AAC under s.42 Hyderabad IT Act.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.42 Hyderabad Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "By s.13(1) Finance Act 1950, Hyderabad IT Act ceased to have effect from April 1, 1950, except for levy, assessment and collection of tax, but not for imposing penalty as penalty is distinct and not saved.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "s.13(1) Indian Finance Act 1950; s.40 Hyderabad Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appeal to Appellate Assistant Commissioner was competent even if ITO lacked jurisdiction, as AAC has jurisdiction to determine ITO's jurisdiction.",
      "addresses_issue": "i2",
      "key_observation": "Exercise of appellate jurisdiction is not conditional upon competence of ITO to pass the order."
    },
    {
      "id": "cr2",
      "text": "s.13(1) Finance Act 1950 saved Hyderabad IT Act for levy, assessment and collection of income-tax for prior periods; 'assessment' includes procedure for imposing liability, and penalty is an additional tax akin to part of that process.",
      "addresses_issue": "i1",
      "key_observation": "Penalty imposed for dishonest conduct is additional tax, and distinct recovery provisions do not alter its character."
    },
    {
      "id": "cr3",
      "text": "High Court erred in holding proceedings for penalty could not continue after Finance Act 1950; no indication from comparison with other Acts that penalty proceedings are prohibited.",
      "addresses_issue": "i1",
      "key_observation": "Schemes of statutes differ; s.13(1) keeps Hyderabad IT Act alive for specified purposes including penalty."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Income-tax Officer had power on 31-10-1951 to impose penalty under s.40 Hyderabad IT Act for 1357 F.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Assessee had right to appeal against penalty order to Appellate Assistant Commissioner.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Bombay Presidency and Aden v. Messrs. Khemchand Ramdas",
      "citation": "1938 L.R. 65 I.A. 236; 1938 6 I.T.R. 414",
      "treatment": "followed",
      "relevance": "'Assessment' used in different senses: computation of income, determination of tax, or whole procedure for imposing liability."
    },
    {
      "case_name": "C. A. Abraham v. The Income-tax Officer, Kottayam",
      "citation": "1961 2 S.C.R. 765",
      "treatment": "followed",
      "relevance": "'Assessment' includes procedure for imposition of penalty as additional tax for dishonest conduct."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hyderabad Income-tax Act",
      "sections": [
        "s. 40",
        "s. 42",
        "s. 31",
        "s. 39"
      ],
      "relevance": "Power to impose penalty; right of appeal; senses of 'assessment'"
    },
    {
      "name": "Indian Finance Act, 1950",
      "sections": [
        "s. 13(1)",
        "s. 11"
      ],
      "relevance": "Cessation of Hyderabad IT Act except for levy, assessment, collection of tax for prior periods; comparison with other Acts"
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 44",
        "Ch. IV",
        "s. 28",
        "s. 23"
      ],
      "relevance": "Meaning of 'assessment'; liability to penalty as additional tax"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; answer to first question recorded in the affirmative; High Court judgment reversed on power to impose penalty; no orders on Art. 226 petition.",
    "relief_granted": "Penalty order of ITO upheld; Tribunal's direction to set aside reversed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Appellate Assistant Commissioner is under the Act constituted an appellate authority against certain orders of the Income-tax Officer, and exercise of that jurisdiction is not made conditional upon the competence of the Income-tax Officer to pass the orders made appealable.",
      "speaker": "court",
      "significance": "Confirms appellate jurisdiction exists even if original order lacked power."
    },
    {
      "text": "By the Finance Act, 1950, the Hyderabad Income-tax Act was expressly kept alive in respect of periods which include the assessment year in question for purposes of levy, assessment and collection of income-tax.",
      "speaker": "court",
      "significance": "Interprets saving clause to include penalty proceedings."
    }
  ],
  "_case_id": "1961_179",
  "_label": 1,
  "_text_length": 12186,
  "_extracted_at": "2026-02-10T19:31:55.779563"
}