{
  "metadata": {
    "case_name": "Writ Petition No. 66 of 1956 and connected Writ Petitions (Nos. 66, 67 of 1956; 8 of 1960; 77 of 1957; 15 of 1957; 5 of 1958)",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Writ Petitions Nos. 66 and 67 of 1956, 8 of 1960, 77 of 1957, 15 of 1957 and 5 of 1958",
    "date_of_judgment": "1961-03-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "For the last fifty years the petitioners and their ancestors have been the tenants of the land described in Annexure A attached to the petition and that respondents 3 to 5 are the proprietors of the said land.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Owing to communal disturbances in the Western District of Uttar Pradesh in 1947, the petitioners had to leave their village in July, 1947; later in November, 1947, they returned but they found that during their temporary absence respondents 3 to 5 had entered in unlawful possession of the said land.",
      "type": "material",
      "date": "1947-07-01",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Since the said respondents refused to deliver possession of the land to the petitioners the petitioners had to file suits for ejectment under s. 180 of the U. P. Tenancy Act, 1939. These suits were filed in June, 1948.",
      "type": "procedural",
      "date": "1948-06-01",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "In the trial court the petitioners succeeded and a decree was passed in their favour. The said decree was confirmed in appeal which was taken by respondents 3 to 5 before the learned Additional Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "In pursuance of the appellate decree the petitioners obtained possession of the land through Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Respondents 3 to 5 then preferred a second appeal before the Board of Revenue under s. 267 of the U. P. Tenancy Act, 1939. On March 29, 1954, the Board allowed the appeal preferred by respondents 3 to 5 and dismissed the petitioners suit with respect to the land described in Annexure A.",
      "type": "procedural",
      "date": "1954-03-29",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The decision of the Board was based on the ground that by virtue of the U. P. Zamindary Abolition and Land Reforms Amendment Act XVI of 1953 respondents 3 to 5 had become entitled to the possession of the land.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Aggrieved by this decision the petitioners moved the High Court at Allahabad under Art. 226 of the Constitution for the issue of a writ of certiorari to quash the said judgment. The said petition was dismissed on March 29, 1955.",
      "type": "procedural",
      "date": "1955-03-29",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Before the said petition was filed a Full Bench of the Allahabad High Court had already interpreted s. 20 of the U. P. Land Reforms Act as amended by Act XVI of 1953. The effect of the said decision was plainly against the petitioners contentions.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "s. 20 has again been amended by s. 4 of Act XX of 1954.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Present petition under Art. 32 filed on March 14, 1956.",
      "type": "procedural",
      "date": "1956-03-14",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "At the time when the present petition has been filed the period of limitation prescribed for an appeal under Art. 136 against the dismissal of the petitioners petition before the Allahabad High Court had already expired.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "In Writ Petition No. 67 of 1956 the position is exactly the same as No. 66 of 1956.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "In Writ Petition No. 8 of 1960 the previous petition for a writ filed by the petitioner No. 68 of 1952 in the Allahabad High Court was withdrawn by his learned counsel and the High Court therefore dismissed the said petition with the express observation that the merits had not been considered by the High Court in dismissing it.",
      "type": "procedural",
      "date": "1955-02-03",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "A co-lessee of the petitioner had also filed a similar Writ Petition, No. 299 of 1958. On this writ petition the High Court made certain observations and findings but in the end it came to the conclusion that a writ petition was not the proper proceeding for deciding such old disputes about title and so it left the petitioner to obtain a declaration about title from a competent civil or revenue court in a regular suit.",
      "type": "procedural",
      "date": "1958-03-17",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "In Petition No. 77 of 1957 the petitioner had moved the High Court of Punjab by a writ petition under Arts. 226 and 227 but the same was dismissed in limine on July 14, 1957.",
      "type": "procedural",
      "date": "1957-07-14",
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "The petitioner further filed an application for review of the said order under O. 47, r. 1 read with s. 151 of the Code but the said application was also heard and dismissed in limine on March 1, 1957.",
      "type": "procedural",
      "date": "1957-03-01",
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "In Petition No. 15 of 1957 the writ petition made by the petitioner in the Punjab High Court had been dismissed without reasons.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f19",
      "text": "In Writ Petition No. 5 of 1958 the petitioner had moved the Bombay High Court for an appropriate writ challenging the order of the Collector in respect of the land in question. The contentions raised by the petitioner were examined... and substantially the petitioners case was rejected.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the dismissal of a writ petition filed by a party for obtaining an appropriate writ under Art. 226 creates a bar of res judicata against a similar petition filed in this Court under Art. 32 on the same or similar facts and praying for the same or similar writ.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether res judicata, being a technical rule, can be pleaded against a petition which seeks to enforce the fundamental rights guaranteed by the Constitution under Art. 32.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The principle of res judicata which is no more than a technical rule similar to the rule of estoppel cannot be pleaded against a petition which seeks to enforce the fundamental rights guaranteed by the Constitution.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Article 32"
    },
    {
      "id": "pa2",
      "text": "The right to move the Supreme Court for the enforcement of the fundamental rights which is guaranteed by Art. 32 is itself a fundamental right and it would be singularly inappropriate to whittle down the said fundamental right by putting it in the straight jacket of the technical rule of res judicata.",
      "supporting_facts": [],
      "legal_basis": "Article 32(1)"
    },
    {
      "id": "pa3",
      "text": "The remedies available to the petitioners to move the High Court under Art. 226 and this Court under Art. 32 are alternate remedies and so the adoption of one remedy cannot bar the adoption of the other.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Art. 32(1) does not guarantee to every citizen the right to make a petition under the said article but it merely gives him the right to move this Court by appropriate proceedings, and the appropriate proceedings in cases like the present would be proceedings by way of an application for special leave under Art. 136 or by way of appeal under the appropriate article of the Constitution.",
      "supporting_facts": [
        "f8",
        "f12"
      ],
      "legal_basis": "Article 32(1), Article 136"
    },
    {
      "id": "ra2",
      "text": "The granting of leave is discretionary under both Art. 226 and Art. 32.",
      "supporting_facts": [],
      "legal_basis": "Laxmanappa Hanumantappa Jamkhandi v. Union of India; Dewan Bahadur Seth Gopal Das Mohta v. Union of India"
    },
    {
      "id": "ra3",
      "text": "Dismissal of writ under Art. 226 creates bar of res judicata against Art. 32 petition.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 11 CPC (res judicata)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Art. 32 confers upon a citizen the right to move this Court by an original petition wherever his grievance is that his fundamental rights have been illegally contravened.",
      "addresses_issue": "i1",
      "key_observation": "Fundamental right under Art. 32 is guaranteed, but must be considered with public policy of res judicata."
    },
    {
      "id": "cr2",
      "text": "The rule of res judicata is founded on considerations of public policy: finality to judgments and avoiding vexatious litigation.",
      "addresses_issue": "i1",
      "key_observation": "Res judicata is based on high public policy, not merely technical."
    },
    {
      "id": "cr3",
      "text": "Judgment of High Court under Art. 226, if on merits, binds parties unless reversed; cannot be bypassed by Art. 32 petition.",
      "addresses_issue": "i1",
      "key_observation": "Jurisdictions under 226 and 32 are concurrent in scope for fundamental rights enforcement."
    },
    {
      "id": "cr4",
      "text": "If High Court dismisses on merits (no fundamental right or no contravention or justified), it bars Art. 32; if on laches, alternative remedy, or in limine without speaking order, no bar.",
      "addresses_issue": "i1",
      "key_observation": "Distinction based on nature of dismissal."
    },
    {
      "id": "cr5",
      "text": "Pandit M. S. M. Sharma v. Dr. Shree Krishna Sinha establishes res judicata applies even to Art. 32 petitions.",
      "addresses_issue": "i1",
      "key_observation": "Previous SC decision under Art. 32 bars subsequent one."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "If a writ petition filed by a party under Art. 226 is considered on the merits as contested matter, and is dismissed the decision thus pronounced would continue to bind the parties unless it is otherwise modified or reversed by appeal or other appropriate proceedings permissible under the Constitution.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "If the petition filed in the High Court under Art. 226 is dismissed not on the merits but because of the laches of the party or because it is held that the party had an alternative remedy available to it, then the dismissal would not constitute a bar to a subsequent petition under Art. 32.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "If the petition is dismissed in limine without passing a speaking order then such dismissal cannot be treated as creating a bar of res judicata.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "If the petition is dismissed as withdrawn it cannot be a bar to a subsequent petition under Art. 32.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Laxmanappa Hanumantappa Jamkhandi v. The Union of India",
      "citation": "1955 1 S.C.R. 760",
      "treatment": "referred",
      "relevance": "Art. 32 discretionary; observations obiter"
    },
    {
      "case_name": "Dewan Bahadur Seth Gopal Das Mohta v. The Union of India",
      "citation": "1955 1 S.C.R. 773",
      "treatment": "referred",
      "relevance": "Art. 32 discretionary; observations obiter"
    },
    {
      "case_name": "Basheshar Nath v. The Commissioner of Income-tax, Delhi and Rajasthan",
      "citation": "1959 SUPP. 1 S.C.R. 528",
      "treatment": "followed",
      "relevance": "If fundamental right contravened, entitled to relief; no waiver"
    },
    {
      "case_name": "Romesh Thappar v. The State of Madras",
      "citation": "1950 S.C.R. 594",
      "treatment": "followed",
      "relevance": "SC is protector of fundamental rights; no need to go to HC first"
    },
    {
      "case_name": "Pandit M. S. M. Sharma v. Dr. Shree Krishna Sinha",
      "citation": "1961 1 S.C.R. 96",
      "treatment": "followed",
      "relevance": "Res judicata applies to subsequent Art. 32 petition"
    },
    {
      "case_name": "Raj Lakshmi Dasi v. Banamali Sen",
      "citation": "1953 S.C.R. 154",
      "treatment": "referred",
      "relevance": "Principle of res judicata applies even if first tribunal lacks jurisdiction for second"
    },
    {
      "case_name": "Janardan Reddy v. The State of Hyderabad",
      "citation": "1951 S.C.R. 344",
      "treatment": "referred",
      "relevance": "Reserved opinion on Art. 32 after Art. 226 dismissal"
    },
    {
      "case_name": "Syed Qasim Razvi v. The State of Hyderabad",
      "citation": "1953 S.C.R. 589",
      "treatment": "referred",
      "relevance": "Similar reservation"
    },
    {
      "case_name": "Bhagubhai Dullabhabhai Bhandari v. The District Magistrate, Thana",
      "citation": "1956 S.C.R. 533",
      "treatment": "referred",
      "relevance": "HC decision binding after SL petition refused"
    },
    {
      "case_name": "Re, Hastings (No. 2)",
      "citation": "1958 3 All E.R. Q.B.D. 625",
      "treatment": "referred",
      "relevance": "Successive habeas corpus petitions barred"
    },
    {
      "case_name": "Re, Hastings (No. 3)",
      "citation": "1959 1 All E.R. Ch.D. 698",
      "treatment": "referred",
      "relevance": "Applied to Chancery Division"
    },
    {
      "case_name": "Mussammat Gulab Koer v. Badshah Bahadur",
      "citation": "1909 13 C.W.N. 1197",
      "treatment": "distinguished",
      "relevance": "Alternate remedies not always barred; but not applicable here"
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 226",
        "Article 136",
        "Article 227"
      ],
      "relevance": "Jurisdiction for writs to enforce fundamental rights; res judicata applicability"
    },
    {
      "name": "U. P. Tenancy Act, 1939",
      "sections": [
        "Section 180",
        "Section 267"
      ],
      "relevance": "Suits for ejectment and appeals"
    },
    {
      "name": "U. P. Zamindari Abolition and Land Reforms Act",
      "sections": [
        "Section 20 (as amended by Act XVI of 1953 and Act XX of 1954)"
      ],
      "relevance": "Entitlement to possession of land"
    },
    {
      "name": "Bombay Service Inam Useful to the Community Abolition Act, 1953",
      "sections": [
        "Section 5(3)"
      ],
      "relevance": "Power of State Government not arbitrary"
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 11"
      ],
      "relevance": "Rule of res judicata"
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Preliminary objection upheld for WP Nos. 66 & 67/1956 and 5/1958: dismissed as barred by res judicata. Rejected for WP 8/1960 (withdrawn/not on merits), set for hearing. For WP 77/1957, orders to be filed, then to Constitution Bench. For WP 15/1957, no bar, set for hearing. No order as to costs for dismissed petitions.",
    "relief_granted": "None; some petitions dismissed, others listed for hearing on merits",
    "costs": "No order as to costs"
  },
  "key_quotes": [
    {
      "text": "The right given to the citizen to move this Court by a petition under Art. 32 and claim an appropriate writ against the unconstitutional infringement of his fundamental rights itself is a matter of fundamental right.",
      "speaker": "court",
      "significance": "Emphasizes Art. 32 as fundamental right"
    },
    {
      "text": "It is in the interest of the public at large that a finality should attach to the binding decisions pronounced by Courts of competent jurisdiction, and it is also in the public interest that individuals should not be vexed twice over with the same kind of litigation.",
      "speaker": "court",
      "significance": "Basis of res judicata as public policy"
    },
    {
      "text": "This Court in the circumstances constituted the protector and guarantor of the fundamental rights, and it cannot, consistently with the responsibility so laid upon it, refuse to entertain applications seeking protection against infringements of such rights.",
      "speaker": "court",
      "relevance": "From Romesh Thappar; SC's role"
    },
    {
      "text": "An original petition for a writ under Art. 32 cannot take the place of an appeal against the order passed by the High Court in the petition filed before it under Art. 226.",
      "speaker": "court",
      "significance": "Art. 32 not appellate over Art. 226"
    }
  ],
  "_case_id": "1961_18",
  "_label": 0,
  "_text_length": 42844,
  "_extracted_at": "2026-02-10T19:29:51.225625"
}