{
  "metadata": {
    "case_name": "President, Municipal Board, Pilkhuwa v. State of Uttar Pradesh & Ors.",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Civil Appeal No. 401 of 1961",
    "date_of_judgment": "1961-09-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was the President of the Municipal Board, Pilkhuwa, in January-February 1959.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On January 4, 1959, a written notice of intention to make a motion of no-confidence in the President signed by nine members of the Board, including Ram Nath and Kesho Ram Gupta, was delivered to the District Magistrate, Meerut, pursuant to sub-s. 2 of s.87-A of the U.P. Municipalities Act, 1916.",
      "type": "material",
      "date": "1959-01-04",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "District Magistrate, Meerut, convened a meeting of the Board on February 6, 1961.",
      "type": "procedural",
      "date": "1961-02-06",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant filed writ petition No. 367 of 1961 in the High Court on February 2, 1961, questioning the validity of the notice; dismissed in limine on the same day as premature and no removal order passed.",
      "type": "procedural",
      "date": "1961-02-02",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Meeting of the Board took place on February 6, 1961; Mr. Agarwala, Munsif, Meerut, presided; all ten members present voted for the motion of no-confidence; Munsif declared the motion carried.",
      "type": "material",
      "date": "1961-02-06",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Ram Nath, Kesho Ram Gupta, and Raghunandan Prasad incurred disqualification under s.13-D(g) prior to January 4, 1961, being in arrears of municipal tax and other dues in excess of one year's demand.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "High Court held Ram Nath in arrears of house tax on February 6, 1961; Kesho Ram Gupta and Raghunandan Prasad not in arrears of Tehbazari tax for 1959-60 and house tax respectively.",
      "type": "admitted",
      "date": "1961-02-06",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Total number of members of the Board: seventeen.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant filed writ petition (Civil Misc. Writ No. 846 of 1961) praying for mandamus to give effect to resolution dated February 6, 1961, and quashing proceedings; dismissed by Allahabad High Court on May 24, 1961.",
      "type": "procedural",
      "date": "1961-05-24",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Resolution of Board dated February 6, 1961, held that no Tehbazari tax due from Kesho Ram Gupta and amount deposited by him under protest on February 9, 1961, be refunded.",
      "type": "material",
      "date": "1961-02-09",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a member incurring disqualification under s.13-D(g) ceases to be a member or merely becomes disqualified to exercise office and act as a member.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the notice of no-confidence was valid, requiring signatures of more than half the total members.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether proceedings of the meeting were vitiated by participation of disqualified members and saved by sub-s.2 of s.113.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether order dismissing earlier writ petition No. 397 of 1961 operates as res judicata.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Order dismissing writ petition No. 397 of 1961 could not operate as res judicata as dismissed on prematurity, not merits.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Member incurring disqualification under s.13-D ceases to be member and cannot act as member.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.13-D U.P. Municipalities Act"
    },
    {
      "id": "pa3",
      "text": "Kesho Ram Gupta disqualified; resolution holding no Tehbazari tax due and refunding deposit ultra vires.",
      "supporting_facts": [
        "f7",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Due to disqualifications of Ram Nath and Kesho Ram Gupta, notice and proceedings invalid as numbers fall short of half total members.",
      "supporting_facts": [
        "f2",
        "f5",
        "f6",
        "f8"
      ],
      "legal_basis": "sub-s.2 s.87-A"
    },
    {
      "id": "pa5",
      "text": "Proceedings vitiated by disqualified member's participation; s.87-A meeting not covered by sub-s.2 s.113.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "s.87-A, sub-s.2 s.113"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Conceded that order dismissing writ No. 397 of 1961 does not operate as res judicata on validity of notice.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Member incurring disqualification under s.13-D(g) does not cease membership; right to act suspended until disqualification removed or removal under s.40.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "s.13-D(g), s.40"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.13-D applies to continuing members; disqualification does not automatically cause cessation of membership or suspension of rights unless under s.40(5).",
      "addresses_issue": "i1",
      "key_observation": "Member continues entitled to participate unless suspended; otherwise proceedings unstable."
    },
    {
      "id": "cr2",
      "text": "Disqualified members (Kesho Ram Gupta, Raghunandan Prasad) competent to sign notice and vote.",
      "addresses_issue": "i2",
      "key_observation": "Nine valid votes constitute majority of more than half of 17 members."
    },
    {
      "id": "cr3",
      "text": "Proceedings and resolution of February 6, 1961 valid.",
      "addresses_issue": "i3",
      "key_observation": "High Court correct in dismissing writ, though for different reasons."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Member of Municipal Board incurring disqualification under cl.(g) s.13-D does not cease to be member or lose right to participate unless suspended under s.40(5).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Notice of no-confidence and meeting proceedings valid.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Election Commission, India v. Saka Venkata Subba Rao",
      "citation": "1953 S.C.R. 1144",
      "treatment": "followed",
      "relevance": "Interpreted 'for being chosen as, and for being' to cover supervening disqualifications without automatic cessation."
    }
  ],
  "statutes_cited": [
    {
      "name": "U.P. Municipalities Act, 1916",
      "sections": [
        "s.87-A sub-s.2",
        "s.13-D cl.(g)",
        "s.13-C",
        "s.40",
        "s.113 sub-s.2",
        "s.166"
      ],
      "relevance": "Governs no-confidence notice, disqualifications, membership cessation, removal, meeting validity."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding the High Court's dismissal of the writ petition; held proceedings and no-confidence resolution valid as disqualified members retain rights to participate absent suspension order.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A member of the board does not automatically come under suspension or lose his right to take part in the proceedings of the board or perform the duties of a member or cease to be a member of the board merely on his incurring any of the disqualifications mentioned in s.13-D.\"",
      "speaker": "court",
      "significance": "Core holding on effect of disqualification."
    },
    {
      "text": "\"During the continuance of the disqualification the persons right to act as a member falls into a state of suspension.\"",
      "speaker": "lower_court",
      "significance": "High Court view, contrasted by Supreme Court."
    }
  ],
  "_case_id": "1961_376",
  "_label": 0,
  "_text_length": 13299,
  "_extracted_at": "2026-02-10T19:35:25.850091"
}