{
  "metadata": {
    "case_name": "Appellant v. Respondent (Civil Appeal Nos. 309 and 525 of 1959)",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO J."
    ],
    "case_number": "Civil Appeal No. 309 and 525 of 59",
    "date_of_judgment": "1961-12-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "A contract was entered into between the parties for supply of gunny sacks on August 29, 1951. The contract contained an arbitration clause referring all disputes to the arbitration of the Bengal Chamber of Commerce under its rules.",
      "type": "material",
      "date": "1951-08-29",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Disputes arose with respect to carrying out of the contract and on October 25, 1951, the respondent referred these disputes to the arbitration of the Bengal Chamber of Commerce (case numbered 217 of 1951).",
      "type": "procedural",
      "date": "1951-10-25",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "On April 17, 1952, the tribunal of Arbitration made an award disallowing the claim of the respondent. This award was filed in the High Court.",
      "type": "procedural",
      "date": "1952-04-17",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "On May 25, 1953, the award was set aside on the ground of misconduct on the part of the arbitrators by a learned Single Judge of the Calcutta High Court.",
      "type": "procedural",
      "date": "1953-05-25",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "The order setting aside the award was taken in appeal and on July 8, 1954 the appeal was dismissed. Leave to appeal to the Supreme Court was refused.",
      "type": "procedural",
      "date": "1954-07-08",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Soon after the award was set aside, the respondent addressed a letter to the Chamber on September 7, 1953 stating that as the award in case No. 217-G of 1951 had been set aside, it begged to refer the matter for arbitration de novo and enclosed its statement of the case.",
      "type": "procedural",
      "date": "1953-09-07",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Another tribunal was constituted under the rules of the Chamber to decide the dispute afresh. The appellant appeared before the tribunal and contended that it had no jurisdiction to make an award on a second reference in the same dispute.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The tribunal proceeded and made the award on March 15, 1955 in favour of the respondent.",
      "type": "procedural",
      "date": "1955-03-15",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "On August 4, 1955, the appellant made an application to the High Court praying that the award be set aside or declared null and void and the arbitration agreement superseded on the ground that the second reference was incompetent.",
      "type": "procedural",
      "date": "1955-08-04",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "The learned Single Judge relied on Barangore Jute Factory case, held it was not a second reference but continuation, no misconduct, dismissed the application.",
      "type": "procedural",
      "date": "1958-08-27",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "In Appeal No. 525 of 1959, appellant objected to fresh tribunal, applied under s.33 Act that no arbitration agreement existed, Single Judge allowed revoking authority, appeal allowed by Division Bench.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Special leave granted by Supreme Court for both appeals.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether after an award is set aside without superseding the reference under s.19 Arbitration Act 1940, further arbitration on the same dispute is possible under the arbitration agreement and rules of the Bengal Chamber of Commerce, or whether the arbitrator is functus officio precluding second reference.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the rules of the Chamber (rr. V, VII, X) permit constitution of a fresh tribunal after the earlier award set aside for misconduct.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "In Appeal 525, whether appeal lay against s.33 order.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "First award set aside on May 25, 1953, reference exhausted, arbitrator functus officio, not possible without fresh arbitration agreement to decide same dispute again, whether letter amounts to second reference or continuation.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "Fundamental principles of arbitration; Russell on Arbitration 15th Edn. p.298; Mordues v. Palmer; Sutherland and Company v. Hannevig Brothers"
    },
    {
      "id": "pa2",
      "text": "No provision in Chamber rules for fresh tribunal after award set aside for misconduct; rr. V, VII, X do not authorize.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Rules V, VII, X of Bengal Chamber of Commerce"
    },
    {
      "id": "pa3",
      "text": "In CA 525, s.33 order not appealable under s.39, High Court no jurisdiction.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Arbitration Act ss.33, 39"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Not a second reference, but request for Chamber to take up dispute again and make proper award after set aside; continuation of original reference.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "The Barangore Jute Factory Co. Ltd. v. Messrs. Hulas Chand Rupchand"
    },
    {
      "id": "ra2",
      "text": "Fresh tribunal under rr. V(2), VII, X of Chamber rules.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Rules V, VII, X of Bengal Chamber of Commerce"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "English cases have no bearing; under Arbitration Act 1940 s.19, court may (discretion) supersede reference when setting aside award; if not, reference and agreement subsist depending on its terms.",
      "addresses_issue": "i1",
      "key_observation": "No supersession ordered in 1953; arbitration clause wide, contemplates references as disputes arise."
    },
    {
      "id": "cr2",
      "text": "Arbitrator generally functus officio after award, but s.19 allows survival; s.13(d), s.16 permit corrections/remittal.",
      "addresses_issue": "i1",
      "key_observation": "Machinery in agreement/rules allows further arbitration if reference not superseded."
    },
    {
      "id": "cr3",
      "text": "Letter of Sept 7, 1953 not second reference but request to continue after set aside.",
      "addresses_issue": "i1",
      "key_observation": "'De novo' in context means take up reference again."
    },
    {
      "id": "cr4",
      "text": "Rule V(2) for initial appointment only; Rule VII for time expiry, not set aside; Rule X applies as prior tribunal 'incapable of acting' due to misconduct (wide amplitude, not just physical).",
      "addresses_issue": "i2",
      "key_observation": "Registrar could substitute new tribunal under r.X."
    },
    {
      "id": "cr5",
      "text": "In CA 525, even if jurisdictional point, respondent entitled to special leave; same reasons apply.",
      "addresses_issue": "i3",
      "key_observation": "No interference."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under s.19 Arbitration Act, if court does not supersede reference on setting aside award, arbitration agreement subsists; further arbitration possible if machinery in agreement/rules permits, as here via r.X Chamber rules.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Fresh tribunal validly appointed under r.X as prior incapable due to misconduct.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "The Barangore Jute Factory Co. Ltd. v. Messrs. Hulas Chand Rupchand",
      "citation": null,
      "treatment": "followed",
      "relevance": "Permissible for Chamber to take up dispute again after award set aside without supersession."
    },
    {
      "case_name": "Rallis India Ltd. v. B.V. Manickam Chetti Co.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Similar view on s.19 allowing further arbitration if no supersession."
    },
    {
      "case_name": "Firm Gulab Rai Girdhari Lal v. Firm, Bansi Lal Hansraj",
      "citation": null,
      "treatment": "followed",
      "relevance": "Similar view on s.19."
    },
    {
      "case_name": "Mordues v. Palmer",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Arbitrator functus officio after signing, but no bearing on Indian Act s.19."
    },
    {
      "case_name": "Sutherland and Company v. Hannevig Brothers Limited",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Under English Act 1889, no bearing here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Arbitration Act, 1940",
      "sections": [
        "3",
        "4",
        "5",
        "6",
        "7",
        "8",
        "9",
        "10",
        "11",
        "12",
        "13",
        "14",
        "15",
        "16",
        "17",
        "18",
        "19",
        "20",
        "25",
        "30",
        "33",
        "39"
      ],
      "relevance": "Governs arbitration without court intervention (Chap II); s.19 key - discretion not to supersede reference on set aside award, allowing further arbitration if agreement permits; s.33 for objections; s.39 appeals."
    },
    {
      "name": "Code of Civil Procedure (Sch. II, para 15(2))",
      "sections": [
        "Sch. II para 15(2)"
      ],
      "relevance": "Pre-1940, mandatory supersession on set aside; Act departs, gives discretion."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Both appeals dismissed. Second arbitration valid as no supersession under s.19, wide arbitration clause, r.X Chamber rules permit new tribunal after prior misconduct. High Court correctly upheld second award and revoked s.33 order in CA 525.",
    "relief_granted": "None to appellant; second award stands.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Where an award has been set aside, the court may by order supersede the reference and shall thereupon order that the arbitration agreement shall cease to have effect with respect to the difference referred.\"",
      "speaker": "court",
      "significance": "Quotes s.19 Arbitration Act, central to holding on discretion."
    },
    {
      "text": "\"If the court finds that the arbitration agreement is of a general nature and contemplates continuation of the reference with respect to the same dispute... it may not supersede the reference.\"",
      "speaker": "court",
      "significance": "Explains legislative intent and discretion under s.19."
    },
    {
      "text": "\"the words 'becomes incapable of acting' in r. X are of wide amplitude and do not refer to cases only of physical incapacity.\"",
      "speaker": "court",
      "significance": "Interprets r.X to allow new tribunal post-misconduct."
    }
  ],
  "_case_id": "1961_167",
  "_label": 0,
  "_text_length": 31573,
  "_extracted_at": "2026-02-10T19:32:13.800775"
}