{
  "metadata": {
    "case_name": "Mahant of the Asthal Estate, Salauna v. State of Bihar",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 449 of 1958",
    "date_of_judgment": "1961-01-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "High Court of Judicature at Patna answered in the affirmative the question referred by the Board of Agricultural Income-tax, Bihar, under s. 28(3) of the Bihar Agricultural Income-tax Act, 1948: Whether, in the facts and circumstances of the case, the petitioner could be legally assessed for the income of the Estate in 1355 Fasli when the Estate was in the hand of the Receiver.",
      "type": "procedural",
      "date": "1956-08-07",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant is the Mahant of the Asthal Estate, Salauna, in the District of Bhagalpur in Bihar.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In a suit concerning that estate, a Court Receiver was appointed by the First Class Subordinate Judge, Monghyr, to manage the estate. The Receiver functioned till sometime in December, 1949, and under the order of the Subordinate Judge handed over charge of the estate to the appellant on January 8, 1950.",
      "type": "material",
      "date": "1949-12-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On January 15, 1950, the appellant submitted a return of income of the estate to the Agricultural Income-tax Officer, Monghyr, for the Fasli year 1355 corresponding to September 16, 1948, to September 15, 1949.",
      "type": "procedural",
      "date": "1950-01-15",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Agricultural Income-tax Officer assessed on August 7, 1950, the agricultural income of the estate at Rs. 90,507-2-6 and ordered the appellant to pay Rs. 20,290-13-0 as agricultural income-tax.",
      "type": "procedural",
      "date": "1950-08-07",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appeals against the order of assessment preferred to the Commissioner of Agricultural Income-tax and the Board of Agricultural Income-tax, Bihar, were unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Board referred the question to the High Court under s. 28(3) of the Act as arising out of its order.",
      "type": "procedural",
      "date": null,
      "source": "board"
    },
    {
      "id": "f8",
      "text": "Appeal to Supreme Court by special leave under Art. 136 of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant was liable to be assessed to pay agricultural income-tax for the year in which the estate was in the management of the Court Receiver.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "If the land from which agricultural income is derived is held by a Receiver and the income is received by the Receiver, the Receiver alone can, by virtue of s. 13, be deemed to be the assessee and the Receiver alone is liable to pay the tax in respect of that income.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Section 13 of the Bihar Agricultural Income-tax Act, 1948; definition of 'person' in s. 2(m)"
    },
    {
      "id": "pa2",
      "text": "The income received by the appellant from the Receiver did not retain its character of agricultural income and therefore the appellant was not liable to pay agricultural income-tax.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The liability to pay tax is charged on the agricultural income of every person. The income though collected by the Receiver was the income of the appellant. By s. 13, in addition to the owner, the Receiver is to be deemed to be an assessee. But the fact that the Receiver may be deemed to be an assessee and liable to pay tax does not absolve the appellant from the obligation to pay agricultural income-tax.",
      "addresses_issue": "i1",
      "key_observation": "Section 13 merely provides a machinery for recovery of tax, and is not a charging section. When property is in the possession of the Receiver, the taxing authorities may, but are not bound to, treat such persons as assessees and recover tax. The taxing authorities may always proceed against the owner."
    },
    {
      "id": "cr2",
      "text": "The definition in the notation of 'person' undoubtedly included a receiver, trustee, common manager, administrator or executor, and by such inclusion, it is open to the taxing authorities to assess tax against any such persons but on that account, the income in the hand of the owner is not exempt from liability to assessment of tax.",
      "addresses_issue": "i1",
      "key_observation": "Income of the estate was not exempt from payment of tax and by virtue of s. 3, agricultural income-tax was charged upon the income for the assessment year in question, and the appellant was prima facie liable as owner."
    },
    {
      "id": "cr3",
      "text": "The contention that the income received by the appellant from the Receiver did not retain its character of agricultural income was never raised before the taxing authorities and no such question has been referred to this court. The character of the income was accepted to be agricultural income in the hands of the appellant.",
      "addresses_issue": "i1",
      "key_observation": "The only question raised was as to the liability of the appellant to be assessed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The appellant was liable to be assessed to pay agricultural income-tax for the year in which the estate was in the management of the Court Receiver.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bihar Agricultural Income-tax Act, 1948",
      "sections": [
        "Section 3",
        "Section 4",
        "Section 13",
        "Section 28(3)",
        "Section 2(m)"
      ],
      "relevance": "Charging section (s.3), applicability (s.4), liability of receiver/common manager (s.13 as machinery provision), reference to High Court (s.28(3)), definition of 'person' (s.2(m))"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 136"
      ],
      "relevance": "Special leave to appeal to Supreme Court"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the High Court's affirmative answer that the appellant Mahant was liable to be assessed for agricultural income-tax on the estate's income for Fasli 1355 despite the estate being managed by a Court Receiver during that period.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Section 13 merely provides a machinery for recovery of tax, and is not a charging section.",
      "speaker": "court",
      "significance": "Core reasoning distinguishing s.13 from charging provision and affirming owner's liability"
    },
    {
      "text": "The income though collected by the Receiver was the income of the appellant.",
      "speaker": "court",
      "significance": "Establishes that ownership of income persists despite Receiver's management"
    }
  ],
  "_case_id": "1961_6",
  "_label": 0,
  "_text_length": 6511,
  "_extracted_at": "2026-02-10T19:29:38.744588"
}