{
  "metadata": {
    "case_name": "Appellant (Auction Purchaser) v. Smt. Engammal",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO, J."
    ],
    "case_number": "Civil Appeal No. 274 of 1959",
    "date_of_judgment": "1960-11-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "S.V.N. Nanappa Naicker and his sons were adjudged insolvents on an application of Smt. Engammal (respondent).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Insolvents preferred appeal to Madras High Court, dismissed on April 17, 1953.",
      "type": "procedural",
      "date": "1953-04-17",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Official receiver took steps to sell insolvents' property: lot 1 - 145 acres 10 cents dry land and masonry house; lot 2 - 8 acres odd dry land. Both subject to mortgage with encumbrance of Rs. 17,200/- total.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Auction fixed for September 28, 1953. Fifteen creditors present including respondent's son. No request for postponement. Highest bid lot 1: Rs. 4500/- by appellant (brother-in-law of Nanappa Naicker); lot 2: Rs. 70/- by appellant. Total Rs. 4570/-.",
      "type": "procedural",
      "date": "1953-09-28",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Official receiver did not close sale on Sept 28, hoping higher offers; postponed to various dates up to October 26, 1953. Respondent's son present on all dates, no higher offer from respondent.",
      "type": "procedural",
      "date": "1953-09-28 to 1953-10-26",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On October 26, 1953, respondent applied to postpone sale for three months due to drought and low prices for agricultural lands.",
      "type": "procedural",
      "date": "1953-10-26",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Official receiver refused postponement as no higher offer from respondent, knocked down properties to appellant.",
      "type": "procedural",
      "date": "1953-10-26",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On November 18, 1953, respondent applied under s. 68 Provincial Insolvency Act to set aside sale: inadequate price due to drought, stringency in money market; hoped for Rs. 15,000/- exclusive of encumbrances if postponed; offered to bid > Rs. 7500/-; alleged collusion between official receiver, insolvent and appellant.",
      "type": "procedural",
      "date": "1953-11-18",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Debts payable to creditors: Rs. 30,000/-.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Subordinate Judge allowed respondent's application under s.68: price low, prejudices general body of creditors.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "District Judge allowed appeal under s.75: no irregularity in conduct of sale; no collusion; respondent's son present but no higher bid; price not low (criticized Sub Judge's valuation based on doubling mortgage amount from 1936 Rs.20,000/-; insolvent's Rs.80,000/- valuation exaggerated; annual deposit Rs.2000/- not basis for income valuation).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Revision to High Court under proviso to s.75. Respondent offered Rs.9,000/- deposit for fresh auction starting bid Rs.9,000/- + Rs.1,000/- to appellant. High Court accepted offer though price not unconscionably low but low considering extent/nature; creditors get more dividend; allowed revision.",
      "type": "procedural",
      "date": "1956-07-27",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Offer made three years after 1953 auction.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Insolvents in possession during pendency of insolvency appeal, depositing Rs.2000/- annually per High Court order.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court had jurisdiction to interfere with the District Judge's order under proviso to s.75 without concluding that it was not according to law.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Scope of court's power under s.68 to interfere with official receiver's sale under s.59A: grounds like fraud, collusion, irregularity, or grossly inadequate price.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court had no jurisdiction to interfere unless District Judge's order not according to law; High Court did not apply mind to this, carried away by respondent's offer of Rs.9,000/- made three years later (prices may have risen).",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": "Proviso to s.75 Provincial Insolvency Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Court's power under s.68 (in appeal from receiver's act) wider than in execution auction sales; Subordinate Judge right to set aside sale; High Court right to restore that.",
      "supporting_facts": [
        "f8",
        "f10"
      ],
      "legal_basis": "s.68 Provincial Insolvency Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Power under s.68 is judicial, exercised on well-recognised principles; grounds for interfering with receiver's s.59A sale: fraud/collusion, irregularities affecting price, or price so low as to justify not selling at that price; priority: creditors first, insolvent second, purchaser third; but not arbitrary.",
      "addresses_issue": "i2",
      "key_observation": "No fraud/collusion (found by both lower courts); no irregularity; price not shown low by proper valuation minus encumbrance."
    },
    {
      "id": "cr2",
      "text": "Subordinate Judge's finding of low price flawed: no proper valuation (doubled 1936 mortgage; ignored exaggeration in Rs.80,000/-; Rs.2000/- deposit not income proof); District Judge correctly reversed.",
      "addresses_issue": "i2",
      "key_observation": "No evidence price inadequate/unreasonable; respondent could have valued properly or bid higher."
    },
    {
      "id": "cr3",
      "text": "High Court did not consider if District Judge's order according to law; impressed by 3-year later offer (prices may risen); no jurisdiction to interfere.",
      "addresses_issue": "i1",
      "key_observation": "High Court remarked price not unconscionably low but still low vs. 1956 offer."
    },
    {
      "id": "cr4",
      "text": "Supreme Court cannot find price low: no proper valuation or encumbrance details on record; District Judge's order according to law.",
      "addresses_issue": "i1",
      "key_observation": "Insufficient material to say appellant's price low in 1953 circumstances."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court lacked jurisdiction under proviso to s.75 without finding District Judge's order not according to law; order set aside, District Judge's restored.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "To interfere under s.68 with receiver's sale, need judicial grounds: fraud/collusion/irregularity/grossly inadequate price proven by proper valuation net of encumbrance; none here.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Provincial Insolvency Act, No. V of 1920",
      "sections": [
        "s. 68",
        "s. 59A",
        "s. 75"
      ],
      "relevance": "s.68: court control over receiver's acts (sale set aside if justified); s.59A: receiver's power to sell; s.75: appeal to District Judge, High Court revision if order not according to law."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order dated July 27, 1956 set aside; District Judge's order restored, confirming sale to appellant.",
    "relief_granted": "Sale to appellant confirmed; no fresh auction.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the power under s. 68 is a judicial power and must be exercised on well recognised principles, justifying interference with an act of the receiver\"",
      "speaker": "court",
      "significance": "Defines scope of s.68 interference."
    },
    {
      "text": "\"there must be judicial grounds on which the court will act in setting aside the sale decided upon by the official receiver.\"",
      "speaker": "court",
      "significance": "Emphasizes non-arbitrary judicial review."
    },
    {
      "text": "\"the High Court did not consider the question whether the order of the District Judge was according to law or not.\"",
      "speaker": "court",
      "significance": "Basis for setting aside High Court order."
    }
  ],
  "_case_id": "1961_87",
  "_label": 1,
  "_text_length": 16917,
  "_extracted_at": "2026-02-10T19:30:36.340607"
}