{
  "metadata": {
    "case_name": "Petitions Nos. 140 and 177 to 191 of 1959",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "KAPUR, J."
    ],
    "case_number": "Petitions Nos. 140 and 177 to 191 of 1959",
    "date_of_judgment": "1961-03-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioners are four partners of a firm named Mohammedaly Sarafaly Co., Madras, which was carrying on business in hardware, stocks, shares, etc.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For the assessment years 1942-43 to 1945-46 this firm was treated as a registered firm under the Indian Income-tax Act and therefore the partners were assessed on their respective shares of the profits from the business of the firm.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "All assessments were completed before 1949 and total income for the purpose of assessment for those four years was about Rs. 29,00,000.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1955 the petitioners under a Voluntary Disclosure Scheme with regard to profits which had escaped assessment made a disclosure of their income and proceedings were taken under s. 34 of the Income-tax Act.",
      "type": "procedural",
      "date": "1955",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In the month of April, 1959, there was a reassessment on all the four partners and the total income for the four assessment years thus came to about Rs. 35 lakhs which included Rs. 29 lakhs already assessed.",
      "type": "procedural",
      "date": "1959-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On that income, income-tax, super-tax, and surcharge were levied. The surcharge, according to the petition was Rs. 3,82,791.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Federal Legislature had power under the Government of India Act, 1935, to impose a surcharge for the purposes of the Central Government as provided in s. 8(1) of the Finance Act, 1942 and similar provisions in Finance Acts of 1943, 1944 and 1945, or whether such power was limited to surcharge for Federal purposes under s. 138(1)(b) of the Government of India Act, 1935.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether 'purposes of the Central Government' and 'Federal purposes' are the same or different concepts under the relevant statutory definitions.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Federal Legislature was not competent to levy the surcharge as it was imposed for the purposes of the Central Government under s. 8(1) of the Finance Act, 1942, whereas under s. 138(1)(b) of the Government of India Act, 1935, the power to impose surcharge was only for Federal purposes.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Section 138(1)(b) Government of India Act, 1935; Section 8(1) Finance Act, 1942"
    },
    {
      "id": "pa2",
      "text": "The terms 'purposes of the Central Government' and 'Federal purposes' are not the same but two different concepts; Federal purposes means purposes of the Federal Government i.e., Governor-General in Council, while Central Government includes Provincial Governments in certain cases.",
      "supporting_facts": [],
      "legal_basis": "Section 313(3) Government of India Act, 1935; Section 3(8)(a) and 18(a) General Clauses Act, 1897; Section 124(1) Government of India Act, 1935"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The power of the Federal Legislature to legislate was conferred by s. 100(1) and (2) of the Government of India Act, 1935, including item 54 of List I: 'Taxes on income other than agricultural income', which must be given the widest possible amplitude.",
      "addresses_issue": "i1",
      "key_observation": "Federal Legislature had power to legislate on taxes on income under List I."
    },
    {
      "id": "cr2",
      "text": "Under s. 138(1) proviso (b) of the Government of India Act, 1935, the Federal Legislature may increase taxes by a surcharge for Federal purposes, and the proceeds form part of the revenues of the Federation.",
      "addresses_issue": "i1",
      "key_observation": "Sufficient indication in s. 138 that surcharge proceeds are for Federation revenues."
    },
    {
      "id": "cr3",
      "text": "The argument that 'Federal purposes' is a term of lesser amplitude than 'purposes of the Central Government' is wholly fallacious; no different concept was intended by the words 'purposes of the Central Government' from 'Federal purposes'.",
      "addresses_issue": "i2",
      "key_observation": "Definitions in General Clauses Act do not create distinction limiting legislative power."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The imposition of surcharge under the Finance Acts of 1942-1945 is valid and within the competence of the Federal Legislature under the Government of India Act, 1935.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "'Federal purposes' in s. 138(1)(b) aligns with the purposes for which surcharge was levied for the Central Government/Federal Government.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Basis for petitions for enforcement of Fundamental Rights"
    },
    {
      "name": "Finance Act, 1942 (Act XII of 1942)",
      "sections": [
        "Section 8(1)"
      ],
      "relevance": "Provision imposing surcharge on income-tax and super-tax for purposes of the Central Government"
    },
    {
      "name": "Finance Acts of 1943, 1944, 1945",
      "sections": [
        "Similar provisions to s. 8(1) of 1942 Act"
      ],
      "relevance": "Imposed surcharge on income for assessment years 1942-43 to 1945-46"
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Section 100",
        "Section 138(1)",
        "Section 313(3)",
        "Section 124(1), (4)",
        "Item 54 List I Seventh Schedule"
      ],
      "relevance": "Defined legislative power of Federal Legislature to tax income and impose surcharge for Federal purposes"
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 34",
        "Section 55"
      ],
      "relevance": "Basis for reassessment proceedings and super-tax rates"
    },
    {
      "name": "General Clauses Act, 1897",
      "sections": [
        "Section 3(8)(a)",
        "Section 18(a)"
      ],
      "relevance": "Definitions of 'Central Government' and 'Federal Government'"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "These sixteen petitions under Art. 32 challenging the legality of surcharge imposed under Finance Acts of 1942-1945 on reassessed income fail as the Federal Legislature was competent to impose the surcharge, and are dismissed with costs.",
    "relief_granted": null,
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "\"This argument, in our opinion, is wholly fallacious.\"",
      "speaker": "court",
      "significance": "Court's rejection of petitioners' distinction between 'Federal purposes' and 'purposes of the Central Government'"
    },
    {
      "text": "\"Taxes on income other than agricultural income shall be levied and collected by the Federation... the Federal Legislature may... increase the said taxes by a surcharge for Federal purposes...\"",
      "speaker": "court",
      "significance": "Quotes s. 138(1) GOI Act, central to the power to impose surcharge"
    },
    {
      "text": "\"It has been held that the items have to be given the widest possible amplitude.\"",
      "speaker": "court",
      "significance": "Affirms broad legislative power under List I item 54"
    }
  ],
  "_case_id": "1961_31",
  "_label": 0,
  "_text_length": 9172,
  "_extracted_at": "2026-02-10T19:29:40.868083"
}