{
  "metadata": {
    "case_name": "Association of Merchants and Others v. Union of India & Ors.",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Writ Petition No. 65 of 1959",
    "date_of_judgment": "1961-04-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The second and the third applicants are merchants who used to import considerable quantities of glass chatons upto 1957.",
      "type": "background",
      "date": null,
      "source": "petitioners"
    },
    {
      "id": "f2",
      "text": "The first applicant is an Association of merchants, some of whom were importers and some the actual users of glass chatons.",
      "type": "background",
      "date": null,
      "source": "petitioners"
    },
    {
      "id": "f3",
      "text": "Import of glass chatons could be made only on licences granted by licensing authorities. Since 1955 the matter has been regulated by the Imports Control Order, 1955 made under sections 3 and 4-A of the Import and Export Control Act, 1947, which prohibited import except under licence.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Policy for import of glass chatons from January 1957 to end of March 1958 was total prohibition.",
      "type": "procedural",
      "date": "1957-01-01",
      "source": "government"
    },
    {
      "id": "f5",
      "text": "Since April 1958, policy permitted import only under the Export Promotion Scheme.",
      "type": "procedural",
      "date": "1958-04-01",
      "source": "government"
    },
    {
      "id": "f6",
      "text": "No application was made by the second or third applicants or other merchants for import licences in 1957 or thereafter, and no licences were issued to them.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Licences issued to State Trading Corporation for import of glass chatons of value Rs. 5 lakhs for April-September 1958, and Rs. 1,25,000 for October 1958 to March 1959.",
      "type": "material",
      "date": "1958-04-01",
      "source": "respondents"
    },
    {
      "id": "f8",
      "text": "Present application made on April 27, 1959.",
      "type": "procedural",
      "date": "1959-04-27",
      "source": "petitioners"
    },
    {
      "id": "f9",
      "text": "Periods of import permits granted to State Trading Corporation have expired.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "No scheme to issue fresh licences in favour of State Trading Corporation.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Para 6(h) of Imports Control Order, 1955 lays down ground for refusal of licence if licensing authority decides to canalise imports through special or specialised agencies or channels.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Para 6(h) of the Imports Control Order, 1955 is void as contravening Art. 19(1)(f) and (g), Art. 31 of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether s. 3 of the Imports and Exports Control Act, 1947 is bad to the extent it permits making an order like Para 6(h).",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether grant of licences to State Trading Corporation while denying to petitioners results in denial of equal protection under Art. 14.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Para. 6(h) of the Imports Control Order, 1955 is void being in contravention of Art. 19(1)(f) and (g), and Art. 31 as it imposes unreasonable restriction on right to carry on trade and acquire property by allowing refusal of licences to canalise imports through special agencies.",
      "supporting_facts": [
        "f3",
        "f11"
      ],
      "legal_basis": "Art. 19(1)(f), (g); Art. 31"
    },
    {
      "id": "pa2",
      "text": "S. 3 of Imports and Exports Control Act, 1947 is bad to the extent it permits the Central Government to make an order as in Para. 6(h).",
      "supporting_facts": [
        "f3",
        "f11"
      ],
      "legal_basis": "Imports and Exports Control Act, 1947 s. 3"
    },
    {
      "id": "pa3",
      "text": "Grant of licences to State Trading Corporation while none to petitioners denies equal protection under Art. 14.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Art. 14"
    },
    {
      "id": "pa4",
      "text": "So long as Para. 6(h) remains it will be useless to apply for licences.",
      "supporting_facts": [
        "f6",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Canalization of imports through special agencies is in interests of general public as part of economic policy.",
      "supporting_facts": [
        "f4",
        "f5",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Requirement of licence is restriction on trade but not unreasonable by itself. Para 6(h) allows refusal if canalisation decided, which is necessary to implement policy and in interests of general public.",
      "addresses_issue": "i1",
      "key_observation": "If canalization is in interests of general public, refusal to outsiders is also."
    },
    {
      "id": "cr2",
      "text": "Policy on imports integral to economic policy considering trade, monetary, agriculture, industries, political factors. Court assumes government decision on canalisation is in public interest unless contrary clearly shown.",
      "addresses_issue": "i1",
      "key_observation": "Burden heavy on challenger; canalisation per se not unreasonable."
    },
    {
      "id": "cr3",
      "text": "Selection of particular agency may be challenged under Art. 14, but not raised here.",
      "addresses_issue": "i1",
      "key_observation": "Attack on Para 6(h) fails."
    },
    {
      "id": "cr4",
      "text": "No acquisition of property under Art. 31; mere refusal of licence does not acquire right to trade.",
      "addresses_issue": "i1",
      "key_observation": "Art. 31 has no application."
    },
    {
      "id": "cr5",
      "text": "Petitioners made no application under Export Promotion Scheme, so no discrimination under Art. 14.",
      "addresses_issue": "i3",
      "key_observation": "No scope for argument of discrimination."
    },
    {
      "id": "cr6",
      "text": "Attack on s. 3 of Act fails as Para 6(h) valid.",
      "addresses_issue": "i2",
      "key_observation": "Consequential failure."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Para 6(h) of Imports Control Order, 1955 is valid and not unreasonable restriction under Art. 19(1)(f),(g).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "S. 3 of Imports and Exports Control Act, 1947 valid.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No violation of Art. 14 or Art. 31.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 32",
        "Art. 19(1)(f)",
        "Art. 19(1)(g)",
        "Art. 31",
        "Art. 14"
      ],
      "relevance": "Petition for enforcement of fundamental rights; challenged restrictions tested against these articles."
    },
    {
      "name": "Imports Control Order, 1955",
      "sections": [
        "Para 6(h)"
      ],
      "relevance": "Provision allowing refusal of licences for canalisation through special agencies upheld as reasonable."
    },
    {
      "name": "Imports and Exports (Control) Act, 1947",
      "sections": [
        "s. 3",
        "s. 4-A"
      ],
      "relevance": "Empowers making of Import Control Order; s. 3 upheld."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The writ petition under Art. 32 dismissed as petitioners not entitled to any relief; challenges to Para 6(h) and s. 3 rejected; no discrimination or violation of fundamental rights found.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "If therefore a canalization of imports is in the interests of the general public the refusal of imports licences to applicants outside the agencies or channels decided upon must necessarily be held also in the interests of the general public.",
      "speaker": "court",
      "significance": "Core reasoning upholding Para 6(h) as reasonable restriction."
    },
    {
      "text": "The Court would proceed on the assumption that that decision is in the interests of the general public unless the contrary is clearly shown.",
      "speaker": "court",
      "significance": "Sets high burden on challengers to canalisation policy."
    },
    {
      "text": "It is obvious that if a decision has been made that imports shall be by particular agencies or channels the granting of licence to any applicant outside the agency or channel would frustrate the implementation of that decision.",
      "speaker": "court",
      "significance": "Justifies necessity of refusal under Para 6(h)."
    }
  ],
  "_case_id": "1961_44",
  "_label": 0,
  "_text_length": 10816,
  "_extracted_at": "2026-02-10T19:29:44.841835"
}