{
  "metadata": {
    "case_name": "Ahmedabad Miscellaneous Industrial Workers Union v. Ahmedabad Electricity Company Limited",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO, J."
    ],
    "case_number": "Civil Appeal No. 479 of 1960",
    "date_of_judgment": "1961-07-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dispute before Industrial Court Bombay in Ref. I.C. No. 159 of 1957 regarding bonus for the year ending September 1956.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant claimed three months wages as bonus from respondent Ahmedabad Electricity Company Limited.",
      "type": "disputed",
      "date": "1956-09-30",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Respondent contended no available surplus if calculation made per Full Bench Formula approved in Associated Cement Companies Ltd. v. Its Workmen.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Industrial Court accepted respondent's contention and rejected appellant's claim on three points: depreciation method, contingencies reserve deduction, income-tax deduction.",
      "type": "procedural",
      "date": "1959-08-13",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "No dispute that if depreciation calculated per Income-tax Act rules, no available surplus for bonus.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Various Industrial Tribunals since 1955 have allowed depreciation per income-tax rates for electricity companies, not Seventh Schedule to Electricity Supply Act.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether depreciation should be calculated according to the provisions of the Income-tax Act and rules framed thereunder or in accordance with the provisions contained in the Seventh Schedule to the Electricity Supply Act for purposes of Full Bench Formula.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether any deduction should be allowed as a prior charge towards contingencies reserve created under the Electricity Supply Act.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether any deduction should be allowed on account of income-tax.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Depreciation should be calculated in accordance with the Seventh Schedule to the Electricity Supply Act, not Income-tax Act rules.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Seventh Schedule to the Electricity Supply Act, No. LIV of 1918"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Depreciation should be calculated according to Income-tax Act rules per Full Bench Formula; no available surplus for bonus.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "Full Bench Formula as in Associated Cement Companies Ltd. v. Its Workmen; Income-tax Act rules"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Reviewed precedents: U.P. Electric Supply Co. Ltd. v. Their Workmen preferred income-tax depreciation for uniformity with Full Bench Formula; approved in Shree Meenakshi Mills Ltd. v. Their Workmen and Tinnevelly-Tutcorin Electric Supply Co. Ltd. v. Its Workmen.",
      "addresses_issue": "i1",
      "key_observation": "Question not open to appellant as previously approved; even if open, income-tax rules preferred for uniformity across industries."
    },
    {
      "id": "cr2",
      "text": "Electricity Supply Act provisions (s.57, Sixth/Seventh Schedules) for consumer charges, not industrial adjudication; Full Bench Formula applies uniformly.",
      "addresses_issue": "i1",
      "key_observation": "Injecting Seventh Schedule would destroy uniformity; electricity companies should not stand apart."
    },
    {
      "id": "cr3",
      "text": "Income-tax rates build depreciation fund quicker, beneficial for public utility companies; U.P. Electric case settled law since 1955, followed nationwide; no good reason to disturb amid bonus commission review.",
      "addresses_issue": "i1",
      "key_observation": "Maintain settled practice until high-powered commission revises formula."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Depreciation under Full Bench Formula calculated per Income-tax Act rules, not Seventh Schedule to Electricity Supply Act, even for electricity companies.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Associated Cement Companies Ltd. v. Its Workmen",
      "citation": "1959 S.C.R. 925",
      "treatment": "followed",
      "relevance": "Approved Full Bench Formula; worked satisfactorily across industries."
    },
    {
      "case_name": "U.P. Electric Supply Company Ltd. v. Their Workmen",
      "citation": "1955 2 L.L.J. 431",
      "treatment": "followed",
      "relevance": "Preferred income-tax depreciation over Seventh Schedule for electricity companies under Full Bench Formula."
    },
    {
      "case_name": "Shree Meenakshi Mills Ltd. v. Their Workmen",
      "citation": "1958 S.C.R. 878",
      "treatment": "followed",
      "relevance": "Approved U.P. Electric case on income-tax depreciation."
    },
    {
      "case_name": "Tinnevelly-Tutcorin Electric Supply Co. Ltd. v. Its Workmen",
      "citation": "1960 3 S.C.R. 68",
      "treatment": "followed",
      "relevance": "Approved application of income-tax rules to electricity companies; distinguished Electricity Supply Act purpose."
    },
    {
      "case_name": "Mill-Owners Association v. Rashtriya Mill Mazdoor Sangh Bombay",
      "citation": "1930 2 L.L.J. 1247",
      "treatment": "referred",
      "relevance": "Full Bench Formula evolved in 1950 allowing income-tax depreciation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "rules framed thereunder"
      ],
      "relevance": "Depreciation calculated per these rules for Full Bench Formula."
    },
    {
      "name": "Electricity Supply Act, No. LIV of 1918",
      "sections": [
        "s. 57",
        "Sixth Schedule",
        "Seventh Schedule"
      ],
      "relevance": "Provisions for consumer charges, not applicable to industrial adjudication or Full Bench Formula."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; upheld Industrial Court's rejection of bonus claim as no available surplus per Full Bench Formula using income-tax depreciation; other issues not decided.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is not open to the appellant to raise the question that the provisions of the Seventh Schedule to the Electricity Supply Act should be applied for purposes of calculating depreciation in preference to the income-tax rates in working out the Full Bench formula.",
      "speaker": "court",
      "significance": "Closes the main issue based on precedents."
    },
    {
      "text": "The claim for bonus should be decided by tribunals on the basis of this formula without attempting to revise it.",
      "speaker": "court",
      "significance": "Emphasizes uniformity of Full Bench Formula."
    }
  ],
  "_case_id": "1961_59",
  "_label": 0,
  "_text_length": 11486,
  "_extracted_at": "2026-02-10T19:30:32.284922"
}