{
  "metadata": {
    "case_name": "Sri Vedaraneeswararswamy Devasthanam v. Dominion of India and Province of Madras",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No.371 of 1956",
    "date_of_judgment": "1961-02-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Suit properties admeasure about 2,400 acres situated in the village of Agastiyampalli and granted in inam absolutely to the appellant by the Tanjore Rajas several centuries ago.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "From the time of the grant, the appellant was in exclusive possession and enjoyment of the properties, trustees and managers looked after them and collected profits.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "In 1806, agreement between East India Company and appellant under which Company took possession of properties and promised to pay 1848 Pagodas annually, out of which 1200 Pagodas represented rent.",
      "type": "material",
      "date": "1806",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Company paid agreed rent until 1858, then respondent 2 (Province of Madras) succeeded and paid until 1937, thereafter respondent 1 (Dominion of India) took over salt revenue administration and continued payments.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Properties taken over under Regulation 1 of 1805; compensation of Rs. 4,200/- (1848 Pagodas) fixed once for all based on average income from salt manufacture over previous ten years.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Appellant filed suit claiming declaration of ownership, possession from respondent 1, mesne profits or alternative determination of proper rent; true relationship is lessor-lessee under annual lease.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Respondent 1 denied annual lease, claimed permanent possession with annual compensation.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Trial court (Subordinate Judge of Mayuram) held arrangement permanent, dismissed suit.",
      "type": "procedural",
      "date": "1953-08-28",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Madras High Court in A.S. No. 262 of 1949 agreed with trial court, held permanent lease and claim barred by limitation under Art. 134B of Limitation Act, dismissed appeal.",
      "type": "procedural",
      "date": "1953-08-28",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Ex. A.1: Copy of order by Mr. Wallace dated December 31, 1806, stating Government took charge of pagoda salt pans and Sea Customs of Thopputhurai, to pay 1848 Pagodas annually from treasury based on 10 years average.",
      "type": "material",
      "date": "1806-12-31",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Prior correspondence: July 17, 1806 letter proposed permanent acquisition, calculations for compensation based on port duties (net 486 Pagodas) and salt (1362 Star Pagodas), total 1848; preferred commutation in land for permanence.",
      "type": "material",
      "date": "1806-07-17",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Government letter October 28, 1806 approved annual payment not exceeding 1848 Pagodas; Board accepted November 17, 1806.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Ex. A.18: Extract from inam register November 27, 1862, does not mention Company's rights in owner columns.",
      "type": "material",
      "date": "1862-11-27",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Ex. A.2: Title deed by Inam Commissioner recognizes temple's title to village including porambokes for pagoda support.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "From 1806 to 1941, appellant allowed Company/successors quiet enjoyment on annual payments.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "1941: Factory officer inquired about original attachment and compensation; appellant replied April 8, 1941 claiming lease at Rs. 350 monthly/Rs. 4,200 annually.",
      "type": "material",
      "date": "1941-04-08",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Regulation 1 of 1805 made salt manufacture/sale subject to Government control, prohibiting private manufacture.",
      "type": "background",
      "date": "1805",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Properties marshy, only profitable for salt manufacture, which became impossible post-Regulation.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "True nature of relationship between parties regarding suit properties: annual lease or permanent arrangement/lease?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Principal document Ex. A.1 should be construed as annual lease, not permanent; High Court erred in construction and ignored principles governing powers of manager of Hindu religious institution.",
      "supporting_facts": [
        "f10",
        "f13",
        "f14"
      ],
      "legal_basis": "Powers of temple manager: cannot grant permanent lease without compelling necessity (cited Maharanee Shibessouree Debia v. Mothooranath Acharjo; Nainapillai Marakayar v. Ramanathan Chettiar; Palaniappa Chetty v. Deivasikamony Pandara)"
    },
    {
      "id": "pa2",
      "text": "Inam register Ex. A.18 and title deed Ex. A.2 do not reflect permanent lessee rights, consistent with ownership.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Held properties under permanent arrangement per Regulation 1 of 1805; compensation fixed once for all based on average prior income; not annual lease.",
      "supporting_facts": [
        "f5",
        "f11",
        "f12"
      ],
      "legal_basis": "Regulation 1 of 1805"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Ex. A.1 and prior correspondence show permanent takeover for salt manufacture, compensation calculated on permanent basis payable annually; no duration specified but intent permanent.",
      "addresses_issue": "i1",
      "key_observation": "Elaborate calculations for permanent deprivation; preference for permanent commutation."
    },
    {
      "id": "cr2",
      "text": "Ex. A.18 and Ex. A.2 do not militate against permanent lease as they concern owner particulars, not lessee rights.",
      "addresses_issue": "i1",
      "key_observation": "Entries cannot change rights under executed document."
    },
    {
      "id": "cr3",
      "text": "Over century of quiet enjoyment, uniform payments despite changes, shifting pleas by appellant support permanent nature.",
      "addresses_issue": "i1",
      "key_observation": "Subsequent conduct inconsistent with annual lease."
    },
    {
      "id": "cr4",
      "text": "Manager's powers: long lapse (over century) presumes necessity (Bawa Magniram); Regulation 1 of 1805 rendered property useless for salt, compelling permanent arrangement for recurring income.",
      "addresses_issue": "i1",
      "key_observation": "Manager had no option but to secure permanent income for temple upkeep."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Transaction evidenced by Ex. A.1 is permanent lease; respondent 1 entitled to retain possession on payment of fixed annual compensation of Rs. 4,200/-; appellant not entitled to possession or enhanced rent.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Maharanee Shibessouree Debia v. Mothooranath Acharjo",
      "citation": "1869 13 Moo. I.A. 270, 273, 275",
      "treatment": "referred",
      "relevance": "Powers of manager of religious endowment"
    },
    {
      "case_name": "Nainapillai Marakayar v. Ramanathan Chettiar",
      "citation": "1923 L.R. 51 I.A. 83, 97, 98",
      "treatment": "referred",
      "relevance": "Powers of manager of religious institution to grant permanent lease only with necessity"
    },
    {
      "case_name": "Palaniappa Chetty v. Deivasikamony Pandara",
      "citation": "1917 L.R. 44 I.A. 147,155, 156",
      "treatment": "referred",
      "relevance": "Limitations on manager's authority for permanent alienation"
    },
    {
      "case_name": "Bawa Magniram Sitaram v. Kasturbai Manibhai",
      "citation": "1921 L.R. 49 I.A. 54",
      "treatment": "followed",
      "relevance": "Long lapse after grant presumes necessity for validity of permanent lease by shebait/manager"
    }
  ],
  "statutes_cited": [
    {
      "name": "Regulation 1 of 1805",
      "sections": [
        "All relevant provisions"
      ],
      "relevance": "Made salt manufacture/sale subject to Government monopoly/control, prohibiting private production; basis for permanent takeover"
    },
    {
      "name": "Limitation Act",
      "sections": [
        "Art. 134B"
      ],
      "relevance": "Barred appellant's claim (as held by High Court)"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, confirming the Madras High Court and trial court's decree rejecting appellant's claim for possession or enhanced rent, holding the 1806 arrangement a permanent lease with fixed annual compensation.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"As the Government have taken charge of the pagoda salt pans and Sea Customs of Thopputhurai, belonging to the above temple, the sum of 1848 Pagodas shall be given to the temple annually in cash from the treasury being calculated on the average amount of 10 years revenue...\"",
      "speaker": "court",
      "significance": "Text of Ex. A.1, central document interpreted as permanent arrangement"
    },
    {
      "text": "\"the transaction evidenced by Ex. A. 1 is a permanent lease and that respondent 1 is entitled to retain possession of the whole of the property on the terms and conditions specified in the said document.\"",
      "speaker": "court",
      "significance": "Core holding on nature of arrangement"
    }
  ],
  "_case_id": "1961_184",
  "_label": 0,
  "_text_length": 19731,
  "_extracted_at": "2026-02-10T19:32:01.061156"
}