{
  "metadata": {
    "case_name": "Mohammad Serajuddin v. Collector of Customs",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Criminal Appeal No. 158 of 1960",
    "date_of_judgment": "1961-11-24"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Mohammad Serajuddin is the managing partner of Messrs. Serajuddin and Co., of No. 19A, British Indian Street and P-16, Bentinck Street, Calcutta. The firm carries on business as exporters of mineral ores, including manganese ore, and possesses some mines.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Till April 1948, there was no export duty on manganese ore. On April 19, 1948, export duty at ad valorem rates was imposed on manganese ore. This was withdrawn in August 1954, re-imposed in September 1956, and withdrawn again in November 1958.",
      "type": "background",
      "date": "1948-04-19",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "During this period, the appellant exported manganese ore, among other mineral ores.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On November 28, 1959, an application was made under s.172 of the Sea Customs Act to the Chief Presidency Magistrate, Calcutta, requesting warrants to search the two premises on allegation that documents relating to illegal exportation of dutiable goods in contravention of the Sea Customs Act were secreted there.",
      "type": "procedural",
      "date": "1959-11-28",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Chief Presidency Magistrate issued two warrants returnable on December 5, 1959. Time for return extended to December 15, 1959.",
      "type": "procedural",
      "date": "1959-12-05",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Search carried out; Customs authorities seized 959 documents, registers, books, etc.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "On December 12, 1959, Chief Presidency Magistrate limited search to documents relating to manganese ore and fixed time of day for search.",
      "type": "procedural",
      "date": "1959-12-12",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Applications by appellant for withdrawal of search warrants unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "On December 15, 1959, Customs authorities applied for permission to retain documents for scrutiny; appellant applied for return of unconnected documents and court custody of rest.",
      "type": "procedural",
      "date": "1959-12-15",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Chief Presidency Magistrate ordered documents kept in court custody; Customs given facilities to inspect in court premises. Inspection commenced December 17, 1959.",
      "type": "procedural",
      "date": "1959-12-15",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Magistrate declined appellant's requests for return of unconnected documents and Customs' requests for custody/extension; extended inspection time till April 9, 1960.",
      "type": "procedural",
      "date": "1960-04-09",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "On February 6, 1960, Customs filed application for custody and facilities for inspection in secrecy.",
      "type": "procedural",
      "date": "1960-02-06",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "February 6, 1960 application by Customs summarily dismissed by Magistrate.",
      "type": "procedural",
      "date": "1960-02-06",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Customs in application stated documents many, need scrutiny with voluminous records from Customs/Shipping Departments, question witnesses/informers; impossible to complete in reasonable time during court hours in presence of appellant's representatives; alternatively sought separate room, after-hours inspection.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Magistrate offered limited room space; claimed documents belonged to him, inspection only as per his orders.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Customs filed revision in Calcutta High Court against Magistrate's order; Magistrate showed cause.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f17",
      "text": "High Court on July 1, 1960, held Magistrate placed difficulties, Customs entitled to custody; ordered handover of all documents bar 63 to Customs, complete scrutiny in 3 months.",
      "type": "procedural",
      "date": "1960-07-01",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Appeal to Supreme Court by certificate under Art. 134(1)(c) granted by High Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Customs authorities are entitled to the custody of records seized by them under a search warrant issued under s.172 of the Sea Customs Act, and the Magistrate cannot deny them the right to carry away the documents for their scrutiny.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the order of the Chief Presidency Magistrate gave inadequate facilities to the Customs authorities for inspection and scrutiny of the documents.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Documents seized under warrant must be produced before Magistrate; ultimate disposal under Magistrate's order; Magistrate has power to control inspection and ensure prompt return of unneeded documents.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": "Sea Customs Act s.172; CrPC ss.96, 98"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Customs authorities entitled to retain seized documents for statutory duties; no difference between contraband goods and related documents; once warrant issued, Magistrate's connection ends; no need to produce before Magistrate.",
      "supporting_facts": [
        "f4",
        "f6",
        "f9",
        "f12",
        "f14"
      ],
      "legal_basis": "Sea Customs Act s.172"
    },
    {
      "id": "ra2",
      "text": "Need custody or facilities for proper scrutiny: separate room, privacy, after-hours, due to volume and need to compare records, question witnesses/informers.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.172 Sea Customs Act requires Magistrate to issue warrant on Customs officer's belief (may check mala fides); warrant executed per CrPC, effect same including production before Magistrate; Magistrate retains control to prevent abuse.",
      "addresses_issue": "i1",
      "key_observation": "View of Sen, J. correct: after seizure, goods/documents produced before court issuing warrant; Magistrate decides disposal."
    },
    {
      "id": "cr2",
      "text": "Magistrate legally right to retain custody; difficulties in scrutiny matter of expediency, removable by judicious action.",
      "addresses_issue": "i1",
      "key_observation": "Custody with Magistrate, not Customs."
    },
    {
      "id": "cr3",
      "text": "Magistrate unduly narrow in facilities; must not frustrate Customs duties; direct separate room, after-hours, privacy, court official presence; 4 months sufficient.",
      "addresses_issue": "i2",
      "key_observation": "Balance custody with adequate facilities."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Customs not entitled to automatic custody of documents seized under s.172 warrant; must be produced before Magistrate, who decides custody/inspection under his control.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Magistrate must provide adequate facilities for Customs inspection: separate room, extended hours, privacy.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Calcutta Motor Cycle Co. v. Collector of Customs",
      "citation": null,
      "treatment": "referred",
      "relevance": "Debabrata Mookerjee, J.: Magistrate issues warrant on officer's belief, no independent opinion; not all CrPC features apply."
    },
    {
      "case_name": "Calcutta Motor Cycle Co. v. Collector of Customs",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Sinha, J.: General warrant valid, implies seizure power; obiter no need to produce before Magistrate."
    },
    {
      "case_name": "Collector of Customs v. Calcutta Motor Cycle Co.",
      "citation": null,
      "treatment": "referred",
      "relevance": "Division Bench upheld Sinha, J."
    },
    {
      "case_name": "S. K. Srivastava v. Gananand",
      "citation": null,
      "treatment": "followed",
      "relevance": "Sen, J.: Disposal under Magistrate's order; production before court implied; control over inspection time."
    },
    {
      "case_name": "Clarke v. Brojendra Kishore Roy Choudhury",
      "citation": null,
      "treatment": "referred",
      "relevance": "Privy Council: No pendency precondition for warrant."
    }
  ],
  "statutes_cited": [
    {
      "name": "Sea Customs Act",
      "sections": [
        "172"
      ],
      "relevance": "Authorizes Magistrate to issue search warrant on Customs Collector's application; executed per CrPC; custody/inspection control with Magistrate."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "96",
        "98",
        "555"
      ],
      "relevance": "Search warrants executed same way, same effect; forms require production before court; s.555 allows form adaptation."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "134(1)(c)"
      ],
      "relevance": "Certificate for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court set aside High Court's order handing over documents to Customs authorities (except 63); upheld Magistrate's custody but directed provision of facilities like separate room, extended hours, privacy for inspection, to be completed in 4 months.",
    "relief_granted": "Documents remain in Magistrate's custody with directions for facilities to Customs.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The words ultimate responsibility and overall control used in the judgment under appeal would mean nothing, if they did not imply the power of the Magistrate, to which we have referred.\"",
      "speaker": "court",
      "significance": "Emphasizes Magistrate's control over seized documents."
    },
    {
      "text": "\"After seizure by the police in execution of the search warrant, the goods and documents must normally be produced before the court issuing the search warrant.\"",
      "speaker": "court",
      "significance": "Core holding on production requirement, quoting Sen, J."
    },
    {
      "text": "\"Magistrates, even though they may desire expedition, must not frustrate other departments of Government in discharging their legitimate duties under the Act.\"",
      "speaker": "court",
      "significance": "Balances Magistrate's control with Customs' needs."
    }
  ],
  "_case_id": "1961_85",
  "_label": 1,
  "_text_length": 20011,
  "_extracted_at": "2026-02-10T19:30:40.782537"
}