{
  "metadata": {
    "case_name": "Raje Anandrao (Appellant) v. Pujaris (Respondents)",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO, J."
    ],
    "case_number": "Civil Appeal No. 370 of 1956",
    "date_of_judgment": "1961-02-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "There is an ancient temple of Balaji at Deolgaon Raja in the Buldana District. Before 1866 the management of the temple was in the hands of a family bearing the name of Lad.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "A suit was filed in 1866 with respect to this temple by Raje Mansingh Rao under the guardianship of his mother for a declaration that the temple was his property. The defendants in that suit were certain pujaris. The suit was decreed by the first court but on appeal it was held that the temple was not the private property of the Raja but was an endowment for the public founded by the ancestors of the Raja and that the Raja was entitled as against the pujaris to the possession and control of the institution. A receiver was appointed during the minority of the Raja but in due course the Raja took over the direct management of the temple.",
      "type": "material",
      "date": "1866",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1872 there was some dispute between the Raja and the pujaris whose offices were also hereditary and an agreement was arrived at between them. By this agreement it was provided that any offerings up to Rs. 5/- would go to the pujaris who were to defray the expenses of dhoop, deep and neivedya from this amount keeping the balance to themselves. There were also certain provisions in the agreement as to offerings in kind. The agreement also provided for other matters relating to worship and imposed certain duties on the pujaris. Finally, it provided that the parties should carry on all the duties stated in the agreement and other duties besides them as before according to the usual wahiwat and that earnings would be taken as stated in the agreement and proper arrangement of expenses would be kept and the pujaris would take all possible care not to take more than what was fixed in the agreement.",
      "type": "material",
      "date": "1872",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "This agreement seems to have held the field thereafter till we come to 1904.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "There was dissatisfaction with the management of this temple by Raje Anandrao and in consequence a suit was filed after obtaining permission of the Advocate-General in February, 1904, for framing a scheme for the management of the temple. This suit was finally decided on April 29, 1916, by the Additional Judicial Commissioners. They set aside the order of the trial court for the removal of Raje Anandrao from the management by declaring that the right to manage the affairs of the shrine which was an office was hereditary in the family of the Raja but they further held that a scheme should be framed providing for the management of the trust pending any dispute as to who is the present holder of the office of trustee and manager for the management of the trust during the minority of the appellant if he should be established to be the present Raja for the continuance of control by the Court after the present hereditary incumbent enters upon the office of manager sui juris and for the modification of the scheme from time to time as circumstances may demand.",
      "type": "procedural",
      "date": "1904-02 to 1916-04-29",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In consequence the matter went back to the District Judge who framed a scheme on February 16,1918, for the management of the temple. This scheme was later substituted by another scheme dated November 25, 1926. Finally, on October 16, 1935, another scheme was framed in substitution of that framed in 1926.",
      "type": "procedural",
      "date": "1918-02-16, 1926-11-25, 1935-10-16",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The pujaris as such were not parties to this suit in which the scheme was framed, though they would be as much bound by it as members of the worshipping public as the parties to it.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "About that time there was another suit pending in the court of the Additional Subordinate Judge, 111 Class, Buldana, between the appellant and the pujaris. That suit was decided on April 30, 1936, and it was held therein that the agreement of 1872 which was binding on the appellant recognised that the office of pujari was hereditary. It was also held that the trustee namely, the Raja was entitled to control the pujaris in the exercise of their rights and to see that they performed their duties properly. In other words it was held that the pujaris were entitled to retain their office during good behaviour. It was also held that the hereditary nature of their right had not invested them with any immunity from all control and they were not entitled to act with impunity and yet retain their office. It was further held that they could not establish a right to enjoy the fruits of their office though absolutely incompetent to do so. Further it was held that the power of dismissal in the event of misbehaviour undoubtedly belonged to the Raja but that it should not be lightly exercised and should be subject to the control of the District Judge. Finally it was made clear that the Raja had no right to dispose of any part of the income of the pujaris nor had he any right to interfere in matters of succession amongst them. The office of pujari was thus held to be hereditary unless there was misconduct or misbehaviour which caused forfeiture. A declaratory decree was therefore passed to the effect that the pujaris who were defendants in that suit were holding hereditary office of the pujaris of Shree Balasaheb Sansthan and that they were in the discharge of their duties subject to the control of the plaintiff namely, the Raja and they were bound to respect his authority and rightful orders and that they held their office subject to good behaviour.",
      "type": "material",
      "date": "1936-04-30",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "In 1953 there was some trouble in the temple and consequently the District Judge visited the place on November 30, 1953. At that time it was agreed that a Commissioner with wide terms of reference be appointed to investigate the working of the temple vis-a-vis the pujaris, the trustee and the general public and he should report how far the present scheme was working, what were the defects and shortcomings and what new proposals or alterations in the scheme and in the agreement of 1872 were necessary in the light of the working till then and the changed circumstances. Many of the pujaris-respondents who were present on that date were agreeable to this course.",
      "type": "procedural",
      "date": "1953-11-30",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Eventually, the Commissioner reported to the District Judge and objections were called to that report. The matter was then gone into and the District Judge passed an order on April 12, 1954, by which he revised the scheme which had been in force since 1935.",
      "type": "procedural",
      "date": "1954-04-12",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Thereupon the pujaris went in revision to the High Court (Nagpur High Court) and their contention was that the District Judge had acted beyond his jurisdiction in revising the scheme in so far as it affected them. The High Court held that if the matters sought to be introduced by modification of the scheme are covered by s. 92 of the Code of Civil Procedure, an application for modification is not the appropriate remedy. It further held that unless the power reserved to the court under the scheme is invoked for a purpose analogous to execution of the decree, no modification of the scheme was possible under s. It therefore held that unless the rights of any persons were the subject of lis, the scheme could not be modified so as to affect them except by a suit under s. 92. Finally, it came to the conclusion that as the pujaris were not parties to the suit of 1904 or to the scheme that was framed, it was not possible to modify the scheme so as to affect their rights without recourse to s. 92. The revision was therefore allowed and the scheme framed by the learned District Judge was ordered to be read subject to the order of the High Court.",
      "type": "procedural",
      "date": "1955-11-25",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Thereafter an application was made by the appellant to appeal to this Court, which was later converted into an application for review of the earlier order. This application was rejected. Then the appellant applied to this Court for special leave and obtained the same.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "How far it is open to a court to amend a scheme once framed under s. 92 of the Code of Civil Procedure, where a power to amend the scheme is reserved in the scheme itself.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the modification in this case is for the purposes of administration alone for then it will be justified and within jurisdiction or whether by this modification the private rights of the pujaris are in any way affected.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court has held that as the pujaris were not parties to the suit under s. 92, the scheme could not be amended so as to affect their rights, for even where a power is reserved in the scheme to modify it, it could only be invoked for a purpose analogous to execution of a decree. It is the correctness of this view which has been challenged before us.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Chandraprasad Ramprasad v. Jinabharathi Narayana bharathi (1931 I.L.R. 55 Bom. 414); Sri Swami Rangacharya v. Gangaram (1936 I.L.R. 58 All. 538); Umeshananda Dutta Jha v. Sir Ravaneswar Prasad Singh (A.I.R. 1924 Cal. 330); Manadananda Jha v. Tarakananda Jha Panda (A.I.R. 1941 Cal. 618); Srijib Nyayatirtha v. Sreemant Dandy Swami Jagannath Ashram (A.I.R. 1923 Pat. 420); Mahomed Waheb Hussain v. Syed Abbas Husain (A.I.R. 1923 Pat. 420); Gangaram Govind Pashankar v. Sardar R. Vinchurkar (I.L.R. 1947 Bom. 466); Privy Council cases: Prayaga Doss Jee Varu v. Tirumala Anandam Pillai Purisa Sriranga Charylu Varu (1907 L.R. 3 T.A. 78); Sevak Kirpashanker Daji v. Copal Rao Manohar Pambekar (1913 24 M.L.J 199)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The District Judge had acted beyond his jurisdiction in revising the scheme in so far as it affected them. If the matters sought to be introduced by modification of the scheme are covered by s. 92 CPC, an application for modification is not the appropriate remedy. Unless the power reserved to the court under the scheme is invoked for a purpose analogous to execution of the decree, no modification of the scheme was possible. Unless the rights of any persons were the subject of lis, the scheme could not be modified so as to affect them except by a suit under s. 92. As the pujaris were not parties to the suit of 1904 or to the scheme that was framed, it was not possible to modify the scheme so as to affect their rights without recourse to s. 92.",
      "supporting_facts": [
        "f6",
        "f7",
        "f11"
      ],
      "legal_basis": "Veeraraghavachariar v. The Advocate-General of Madras (1928 I.L.R. 51 Mad. 31); Section 92 CPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is not seriously disputed in this case that the power to amend the scheme has been reserved in view of the judgment of the Additional Judicial Commissioners and paragraph 17 of the scheme dated October 16, 1935. The view taken by the Madras High Court that insertion of such a clause for the modification of the scheme is ultra vires is incorrect. We therefore accept the view of the Bombay, Calcutta, Allahabad and Patna High Courts and hold that it is open in a suit under s. 92 where a scheme is to be settled to provide in the scheme for modifying it as and when necessity arises, by inserting a clause to that effect. Such a suit for the settlement of a scheme is analogous to an administration suit and so long as the modification in the scheme is for the purposes of administration, such modification can be made by application under the relevant clause of the scheme, without the necessity of a suit under s. 92 CPC.",
      "addresses_issue": "i1",
      "key_observation": "Section 92 permits settling a scheme and the power is comprehensive enough to permit inclusion of a provision for future modification by application."
    },
    {
      "id": "cr2",
      "text": "The pujaris were not parties to the suit under s. 92 but the decision in that suit binds the pujaris as worshippers so far as the administration of the temple is concerned, even though they were not parties to it, for a suit under s. 92 is a representative suit and binds not only the parties thereto but all those who are interested in the trust. Therefore, the mere fact that the pujaris were not parties to the suit will not take away the jurisdiction of the District Judge to modify the scheme, if the modification is with respect to the administration of the trust and if it does not affect the private rights of the pujaris.",
      "addresses_issue": "i2",
      "key_observation": "Modifications upheld for paras 3 and 12 with clarifications and additions to safeguard pujaris' rights."
    },
    {
      "id": "cr3",
      "text": "Detailed analysis of modifications in paragraphs 3 and 12 of the scheme, upholding them as administrative with clarifications: para 3 addition requires knowledge of mantrik ritual, substitute by pujari not trustee; para 12 cl. a for other dependants; cl. b for control including punish but add appeal to District Judge; cl. c for offerings accounting with safeguards like double lock, handover to pujaris rep.",
      "addresses_issue": "i2",
      "key_observation": "Modifications do not trespass on private rights if read with safeguards."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "It is open to a court in a suit under s. 92 CPC where a scheme is to be settled to provide in the scheme for modifying it as and when necessity arises, by inserting a clause to that effect. Such modification can be made by application under the relevant clause of the scheme, without the necessity of a suit under s. 92 CPC, so long as it is for purposes of administration.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "The revised scheme by District Judge is valid as modifications in paras 3 and 12 concern administration and do not affect private rights of pujaris, subject to specified modifications and clarifications.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Veeraraghavachariar v. The Advocate-General of Madras",
      "citation": "1928 I.L.R. 51 Mad. 31",
      "treatment": "distinguished",
      "relevance": "Leading case for High Court view that reservation for modification is ultra vires s.92 CPC; court holds incorrect."
    },
    {
      "case_name": "Chandraprasad Ramprasad v. Jinabharathi Narayana bharathi",
      "citation": "1931 I.L.R. 55 Bom. 414",
      "treatment": "followed",
      "relevance": "Scheme authorised court to alter; held competent without fresh s.92 suit; rule not ultra vires."
    },
    {
      "case_name": "Sri Swami Rangacharya v. Gangaram",
      "citation": "1936 I.L.R. 58 All. 538",
      "treatment": "followed",
      "relevance": "Followed Bombay view on power to modify by application if reserved."
    },
    {
      "case_name": "Umeshananda Dutta Jha v. Sir Ravaneswar Prasad Singh",
      "citation": "A.I.R. 1924 Cal. 330",
      "treatment": "followed",
      "relevance": "Provision in scheme for modification allows modification by application."
    },
    {
      "case_name": "Manadananda Jha v. Tarakananda Jha Panda",
      "citation": "A.I.R. 1941 Cal. 618",
      "treatment": "followed",
      "relevance": "Same as above."
    },
    {
      "case_name": "Srijib Nyayatirtha v. Sreemant Dandy Swami Jagannath Ashram",
      "citation": "A.I.R. 1923 Pat. 420",
      "treatment": "followed",
      "relevance": "Calcutta HC accepted view."
    },
    {
      "case_name": "Mahomed Waheb Hussain v. Syed Abbas Husain",
      "citation": "A.I.R. 1923 Pat. 420",
      "treatment": "followed",
      "relevance": "Patna HC held same view."
    },
    {
      "case_name": "Gangaram Govind Pashankar v. Sardar R. Vinchurkar",
      "citation": "I.L.R. 1947 Bom. 466",
      "treatment": "referred",
      "relevance": "Court has inherent power under s.151 CPC to alter scheme even without clause."
    },
    {
      "case_name": "Prayaga Doss Jee Varu v. Tirumala Anandam Pillai Purisa Sriranga Charylu Varu",
      "citation": "1907 L.R. 3 T.A. 78",
      "treatment": "referred",
      "relevance": "Privy Council inserted clause for modification by application."
    },
    {
      "case_name": "Sevak Kirpashanker Daji v. Copal Rao Manohar Pambekar",
      "citation": "1913 24 M.L.J 199",
      "treatment": "referred",
      "relevance": "Privy Council scheme contained clause for alteration by application."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Section 92",
        "Section 151"
      ],
      "relevance": "Governs suits for public trusts; permits framing scheme with modification clause; modifications for administration via application, not new suit."
    },
    {
      "name": "Madhya Pradesh Public Trusts Act, No. XXX of 1951",
      "sections": [
        "Section 15",
        "Section 16",
        "Section 18"
      ],
      "relevance": "Requires trustee to maintain accounts, prepare budget, audit; justifies accounting for offerings up to Rs.5/-."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order set aside; District Judge's revised scheme restored subject to modifications in para 3 (clarify substitute by pujari) and para 12 (add appeal for punishment; amend cl.c with double lock, handover procedures for offerings box). District Judge to embody modifications.",
    "relief_granted": "Scheme modifications upheld with safeguards for pujaris.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We therefore accept the view of the Bombay, Calcutta, Allahabad and Patna High Courts in this matter and hold that it is open in a suit under s. 92 where a scheme is to be settled to provide in the scheme for modifying it as and when necessity arises, by inserting a clause to that effect.",
      "speaker": "court",
      "significance": "Core holding on power to modify schemes under s.92 CPC."
    },
    {
      "text": "A suit under s.92 certainly comes to an end when a decree is passed therein, including the settlement of a scheme for the administration of the trust. But there is nothing in the fact that the court can settle a scheme under s.92(1) to prevent it from making the scheme elastic and provide for its modification in the scheme itself.",
      "speaker": "court",
      "significance": "Explains why modification clause does not violate finality of decree."
    },
    {
      "text": "The pujaris in the discharge of their duties were subject to the control of the plaintiff namely, the Raja and they were bound to respect his authority and rightful orders and that they held their office subject to good behaviour.",
      "speaker": "lower_court",
      "significance": "1936 suit decree binding on parties, basis for control provisions."
    }
  ],
  "_case_id": "1961_106",
  "_label": 1,
  "_text_length": 35396,
  "_extracted_at": "2026-02-10T19:31:24.877463"
}