{
  "metadata": {
    "case_name": "Petition No. 305/1960 (Petitioner v. State)",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Petition No. 305/1960",
    "date_of_judgment": "1961-01-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On February 10, 1949, the Judge, Special Court, Red Fort, Delhi, convicted the petitioner for offences under s. 3 read with s. 6 of the Explosive Substances Act (sentenced to seven years rigorous imprisonment), under s. 4(b) and s. 5 thereof (five years rigorous imprisonment), and for murder under s. 302 read with s. 109 of the Indian Penal Code (transportation for life). All sentences directed to run concurrently.",
      "type": "material",
      "date": "1949-02-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "After conviction, petitioner imprisoned in jails in the State of Punjab till May 19, 1950, thereafter transferred to Nasik Road Central Prison in the State of Bombay (now Maharashtra).",
      "type": "procedural",
      "date": "1950-05-19",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Petitioner earned remissions up to September 30, 1960: Ordinary 836 days, Special 206 days, Physical training 113 days, Literary 108 days, Annual good conduct 250 days, State 1380 days (total 2,893 days claimed by petitioner; State counter-affidavit states 2,963 days).",
      "type": "admitted",
      "date": "1960-09-30",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Aggregate of remissions (2,963 days) added to term of imprisonment actually served exceeds 20 years; even State remission alone exceeds 15 years.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Petitioner's sentence of transportation for life not commuted under s. 55 IPC or s. 402(1) CrPC to rigorous imprisonment.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "State concedes remissions of 2,963 days but alleges they do not entitle release; release considered only after 15 years actual imprisonment.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, under relevant statutory provisions, an accused sentenced to transportation for life could legally be imprisoned in one of the jails in India and, if so, what was the term for which he could be so imprisoned.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether a sentence for life imprisonment, without formal remission by appropriate Government, can be automatically treated as one for a definite period.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether remissions earned entitle the petitioner to release under Bombay prison rules, or if release requires government order under s. 401 CrPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Petitioner has justly served his sentence including remissions (2,893/2,963 days), aggregate exceeds 20/15 years; further detention illegal under relevant provisions; entitled to immediate release.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Remission rules; claims under Bombay prison rules"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Remissions earned (2,963 days) do not entitle release; under rules, release considered only after completion of 15 years actual imprisonment; requires government order under s. 401 CrPC.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6"
      ],
      "legal_basis": "Bombay Prison Rules 934, 937(c), 1419(c), 1447(2); s. 401 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sentence of transportation for life can be undergone as rigorous imprisonment in Indian jails per history, IPC ss. 53,55,58, and Privy Council in Pandit Kishori Lal; post-1955, s.53A IPC explicitly equates to rigorous imprisonment for life.",
      "addresses_issue": "i1",
      "key_observation": "Transportation is in truth a sentence for life imprisonment in India."
    },
    {
      "id": "cr2",
      "text": "No provision in IPC, CrPC or Prisons Act treats life sentence as definite period automatically; s.57 IPC only for calculating fractions, not equivalence for all purposes; life means whole natural life unless commuted/remitted.",
      "addresses_issue": "i2",
      "key_observation": "Prima facie, transportation/imprisonment for life is for remaining natural life."
    },
    {
      "id": "cr3",
      "text": "Bombay Prison Rules (under Prisons Act) provide remissions but equate life to 15 years only for remission calculation ('ordinarily'); no indefeasible right to release; requires government order under s.401 CrPC after report; rules do not commute sentence.",
      "addresses_issue": "i3",
      "key_observation": "Remissions credited but release only via executive remission under s.401 CrPC."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Prisoner sentenced to transportation/life imprisonment bound to serve life term unless commuted/remitted by appropriate authority under IPC/CrPC; remissions earned but do not confer right to release without government order.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Life sentence not automatically definite period; remissions only for calculation under prison rules, not substitution.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Petitioner under legal detention; no right to release acquired.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pandit Kishori Lal v. King Emperor",
      "citation": "1944 L.R. 72 I.A. 1",
      "treatment": "followed",
      "relevance": "Transportation for life is sentence for life imprisonment in Indian jails, dealt as rigorous imprisonment."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Basis for habeas corpus petition for enforcement of fundamental rights."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 3 r/w s.6 Explosive Substances Act",
        "s.4(b), s.5 Explosive Substances Act",
        "s.302 r/w s.109",
        "s.53",
        "s.55",
        "s.58",
        "s.57",
        "s.53A (added by Act XXVI of 1955)"
      ],
      "relevance": "Conviction offences; punishments including transportation for life equated to rigorous imprisonment for life; no automatic definite term."
    },
    {
      "name": "Explosive Substances Act",
      "sections": [
        "s.3 r/w s.6",
        "s.4(b)",
        "s.5"
      ],
      "relevance": "Offences for which petitioner convicted and sentenced."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "s.401",
        "s.402(1)"
      ],
      "relevance": "Government power to remit/commute sentences prerequisite for release."
    },
    {
      "name": "Code of Criminal Procedure (Amendment) Act, 1955 (Act XXVI)",
      "relevance": "Added s.53A IPC; transportation treated as rigorous imprisonment."
    },
    {
      "name": "Prisons Act, 1894",
      "sections": [
        "s.59"
      ],
      "relevance": "Basis for prison rules on remissions; rules regulate treatment but do not commute sentences."
    },
    {
      "name": "Bombay Prison Rules",
      "sections": [
        "Rule 934",
        "Rule 937(c)",
        "Rule 1419(c)",
        "Rule 1447(2)"
      ],
      "relevance": "Remission system; life ordinarily 15 years actual for remission calculation only; requires s.401 CrPC order for release."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The petition under Art. 32 for habeas corpus is dismissed as petitioner is under legal detention; no right to release acquired despite remissions, as life sentence requires government remission under s.401 CrPC.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A sentence of transportation for life or imprisonment for life must prima facie be treated as transportation or imprisonment for the whole of the remaining period of the convicted persons natural life.\"",
      "speaker": "court",
      "significance": "Core holding on duration of life sentence."
    },
    {
      "text": "\"But at the present day transportation is in truth but a name given in India to a sentence for life...\"",
      "speaker": "court",
      "significance": "Citing Privy Council; clarifies transportation as life imprisonment in India."
    },
    {
      "text": "\"The rules framed under the Prisons Act enable such a prisoner to earn remissions... but it is only for that particular purpose and not for any other purpose.\"",
      "speaker": "court",
      "significance": "Limits effect of prison remission rules."
    }
  ],
  "_case_id": "1961_232",
  "_label": 0,
  "_text_length": 16022,
  "_extracted_at": "2026-02-10T19:32:41.706298"
}