{
  "metadata": {
    "case_name": "M/s. J. Burman & Co. v. Union of India",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent Union of India advertised in Indian Trade Journal for supply of 170-1/2 Cwt. of coconut oil.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "Appellant submitted tender No. SM-I/104524.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Tender accepted by respondent on August 31, 1949, concluding contract for supply of 170-1/2 Cwt. coconut oil conforming to specification No. IM.1370(d) at Rs. 89/6/- per Cwt., delivery ex-godown Calcutta by 39-9-49 or earlier.",
      "type": "material",
      "date": "1949-08-31",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Contract governed by general conditions of contract Form W.S.B. 133, including arbitration agreement.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Disputes arose regarding the contract and were referred to two arbitrators appointed by the parties in pursuance of arbitration agreement.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "After considerable arbitration proceedings, appellant objected to arbitrators' jurisdiction on ground that there was no concluded contract.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Respondent filed petition in Court of First Class Sub-Judge at Delhi against appellant under sections 33 and 28 of Arbitration Act, 1940, seeking declaration of concluded contract containing valid arbitration agreement and extension of time for arbitrators.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Appellant defended that no concluded contract existed and court had no jurisdiction under section 28 or 33.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Trial judge found concluded contract proved, valid arbitration agreement, court jurisdiction, declared valid reference, granted one month's extension to arbitrators.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellant filed revision petition in High Court of Punjab at Chandigarh, which confirmed trial court's findings and held petition competent under sections 28 and 33, dismissed revision.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant appealed to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Acceptance letter dated August 31, 1949 stated: 'Your offer is hereby accepted... subject to your depositing 10% as security... The contract is concluded by this acceptance and formal acceptance of Tender will follow immediately on receipt of Treasury Receipt.'",
      "type": "material",
      "date": "1949-08-31",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Tender subject to conditions in Form W.S.B. 133; Clause 4(a) makes security deposit a condition subsequent at option of Secretary; Clause 4(b) treats failure to deposit as breach of contract.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Arbitrators heard matter at length, proceedings reached stage for award when appellant raised no contract plea, refusing to apply under section 33, causing stalemate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Construction of sections 32 and 33 of Arbitration Act, 1940: Whether court has jurisdiction to entertain petition by party affirming existence/validity of arbitration agreement.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there was a concluded contract between the parties, given acceptance letter 'subject to your depositing 10% as security' and general conditions making it subsequent.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in holding trial court had jurisdiction to entertain respondent's petition under sections 33 or 32; only challengers to arbitration agreement can apply under section 33.",
      "supporting_facts": [
        "f7",
        "f9",
        "f10"
      ],
      "legal_basis": "Sections 32, 33 Arbitration Act, 1940"
    },
    {
      "id": "pa2",
      "text": "No concluded contract as acceptance letter made security deposit a condition precedent via 'subject to your depositing 10% as security', varying general conditions.",
      "supporting_facts": [
        "f3",
        "f12",
        "f13"
      ],
      "legal_basis": "Section 7 Contract Act; Clauses 4(a), 4(b) Form W.S.B. 133"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Concluded contract existed as per accepted tender under Form W.S.B. 133 containing valid arbitration agreement; petition competent under sections 28 and 33.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4",
        "f7"
      ],
      "legal_basis": "Sections 28, 33 Arbitration Act, 1940"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sections 32 and 33 bar suits on existence/validity of arbitration agreement; section 32 implies court's inherent jurisdiction to entertain applications affirming existence where suit barred, to avoid anomaly; section 33 not exhaustive.",
      "addresses_issue": "i1",
      "key_observation": "Object of sections is to prevent abuse by requiring petitions to specified courts; affirming party can apply under implied power from section 32."
    },
    {
      "id": "cr2",
      "text": "Petition in substance seeks declaration on arbitration agreement validity, as challenge to main contract common to both; substance over form; arbitration clause distinct yet enforceable.",
      "addresses_issue": "i1",
      "key_observation": "If no concluded contract, no arbitration agreement; prayer falls within section 32 bar."
    },
    {
      "id": "cr3",
      "text": "Acceptance letter read as whole is absolute: states 'offer accepted', calls for immediate deposit per clause 4(a), ends 'contract concluded by this acceptance'; security deposit condition subsequent, not precedent.",
      "addresses_issue": "i2",
      "key_observation": "No substantial variation from general conditions; tender for immediate supply."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Court has jurisdiction under implied power from section 32 to entertain petition affirming existence/validity of arbitration agreement; petition competent.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Concluded contract exists between parties containing valid arbitration agreement.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hayman v. Darwins, Ltd.",
      "citation": "1942 A.C. 356; 1942 1 All. E.R. 337",
      "treatment": "followed",
      "relevance": "Arbitration clause distinct from other contract clauses; can survive contract end."
    },
    {
      "case_name": "Messrs. M. Gulamali Abdulhussain & Co. v. Messrs. Vishwambharlal Ruiya",
      "citation": "I.L.R. 1950 Bom. 333",
      "treatment": "followed",
      "relevance": "Court has inherent jurisdiction to entertain petitions barred by section 32."
    },
    {
      "case_name": "Bajranglal Laduram v. Agarwal Brothers",
      "citation": "A.I.R. 1950 Cal. 267",
      "treatment": "distinguished",
      "relevance": "Contrasting view on jurisdiction."
    },
    {
      "case_name": "State of Bombay v. Adamjee Hajee Dawood & Co., Ltd.",
      "citation": "I.L.R. 1952 2 Cal. 49",
      "treatment": "distinguished",
      "relevance": "Suit not barred if not solely challenging arbitration agreement."
    }
  ],
  "statutes_cited": [
    {
      "name": "Arbitration Act, 1940",
      "sections": [
        "32",
        "33",
        "28",
        "31",
        "2(c)",
        "20",
        "24",
        "2(a)",
        "21"
      ],
      "relevance": "Bar on suits for existence/validity of arbitration agreements; applications to court; jurisdiction; extension of time."
    },
    {
      "name": "Indian Contract Act",
      "sections": [
        "7"
      ],
      "relevance": "Acceptance must be absolute and unqualified."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding High Court and trial court: trial court had jurisdiction to entertain the petition under sections 32 and 33 read together, and there was a concluded contract containing valid arbitration agreement; one month's extension to arbitrators stands.",
    "relief_granted": "Declaration of concluded contract and valid arbitration agreement; extension of time to arbitrators granted by trial court upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Notwithstanding any law for the time being in force, no suit shall lie on any ground whatsoever for a decision upon the existence, effect or validity of an arbitration agreement or award...\"",
      "speaker": "court",
      "significance": "Quotes section 32, central to jurisdiction issue."
    },
    {
      "text": "\"The contract is concluded by this acceptance and formal acceptance of Tender will follow immediately on receipt of Treasury Receipt.\"",
      "speaker": "respondent",
      "significance": "Key language in acceptance letter showing absolute acceptance."
    },
    {
      "text": "\"reading the letter as a whole we do not think that the Courts below have erred in coming to the conclusion that this letter amounts to an absolute and unqualified acceptance\"",
      "speaker": "court",
      "significance": "Court's holding on concluded contract."
    }
  ],
  "_case_id": "1961_154",
  "_label": 0,
  "_text_length": 29536,
  "_extracted_at": "2026-02-10T19:31:25.233290"
}