{
  "metadata": {
    "case_name": "Ram Shankar Singh, Bimala and Sudama Singh v. State",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Two bustees in Howrah - No. 7 Madhab Ghosh Road and No. 7 Tikiapara Road - separated by common courtyard. Ram Shankar, Bimala, Ramnarayan Missir and Depali lived in No. 7 Madhab Ghosh Road. Ramdeo Ahir, wife Rampiari, son Hiralal in 7 Tikiapara Road. Shyama Prosad Missir in another room there. Surajnath Dubey in No. 9 Madhab Ghosh Road.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "At about 11 A.M. on March 21, 1959, altercation in common courtyard between Ramnarayan Missir, Depali, Bimala and Ramdeo, Rampiari, Hiralal. Pacified by Jadunandan Roy and Joy Lal Choudhury.",
      "type": "material",
      "date": "1959-03-21",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "At about 7 P.M. on March 21, 1959, after Ram Shankar returned home, another altercation. Jadunandan and others intervened. Hiralal and Rampiari chained door from within.",
      "type": "material",
      "date": "1959-03-21",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "At about 9 P.M., 5 to 7 Hindusthanis armed with iron rods and knives joined Ram Shankar, Sudama Singh, Bimala, Ramnarayan Missir, Depali armed with knives, swords, iron-rods. Party proceeded to No. 7 Tikiapara Road.",
      "type": "material",
      "date": "1959-03-21",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Sudama Singh broke open door of Ramdeo Ahir's room. Ram Shankar and Bimala entered, stabbed Rampiari and Hiralal to death.",
      "type": "material",
      "date": "1959-03-21",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "On hearing shrieks, Shyama Prosad Missir proceeded to courtyard, stabbed by Sudama Singh in chest, collapsed.",
      "type": "material",
      "date": "1959-03-21",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Sudama Singh held by Jadunandan Roy, rescued by supporters who beat Jadunandan with iron rods. Ram Shankar and Bimala emerged with blood-stained knives.",
      "type": "material",
      "date": "1959-03-21",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Surajnath Dubey stabbed by Ram Shankar in abdomen, ran short distance, fell near dispensary, died March 23, 1959.",
      "type": "material",
      "date": "1959-03-21",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Ramnarayan Missir present in courtyard with sword, Depali with iron-rod. After assaults, party fled. Sword snatched by Jiban Prosad Sett.",
      "type": "material",
      "date": "1959-03-21",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Ramnarayan and Depali sheltered in Lakshman Mahato's house. Ram Shankar, Bimala, Sudama entered godown of Bhola Singh. Police arrested Sudama and Bimala there; Ram Shankar escaped.",
      "type": "material",
      "date": "1959-03-21",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "At 9.30 P.M. on March 21, 1959, Rampiari, Hiralal, Shyama Prosad Missir, Surajnath Dubey suffered incised/punctured injuries and died.",
      "type": "material",
      "date": "1959-03-21",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appellants and two others tried before Extra Additional Sessions Judge, Howrah with jury for offences u/ss. 148, 302, 302/149 IPC. Jury unanimous guilty: Ram Shankar Singh, Bimala, Sudama Singh u/ss. 148,302,302/149; Ramnarayan u/ss.148,326/149. Not guilty: Depali. Sessions Judge accepted, death for three, 10 yrs RI for Ramnarayan, acquit Depali. Subject to HC confirmation.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Reference for confirmation of death sentence and appeals heard by Calcutta High Court. HC held jury verdict vitiated by misdirection, re-examined evidence: Ram Shankar & Bimala guilty u/s 302/34 for Rampiari & Hiralal deaths; Ram Shankar for Surajnath; Sudama for Shyama Prosad. Confirmed death sentences. Acquitted Ramnarayan of grievous hurt.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Common courtyard lit by electric lamp from Joy Lal Choudhury's house; kerosene lantern in Ramdeo's room.",
      "type": "material",
      "date": "1959-03-21",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Eyewitnesses: Jadunandan Roy, Ram Chandra Goala, Tribeni Jadab, Sukdeo Majhi, Hosila Jadab, Sundar Jadab to assaults on Rampiari/Hiralal, Shyama Prosad, Surajnath.",
      "type": "material",
      "date": "1959-03-21",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Dhoti of Sudama had blood stains (human origin undetermined).",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f17",
      "text": "Sessions Judge's examination u/s 342 CrPC put complex questions combining multiple evidence points.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court was competent to appraise the evidence after discarding the jury verdict vitiated by misdirection and confirm death sentences in reference u/s 374 CrPC and appeal.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the examination of accused u/s 342 CrPC by Sessions Judge was irregular and vitiated the trial requiring retrial.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether prosecution evidence sufficiently proved guilt of appellants beyond reasonable doubt.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court not competent to re-appraise evidence after discarding vitiated jury verdict; must order retrial, especially in death confirmation reference u/s 374 CrPC.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": "Sections 418, 423, 374, 376 CrPC"
    },
    {
      "id": "pa2",
      "text": "Sessions Judge's s.342 examination irregular: complex questions combining distinct evidence prejudiced appellants.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "Section 342 CrPC"
    },
    {
      "id": "pa3",
      "text": "Prosecution evidence unreliable: free fight suggested, FIR delayed, improbability of Bimala retaining knife, no injuries on accused side, acquittal of Ramnarayan/Depali undermines eyewitnesses.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Evidence against Sudama weak: no blood on clothes/knife, resides in godown.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "High Court has power u/ss. 418, 423, 374 CrPC to appraise evidence independently in jury trials where verdict vitiated, not bound to order retrial.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Sections 418, 423, 374, 376 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court competent u/s 423 CrPC to appraise evidence after discarding vitiated jury verdict; wide powers in death confirmation u/s 374/376, not bound to retrial. Hears reference and appeal together.",
      "addresses_issue": "i1",
      "key_observation": "High Court may reverse/alter verdict if erroneous due to misdirection; discretion to re-appraise."
    },
    {
      "id": "cr2",
      "text": "S.342 examination irregular but curable; no prejudice shown as appellants denied everything, no alternative explanation suggested; not raised in HC.",
      "addresses_issue": "i2",
      "key_observation": "Errors in s.342 do not vitiate unless prejudice caused."
    },
    {
      "id": "cr3",
      "text": "Prosecution evidence reliable: eyewitnesses consistent on assaults, scene lit, FIR prompt with details, no free fight evidence, independent witnesses, blood marks, no injuries on accused.",
      "addresses_issue": "i3",
      "key_observation": "Mass of reliable eyewitness evidence proves participation."
    },
    {
      "id": "cr4",
      "text": "Sudama's guilt proved by multiple eyewitnesses, blood on dhoti, seen fleeing with knife.",
      "addresses_issue": "i3",
      "key_observation": "Independent disinterested testimony establishes role."
    },
    {
      "id": "cr5",
      "text": "Pre-meditated brutal murders of defenceless woman/child and interveners; death sentence appropriate.",
      "addresses_issue": "i3",
      "key_observation": "Circumstances warrant death penalty."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court competent to re-appraise evidence and confirm convictions/sentences after vitiated jury verdict.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "S.342 irregularity did not prejudice appellants or vitiate trial.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Appellants guilty: Ram Shankar & Bimala u/s 302/34 IPC for Rampiari/Hiralal; Ram Shankar u/s 302 for Surajnath; Sudama u/s 302 for Shyama Prosad.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Death sentences confirmed as appropriate.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Abdul Rahim v. Emperor",
      "citation": "1946 L.R. 73 I.A. 77",
      "treatment": "followed",
      "relevance": "HC may exclude inadmissible evidence and maintain conviction if remaining evidence sufficient; not bound to retrial on misdirection."
    },
    {
      "case_name": "Ajmer Singh v. State of Punjab",
      "citation": "1953 S.C.R. 418",
      "treatment": "followed",
      "relevance": "S.342 requires separate questions on material circumstances; errors curable unless prejudice."
    },
    {
      "case_name": "Bhupati Bhusan Biswas v. The State of West Bengal",
      "citation": "Cr. A. 113 of 1956, decided February 14, 1957",
      "treatment": "referred",
      "relevance": "HC erred in ordering retrial; should re-appraise evidence itself."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "148",
        "302",
        "302 read with 149",
        "326 read with 149",
        "34"
      ],
      "relevance": "Offences of rioting, murder, grievous hurt with common intention."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "418",
        "423",
        "374",
        "376",
        "342",
        "157"
      ],
      "relevance": "Powers of HC in appeals from jury trials, death confirmation references, accused examination, FIR dispatch."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upheld High Court's re-appraisal of evidence, convictions under s.302/34 IPC for murders, and confirmation of death sentences on Ram Shankar Singh, Bimala and Sudama Singh.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The High Court is not bound when it arrives at the opinion that the verdict of the jury is vitiated to interfere with the verdict. The Court is, therefore, competent in appeals against orders of a conviction and sentence or against orders of acquittal even in cases tried with jury to order a retrial or to maintain the conviction and sentence on a reconsideration of the evidence.",
      "speaker": "court",
      "significance": "Core holding on HC powers post-vitiated jury verdict."
    },
    {
      "text": "Errors of this type fall within the category of curable irregularities and the question whether the trial has been vitiated depends in each case upon the degree of error and upon whether prejudice has been or is likely to have been caused to the accused.",
      "speaker": "court",
      "significance": "On s.342 CrPC non-compliance."
    },
    {
      "text": "The assault upon the members of the family of Ramdeo Ahir was conceived and initiated with deliberation, and with the object of slaughtering a defenceless woman and her young son. Innocent persons who intervened were mercilessly stabbed and killed.",
      "speaker": "court",
      "significance": "Justification for death penalty."
    }
  ],
  "_case_id": "1961_222",
  "_label": 0,
  "_text_length": 42117,
  "_extracted_at": "2026-02-10T19:32:55.102520"
}