{
  "metadata": {
    "case_name": "Lalji Haridas v. Income-tax Officer, Ward A, Jamnagar & Chhotalal Haridas v. Fourth Income-tax Officer, Ward G, Bombay",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Lalji Haridas, resident of Jamnagar, filed return of income for assessment year 1952-53 under section 22 of the Indian Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "File of Lalji Haridas sent by Income-tax Officer, Ward B, Jamnagar, to Fourth Income-tax Officer, Ward G, Bombay.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Fourth Income-tax Officer, Ward G, Bombay, summoned Lalji Haridas under section 37 in connection with assessment for 1952-53.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Lalji objected to validity of transfer of file to Bombay and disputed jurisdiction of Bombay officer.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Central Board of Revenue passed order on September 30, 1953, under section 5(2) directing Commissioner of Income-tax, Central, Bombay, to perform functions in respect of persons including Lalji.",
      "type": "procedural",
      "date": "1953-09-30",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Commissioner of Income-tax, Central, Bombay, on October 7, 1953, under section 5(5), assigned Lalji's case to Income-tax Officer, Section IV, Central, Bombay.",
      "type": "procedural",
      "date": "1953-10-07",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Lalji filed Civil Suit No. 226 of 1954 claiming injunction against Income-tax Officer proceeding with assessment, alleging illegal transfer by Central Board.",
      "type": "procedural",
      "date": "1954",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Interim injunction in suit halted proceedings before Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Central Board cancelled its earlier order of transfer on May 21, 1956, retransferred case to Income-tax Officer, Ward A, Jamnagar Circle.",
      "type": "procedural",
      "date": "1956-05-21",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Income-tax Officer, Ward A, Jamnagar issued notice under section 23(2) on January 9, 1957, to Lalji to attend on January 17, 1957.",
      "type": "procedural",
      "date": "1957-01-09",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Proceedings stayed by civil court at Lalji's instance, interim injunction dissolved on March 1, 1957.",
      "type": "procedural",
      "date": "1957-03-01",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Income-tax Officer, Ward A, Jamnagar issued another notice on February 23, 1957, fixing March 4, 1957, as date of hearing.",
      "type": "procedural",
      "date": "1957-02-23",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Lalji asked for adjournment, refused; ex parte assessment order passed on March 4, 1957, holding Lalji liable for tax on total income of Rs. 93,01,117, tax Rs. 87,93,958-13-0.",
      "type": "procedural",
      "date": "1957-03-04",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Lalji's application to reopen assessment under section 27 dismissed by Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Appellate Assistant Commissioner allowed Lalji's appeals against ex parte order and refusal under section 27, remitted matter for fresh hearing.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Fresh notice issued by Income-tax Officer, Ward A, Jamnagar, challenged by Lalji in Special Civil Application No. 132 of 1957 in High Court of Bombay at Rajkot; summarily dismissed, certificate rejected; special leave from Supreme Court obtained.",
      "type": "procedural",
      "date": "1957",
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Chhotalal Haridas, resident of Bombay, subjected to proceedings by Fourth Income-tax Officer, Ward G, Bombay, who had jurisdiction.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Ex parte assessment order passed against Chhotalal on March 30, 1957, by Seventh Income-tax Officer, Ward G, Bombay, holding remittances constituted income from undisclosed business.",
      "type": "procedural",
      "date": "1957-03-30",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Appellate Assistant Commissioner allowed Chhotalal's appeal, set aside ex parte order for lack of service of notice, remitted for fresh assessment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "Impugned notice under section 34 served on Chhotalal on February 25, 1959, by Fourth Income-tax Officer, Ward G, Bombay.",
      "type": "procedural",
      "date": "1959-02-25",
      "source": "respondent"
    },
    {
      "id": "f21",
      "text": "Chhotalal filed Special Civil Application No. 374 of 1960 in High Court at Bombay; summarily dismissed, certificate rejected; special leave from Supreme Court obtained.",
      "type": "procedural",
      "date": "1960",
      "source": "petitioner"
    },
    {
      "id": "f22",
      "text": "Alleged total income of Rs. 97,00,000 from remittances through Indian Overseas Bank Ltd., Pondicherry, and United Commercial Bank Ltd., Pondicherry, during assessment year 1952-53, proposed to be enquired into against either or both appellants.",
      "type": "material",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether assessment proceedings against Lalji Haridas are barred by limitation under section 34(3) of the Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether Income-tax Officer, Ward A, Jamnagar has jurisdiction to proceed with assessment of Lalji Haridas due to allegedly invalid transfer orders by Central Board and Commissioner.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Fourth Income-tax Officer, Ward G, Bombay has jurisdiction to issue notice under section 34 to Chhotalal Haridas for precautionary or protective assessment of the income in question.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Assessment proceedings against Lalji barred by limitation under section 34(3).",
      "supporting_facts": [
        "f10",
        "f12",
        "f13",
        "f15"
      ],
      "legal_basis": "Section 34(3) of the Indian Income-tax Act"
    },
    {
      "id": "pa2",
      "text": "Proceedings against Lalji initiated without jurisdiction as Central Board order of September 30, 1953, under section 5(2) was illegal and unauthorised; subsequent assignment by Commissioner invalid; transfer of file by ITO Jamnagar invalid under section 64.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5",
        "f6",
        "f9"
      ],
      "legal_basis": "Sections 5(2), 5(5), 64 of the Indian Income-tax Act"
    },
    {
      "id": "pa3",
      "text": "No jurisdiction for respondent No. 1 (ITO Bombay) to assess Chhotalal as proposed assessment is precautionary or protective, a concept not recognized by the Act; relied on ex parte order against Lalji (set aside) and respondent's statement.",
      "supporting_facts": [
        "f13",
        "f15",
        "f18",
        "f19",
        "f20"
      ],
      "legal_basis": "Indian Income-tax Act (no provision for precautionary assessment)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Proceedings against both appellants valid; for Lalji, matter properly before ITO Jamnagar under section 64 after cancellation of transfer.",
      "supporting_facts": [
        "f9",
        "f15"
      ],
      "legal_basis": "Section 64 of the Indian Income-tax Act"
    },
    {
      "id": "ra2",
      "text": "Steps against Chhotalal precautionary pending final determination of liability between brothers; income may belong to one or both, cannot let it escape tax; initial enquiry to determine responsible party justified.",
      "supporting_facts": [
        "f22"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Limitation point under section 34(3) not to be decided in writ; appellant may raise before ITO.",
      "addresses_issue": "i1",
      "key_observation": "Question of limitation can be raised before ITO."
    },
    {
      "id": "cr2",
      "text": "Central Board order of September 30, 1953 invalid (not supported by respondent); thus Commissioner's assignment invalid; no jurisdiction for Bombay officers; transfer of file by Jamnagar ITO invalid; proceedings properly before ITO Ward A Jamnagar under section 64.",
      "addresses_issue": "i2",
      "key_observation": "Original transfer orders invalid, jurisdiction lies with ITO Jamnagar."
    },
    {
      "id": "cr3",
      "text": "Where income received but unclear who liable (A or B or both), authorities may enquire against both to determine responsibility; precautionary steps at initial stage permissible to prevent escape of tax.",
      "addresses_issue": "i3",
      "key_observation": "Protective assessments justified initially to determine true assessee."
    },
    {
      "id": "cr4",
      "text": "Proceedings against both to continue expeditiously; exhaustive enquiry against Lalji first; no assessment order against Chhotalal until Lalji's proceedings finally determined.",
      "addresses_issue": "i3",
      "key_observation": "Fair direction to avoid duplicate taxation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Notice issued by ITO Jamnagar to Lalji valid and within jurisdiction.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Enquiry against Chhotalal permissible to determine liability for the income; precautionary proceedings valid at initial stage.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "22",
        "23(2)",
        "27",
        "34",
        "34(3)",
        "37",
        "5(2)",
        "5(5)",
        "64"
      ],
      "relevance": "Governs filing of returns, notices, reassessment, jurisdiction transfers, summons, reopening assessments."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Both appeals dismissed. Writ petitions challenging notices under sections 23(2) and 34 held invalid. Directions issued for expeditious proceedings: exhaustive enquiry first against Lalji at Jamnagar; no final assessment against Chhotalal until Lalji's liability determined.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "if the original order of the Central Board is invalid, the assignment of the appellants case to the Income-tax Officer, Section IV Central, Bombay, is also invalid, and so the matter will have to be dealt with by the first respondent who under section 64 of the Act has jurisdiction to deal with it.",
      "speaker": "court",
      "significance": "Rejects jurisdiction challenge for Lalji, affirms ITO Jamnagar's authority."
    },
    {
      "text": "in cases where it appears to the income-tax authorities that certain income has been received during the relevant assessment year but it is not clear who has received that income and prima facie it appears that the income may have been received either by A or B or by both together, it would be open to the relevant income-tax authorities to determine the said question by taking appropriate proceedings both against A and B.",
      "speaker": "court",
      "significance": "Upholds initial precautionary enquiries against both brothers."
    }
  ],
  "_case_id": "1961_374",
  "_label": 0,
  "_text_length": 15083,
  "_extracted_at": "2026-02-10T19:35:25.470839"
}