{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Respondent (Assessee)",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Civil Appeal No. 451 of 1960",
    "date_of_judgment": "1961-02-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "For the year of assessment 1949-50 the respondent was assessed to a sum of Rs. 1,80,646/14/- as income-tax and super-tax on June 2, 1954.",
      "type": "procedural",
      "date": "1954-06-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "A notice of demand under s. 29 of the Act was served on the respondent to pay that amount on or before July 17, 1954.",
      "type": "procedural",
      "date": "1954-07-17",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On his application the respondent was allowed to pay by instalments. The last instalment of Rs. 30,646/14/- was payable on or before March 20, 1955.",
      "type": "procedural",
      "date": "1955-03-20",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "As there was a default in the payment of this instalment the Income-tax Officer on March 31, 1955 imposed a penalty of Rs. 3,000/- under s. 46(1) of the Act.",
      "type": "material",
      "date": "1955-03-31",
      "source": "income_tax_officer"
    },
    {
      "id": "f5",
      "text": "On April 20, 1955 the respondent filed an appeal to the Appellate Assistant Commissioner but by that date the last instalment had not been paid.",
      "type": "procedural",
      "date": "1955-04-20",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The last instalment was paid on May 16, 1955.",
      "type": "material",
      "date": "1955-05-16",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "The Income-tax Officer raised a preliminary objection before the Appellate Assistant Commissioner that the appeal was not competent because the last instalment of the tax had not been paid. This was upheld by the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "income_tax_officer"
    },
    {
      "id": "f8",
      "text": "Against this order the respondent took an appeal to the Income-tax Appellate Tribunal which held that the right of appeal was conferred by s. 30(1) of the Act and is not taken away by s. 30(2) of the Act, only the remedy is barred.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "The Tribunal held that as the right had not been destroyed the appeal became a good appeal as soon as the assessee paid the arrears of tax and the only effect of the payment on May 16, 1955, was that the appeal shall be taken to have been preferred before the Appellate Assistant Commissioner on that date and it was then for the Appellate Assistant Commissioner to decide whether it was a fit case for extension of time and condonation of delay.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f10",
      "text": "The Tribunal directed the Appellate Assistant Commissioner to dispose of the appeal in accordance with law.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f11",
      "text": "At the instance of the Commissioner of Income-tax, the Tribunal stated the question of law to the High Court: Whether the appeal filed before the Appellate Assistant Commissioner on 20th April, 1955, became a proper and complete appeal though barred by limitation and the Appellate Assistant Commissioner should have decided the question of the condonation of delay?",
      "type": "procedural",
      "date": null,
      "source": "commissioner"
    },
    {
      "id": "f12",
      "text": "The High Court answered the question in the affirmative in its judgment and order dated September 18, 1957.",
      "type": "procedural",
      "date": "1957-09-18",
      "source": "high_court"
    },
    {
      "id": "f13",
      "text": "This is an appeal pursuant to a certificate of the High Court of Bombay under s. 66A(2) of the Indian Income-tax Act.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appeal filed before the Appellate Assistant Commissioner on 20th April, 1955, became a proper and complete appeal though barred by limitation and the Appellate Assistant Commissioner should have decided the question of the condonation of delay?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "The controversy between the parties revolves round the words 'no appeal shall lie' in the proviso to s. 30(1) in regard to the payment of taxes.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The contention which was raised before us was that these words mean that there is no right of appeal till the tax is paid and therefore if the tax has not been paid the memorandum of appeal cannot be filed and if filed it is merely a waste paper.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Proviso to s. 30(1) of the Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The right of appeal was conferred by s. 30(1) of the Act and is not taken away by s. 30(2) of the Act, only the remedy is barred. It further held that as the right had not been destroyed the appeal became good appeal as soon as the assessee paid the arrears of tax.",
      "supporting_facts": [
        "f6",
        "f8",
        "f9"
      ],
      "legal_basis": "s. 30(1) and s. 30(2) of the Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In our opinion the meaning of the words 'no appeal shall lie' in the proviso is not that no memorandum of appeal can be presented. All that it means is that the appeal will not be held to be properly filed until the tax has been paid.",
      "addresses_issue": "i2",
      "key_observation": "If the memorandum of appeal is filed within limitation but tax paid later within time, appeal proper; if tax paid after limitation, deemed filed on payment date, condone delay."
    },
    {
      "id": "cr2",
      "text": "The question will then have to be decided whether there was sufficient cause for condonation of delay and that is exactly what the Tribunal had ordered and that in our opinion is the effect of the proviso to s. 30(1) read with sub-s. (2) of s. 30 of the Act.",
      "addresses_issue": "i1",
      "key_observation": "Affirms Tribunal's direction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The appeal will not be held to be properly filed until the tax has been paid. If filed before limitation expires and tax paid within remaining time, proper and in time; if tax paid after limitation, deemed filed on payment date, decide condonation.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The High Court answered correctly in the affirmative.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Raja of Venkatagiri v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "referred",
      "relevance": "Referred to by High Court but unnecessary to refer by Supreme Court."
    },
    {
      "case_name": "Kamdar Brothers v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "referred",
      "relevance": "Referred to by High Court but unnecessary to refer by Supreme Court."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s. 66A(2)",
        "s. 29",
        "s. 46(1)",
        "s. 30(1)",
        "s. 30(2)"
      ],
      "relevance": "Governs assessment, demand, penalty, appeals, payment condition for appeal, reference to High Court. Proviso to s.30(1) interpreted as barring proper filing until tax paid, not right of appeal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by the Commissioner of Income-tax, upholding the Bombay High Court's affirmative answer to the question referred by the Tribunal, affirming that the appeal to the AAC became proper upon payment of tax and required decision on condonation of delay.",
    "relief_granted": "Direction to Appellate Assistant Commissioner to dispose of the appeal in accordance with law upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'no appeal shall lie in the proviso is not that no memorandum of appeal can be presented. All that it means is that the appeal will not be-held to be properly filed until the tax has been paid.'",
      "speaker": "court",
      "significance": "Core interpretation of proviso to s.30(1)"
    },
    {
      "text": "the appeal shall be taken to have been preferred before the Appellate Assistant Commissioner on that date and it was then for the Appellate Assistant Commissioner to decide whether it was a fit case for extension of time and condonation of delay.",
      "speaker": "court",
      "significance": "Explains effect of delayed payment on appeal filing date."
    }
  ],
  "_case_id": "1961_367",
  "_label": 0,
  "_text_length": 4743,
  "_extracted_at": "2026-02-10T19:34:42.563056"
}