{
  "metadata": {
    "case_name": "Tulsidas Kilachand & Ors. v. Commissioner of Income-tax",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeals Nos. 134 to 137 of 1959",
    "date_of_judgment": "1961-01-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Mr. Tulsidas Kilachand, one of the four appellants, made a declaration of trust dated 5th March 1951 in favour of his wife Vimla, declaring that he holds 244 shares of Kesar Corporation Ltd. and 120 shares of Kilachand Devchand Co., Ltd. upon trust to pay the income thereof to his wife for a period of seven years from the date hereof or her death whichever event may be earlier, and the trust shall not be revocable.",
      "type": "material",
      "date": "1951-03-05",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Assessment year 1952-53, previous year calendar year 1951. In that year, a sum of Rs. 30,404 was received as dividend income on those shares.",
      "type": "material",
      "date": "1951",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Income-tax Officer did not accept assessee's contention that this income after grossing up was not liable to be included in his total income under third proviso to s.16(1)(c); held income accrued to or arisen in hands of Mr. Tulsidas Kilachand and paid by him to wife; words of proviso did not apply.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "On appeal, Appellate Assistant Commissioner held case governed by s.16(3)(b), not to be considered under third proviso to s.16(1)(c); appeal conceded if former applies proviso does not save; appeal dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Tribunal held case covered either by s.16(3)(a)(iii) or s.16(3)(b), income liable to be included; referred question under s.66(1) to Bombay High Court: Whether on true construction of deed dated 5th March 1951, net dividend income of Rs.30,404 liable to be included in total income of assessee?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Bombay High Court held s.16(1)(c) not satisfied in view of third proviso, but s.16(3)(b) applicable; answered question in affirmative.",
      "type": "procedural",
      "date": "1957-09-20",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appeals by special leave to Supreme Court by four assessees arising out of similar facts.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on a true construction of the deed of declaration of trust dated 5th March 1951, the net dividend income of Rs. 30,404 on 120 shares of Kilachand Devchand Co., Ltd. and 244 shares of Kesar Corporation Ltd. held under trust by the assessee for the benefit of his wife was income liable to be included in the total income of the assessee?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Income not liable to be included in assessee's total income in view of third proviso to s.16(1)(c) of Indian Income-tax Act.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Third proviso to s.16(1)(c)"
    },
    {
      "id": "pa2",
      "text": "Case not governed by s.16(3)(b); no transfer of assets at all; ownership of shares involves bundle of rights (vote, distribution on dissolution, dividends), none transferred to wife as transfer connotes creation of right in assets in praesenti; merely creation of trust in respect of shares, dividends payable to wife; thus s.16(3)(a)(iii) or s.16(3)(b) not applicable.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "s.16(3)(a)(iii), s.16(3)(b)"
    },
    {
      "id": "pa3",
      "text": "Even if transfer, it was for adequate consideration, being for love and affection.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Case based on s.16(3)(a)(iii) and s.16(3)(b).",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "s.16(3)(a)(iii), s.16(3)(b)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Disposition falls within third proviso to s.16(1)(c) if only application of proviso considered, as irrevocable for >6 years or life, no direct/indirect benefit to settlor, assets remain property. But by deed, settlor holds shares in trust; shares do not remain property of settlor; s.16(1)(c) has no application, proviso not attracted.",
      "addresses_issue": "i1",
      "key_observation": "Shares held as trustee, not personal property."
    },
    {
      "id": "cr2",
      "text": "s.16(3) provides specially for assets transferred to wife. Transfer to wife directly/indirectly without adequate consideration (s.16(3)(a)(iii)) or to any person/association for benefit of wife without adequate consideration (s.16(3)(b)).",
      "addresses_issue": "i1",
      "key_observation": "Declaration of trust effects transfer."
    },
    {
      "id": "cr3",
      "text": "There was transfer: shares previously held personally, after declaration held as trustee. Under Indian Trusts Act ss.5,6, no need for overt transfer if declarer is trustee; law implies transfer. Capacity as declarer and trustee different. Under Transfer of Property Act, transfer to self possible. Transfer by husband to himself as trustee; 'any person' in s.16(3)(b) includes husband in trustee capacity.",
      "addresses_issue": "i1",
      "key_observation": "Change of capacity constitutes transfer to 'any person'."
    },
    {
      "id": "cr4",
      "text": "No adequate consideration: love and affection mere good consideration, not adequate; law insists on adequate to avoid tax, excludes love/affection.",
      "addresses_issue": "i1",
      "key_observation": "Adequate consideration denotes other than mere love and affection."
    },
    {
      "id": "cr5",
      "text": "Provat Kumar Mitter case distinguished: there assignment of dividends only, not shares; application of income, not source.",
      "addresses_issue": "i1",
      "key_observation": "Here disposition of shares differently made."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Case falls within s.16(3)(b), not third proviso to s.16(1)(c); transfer of assets to husband-trustee for benefit of wife without adequate consideration; dividend income liable to be included in assessee's total income.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chamberlain v. Inland Revenue Commissioners",
      "citation": "1943 25 T.C. 317",
      "treatment": "referred",
      "relevance": "Object of s.16 to prevent avoidance by settlements where taxpayer retains powers/interests."
    },
    {
      "case_name": "Provat Kumar Mitter v. Commissioner of Income-tax",
      "citation": "1960 3 S.C.R. 37",
      "treatment": "distinguished",
      "relevance": "Assignment of dividends only is application of income, not transfer of source; s.16(1)(c) not attracted there."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s.16(1)(c)",
        "s.16(3)(a)(iii)",
        "s.16(3)(b)",
        "s.66(1)"
      ],
      "relevance": "Provisions for inclusion of income from settlements/dispositions to wife without adequate consideration in settlor's total income."
    },
    {
      "name": "Indian Trusts Act",
      "sections": [
        "s.5",
        "s.6"
      ],
      "relevance": "Declaration of trust by declarer as trustee implies transfer without overt act."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [],
      "relevance": "Transfer possible by person to himself or himself and others."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals fail and are dismissed. The High Court's answer that the income is liable to be included in the assessee's total income is correct.",
    "relief_granted": null,
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"The words 'adequate consideration' denote consideration other than mere love and affection, which, in the case of a wife, may be presumed.\"",
      "speaker": "court",
      "significance": "Clarifies that love and affection is not adequate consideration under s.16(3)."
    },
    {
      "text": "\"This legislation is designed to overtake and circumvent a growing tendency on the part of taxpayers to endeavour to avoid or reduce tax liability by means of settlements.\"",
      "speaker": "court",
      "significance": "Explains purpose of s.16, quoting Lord Macmillan."
    }
  ],
  "_case_id": "1961_174",
  "_label": 0,
  "_text_length": 13673,
  "_extracted_at": "2026-02-10T19:31:50.701039"
}