{
  "metadata": {
    "case_name": "C. P. C. Motor Service, Mysore v. State of Mysore",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeals No. 180 of 1961",
    "date_of_judgment": "1961-12-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants were running stage carriage omnibuses on 18 routes, 14 of which are inter-district.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On September 21, 1960, the second respondent, General Manager of State Transport Undertaking, published tentative scheme for taking over stage carriage services over 64 routes to the complete exclusion of private operators under Chap. IV-A of Motor Vehicles Act.",
      "type": "material",
      "date": "1960-09-21",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Objections filed by appellants, heard by Chief Minister (authority under Rules), disposed by order dated November 7, 1960.",
      "type": "procedural",
      "date": "1960-11-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Scheme approved with modifications, published by State of Mysore via Notification No. HD. 200/TMP/60 in Gazette Extraordinary on November 10, 1960.",
      "type": "material",
      "date": "1960-11-10",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Appellants filed Writ Petition No. 1326 of 1960 under Art. 226 in Mysore High Court, dismissed by judgment dated January 30, 1961.",
      "type": "procedural",
      "date": "1961-01-30",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Present appeal filed with special leave of Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Private operators including appellants plied on inter-district, intra-district, and inter-state routes; scheme excludes private operators only in Mysore District.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Approved scheme states State Transport Undertaking operates on all notified inter-district routes except portions outside Mysore District limits, and entire length within Mysore District; on notified routes, operates without prejudice to existing valid permit-holders on inter-state routes only.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Routes in appendix show stops, lengths, maximum vehicles and daily services by State (some) and private operators (Nil).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Chief Minister in order dated November 7, 1960 observed private operators' contention that exclusive operation on notified routes affects inter-district and inter-state routes not notified, found force in contention, directed scheme to be suitably modified.",
      "type": "material",
      "date": "1960-11-07",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the modified scheme is vague, indefinite and contradictory and does not carry out the orders of the Chief Minister.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether there has been compliance with the mandatory requirements of ss. 68C and 68E of the Motor Vehicles Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the scheme is destructive of coordination, which is the gist of efficient motor transport services.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the routes on which the appellants operated were affected by the monopoly created in favour of the State Transport Undertaking.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Modified scheme is vague, indefinite and contradictory; does not carry out Chief Minister's orders; vagueness from not mentioning particulars under s. 68C, e.g., columns for private operators shown as Nil.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Section 68C Motor Vehicles Act"
    },
    {
      "id": "pa2",
      "text": "No compliance with mandatory requirements of ss. 68C and 68E; omission of fares, timings; no minimum trips/vehicles indicated.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Sections 68C, 68E Motor Vehicles Act"
    },
    {
      "id": "pa3",
      "text": "Scheme destructive of coordination due to transhipment at Mysore District borders.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Appellants' inter-district routes not affected as they are different routes, even if overlapping in Mysore District; route means notional line between termini.",
      "supporting_facts": [
        "f1",
        "f7",
        "f8"
      ],
      "legal_basis": "Kelani Valley Motor Transit Co., Ltd. v. Colombo Ratnapura Omnibus Co., Ltd. (Privy Council)"
    },
    {
      "id": "pa5",
      "text": "Chief Minister accepted objection on overlap affecting non-notified routes, directed modification, but scheme excludes private operators from portions within Mysore District.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "On notified routes, private operators have no omnibuses or services, hence Nil entries; other particulars given; fares/timings for transport authorities.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Motor Vehicles Act"
    },
    {
      "id": "ra2",
      "text": "Transhipment does not denote lack of coordination; partial nationalisation under s. 68C necessitates it.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 68C Motor Vehicles Act"
    },
    {
      "id": "ra3",
      "text": "Chief Minister's order read as qualifying 'portions' not 'routes'; directions carried out by excluding private operation within Mysore District.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Rules amended; no need for minimum vehicles/trips.",
      "supporting_facts": null,
      "legal_basis": "Rules under Motor Vehicles Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Scheme not vague; Nil for private operators direct result of takeover; particulars given except fares/timings which are for transport authorities; not required in scheme.",
      "addresses_issue": "i1",
      "key_observation": "Omission of fares and timings does not militate against scheme."
    },
    {
      "id": "cr2",
      "text": "No non-compliance with ss. 68C, 68E; Rules complied with post-amendment; no minimum vehicles/trips needed.",
      "addresses_issue": "i2",
      "key_observation": "Departure from minimum would not alter scheme post-amendment."
    },
    {
      "id": "cr3",
      "text": "Scheme not destructive of coordination; partial operation under s. 68C allows transhipment but coordination exists.",
      "addresses_issue": "i3",
      "key_observation": "Transhipment necessary in partial nationalisation."
    },
    {
      "id": "cr4",
      "text": "Chief Minister's order qualifies 'portions' of routes not notified, not entire routes; read harmoniously, no contradiction; directions exclude private operation within Mysore District.",
      "addresses_issue": "i1",
      "key_observation": "Where two constructions open, read harmoniously with directions."
    },
    {
      "id": "cr5",
      "text": "Appellants' routes affected; notified routes include portions within Mysore District for exclusive state operation; route means actual road, not just notional line; s. 68F(2)(c) allows curtailment.",
      "addresses_issue": "i4",
      "key_observation": "No distinction between notifying portion of private route or different route including that portion."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Scheme valid; not vague, complies with ss. 68C, 68E; not destructive of coordination; affects appellants' routes pro tanto within Mysore District.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Chief Minister's order carried out; no contradiction.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Partial nationalisation under Chap. IV-A valid post-Constitution First Amendment to Art. 19(6).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Nilkanth Prasad v. State of Bihar",
      "citation": null,
      "treatment": "followed",
      "relevance": "Explains meaning of route and portion of route."
    },
    {
      "case_name": "Kelani Valley Motor Transit Co., Ltd. v. Colombo Ratnapura Omnibus Co., Ltd.",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Meaning of route as notional line; scheme of Ceylon ordinance different from Motor Vehicles Act."
    },
    {
      "case_name": "Kondala Rao v. Andhra Pradesh State Road Transport Corporation",
      "citation": null,
      "treatment": "followed",
      "relevance": "Route or area mean the same; actual road over which omnibuses run."
    }
  ],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act",
      "sections": [
        "68C",
        "68E",
        "68F(2)(c)",
        "Chap. IV-A"
      ],
      "relevance": "Permits State Undertaking to take over routes/areas wholly/partly; scheme framing, objections, modification; curtailment of permits."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226",
        "Art. 19(6)"
      ],
      "relevance": "Writ jurisdiction; validity of Chap. IV-A post First Amendment."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal challenging the approved scheme for nationalisation of routes in Mysore District is dismissed; scheme upheld as valid, not vague, compliant with statutory requirements, not destructive of coordination, and affecting appellants' routes within the district.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The direction which was given, effectuates the later reading, which was really meant and not the former, which is urged because the qualifying phrase which are not notified has been unhappily put later.\"",
      "speaker": "court",
      "significance": "Interprets Chief Minister's order to resolve alleged contradiction."
    },
    {
      "text": "\"By route is meant, as already stated, not only the notional line but also the actual road over which the omnibuses run.\"",
      "speaker": "court",
      "significance": "Defines 'route' under Motor Vehicles Act, affecting permit curtailment."
    },
    {
      "text": "\"The transhipment, by itself, would not connote a lack of coordination.\"",
      "speaker": "court",
      "significance": "Rejects argument on coordination in partial nationalisation."
    }
  ],
  "_case_id": "1961_169",
  "_label": 0,
  "_text_length": 17115,
  "_extracted_at": "2026-02-10T19:31:53.952398"
}