{
  "metadata": {
    "case_name": "Proprietor of Cottage Industries v. Food Inspector, Thana Borough Municipality",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Criminal Appeal No. 155 of 1959",
    "date_of_judgment": "1961-02-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is the proprietor of a shop at Thana known as the Cottage Industries. He is a dealer in butter.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On June 27, 1957, the Food Inspector of the Thana Borough Municipality visited the shop of the appellant and purchased from him some quantity of Khandeshi butter.",
      "type": "material",
      "date": "1957-06-27",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "After purchasing the butter, the Food Inspector notified his intention to the appellant that he was going to get the butter analysed. He divided the butter into three equal parts, put them in three separate bottles and duly sealed the bottles in the presence of two panchas. He gave one of those bottles to the appellant, sent one to the Public Analyst and kept the third with himself.",
      "type": "procedural",
      "date": "1957-06-27",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "The appellant signed the labels on the bottles and also passed a receipt in favour of the Food Inspector in token of the receipt of one of the bottles and that receipt was signed by the appellant and counter-signed by two panch witnesses.",
      "type": "procedural",
      "date": "1957-06-27",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "The Public Analyst analysed the butter sent to him and sent his report. In the report it was stated that the butter contained 18.32 foreign fat, 19.57 moisture and 64.67 milk fat.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "On October 5, 1957, the Food Inspector filed a complaint in the Court of the Judicial Magistrate, First Class, Thana, against the appellant alleging that the said butter was found to be adulterated as defined in s. 2(i)(a) of the Act and that the appellant had committed an offence under s. 16 of the Act by selling the adulterated article of food in contravention of s. 7(1) of the Act and the rules made thereunder.",
      "type": "procedural",
      "date": "1957-10-05",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "The Judicial Magistrate acquitted the appellant on the ground that it had not been proved beyond reasonable doubt that the butter which was purchased from the shop of the appellant was the very same butter which was sent to the Public Analyst and also for the reason that butter prepared out of curd did not come within the mischief of the definition of the word butter in rule A.11.05 of Appendix B to the Prevention of Food Adulteration Rules, 1955.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The Food Inspector preferred an appeal against that order of acquittal to the Bombay High Court.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "The High Court by judgment order dated July 23, 1959, allowed the appeal, set aside the order of acquittal, convicted the appellant under s. 16(1) read with s. 7(1) of the Act, and sentenced him to undergo rigorous imprisonment for two months and to pay a fine of Rs. 250/-",
      "type": "procedural",
      "date": "1959-07-23",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "On April 16, 1960, the Central Government made another rule amending rule A-11.05 by inserting the word 'curd' in the definition of butter.",
      "type": "background",
      "date": "1960-04-16",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether butter prepared from curds is butter within the meaning of r. A.11.05 of Appendix B to the Prevention of Food Adulteration Rules, 1955.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the butter sent to the Public Analyst was the same butter seized from the appellant.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the report of the Public Analyst was vague and therefore no conviction could be based on it.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court went wrong in holding that the appellant had committed an offence under the Act, even though the butter in question was not butter within the meaning of the Rules.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Butter prepared from curds is not butter within the meaning of r. A.11.05 of Appendix B to the Rules because: (1) the definition refers only to a product prepared from milk or cream; (2) milk, cream and curd are separately defined, omission of curd indicates exclusion; (3) word 'exclusively' means from milk or cream and no other product.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Rule A.11.05, Appendix B, Prevention of Food Adulteration Rules, 1955"
    },
    {
      "id": "pa3",
      "text": "Butter sent to the Public Analyst was not the same butter seized from the appellant.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "The report of the Public Analyst was vague (percentages total over 100%) and therefore no conviction could be based on it.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "The rule being part of a penal statute should be construed strictly in favour of the accused.",
      "supporting_facts": [],
      "legal_basis": "Principles of interpretation of penal statutes"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The conclusion of the Judicial Magistrate that the butter purchased from the appellant might have been tampered with before it was sent to the Public Analyst was not based on any evidence.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Butter prepared from curds is covered by the definition of butter in r. A.11.05.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Rule A.11.05"
    },
    {
      "id": "ra3",
      "text": "Even if butter prepared out of curds was not butter as defined in the rule, the appellant would still be liable under s. 2(i)(a) as it contained foreign fat and was adulterated.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "s. 2(i)(a), Prevention of Food Adulteration Act, 1954"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Assuming in favour of appellant that liability requires butter to be within rule definition. Ingredients of offence: article adulterated if quality falls below prescribed standard per s.2(i). Standards in Rule A.11.05: butter is product prepared exclusively from milk or cream of cow or buffalo, not less than 80% milk fat, not more than 16% moisture. Non-conformity deems it adulterated by fiction. s.7 prohibits sale, s.16 penalty.",
      "addresses_issue": "i1",
      "key_observation": "If standard not attained, statute treats butter as adulterated food by fiction; accused cannot prove otherwise."
    },
    {
      "id": "cr2",
      "text": "Butter by whatever process prepared (direct from milk/cream or from curd via souring) is product prepared from milk. Definitions of milk, cream, curd, ghee examined. Word 'prepared' comprehensive, includes processes. 'Exclusively' refers to milk/cream of cow/buffalo species.",
      "addresses_issue": "i1",
      "key_observation": "Preparation of cream or curd is intermediate process in manufacture of butter from milk."
    },
    {
      "id": "cr3",
      "text": "Rule part of penal statute but plain language governs; strict construction means no straining words, but accept expressed intention.",
      "addresses_issue": "i1",
      "key_observation": "Butter prepared from curd falls within plain meaning of r. A.11.05."
    },
    {
      "id": "cr4",
      "text": "Narshinha Bhaskar v. State of Bombay overruled by full bench Sadashiv v. P. V. Bhalerao: emphasis on basic material (milk), not process.",
      "addresses_issue": "i1",
      "key_observation": "Agreed with full bench observations."
    },
    {
      "id": "cr5",
      "text": "Hunt v. Richardson distinguished: English Act requires actual mixing/abstraction; Indian Act deems sub-standard as adulterated by fiction, no rebuttal.",
      "addresses_issue": "i1",
      "key_observation": "Interpretation carries out legislative intent to prevent adulteration; appellant's view would defeat Act."
    },
    {
      "id": "cr6",
      "text": "High Court finding that bottle sent to Public Analyst was sample seized accepted; no permissible grounds to canvass.",
      "addresses_issue": "i2",
      "key_observation": "Evidence of Food Inspector and Health Officer accepted."
    },
    {
      "id": "cr7",
      "text": "Report not vague: 18.32% foreign fat is percentage of fat content, not total butter (\"The butter fat in the sample contains 18.32 foreign fat\"). Clearly below standard.",
      "addresses_issue": "i3",
      "key_observation": "No mistake on face of report."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Butter prepared from curd comes within the definition of butter in r. A.11.05 of Appendix B to the Rules.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The butter sent to the Public Analyst was the same as seized from appellant.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Report of Public Analyst not vague; indicates butter below standard.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Appellant guilty under s.16(1) r/w s.7(1) of Prevention of Food Adulteration Act, 1954.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Narshinha Bhaskar v. State of Bombay",
      "citation": "I.L.R. 1958 Bom. 63",
      "treatment": "overruled",
      "relevance": "Held butter from curd not within definition; overruled by full bench."
    },
    {
      "case_name": "Sadashiv v. P. V. Bhalerao",
      "citation": "I.L.R. 1959 Bom. 1800",
      "treatment": "followed",
      "relevance": "Full bench held butter from dahi/curd is butter from milk; intermediate process."
    },
    {
      "case_name": "Hunt v. Richardson",
      "citation": "1916 2 K.B. 446",
      "treatment": "distinguished",
      "relevance": "Under English Act, sub-standard milk not offence if no abstraction/addition; rebuttable presumption. Differs from Indian deeming fiction."
    },
    {
      "case_name": "Newby v. Sims",
      "citation": "1894 63 L.J.M.C. 229",
      "treatment": "referred",
      "relevance": "No stricter construction for anti-adulteration Acts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Prevention of Food Adulteration Act, 1954",
      "sections": [
        "s. 2(i)",
        "s. 2(i)(a)",
        "s. 4(2)",
        "s. 7(1)",
        "s. 16(1)",
        "s. 23(1)"
      ],
      "relevance": "Defines adulterated article if below standard; prohibits sale of adulterated food; penalty for contravention."
    },
    {
      "name": "Prevention of Food Adulteration Rules, 1955",
      "sections": [
        "Rule 5",
        "Rule A.11.01",
        "Rule A.11.05",
        "Rule A.11.06",
        "Rule A.11.10",
        "Rule A.11.14"
      ],
      "relevance": "Prescribes standards for butter (prepared exclusively from milk/cream of cow/buffalo, min 80% milk fat, max 16% moisture); definitions of milk, curd, cream, ghee."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal dismissed on merits; conviction under s.16(1) r/w s.7(1) upheld as butter from curd falls within definition, sample identity proved, report valid. Sentence modified from RI 2 months + fine Rs.250 to fine of Rs.500, considering conflict in High Court views and subsequent rule amendment.",
    "relief_granted": "Sentence reduced to fine of Rs. 500/-",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Butter means the product prepared exclusively from the milk or cream of cow or buffalo, or both...\"",
      "speaker": "court",
      "significance": "Central definition interpreted to include butter from curd."
    },
    {
      "text": "\"The preparation of cream or curd is only an intermediate process in the manufacture of butter from milk.\"",
      "speaker": "court",
      "significance": "Key reasoning upholding inclusion of curd butter."
    },
    {
      "text": "\"If the standard is not maintained, the butter, by a fiction, becomes an adulterated food.\"",
      "speaker": "court",
      "significance": "Explains deeming provision and no rebuttal allowed."
    },
    {
      "text": "\"The emphasis is, therefore, on the basic material from which butter is prepared and not on the process by which it is made.\"",
      "speaker": "court",
      "significance": "Quoting full bench decision followed by SC."
    }
  ],
  "_case_id": "1961_315",
  "_label": 0,
  "_text_length": 24904,
  "_extracted_at": "2026-02-10T19:34:15.381885"
}