{
  "metadata": {
    "case_name": "Garment Cleaning Works, Bombay v. Workmen",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Two demands made by the respondents, the workmen of the appellant company, the Garment Cleaning Works, Bombay, were referred for industrial adjudication to the industrial tribunal under s. 10(1) of the Industrial Disputes Act, XIV of 1947. These demands were for gratuity and provident fund respectively.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The tribunal has framed a gratuity scheme and has passed an order that the appellant should draw up a scheme of provident fund on the lines of the model provident fund scheme drawn by the Government under the Employees Provident Funds Act, 1952 (XIX of 1952), with a rate of company contribution of 6 1/4 per cent. of total wages.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Both the gratuity scheme as drawn up and the directions as to the drawing up of a provident fund scheme are challenged by the appellant by its present appeal which it has brought to this Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Clause (ii)(a) of the gratuity scheme provides that on retirement or resignation of a workman after ten years service ten days consolidated wages for each year's service should be awarded as gratuity.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Clause (iv) of the gratuity scheme provides that if a workman is dismissed or discharged for misconduct causing financial loss to the works gratuity to the extent of the loss should not be paid to the workman concerned.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Clause (v) of the gratuity scheme provides that for calculating years of service the entire service of the workmen should be taken into account.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "When the appellant produced its balance-sheet and other relevant papers it claimed privilege under s. 21 of the Industrial Disputes Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The Tribunal observed that the appellant has made good profits, its future is assured, and it has capacity to build up adequate reserves.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the gratuity scheme framed by the tribunal is valid, including whether it should be on industry-cum-region basis, the ten-year service requirement under clause (ii)(a), the forfeiture provision under clause (iv) for misconduct causing financial loss, and whether service under clauses (i), (ii), (iii) and (v) refers to continuous service.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the tribunal properly assessed the appellant's financial capacity before directing it to frame a provident fund scheme on the lines of the model scheme under the Employees Provident Funds Act, 1952 with 6 1/4% company contribution.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The problem of starting gratuity scheme should have been considered on an industry-cum-region basis and considerations relevant to the said basis should have been taken into account.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "The Bharatkhands Textile Mfg. Co. Ltd. Ors. v. The Textile Labour Association, Ahmedabad"
    },
    {
      "id": "pa2",
      "text": "No gratuity should be admissible under clause (ii)(a) until fifteen years service has been put in by the employee on resignation.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "The Express Newspapers Private Ltd. Anr. v. The Union of India Ors. (1959 S.C.R. 12, 154)"
    },
    {
      "id": "pa3",
      "text": "Clause (iv) is inconsistent with principles on which gratuity claims are based; gratuity should be denied for any misconduct as it disqualifies on grounds of long and meritorious service.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "s. 2(oo) of the Industrial Disputes Act; Rule 71 of the Provident Funds Scheme Rules under Employees Provident Funds Act, 1952"
    },
    {
      "id": "pa4",
      "text": "Service referred to in clauses (i), (ii), (iii) and (v) should be continuous service.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Tribunal did not properly assess financial obligation and limited financial capacity of appellant in directing provident fund scheme.",
      "supporting_facts": [
        "f2",
        "f7",
        "f8"
      ],
      "legal_basis": "s. 21 of the Industrial Disputes Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The position that service referred to in clauses (i), (ii) and (iii) refers to continuous service is not disputed.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Industry-cum-region basis is permissible but not the only basis for gratuity schemes; unit basis is common and valid. Bharatkhands case does not mandate it.",
      "addresses_issue": "i1",
      "key_observation": "It is one thing to hold that the gratuity scheme can in a proper case be framed on industry-cum-region basis, and another thing to say that industry-cum-region basis is the only basis on which gratuity scheme can be framed."
    },
    {
      "id": "cr2",
      "text": "Observation in Express Newspapers was not intended to lay down a rule of universal application; 10 years minimum service for gratuity on resignation is not unreasonable.",
      "addresses_issue": "i1",
      "key_observation": "The observation on which this argument is based was not intended to lay down a rule of universal application in regard to all gratuity schemes."
    },
    {
      "id": "cr3",
      "text": "Gratuity is earned for service rendered; even if dismissed for misconduct, benefit should not be wholly denied unless it causes financial loss, from which employer is compensated to the extent of gratuity payable. Distinguishes from retrenchment and provident fund rules.",
      "addresses_issue": "i1",
      "key_observation": "If gratuity is earned by an employee for long and meritorious service it is difficult to understand why the benefit thus earned by long and meritorious service should not be available to the employee even though at the end of such service he may have been found guilty of misconduct which entails his dismissal."
    },
    {
      "id": "cr4",
      "text": "Clarifies that service referred to in clauses (i), (ii) and (iii) refers to continuous service.",
      "addresses_issue": "i1",
      "key_observation": "We would accordingly make it clear that the service referred to in clauses (i), (ii) and (iii) refers to continuous service."
    },
    {
      "id": "cr5",
      "text": "Tribunal justified in not discussing figures due to privilege under s.21 claimed by appellant; cannot now waive and seek remand. No reason to interfere with direction on provident fund scheme.",
      "addresses_issue": "i2",
      "key_observation": "If the appellant wanted the tribunal to consider the figures and state its conclusions in the light of the said figures in its award it need not have claimed privilege under s. 21 at the trial. It is not too late to suggest that the privilege be waived."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Gratuity scheme framed by tribunal is valid; industry-cum-region not mandatory; clause (ii)(a) with 10 years service reasonable; clause (iv) reasonable as it only forfeits gratuity to extent of financial loss caused; service in clauses (i),(ii),(iii) is continuous.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Direction to frame provident fund scheme on lines of model under EPF Act with 6 1/4% contribution upheld; no interference warranted.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "The Bharatkhands Textile Mfg. Co. Ltd. Ors. v. The Textile Labour Association, Ahmedabad",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Held that gratuity scheme can be based on industry-cum-region basis in proper case, but does not mandate it as only basis."
    },
    {
      "case_name": "The Express Newspapers Private Ltd. Anr. v. The Union of India Ors.",
      "citation": "1959 S.C.R. 12, 154",
      "treatment": "distinguished",
      "relevance": "Observation on 15 years service for gratuity on resignation was obiter, not universal rule."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 10(1)",
        "s. 2(oo)",
        "s. 21"
      ],
      "relevance": "Reference of disputes; definition of retrenchment excluding disciplinary termination; privilege against disclosure of accounts."
    },
    {
      "name": "Employees Provident Funds Act, 1952",
      "sections": null,
      "relevance": "Model provident fund scheme to be followed; Rule 71 of scheme rules allows deductions for misconduct."
    },
    {
      "name": "Working Journalists (Conditions of Service) and Miscellaneous Provisions Act, 1955",
      "sections": [
        "s. 5(1)(a)(iii)"
      ],
      "relevance": "Provision struck down as unconstitutional; incidental observation on gratuity after 15 years."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave, upholding the industrial tribunal's gratuity scheme (with clarification that service in clauses (i),(ii),(iii) is continuous) and the direction to frame provident fund scheme on model lines with 6 1/4% company contribution, rejecting all contentions of the appellant.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Gratuity is not paid to the employee gratuitously or merely as a matter of boon. It is paid to him for the service rendered by him to the employer, and when it is once earned it is difficult to understand why it should necessarily be denied to him whatever may be the nature of misconduct for his dismissal.",
      "speaker": "court",
      "significance": "Core reasoning upholding gratuity even post-misconduct dismissal, subject to loss deduction."
    },
    {
      "text": "It is one thing to hold that the gratuity scheme can in a proper case be framed on industry-cum-region basis, and another thing to say that industry-cum-region basis is the only basis on which gratuity scheme can be framed.",
      "speaker": "court",
      "significance": "Distinguishes cited precedent and validates unit-based scheme."
    }
  ],
  "_case_id": "1961_255",
  "_label": 0,
  "_text_length": 11925,
  "_extracted_at": "2026-02-10T19:33:21.436574"
}