{
  "metadata": {
    "case_name": "State of Bihar and Additional Collector of Darbhanga v. Respondent",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Civil Appeal No. 425 of 1957",
    "date_of_judgment": "1961-05-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plots Nos. 383 and 1033 are tanks in village Lakshmipur alias Tarauni in the District of Darbhanga.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent claims to have taken settlement of the said plots in the year 1943 from the landlords of Raghopur Estate of which the said plots formed a part.",
      "type": "disputed",
      "date": "1943",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "After the coming into force of the Bihar Land Reforms Act, 1950, the said Estate vested in the State of Bihar.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Sheonandan Jha and some other villagers of Lakshmipur filed a petition before the Collector alleging that the alleged settlement was not true, and that in fact the settlement was nominally effected only after January 1, 1946.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Additional Collector, Darbhanga, in exercise of the powers conferred on him under s. 4(h) of the Act, held that the said settlement was actually made after January 1, 1946, and that it was only a paper transaction.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The Additional Collector annulled the said settlement and by his order dated January 18, 1955, called upon the respondent to give up possession of the said plots by January 30, 1955.",
      "type": "procedural",
      "date": "1955-01-18",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Aggrieved by the said order, the respondent filed a petition in the High Court of Judicature at Patna under Art. 226 of the Constitution for a rule in the nature of a writ of mandamus or any other appropriate writ cancelling the order of the Additional Collector dated January 18, 1955, and restraining the appellants from interfering with his possession of the said two plots. That petition came to be decided by a division bench of the High Court in Misc. Judicial Case No. 53 of 1955.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The learned Judges of the High Court by their order dated February 21, 1956, held that the Additional Collector had no jurisdiction to entertain and decide the question whether the settlement, which was prima facie shown to have been made before January 1, 1946, was actually made after that date. On the basis of that finding, the order of the Additional Collector was set aside.",
      "type": "procedural",
      "date": "1956-02-21",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The State of Bihar and the Additional Collector of Darbhanga have preferred the present appeal against the said order by certificate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Construction of s. 4(h) of the Bihar Land Reforms Act, 1950, as amended by the Bihar Land Reforms Amendment Act, 1959.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the amendments to s. 4(h), particularly the second proviso, operate retrospectively.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether s. 4(h) of the Act infringes the fundamental rights under Arts. 14, 19 and 31 of the Constitution and is not saved by Art. 31A.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "s. 4(h) of the Act has been amended with retrospective effect, that under the amended section the Collector has power to decide whether a transfer is made before 1946 or thereafter.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Bihar Land Reforms Amendment Act, 1959 (Bihar Act 16 of 1959), s. 3"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "While conceding the retroactivity of the amendment, relies upon the second proviso added by the amendment to s. 4(h) and contends that under the said proviso the order of the Collector cannot take effect nor possession taken thereunder, unless the said order has been confirmed by the State Government and that in the instant case there has been no such confirmation.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Second proviso to s. 4(h) as amended"
    },
    {
      "id": "ra2",
      "text": "Questions the constitutional validity of the said section on the ground that it infringes the fundamental right of the respondent under Arts. 14, 19 and 31 of the Constitution and is not saved by Art. 31A thereof.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Articles 14, 19, 31, 31A of the Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under Art. 31A of the Constitution, no law providing for the acquisition by the State of any estate or of any rights therein or the extinguishment or modification of any such rights shall be deemed to be void on the ground that it is inconsistent with, or takes away or abridges any of the rights conferred by Art. 14, Art. 19 or Art. 31. Section 4(h) is an integral part of the Act designed to extinguish or modify the rights in an estate, and is protected by Art. 31A.",
      "addresses_issue": "i3",
      "key_observation": "The object of the section is to offset the anticipatory attempts made by landlords to defeat the provisions of the Act."
    },
    {
      "id": "cr2",
      "text": "The amendments made by s. 3(i)(a) and (b) of the Amending Act are retrospective ('shall be deemed always to have been omitted/inserted'), but the second proviso added by s. 3(ii) is prospective. The condition of previous sanctions would continue to operate in respect of the Collector's order made before the amendment.",
      "addresses_issue": "i2",
      "key_observation": "If the proviso be given a retrospective operation, it directly comes into conflict with the result brought about by cl. (c) of sub-s. (i) of s. 3."
    },
    {
      "id": "cr3",
      "text": "In respect of an order already made by the Collector before the Amending Act, the previous sanction obtained would suffice, and in respect of an order made after the Amending Act, a subsequent confirmation by the State Government is required.",
      "addresses_issue": "i1",
      "key_observation": "The alternative construction makes the working of the section smooth and avoids the introduction of the said incongruity."
    },
    {
      "id": "cr4",
      "text": "There is no specific allegation in the affidavit that no such inquiry was made or no such sanction obtained, nor was it raised before the High Court.",
      "addresses_issue": "i1",
      "key_observation": "This Court is not justified in allowing the respondent to raise the said question for the first time."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s. 4(h) of the Bihar Land Reforms Act, 1950 is protected by Art. 31A of the Constitution.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Amendments to s. 4(h) by clauses (a) and (b) of s. 3(i) of the Amending Act are retrospective, but the second proviso is prospective; previous sanction suffices for pre-amendment orders.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Thakur Raghubir Singh v. State of Ajmer",
      "citation": "1959 SUPP. 1 S.C.R. 478",
      "treatment": "followed",
      "relevance": "Held that similar provision cancelling transfers in anticipation of legislation is ancillary and protected under Art. 31A(1)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bihar Land Reforms Act, 1950 (Act 30 of 1950)",
      "sections": [
        "Section 4(h)"
      ],
      "relevance": "Confers power on Collector to inquire and annul transfers made after January 1, 1946 to defeat the Act; integral to vesting of estates in State."
    },
    {
      "name": "Bihar Land Reforms (Amendment) Act, 1959 (Bihar Act 16 of 1959)",
      "sections": [
        "Section 3"
      ],
      "relevance": "Amends s. 4(h) retrospectively in parts, adds provisos; second proviso prospective."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 14",
        "Article 19",
        "Article 31",
        "Article 31A"
      ],
      "relevance": "Art. 226 for writ petition; Arts. 14,19,31 challenged; Art. 31A saves the law."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed, the order of the High Court dated February 21, 1956 is set aside.",
    "relief_granted": "Restoration of the Additional Collector's order dated January 18, 1955.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The provision is not an independent provision it is merely ancillary in character enacted for carrying out the objects of the Act more effectively Such cancellation would sub-serve the purposes of the Act, and the provision for it therefore be an integral part of the Act, though ancillary to its main object, and would thus be protected under Art. 31A (1) of the Constitution.\"",
      "speaker": "court",
      "significance": "Quoting precedent to hold s.4(h) protected by Art. 31A."
    },
    {
      "text": "The result is that in respect of an order already made by the Collector before the Amending Act, the previous sanction obtained would suffice.",
      "speaker": "court",
      "significance": "Key holding on retrospective effect of amendments."
    }
  ],
  "_case_id": "1961_297",
  "_label": 1,
  "_text_length": 13307,
  "_extracted_at": "2026-02-10T19:34:03.756643"
}