{
  "metadata": {
    "case_name": "Delhi Administration v. Ram Singh",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal",
      "K. Subba Rao",
      "J. R. Mudholkar"
    ],
    "case_number": "Criminal Appeal No. 220 of 1960",
    "date_of_judgment": "1961-05-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Ram Singh, respondent, was suspected of having committed an offence under s. 8 of the Suppression of Immoral Traffic in Women and Girls Act, 1956.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Jet Ram, Sub-Inspector, who had not been appointed a special police officer by the State Government, investigated the case and submitted the charge-sheet to the Magistrate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Magistrate quashed the charge-sheet, holding that the special police officer alone was competent to investigate the case and that Jet Ram could not have investigated it.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "On revision by the State (Delhi Administration), the Punjab High Court agreed with the view of the Magistrate and dismissed the revision.",
      "type": "procedural",
      "date": "1960-08-04",
      "source": "high_court"
    },
    {
      "id": "f5",
      "text": "The High Court granted a certificate under Art. 133(1)(c) of the Constitution, leading to this appeal by the Delhi Administration.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f6",
      "text": "Investigation into the offences was made by the officer-in-charge of the Kamla Market Police Station and a charge-sheet was presented by him before a First Class Magistrate in Delhi.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Similar charge-sheets were put up against certain other persons, and objection was taken before the Magistrate that investigation was not made by the special police officer.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The High Court followed the decision in Kuppammal, In re, holding that an offence under the Act must be investigated only by one of the officers mentioned in s. 13.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a police officer, who is neither a special police officer under the Suppression of Immoral Traffic in Women and Girls Act, 1956 nor a police officer subordinate to a special police officer, can validly investigate the offences under the Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "In the absence of any definite provision in the Act de-barring the police to exercise its powers with respect to cognizable offences, the regular police can exercise those powers and consequently there is nothing wrong in the Sub-Inspector of the regular police making an investigation in a case under the Act.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Suppression of Immoral Traffic in Women and Girls Act, 1956; Code of Criminal Procedure, 1898"
    },
    {
      "id": "pa2",
      "text": "The special police officer is not competent to investigate offences, his powers being confined to what may come within the expression 'dealing with offences under the Act', and which expression, according to him, does not cover the power to investigate into offences.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Section 13 of the Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "It is only the special police officer who is competent to investigate the offences under the Act.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Section 13 of the Suppression of Immoral Traffic in Women and Girls Act, 1956"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Act is a complete Code with respect to what is to be done under it, creating new offences, providing machinery to deal with them, and its necessary implication is that new machinery (special police officer) is to deal with those offences.",
      "addresses_issue": "i1",
      "key_observation": "Regular police cannot comply with certain provisions like arrest without warrant only by special police officer or under his direction."
    },
    {
      "id": "cr2",
      "text": "Section 14 makes offences cognizable but restricts arrest without warrant to special police officer or under his direction; Section 15 restricts searches without warrant to special police officer.",
      "addresses_issue": "i1",
      "key_observation": "These provisions indicate regular police officers are not to exercise powers in connection with offences under the Act."
    },
    {
      "id": "cr3",
      "text": "The expression 'dealing with offences' in s.13(1) is of wide import and includes investigation; special police officer assisted by subordinates is the only machinery.",
      "addresses_issue": "i1",
      "key_observation": "No duplication of investigations; regular police not competent."
    },
    {
      "id": "cr4",
      "text": "Dissent by Mudholkar J.: No provision in Act confers power to investigate on special police officer exclusively; s.5(2) CrPC applies subject to Act; 'dealing with offences' does not include investigation.",
      "addresses_issue": "i1",
      "key_observation": "Station house officer can investigate cognizable offences under s.156 CrPC unless excluded; no express exclusion in Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The special police officer is competent to investigate and he and his assistant police officers are the only persons competent to investigate offences under the Act; police officers not specially appointed as special police officers cannot investigate even though offences are cognizable.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kuppammal, In re",
      "citation": "I.L.R. 1959 Mad. 345",
      "treatment": "followed",
      "relevance": "Held that offence under the Act must be investigated only by officers mentioned in s.13; Punjab High Court followed this."
    }
  ],
  "statutes_cited": [
    {
      "name": "Suppression of Immoral Traffic in Women and Girls Act, 1956 (Act CIV of 1956)",
      "sections": [
        "2",
        "3 to 9",
        "8",
        "10",
        "11",
        "12",
        "13",
        "14",
        "15",
        "16",
        "17",
        "18 to 21",
        "22"
      ],
      "relevance": "Creates offences, appoints special police officer for dealing with offences, restricts arrests and searches to special police officer, makes offences cognizable with modifications."
    },
    {
      "name": "Code of Criminal Procedure, 1898 (Act 5 of 1898)",
      "sections": [
        "5",
        "56",
        "57",
        "103",
        "106",
        "112 to 126",
        "156",
        "157",
        "165",
        "187 IPC ref",
        "551",
        "562",
        "563",
        "564",
        "565"
      ],
      "relevance": "General procedure for investigation applies subject to special Act; s.5(2) subordinates CrPC to special enactments regulating investigation."
    },
    {
      "name": "Prevention of Corruption Act, 1947 (Act II of 1947)",
      "sections": [
        "5A"
      ],
      "relevance": "Prohibitive provision restricting investigation to certain ranks; contrasted with language of s.13 of the Act."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "133(1)(c)",
        "134(1)(c)"
      ],
      "relevance": "Certificate granted for appeal to Supreme Court."
    },
    {
      "name": "Indian Penal Code, 1860 (Act 45 of 1860)",
      "sections": [
        "187"
      ],
      "relevance": "Offence for refusing to witness search under s.15(3) of the Act."
    },
    {
      "name": "Police Act",
      "sections": [
        "23"
      ],
      "relevance": "Duties of police officers include detecting offences, but investigation governed by CrPC."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by the Delhi Administration fails and is hereby dismissed. The view of the Magistrate and Punjab High Court upheld that only special police officer can investigate offences under the Act.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the special police officer is competent to investigate and that he and his assistant police officers are the only persons competent to investigate offences under the Act",
      "speaker": "court",
      "significance": "Core holding on exclusive competence for investigation."
    },
    {
      "text": "The Act is a complete Code with respect to what is to be done under it.",
      "speaker": "court",
      "significance": "Justifies exclusion of regular police machinery."
    },
    {
      "text": "There is no provision therein which confers upon the special police officer appointed thereunder the power to investigate into an offence made punishable by the Act.",
      "speaker": "court",
      "significance": "Dissenting view on interpretation of s.13(1)."
    }
  ],
  "_case_id": "1961_356",
  "_label": 0,
  "_text_length": 33579,
  "_extracted_at": "2026-02-10T19:34:43.187157"
}