{
  "metadata": {
    "case_name": "Appellant Firm v. Commissioner of Income-tax",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "KAPUR, J."
    ],
    "case_number": "Civil Appeal No. 424 of 1960",
    "date_of_judgment": "1961-03-13"
  },
  "facts": [
    {
      "id": "f1",
      "text": "A partnership consisting of four persons was formed by a deed of partnership dated March 31, 1949.",
      "type": "background",
      "date": "1949-03-31",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On July 27, 1951 another partner was taken into partnership and a new deed was drawn up. The previous partnership deed was considered as the principal deed. The new partnership like the old one was to end on March 31, 1954.",
      "type": "background",
      "date": "1951-07-27",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On March 29, 1954, a new partnership was entered into and a sixth partner was taken and a new deed was executed. The new partner contributed Rs. 40,000 as his share to the capital but in the partnership deed no express provision was made as to the manner in which profits and losses were to be divided between the partners.",
      "type": "material",
      "date": "1954-03-29",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "A deed of rectification was executed on September 17, 1955, which was after the close of the account year 1954-55. This deed recited that an error had crept in in typing the partnership deed dated March 29, 1954 by omitting to type cl. 21 of the old partnership deed in the new deed. The parties had therefore agreed to rectify the error by adding cl. 20-A as follows: 'The parties shall be entitled to shares in the profits and losses of the firm in proportion to the contribution of the capital of each of the partners and whenever fresh capital is required for the business, each partner shall be liable to contribute the additional capital in the same proportion as the paid up capital referred to in clause 4 of the deed, dated 29th March 1954.'",
      "type": "material",
      "date": "1955-09-17",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Up to the end of assessment year 1954-55 the old firms i.e., the one constituted of four partners and the other constituted of five partners were registered under s. 26A of the Income Tax Act.",
      "type": "admitted",
      "date": "1954-55",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant firm applied for registration for the assessment year 1955-56. The Income Tax Officer pointed out that there was no specification of shares of the partners in the deed of partnership.",
      "type": "procedural",
      "date": "1955-56",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The appellant submitted the deed of rectification dated September 17, 1955, and submitted that the original deed did specify the shares of the partners and the deed of rectification only clarified the position. But the registration was refused by the Income-tax Officer.",
      "type": "procedural",
      "date": "1955-09-17",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "An appeal taken against that order to the Assistant Commissioner was dismissed. Further appeal was taken to the Income-tax Appellate Tribunal which also failed.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "At the request of the appellant the following question was referred to the High Court: 'Whether the assessee firm is entitled to registration u/s. 26-A of the Income-tax Act for the assessment year 1955-56.'",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The High Court held that under s. 26-A of the Act the factual existence in the year of account of an instrument of partnership was necessary, a requisite which was lacking and therefore the provisions of s. 26-A were not satisfied and that the specification of shares only took place on September 17, 1955 when the deed of rectification was executed. The question was answered in the negative.",
      "type": "procedural",
      "date": "1958-03-25",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Against this judgment and order the appellant has come in appeal to this Court by certificate of the High Court.",
      "type": "procedural",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the assessee firm is entitled to registration u/s. 26-A of the Income-tax Act for the assessment year 1955-56.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Cls. 9, 11, 34 and 41a sufficiently specified the shares of the partners and satisfied the requirements of the law.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Clauses 9, 11, 34, 41a of the partnership deed dated March 29, 1954"
    },
    {
      "id": "pa2",
      "text": "The deed of rectification only clarified the position as the original deed did specify the shares of the partners.",
      "supporting_facts": [
        "f4",
        "f6",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "There was no specification of shares of the partners in the deed of partnership until the deed of rectification dated September 17, 1955.",
      "supporting_facts": [
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": "s. 26A of the Income Tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "None of these clauses [9,11,34,41a] specify the shares of the partners. Clause 9 has reference to extra contribution made by the partners which was to be treated as capital contribution for the purpose of dividing profits but was not otherwise taken to be paid up capital. Clause 11 provides for interest on the extra capital subscribed. Clause 34 authorises the senior partner to bring in one or more of his sons as partners who on being so brought in were entitled to remuneration and profits in proportion to their capital contribution. Clause 41a provides that in the event of dissolution of partnership the capital available except for debts etc. was to be paid to the outgoing partners in proportion to the capital contribution of the outgoing partner. But in none of these clauses is it stated what the shares of the partners in the profits and losses of the firm were to be and that in our opinion was requisite for registration of the partnership under s. 26-A of the Act.",
      "addresses_issue": "i1",
      "key_observation": "Clauses do not specify shares in profits and losses"
    },
    {
      "id": "cr2",
      "text": "Registration under s. 26-A confers a benefit on the partners which they would not be entitled to but for s. 26-A. The right can be claimed only in accordance with the statute which confers it and a person seeking relief under that section must bring himself strictly within the terms of that section.",
      "addresses_issue": "i1",
      "key_observation": "Strict compliance required"
    },
    {
      "id": "cr3",
      "text": "Unless the instrument of partnership specified the individual shares of the partners the instrument does not conform to the requirements of the section.",
      "addresses_issue": "i1",
      "key_observation": "Instrument must specify shares"
    },
    {
      "id": "cr4",
      "text": "The instrument of partnership to be registered should have been in existence in the accounting year in respect of which an assessment is being made.",
      "addresses_issue": "i1",
      "key_observation": "Must exist in year of account"
    },
    {
      "id": "cr5",
      "text": "In the present case an instrument of partnership was in existence but it did not specify the shares which was one of the requirements for registration and that condition was fulfilled by the deed of rectification dated September 17, 1955. Therefore it cannot be said that there was the requisite instrument of partnership specifying the individual shares of the partners during the year of account.",
      "addresses_issue": "i1",
      "key_observation": "Rectification after accounting year"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The assessee firm is not entitled to registration u/s. 26-A of the Income-tax Act for the assessment year 1955-56 as the partnership deed dated March 29, 1954 did not specify the individual shares of the partners during the year of account.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ravula Subba Rao v. The Commissioner of Income-tax, Madras",
      "citation": "1956 S.C.R. 577, 588",
      "treatment": "followed",
      "relevance": "Right to registration strictly regulated by terms of s.26A"
    },
    {
      "case_name": "B. C. Mitter Sons V. Commissioner of Income-tax",
      "citation": "1959 36 I.T.R. 194",
      "treatment": "followed",
      "relevance": "Instrument must exist in accounting year; strict compliance required"
    }
  ],
  "statutes_cited": [
    {
      "name": "Income Tax Act",
      "sections": [
        "s. 26A"
      ],
      "relevance": "Requires instrument of partnership specifying individual shares of partners, existing in the year of account for registration"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the judgment and order of the Madras High Court dated March 25, 1958 is dismissed. The High Court was right in holding that the assessee firm is not entitled to registration u/s. 26A for 1955-56 as the partnership instrument did not specify shares during the accounting year.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"None of these clauses specify the shares of the partners... that in our opinion was requisite for registration of the partnership under s. 26-A of the Act and as that was wanting, registration was rightly refused.\"",
      "speaker": "court",
      "significance": "Core reasoning on why clauses insufficient"
    },
    {
      "text": "\"The right can be claimed only in accordance with the statute which confers it and a person seeking relief under that section must bring himself strictly within the term of that section.\"",
      "speaker": "court",
      "significance": "Emphasizes strict compliance with s.26A"
    },
    {
      "text": "\"It is, therefore, essential... that the firms should strictly comply with the requirements of the law, and it is incumbent upon the Income-tax authorities to insist upon full compliance with the requirements of the law.\"",
      "speaker": "court",
      "significance": "Quotes precedent on strict enforcement"
    }
  ],
  "_case_id": "1961_23",
  "_label": 0,
  "_text_length": 9161,
  "_extracted_at": "2026-02-10T19:29:42.416170"
}