{
  "metadata": {
    "case_name": "Burmah Shell Oil Storage and Distributing Co. of India, Ltd. & Standard Vacuum Oil Company v. State of West Bengal",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": "Civil Appeals Nos. 751 of 1957 and 10 of 1958",
    "date_of_judgment": "1960-09-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant-Companies deal in Petroleum and Petroleum products, and carry on business at Calcutta. They maintain supply depots at Dum Dum Airport from which aviation spirit is sold and delivered to aircraft proceeding abroad and belonging to several Companies.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Such sales were treated by the sales tax authorities in the State of Bombay as falling within the taxing Acts in force in the Bombay State by reason of the provisions of Art. 286 of the Constitution.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Sales tax authorities in West Bengal took a different view, assessed tax under the Bengal Motor Spirit Sales Taxation Act, 1941, as amended, presented demand notice, tax paid under protest by appellant Companies.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant Companies filed petitions under Art. 226 in Calcutta High Court questioning legality of imposition, dismissed by D. N. Sinha J. on December 7, 1956.",
      "type": "procedural",
      "date": "1956-12-07",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appeals filed in Supreme Court on certificate under Art. 132.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Case restricted to supplies to aircraft which either proceed to foreign countries directly from Dum Dum Airport, or do so ultimately, though landing en route at some place or places in the Indian territory.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Procedure for supply: Before arrival of aircraft, representative of appellant-Companies applies to Airport Customs Officer to depute Officer to supervise refuelling. After landing, captain or Ground Engineer gives quantity required, permission by Customs, quantity delivered in presence of Customs Officer. Details entered in delivery receipt signed by company representative and Customs Officer. Duty drawback shipping bills drawn up, countersigned, claims for refund of customs duty granted.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Aviation spirit required for consumption during flight and/or outside territory of India, sold in course of export outside territory of India, drawback of customs duty obtained.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Refund of customs duty irrelevant for assessment. Foreign bound aircraft consumes portion of aviation spirit taken at Dum Dum Airport within territory of West Bengal before moving out. Sale takes place within West Bengal, price paid within State, completed by delivery at Dum Dum Airport.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Dum Dum Airport is a Customs Aerodrome, provisions of Sea Customs Act apply mutatis mutandis.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Original Bengal Act did not tax aviation spirit, amended by Second Amendment Act 1954 to include retail sales of motor spirit for aviation at 3 annas per gallon. Further amended 1955 retrospectively to include air in vehicle definition, and 1957 omitting flash point.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "S.22 added post-Constitution per Art. 286, prohibiting tax on sales outside State or in course of import/export.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sales of aviation spirit take place outside the State of West Bengal under Art. 286(1)(a) and the Explanation thereto.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the sales take place in the course of export of goods out of the territory of India under Art. 286(1)(b).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Such sales are made in the course of export of aviation spirit out of the territory of India, take place outside the State of West Bengal, aviation spirit delivered for consumption outside West Bengal, do not fall within Explanation to Art. 286(1)(a), no power to tax unless Explanation sales.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Art. 286(1)(a) and Explanation; Art. 286(1)(b)"
    },
    {
      "id": "pa2",
      "text": "No averment by respondents that aviation spirit delivered for consumption within West Bengal.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Aviation spirit delivered outside customs barrier, taken out of India, sales occasion export.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Definition of export in other Acts; precedents like Bengal Immunity"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sale physically within State, buyer and seller within West Bengal at time of sale, completed by delivery at Dum Dum. Some aviation spirit consumed within West Bengal.",
      "supporting_facts": [
        "f9",
        "f7"
      ],
      "legal_basis": "Art. 286(1)(a); Bengal Immunity Co. v. State of Bihar"
    },
    {
      "id": "ra2",
      "text": "Not inter-State, not in course of export as no foreign purchaser, spirit consumed en route, no bills of lading.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": "Art. 286(1)(b); State of Travancore-Cochin v. Shanmugha Vilas"
    },
    {
      "id": "ra3",
      "text": "Refund of customs duty irrelevant.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Explanation to Art. 286(1)(a) applies only if more than one State involved; here no rival State of delivery for consumption, all elements of sale (contract, delivery, payment) within West Bengal, property passes there, satisfies inside sale test.",
      "addresses_issue": "i1",
      "key_observation": "Explanation discards passing of property test, adopts delivery for consumption test; no other State involved, so West Bengal can tax."
    },
    {
      "id": "cr2",
      "text": "Sale not in course of export under Art. 286(1)(b): requires sale integrated with export to foreign destination where imported; here aviation spirit for consumption on board, no foreign destination/import, sale not occasioning export but for use on journey.",
      "addresses_issue": "i2",
      "key_observation": "Export implies foreign destination; purchases for export preparatory, not integrated unless sale occasions export."
    },
    {
      "id": "cr3",
      "text": "Customs barrier irrelevant for sales tax; duty drawback for customs, sale complete within West Bengal.",
      "addresses_issue": "i1",
      "key_observation": "Customs formalities do not affect situs for sales tax."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sales of aviation spirit occur entirely within State of West Bengal; Art. 286(1)(a) and Explanation inapplicable as no other State involved.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Sales not in course of export out of territory of India under Art. 286(1)(b) as not integrated with export to foreign destination.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bengal Immunity Co., Ltd. v. State of Bihar",
      "citation": "1955 2 S.C.R. 603",
      "treatment": "followed",
      "relevance": "Bans under Art. 286(1)(a) and (b) independent; inter-State sales."
    },
    {
      "case_name": "State of Travancore-Cochin v. Shanmugha Vilas Cashewnut Factory",
      "citation": "1954 S.C.R. 53",
      "treatment": "followed",
      "relevance": "'In the course of export' means sale occasions export, integrated activities, not preparatory."
    },
    {
      "case_name": "State of Bombay v. United Motors (India) Ltd.",
      "citation": "1953 S.C.R. 1069",
      "treatment": "followed",
      "relevance": "Explanation defines inside sale by delivery for consumption test."
    },
    {
      "case_name": "Ramnarain Sons Ltd. v. Asst. Commissioner of Sales Tax",
      "citation": "1955 2 S.C.R. 483",
      "treatment": "followed",
      "relevance": "Explanation determines situs by fiction for transactions within its category."
    },
    {
      "case_name": "State of Travancore-Cochin v. Bombay Co. Ltd.",
      "citation": "1952 S.C.R. 1112",
      "treatment": "followed",
      "relevance": "Meaning of 'in the course of export': integrated with export sale to foreign buyer."
    },
    {
      "case_name": "State of Mysore v. Mysore Spinning and Manufacturing Co. Ltd.",
      "citation": "A.I.R. 1958 S.C. 1002",
      "treatment": "referred",
      "relevance": "Point on 'in the course of export' no longer at large."
    },
    {
      "case_name": "State of Madras v. Gurviah Naidu & Co. Ltd.",
      "citation": "A.I.R. 1956 S.C. 158",
      "treatment": "applied",
      "relevance": "Sales preceding export not necessarily in course unless integral."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 286(1)(a)",
        "Article 286(1)(b)",
        "Article 132",
        "Article 226"
      ],
      "relevance": "Restrictions on State power to tax sales outside State or in course of export; Explanation deems sale in State of delivery for consumption."
    },
    {
      "name": "Bengal Motor Spirit Sales Taxation Act, 1941",
      "sections": [
        "Section 3(4)",
        "Section 22",
        "Definition of motor spirit",
        "Definition of retail sale"
      ],
      "relevance": "Charging section for tax on aviation spirit post-amendments; adapted to Art. 286."
    },
    {
      "name": "Bengal Motor Spirit Sales Taxation (Second Amendment) Act, 1954",
      "sections": [
        "Section 2(a)(i)"
      ],
      "relevance": "Omitted exemption for aviation spirit, added tax at 3 annas per gallon."
    },
    {
      "name": "Bengal Motor Spirit Sales Taxation (Amendment) Act, 1955",
      "sections": [
        "Explanation to motor spirit definition"
      ],
      "relevance": "Retrospectively included air vehicles."
    },
    {
      "name": "Bengal Motor Spirit Sales Taxation (Amendment) Act, 1957",
      "sections": [
        "Definition of motor spirit"
      ],
      "relevance": "Omitted flash point requirement."
    },
    {
      "name": "Indian Aircraft Act, 1934",
      "sections": [
        "Section 16",
        "Section 2(3)",
        "Section 2(4)"
      ],
      "relevance": "Applies Sea Customs Act to air import/export; defines import/export."
    },
    {
      "name": "Sea Customs Act",
      "sections": [
        "Section 42",
        "Section 51",
        "Section 52"
      ],
      "relevance": "Duty drawback on re-export; applicable to Dum Dum as Customs Aerodrome."
    },
    {
      "name": "Indian Aircraft Rules, 1920",
      "sections": [
        "Rule 63 Part IX"
      ],
      "relevance": "Made Dum Dum Customs Aerodrome."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals against the Calcutta High Court judgment upholding sales tax assessment on aviation spirit supplied at Dum Dum Airport to foreign-bound aircraft are dismissed. The sales are held to be entirely within West Bengal, not outside the State under Art. 286(1)(a) or in course of export under Art. 286(1)(b).",
    "relief_granted": null,
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"The Explanation creates a fiction that the sale must be deemed to have taken place in the latter State and not in the State where the sale was completed by reason of passing of property.\"",
      "speaker": "court",
      "significance": "Explains operation of Explanation to Art. 286(1)(a), shifting situs to delivery State."
    },
    {
      "text": "\"It must be inextricably bound up with the export, and a sale or purchase unconnected with the ultimate export as an integral part thereof is not within the exemption.\"",
      "speaker": "court",
      "significance": "Defines 'in the course of export' under Art. 286(1)(b)."
    },
    {
      "text": "\"The crucial fact is the sending of the goods to a foreign destination where they would be received as imports.\"",
      "speaker": "court",
      "significance": "Distinguishes mere taking out from true export."
    }
  ],
  "_case_id": "1961_303",
  "_label": 0,
  "_text_length": 42545,
  "_extracted_at": "2026-02-10T19:34:12.288727"
}