{
  "metadata": {
    "case_name": "First Defendant & Anr. v. Plaintiff (Adopted son of Gurupadappa)",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha, C.J."
    ],
    "case_number": "Civil Appeal No. 324 of 1961",
    "date_of_judgment": "1961-09-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "One N. J. Gamodia of Bombay took on lease a piece of agricultural land measuring about 4-1/2 acres belonging to one Gurupadappa of Devangere City for the purpose of erecting a Ginning and Pressing Cotton Factory.",
      "type": "background",
      "date": "1914-10-26",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Registered lease deed dated October 26, 1914, provided for initial period of 20 years from October 1, 1914 to September 30, 1934, at annual rent of Rs. 350/- in advance; if lessee removes factory before end, still pay rent till end; after 20 years, lessee at liberty to continue as long as desired, paying Rs. 400/- for next 10 years then Rs. 500/- per annum; lessee free to terminate after Oct 1, 1934; lessor binds not to call for possession as long as lessee observes terms.",
      "type": "material",
      "date": "1914-10-26",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Lessee at liberty to erect buildings, factories, etc., make alterations; lessor no objection; lessor pays land assessment, lessee pays conversion taxes; lessee entitled to sublet; lease binding on heirs, executors, successors, assigns.",
      "type": "material",
      "date": "1914-10-26",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "N. J. Gamodia died in 1916 leaving a will appointing executors.",
      "type": "background",
      "date": "1916",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Executors assigned the lease to the second defendant, Gamodia Factories Limited by a deed dated November 27, 1933.",
      "type": "procedural",
      "date": "1933-11-27",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Second defendant continued to pay stipulated rent to lessor Gurupadappa till his death in May 1939.",
      "type": "admitted",
      "date": "1939-05",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Second defendant assigned its leasehold interest to the first defendant by a deed dated May 30, 1944.",
      "type": "procedural",
      "date": "1944-05-30",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Leasehold property contains factory, buildings and residential quarters.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "After lessor's death, his two widows continued to receive rent from lessees.",
      "type": "background",
      "date": "1939-05",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Plaintiff is the adopted son of the original lessor and was a minor till some time in 1949.",
      "type": "background",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Plaintiff issued notices to defendants to terminate tenancy on grounds: 1) lease created tenancy at will; 2) original lessee assigned in contravention of lease terms.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Defendants did not vacate; plaintiff instituted suit for declaration that defendants tenants at will, possession wrongful after notice, for ejectment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Trial court decreed suit: lease for 20 years certain, then tenancy at will terminable by notice; defendants to quit land, road, restore possession after removing machinery but leaving residential quarters.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Lower appellate court affirmed, dismissed appeal, gave 6 months time to vacate.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "High Court in Second Appeal No. 61 of 1954 dismissed appeal dated December 23, 1960: after 20 years, tenancy for indefinite period valid for lifetime of lessee and transferees; but second defendant no longer in possession, assignment to first defendant not binding on plaintiff; confirmed decree, 4 months time to vacate.",
      "type": "procedural",
      "date": "1960-12-23",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "High Court refused certificate for appeal on March 29, 1961.",
      "type": "procedural",
      "date": "1961-03-29",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Special leave granted by Supreme Court on April 20, 1961.",
      "type": "procedural",
      "date": "1961-04-20",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the lease dated October 26, 1914 created a permanent tenancy or a tenancy at will or for lifetime after the initial 20 years.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the assignments of the lease to second defendant and then to first defendant were valid and binding on the plaintiff.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Lease created permanent tenancy on proper construction; it is a building lease without fixed period after 20 years, presumption of permanency; lessee right to surrender does not make it tenancy at will as no corresponding right to lessor.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f8"
      ],
      "legal_basis": "Navalram v. Javerilal; Promada Nath Roy v. Srigobind Chowdhry; Forbes v. Hanuman Bhagat; CIT v. Maharajadhiraj Kumar Visheshwar Singh; Janaki Nath Roy v. Dina Nath Kundu"
    },
    {
      "id": "pa2",
      "text": "Alternatively, if not permanent, then tenancy for lifetime of assignee (second defendant), and first defendant acquired same interest.",
      "supporting_facts": [
        "f5",
        "f7",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "After 20 years, tenancy at will; lessee right to give up possession imports corresponding right to lessor; assignments contravened lease.",
      "supporting_facts": [
        "f2",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Lease for 20 years certain, then lessee liberty to continue as long as desired, paying enhanced rent; lessor bound not to call for possession; heritable, assignable; building lease presumption of permanency not rebutted by lessee's surrender right.",
      "addresses_issue": "i1",
      "key_observation": "Plain construction shows purpose was building lease; no corresponding right to lessor to terminate; permanent tenancy intended."
    },
    {
      "id": "cr2",
      "text": "Distinguished cases like Babasaheb v. West Patent Co.; presumption for building leases; stipulation for lessee surrender benefits lessee, does not derogate permanency.",
      "addresses_issue": "i1",
      "key_observation": "Parties intended permanent lease given substantial structures, heritable/assignable terms, no lessor termination right."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Lease deed evidences intention to create permanent lease.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Navalram v. Javerilal",
      "citation": "1905 7 Bom. L.R. 401",
      "treatment": "followed",
      "relevance": "Presumption of permanent tenancy for building lease where lessor cannot call for possession while rent paid."
    },
    {
      "case_name": "Promada Nath Roy v. Srigobind Chowdhry",
      "citation": "1905 I.L.R. 32 Cal. 648",
      "treatment": "followed",
      "relevance": "Presumption of permanent lease for building purposes even without fixed period."
    },
    {
      "case_name": "Forbes v. Hanuman Bhagat",
      "citation": "1923 I.L.R. 2 Pat. 452",
      "treatment": "followed",
      "relevance": "Applied presumption for building lease."
    },
    {
      "case_name": "Commissioner of Income-tax v. Maharajadhiraj Kumar Visheshwar Singh",
      "citation": "1939 I.L.R. 18 Pat. 805",
      "treatment": "followed",
      "relevance": "No fixed term, heritable provisions support permanent tenancy for building."
    },
    {
      "case_name": "Janaki Nath Roy v. Dina Nath Kundu",
      "citation": "1931 35 C.W.N. 982",
      "treatment": "followed",
      "relevance": "Heritable, assignable building lease without lessor termination right indicates permanency."
    },
    {
      "case_name": "Baboo Lekhraj Roy v. Kunhya Singh",
      "citation": "1877 L.R. 4 I.A. 223",
      "treatment": "referred",
      "relevance": "Indefinite grant enures for lifetime unless hereditary intent; rule inapplicable if fixed term."
    },
    {
      "case_name": "Babasaheb v. West Patent Co., Ltd.",
      "citation": "I.L.R. 1954 Bom. 448",
      "treatment": "distinguished",
      "relevance": "Held indefinite lease for lifetime, but terms weaker than present case lacking full heritable clause."
    }
  ],
  "statutes_cited": [
    {
      "name": "Mysore Rent Act",
      "sections": [],
      "relevance": "Mentioned by appellant counsel but not raised in pleadings or High Court, not permitted in SC."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; held lease creates permanent tenancy; plaintiff's suit for ejectment dismissed; no need to consider other contentions like validity of assignments.",
    "relief_granted": "Defendants' possession upheld as permanent tenants",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the lessor bound himself not to call upon the lessee at any time to give up possession of the lease-hold as long as the lessee was prepared to observe the terms of the lease\"",
      "speaker": "court",
      "significance": "Key stipulation showing no termination right for lessor, supporting permanency."
    },
    {
      "text": "\"This lease is binding on me, my heirs, executors, administrators, successors and assigns as well as on your heirs, executors, administrators, successors and assigns.\"",
      "speaker": "court",
      "significance": "Clause 14 emphasizing heritable and assignable nature."
    },
    {
      "text": "\"on a true and proper construction of the lease deed, the presumption in favour of the transaction creating a permanent lease cannot be held to have been rebutted\"",
      "speaker": "court",
      "significance": "Core holding on construction and presumption."
    }
  ],
  "_case_id": "1961_266",
  "_label": 1,
  "_text_length": 30237,
  "_extracted_at": "2026-02-10T19:33:28.442631"
}