{
  "metadata": {
    "case_name": "Trustees of Temples at Panyam v. Alienees of Inam Lands",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO, J."
    ],
    "case_number": "Civil Appeal No. 752 of 1957",
    "date_of_judgment": "1961-03-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The property in dispute was originally granted in inam to the ancestors of the predecessors-in-interest of the plaintiffs-respondents for the performance of parak service in the temples of village Panyam in Nandyal Taluk of the Kurnool District.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The grantees of the land in this inam alienated a considerable portion of it and also ceased to perform the parak service.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The trustees of the temples at Panyam applied to the Sub-Collector under s. 44-B (2) (a) (i) and (ii) of the Act for the resumption of the lands and their regrant to the temples on the ground that the holders of the inam had alienated the property and had failed to perform the service required of them.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "An inquiry was conducted into these allegations, and it was held by the Revenue Divisional Officer, Nandyal, that the inam had been granted on the condition of parak service being rendered and that there had been breach of the condition on failure to perform the service and also that the lands comprised in the inam had been alienated in a manner falling within s. 44-B (2) (a) (i) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "On these findings the resumption of the inam lands was ordered and the inam was re-granted to the temples in Panyam village.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The alienees took the matter in appeal to the Collector but failed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The alienees filed the suit out of which the present appeal has arisen and their main contention was that the revenue authorities had no jurisdiction to order the resumption of the inam under s. 44-B.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Certain preliminary facts are not in dispute. It has been found by all the courts that the inam grant comprised both the warams.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "It has also been found that the grant to the inamdar was personal to him though burdened with parak service and not a service inam in the sense of the inam constituting emoluments of any office.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On the finding that the inam was a personal inam burdened with service to the temple the trial court held that the case did not fall within s. 44-B of the Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "On appeal the district court confirmed the decree of the trial court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "In the High Court on second appeal the finding as to the inam being of both warams was not contested and it was conceded that it was a personal inam burdened with service.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The High Court held against the trustees and dismissed the appeal (judgment and decree dated January 8, 1954, in Second Appeal No. 312 of 1949).",
      "type": "procedural",
      "date": "1954-01-08",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The trustees who are the appellants applied for a certificate which was granted by the Andhra Pradesh High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a personal inam burdened with service to a temple can be said to come within the meaning of the words 'any inam granted for the performance of a service connected with a temple' in s. 44-B(1) of the Madras Hindu Religious Endowments Act, 1927.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The words used in s. 44-B(1) are of very wide import and any personal grant of land howsoever large, if it is burdened with some service to a temple howsoever small, would be within the meaning of these words and would therefore come within the terms of s.44-B(1). Alternatively, even if the grant was a personal inam burdened with the performance of parak service, the grant was conditional on the performance of the service and as there was breach of this obligation, the resumption and re-grant were justified under s. 44-B.",
      "supporting_facts": [
        "f2",
        "f4",
        "f9"
      ],
      "legal_basis": "s. 44-B(1), s. 44-B(2)(a)(i)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The revenue authorities had no jurisdiction to order the resumption of the inam under s. 44-B as it was a personal inam burdened with service and not a service inam.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "s. 44-B"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The distinction between a grant for an office to be remunerated by the use of land (service grant, resumable when service not performed) and a grant of land burdened with service (personal grant, resumption depends on condition of resumability) is well known in Hindu law.",
      "addresses_issue": "i1",
      "key_observation": "See Shrimant Lakhamgouda Basavprabhu Sardesai v. Raosaheb Baswantrao."
    },
    {
      "id": "cr2",
      "text": "Prior to s. 44-B, enforcement via B.S.O. 54; personal inams burdened with service usually had only service portion resumed, not whole.",
      "addresses_issue": "i1",
      "key_observation": "Background shows distinction maintained."
    },
    {
      "id": "cr3",
      "text": "On introduction of s. 44-B in 1934, B.S.O. 54 amended to divide religious inams into class (a) 'inams granted for the performance of a charity or service connected with a Hindu math or temple' governed by Act, and class (b) others by B.S.O. 54.",
      "addresses_issue": "i1",
      "key_observation": "Not all religious inams with slight connection governed by s. 44-B."
    },
    {
      "id": "cr4",
      "text": "s. 44-B(2)(a)(iii) permits resumption if temple ceases or service impossible; would not apply sensibly to personal inams.",
      "addresses_issue": "i1",
      "key_observation": "Legislature could not intend resumption of personal portion."
    },
    {
      "id": "cr5",
      "text": "s. 44-B(2)(f)(i) re-grants resumed inam to temple, presuming whole was for service; s. 44-B(2)(f)(ii) to Board if temple gone.",
      "addresses_issue": "i1",
      "key_observation": "Overlooks personal element in burdened grants."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s. 44-B(1) is confined to inams directly granted to the temple or service inams for the purpose of a temple or math or inams the whole of the income of which is meant for charity and does not include personal inams burdened with service.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Such personal inams burdened with service continue to be dealt with under B.S.O. 54, class (b).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shrimant Lakhamgouda Basavprabhu Sardesai v. Raosaheb Baswantrao alias Annasaheb Subedar and Others",
      "citation": "1931 LXI M.L.J. 449",
      "treatment": "referred",
      "relevance": "Distinction between service grant and personal grant burdened with service; resumption depends on condition."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Hindu Religious Endowments Act No. II of 1927",
      "sections": [
        "s. 44-B(1)",
        "s. 44-B(2)(a)(i)",
        "s. 44-B(2)(a)(iii)",
        "s. 44-B(2)(f)(i)",
        "s. 44-B(2)(f)(ii)"
      ],
      "relevance": "Interpretation of scope for resumption and regrant of certain inams; does not cover personal inams burdened with service."
    },
    {
      "name": "Board's Standing Order 54",
      "sections": [
        "para. 1",
        "para. 2"
      ],
      "relevance": "Prior mechanism for enforcement of conditions in religious inams; amended post s.44-B to handle non-class (a) inams."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by the trustees against the High Court's dismissal of their second appeal is dismissed, upholding that revenue authorities lacked jurisdiction under s.44-B to resume the personal inam burdened with service; such inams governed by B.S.O. 54.",
    "relief_granted": "Suit decree in favor of plaintiffs-respondents (alienees) confirmed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The distinction between a grant for an office to be remunerated by the use of land and a grant of land burdened with service is well known in Hindu law.\"",
      "speaker": "court",
      "significance": "Core distinction determining scope of s.44-B."
    },
    {
      "text": "\"We therefore agree with the High Court that this history affords a clue to the interpretation of s. 44-B(1) and suggests that though the words used in s. 44-B are open to a wide interpretation, the intention was to bring within its purview only those inams which were granted directly to the temple and also those inams which were granted for the performance of a charity or service connected with a math or temple.\"",
      "speaker": "court",
      "significance": "Rejects wide interpretation based on legislative history."
    },
    {
      "text": "\"s. 44-B(1), though on a wide interpretation it might also include personal inams burdened with service, is really confined to inams directly granted to the temple or service inams for the purpose of a temple or math or inams the whole of the income of which is meant for charity and does not include personal inams burdened with service.\"",
      "speaker": "court",
      "significance": "Final holding on scope of provision."
    }
  ],
  "_case_id": "1961_189",
  "_label": 0,
  "_text_length": 13385,
  "_extracted_at": "2026-02-10T19:31:53.752895"
}