{
  "metadata": {
    "case_name": "Messrs. Nand Lal Raj Kishan v. Respondents",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das"
    ],
    "case_number": "ORIGINAL JURISDICTION Petition No. 77 of 1958",
    "date_of_judgment": "1961-03-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The petitioners, Messrs. Nand Lal Raj Kishan, carry on a business of commission agents at Delhi and are liable to pay sales tax under the Bengal Finance Sales Tax Act, 1941, as in force in Delhi.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Petitioners filed returns for four quarters of 1954-55 and claimed exemption in respect of sales of certain goods to registered dealers under s.5(2)(a)(ii) of the Act.",
      "type": "procedural",
      "date": "1954-1955",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "By order dated April 11, 1956, Sales Tax Officer disallowed the exemption on ground that sales were to registered dealers whose activities had gone underground and issued demand notice for Rs. 1,11,890-11-0.",
      "type": "procedural",
      "date": "1956-04-11",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Petitioners appealed to Assistant Commissioner of Sales Tax, Delhi, who set aside STO order and remanded for fresh decision in light of Chief Commissioner's judgments in similar cases.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Bengal Finance Sales Tax Act, 1941 amended by Bengal Finance Sales Tax (Delhi) Amendment Act, 1956 (Act No. 17 of 1956), effective October 27, 1956, inserting s.8A.",
      "type": "background",
      "date": "1956-10-27",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On May 17, 1957, petitioners applied for fresh registration certificate as original lost in transit and addition of items like cigarettes, bidis and glass.",
      "type": "procedural",
      "date": "1957-05-17",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Sales Tax Officer enquired and found petitioners frequently shifting business places; sales to some registered dealers not genuine as persons could not be traced at addresses.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "STO reported to Commissioner of Sales Tax, Delhi; Commissioner directed issuance of notice.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "On July 13, 1957, notice issued to petitioners to show cause why not furnish security of Rs. 10,000 u/s 8A.",
      "type": "procedural",
      "date": "1957-07-13",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Petitioners appeared before STO, stated not prepared to deposit security, filed written explanation objecting to demand.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Commissioner considered STO report and petitioners' explanation; found necessity for security due to reputation of selling to unscrupulous dealers, frequent changes in name/place of business without details, late submission of returns for 1956-57.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "On November 27, 1957, Commissioner ordered petitioners to furnish security of Rs. 5,000 by December 15, 1957.",
      "type": "procedural",
      "date": "1957-11-27",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Petitioners filed revision to Chief Commissioner, Delhi, who dismissed it on April 15, 1958.",
      "type": "procedural",
      "date": "1958-04-15",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Petitioners' writ petition in Punjab High Court summarily dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Present writ petition under Art. 32 filed impugning Commissioner's order dated November 27, 1957 on ground of invalidity of s.8A.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether s.8A gives undefined, unlimited and unrestricted power to the Commissioner of Sales Tax.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether s.8A fixes no limit with regard to the amount of security which may be demanded.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether s.8A imposes unreasonable restriction on right to carry on business as it provides no enquiry or opportunity of hearing before demand for security.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "s.8A gives undefined, unlimited and unrestricted power to Commissioner.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No limit fixed for amount of security demanded under s.8A.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "s.8A imposes unreasonable restriction on business right, no enquiry or hearing provided before order.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "No oral hearing given by Commissioner; order passed without hearing petitioners.",
      "supporting_facts": [
        "f10",
        "f11",
        "f12"
      ],
      "legal_basis": "principles of natural justice"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.8A does not give unlimited power; Commissioner may demand security only if necessary for proper realisation of tax, reasons to be recorded.",
      "addresses_issue": "i1",
      "key_observation": "Power conditioned by necessity for proper realisation of tax."
    },
    {
      "id": "cr2",
      "text": "Distinguishes Dwarka Prasad case as there power was absolute without guidance; here s.8A provides guidance.",
      "addresses_issue": "i1",
      "key_observation": "Ratio of Dwarka Prasad does not apply where statute conditions exercise of power."
    },
    {
      "id": "cr3",
      "text": "Amount of security must relate to tax liability, depend on business nature, turnover; subject to revision by Chief Commissioner.",
      "addresses_issue": "i2",
      "key_observation": "Power not unlimited even in amount."
    },
    {
      "id": "cr4",
      "text": "Principles of natural justice apply; opportunity given via notice by STO, written explanation, oral submissions considered by Commissioner; no need for second oral hearing by Commissioner.",
      "addresses_issue": "i3",
      "key_observation": "No violation of natural justice; petitioners had opportunity and raised objections which were considered."
    },
    {
      "id": "cr5",
      "text": "Power to levy tax includes reasonable safeguards like security for proper payment; s.7(4)(a)(i) similar, approved in Durga Prasad Khaitan.",
      "addresses_issue": "i1",
      "key_observation": "Demanding security is not arbitrary or unreasonable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s.8A is constitutionally valid; does not confer unlimited/unrestricted power, amount reasonable and related to tax, natural justice complied with.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No limit issue as amount tied to tax liability and revisable.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Opportunity of hearing provided; no violation of natural justice.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dwarka Prasad Laxmi Narain v. State of Uttar Pradesh",
      "citation": "1954 S.C.R. 803",
      "treatment": "distinguished",
      "relevance": "Distinguished as there absolute power without guidance; not applicable here."
    },
    {
      "case_name": "Virendra v. State of Punjab",
      "citation": "1958 S.C.R. 308, 321",
      "treatment": "referred",
      "relevance": "Ratio of Dwarka Prasad does not apply where statute conditions power."
    },
    {
      "case_name": "Kishan Chand Arora v. Commissioner of Police, Calcutta",
      "citation": "1961 3 S.C.R. 135",
      "treatment": "followed",
      "relevance": "Reiterated view that Dwarka Prasad ratio inapplicable if power conditioned by statute."
    },
    {
      "case_name": "Durga Prasad Khaitan v. Commercial Tax Officer",
      "citation": "1937 8 S.T.C. 105",
      "treatment": "approved",
      "relevance": "s.7(4)(a)(i) does not confer unfettered power; security demand reasonable safeguard."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bengal Finance Sales Tax Act, 1941 (as in force in Delhi)",
      "sections": [
        "s.5(2)(a)(ii)",
        "s.8A",
        "s.7(4)(a)(i)"
      ],
      "relevance": "Governs sales tax liability, exemptions, security for tax realisation."
    },
    {
      "name": "Bengal Finance Sales Tax (Delhi) Amendment Act, 1956",
      "sections": [
        "Act No. 17 of 1956"
      ],
      "relevance": "Inserted s.8A effective October 27, 1956."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 32"
      ],
      "relevance": "Basis for writ petition for enforcement of fundamental rights."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court held that s.8A is constitutionally valid, rejected all challenges, upheld the Commissioner's order demanding security, and agreed with Chief Commissioner that no violation of natural justice occurred.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"We do not think that these grounds have any substance.\"",
      "speaker": "court",
      "significance": "Court's dismissal of constitutional challenges to s.8A."
    },
    {
      "text": "\"the Commissioner may exercise his power of demanding security only when he considers it necessary to do so for the proper realisation of the tax levied under the Act.\"",
      "speaker": "court",
      "significance": "Key limitation on Commissioner's power under s.8A."
    },
    {
      "text": "\"the principles of natural justice would apply and the person to whose prejudice the order is to be made must be given an opportunity to say whatever he has to say in his defence.\"",
      "speaker": "court",
      "significance": "Affirmation that natural justice was followed."
    }
  ],
  "_case_id": "1961_25",
  "_label": 0,
  "_text_length": 12020,
  "_extracted_at": "2026-02-10T19:29:52.624278"
}