{
  "metadata": {
    "case_name": "Balakrishnan v. Daughters of Viswanatha Iyer",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO, J."
    ],
    "case_number": "Civil Appeal No. 86 of 1957",
    "date_of_judgment": "1961-02-24"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Viswanatha Iyer died in 1927 leaving properties, no male issue but two minor daughters surviving him.",
      "type": "background",
      "date": "1927",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Viswanatha had a brother Seetharama Iyer who died in 1934.",
      "type": "background",
      "date": "1934",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant Balakrishnan is the third son of Seetharama Iyer, treated as foster son (abhimanputra) by Viswanatha and was minor at time of Viswanatha's death.",
      "type": "background",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Viswanatha made a will on October 4, 1927 appointing Seetharama guardian of minor daughters and foster son, left management of properties to Seetharama.",
      "type": "material",
      "date": "1927-10-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Will provided that upon daughters attaining majority, Seetharama give each one veli of nanja land and one veli of punja land in vattam No. 149 in village Nagampadi; deliver remaining properties to Balakrishnan upon his majority; pay income from properties to minor daughters after testator's death.",
      "type": "material",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "After Viswanatha's death, Seetharama remained in possession of entire properties; after Seetharama's death, Balakrishnan came into possession.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "After daughters married and attained majority, Balakrishnan paid them certain monies from income in May 1942, thereafter annually 224 kalam of paddy and Rs. 175 in cash after deducting kist.",
      "type": "admitted",
      "date": "1942-05",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In 1949, daughters claimed possession of their lands, entitled to select respective one veli nanja and one veli punja from vattam 149.",
      "type": "disputed",
      "date": "1949",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Appellant did not accept daughters' right of selection, contended they entitled to lands accounting for good and bad quality.",
      "type": "disputed",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Appellant contended that on construction of will, Seetharama to give such land as he chose to daughters, not daughters to select.",
      "type": "disputed",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Daughters filed suit in July 1949 claiming properties in Schedules A and D of plaint out of vattam 149 based on their selection.",
      "type": "procedural",
      "date": "1949-07",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Suit resisted by appellant who was prepared for partition according to quality but not selection.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Trial court upheld daughters' contention and decreed suit.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appeal to Madras High Court in A.S. No. 673 of 1950 dismissed; judgment dated April 13, 1955.",
      "type": "procedural",
      "date": "1955-04-13",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Appellant obtained certificate from Madras High Court for appeal to Supreme Court.",
      "type": "procedural",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Vattam No. 149 has 21.38 acres nanja land and 16.99 acres punja land; each daughter given 6.66 acres each of nanja and punja.",
      "type": "material",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the legatees have a right to make a selection in a case of this kind.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether on construction of the will the right of selection was in Seetharama or in the legatees.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "English rule of construction giving right of selection to devisee should not apply in India; evolved to avoid uncertainty but s.89 Indian Succession Act provides wills not expressive of definite intention void for uncertainty.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Section 89, Indian Succession Act, 1925"
    },
    {
      "id": "pa2",
      "text": "On construction of will, Seetharama to select and give lands to daughters; words 'he shall give to the female children' indicate Seetharama's selection; daughters entitled to partition accounting for good and bad quality.",
      "supporting_facts": [
        "f5",
        "f9",
        "f10",
        "f16"
      ],
      "legal_basis": "Construction of the will"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Legatees entitled to select their lands from vattam 149 as per their claim.",
      "supporting_facts": [
        "f8",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S.89 ISA applies only where will so indefinite no definite intention possible; English benevolent rule of selection by legatee applies where intention clear but uncertainty in identification resolvable by selection; three cases: testator selects, nominates third person, or legatee selects.",
      "addresses_issue": "i1",
      "key_observation": "Rule is common sense to effectuate testator's intention; applies to India in appropriate cases."
    },
    {
      "id": "cr2",
      "text": "Cited English cases (Hobson v. Blackburn, Peck v. Halsey, Tapley v. Eagleton, Duckmanton v. Duckmanton, Knapton v. Hindle) support legatee selection; Indian cases (Narayanaswami Gramani) follow; distinguished Bharadwaja Mudaliar (legatee died without selecting); Asten v. Asten and Bishop v. Holt not applicable as testator intended own selection.",
      "addresses_issue": "i1",
      "key_observation": "Rule avoids litigation; applicable even with partition modes available."
    },
    {
      "id": "cr3",
      "text": "On will construction, no express words give Seetharama selection right; 'he shall give to female children' means deliver possession as guardian upon majority, same as 'deliver possession to my son'; no indication of partition by quality or Seetharama selection.",
      "addresses_issue": "i2",
      "key_observation": "Falls in third class: daughters select to make gift certain."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "English benevolent rule of construction applies in India: where testator's intention to gift clear but property identification uncertain and resolvable by selection, legatee has right to select.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "On construction of will, no right of selection in Seetharama; daughters (legatees) entitled to select one veli each of nanja and punja land from vattam No. 149.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hobson v. Blackburn",
      "citation": "1833 1 MY K. 571 39 E.R. 797",
      "treatment": "followed",
      "relevance": "Devise of message and ten acres surrounding it out of larger area; choice in devisee."
    },
    {
      "case_name": "Peck v. Halsey",
      "citation": "1726 2 P. Wms. 387 24 E.R. 780",
      "treatment": "followed",
      "relevance": "Principle evolved: 'some of my best linen' good if choice by legatees or executors."
    },
    {
      "case_name": "Tapley v. Eagleton",
      "citation": "1879 12 Ch D 683",
      "treatment": "followed",
      "relevance": "Two houses out of three in King Street; legatee elects which two."
    },
    {
      "case_name": "Duckmanton v. Duckmanton",
      "citation": "1860 5 N. 219 157 E.R. 1165",
      "treatment": "followed",
      "relevance": "One close out of two to each son; election with first choice to first devisee."
    },
    {
      "case_name": "Knapton v. Hindle",
      "citation": "1941 Ch. 428",
      "treatment": "followed",
      "relevance": "One house each to nephews/nieces without names; choice by them or lots."
    },
    {
      "case_name": "Narayanaswami Gramani Periathambi Gramani",
      "citation": "1895 I.L.R. 18 Mad. 460",
      "treatment": "followed",
      "relevance": "One kani out of more; devisee right to choose."
    },
    {
      "case_name": "Bharadwaja Mudaliar v. Kolandavelu Mudaliar",
      "citation": "1915 29 M.L.J. 717",
      "treatment": "distinguished",
      "relevance": "Six acres good nanja out of more; heir not entitled to select after legatee death; partition instead."
    },
    {
      "case_name": "Asten v. Asten",
      "citation": "1894 3 Ch. D. 260",
      "treatment": "distinguished",
      "relevance": "Identical descriptions of houses to multiple sons; void for uncertainty as testator intended own selection."
    },
    {
      "case_name": "Bishop v. Holt",
      "citation": "1900 2 Ch. D. 620",
      "treatment": "distinguished",
      "relevance": "140 shares out of fully/partly paid; testatrix's selection inferable from holdings."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Succession Act, 1925",
      "sections": [
        "Section 89"
      ],
      "relevance": "Will void for uncertainty only if no definite intention ascertainable; does not preclude benevolent construction where intention clear but identification uncertain."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed upholding trial court and High Court decrees; daughters entitled to select their specified lands from vattam No. 149 as per will.",
    "relief_granted": "Daughters' suit decreed; right to possession of selected properties confirmed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the English rule of construction that a legatee has a right to choose in such circumstances applies to India also\"",
      "speaker": "court",
      "significance": "Holds English benevolent rule applicable in India."
    },
    {
      "text": "\"where the uncertainty is of a less degree and the intention of the testator to gift certain property is clear... the benevolent rule should be applied\"",
      "speaker": "court",
      "significance": "Distinguishes s.89 ISA and justifies rule application."
    },
    {
      "text": "\"the testator intended that each daughter will select the land devised out of the vattam.\"",
      "speaker": "court",
      "significance": "Construction of will favoring daughters' selection right."
    }
  ],
  "_case_id": "1961_284",
  "_label": 0,
  "_text_length": 22724,
  "_extracted_at": "2026-02-10T19:34:11.215288"
}