{
  "metadata": {
    "case_name": "Jaisri Sahu v. Reversioners (Rajdewan Dubey and others)",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar, J."
    ],
    "case_number": "Civil Appeals Nos. 645 and 646 of 1957",
    "date_of_judgment": "1961-04-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Prithi Dubey died on July 14, 1932, leaving his widow Laung Kuer, who succeeded as heir to his estate.",
      "type": "background",
      "date": "1932-07-14",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Laung Kuer executed a Zerpeshgi deed on June 21, 1935, in favour of Rajdewan Dubey and Kailash Dubey (next reversioners) for Rs. 1,100 to discharge debts due by the deceased. This deed is not in dispute and is binding on the reversioners.",
      "type": "material",
      "date": "1935-06-21",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On June 17, 1943, Laung Kuer sold a portion of the properties subject to the Zerpeshgi deed to the appellant (Jaisri Sahu) for Rs. 1,600: Rs. 1,100 reserved with purchaser for redemption of Zerpeshgi, Rs. 500 paid in cash (Rs. 100 for repairs to family dwelling house, Rs. 200 for purchasing two bulls for agricultural purposes, Rs. 200 for repairing a well constructed by deceased for public use).",
      "type": "material",
      "date": "1943-06-17",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant sought to redeem the Zerpeshgi, but Zerpeshgidars refused to receive amount and surrender possession. Appellant deposited mortgage amount in court under s. 83 of Transfer of Property Act and instituted Title Suit No. 69 of 1944 for redemption.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Reversioners (respondents Nos. 1 to 4) filed Title Suit No. 126 of 1943 for declaration that the sale deed in favour of appellant was not binding on reversioners.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Both suits tried together by District Munsif of Palamau. Key issue: whether sale in favour of appellant supported by necessity and binding on reversioners.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "District Munsif held necessity established for all four items of consideration, sale binding on reversioners; dismissed Title Suit No. 126/1943, granted redemption decree in Title Suit No. 69/1944. Found appellant acted in good faith.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Respondents appealed both decrees; Subordinate Judge of Palamau affirmed findings, dismissed appeals.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Respondents filed Second Appeals Nos. 2155 and 2156 of 1948 in Patna High Court.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Laung Kuer died on March 14, 1952; plaint in Title Suit No. 126/1943 amended to add reliefs for possession and mesne profits.",
      "type": "procedural",
      "date": "1952-03-14",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Patna High Court (Rai and Misra, JJ.) held sale deed not binding on reversioners, following Dasrath Singh v. Damri Singh; allowed Second Appeals, consequential reliefs granted.",
      "type": "procedural",
      "date": "1956-08",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court granted certificates under Art. 133(1)(c) noting conflict between Dasrath Singh and Lala Ram Asre Singh cases, and question of practice on conflicting decisions.",
      "type": "procedural",
      "date": "1956-11-27",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a sale by a widow of properties subject to usufructuary mortgage (where mortgagee cannot sue for recovery) is binding on reversioners if supported by necessity.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Practice to be followed by a Bench of High Court when there is a conflict between decisions of previous Benches of the same court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sale supported by necessity for all items; binding on reversioners as per findings of lower courts; follows Lala Ram Asre Singh v. Ambica Lal.",
      "supporting_facts": [
        "f3",
        "f7",
        "f8"
      ],
      "legal_basis": "Hindu law on widow's powers to alienate for necessity"
    },
    {
      "id": "pa2",
      "text": "Appellant acted bona fide, paid Rs. 500 cash and deposited Rs. 1,100 for redemption.",
      "supporting_facts": [
        "f3",
        "f4",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sale deed not binding on reversioners as widow cannot sell properties subject to usufructuary mortgage, jeopardising reversioners' right to redeem; follows Dasrath Singh v. Damri Singh.",
      "supporting_facts": [
        "f2",
        "f3",
        "f11"
      ],
      "legal_basis": "Dasrath Singh v. Damri Singh (AIR 1927 Pat 219)"
    },
    {
      "id": "ra2",
      "text": "Sale not bona fide.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Necessity established for all items by lower courts' findings of fact, binding in second appeal.",
      "addresses_issue": "i1",
      "key_observation": "District Munsif and Subordinate Judge held sale proper and binding."
    },
    {
      "id": "cr2",
      "text": "Widow as full owner (not trustee) can alienate for necessity; no absolute bar on selling mortgaged property if prudent; Dasrath Singh wrong, Lala Ram Asre correct.",
      "addresses_issue": "i1",
      "key_observation": "Widow has discretion on form of alienation (sale/mortgage) if necessity exists."
    },
    {
      "id": "cr3",
      "text": "Bona fides of appellant established by District Munsif, not challenged on appeal.",
      "addresses_issue": "i1",
      "key_observation": "Relatives' spoliation does not affect bona fide purchaser."
    },
    {
      "id": "cr4",
      "text": "When conflict between benches, later bench should refer to Full Bench, not choose; earlier decision not necessarily preferred.",
      "addresses_issue": "i2",
      "key_observation": "Maintain certainty of law; subordinate courts need guidance."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sale by widow of property subject to usufructuary mortgage is binding on reversioners if supported by necessity.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Decision in Dasrath Singh v. Damri Singh held wrong; Lala Ram Asre Singh case followed.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Bench facing conflicting decisions of co-ordinate benches should refer to Full Bench.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dasrath Singh v. Damri Singh",
      "citation": "8 Pat. L.T. 314; A.I.R. 1927 Pat. 219",
      "treatment": "overruled",
      "relevance": "Held that widow cannot sell usufructuary mortgaged property; Supreme Court holds this wrong."
    },
    {
      "case_name": "Lala Ram Asre Singh v. Ambica Lal",
      "citation": "11 Pat. L.T. 6; A.I.R. 1929 Pat. 216",
      "treatment": "followed",
      "relevance": "Widow can sell mortgaged property for necessity despite mortgagee in possession."
    },
    {
      "case_name": "Collector of Masulipatam v. Cavaly Venkata",
      "citation": "1861 8 M.I.A. 529",
      "treatment": "referred",
      "relevance": "Crown takes escheated property free from invalid widow's alienations."
    },
    {
      "case_name": "Hanooman Persaud v. Mussamat Babooee",
      "citation": "1856 6 M.I.A. 393",
      "treatment": "followed",
      "relevance": "Widow's powers like manager of infant's estate."
    },
    {
      "case_name": "Venkaji v. Vishnu",
      "citation": "1894 18 Bom. 534",
      "treatment": "followed",
      "relevance": "Widow allowed reasonable latitude if acting fairly to heirs."
    },
    {
      "case_name": "Viraraju v. Venkataratnam",
      "citation": "I.L.R. 1939 Mad. 226",
      "treatment": "followed",
      "relevance": "Form of alienation left to widow's reasonable discretion."
    },
    {
      "case_name": "Buddha Singh v. Laltu Singh",
      "citation": "1915 I.L.R. 37 All. 604 (Privy Council)",
      "treatment": "referred",
      "relevance": "Procedure when benches differ: refer to Full Bench."
    },
    {
      "case_name": "Seshamma v. Venkata Narasimharao",
      "citation": "I.L.R. 1940 Mad. 454",
      "treatment": "followed",
      "relevance": "Division Bench bound by previous unless refer to Full Bench."
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act",
      "sections": [
        "s. 83"
      ],
      "relevance": "Deposit of mortgage amount by appellant to redeem."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 133(1)(c)"
      ],
      "relevance": "Certificate granted by High Court for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeals, set aside Patna High Court judgment, restored decrees of trial court (District Munsif affirmed by Subordinate Judge) holding sale binding on reversioners and granting redemption.",
    "relief_granted": "Decree for redemption in Title Suit No. 69/1944; declaration sale binding, dismissal of Title Suit No. 126/1943.",
    "costs": "Costs throughout."
  },
  "key_quotes": [
    {
      "text": "\"When a widow succeeds as heir to her husband, the ownership in the properties, both legal and beneficial, vests in her. She fully represents the estate...\"",
      "speaker": "court",
      "significance": "Clarifies widow's full ownership, not trustee for reversioners."
    },
    {
      "text": "\"Judged by these principles, when there is a mortgage subsisting on the property, the question whether the widow could sell it... is a question which must be determined on the facts of each case, there being no absolute prohibition.\"",
      "speaker": "court",
      "significance": "Holds no absolute bar on widow selling mortgaged property for necessity."
    },
    {
      "text": "\"The Division Bench is the final Court of appeal... one Division Bench should regard itself bound by the decision of another Division Bench on a question of law... refer to Full Bench.\"",
      "speaker": "court",
      "significance": "Lays down practice for conflicting High Court bench decisions."
    }
  ],
  "_case_id": "1961_37",
  "_label": 1,
  "_text_length": 21555,
  "_extracted_at": "2026-02-10T19:29:57.033568"
}