{
  "metadata": {
    "case_name": "Municipal Committee, Raipur v. Respondents",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeals Nos. 356 and 357 of 1961",
    "date_of_judgment": "1960-10-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents carry on business of extraction of oil from oil seeds and brought sarso oil seeds within the area of the Municipal Committee, Raipur for purposes of their business.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Municipal Committee demanded ad valorem octroi duty of Rs. 4-11-0 per cent on sarso oil seeds under item 44 of the Schedule of goods liable to octroi duty appended to Rules framed on June 4, 1951.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Respondents contended that duty of 2 annas per maund was leviable under item 4 of the same Schedule, which covered oil seeds.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Respondents made representations described as appeals, but were unsuccessful; demand for refund of octroi duty paid was refused.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Respondents filed petitions under Art. 226 of the Constitution in the High Court of Nagpur (later Madhya Pradesh) alleging imposition ultra vires under Art. 14 and that duty properly leviable under item 4, not item 44.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "In petition leading to Civil Appeal No. 356 of 1961, single Judge held sarso oil seeds chargeable under item 44, not item 4; constitutional question not urged before him.",
      "type": "procedural",
      "date": "1959-10-16",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Letters Patent Appeal (L.P.A. No. 93 of 1957) heard by Division Bench, which disagreed with single Judge and held duty leviable only under item 4; constitutional question not argued before Division Bench.",
      "type": "procedural",
      "date": "1960-02-16",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Petition leading to Civil Appeal No. 357 of 1961 (Misc. Petition No. 254 of 1959) heard by Division Bench, which followed earlier decision against Municipal Committee.",
      "type": "procedural",
      "date": "1960-02-16",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Schedule has eight classes, 67 items; Class I: Articles of food or drink or use for men or animals; Item 4: 'Oil-seeds of every description not specifically mentioned elsewhere' at 2 annas per maund.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Class V: Drugs, spices and gums, toilet requisites and perfumes; Item 44: 'Betel-nuts, gums, spices, Indian herbs and Indian raw medicines and drugs, such as nuts, ilaichi, laung, jaiphal, jaipatri, dalchini, sont, katha, zeera, Dhania garlic, dry chillies, pepper, shahzeera, maithi, sarso, etc. and known as kirana groceries' at ad valorem Rs. 4-11-0 per cent.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Item 17: 'Vegetable oils not hydrogenated provided elsewhere such as Tilli Tel, Sarso Tel, Alsi Tel, Falli Tel, Narial Tel, Andi Tel' at 4 annas per maund.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Sarso is an oil seed; if nothing more, duty of 2 annas per maund under item 4.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Sarso sold as kirana and as a spice.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Affidavit of respondents: one maund of sarso oil expressed from three maunds of oil seed; price of sarso Rs. 30 per maund.",
      "type": "material",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether sarso oil seeds are chargeable to octroi duty under item 4 (2 annas per maund) or item 44 (ad valorem Rs. 4-11-0 per cent) of the Schedule, given the phrase 'not specifically mentioned elsewhere' in item 4 and mention of sarso in item 44.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Words 'not specifically mentioned elsewhere' in item 4 exclude sarso from that item since specifically mentioned in item 44, making it liable to higher duty under item 44; serial numbers consecutive, so mention anywhere in Schedule applies.",
      "supporting_facts": [
        "f2",
        "f9",
        "f10",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Classes I and V entirely different (food/drink vs. drugs/spices); specific mention elsewhere must be as oil-seeds in same manner as item 4 framed; sarso in item 44 as spice or kirana, not oil seed.",
      "supporting_facts": [
        "f9",
        "f10",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Elsewhere meant elsewhere in same Class.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Division Bench right: specific mention elsewhere must be as oil seeds, not as something else; Class V deals with spices/groceries, item 44 ambit determined by 'known as kirana'; sarso mentioned there as spice/drug/herb/kirana, not oil seed.",
      "addresses_issue": "i1",
      "key_observation": "Extent of item 4 (oil seeds of every description) cut down only by specific mention elsewhere as oil seed."
    },
    {
      "id": "cr2",
      "text": "Each item in item 44 referable to heading as drug/spice/gum etc.; if intended to tax sarso as oil seed specially, expect specific mention as oil seed with different duty, not indirect via kirana list.",
      "addresses_issue": "i1",
      "key_observation": "Take into account intention behind bye-law."
    },
    {
      "id": "cr3",
      "text": "Anomaly: sarso oil (from 3 maunds seed) duty 4 annas/maund under item 17, while 3 maunds seed under item 44 would bear Rs. 4-3-6, could not have been intended.",
      "addresses_issue": "i1",
      "key_observation": "No logic behind tax but anomaly noted."
    },
    {
      "id": "cr4",
      "text": "If doubt, resolve in favour of taxpayer.",
      "addresses_issue": "i1",
      "key_observation": "Divisional Bench properly resolved doubt in favour of taxpayer."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sarso oil seeds chargeable to duty only under item 4 at 2 annas per maund, not item 44.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 14"
      ],
      "relevance": "Petitions filed under Art. 226 alleging ultra vires under Art. 14, though constitutional question not substantially argued."
    },
    {
      "name": "Raipur Municipality Rules/Byelaws",
      "sections": [
        "Schedule Items 4, 17, 44"
      ],
      "relevance": "Interpretation of octroi duty schedule for classification of sarso oil seeds."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court agreed with Division Bench of Madhya Pradesh High Court that octroi duty on sarso oil seeds leviable only under item 4 at 2 annas per maund, dismissing appeals by Municipal Committee, Raipur.",
    "relief_granted": "Duty properly under item 4; refund implications from High Court orders upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the specific mention elsewhere must be as oil seeds and not as something else.\"",
      "speaker": "court",
      "significance": "Core reasoning for interpreting 'not specifically mentioned elsewhere' in item 4."
    },
    {
      "text": "\"if there be any doubt, the Divisional Bench of the High Court very properly resolved it in favour of the taxpayer.\"",
      "speaker": "court",
      "significance": "Principle applied to resolve ambiguity in tax levy."
    }
  ],
  "_case_id": "1961_419",
  "_label": 0,
  "_text_length": 7861,
  "_extracted_at": "2026-02-10T19:35:58.324057"
}