{
  "metadata": {
    "case_name": "Burmah Construction Company v. State of Orissa",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 494 of 1960",
    "date_of_judgment": "1961-10-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Messrs. Burmah Construction Company, a firm carrying on business as building and works contractors, executed several contracts in the State of Orissa for construction of buildings, roads, bridges etc.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellants were registered as dealer in Orissa under the Orissa Sales Tax Act, 1947 from the quarters ending June 30, 1949.",
      "type": "background",
      "date": "1949-06-30",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Sales Tax officers treating the transfer of the materials used in the construction of the buildings, roads and bridges, as sale of goods, assessed the appellants to tax under the Orissa Sales Tax Act.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The tax so assessed under diverse orders of assessment was paid from time to time. For the quarters ending June 30, 1949, to March 31, 1954, the appellant paid Rs. 1,17,869-80 as tax and Rs. 2,917-11-0 as penalty. Total Rs. 1,20,787-3-6.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Table sets out the tax and penalty paid to the Sales Tax Authorities for the twenty quarters: [detailed table with circles, registration nos., tax and penalty amounts].",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Relying upon the judgment of the Madras High Court in Gannon Dunkerley Co. Ltd. v. State of Madras (AIR 1954 Mad. 1130), the appellant applied on August 9, 1954, to the High Court of Orissa.",
      "type": "procedural",
      "date": "1954-08-09",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Application sought: (a) declaration that provisions of Orissa Sales Tax Act, 1947 authorising imposition of sales tax on turnover of works contracts and repair works were ultra vires; (b) declaration that assessments were without jurisdiction and illegal, entitled to refund of Rs. 1,20,787-3-6; (c) restraint on further assessments; (d) writ directing refund.",
      "type": "procedural",
      "date": "1954-08-09",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Orissa High Court in O.J.C. No. 107 of 1954, judgment dated April 21, 1958, following Supreme Court in State of Madras v. Gannon Dunkerley Co. Ltd. (1959 SCR), declared assessments not in accordance with law, directed no steps to realise arrears, refund if not barred under S.14, revise pending assessments.",
      "type": "procedural",
      "date": "1958-04-21",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellants appealed to Supreme Court by special leave challenging High Court order insofar as claim for refund partially barred by S.14 of Orissa Sales Tax Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether S.14 of the Orissa Sales Tax Act, 1947 is ultra vires the State Legislature.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether an application under S.14 is the only remedy for refund of tax unlawfully recovered, or whether the High Court under Art.226 can direct refund ignoring the limitation in the proviso to S.14.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "S.14 of the Orissa Sales Tax Act, 1947 is ultra vires the State Legislature.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Orissa Sales Tax Act, 1947 S.14"
    },
    {
      "id": "pa2",
      "text": "An application under S.14 which imposes a statutory obligation upon the Collector to refund the tax unlawfully recovered subject to certain conditions is not the only remedy open to the tax payer; the power of the High Court to direct refund of tax illegally recovered is not restricted by S.14; the bar in proviso to S.14 does not apply to other remedies.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "Constitution Art.226; Orissa Sales Tax Act, 1947 S.14"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 14 imposes obligation on Collector to refund excess tax paid, but restricted to claims made within 24 months of assessment order or 12 months of final order on appeal etc., whichever later.",
      "addresses_issue": "i1",
      "key_observation": "Orissa Sales Tax Act enacted under item 48 List II Seventh Schedule Government of India Act 1935; power to legislate on tax includes machinery, collection, refunds as ancillary matters."
    },
    {
      "id": "cr2",
      "text": "Legislature competent to impose restrictions on right to claim refund of tax improperly/illegally collected, as both refund and restrictions are ancillary to tax on sale of goods.",
      "addresses_issue": "i1",
      "key_observation": "Cites State of Orissa v. Orient Paper Mills Ltd.: power to legislate on tax comprehends imposition, machinery, refunds."
    },
    {
      "id": "cr3",
      "text": "Petition under Art.226 seeks to compel Collector to carry out statutory obligation under S.14; maintainable to enforce statutory liability for refund of illegal tax, but subject to legislative restrictions in S.14.",
      "addresses_issue": "i2",
      "key_observation": "Cannot rely on statutory right and ignore restrictions; High Court normally does not enforce civil liabilities under Art.226, but here it's statutory."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Provisions of S.14 of Orissa Sales Tax Act, 1947 are not ultra vires the State Legislature.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court petition under Art.226 to enforce refund under S.14 is subject to the limitations prescribed therein.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gannon Dunkerley Co. Ltd. v. State of Madras",
      "citation": "AIR 1954 Mad. 1130",
      "treatment": "followed",
      "relevance": "Madras High Court judgment relied on by appellants for initial application"
    },
    {
      "case_name": "State of Madras v. Gannon Dunkerley Co. Ltd.",
      "citation": "1959 S.C.R.",
      "treatment": "followed",
      "relevance": "Supreme Court confirmed Madras HC; basis for Orissa HC declaring assessments invalid"
    },
    {
      "case_name": "State of Orissa v. Orient Paper Mills Ltd.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Legislative competence for tax refunds and restrictions as ancillary to tax power"
    }
  ],
  "statutes_cited": [
    {
      "name": "Orissa Sales Tax Act, 1947",
      "sections": [
        "Section 14"
      ],
      "relevance": "Governs refund of excess tax with time limitations; held intra vires and applicable to Art.226 petition"
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Item 48 of List II, Seventh Schedule"
      ],
      "relevance": "Source of State Legislature's power to enact sales tax law including ancillary refund provisions"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "High Court jurisdiction to enforce statutory refund obligation, subject to statutory limits"
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal partially allowed by modifying High Court order: directed refund of sales tax paid by Burmah Construction Co. only if assessment order was within 24 months of August 9, 1954 (filing date); claim for balance dismissed without deciding right to recover by other proceedings.",
    "relief_granted": "Partial refund as per modified terms; revision of assessments.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The power to legislate with respect to a tax comprehends the power to impose the tax, to prescribe machinery for collecting the tax, to designate the officers by whom the liability may be enforced and to prescribe the authority, obligations and indemnity of those officers.\"",
      "speaker": "court",
      "significance": "Defines legislative competence including ancillary refund powers"
    },
    {
      "text": "\"It is not open to the claimant to rely upon the statutory right and to ignore the restrictions subject to which the right is made enforceable.\"",
      "speaker": "court",
      "significance": "Limits Art.226 relief to statutory conditions in S.14"
    }
  ],
  "_case_id": "1961_408",
  "_label": 0,
  "_text_length": 10219,
  "_extracted_at": "2026-02-10T19:35:17.250450"
}