{
  "metadata": {
    "case_name": "Petitioners (heirs of Lala Ramji Das) v. State of Punjab & Ors.",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "K. DAS, J."
    ],
    "case_number": "Writ Petition No. 24 of 1960",
    "date_of_judgment": "1961-04-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Land on which dharmasala, temple and shops stand was nazul property of the then State of Patiala.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1909, Lala Ramji Das, on behalf of joint family firm Faquir Chand Bhagwan Das, obtained permission to construct dharmasala near Barnala railway station.",
      "type": "material",
      "date": "1909",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Permission granted subject to conditions: no tax on land, shopkeepers arrange piao/shed for water, maintain cleanliness, no shops to be constructed, building only for passengers, state can dispossess if conditions not fulfilled.",
      "type": "material",
      "date": "1909-05",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Dharmasala constructed in 1909 with inscription 'Dharmasala Lala Faquir Chand Bhagwan Das, mahajan, 1909'.",
      "type": "material",
      "date": "1909",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Shops later constructed with permission for maintenance of dharmasala and temple, despite initial condition prohibiting shops.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In 1911, complaint against Ramji Das for misusing dharmasala for private purposes; nothing came of it.",
      "type": "background",
      "date": "1911",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In January 1925, Ramji Das stated to Tahsildar that land given by way of wakf, invested own funds for charity, no personal benefit, government can oversee accounts but not use as government building, reserve for passengers, shop rents for repairs.",
      "type": "material",
      "date": "1925-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On April 7, 1928, Revenue Minister ordered dharmasala to continue for public benefit, Ramji Das as Manager, no transfer allowed, income for public benefit, government can escheat if misused but still for public use.",
      "type": "material",
      "date": "1928-04-07",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Enquiry by Nazim found Ramji Das constructed dharmasala and temple, employed staff, no order for accounts, repairs from shop rents; declared sarai as State's due to government land.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Ramji Das obtained permission for raised platform and extensions.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On September 10, 1954, Gopal Das petitioned to suspend Ramji Das and take over management; Tahsildar found Ramji Das managing but recommended removal for not rendering accounts.",
      "type": "background",
      "date": "1954-09-10",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Legal Remembrancer opined dharmasala not government property, Ramji Das as trustee, removal only by suit under s.92 CPC.",
      "type": "material",
      "date": "1954",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "December 13, 1954, Revenue Minister directed execution of trust deed appointing Ramji Das and two others as trustees; no deed executed.",
      "type": "background",
      "date": "1954-12-13",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Lala Ramji Das died on December 10, 1957.",
      "type": "material",
      "date": "1957-12-10",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Petitioners (sons, grandsons, daughter of Ramji Das, widow of predeceased son Tara Chand) continued management post-death, paid taxes, electric charges, realized shop rents.",
      "type": "admitted",
      "date": "1957-12",
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "On or about December 23, 1957, Gopal Das et al. applied for new management arrangements post Ramji Das death.",
      "type": "procedural",
      "date": "1957-12-23",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Sub-Divisional Officer, Barnala recommended entrusting management to Municipal Committee, Barnala.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "Deputy Commissioner, Sangrur affirmed, directed handover in anticipation of government approval, citing Ramji Das appointed manager by 1928 order, no one left to manage.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f19",
      "text": "On January 7, 1958, Kanungo dispossessed petitioners from part of dharmasala and handed over to Municipal Committee, Barnala.",
      "type": "material",
      "date": "1958-01-07",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Petitioners' Art.226 petition in Punjab High Court rejected on ground of disputed facts; appeal dismissed.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f21",
      "text": "Respondents claim property is public charitable trust, petitioners have no property rights.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the dispossession of petitioners from dharmasala, temple and shops by State and officials without authority of law violates fundamental rights under Articles 14, 19 and 31.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether petitioners are trespassers and State entitled to eject them by force as land is nazul.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether writ proceedings appropriate given disputed questions of fact and title.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Lala Ramji Das built dharmasala, temple and shops out of joint family funds in 1909, managed on behalf of joint family; petitioners came into possession after his death; dispossessed by force in Jan 1958 without authority of law, violating Arts.14,19,31.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f15",
        "f19"
      ],
      "legal_basis": "Articles 14, 19, 31 of Constitution"
    },
    {
      "id": "pa2",
      "text": "Dharmasala for traveling public, temple for worship, shops for upkeep.",
      "supporting_facts": [
        "f1",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Property is trust property of public and charitable character; petitioners not entitled to property rights; mere trespassers on State nazul land, entitled to ejection by minimum force.",
      "supporting_facts": [
        "f1",
        "f21"
      ],
      "legal_basis": "Sohan Lal v. Union of India (1957 S.C.R. 738)"
    },
    {
      "id": "ra2",
      "text": "Disputed questions of fact and title make writ inappropriate; would amount to declaring title and restoring possession.",
      "supporting_facts": [
        "f21"
      ],
      "legal_basis": "Sohan Lal v. Union of India"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Petitioners not trespassers; built structures with State permission on behalf of family firm, continued management post Ramji Das death; cannot be dispossessed by executive fiat even if public trust.",
      "addresses_issue": "i1",
      "key_observation": "Admitted position: Ramji Das built and managed with permission; petitioners continued; not trespassers."
    },
    {
      "id": "cr2",
      "text": "No need to decide nature of 1909 sanction (lease/licence); sufficient that petitioners in bona fide possession, dispossession only by due process of law.",
      "addresses_issue": "i2",
      "key_observation": "Buildings do not vest in soil owner by maxim quicquid plantatur solo solo cedit if built with permission."
    },
    {
      "id": "cr3",
      "text": "Trustee removable only by s.92 CPC suit, not executive order; State must take legal action.",
      "addresses_issue": "i1",
      "key_observation": "Even if public trust, proper procedure required."
    },
    {
      "id": "cr4",
      "text": "No disputed facts needing trial; only need bona fide possession violated by executive action without law.",
      "addresses_issue": "i3",
      "key_observation": "Writ appropriate for fundamental rights violation."
    },
    {
      "id": "cr5",
      "text": "Executive action destructive of rule of law; State cannot interfere without specific legal authority.",
      "addresses_issue": "i1",
      "key_observation": "Callous disregard of normal requirements."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Petitioners' fundamental rights violated by dispossession without authority of law; orders quashed; respondents restrained from interfering with management of dharmasala, temple, shops.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Petitioners in bona fide possession; cannot be removed except by law; buildings not State property merely on nazul land.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Writ proceedings appropriate despite title disputes when fundamental rights violated.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sohan Lal v. Union of India",
      "citation": "1957 S.C.R. 738",
      "treatment": "distinguished",
      "relevance": "Respondents relied on it for disputed facts barring writ; court distinguished as no need for title determination here."
    },
    {
      "case_name": "Thakoor Chunder Parmanick v. Ramdhone Bhuttacharjee",
      "citation": "1866 6 W.R. 228",
      "treatment": "followed",
      "relevance": "Maxim 'what is annexed to soil goes with soil' not absolute; structures with permission do not vest in landowner."
    },
    {
      "case_name": "Lala Beni Ram v. Kundan Lall",
      "citation": "1899 L.R. 26 I.A. 58",
      "treatment": "followed",
      "relevance": "Person building bona fide with permission not trespasser; buildings do not vest by soil maxim."
    },
    {
      "case_name": "Narayan Das Khettry v. Jatindranath",
      "citation": "1927 L.R. 54 I.A. 218",
      "treatment": "followed",
      "relevance": "Same as above on structures with permission."
    },
    {
      "case_name": "Wazir Chand v. State of Himachal Pradesh",
      "citation": "1955 1 S.C.R. 408",
      "treatment": "followed",
      "relevance": "State cannot interfere with rights without specific rule of law."
    },
    {
      "case_name": "Ram Prasad Narayan Sahi v. State of Bihar",
      "citation": "1953 S.C.R. 1129",
      "treatment": "followed",
      "relevance": "Discriminatory executive action drains vitality from rule of law."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 226",
        "Article 14",
        "Article 19",
        "Article 31"
      ],
      "relevance": "Basis for writ petition; violation by arbitrary dispossession."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Section 92"
      ],
      "relevance": "Required for removal of trustee of public trust."
    },
    {
      "name": "Indian Easements Act, 1882",
      "sections": [
        "Section 60(b)"
      ],
      "date": null,
      "source": "court"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Writ petition allowed; executive orders quashed; respondents prohibited from interfering with petitioners' management and control of dharmasala, temple and shops; directed to restore possession.",
    "relief_granted": "Quashing of illegal orders; writ of prohibition and mandamus to restore possession and management.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A trustee even of a public trust can be removed only by procedure known to law. He cannot be removed by an executive fiat.",
      "speaker": "court",
      "significance": "Core holding on due process for trustee removal."
    },
    {
      "text": "The executive action taken in this case by the State and its officers is destructive of the basic principle of the rule of law.",
      "speaker": "court",
      "significance": "Critique of arbitrary state action violating constitutional guarantees."
    },
    {
      "text": "It is enough to say that they are bona fide in possession of the constructions in question and could not be removed except under authority of law.",
      "speaker": "court",
      "significance": "Basis for granting writ without resolving title disputes."
    }
  ],
  "_case_id": "1961_127",
  "_label": 1,
  "_text_length": 22234,
  "_extracted_at": "2026-02-10T19:31:19.407045"
}