{
  "metadata": {
    "case_name": "M/s. Jeewanlal (1929) Ltd. v. Workmen",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 264 of 1960",
    "date_of_judgment": "1961-04-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "A dispute arose between the appellant M/s. Jeewanlal (1929) Ltd. and its workmen in regard to certain demands made by the respondents against the appellant in 1950.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The said dispute was referred for adjudication, resulting in an award passed on April 28, 1951, in Reference No. 168 of 1950, which inter alia provided for a gratuity scheme.",
      "type": "background",
      "date": "1951-04-28",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Employee Bhanu Bala joined the appellant's service in 1929 but there was a break in the continuity of his service for nearly 8½ months because he remained absent from duty without permission or leave from February 14, 1945 to the end of October, 1945.",
      "type": "material",
      "date": "1945-02-14",
      "source": "appellant"
    },
    {
      "id": "f4",
      "text": "Resignation submitted by the appellant's employee Bhanu Bala was accepted by the appellant on August 31, 1957.",
      "type": "material",
      "date": "1957-08-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "According to the appellant, the said employee was not entitled to any gratuity under the scheme framed by the award due to the break in service.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "The appellant offered him Rs. 1,165 and odd on compassionate grounds.",
      "type": "admitted",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f7",
      "text": "The employee claimed that he was entitled to Rs. 2,282.50 nP. by way of gratuity.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The demand led to an industrial dispute which was taken by the employee before the First Labour Court at Bombay under s. 33C of the Industrial Disputes Act, 1947.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Labour Court decided the point in dispute in favour of the employee and directed the appellant to pay him Rs. 1,781-80 nP. as gratuity.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The appellant moved the Bombay High Court for a writ under Arts. 226 and 227, which was allowed and the order passed by the Labour Court was quashed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The Government of Bombay referred the question of interpretation of the term 'continuous service' contained in the award of 1951 to the Industrial Tribunal under s. 36A of the Act, resulting in award dated October 12, 1959, in Reference IT No. 81 of 1959.",
      "type": "procedural",
      "date": "1959-10-12",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The Industrial Tribunal held that the words 'continuous service' as used in the 1951 award mean service not broken or interrupted by the termination of the contract of employment by either the employer or the employee or by operation of law.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Interpretation of the words 'continuous service' in clause iii of the gratuity scheme in the award of April 28, 1951: whether unauthorised absence from work for nearly 8½ months breaks the continuity of service for the purpose of gratuity on voluntary retirement or resignation after 15 years continuous service.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "In interpreting 'continuous service' in cl. iii, compare provisions of s. 49B(1) along with explanation in Indian Factories Act, 1934 and s. 79(1) with explanation I in Indian Factories Act, 1948 prior to 1954 amendment; unauthorised absence from work should normally cause a break in service.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "s. 49B(1) Indian Factories Act, 1934; s. 79(1) Indian Factories Act, 1948; Buckingham and Carnatic Co. Ltd. Workers (1953 SCR 219)"
    },
    {
      "id": "pa2",
      "text": "The employee had not been employed in continuous service for the requisite period because there was a break between February 14, 1945 to end of October, 1945, affecting continuity and making claim incompetent under cl. iii.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Gratuity scheme in 1951 award, cl. iii"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The employee claimed benefit of cl. iii of gratuity scheme on resignation after 15 years continuous service.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Gratuity scheme in 1951 award, cl. iii"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The meaning of 'continuous service' in the context of the gratuity scheme postulates continuance of master-servant relationship; mere absence without leave does not end it unless long unauthorised absence infers abandonment.",
      "addresses_issue": "i1",
      "key_observation": "Unauthorised absence without permission does not automatically break continuity unless it leads to reasonable inference of abandonment of service."
    },
    {
      "id": "cr2",
      "text": "Statutory definitions in Factories Acts and s. 2(eee) Industrial Disputes Act not automatically applicable; interpret on principle in award context.",
      "addresses_issue": "i1",
      "key_observation": "Decisions on words in other statutes scarcely guides; same words differ in contexts."
    },
    {
      "id": "cr3",
      "text": "Buckingham case turned on specific definitions and not applicable here.",
      "addresses_issue": "i1",
      "key_observation": "Continuous service disrupted by resignation, termination by employer, or operation of law, but not mere unauthorised absence or illegal strike participation unless leading to termination."
    },
    {
      "id": "cr4",
      "text": "Whether particular absence breaks continuity is question of fact based on circumstances.",
      "addresses_issue": "i1",
      "key_observation": "Tribunal's view substantially right, but add cases of long absence inferring abandonment."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "'Continuous service' in gratuity scheme means service not broken by termination of employment contract by employer/employee or operation of law; unauthorised absence does not break unless inferring abandonment.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Buckingham and Carnatic Co. Ltd. Workers of the Buckingham and Carnatic Co. Ltd.",
      "citation": "1953 S.C.R. 219",
      "treatment": "distinguished",
      "relevance": "Held continuity interrupted by illegal strike for holidays with pay under Factories Act; not applicable to gratuity award context"
    },
    {
      "case_name": "Budge Budge Municipality v. P.R. Mukherjee",
      "citation": "1953 1 L.L.J. 195, 198",
      "treatment": "followed",
      "relevance": "Same words may mean different things in different contexts; decisions from other statutes not binding precedents"
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 36A",
        "s. 33C",
        "s. 2(eee)"
      ],
      "relevance": "Reference for interpretation; recovery application; definition of continuous service not automatically applicable to award"
    },
    {
      "name": "Indian Factories Act, 1934",
      "sections": [
        "s. 49B(1)"
      ],
      "relevance": "Provisions on continuity for holidays; unauthorised absence breaks service, but context-specific and not binding"
    },
    {
      "name": "Indian Factories Act, 1948",
      "sections": [
        "s. 79(1)",
        "Explanation I"
      ],
      "relevance": "Similar to 1934 Act; prior to 1954 amendment, but not directly applicable"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Arts. 226",
        "Art. 227"
      ],
      "relevance": "Writ petition to quash Labour Court order"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed; tribunal's award confirmed with modification that long unauthorised absence may infer abandonment and break continuity.",
    "relief_granted": "None to appellant; confirmation of tribunal's interpretation in favour of employee",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'Continuous service' in the context of the scheme of gratuity framed by the tribunal in the earlier reference postulates the continuance of the relationship of master and servant between the employer and his employees.",
      "speaker": "court",
      "significance": "Defines core meaning of term in gratuity context"
    },
    {
      "text": "Mere participation in an illegal strike cannot be said to cause breach in continuity for the purposes of gratuity.",
      "speaker": "court",
      "significance": "Clarifies what does not break continuity"
    },
    {
      "text": "If an employee continues to be absent from duty without obtaining leave and in an unauthorised manner for such a long period of time that an inference may reasonably be drawn from such absence that by his absence he has abandoned service, then such long unauthorised absence may legitimately be held to cause a break in the continuity of service.",
      "speaker": "court",
      "significance": "Key modification to tribunal's view on when absence breaks service"
    }
  ],
  "_case_id": "1961_32",
  "_label": 0,
  "_text_length": 10189,
  "_extracted_at": "2026-02-10T19:29:41.255400"
}