{
  "metadata": {
    "case_name": "Appellants v. Respondents",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Civil Appeals Nos. 503 to 506 of 1958",
    "date_of_judgment": "1961-09-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant brought four suits in the City Civil Courts, Bombay, for recovery of arrears of rent in respect of the premises mentioned in the plaints.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Plaintiff stated in the plaint that the Bombay Rents, Hotel and Lodging House Rates Control Act, 1947 (Rent Act) did not apply to the demised premises.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Defendant in each case pleaded that the Rent Act applied and so the City Civil Court had no jurisdiction to try the suits.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "First issue framed in each suit: whether the Court had jurisdiction to entertain the suit.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Learned Judge held that Part II of the Rent Act applied to the premises in each suit and consequently only the special court specified in s. 28 had jurisdiction; ordered plaints returned for presentation to proper Court.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Plaintiff appealed to the High Court of Bombay; all four appeals summarily dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Letters Patent Appeals Nos. 29 to 32 of 1957 preferred by plaintiff from Single Judge decision also dismissed summarily on August 4, 1957.",
      "type": "procedural",
      "date": "1957-08-04",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Land in respect of which suits brought was not being used for agricultural purposes and comes within definition of 'premises' in s. 5(8) of Rent Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Four premises are all within the city of Bombay and thus in area specified in Schedule I of the Act.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Lease mentions lessee will construct buildings suitable for residential, business, industrial or office purposes.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "When a lessee takes lease of open land for the purpose of constructing on it buildings intended to be used for residence or for business, is this letting for residence, or letting for business?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Part II of the Bombay Rents, Hotel and Lodging House Rates Control Act, 1947 applies to such premises, giving jurisdiction only to special court under s.28 and not City Civil Court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Open land is not intended to be used as it is for residence or business but for construction of buildings for residence or business; thus land not being let for residence or business.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "s.6 Rent Act"
    },
    {
      "id": "pa2",
      "text": "Open land can never be let for residence; land as defined in s.5(8) outside 'premises let for residence' in s.6.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s.5(8), s.6 Rent Act"
    },
    {
      "id": "pa3",
      "text": "Letting of open land is for construction of building and not for residence.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "s.15(1) shows Legislature could not have intended land let for construction of residential buildings to fall within 'premises let for residence'; subletting restriction would defeat purpose.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "s.15 Rent Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Letting was for residence or business as that was the ultimate purpose of taking the lease.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "s.6 Rent Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Open land as it is can be used for residence; no reason to exclude from 'premises let for residence' in s.6.",
      "addresses_issue": "i1",
      "key_observation": "Open land included in premises when let for residence."
    },
    {
      "id": "cr2",
      "text": "When open land leased not to be used for residence in its open condition but for residence after constructing buildings, letting can reasonably be called letting for residence.",
      "addresses_issue": "i1",
      "key_observation": "Purpose to which land will be used irrespective of construction."
    },
    {
      "id": "cr3",
      "text": "Legislature included open land in premises and specified purposes in s.6 to cover uses with or without structures; excludes other purposes like keeping cattle.",
      "addresses_issue": "i1",
      "key_observation": "Ordinary meaning: land let for business/residence regardless of structures."
    },
    {
      "id": "cr4",
      "text": "s.15 argument unpersuasive post-1959 amendment allowing contract to contrary; even otherwise, bar applies to land not building; cites Vinayak Gopal case.",
      "addresses_issue": "i1",
      "key_observation": "Difficulty in some cases no reason to narrow 'let for residence'."
    },
    {
      "id": "cr5",
      "text": "In each case, lease taken to construct buildings for residential, business etc. purposes; Part II applies.",
      "addresses_issue": "i2",
      "key_observation": "City Civil Court no jurisdiction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Words 'let for residence, education, business, trade or storage' in s.6 wide enough to include letting for achievement of these purposes with construction of buildings as also without.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Premises let are within Part II of Rent Act; City Civil Court has no jurisdiction.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Vinayak Gopal v. Laxman Kashinath",
      "citation": "I.L.R. 1956 Bom. 827",
      "treatment": "followed",
      "relevance": "Held land leased for construction of buildings for residence is let for residence under s.6; bar of s.15 applies to land not building."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Rents, Hotel and Lodging House Rates Control Act, 1947 (Bom. 57 of 1947)",
      "sections": [
        "s.5(8)",
        "s.6",
        "s.15",
        "s.28"
      ],
      "relevance": "Defines premises including open land; Part II applies to premises let for residence etc.; jurisdiction in special court; subletting restrictions."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals, holding that Part II of the Rent Act applies to the open lands leased for construction of residential/business buildings, so City Civil Court had no jurisdiction; appeals dismissed with costs.",
    "relief_granted": null,
    "costs": "with costs"
  },
  "key_quotes": [
    {
      "text": "\"When a lessee takes lease of open land for the purpose of constructing on it buildings intended to be used for residence or for business is this letting for residence, or letting for business? That is the short question which arises for decision.\"",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "\"The words 'let for residence, education, business, trade or storage' are wide enough to include a letting for the achievement of these purposes with construction of buildings as also without construction of buildings.\"",
      "speaker": "court",
      "significance": "Key holding on interpretation of s.6."
    }
  ],
  "_case_id": "1961_74",
  "_label": 0,
  "_text_length": 13927,
  "_extracted_at": "2026-02-10T19:30:30.275337"
}