{
  "metadata": {
    "case_name": "Tobacco Cultivators and Private Bonded Warehouse Licensees v. Union of India",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Writ Petition No. 84 of 1958",
    "date_of_judgment": "1961-04-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioners Nos. 1 to 17 are tobacco cultivators carrying on the trade and business of growing tobacco and selling it in Kaimganj Tahsil in the District of Farrukhabad in Uttar Pradesh.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Petitioners 18 to 30 are partners or proprietors or agents of firms which are private bonded warehouse licensees carrying on trade and business of purchasing tobacco from cultivators and selling the same to dealers or to other private warehouse licensees.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Petition filed under Art. 32 challenging validity of excise tariff imposed by cl. 6 in entry 41 in the First Schedule to the Central Excises and Salt Act, 1944, specifically on hooka and chewing tobacco.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Entry 4 in First Schedule deals with tobacco, defining it as any form cured or uncured, manufactured or not, including leaf, stalks, stems, but not while attached to earth.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Clause 1 under entry 4 deals with unmanufactured tobacco with varying tariffs from Rs. 16.15 nP. to Rs. 1.65 nP. per kg for different categories like flue cured for cigarettes, smoking mixtures, etc.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Item 5 under clause 1: tobacco other than flue cured and not actually used for cigarettes, smoking mixtures or biris; cl.4: tobacco cured in whole leaf form packed or tied; tariff Rs. 1.10 nP. per kg.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Clause 6 (impugned): tobacco other than flue cured and not otherwise specified; tariff Rs. 2.20 nP. per kg, double the rate of preceding item.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Petitioners deal in tobacco that cannot be distinguished on rational basis from item 5 cl.4; it is broken leaf, not whole, not used for cigarettes, smoking mixtures or biris.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Tobacco dealt by petitioners is Nicotiana Rustica, pit cured or ground cured, used exclusively for hooka and chewing in Uttar Pradesh, unfit for biris and cigarettes, never so used; variety used in biris not grown in UP.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Counter-affidavit denies allegations of exclusive use of Nicotiana Rustica for hooka/chewing.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Tobacco Expert Committee report recommends classification based on physical form affecting suitability for biri making; whole leaf harder to convert to flakes for biris; broken leaf grades liable to higher rate but convertible to rawa/dust for lower rate.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Rustica varieties in broken leaf grades can be used with admixture for biris; no generalization possible that all forms incapable of use in biris; possible to send to other parts for biri manufacturing.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the excise tariff imposed by cl. 6 in entry 41 First Schedule to Central Excises and Salt Act, 1944 amounts to unconstitutional discrimination under Art. 14, as it imposes double tariff on petitioners' tobacco compared to item 5 cl.4 without rational basis.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether petitioners' Nicotiana Rustica tobacco falls under the impugned clause 6 or is exempt as unfit for biris.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Tariff rates excessive and destroy trade (conceded not sustainable).",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Impugned item based on unconstitutional discrimination; petitioners' tobacco indistinguishable from item 5 cl.4; double tariff without rational basis; tariff by reference to use, but their tobacco not used for cigarettes, mixtures or biris; broken leaf not rational classification.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Art. 14; Kunmathat Thathunni Moopil Nair v. State of Kerala"
    },
    {
      "id": "pa3",
      "text": "Nicotiana Rustica used exclusively for hooka/chewing in UP, unfit for biris/cigarettes.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Allegations of exclusive use of Nicotiana Rustica for hooka/chewing denied.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Assume discrimination in commodities taxed invokes Art.14; tariff not primarily by intended use but physical form and capability for biri use per Tobacco Expert Committee.",
      "addresses_issue": "i1",
      "key_observation": "Distinction between cl.5 and cl.6 clear by physical form; whole leaf vs. broken; affects suitability for biris; reasonable classification."
    },
    {
      "id": "cr2",
      "text": "Committee: intention tariff ineffective; capability tariff adopted with visual/simple tests; physical form criterion safe despite regional variations.",
      "addresses_issue": "i1",
      "key_observation": "Tobacco rich man's solace, poor man's comfort; equitable incidence on all classes."
    },
    {
      "id": "cr3",
      "text": "Petitioners' tobacco under cl.6; Rustica broken leaf usable in biris with admixture; possible export to other regions; no generalization of incapacity.",
      "addresses_issue": "i2",
      "key_observation": "Question of specific classification not for Art.32 but anyway refuted by counter and report."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No unconstitutional discrimination; distinction between cl.5 and cl.6 reasonable and related to tariff object.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Petitioners' tobacco legitimately under impugned cl.6.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kunmathat Thathunni Moopil Nair v. State of Kerala",
      "citation": "1961 3 S.C.R. 77",
      "treatment": "referred",
      "relevance": "Assumed effect that commodity discrimination invokes Art.14 against persons taxed."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 32",
        "Art. 14"
      ],
      "relevance": "Basis for petition; challenge to discrimination."
    },
    {
      "name": "Central Excises and Salt Act, 1944",
      "sections": [
        "Entry 4, First Schedule (cl.1 items 1-6)"
      ],
      "relevance": "Imposed tariff on tobacco; validity upheld."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The petition under Art.32 challenging the excise tariff on grounds of discrimination under Art.14 is not upheld; tariff classification based on physical form and capability reasonable; attack fails.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Tobacco, as the Committees report points out, is a rich mans solace and a poor mans comfort. Since it is used by all classes of people in various forms it is necessary to frame the tariff in such a way that the incidence of tax shall fall equitably on all classes of people using it.\"",
      "speaker": "court",
      "significance": "Explains basis for equitable classification."
    },
    {
      "text": "\"the only criterion which is safe to adopt is the one relating to the physical form of tobacco as affecting its suitability for biri making.\"",
      "speaker": "court",
      "significance": "Core reasoning upholding distinction between clauses."
    },
    {
      "id": "kq3",
      "text": "\"the distinction between tobacco falling under cl. 5 and cl. 6 , according to the report of the Committee, is so clear and unambiguous and its relation to the object intended by the imposition of tariff is so clearly reasonable that the attack against its validity on the ground of unconstitutional discrimination cannot be upheld.\"",
      "speaker": "court",
      "significance": "Direct holding on no discrimination."
    }
  ],
  "_case_id": "1961_137",
  "_label": 0,
  "_text_length": 13255,
  "_extracted_at": "2026-02-10T19:31:19.230358"
}