{
  "metadata": {
    "case_name": "Karanpura Development Co., Ltd. v. Commissioner of Income-tax",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal Nos. 376 to 379 of 1960",
    "date_of_judgment": "1961-08-31"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In 1915, the Court of Wards representing the proprietor of the Ramgarh Estate granted a prospecting licence to Messrs. Bird & Co. for an area of coal-bearing lands described as the Karanpura Coal Fields for 12 years, renewable for another 12 years, reserving the right to take coal mining leases, transferable.",
      "type": "background",
      "date": "1915",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The assessee Company, Karanpura Development Co., Ltd., was incorporated in 1920 with objects inter alia to purchase and acquire underground coal mining rights in Karanpura Coal Fields, to sell/dispose/deal in such rights, to carry on colliery proprietors/coal merchants/miners business, to prospect/win/get coal, to acquire lands/leases, to sell/improve/manage/develop/lease property.",
      "type": "background",
      "date": "1920",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On May 30, 1921, Messrs. Bird & Co. assigned rights under the prospecting licence to the assessee Company.",
      "type": "material",
      "date": "1921-05-30",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The assessee Company acquired diverse coal mining leases over areas aggregating 20,000 standard bighas for 999 years, paying salami at Rs. 40 per standard bigha and agreeing to pay royalties.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The assessee Company developed the coal fields by providing means of communication etc., and subleased them to collieries and other companies for balance of period minus 2 days, charging salami at Rs. 400 per standard bigha and higher royalties.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The assessee Company did no other business: never worked coal fields to raise coal, nor acquired/sold coal raised by sub-lessees.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "For assessment year 1949-50, assessee realised Rs. 19,14,035 as salami for mining sub-leases; for 1950-51, Rs. 3,96,000.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Two orders in income-tax cases and two in Business Profits Tax cases passed on January 30, 1952, rejecting assessee's contention that excess salami was capital.",
      "type": "procedural",
      "date": "1952-01-30",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Assessee filed four appeals to Appellate Assistant Commissioner, dismissed on March 31, 1953.",
      "type": "procedural",
      "date": "1953-03-31",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Four appeals to Income-tax Appellate Tribunal, Calcutta Bench, dismissed by common order dated December 31, 1953.",
      "type": "procedural",
      "date": "1953-12-31",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Tribunal referred common question under s.66A Income-tax Act read with s.19 Business Profits Tax Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Calcutta High Court by judgment dated September 18, 1958 answered question in affirmative against assessee.",
      "type": "procedural",
      "date": "1958-09-18",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Assessee granted certificate to appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether on the facts and in the circumstances of the case, the sums received as salami by the assessee for granting sub-leases were trading receipts in its hands and the amount of profit therein is assessable under the Indian Income-tax Act",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Return as salami represented capital return: acquired two distinct rights (a) general right to benefits under leases for which salami paid, (b) right to carry on business in coal; never exercised second right, parted with first right realising capital.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Kamakshya Narain Singh v. Commissioner of Income-tax (1943 L.R. 70 I.A. 180)"
    },
    {
      "id": "pa2",
      "text": "No difference between individual owning properties and selling them, and company owning mining leases and issuing sub-leases; no profits/gains of business if no business done.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Balgownie Land Trust Ltd. v. Commissioner of Inland Revenue (1929 14 T.C. 684); Fry v. Salisbury House Estates Ltd. (1930 A.C. 432)"
    },
    {
      "id": "pa3",
      "text": "Even if carrying on business, not trading activity but mere management of leasehold, selection of sub-lessees, collection of rents/royalties; activities do not amount to business resulting in increased salami as profits.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "East India Prospecting Syndicate v. Commissioner of Excess Profits Tax (1951 19 I.T.R. 571); In re Commercial Properties Ltd. (1928 I.L.R. 55 Cal. 1057)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "In acquiring head leases and granting sub-leases, assessee carrying on business within Memorandum of Association; increased salami represents profits of that business liable to income-tax and business profits tax.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Californian Copper Syndicate v. Harris (1904 5 T.C. 159); British South Africa Co. v. Commissioner of Income-tax (1946 4 I.T.R. Supp. 17)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Income-tax Act taxes income/profits/gains from whatever source; heads exclusive; income not defined but periodical monetary receipt with regularity; in business, profit from continuous exercise of activity; fixed capital vs circulating capital turned over in profit-making.",
      "addresses_issue": "i1",
      "key_observation": "Business includes trade/commerce/adventure in nature of trade; assessee questions if business carried on and if return on capital not revenue."
    },
    {
      "id": "cr2",
      "text": "Distinction in Kamakshya case: proprietor as landowner sold general right (capital), but in lessees' hands could be stock-in-trade if treated as such for profit.",
      "addresses_issue": "i1",
      "key_observation": "Character of lands/rights as property in lessor's hands does not continue in lessee's if used as business stock-in-trade."
    },
    {
      "id": "cr3",
      "text": "Objects of company and nature of activities determine if trading; not mere ownership/leasing but substance: if part of profit-making scheme.",
      "addresses_issue": "i1",
      "key_observation": "Company comes into existence for particular purpose; if to acquire/turn to account concessions/leases for profit, it is business."
    },
    {
      "id": "cr4",
      "text": "Californian Copper and British South Africa cases: where company sells/leases assets as part of business objects, excess over acquisition is profit.",
      "addresses_issue": "i1",
      "key_observation": "Gain from realising security vs gain in operation of business for profit-making."
    },
    {
      "id": "cr5",
      "text": "Distinguished Tebrau Johore Rubber: mere investment realisation, not formed to resell at profit; East India/Commercial Properties: mere rent collection from single property, no trading.",
      "addresses_issue": "i1",
      "key_observation": "Fry v. Salisbury: rents as landowner income under property head, not trade if no trading operations."
    },
    {
      "id": "cr6",
      "text": "Assessee's MOA cls.1,52: acquired large areas, developed, subleased extensively to many companies (per Annexure F chart), parcelled into stock-in-trade for profit; trading not property enjoyment.",
      "addresses_issue": "i1",
      "key_observation": "Reverter insignificant (999 yrs less days); activities beyond mere rent collection."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sums received as salami for granting sub-leases are trading receipts assessable as profits of business under Income-tax Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kamakshya Narain Singh v. Commissioner of Income-tax",
      "citation": "1943 L.R. 70 I.A. 180",
      "treatment": "distinguished",
      "relevance": "Salami as capital for landowner selling general right; but lessees may treat as stock-in-trade for business profit."
    },
    {
      "case_name": "Commissioner of Income-tax v. Shaw Wallace Co.",
      "citation": "1932 L.R. 59 I.A. 206",
      "treatment": "followed",
      "relevance": "Income as periodical monetary receipt with regularity; in business, profit from production/continuous activity."
    },
    {
      "case_name": "Senairam Doongarmall v. Commissioner of Income-tax",
      "citation": "1962 1 S.C.R. 257",
      "treatment": "followed",
      "relevance": "Income, profits, gains as income writ large."
    },
    {
      "case_name": "Balgownie Land Trust Ltd. v. Commissioner of Inland Revenue",
      "citation": "1929 14 T.C. 684",
      "treatment": "distinguished",
      "relevance": "Company objects kept in view; mere realising property not trade unless using powers for trading."
    },
    {
      "case_name": "Fry v. Salisbury House Estates Ltd.",
      "citation": "1930 A.C. 432",
      "treatment": "distinguished",
      "relevance": "Nature of operations determines trade; company can be landowner deriving rents without trading."
    },
    {
      "case_name": "Commissioners of Inland Revenue v. The Korean Syndicate Ltd.",
      "citation": "1921 12 T.C. 181",
      "treatment": "followed",
      "relevance": "Company formed for particular purpose of acquiring/turning to account concessions is business."
    },
    {
      "case_name": "Californian Copper Syndicate Ltd. v. Harris",
      "citation": "1904 5 T.C. 159",
      "treatment": "followed",
      "relevance": "Company formed to acquire/resell mineral rights at profit; gain is business profit, not mere capital enhancement."
    },
    {
      "case_name": "British South Africa Co. v. Commissioner of Income-tax",
      "citation": "1946 4 I.T.R. Supp. 17",
      "treatment": "followed",
      "relevance": "Receipts from turning concessions to account by sub-grants/shares are business income."
    },
    {
      "case_name": "Tebrau (Johore) Rubber Syndicate Ltd. v. Farmer",
      "citation": "1910 3 T.C. 658",
      "treatment": "distinguished",
      "relevance": "Sale of undeveloped estates as investment realisation, not profit-making scheme."
    },
    {
      "case_name": "East India Prospecting Syndicate v. Commissioner of Excess Profits Tax",
      "citation": "1951 19 I.T.R. 571",
      "treatment": "distinguished",
      "relevance": "Partnership holding single property/sub-leasing: mere property income, not business (Excess Profits Tax proviso inapplicable)."
    },
    {
      "case_name": "In re Commercial Properties Ltd.",
      "citation": "1928 I.L.R. 55 Cal. 1057",
      "treatment": "distinguished",
      "relevance": "Company letting properties/collecting rents: income from property, not business."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "Section 3",
        "Section 4",
        "Section 6",
        "Section 9",
        "Section 10",
        "Section 12",
        "Section 66A",
        "Section 2(4)"
      ],
      "relevance": "Tax on total income/profits/gains from any source; heads include property/business; business includes trade/adventure; computation under s.10."
    },
    {
      "name": "Business Profits Tax Act",
      "sections": [
        "Section 19"
      ],
      "relevance": "Reference certified read with Income-tax Act s.66A."
    },
    {
      "name": "Excess Profits Tax Act",
      "sections": [
        "Section 2(5)"
      ],
      "relevance": "Proviso deeming holding property as business for companies/societies, not applicable to partnerships."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeals, affirming the Calcutta High Court and Tribunal that the salami received by the assessee for granting sub-leases constituted trading receipts and profits assessable under the Income-tax Act and Business Profits Tax Act.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Is the sum of gain that has been made a mere enhancement of value by realising a security, or is it a gain made in an operation of business in carrying out a scheme for profit-making?\"",
      "speaker": "court",
      "significance": "Test from Californian Copper Syndicate to distinguish capital realisation from business profit."
    },
    {
      "text": "\"The salami has been rightly... treated as a capital... It is a single payment made for the acquisition of the right of the lessees to enjoy the benefits granted to them by the lease.\"",
      "speaker": "court",
      "significance": "Distinction in Kamakshya case for landowner, not applicable to assessee's trading activities."
    },
    {
      "text": "\"If the company sold its assets as a part of its business with the objects for which the company was formed, the excess receipts over the expenses of acquisition can be regarded as profits or gains of the business.\"",
      "speaker": "court",
      "significance": "Principle applied to hold assessee's salami as business profit."
    }
  ],
  "_case_id": "1961_145",
  "_label": 0,
  "_text_length": 41235,
  "_extracted_at": "2026-02-10T19:31:30.882055"
}