{
  "metadata": {
    "case_name": "K. C. Nayar v. Union of India",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha C.J."
    ],
    "case_number": "Original Jurisdiction Petition No. 107 of 1957",
    "date_of_judgment": "1961-08-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner is a trained machineman employed in Central Tractor Organisation from 13-5-1948.",
      "type": "background",
      "date": "1948-05-13",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Petitioner continued in government service and rendered good account until services terminated by office order No. 375 dated September 16, 1954: 'Shri K. C. Nayar... is informed that his services are no longer required... terminated with immediate effect... one month's pay in lieu under Rule 5 of Central Civil Services (Temporary Service) Rules, 1949.'",
      "type": "material",
      "date": "1954-09-16",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Petitioner's appeal against termination rejected on December 6, 1954 (Annexure B).",
      "type": "procedural",
      "date": "1954-12-06",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Petitioner obtained service certificate: Served as Machineman from 13-5-1948 to 21-9-1954, terminated under Rule 5.",
      "type": "procedural",
      "date": "null",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Petitioner made several applications for government appointment without success.",
      "type": "procedural",
      "date": "null",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Petitioner learnt of ban via memorandum (Annexure D): 'Government of India regret their inability to lift the ban on his employment for the present.'",
      "type": "material",
      "date": "null",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Petition under Art. 226 to Punjab High Court Circuit Bench Delhi dismissed in limine on September 12, 1956; certificate for appeal refused on April 26, 1957.",
      "type": "procedural",
      "date": "1956-09-12",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Petition under Art. 32 filed on August 20, 1957.",
      "type": "procedural",
      "date": "1957-08-20",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Respondents' affidavit by G.P. Das: Central Tractor Organisation temporary; petitioner purely temporary hand, services terminated per Rule 5; ban is departmental instruction for guidance, does not prevent applying, applications considered on merits; no deprivation of right to apply; no show cause needed.",
      "type": "disputed",
      "date": "null",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Affidavit erroneously claims special leave petition dismissed by Supreme Court on April 26, 1957 (no such petition filed).",
      "type": "procedural",
      "date": "1957-04-26",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the ban on petitioner's employment in government service violates Article 16(1) right to equality of opportunity in matters of public employment.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether termination of temporary service under Rule 5 was proper and whether ban is merely a departmental instruction without legal effect.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Ban discriminates against petitioner in government employment, depriving right to be considered on merits.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "Article 16(1)"
    },
    {
      "id": "pa2",
      "text": "No opportunity to show cause against ban; arbitrary imposition denies equal opportunity.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": "Article 16(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Services terminated properly as temporary under Rule 5, no reasons or show cause required.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": "Rule 5, Central Civil Services (Temporary Service) Rules, 1949"
    },
    {
      "id": "ra2",
      "text": "No right to appointment; ban is departmental instruction for guidance, petitioner can apply and be considered on merits; no deprivation.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Petition misconceived after exhausting remedies; res judicata from High Court dismissal.",
      "supporting_facts": [
        "f7",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Affidavit verbose, repetitive, inaccurate (false claim of special leave dismissal), misleading on ban; ignores Annexure D.",
      "addresses_issue": "i2",
      "key_observation": "Remissness in affidavit cannot be overlooked."
    },
    {
      "id": "cr2",
      "text": "Ban exists and prevents consideration on merits; right under Art. 16(1) includes being considered fairly, not just applying.",
      "addresses_issue": "i1",
      "key_observation": "Ban deprives constitutional right; arbitrary without show cause or justification related to suitability."
    },
    {
      "id": "cr3",
      "text": "No proceeding giving opportunity to show cause; cannot say ban has just relation to suitability.",
      "addresses_issue": "i1",
      "key_observation": "Petitioner not fairly treated."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Ban against employment arbitrary, violates Art. 16(1); must be removed.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 226",
        "Article 16(1)"
      ],
      "relevance": "Basis for petition; guarantees equality of opportunity in public employment; ban violates right to be considered on merits."
    },
    {
      "name": "Central Civil Services (Temporary Service) Rules, 1949",
      "sections": [
        "Rule 5"
      ],
      "relevance": "Permits termination of temporary service with one month's notice/pay without reasons; applied to termination but does not justify ban."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Petition allowed; direction issued to respondents to remove the ban against petitioner's entry into government service.",
    "relief_granted": "Writ of mandamus or appropriate direction to remove ban.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The fundamental right guaranteed by the Constitution is not only to make an application for a post under the Government but the further right to be considered on merits for the post for which an application has been made.",
      "speaker": "court",
      "significance": "Defines scope of Art. 16(1) right."
    },
    {
      "text": "So long as the ban subsists, any application made by the petitioner for employment under the State is bound to be treated as wastepaper.",
      "speaker": "court",
      "significance": "Explains practical effect of ban violating equality."
    }
  ],
  "_case_id": "1961_263",
  "_label": 1,
  "_text_length": 12768,
  "_extracted_at": "2026-02-10T19:33:16.529649"
}