{
  "metadata": {
    "case_name": "Appellants (purchasers from Seetaramayya and Ramakotayya) v. Respondents (widow of Nagaraju and tenant)",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J.",
      "Das Gupta, J.",
      "Shah, J.",
      "Raghubar Dayal, J."
    ],
    "case_number": "Civil Appeal No. 459 of 1958",
    "date_of_judgment": "1961-09-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Properties originally belonged to Subbarayudu who executed a will dated September 15, 1885, giving life interest to his wife and absolute interest thereafter to daughter Krishnavenamma.",
      "type": "background",
      "date": "1885-09-15",
      "source": "respondents"
    },
    {
      "id": "f2",
      "text": "Krishnavenamma enjoyed the property till her death in 1933 and executed a will on March 24, 1933, in favour of her stepson Nagaraju who took possession soon after.",
      "type": "material",
      "date": "1933",
      "source": "respondents"
    },
    {
      "id": "f3",
      "text": "Nagaraju executed a will on August 16, 1933, giving life interest to his wife (first respondent) and absolute interest thereafter to his daughters.",
      "type": "material",
      "date": "1933-08-16",
      "source": "respondents"
    },
    {
      "id": "f4",
      "text": "Nagaraju died soon after executing his will; first respondent took possession and enjoyed till forcibly ejected in 1943 by appellants.",
      "type": "material",
      "date": "1933",
      "source": "respondents"
    },
    {
      "id": "f5",
      "text": "Krishnavenamma granted lease in 1929 for six years to two tenants (Narasimhulu and Ramudu alias Mark).",
      "type": "background",
      "date": "1929-05-06",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "After Krishnavenamma's death, tenants executed kadapa (Ex. D-4) on June 16, 1933, for five years to Seetaramayya and Ramakotayya (claimed reversioners), and reversioners executed cowle (Ex. D-5).",
      "type": "disputed",
      "date": "1933-06-16",
      "source": "appellants"
    },
    {
      "id": "f7",
      "text": "No payment of rents by tenants in 1933 and 1934; real fight for land started end 1935 or beginning 1936; no actual rent paid to reversioners.",
      "type": "material",
      "date": "1933-1936",
      "source": "trial_court"
    },
    {
      "id": "f8",
      "text": "In 1936, first respondent dispossessed tenants forcibly through her tenant Moka Subbarao and remained in possession through tenant till November 1943.",
      "type": "material",
      "date": "1936",
      "source": "trial_court"
    },
    {
      "id": "f9",
      "text": "Appellants purchased property in 1942 from Seetaramayya and Ramakotayya and forcibly dispossessed first respondent in November 1943.",
      "type": "procedural",
      "date": "1942-1943",
      "source": "appellants"
    },
    {
      "id": "f10",
      "text": "Suit filed by respondents in June 1944 for possession and mesne profits.",
      "type": "procedural",
      "date": "1944-06",
      "source": "respondents"
    },
    {
      "id": "f11",
      "text": "Trial court found Subbarayudu's will not proved, no title in Seetaramayya/Ramakotayya as reversioners; no title either party; first respondent had earlier possession from 1936.",
      "type": "procedural",
      "date": null,
      "source": "trial_court"
    },
    {
      "id": "f12",
      "text": "Subordinate Judge upheld no title findings; held reversioners had possession from 1933 via kadapa/cowle, dismissed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court in second appeal remanded for finding on whether tenants really attorned; Subordinate Judge on remand found no effective possession by reversioners (mere paper transaction, no rent), tenants held as rightful owner; first respondent possession from 1936 earlier than appellants 1943.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "High Court accepted finding, restored trial court decree.",
      "type": "procedural",
      "date": "1955-06-29",
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court had jurisdiction in second appeal to interfere with the first appellate court's finding of fact on possession, by calling for a fresh finding on effective possession.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "In a possessory title case, whether mere paper attornment (kadapa) by tenants to claimed reversioners (without title and without rent payment) constitutes effective possession.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court had no jurisdiction in second appeal to reverse finding of fact by first appellate court that reversioners had possession from 1933; indirectly reversed by calling for further finding.",
      "supporting_facts": [
        "f12",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Reversioners obtained possession peacefully in 1933 via kadapa and cowle; appellants derived title therefrom with earlier possession.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "First appellate court gave no finding on crucial question of effective possession (rent payment post-kadapa); High Court justified in remanding as trial court found mere paper transaction, no rent paid 1933-1936.",
      "supporting_facts": [
        "f7",
        "f11",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "For effective possession via attornment without title, must show rent paid voluntarily or by decree; mere paper attornment insufficient against third parties.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court did not reverse fact finding but noted no finding by Subordinate Judge on effective possession (actual possession or via tenant paying rent); trial court found no rent paid, mere paper attornment insufficient without title.",
      "addresses_issue": "i1",
      "key_observation": "Effective possession requires rent payment post-attornment when no title; kadapa mere paper transaction."
    },
    {
      "id": "cr2",
      "text": "Attornment sufficient if true owner, but without title, needs real attornment with rent payment for effective possession in possessory title suit.",
      "addresses_issue": "i2",
      "key_observation": "Tenants estopped vs attornee but does not confer possessory title vs third parties without effective control via rent."
    },
    {
      "id": "cr3",
      "text": "Raghubar Dayal J. (separate): Kadapa not attornment but new lease (different terms, period, rent, lands); invalid as no title, so no possession via tenants.",
      "addresses_issue": "i2",
      "key_observation": "New lease from non-owners conveys no possession; tenants' possession traced to prior valid lease."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court had jurisdiction to remand for finding on effective possession as Subordinate Judge overlooked evidence on rent payment and gave no finding thereon.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Mere paper attornment (kadapa) without rent payment does not confer effective possession/possessory title to claimant without legal title.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Krisna Proshad Lal Singha Deo v. Baraboni Coal Concern",
      "citation": "1937 L.R. 64 I.A. 311",
      "treatment": "referred",
      "relevance": "Explains scope of S.116 Evidence Act; attornment estops tenant from disputing derivative title of reversioner, but does not require actual rent payment for attornment to be effective."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Evidence Act",
      "sections": [
        "Section 116"
      ],
      "relevance": "Tenant estopped from denying title of landlord who let him in; does not apply to derivative title of subsequent reversioner without attornment/acceptance of rent creating estoppel."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding High Court's decree restoring trial court's order for possession and mesne profits to first respondent on basis of earlier possessory title from 1936 vs appellants from 1943.",
    "relief_granted": "Possession and mesne profits to respondents",
    "costs": "No order as to costs of this Court"
  },
  "key_quotes": [
    {
      "text": "By effective possession we mean either actual possession or possession through a tenant who must have paid rent voluntarily or under a decree to the person claiming possessory title.",
      "speaker": "court",
      "significance": "Defines 'effective possession' crucial to possessory title without legal title."
    },
    {
      "text": "A mere paper attornment would not be enough to establish as against third parties the possession of the person in whose favour attornment has been made.",
      "speaker": "court",
      "significance": "Distinguishes paper vs real attornment when no title."
    },
    {
      "text": "Such a document is not a deed of attornment but is a document accepting fresh tenancy.",
      "speaker": "court",
      "significance": "Dayal J. holding on why kadapa invalidates possession claim."
    }
  ],
  "_case_id": "1961_304",
  "_label": 0,
  "_text_length": 31815,
  "_extracted_at": "2026-02-10T19:34:11.809742"
}