{
  "metadata": {
    "case_name": "Legal Representatives of Rana Umanath Bakshsingh v. Allahabad Bank Limited",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 301 of 1960",
    "date_of_judgment": "1961-04-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant's father Rana Umanath Bakshsingh was the Talukdar of Khajurgaon.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On July 13, 1914, Rana Umanath Bakshsingh executed a simple mortgage in favour of the Allahabad Bank Limited (respondent) for Rs. 6,00,000 mortgaging proprietary rights in sixty-seven villages.",
      "type": "material",
      "date": "1914-07-13",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In May 1924, respondent filed suit for recovery of balance unpaid mortgage money by sale of mortgaged property.",
      "type": "procedural",
      "date": "1924-05",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In January 1925, preliminary decree passed for Rs. four lacs and odd.",
      "type": "procedural",
      "date": "1925-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In July 1926, preliminary decree made final directing sale of proprietary rights in sixty-seven villages.",
      "type": "procedural",
      "date": "1926-07",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In 1934, U. P. Agriculturists Relief Act passed; judgment-debtor applied for amendment of decree.",
      "type": "procedural",
      "date": "1934",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On October 19, 1936, decree amended under U. P. Agriculturists Relief Act; pending execution proceedings dropped as installments fixed.",
      "type": "procedural",
      "date": "1936-10-19",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On May 25, 1940, respondent applied for execution; objection on ground of limitation rejected.",
      "type": "procedural",
      "date": "1940-05-25",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Judgment-debtor had sir and khudkashat lands and zamindar's grove in the sixty-seven villages.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On July 1, 1952, U. P. Zamindari Abolition and Land Reforms Act, 1950 (1 of 1951) came into force; zamindari rights of judgment debtor abolished.",
      "type": "material",
      "date": "1952-07-01",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Taluka of Khajurgaon was an estate within meaning of the Act and vested in State by notification under s.4.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On September 29, 1952, respondent applied in execution to sell rights in trees and wells in abadi, buildings; bhumidari rights under s.18 in sir, khudkashat, grove land as substituted security; compensation money as substituted security.",
      "type": "procedural",
      "date": "1952-09-29",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Execution court held buildings, trees, wells in abadi liable to sale; entitled to compensation amount as substituted security; bhumidari rights under s.18 liable to sale.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appellant appealed to Allahabad High Court, Lucknow Bench; urged (i) bhumidari rights under s.18(i) not liable to sale; (ii) application dated September 29, 1952 was fresh execution application barred by time.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "High Court repelled contentions, held execution could proceed against bhumidari rights under s.18; 1952 application not fresh but within time; dismissed appeal.",
      "type": "procedural",
      "date": "1958-09-24",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Appellant obtained certificate from High Court to appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether bhumidari rights created under s.18 of U.P. Zamindari Abolition and Land Reforms Act, 1950 can be sold in execution of the mortgage decree.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the application dated September 29, 1952 was a fresh application for execution barred by limitation.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Proprietary rights in sixty-seven villages mortgaged vested in State under the Act; respondent entitled only to compensation payable to appellant under s.6(h) of the Act.",
      "supporting_facts": [
        "f2",
        "f10",
        "f11"
      ],
      "legal_basis": "U.P. Zamindari Abolition and Land Reforms Act, 1950 s.6(h)"
    },
    {
      "id": "pa2",
      "text": "Bhumidari rights under s.18 are new rights not existing in 1914, hence not covered by mortgage.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Application dated September 29, 1952 is fresh execution application filed over 12 years after amended decree, barred by time.",
      "supporting_facts": [
        "f12",
        "f7"
      ],
      "legal_basis": "Limitation Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Bhumidari rights under s.18 liable to sale as they represented proprietary rights mortgaged or as substituted security.",
      "supporting_facts": [
        "f2",
        "f9",
        "f12"
      ],
      "legal_basis": "U.P. Zamindari Abolition and Land Reforms Act, 1950 ss.9, 18"
    },
    {
      "id": "ra2",
      "text": "Sir, khudkashat and grove lands continued as property of appellant.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "U.P. Zamindari Abolition and Land Reforms Act, 1950 ss.9, 18"
    },
    {
      "id": "ra3",
      "text": "Application dated September 29, 1952 not fresh but continuation of earlier execution within time.",
      "supporting_facts": [
        "f8",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Proprietary rights including sir, khudkashat land and grove land vested in State under ss.4 and 6(a)(i); s.9 excepts wells, trees in abadi, buildings which continue to belong to intermediary.",
      "addresses_issue": "i1",
      "key_observation": "S.18 deems such lands settled with intermediary as bhumidari, creating new right, not continuation of old proprietary right."
    },
    {
      "id": "cr2",
      "text": "Bhumidari rights under s.18 not mortgaged in 1914 as new rights post-vesting.",
      "addresses_issue": "i1",
      "key_observation": "No compensation for s.18 lands as included in gross assets but excluded from net assets calculation."
    },
    {
      "id": "cr3",
      "text": "S.6(h) provides mortgagee cannot follow vested property but must enforce against interest in estate via s.73 TPA, i.e., compensation money.",
      "addresses_issue": "i1",
      "key_observation": "Bhumidari rights not compensation; special rights for cultivatory possession."
    },
    {
      "id": "cr4",
      "text": "Since appellant succeeds on first point, no need to consider limitation.",
      "addresses_issue": "i2",
      "key_observation": "Appellant conceded this."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Bhumidari rights created under s.18 of U.P. Zamindari Abolition and Land Reforms Act not liable to sale in execution of 1914 mortgage decree; mortgagee relegated to compensation per s.6(h) and s.73 TPA.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "U.P. Zamindari Abolition and Land Reforms Act, 1950 (Act 1 of 1951)",
      "sections": [
        "s.4",
        "s.6(a)(i)",
        "s.6(h)",
        "s.9",
        "s.18",
        "s.39",
        "s.44"
      ],
      "relevance": "Vesting of estates in State; exceptions for certain properties; creation of bhumidari rights; enforcement of pre-vesting mortgages only against compensation."
    },
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [
        "s.73"
      ],
      "relevance": "Mortgagee entitled to mortgage money from compensation on compulsory acquisition of mortgaged property."
    },
    {
      "name": "U.P. Agriculturists Relief Act, 1934",
      "sections": [],
      "relevance": "Decree amended thereunder in 1936."
    },
    {
      "name": "U.P. Zamindars Debt Reduction Act, 1953 (Act XV of 1953)",
      "sections": [
        "s.8(2)"
      ],
      "relevance": "Debts recoverable only from compensation and rehabilitation grant; does not affect construction of Zamindari Act s.6(h)."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; execution of decree by respondent not to be levied against bhumidari rights created under s.18 of the Act in favour of appellant.",
    "relief_granted": "Prohibition on sale of bhumidari rights in execution.",
    "costs": "Appellant awarded costs of Supreme Court and High Court."
  },
  "key_quotes": [
    {
      "text": "\"the way in which s. 18 is worded... shows that these three kinds of property vested in the State under s. 6(a)(i) and were then resettled with the intermediary on a new tenure and not in the same right, which he had in them before the vesting.\"",
      "speaker": "court",
      "significance": "Core reasoning that s.18 creates new bhumidari rights post-vesting."
    },
    {
      "text": "\"s.6(h) read with s.73 directs that the mortgagee shall proceed in the manner provided in s.73, namely, follow the compensation money, and there is no other way possible for him.\"",
      "speaker": "court",
      "significance": "Limits mortgage enforcement to compensation only."
    }
  ],
  "_case_id": "1961_353",
  "_label": 1,
  "_text_length": 21759,
  "_extracted_at": "2026-02-10T19:34:49.969640"
}