{
  "metadata": {
    "case_name": "Appellants v. Laxmi Narayan Chopra",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Civil Appeal No. 328 of 1958",
    "date_of_judgment": "1961-08-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "First respondent, Laxmi Narayan Chopra, carries on business as motor coach builder under the name Chopra Motors at factory 139, Regent Park, Tollygunge, Calcutta.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In the factory, a number of Universal Electric Motors are operated for working electric drills.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Within 100 feet of factory, Post and Telegraph Wireless Station functions as coast station communicating with ships at sea and handles public messages from Darjeeling, Shillong, Gauhati, Agartala, New Delhi.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In or about April 1953, severe electrical interference observed at station, attributed by experts to local induction from first respondent's factory.",
      "type": "material",
      "date": "1953-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "October 13, 1953: Senior Electric Inspector issued notice to first respondent to show cause why order under s.34(2)(b) of Act read with Notification No.4193-COM dated August 14, 1929 requiring discontinuation of Universal Electric Motors should not be made.",
      "type": "procedural",
      "date": "1953-10-13",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "After correspondence, December 1, 1953: Senior Electric Inspector made order under s.34(2)(b) requiring first respondent to remedy injuries affecting lines used for wireless telegraphic communications at Wireless Receiving Centre.",
      "type": "procedural",
      "date": "1953-12-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "January 12, 1954: First respondent filed petition in Calcutta High Court under Art.226 for writ of mandamus directing appellants to withdraw and cancel order and forbear from giving effect.",
      "type": "procedural",
      "date": "1954-01-12",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Petition heard by Sinha J., who rejected contention that no telegraph line existed and dismissed petition.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On appeal, Division Bench (Mookerjee ACJ and H.K. Bose J.) accepted contention, issued writ as prayed. Judgment dated September 12, 1956 in Appeal from Original Order No.15 of 1955.",
      "type": "procedural",
      "date": "1956-09-12",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Interference with reception at station attributable to local induction from factory; Senior Electric Inspector's affidavit states operation of drills caused interference by induction to existing lines and receiving apparatus containing wires used for telegraphic communication.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Construction of the expression 'telegraph line' in s.34(2)(b) of the Indian Electricity Act, 1910; whether it includes wires used in Post and Telegraph Wireless Station for receiving wireless telegraphic communications.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Definition of 'telegraph line' in Indian Telegraph Act, 1885 included by reference in Electricity Act is wide enough to take in electric lines used for wireless telegraph; Appellate Bench erred in invoking contemporanea expositio est optima et fortissima in lege for modern statute.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "s.34(2)(b) Indian Electricity Act 1910; s.3(4) Indian Telegraph Act 1885"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No telegraph line in Post and Telegraph Wireless Station within meaning of s.34(2)(b); notice without jurisdiction. Word 'line' connotes defined physical channel; wireless uses space transmission, not physical channel. Contemporanea expositio applies as Legislature in 1885 could not have contemplated wireless.",
      "supporting_facts": [
        "f3",
        "f9"
      ],
      "legal_basis": "s.34(2)(b) Indian Electricity Act 1910; s.3(4) Indian Telegraph Act 1885"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Telegraph line means wire or wires used for purpose of telegraph, which includes apparatus for receiving communications by electricity; wireless receiving station is 'telegraph'; wires used as aerials and inside apparatus for receiving communications qualify as telegraph lines.",
      "addresses_issue": "i1",
      "key_observation": "Wires are used for purpose of apparatus receiving communications by electricity."
    },
    {
      "id": "cr2",
      "text": "Rejects HC: 'telegraph line' not limited to continuous physical channel from transmission to reception; comprehensive enough for any wire used in receiving apparatus.",
      "addresses_issue": "i1",
      "key_observation": "Definition comprehensive."
    },
    {
      "id": "cr3",
      "text": "Contemporanea expositio applies to ancient statutes, not modern; modern legislatures presumed aware of evolving meanings; words capable of comprehending new situations should be so interpreted unless contrary intention.",
      "addresses_issue": "i1",
      "key_observation": "Unreasonable to confine to 1885 meaning in progressive society."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Expression 'telegraph line' sufficiently comprehensive to take in wires used for apparatus of Post and Telegraph Wireless Station.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Assheton Smith v. Owen",
      "citation": "1906 1 Ch. 179",
      "treatment": "referred",
      "relevance": "Declined to apply contemporanea expositio to Acts of 1793 and 1800."
    },
    {
      "case_name": "Attorney-General v. Edison Telephone Company of London",
      "citation": "1880 6 Q.B.D. 244",
      "treatment": "followed",
      "relevance": "Telephone held telegraph under Telegraphs Acts 1863-69 though not invented then; language embraces future discoveries."
    },
    {
      "case_name": "Regulation and Control of Radio Communication in Canada, In re",
      "citation": "1932 A.C. 304",
      "treatment": "followed",
      "relevance": "Broadcasting within s.92 British North America Act 1867 though not in vogue then."
    },
    {
      "case_name": "King v. Brislan ex parte Williams, The",
      "citation": "1935 54 CLR 262",
      "treatment": "followed",
      "relevance": "Radio broadcasting within 'postal, telegraphic, telephonic' services under Australian Act."
    },
    {
      "case_name": "James v. Commonwealth of Australia",
      "citation": "1936 A.C. 578",
      "treatment": "followed",
      "relevance": "Meaning of words changes with circumstances illustrating full import."
    },
    {
      "case_name": "State of Madras v. Gannon Dunkerley and Co. (Madras) Ltd.",
      "citation": "1959 SCR 379",
      "treatment": "followed",
      "relevance": "Statutory provisions apply to new facts if words capable of containing them."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Electricity Act, 1910",
      "sections": [
        "s.34(2)(b)",
        "s.2"
      ],
      "relevance": "Empowers government to order remedy if electric works injuriously affect telegraph line; incorporates definitions from Telegraph Act."
    },
    {
      "name": "Indian Telegraph Act, 1885",
      "sections": [
        "s.3(1)",
        "s.3(4)"
      ],
      "relevance": "'Telegraph' includes apparatus for receiving communications by electricity; 'telegraph line' is wire or wires used for purpose of telegraph."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.226"
      ],
      "relevance": "Basis for writ petition in High Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court sets aside High Court order, holds that 'telegraph line' includes wires in wireless station, dismisses petition filed by first respondent.",
    "relief_granted": "None to respondent; appellants' order under s.34(2)(b) upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'Telegraph line means a wire or wires used for the purpose of an appliance or apparatus for receiving telegraphic or other communications by means of electricity.'",
      "speaker": "court",
      "significance": "Combined reading of definitions central to holding."
    },
    {
      "text": "In a modern progressive society it would be unreasonable to confine the intention of a Legislature to the meaning attributable to the word used at the time the law was made.",
      "speaker": "court",
      "significance": "Rejects application of contemporanea expositio to modern statutes."
    },
    {
      "text": "The meaning of the words changes, but the changing circumstances illustrate and illuminate the full import of that meaning.",
      "speaker": "court",
      "significance": "Quotes Lord Wright on evolving interpretation."
    }
  ],
  "_case_id": "1961_375",
  "_label": 1,
  "_text_length": 16981,
  "_extracted_at": "2026-02-10T19:35:20.694675"
}