{
  "metadata": {
    "case_name": "Petition No. 32 of 1959",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "K. DAS, J."
    ],
    "case_number": "Petition No. 32 of 1959",
    "date_of_judgment": "1961-03-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner's husband Kunhi Moosa Haji carried on a hotel business in Karachi, Pakistan since 1936.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "In 1947, when Pakistan was set up, petitioner's husband was in Karachi.",
      "type": "admitted",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "At the end of August 1949, petitioner's husband returned to Malabar, India.",
      "type": "disputed",
      "date": "1949-08-31",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Petitioner's husband surreptitiously returned to India without a valid passport in 1953 and was arrested for infringement of the Foreigners Act.",
      "type": "material",
      "date": "1953",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "On December 7, 1953, Kunhi Moosa Haji transferred his right, title and interest in seven plots of land to his wife (petitioner).",
      "type": "procedural",
      "date": "1953-12-07",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "On December 8, 1954, notice issued to petitioner and her husband to show cause why Kunhi Moosa Haji should not be declared an evacuee and property as evacuee property under Administration of Evacuee Property Act, 1950.",
      "type": "procedural",
      "date": "1954-12-08",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Petitioner's husband did not appear to contest the notice; petitioner entered appearance through advocate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "By order dated January 29, 1955, Assistant Custodian of Evacuee Property, Tellicherry, declared Kunhi Moosa Haji an evacuee under s. 2(d) and plots evacuee property under s. 2(f).",
      "type": "procedural",
      "date": "1955-01-29",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Petitioner appealed to Deputy Custodian of Evacuee Property, Malabar; affirmed by order dated July 11, 1955.",
      "type": "procedural",
      "date": "1955-07-11",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Petitioner moved Deputy Custodian for review under s. 26(2); petition failed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Petitioner filed revision to Custodian-General, New Delhi; dismissed by order dated April 9, 1956.",
      "type": "procedural",
      "date": "1956-04-09",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Petitioner applied to Ministry of Rehabilitation for restoration under s. 16(1); rejected.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Petitioner filed writ petition under Art. 226 in Kerala High Court; withdrawn on ground of lack of territorial jurisdiction citing Arthur Import Export Company v. Collector of Customs.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Present writ petition under Art. 32 filed on March 5, 1959.",
      "type": "procedural",
      "date": "1959-03-05",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the petitioner can complain of an infringement of fundamental rights under Arts. 19(1)(f) and 31 in a petition under Art. 32, given final determinations by competent authorities under the Administration of Evacuee Property Act that her husband was an evacuee and the property evacuee property.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Notice issued on December 8, 1954 invalid due to non-compliance with rules, going to root of jurisdiction.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s. 7 of the Act"
    },
    {
      "id": "pa2",
      "text": "Findings that husband was evacuee and property evacuee property incorrect on merits.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Fundamental rights under Arts. 19(1)(f) and 31 infringed; entitled to writ for restoration of property.",
      "supporting_facts": [
        "f5",
        "f8",
        "f9",
        "f11"
      ],
      "legal_basis": "Arts. 19(1)(f), 31, 32"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Husband returned surreptitiously in 1953 without valid passport and arrested.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Foreigners Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No question of lack of jurisdiction; petitioner appeared and contested on merits, no jurisdiction point raised earlier.",
      "addresses_issue": "i1",
      "key_observation": "Notice did not suffer defect attracting jurisdiction question."
    },
    {
      "id": "cr2",
      "text": "Art. 32 jurisdiction only for enforcement of fundamental rights; here, competent authorities determined husband evacuee and property evacuee property, decisions final as not challenged via appeal/revision/special leave.",
      "addresses_issue": "i1",
      "key_observation": "As long as decisions stand, no infringement of fundamental right can be complained of under Art. 32."
    },
    {
      "id": "cr3",
      "text": "Petitioner could have challenged Custodian-General's order in appropriate High Court or by special leave to Supreme Court but did not; s. 28 bars challenge except constitutionally.",
      "addresses_issue": "i1",
      "key_observation": "Alleged right dependent on evacuee status; no nullity or voidness for want of jurisdiction."
    },
    {
      "id": "cr4",
      "text": "No constitutionality of Act challenged; cannot permit challenge on merits via Art. 32.",
      "addresses_issue": "i1",
      "key_observation": "Principle from Sahibzada case applies: where competent authority decision means right does not exist, no Art. 32 petition."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Writ petition under Art. 32 not maintainable where fundamental right alleged depends on final decision of competent authority on evacuee status, not challenged appropriately.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sahibzada Saiyed Muhammed Amirabbas Abbasi v. The State of Madhya Bharat",
      "citation": "1960 3 S.C.R. 138",
      "treatment": "followed",
      "relevance": "Principle that Art. 32 not available where competent court/authority decision means alleged right does not exist."
    },
    {
      "case_name": "Arthur Import Export Company, Bombay v. Collector of Customs, Cochin",
      "citation": "1958 18 K.L.J. 198",
      "treatment": "referred",
      "relevance": "Kerala High Court held no writ jurisdiction over superior tribunal outside territorial jurisdiction."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 19(1)(f)",
        "Art. 31",
        "Art. 32",
        "Art. 226",
        "Art. 227",
        "Art. 136"
      ],
      "relevance": "Fundamental rights enforcement; writ jurisdiction limits."
    },
    {
      "name": "Administration of Evacuee Property Act, 1950",
      "sections": [
        "s. 2(d)",
        "s. 2(f)",
        "s. 7",
        "s. 16(1)",
        "s. 26(2)",
        "s. 28"
      ],
      "relevance": "Definition of evacuee and evacuee property; notice, review, revision, restoration, finality of orders."
    },
    {
      "name": "Foreigners Act",
      "sections": [],
      "relevance": "Husband's alleged infringement on return to India."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The writ petition under Art. 32 dismissed as not maintainable; no infringement of fundamental rights where competent authorities' final decisions on evacuee status stand unchallenged appropriately.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "This Court can exercise jurisdiction under Art. 32 of the Constitution only in enforcement of the fundamental rights guaranteed by Part III of the Constitution.",
      "speaker": "court",
      "significance": "Limits Art. 32 to actual fundamental rights enforcement."
    },
    {
      "text": "As long as that decision stands, the petitioner cannot complain of any infringement of a fundamental right.",
      "speaker": "court",
      "significance": "Finality of competent authority decisions bars Art. 32 claim."
    },
    {
      "text": "The alleged fundamental right of the petitioner is really dependent on whether Kunhi Moosa Haji was an evacuee and whether his property is evacuee property.",
      "speaker": "court",
      "significance": "Links property right claim to evacuee determination."
    }
  ],
  "_case_id": "1961_246",
  "_label": 0,
  "_text_length": 10992,
  "_extracted_at": "2026-02-10T19:33:27.634289"
}