{
  "metadata": {
    "case_name": "Dr. Gopal Das Varma v. Dr. Bhardwaj",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 278 of 1959",
    "date_of_judgment": "1961-05-02"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Dr. Gopal Das Varma owns a double-storeyed house known as 28, Barakhamba Road, New Delhi. Ground floor consists of a block of offices and first floor consists of four flats; three occupied by appellant, fourth let to respondent 1 Dr. Bhardwaj.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent 1 Dr. Bhardwaj is an ear, nose, throat specialist; he and wife respondent 2 reside in one room of the flat, other three rooms used for his profession.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent 1 took premises on lease as early as 1934; executed tenancy agreement on November 8, 1935 for Rs. 90 per month payable in advance, tenancy from October 1, 1935 to September 30, 1936, to be renewed yearly; tenancy renewed from year to year, flat still in possession of respondent 1.",
      "type": "background",
      "date": "1934-11-08",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In October 1953, appellant sued respondents for ejectment alleging bona fide requirement for occupation as residence for himself and family under s.13(1)(e), and that respondent 1 built suitable residence in Golf Links Area under s.13(1)(h) of Delhi and Ajmer Rent Control Act, 1952.",
      "type": "procedural",
      "date": "1953-10",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Respondent 2 pleaded she is not the tenant; alleged she and not respondent 1 built Golf Links house. Respondent 1 admitted tenancy but denied bona fide requirement, stated using premises for medical profession, Golf Links house belongs to wife.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Trial judge found: respondent 1 alone tenant; premises let for residential purpose; constructed for residential; professional use does not change to non-residential; respondent 1 built Golf Links house suitable for residence; s.13(1)(h) satisfied; no bona fide need under s.13(1)(e); decree for ejectment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellate court (Senior Sub Judge, Delhi): premises not built/inferred for residential alone; let for residence and professional work since inception without objection; proviso to s.13(1)(e) not satisfied; not residential premises under s.13(1)(e) and (h); appeal allowed, ejectment decree set aside.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Punjab High Court in Civil Revision No. 239 of 1956 dated April 2, 1957: agreed with appellate court; premises let for residence and medical profession; alternatively, no bona fide requirement, Golf Links not suitable for business due to locality; revisional application dismissed.",
      "type": "procedural",
      "date": "1957-04-02",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Right from commencement of tenancy, substantial part used for professional purpose with consent of landlord.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In 1941 onwards, respondent 1 urged tenancy for residence to secure extension under cl.11A New Delhi House Rent Control Order, 1939.",
      "type": "background",
      "date": "1941",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "In 1942, appellant demanded increased rent claiming tenancy under para 4 Part A Second Schedule, inconsistent with present claim of residential only.",
      "type": "background",
      "date": "1942",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the premises were let for residential purposes within s.13(1)(e) of the Act, given incidental professional use with landlord's consent.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether s.13(1)(h) applies where tenant has acquired suitable residence, but tenancy includes professional use.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether premises fall within definition of 'premises' under s.2(g) if used for residence and profession.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether respondent 1 estopped from claiming non-residential tenancy due to prior representations.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellant requires premises bona fide for personal residence under s.13(1)(e); respondent 1 built suitable residence in Golf Links.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s.13(1)(e) and (h) Delhi and Ajmer Rent Control Act, 1952"
    },
    {
      "id": "pa2",
      "text": "Professional use does not make tenancy non-residential; finding of mixed use takes premises outside s.2(g).",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "s.2(g) Delhi and Ajmer Rent Control Act, 1952"
    },
    {
      "id": "pa3",
      "text": "s.13(1)(h) applies independently even if s.13(1)(e) does not; suitable residence acquired by tenant.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.13(1)(h) Delhi and Ajmer Rent Control Act, 1952"
    },
    {
      "id": "pa4",
      "text": "Respondent 1 cannot approbate and reprobate; prior claims of residential tenancy estop him.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No bona fide requirement; premises used for residence and profession since inception with consent; not residential under s.13(1)(e).",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": "Explanation to s.13(1)(e), proviso Delhi and Ajmer Rent Control Act, 1952"
    },
    {
      "id": "ra2",
      "text": "Golf Links house built by respondent 2, not suitable for profession due to locality.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "s.13(1)(h) Delhi and Ajmer Rent Control Act, 1952"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Premises used incidentally for professional purposes with landlord's consent from commencement; takes case outside s.13(1)(e) as not residential premises alone.",
      "addresses_issue": "i1",
      "key_observation": "Professional use of substantial part with consent means landlord not entitled to eject even if bona fide need proved."
    },
    {
      "id": "cr2",
      "text": "s.2(g) includes premises let for residence and commercial/professional combined under 'any other purpose'; Act applies.",
      "addresses_issue": "i3",
      "key_observation": "Mixed use does not exclude from definition of premises."
    },
    {
      "id": "cr3",
      "text": "s.13(1)(h) applies to residential tenancies; where tenancy for residence and profession, acquired residence not suitable for professional purpose.",
      "addresses_issue": "i2",
      "key_observation": "Suitability must match tenancy purpose including profession."
    },
    {
      "id": "cr4",
      "text": "Approbate/reprobate plea not raised earlier, requires evidence; not allowed in Art.136 appeal; conduct of both parties inconsistent.",
      "addresses_issue": "i4",
      "key_observation": "New pleas needing evidence not permitted."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Premises not let for residential purposes alone due to professional use with consent; s.13(1)(e) inapplicable.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "s.13(1)(h) inapplicable to mixed residence-profession tenancy as acquired premises suitable for residence alone.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Premises within s.2(g); approbate/reprobate plea unavailable.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Delhi and Ajmer Rent Control Act, 1952 (Act XXXVIII of 1952)",
      "sections": [
        "s.2(g)",
        "s.13(1)(e)",
        "s.13(1)(h)"
      ],
      "relevance": "Defines premises; grounds for ejectment if residential and bona fide need or tenant acquires suitable residence; explanation excludes incidental professional use with consent."
    },
    {
      "name": "New Delhi House Rent Control Order, 1939",
      "sections": [
        "cl.11A",
        "r.81(2)(bb) Defence of India Rules"
      ],
      "relevance": "Prior extension of tenancy claimed as residential."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by special leave, upheld High Court and appellate court orders setting aside ejectment decree; no decree for possession passed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "where premises are let for residential purposes and it is shown that they are used by the tenant incidentally for commercial, professional or other purposes with the consent of the landlord the landlord would not be entitled to eject the tenant even if he proves that he needs the premises bona fide for his personal use",
      "speaker": "court",
      "significance": "Core holding on s.13(1)(e) and effect of consent to mixed use."
    },
    {
      "text": "it would be unreasonable to hold that tenancy which has been created or used both for residence and profession can be successfully terminated merely by showing that the tenant has acquired a suitable residence.",
      "speaker": "court",
      "significance": "Explains inapplicability of s.13(1)(h) to mixed tenancies."
    }
  ],
  "_case_id": "1961_387",
  "_label": 0,
  "_text_length": 16148,
  "_extracted_at": "2026-02-10T19:35:23.355021"
}