{
  "metadata": {
    "case_name": "Gouri Prasad Bagaria and others v. Commissioner of Income-tax",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "For the assessment year 1945-46 corresponding to the financial year 1944-45, the Income-tax Officer found sum of Rs. 72,523 credited in the name of Ganesh Das Hanuman Prasad, father of the assessee.",
      "type": "material",
      "date": "1944-45",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The assessee stated that Rs. 72,523 represented the sale proceeds of gold purchased by him in 1918 in Bombay, that the gold was kept in the family chest, and that it was sold in the account year.",
      "type": "disputed",
      "date": "1918",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The entry in the account books in the name of the assessee's father was explained as being in accordance with Marwari Custom.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "In the pass book of the assessee, there was a withdrawal of Rs. 1,00,000 after a few days, and the assessee explained that the amount was given away to Messrs. Birla Brothers for purchasing a colliery.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "The Income-tax Officer did not accept this explanation, and treated this amount as income of the assessee from some undisclosed source.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The order of the Income-tax Officer was confirmed by the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On further appeal to the Tribunal, the explanation was accepted, and the amount was ordered to be excluded.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f8",
      "text": "The Tribunal believed the assessee's word in view of his conduct and past history, such as they had been able to see.",
      "type": "admitted",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "The Commissioner of Income-tax then applied for a reference, and the Income-tax Appellate Tribunal referred the case on the question: Whether, on the above facts and circumstances of this case, there was any material before the Tribunal to hold that the assessee purchased gold in the year 1918 which he sold in the year under consideration and the sum of Rs. 72,523 represents the sale proceeds of such gold?",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f10",
      "text": "The High Court of Calcutta dated December 14, 1955, answered the question in the negative.",
      "type": "procedural",
      "date": "1955-12-14",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The High Court called for a supplementary statement of the case under section 66(4) directing the Tribunal to state: a) whether the assessee was examined at all by the Appellate Bench; b) if he was, whether there is on the records any record of the examination; c) if there be, what the record is; d) even if there be no record, whether he was examined in fact; e) if examined in fact but no record, whether it is possible for the members to remember what he had said.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The supplementary statement was submitted by the original Judicial Member and an Accountant Member who had not heard the appeal; they consulted the previous Accountant Member who agreed; it was somewhat vague; they sent for the assessee again and examined him as to what had transpired; enclosed a copy of the statement.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f13",
      "text": "The High Court held that there was no material before the Tribunal on which it could be said that the assessee purchased gold in 1918 which he sold in the year of account.",
      "type": "procedural",
      "date": "1955-12-14",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the above facts and circumstances of this case, there was any material before the Tribunal to hold that the assessee purchased gold in the year 1918 which he sold in the year under consideration and the sum of Rs. 72,523 represents the sale proceeds of such gold?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The assessee's statement that Rs. 72,523 was sale proceeds of gold bought in 1918, kept in family chest per Marwari custom, and later Rs. 1,00,000 given to Birla Brothers for colliery, should be accepted as the Tribunal believed it based on his conduct and past history.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "There was no material before the Tribunal to hold that the assessee purchased gold in 1918 and sold it; the supplementary statement was vague and inadequate; no record of examination or reliable basis for believing the assessee.",
      "supporting_facts": [
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": "Section 66(4) of the Indian Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "This was a perfectly simple case in which a question of law hardly arose. The Tribunal had believed the assessee's word in view of his conduct and past history. Where the assessee's statement is believed, there is obviously material on which the finding is based and to seek for other material is tantamount to saying that a statement made by an assessee is not material on which a finding can be given.",
      "addresses_issue": "i1",
      "key_observation": "The assessee's believed statement is material for the finding."
    },
    {
      "id": "cr2",
      "text": "Treating the question as one of law, the answer is irresistible that there was material, viz., the statement of the assessee believed by the Tribunal, on which the finding could be given.",
      "addresses_issue": "i1",
      "key_observation": "High Court's answer must be set aside and question answered in the affirmative."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The assessee's statement believed by the Tribunal constitutes material for the finding that he purchased gold in 1918 and sold it for Rs. 72,523.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "66(1)",
        "66(4)"
      ],
      "relevance": "Governs income-tax reference and supplementary statement of the case"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court set aside the High Court of Calcutta's judgment and order dated December 14, 1955, answering the referred question in the affirmative, holding that the Tribunal had material (the assessee's believed statement) to exclude Rs. 72,523 from assessment.",
    "relief_granted": "High Court answer set aside; question answered in affirmative in favour of assessee.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Where the assessee's statement is believed, there is obviously material on which the finding is based and to seek for other material is tantamount to saying that a statement made by an assessee in not material on which a finding can be given.",
      "speaker": "court",
      "significance": "Core reasoning that assessee's testimony is sufficient material when believed."
    },
    {
      "text": "We have heard the parties at some length and examined the personal history of the appellant. On the whole, the impression left in our minds is that his explanation has the ring of truth. We accept it and exclude the sum of Rs. 72,523 from the assessment.",
      "speaker": "tribunal",
      "significance": "Tribunal's acceptance of explanation, central to the dispute."
    }
  ],
  "_case_id": "1961_176",
  "_label": 1,
  "_text_length": 5744,
  "_extracted_at": "2026-02-10T19:31:52.443248"
}