{
  "metadata": {
    "case_name": "Sales Tax Officer v. M/s. Daulatram Rameshwarlal",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "Das Gupta J."
    ],
    "case_number": "Civil Appeals Nos. 45 and 46 of 1959",
    "date_of_judgment": "1960-09-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "M/s. Daulatram Rameshwarlal, a firm registered under the Indian Partnership Act, are registered dealers under s. 11 of the Bombay Sales Tax Act.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In their return of turnover for the period from April 1, 1954 to March 31, 1955, they claimed exemption from Sales Tax in respect of sales of cotton of the total value of Rs. 68,493-2-6 and sales of castor oil of the total value of Rs. 6,47,509-1-6 on the ground that these sales were on FOB contracts, under which they continued to be the owners of the goods till the goods had crossed the customs barrier and thus entered the export stream.",
      "type": "admitted",
      "date": "1954-04-01 to 1955-03-31",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The Sales Tax Officer rejected this claim for exemption and assessed them to sales tax on a taxable turnover including these sales. He also assessed them to purchase tax under s. 10(b) of the Bombay Sales Tax Act on their purchase of castor oil which they later sold for Rs. 6,47,509-1-6.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Notice of demand for the total sales tax and the purchase tax assessed was served on the sellers on September 30, 1956.",
      "type": "procedural",
      "date": "1956-09-30",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "The sellers moved the Bombay High Court under Art. 226 of the Constitution for writs quashing the assessment order and notice of demand and prohibiting enforcement.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Single Judge of Bombay High Court rejected the claim, holding goods did not remain sellers' property till customs frontier and purchase tax legal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellate Bench of Bombay High Court held sales exempt under Art. 286(1)(b) as property passed on shipment, but upheld purchase tax under s. 10(b); directed STO not to enforce sales tax demand on these sales.",
      "type": "procedural",
      "date": "1957-03-25",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Sales were under FOB contracts, as averred in paras 11 and 13 of writ petition not denied, assessment order referred to FOB basis, specimen contract used 'FOB delivered'.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Bill of lading taken in name of buyer but retained by sellers until payment against presentation of documents.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Export under buyer's export licence.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Export Control Order, 1954, cl. 5(2): goods for export shall be property of licensee at time of export.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Sellers furnished certificate under cl. (b) of s. 8 in respect of castor oil purchases, allowing their sellers deductions; sold to non-registered persons who despatched goods outside Bombay within 6 months.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether property in the goods passed on shipment or at some point of time before shipment, determining if sales exempt under Art. 286(1)(b).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether purchase tax under s. 10(b) of Bombay Sales Tax Act leviable where goods sold to non-registered persons who despatched outside State within 6 months.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "These were FOB contract sales; property passes on shipment after customs frontier, so sales in course of export exempt under Art. 286(1)(b).",
      "supporting_facts": [
        "f2",
        "f8"
      ],
      "legal_basis": "Art. 286(1)(b)"
    },
    {
      "id": "pa2",
      "text": "No purchase tax under s. 10(b) as 'a person to whom he has sold the goods' includes non-registered dealers who despatched outside State within 6 months; certificate under s. 8(b) complied with in intention and fact.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Bombay Sales Tax Act ss. 8(b), 10(b)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Property passed before shipment: bill of lading in buyer's name, export under buyer's licence, Export Control Order cl. 5(2) deems goods property of licensee (buyer) at time of export (crossing customs frontier).",
      "supporting_facts": [
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "Export Control Order 1954 cl. 5(2); precedents: Brandts case, Hardy v. Pound"
    },
    {
      "id": "ra2",
      "text": "'A person to whom he has sold the goods' in s. 10(b) means a registered dealer; since sold to non-registered persons, purchase tax leviable.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Bombay Sales Tax Act ss. 8(b), 10(b)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "FOB contracts: normal rule property passes on shipment; no special agreement to pass earlier despite bill of lading in buyer's name (retained by sellers till payment), buyer's licence (presumption in FOB), Export Control Order cl. 5(2) (export time when ship leaves port/beyond territorial waters, not customs frontier).",
      "addresses_issue": "i1",
      "key_observation": "No circumstances justify conclusion of special agreement for property to pass before shipment."
    },
    {
      "id": "cr2",
      "text": "S. 10(b): 'a person' means registered dealer as per scheme of ss. 8(b) and 10(b); despatch by non-registered buyer does not satisfy certificate requirement of despatch by him or registered dealer.",
      "addresses_issue": "i2",
      "key_observation": "Legislature insists on despatch by registered dealer; actual despatch by non-registered does not carry out declared intention."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In FOB contracts, absent special agreement, property passes on shipment after customs frontier; sales in course of export exempt under Art. 286(1)(b).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "'A person to whom he has sold the goods' in s. 10(b) means registered dealer; purchase tax leviable if sold to non-registered who despatched outside State.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Brandts case",
      "citation": "1917 2 K.B. 784",
      "treatment": "followed",
      "relevance": "In FOB contracts, duty of buyer to obtain export licence."
    },
    {
      "case_name": "Hardy v. Pound",
      "citation": "1955 1 Q.B. 499 (approved 1956 A.C. 588)",
      "treatment": "referred",
      "relevance": "Presumption in FOB that buyer obtains licence, but may vary by circumstances."
    },
    {
      "case_name": "United Motors Case",
      "citation": "1953 4 S.T.C. 133",
      "treatment": "distinguished",
      "relevance": "Course of export for Art. 286(1)(b) commences at customs barrier, but export under Export Control Order commences when ship leaves port."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 286(1)(b)",
        "Art. 226"
      ],
      "relevance": "Exemption for sales in course of export; writ jurisdiction."
    },
    {
      "name": "Bombay Sales Tax Act",
      "sections": [
        "s. 11",
        "s. 10(b)",
        "s. 8(b)",
        "Schedule B"
      ],
      "relevance": "Registration; purchase tax levy where s.8(b) certificate but no despatch by registered dealer outside State."
    },
    {
      "name": "Indian Partnership Act",
      "sections": [],
      "relevance": "Sellers are registered firm."
    },
    {
      "name": "Import and Export Control Act, 1947",
      "sections": [],
      "relevance": "Defines export as taking out of India by sea, land or air."
    },
    {
      "name": "Export Control Order, 1954",
      "sections": [
        "cl. 5(2)"
      ],
      "relevance": "Goods deemed property of licensee at time of export (ship leaving port/beyond territorial waters)."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "In Civil Appeal No. 45 of 1959 (STO), appeal dismissed: sales tax demand on FOB cotton and castor oil sales not enforceable, exempt under Art. 286(1)(b). In Civil Appeal No. 46 of 1959 (sellers), appeal dismissed: purchase tax under s. 10(b) upheld as sold to non-registered dealers.",
    "relief_granted": "Sellers relieved from sales tax on specified sales; no relief from purchase tax.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The normal rule in FOB contracts is that the property is intended to pass and does pass on the shipment of the goods.",
      "speaker": "court",
      "significance": "Core holding on when property passes in FOB contracts."
    },
    {
      "text": "It shall be deemed to be a condition of that licence that the goods for the export of which licence is granted shall be the property of the licensee at the time of the export.",
      "speaker": "court",
      "significance": "Quotes Export Control Order cl. 5(2), interpreted as not requiring passage before customs frontier."
    },
    {
      "text": "The courts below have rightly interpreted the words 'a person' in s. 10(b) of the Bombay Sales Tax Act as a registered dealer.",
      "speaker": "court",
      "significance": "Decides purchase tax liability."
    }
  ],
  "_case_id": "1961_389",
  "_label": 0,
  "_text_length": 17158,
  "_extracted_at": "2026-02-10T19:35:22.925433"
}