{
  "metadata": {
    "case_name": "Jetha Nand Betab v. Punjab High Court",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Civil Appeal No. 490 of 1860",
    "date_of_judgment": "1961-12-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant, Jetha Nand Betab was enrolled as an Advocate in the Chief Court of Sind on May 14, 1947.",
      "type": "background",
      "date": "1947-05-14",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "He came away to India at the end of the year 1948 and practised in the courts at Delhi.",
      "type": "background",
      "date": "1948-12-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On October 8, 1956 an order was passed by the Chief Justice of the Punjab High Court prohibiting the appellant from practising as an Advocate in the courts at Delhi.",
      "type": "procedural",
      "date": "1956-10-08",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "On November 8, 1956 the appellant presented an application to the High Court contending that by virtue of his having been enrolled as an Advocate in the Chief Court of Sind he was entitled to practice in all the subordinate courts within the territory of India.",
      "type": "procedural",
      "date": "1956-11-08",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "This petition was rejected by a Full Bench of the Punjab High Court on October 6, 1958 on the view that the appellant could not after the partition of India be considered to be an Advocate enrolled under the provisions of the Bar Councils Act.",
      "type": "procedural",
      "date": "1958-10-06",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Governor-General by notification declared Chief Court of Sind to be a High Court to which Indian Bar Councils Act applied and directed all provisions to come into force before 1947.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Partition of India occurred with effect from August 15, 1947; Sind ceased to form part of India and Chief Court of Sind ceased to be a High Court in India.",
      "type": "background",
      "date": "1947-08-15",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant's right to practise in subordinate courts in India under s.14 of the Indian Bar Councils Act continued after Sind ceased to form part of India on partition.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "As immediately before the partition of India he was entitled to practise in any court in British India his right to practise in those Courts continued to exist even when on partition of India, British India ceased to exist and provinces of India took their place and when thereafter on the formation of the Indian Union under the Constitution these provinces became States of India but those same courts continued, his right to practise in those courts also continued.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "s.14(1)(b) of the Indian Bar Councils Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The petitioner's right to practise in courts which were under the Chief Court of Sind ceased as soon as Sind ceased to form part of India and the Chief Court of Sind ceased to be a High Court in India.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Examined scheme of Indian Bar Councils Act, 1926: defined Advocate as one entered in roll of advocates of a High Court under the Act; s.8 requires name in roll to practise in High Court; s.14 entitles advocate to practise in any other Court in British India; s.10-12 provide for disciplinary actions including removal from roll.",
      "addresses_issue": "i1",
      "key_observation": "On May 14, 1947, appellant was enrolled as advocate for purposes of the Act and entitled to practise in subordinate courts in British India."
    },
    {
      "id": "cr2",
      "text": "s.2 defines 'advocate' as one whose name continues to be on the roll of a High Court; if removed under s.12, ceases to be advocate.",
      "addresses_issue": "i1",
      "key_observation": "If High Court ceases to exist, roll has no legal existence; person no longer advocate under s.14."
    },
    {
      "id": "cr3",
      "text": "Chief Court of Sind was High Court under Act by notification under s.1(2); post-partition, ceased to be High Court for India.",
      "addresses_issue": "i1",
      "key_observation": "Absurd to think Chief Court of Sind continued as High Court for Indian law after Sind left India."
    },
    {
      "id": "cr4",
      "text": "Indian Independence Act s.18(3) continued laws with adaptations; India Adaptation of Existing Indian Laws Order, 1947 s.5: reference to High Court ceasing post-appointed day (Aug 15, 1947) omitted; thus Chief Court of Sind omitted from Act's application.",
      "addresses_issue": "i1",
      "key_observation": "Roll of Chief Court of Sind no longer maintained by High Court under Act; appellant ceased to be advocate under s.14."
    },
    {
      "id": "cr5",
      "text": "Adaptation Order prevents future exercise of rights based on former High Courts now in Pakistan; no saving clause.",
      "addresses_issue": "i1",
      "key_observation": "If contention correct, no court in India could take disciplinary action against appellant, contrary to scheme of Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant ceased to be an advocate entitled to practise under s.14 of Indian Bar Councils Act after August 15, 1947; High Court rightly rejected application.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Bar Councils Act, 1926",
      "sections": [
        "s.1(2)",
        "s.2",
        "s.3",
        "s.4",
        "s.5",
        "s.8",
        "s.10",
        "s.11",
        "s.12",
        "s.14"
      ],
      "relevance": "Governs enrollment, rolls, practice rights, and disciplinary powers of advocates of High Courts; right under s.14 ceases if no longer on valid roll."
    },
    {
      "name": "Indian Independence Act, 1947",
      "sections": [
        "s.18(3)"
      ],
      "relevance": "Continued existing laws with adaptations post-partition."
    },
    {
      "name": "India Adaptation of Existing Indian Laws Order, 1947",
      "sections": [
        "s.5"
      ],
      "relevance": "Omitted references to High Courts ceasing post-Aug 15, 1947, including Chief Court of Sind; ended its status under Bar Councils Act."
    },
    {
      "name": "General Clauses Act, 1897",
      "sections": [
        "cl.24 s.3"
      ],
      "relevance": "Defines High Courts for application of Bar Councils Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed as the appellant is not entitled to practise in courts in India by virtue of his enrollment in the Chief Court of Sind, which ceased to be a High Court under Indian law after partition on August 15, 1947, per the Adaptation Order.",
    "relief_granted": null,
    "costs": "no order as to costs"
  },
  "key_quotes": [
    {
      "text": "An advocate entered in the roll of advocates can therefore mean only one whose name continues to be entered in that roll.",
      "speaker": "court",
      "significance": "Core interpretation of 'advocate' under s.2, key to denying continued right."
    },
    {
      "text": "If the High Court ceases to exist the roll which used to be maintained by it has also no legal existence and consequently a person whose name was in that roll, is no longer an advocate within the meaning of s. 14.",
      "speaker": "court",
      "significance": "Directly resolves effect of High Court ceasing post-partition."
    },
    {
      "text": "The necessary consequence of this is that the roll maintained by the Chief Court of Sind was from August 15, 1947 no longer a roll maintained by a High Court within the meaning of the Indian Bar Councils Act.",
      "speaker": "court",
      "significance": "Applies Adaptation Order to end practice rights."
    }
  ],
  "_case_id": "1961_277",
  "_label": 0,
  "_text_length": 10854,
  "_extracted_at": "2026-02-10T19:33:16.773588"
}