{
  "metadata": {
    "case_name": "Plaintiffs v. Devendra Singh",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Civil Appeal No. 379 of 1958",
    "date_of_judgment": "1961-09-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Babu Ram Singh died leaving properties.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Babu Ram Singh's widow adopted Devendra Singh on June 9, 1935.",
      "type": "material",
      "date": "1935-06-09",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Devendra Singh is Babu Ram Singh's widow's sister's daughter's son.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Plaintiffs would succeed to the properties left by Babu Ram Singh on the death of his widow but for the adoption of Devendra Singh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Plaintiffs brought suit for declaration that Devendra Singh was not adopted by the second defendant (Babu Ram Singh's widow) and that in any case the adoption is invalid in law so Devendra Singh acquired no right in the properties.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Babu Ram Singh was governed by Benaras School of the Mitakshara Hindu Law (plaintiffs' allegation of Mithila School negatived by courts below and abandoned).",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "No dispute as regards the factum of adoption.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Patna High Court in Appeal from Original Decree No. 169 of 1947 by judgment dated January 17, 1956 held adoption valid and dismissed suit.",
      "type": "procedural",
      "date": "1956-01-17",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Can a wife's sister's daughter's son be validly adopted to a person governed by the Benaras School of the Mitakshara Hindu Law?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Adoption invalid as Devendra Singh is wife's sister's daughter's son, excluded under Dattak Mimansa of Nanda Pandit due to Viruddha Sambandha (prohibited connection).",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Dattak Mimansa (Nanda Pandit); Whitley Stokes Hindu Law Books pp. 590-591"
    },
    {
      "id": "pa2",
      "text": "Great authority attaches to Dattak Mimansa on adoption questions.",
      "supporting_facts": [],
      "legal_basis": "Dattak Mimansa and Dattak Chandrika"
    },
    {
      "id": "pa3",
      "text": "No valid adoption unless legal marriage possible between adoptive father and adoptee's mother in maiden state; no legal marriage possible with wife's sister's daughter due to Viruddha Sambandha.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Rule accepted by High Courts except Bombay"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Dattak Mimansa and Dattak Chandrika bear high authority but caution required where they deviate from Smritis; Nanda Pandit's Viruddha Sambandha rule adds to existing law.",
      "addresses_issue": "i1",
      "key_observation": "Privy Council in Bhagwan Singh v. Bhagwan Singh recognized authority but not infallible."
    },
    {
      "id": "cr2",
      "text": "Nanda Pandit's rule against Viruddha Sambandha adoption is recommendation, not mandatory prohibition, as language does not specify invalidity.",
      "addresses_issue": "i1",
      "key_observation": "No clear indication of mandatory nature; courts distinguish recommendations from mandatory rules in Hindu texts."
    },
    {
      "id": "cr3",
      "text": "Ashvalayana's Viruddha Sambandha rule on marriage is recommendatory, not mandatory; not treated as invalidating marriage in digests or commentaries.",
      "addresses_issue": "i1",
      "key_observation": "Only bald reference in Nirnaya Sindhu; ignored by others like Raghunandana."
    },
    {
      "id": "cr4",
      "text": "Marriage with sapinda or sagotra girls invalid due to specific reasons (condemnatory clauses, etc.) absent for Viruddha Sambandha.",
      "addresses_issue": "i1",
      "key_observation": "Raghunandana in Udhvahatattva explains why first two rules mandatory."
    },
    {
      "id": "cr5",
      "text": "Marriage between man and wife's sister's daughter valid under Hindu Law.",
      "addresses_issue": "i1",
      "key_observation": "Supported by Dr. Gooroodas Banerjee, Dr. Jogendra Nath Bhattacharya, Ragavendra Rau v. Jayaram Rau."
    },
    {
      "id": "cr6",
      "text": "Rule requiring possible legal marriage for valid adoption fails as such marriage possible here.",
      "addresses_issue": "i1",
      "key_observation": "Viruddha Sambandha does not invalidate marriage."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Adoption of wife's sister's daughter's son is valid in law under Benaras School of Mitakshara Hindu Law.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Nanda Pandit's Viruddha Sambandha rule in adoption is recommendatory, not mandatory.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Marriage with wife's sister's daughter is valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bhagwan Singh v. Bhagwan Singh",
      "citation": "1899 L.R. 26 I.A. 153",
      "treatment": "followed",
      "relevance": "Recognized Dattak Mimansa and Dattak Chandrika as high authorities though not infallible."
    },
    {
      "case_name": "Rungama v. Atchama",
      "citation": "1846 T.A. 1, 97",
      "treatment": "referred",
      "relevance": "Lord Kingsdown's statements on Dattak texts."
    },
    {
      "case_name": "Collector of Madura v. Moottoo Ramlinga Sathupathy",
      "citation": "1863 12 M.I.A. 397, 437",
      "treatment": "referred",
      "relevance": "Sir James Colvile's statements on Dattak texts."
    },
    {
      "case_name": "Sri Balusu Gurulingaswami v. Sri Balasu Ramalakshmamma",
      "citation": "1899 L.R. 26 I.A. 113",
      "treatment": "followed",
      "relevance": "Caution in accepting glosses in Dattak texts deviating from Smritis; distinguish law from moral precepts."
    },
    {
      "case_name": "Rao Balwant Singh v. Rani Kishori",
      "citation": "1898 L.R. 25 I.A. 69",
      "treatment": "referred",
      "relevance": "Caution in interpreting Hindu texts."
    },
    {
      "case_name": "Minakshi v. Ramanada",
      "citation": "1886 I.L.R. 11 Mad. 49",
      "treatment": "distinguished",
      "relevance": "Discussed prohibitions on marriage including Viruddha Sambandha but not directly on point for adoption."
    },
    {
      "case_name": "Ragavendra Rau v. Jayaram Rau",
      "citation": "1897 I.L.R. 20 Mad. 283",
      "treatment": "followed",
      "relevance": "Held marriage with wife's sister's daughter valid."
    }
  ],
  "statutes_cited": [
    {
      "name": "Mitakshara Hindu Law (Benaras School)",
      "sections": [],
      "relevance": "Governing law for adoption validity."
    },
    {
      "name": "Dattak Mimansa (Nanda Pandit)",
      "sections": [],
      "relevance": "Source of Viruddha Sambandha rule argued as prohibiting adoption."
    },
    {
      "name": "Dattak Chandrika (Kuvera)",
      "sections": [],
      "relevance": "Authority on adoption alongside Dattak Mimansa."
    },
    {
      "name": "Ashvalayana Grihya Sutra",
      "sections": [],
      "relevance": "Source of Viruddha Sambandha in marriage, extended to adoption."
    },
    {
      "name": "Nirnaya Sindhu",
      "sections": [],
      "relevance": "Bald reference to Viruddha Sambandha marriage prohibition."
    },
    {
      "name": "Udhvahatattva (Raghunandana)",
      "sections": [],
      "relevance": "Explains mandatory nature of sapinda/sagotra marriage prohibitions."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upheld Patna High Court's decision that the adoption of Devendra Singh by Babu Ram Singh's widow is valid in law, and confirmed Devendra Singh's rights in the properties.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Can a wifes sisters daughters son be validly adopted to a person governed by the Benaras School of the Mitakshara Hindu Law? That is the main question raised in this appeal.",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "We do number think this language that adoption of a son of a Viruddha Sambandha girl should be avoided, can properly be taken as mandatory so that the rule must be obeyed on pain of the adoption being otherwise invalid in law.",
      "speaker": "court",
      "significance": "Key holding that Viruddha Sambandha rule is recommendatory."
    },
    {
      "text": "In our opinion a marriage of a Hindu with his wifes sisters daughter is number invalid in law even though it may number be liked by certain people.",
      "speaker": "court",
      "significance": "Determines validity of underlying marriage for adoption rule."
    },
    {
      "text": "We therefore hold that the High Court was right in its companyclusion that the adoption of a wifes sisters daughters son is valid in law.",
      "speaker": "court",
      "significance": "Final resolution upholding adoption."
    }
  ],
  "_case_id": "1961_75",
  "_label": 0,
  "_text_length": 21298,
  "_extracted_at": "2026-02-10T19:30:35.032682"
}