{
  "metadata": {
    "case_name": "Appellant (Husband of Bimla Devi) v. State",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Criminal Appeal No. 177 of 1959",
    "date_of_judgment": "1961-04-24"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Bimla Devi, P.W. 7, was married to the appellant in October, 1951.",
      "type": "background",
      "date": "1951-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Their relations got strained by 1953 and she went to her brothers place and stayed there for about a year, when she returned to her husbands place at the assurance of the appellants maternal uncle that she would not be maltreated in future.",
      "type": "background",
      "date": "1953",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "She was, however, ill-treated and her health deteriorated due to alleged maltreatment and deliberate undernourishment.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "In 1956, she was deliberately starved and was not allowed to leave the house and only sometimes a morsel or so used to be thrown to her as alms are given to beggars. She was denied food for days together and used to be given gram husk mixed in water after five or six days.",
      "type": "material",
      "date": "1956",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "She managed to go out of the house in April 1956, but Romesh Chander and Suresh Chander, brothers of the appellant, caught hold of her and forcibly dragged her inside the house where she was severely beaten. Thereafter, she was kept locked inside a room.",
      "type": "material",
      "date": "1956-04",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "On June 5, 1956, she happened to find her room unlocked, her mother-in-law and husband away and, availing of the opportunity, went out of the house and managed to reach the Civil Hospital, Ludhiana, where she met lady Doctor Mrs. Kumar, P. W. 2, and told her of her sufferings.",
      "type": "material",
      "date": "1956-06-05",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "The appellant and his mother went to the hospital and tried their best to take her back to the house, but were not allowed to do so by the lady Doctor.",
      "type": "material",
      "date": "1956-06-05",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Social workers got interested in the matter and informed the brother of Bimla Devi, one Madan Mohan, who came down to Ludhiana and, after learning all facts, sent information to the Police Station by letter on June 16, 1956.",
      "type": "procedural",
      "date": "1956-06-16",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "In his letter he said My sister Bimla Devi Sharma is lying in death bed. Her condition is very serious. I am told by her that deliberate attempt has been made by her husband, mother-in-law and brother-in-law and sister-in-law. I was also told that she was kept locked in a room for a long time and was beaten by all the above and was starved. I therefore request that a case may be registered and her statement be recorded, immediately.",
      "type": "material",
      "date": "1956-06-16",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "The same day, at 9-15 p.m., Dr. Miss Dalbir Dhillon sent a note to the police saying My patient Bimla Devi is actually ill. She may collapse any moment.",
      "type": "procedural",
      "date": "1956-06-16",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Shri Sehgal, Magistrate, P.W. 9, recorded her statement that night and stated in his note Blood transfusion is taking place through the right forearm and consequently the right hand of the patient is not free. It is not possible to get the thumb impression of the right hand thumb of the patient. That is why I have got her left hand thumb-impression.",
      "type": "procedural",
      "date": "1956-06-16",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The impression formed by the learned Judge of the High Court on seeing the photographs taken of Bimla Devi a few days later, is stated thus in the judgment The impression I formed on looking at the two photographs of Bimla was that at that time she appeared to be suffering from extreme emaciation. Her cheeks appeared to be hollow. The projecting bones of her body with little flesh on them made her appearance skeletal. The countenance seemed to be cadaverous.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court conclusion: So far as the basic allegations are concerned, which formed the gravamen of the offence, the veracity of her statement cannot be doubted. After a careful scrutiny of her statement, I find her allegations as to starvation, maltreatment, etc., true. The exaggerations and omissions to which my attention was drawn in her statement are inconsequential.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "After considering the entire evidence on record, the learned Judge said After having given anxious thought and careful consideration to the facts and circumstances as emerge from the lengthy evidence on the record, I cannot accept the argument of the learned counsel for the accused, that the condition of acute emaciation in which Bimla Devi was found on 5th of June, 1956, was not due to any calculated starvation but it was on account of prolonged illness, the nature of which was not known to the accused till Dr. Gulati had expressed his opinion that she was suffering from tuberculosis.",
      "type": "material",
      "date": "1956-06-05",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "The story of Bimla Devi as to how she was illtreated, and how, her end was attempted to be brought about or precipitated, is convincing, despite the novelty of the method in which the object was sought to be achieved. The conduct of the accused and of his mother on 5th of June, 1956, when soon after Bimla Devis admission in the hospital they insisted on taking her back home, is significant and almost tell-tale. It was not for better treatment or for any treatment that they wanted to take her back home. Their real object in doing so could be nothing other than to accelerate her end.",
      "type": "material",
      "date": "1956-06-05",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "The appellant was acquitted of the offence under s.342, Indian Penal Code, by the Additional Sessions Judge, who gave him the benefit of doubt, though he had come to the conclusion that Bimla Devis movements were restricted to a certain extent. The learned Judge of the High Court considered this question and came to a different conclusion.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on these facts an offence under s. 307, Indian Penal Code, had been established.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the ingredients of an offence under s. 307 are materially different from the ingredients of an offence under s. 511, Indian Penal Code, requiring the act to be the last act which, if effective, would constitute attempt to murder.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether regularly starving the wife constitutes an act under s.307, as it would not by itself cause death without continuation.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "It is only when a person is helpless and is unable to look after himself that the person having control over him is legally bound to look after his requirements and to see that he is adequately fed. Such persons, according to him, are infants, old people and lunatics. He contends that it is not part of a husbands duty to spoon-feed his wife, his duty being simply to provide funds and food.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The ingredients of an offence under s. 307 are materially different from the ingredients of an offence under s. 511, Indian Penal Code. The difference is that for an act to amount to the commission of the offence of attempting to commit an offence, it need not be the last act and can be the first act towards the commission of the offence, while for an offence under s. 307, it is the last act which, if effective to cause death, would constitute the offence of an attempt to commit murder.",
      "supporting_facts": [
        "f4",
        "f14"
      ],
      "legal_basis": "Section 307 IPC, Section 511 IPC"
    },
    {
      "id": "pa3",
      "text": "Even if Bimla Devi had been deprived of food for a certain period, the act of so depriving her does not come under s. 307, as that act could not, by itself, have caused her death, it being necessary for the period of starvation to continue for a longer period to cause death.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 307 IPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The condition of acute emaciation in which Bimla Devi was found on 5th of June, 1956, was not due to any calculated starvation but it was on account of prolonged illness, the nature of which was not known to the accused till Dr. Gulati had expressed his opinion that she was suffering from tuberculosis.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In view of the finding of the Court below about Bimla Devis being confined and being deprived of regular food in pursuance of a scheme of regularly starving her in order to accelerate her end, the responsibility of the appellant for the condition to which she was brought up to the 5th of June, 1956, is clear. The findings really go against any suggestion that the appellant had actually provided food and funds for his wife Bimla Devi.",
      "addresses_issue": "i1",
      "key_observation": "Responsibility clear due to confinement and starvation scheme."
    },
    {
      "id": "cr2",
      "text": "A person commits an offence under s. 307 when he has an intention to commit murder and, in pursuance of that intention, does an act towards its commission irrespective of the fact whether that act is the penultimate act or not. The intention to commit the offence of murder means that the person concerned has the intention to do certain act with the necessary intention or knowledge mentioned in s. 300.",
      "addresses_issue": "i2",
      "key_observation": "s.307 covers acts towards murder, not just penultimate act."
    },
    {
      "id": "cr3",
      "text": "The expression by that act does not mean that the immediate effect of the act committed must be death. Such a result must be the result of that act whether immediately or after a lapse of time. The word act again, does not mean only any particular, specific, instantaneous act of a person, but denotes, according to s. 33 of the Code, as well, a series of acts. The course of conduct adopted by the appellant in regularly starving Bimla Devi comprised a series of acts and therefore acts falling short of completing the series, and would therefore come within the purview of s. 307 of the Code.",
      "addresses_issue": "i3",
      "key_observation": "Starvation is a series of acts under s.307."
    },
    {
      "id": "cr4",
      "text": "In the present case, the intervening fact which thwarted the attempt of the appellant to commit the murder of Bimla Devi was her happening to escape from the house and succeeding in reaching the hospital and thereafter securing good medical treatment.",
      "addresses_issue": "i1",
      "key_observation": "Escape and treatment were intervening facts."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 307 IPC is committed when a person does any act with intention or knowledge, under circumstances that if death caused by that act, it would be murder.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "A series of acts like regular starvation constitutes an offence under s.307, even if not the final act.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Offence under s.307 established on facts of deliberate starvation to accelerate end.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Abhayanand Mishra v. The State of Bihar",
      "citation": "1962 2 S.C.R. 241",
      "treatment": "followed",
      "relevance": "A person commits attempt when intends offence, makes preparations, does act towards commission; act need not be penultimate."
    },
    {
      "case_name": "Queen Empress v. Nidha",
      "citation": "1892 I.L.R. 14 All. 38",
      "treatment": "referred",
      "relevance": "Act with evil intent done, even if obstacle intervenes unknown to accused, constitutes attempt under s.307."
    },
    {
      "case_name": "Regina v. Francis Cassidy",
      "citation": "1867 Bom. H.C. Reps. Vol. IV, P. 17 Crown Cases",
      "treatment": "distinguished",
      "relevance": "Held act must be capable of causing death in natural course; not approved."
    },
    {
      "case_name": "Emperor v. Vasudeo Balwant Gogte",
      "citation": "1932 I.L.R. 56 Bom 434",
      "treatment": "followed",
      "relevance": "s.307 means act with guilty intention such that but for intervening fact, would amount to murder in normal course."
    },
    {
      "case_name": "Mi Pu v. Emperor",
      "citation": "1909 10 Crl. L.J. 363",
      "treatment": "distinguished",
      "relevance": "Poison case under s.328/511 due to insufficient evidence of intent to kill."
    },
    {
      "case_name": "Jeetmal v. State",
      "citation": "A.I.R. 1950 Madhya Bharat 21",
      "treatment": "distinguished",
      "relevance": "Act under s.307 must be ordinarily capable of causing death; follows Cassidy, not approved."
    },
    {
      "case_name": "Rex v. White",
      "citation": "1910 2 K. B. 124",
      "treatment": "followed",
      "relevance": "Completion of one act in series intended to kill is attempt to murder, even if not immediately fatal."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "307",
        "308",
        "511",
        "342",
        "300",
        "33"
      ],
      "relevance": "s.307 covers acts (including series) with intent/knowledge that if caused death would be murder; distinguished from s.511; s.33 defines act as series."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave against Punjab High Court order dismissing appeal against conviction under s.307 IPC is dismissed. Conviction upheld based on findings of deliberate starvation as series of acts intending murder.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The course of conduct adopted by the appellant in regularly starving Bimla Devi comprised a series of acts and therefore acts falling short of completing the series, and would therefore come within the purview of s. 307 of the Code.",
      "speaker": "court",
      "significance": "Core holding on series of acts under s.307."
    },
    {
      "text": "So far as the basic allegations are concerned, which formed the gravamen of the offence, the veracity of her statement cannot be doubted.",
      "speaker": "lower_court",
      "significance": "High Court acceptance of prosecution case on starvation."
    },
    {
      "text": "Their real object in doing so could be nothing other than to accelerate her end.",
      "speaker": "lower_court",
      "significance": "Inference of intent from conduct at hospital."
    }
  ],
  "_case_id": "1961_52",
  "_label": 0,
  "_text_length": 20514,
  "_extracted_at": "2026-02-10T19:30:44.216668"
}