{
  "metadata": {
    "case_name": "Krisnamurti and Subbaji v. Dhruvraj",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Civil Appeal No. 499 of 1957",
    "date_of_judgment": "1961-05-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Bandegouda, father of the respondent, died in 1882, predeceasing his father Narasappagouda, who died later in 1892.",
      "type": "background",
      "date": "1882",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Bandegouda left his widow Tungabai.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Narasappagouda, on his death, left two daughters, Krishnabai and Shyamabai alias Chamavva, who succeeded to their father's property in equal shares.",
      "type": "background",
      "date": "1892",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The suit concerns the share of Krishnabai; respondent's suit with respect to Shyamabai's share was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Krishnabai died on October 21, 1933.",
      "type": "background",
      "date": "1933-10-21",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Krishnabai's son Vasappa succeeded her and died on February 20, 1934, leaving two sons, the appellants Krisnamurti and Subbaji.",
      "type": "background",
      "date": "1934-02-20",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Krishnabai alienated her share to Vasappa in 1930.",
      "type": "disputed",
      "date": "1930",
      "source": "appellants"
    },
    {
      "id": "f8",
      "text": "Tungabai adopted Dhruvraj as her son on July 31, 1945.",
      "type": "material",
      "date": "1945-07-31",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Dhruvraj instituted the suit for recovery of immovable properties from the appellants, alleging they formerly belonged to the joint family of Narasappagouda Patil and Bandegouda Patil, and for declaration of entitlement to Patilki rights in village Hombal as near relative of Narasappagouda.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Appellants denied respondent's rights, contending Krishnabai was full owner, properties became fresh stock of descent, and appellants inherited from father Vasappa.",
      "type": "disputed",
      "date": null,
      "source": "appellants"
    },
    {
      "id": "f11",
      "text": "Bombay High Court in Appeal No. 236 of 1950, judgment dated August 17, 1954, held alienation by Krishnabai to Vasappa in 1930 not binding on respondent as it was a gift without registered document, respondent could divest appellants of properties belonging to adoptive grandfather, and upheld trial court decree for property in Krishnabai's possession.",
      "type": "procedural",
      "date": "1954-08-17",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Dhruvraj, on his adoption by Tungabai, divests the defendants-appellants of the properties of his adoptive father Bandegouda and grandfather Narasappagouda.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Krishnabai was the full owner of the properties and thus became a fresh stock of descent; appellants inherited the properties from their father Vasappa to whom they had been alienated by Krishnabai in 1930.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Hindu law"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Immovable properties formerly belonged to the ownership of and were under the vahiwat of the joint family of Narasappagouda Patil and Bandegouda Patil; plaintiff entitled to recover them and to Patilki rights as near relative of Narasappagouda.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f8",
        "f9"
      ],
      "legal_basis": "Adoption relates back; joint family coparcenary property"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Principles from Shrinivas Krishnarao Kango: adopted son entitled to take in defeasance of prior rights by relation back to death of adoptive father; divests mother of adoptive father's estate; coparcenary subsists via widow's adoption; relation back applies only to adoptive father's estate, not collateral's; inheritance to collateral vests absolutely and cannot be divested.",
      "addresses_issue": "i1",
      "key_observation": "Claim relates to estate of collateral (grandfather via aunt Krishnabai), not adoptive father; inheritance once vested cannot be divested."
    },
    {
      "id": "cr2",
      "text": "Distinguished Amarendra Mansingh: estate was of adoptive father Brajendra, even if held by adoptive brother Bibhudendra's heir; not authority for recovering collateral's estate.",
      "addresses_issue": "i1",
      "key_observation": "Banamali heir of Bibhudendra considered heir of Brajendra."
    },
    {
      "id": "cr3",
      "text": "From Anant Bhikappa Patil: adopted son's right subject to prior binding alienations; no safeguard for property inherited from collateral as title defeasible on adoption.",
      "addresses_issue": "i1",
      "key_observation": "Krishnabai's title as full owner defeasible on Tungabai's adoption; appellants claim under her, so defeasible; property character remains coparcenary while widow exists."
    },
    {
      "id": "cr4",
      "text": "Distinguished Full Bench Bombay case Ramchandra Hammant Kulkarni: disagreed that subsequent adoption does not divest heir of heir of sole surviving coparcener; overlooked Shrinivas principles that heir of collateral inherits subject to defeasance.",
      "addresses_issue": "i1",
      "key_observation": "Plaintiff claims property of Dattu (collateral line), not Ramchandra; defeasance does not continue to Dattu's heir."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Adopted son cannot divest heir (or heir's heir) of collateral who inherited property from collateral prior to adoption; principle of relation back applies only to adoptive father's estate, not collateral's; inheritance vests and cannot be divested.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shrinivas Krishnarao Kango v. Narayan Deviji Kango and Ors.",
      "citation": "1955 1 S.C.R. 1",
      "treatment": "followed",
      "relevance": "Principles on adopted son's rights by relation back to adoptive father's estate, not collateral's; coparcenary via widow's adoption."
    },
    {
      "case_name": "Amarendra Mansingh v. Sanatan Singh",
      "citation": "1923 L.R. 60 I.A. 249",
      "treatment": "distinguished",
      "relevance": "Adopted son can divest heir of adoptive father, even if via collateral brother; not for pure collateral estate."
    },
    {
      "case_name": "Anant Bhikappa Patil (Minor) v. Shankar Ramchandra Patil",
      "citation": "1933 L.R. 70 I.A. 232",
      "treatment": "referred",
      "relevance": "Adopted son's rights subject to prior binding alienations; titles from collateral inheritance defeasible on adoption."
    },
    {
      "case_name": "Ramchandra Hammant Kulkarni v. Balaji Datto Kulkarni",
      "citation": "I.L.R 1955 Bom. 837",
      "treatment": "doubted",
      "relevance": "Full Bench held subsequent adoption does not divest heir of heir of sole coparcener; court disagreed, as overlooks defeasible title."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133"
      ],
      "relevance": "Certificate for appeal to Supreme Court"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed with costs; upholds Bombay High Court decree allowing respondent Dhruvraj to recover properties from appellants as adopted son entitled to divest defeasible titles tracing to adoptive grandfather via collateral aunt Krishnabai.",
    "relief_granted": "None to appellants; confirms respondent's decree for possession and rights",
    "costs": "Costs of this appeal to respondent"
  },
  "key_quotes": [
    {
      "text": "An adopted son is held entitled to take in defeasance of the rights acquired prior to his adoption... The principle of relation back applies only when the claim made by the adopted son relates to the estate of his adoptive father.",
      "speaker": "court",
      "significance": "Core principle distinguishing claims to adoptive father's vs. collateral's estate"
    },
    {
      "text": "With reference to the claim with respect to the estate of a collateral, the governing principle is that inheritance can never be in abeyance, and that once it devolves on a person who is the nearest heir under the law, it is thereafter not liable to be divested.",
      "speaker": "court",
      "significance": "Rules out divestment of vested collateral inheritance"
    },
    {
      "text": "We are therefore of opinion that this appeal should fail and accordingly dismiss it with costs of this appeal.",
      "speaker": "court",
      "significance": "Final disposition of the case"
    }
  ],
  "_case_id": "1961_422",
  "_label": 0,
  "_text_length": 14614,
  "_extracted_at": "2026-02-10T19:36:07.559950"
}