{
  "metadata": {
    "case_name": "Muniappan v. State",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Criminal Appeal No. 49 of 1961",
    "date_of_judgment": "1961-09-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Two days before the occurrence, the appellant Muniappan and Elumalai had a quarrel at a tea stall. Though the quarrel really was between the appellant and some others, Elumalai had intervened, made some remarks about the appellant, and advised the party opposite to him to make a complaint. Two reports of that incident were made, one by the appellant and the other by his rivals.",
      "type": "background",
      "date": "1960-01-22",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On January 24, 1960, at about 12.30 P.M., P.W. 1 Muthuswami Udayar was having a bath when he heard Elumalai calling out to him. Muthuswami Udayar ran to the place and found Elumalai with several stab wounds on his body. Elumalai told him that it was the appellant Muniappan who had caused injuries to him.",
      "type": "material",
      "date": "1960-01-24",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Muthuswami gave first aid to Elumalai, and meanwhile Elian alias Kundaswami P.W. 2 and K.R. Perumal P.W. 3 arrived. These persons carried Elumalai to the Police Station House which was at a distance of about 80 yards.",
      "type": "material",
      "date": "1960-01-24",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "The Sub-Inspector was seen approaching. Elumalai was taken to the verandah of the Police Station House. The Sub-Inspector recorded the statement of Elumalai: 'Sir, This day 24th January, 1960, in the noon at 12.30 Muniappan, son of Kola Goundan of Kannankurichi stabbed me in my body with knife.' After speaking one complete sentence, Elumalai could not speak further, died despite soda-water. Thumb-impression taken after death, attested by witnesses: Muthuswami Udayar, K.R. Perumal, C. Kannan, Kundaswami.",
      "type": "material",
      "date": "1960-01-24",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Muniappan reached the Police Station House after a few minutes and virtually surrendered himself. One of his clothes stained with blood was seized, and in one pocket a sheath was found and seized.",
      "type": "material",
      "date": "1960-01-24",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "On a statement by Muniappan, police recovered a knife from a garden, found stained with human blood.",
      "type": "material",
      "date": "1960-01-24",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Knife together with sheath purchased by Muniappan from Ameer Khan P.W. 6 on evening of January 23, 1960, for Rs. 6/- .",
      "type": "material",
      "date": "1960-01-23",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Appellant had an injury on his thumb of left hand on lateral side, apparently got while stabbing.",
      "type": "material",
      "date": "1960-01-24",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Appellant convicted under s. 302 I.P.C. and sentenced to death by trial court (Referred Trial No. 38 of 1960) and Madras High Court (Criminal Appeal No. 468 of 1960, judgment August 30, 1960).",
      "type": "procedural",
      "date": "1960-08-30",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Admissibility and probative value of the dying declaration recorded by the Sub-Inspector, which was incomplete as death intervened after one sentence, and thumb impression taken after death.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Sufficiency of evidence excluding eye-witness P.W. 2 and statement to doctor.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Evidence of eye-witness P.W. 2 and statement of appellant to doctor excluded. Dying declaration recorded by Sub-Inspector is incomplete, thumb impression taken dishonestly after death; inadmissible per Cyril Waugh v. The King. No sufficient evidence remains.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Cyril Waugh v. The King (1950 A.C. 203)"
    },
    {
      "id": "pa2",
      "text": "Incomplete dying declaration requires corroboration to be acted upon; distinguishes Abdul Sattar v. Mysore State as it had corroboration.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Abdul Sattar v. Mysore State"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Dying declaration is complete in accusation against appellant; admissible and reliable, no need for corroboration per Khushal Rao v. State of Bombay.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Khushal Rao v. State of Bombay"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Thumb impression ignored as taken after death, but not dishonest motive; Sub-Inspector noted death before it. Dying declaration complete in accusation - clearly names Muniappan as stabber; distinguishes Cyril Waugh v. The King as there incomplete and no identity named.",
      "addresses_issue": "i1",
      "key_observation": "Accusation against appellant complete, nothing to show Elumalai wished to say more."
    },
    {
      "id": "cr2",
      "text": "Cites Abdul Sattar v. Mysore State where similar incomplete but categorical dying declaration acted upon. Corroboration not always necessary if complete accusation.",
      "addresses_issue": "i1",
      "key_observation": "Here categorical and no need for corroboration."
    },
    {
      "id": "cr3",
      "text": "Corroborative evidence: dying declaration to PW1 Muthuswami; knife recovered on accused statement, human blood stained, sheath with accused identified by seller PW6; purchase previous evening; surrender within 10 minutes; thumb injury consistent with stabbing; prior quarrel motive.",
      "addresses_issue": "i2",
      "key_observation": "Sufficient evidence for conviction under s.302 IPC."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Dying declaration admissible, categorical, reliable; no hesitation in accepting it. Evidence sufficient to warrant conviction for murder under s.302 IPC.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Appeal against conviction and death sentence fails.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Cyril Waugh v. The King",
      "citation": "1950 A.C. 203",
      "treatment": "distinguished",
      "relevance": "Incomplete dying declaration excluded as no identity named and incomplete sentence had clue to identity."
    },
    {
      "case_name": "Khushal Rao v. State of Bombay",
      "citation": "1958 S.C.R. 552; A.I.R. 1958 S.C. 168",
      "treatment": "followed",
      "relevance": "Reliable dying declaration hardly needs corroboration."
    },
    {
      "case_name": "Abdul Sattar v. Mysore State",
      "citation": null,
      "treatment": "followed",
      "relevance": "Incomplete but categorical dying declaration indicating accused acted upon."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302"
      ],
      "relevance": "Offence of murder; appellant convicted and sentenced to death."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave against Madras High Court judgment upholding conviction under s.302 IPC and death sentence dismissed. Dying declaration accepted as complete and reliable, supported by corroborative evidence.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Sir, This day 24th January, 1960, in the noon at 12.30 Muniappan, son of Kola Goundan of Kannankurichi stabbed me in my body with knife.\"",
      "speaker": "court",
      "significance": "Verbatim dying declaration, held complete and categorical accusation."
    },
    {
      "text": "The dying declaration is, in our opinion, Categoric in character and unmistakably accuses the appellant of the crime and we have no hesitation in accepting it.",
      "speaker": "court",
      "significance": "Court's acceptance of dying declaration as reliable evidence."
    }
  ],
  "_case_id": "1961_399",
  "_label": 0,
  "_text_length": 10828,
  "_extracted_at": "2026-02-10T19:35:23.728138"
}