{
  "metadata": {
    "case_name": "Shaheen Motor Service v. Mysore State Transport Undertaking & Ors.",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Petition No. 109 of 1961",
    "date_of_judgment": "1961-04-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The petitioner, proprietor of Shaheen Motor Service, used to ply a motor bus for hire on the route Archalli to Saravanabelgola in Hassan District in the State of Mysore.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "A scheme under s. 68-C of the Motor Vehicles Act of 1939 was published by the Mysore Transport Undertaking.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The petitioner filed objections to the scheme before the State Government under s. 68-D of the Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The State Government, after considering the objections and hearing the petitioner, approved the scheme subject to a slight modification on December 22, 1959.",
      "type": "material",
      "date": "1959-12-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In pursuance of the approved scheme, the State Transport Undertaking (2nd respondent) made applications for permits.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Before the Regional Transport Authority, Hassan District (3rd respondent) could issue such permits, the present writ petition was filed praying for writ of certiorari to quash the scheme and writ of prohibition to the RTA to refrain from dealing with the applications unless duly published and notice given to petitioner.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "This Court by order dated March 21, 1961, granted leave to amend the writ petition to confine it to the second prayer only (writ of prohibition) and directed rule to issue only in respect thereof.",
      "type": "procedural",
      "date": "1961-03-21",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a writ of prohibition should issue to the Regional Transport Authority prohibiting it from dealing with applications for permits made by the State Transport Undertaking unless they are duly published and notice thereof given to the petitioner allowing representations thereon regarding compliance with s. 68-F(1) of Chapter IV-A.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under s. 57(3) in Chapter IV, applications for permit require prior publication with notice of date for representations; in consequence of s. 68-B of Chapter IV-A, these provisions apply.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Motor Vehicles Act ss. 57(3), 68-B"
    },
    {
      "id": "pa2",
      "text": "The Regional Transport Authority acts in a quasi-judicial capacity when dealing with applications for permits under s. 68-F(1), so the petitioner, affected by issue of permits, is entitled to notice.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Motor Vehicles Act s. 68-F(1)"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S. 68-B provides that Chapter IV-A prevails over inconsistent provisions in Chapter IV but does not make all Chapter IV provisions applicable; whether a Chapter IV provision applies must be examined separately if not inconsistent.",
      "addresses_issue": "i1",
      "key_observation": "S. 68-B presupposes some Chapter IV provisions may apply but gives no guidance; implicit application argument is fallacious."
    },
    {
      "id": "cr2",
      "text": "S. 57(3) duties (publication, notice for representations) do not apply to applications under s. 68-F(1), as RTA has no option to refuse permit if in pursuance of approved scheme and made in manner in Chapter IV; RTA's duty is to check compliance mechanically, no public input needed.",
      "addresses_issue": "i1",
      "key_observation": "Nature of matter under s. 68-F(1) does not attract s. 57(3); contrasts with normal permit applications where representations aid decision."
    },
    {
      "id": "cr3",
      "text": "In Srinivasa Reddy v. State of Mysore, s. 57(3) question not decided as application breached s. 57(2); s. 57(2) relates to manner of application and applies, but s. 57(3) does not.",
      "addresses_issue": "i1",
      "key_observation": "S. 57(3) not attracted to s. 68-F(1)."
    },
    {
      "id": "cr4",
      "text": "RTA does not act quasi-judicially under s. 68-F(1); under s. 68-F(2), actions (refuse renewal, cancel/modify permits) are mechanical to implement scheme, no lis; independent of s. 68-F(1).",
      "addresses_issue": "i1",
      "key_observation": "No lis between existing operators and State Undertaking."
    },
    {
      "id": "cr5",
      "text": "Even if attaching conditions under s. 48(3), RTA acts ministerially; regards public interest but no lis.",
      "addresses_issue": "i1",
      "key_observation": "RTA acts wholly in ministerial capacity under s. 68-F(1)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No permit can be granted without publication and notice argument is unsound; petitioner not entitled to relief.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Srinivasa Reddy v. State of Mysore",
      "citation": "1960 2 S.C.R. 130",
      "treatment": "referred",
      "relevance": "Question of s. 57(3) applicability to s. 68-F(1) raised but not decided; held s. 57(2) applies as manner of application."
    }
  ],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act, 1939",
      "sections": [
        "s. 68-C",
        "s. 68-D",
        "s. 68-B",
        "s. 57(3)",
        "s. 68-F(1)",
        "s. 68-F(2)",
        "s. 57(2)",
        "s. 48(3)",
        "Chapter IV",
        "Chapter IV-A"
      ],
      "relevance": "Scheme approval, permit applications by State Undertaking post-approved scheme; RTA must issue permit without discretion if compliant; s. 57(3) publication not applicable; ministerial function."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 32"
      ],
      "relevance": "Writ petition for enforcement of fundamental rights."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The writ petition confined to prayer for writ of prohibition against Regional Transport Authority from dealing with permit applications by State Transport Undertaking without publication and notice is dismissed; petitioner not entitled to any relief.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Regional Transport Authority acts wholly in a ministerial capacity while dealing with an application of the State Transport Undertaking under s. 68-F(1).",
      "speaker": "court",
      "significance": "Core holding rejecting quasi-judicial nature and notice requirement."
    },
    {
      "text": "Section 68-F(1) provides that the Regional Transport Authority shall issue such permit to the State Transport Undertaking, notwithstanding anything to the contrary contained in Chapter IV.",
      "speaker": "court",
      "significance": "Emphasizes mandatory issuance without discretion."
    },
    {
      "text": "Our conclusion therefore is that the petitioner's contention that no permit can be granted to the State Transport Undertaking until the applications for permit have been duly published and notices have been given to the petitioner of these applications is unsound.",
      "speaker": "court",
      "significance": "Directly resolves the issue against petitioner."
    }
  ],
  "_case_id": "1961_354",
  "_label": 0,
  "_text_length": 14029,
  "_extracted_at": "2026-02-10T19:34:45.112606"
}