{
  "metadata": {
    "case_name": "Dooars Tea Co. Ltd. v. Commissioner of Agricultural Income-tax, West Bengal",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 381 of 1960",
    "date_of_judgment": "1961-08-18"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant, Dooars Tea Co. Ltd., is a public limited company carrying on business of growing, manufacturing and selling tea.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant holds a large tract of land under lease from the local Government and grows bamboos, thatching grass and fuel timber on a part of the said land.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "During the accounting year 1948 corresponding to assessment year 1949-50, the appellant submitted a return showing agricultural income at Rs.3,45,702.",
      "type": "procedural",
      "date": "1948",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The Agricultural Income-tax Officer did not accept the return and increased the agricultural income to Rs.4,41,940, including Rs.39,849 representing the market value of bamboos, thatching grass and fuel timber.",
      "type": "material",
      "date": "1949-1950",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "In the relevant year, the appellant cut down bamboos, thatching grass and fuel timber grown on its land by agricultural operations carried on by its servants and labourers, and used the same for the purpose of its tea business without selling it.",
      "type": "material",
      "date": "1948",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant has been utilising bamboos, thatching grass and fuel timber grown on its land in this way every year.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The tax authorities and Tribunal held that the produce constituted agricultural income and affirmed the addition of Rs.39,849.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The Tribunal made a reference to the Calcutta High Court under s.63 of the Bengal Agricultural Income-Tax Act, 1944, on two questions.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The High Court answered both questions in the affirmative against the appellant vide judgment dated September 11, 1957, in Reference No. 102/1952.",
      "type": "procedural",
      "date": "1957-09-11",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The High Court granted a certificate under s.64 of the Act read with Art.135 of the Constitution, certifying it as a test case for tea companies.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Is bamboo, thatch, fuel, etc., grown by assessee company and utilised for its own benefits in its tea business, agricultural income within the meaning of the Bengal Agricultural Income-tax Act?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If the answer to question 1 be in the affirmative, can such income be computed under rule 4 of the rules framed under the Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The agricultural produce does not constitute agricultural income within the meaning of the Act because it had not been sold; agricultural produce grown on own land cannot be treated as income unless converted into money equivalent or sold, as there is no profit or gain without sale.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "s.2(1)(b) of Bengal Agricultural Income-Tax Act; definition of income under Income-tax Act s.2(1); precedents like Alexander Tennant v. Robert Sinclair Smith; Sir Kikabhai Premchand v. CIT"
    },
    {
      "id": "pa2",
      "text": "Even if it constitutes agricultural income, its market value cannot be computed in money because no rule has been framed for such computation; r.4 is inapplicable.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Rule 4 of Rules under the Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The produce falls under s.2(1)(b)(i) as income derived from such land by agriculture; income may mean cash or kind, and produce itself is agricultural income even if not sold.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "s.2(1)(b)(i) of the Act"
    },
    {
      "id": "ra2",
      "text": "Rule 4(2) applies to cases where produce has not been sold in the market, covering the present case.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Rule 4(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 2(1)(b)(i) includes income derived from land by agriculture, which covers agricultural produce itself used by assessee; word 'income' is wide and includes produce in kind without need for sale, as evidenced by structure of clauses (ii) and (iii) which specifically deal with processes and sale.",
      "addresses_issue": "i1",
      "key_observation": "No indication to import concept of sale into cl.(i); produce utilised for business constitutes income under s.2(1)(b)(i)."
    },
    {
      "id": "cr2",
      "text": "Rule 4(1) applies to market sales; Rule 4(2) is residuary, covering all other cases including where produce not sold at all; applies here for computation.",
      "addresses_issue": "i2",
      "key_observation": "Rule 4(2) deals with produce sold outside market or not sold."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Bamboo, thatch, fuel etc. grown and utilised in own business is agricultural income under s.2(1)(b)(i).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Such income can be computed under Rule 4(2).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Alexander Tennant v. Robert Sinclair Smith",
      "citation": "1892 A.C. 150",
      "treatment": "distinguished",
      "relevance": "Cited by appellant for income denoting profit/gain; distinguished as not applicable to agricultural produce."
    },
    {
      "case_name": "In re Micklethwait",
      "citation": "11 Ex. 456",
      "treatment": "referred",
      "relevance": "Well-established rule that subject not taxed without clear words."
    },
    {
      "case_name": "Sir Kikabhai Premchand v. Commissioner of Income-tax, Central, Bombay",
      "citation": "1954 S.C.R. 219",
      "treatment": "distinguished",
      "relevance": "Cited by appellant against taxing self-trading; distinguished."
    },
    {
      "case_name": "Commissioner of Income-tax v. Shaw Wallace Co.",
      "citation": "1932 L.R. 59 I.A. 206",
      "treatment": "followed",
      "relevance": "Income is wide term not limited by profits and gains."
    },
    {
      "case_name": "Captain Maharaj Kumar Gopal Saran Narain Singh v. Commissioner of Income-tax, Bihar and Orissa",
      "citation": "1935 L.R. 62 I.A. 207",
      "treatment": "followed",
      "relevance": "Income not limited by profits/gains; annuity taxable as income though no profit."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bengal Agricultural Income-Tax Act, 1944",
      "sections": [
        "s.2(1)(a)",
        "s.2(1)(b)",
        "s.3",
        "s.7",
        "s.63",
        "s.64",
        "s.57"
      ],
      "relevance": "Defines agricultural income; charging section; reference and certificate; computation; rule-making."
    },
    {
      "name": "Rules under Bengal Agricultural Income-Tax Act",
      "sections": [
        "Rule 4"
      ],
      "relevance": "Computation of market value of agricultural produce, including unsold produce."
    },
    {
      "name": "Income-tax Act",
      "sections": [
        "s.2(1)",
        "s.4",
        "s.6"
      ],
      "relevance": "Similar definition of agricultural income; income not limited to profits/gains."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.135",
        "Art.366(1)"
      ],
      "relevance": "Certificate for appeal; definition of agricultural income."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed, affirming the High Court that the produce constitutes agricultural income under s.2(1)(b)(i) taxable at market value under Rule 4(2).",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'income derived from such land by agriculture' ... agricultural produce constitutes income under this clause.",
      "speaker": "court",
      "significance": "Core holding on s.2(1)(b)(i) including unsold produce."
    },
    {
      "text": "Rule 4(2) is a residuary rule which applies to all cases not falling under r.1.",
      "speaker": "court",
      "significance": "Interpretation allowing computation of unsold produce value."
    },
    {
      "text": "The word income even as it is used in the Income-tax Act has often been characterised ... as formidably wide and vague in its scope.",
      "speaker": "court",
      "significance": "Rejects narrow view of income requiring sale/profit."
    }
  ],
  "_case_id": "1961_146",
  "_label": 0,
  "_text_length": 23680,
  "_extracted_at": "2026-02-10T19:31:16.472916"
}