{
  "metadata": {
    "case_name": "Appellant (Member of West Bengal Legislative Assembly) v. Respondents",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "SINHA, C.J."
    ],
    "case_number": "Criminal Appeal No. 65 of 1958",
    "date_of_judgment": "1961-01-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a citizen of India and an elected member of the West Bengal Legislative Assembly. He is also a medical practitioner at Ghatal in the Midnapore District of West Bengal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In January, 1954, the appellant gave notice of his intention to ask certain questions in the Assembly. Those questions were disallowed in accordance with the rules of procedure for the conduct of business of the Assembly.",
      "type": "material",
      "date": "1954-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In February, 1954, the appellant was informed that the questions proposed by him had been disallowed.",
      "type": "procedural",
      "date": "1954-02",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellant published the questions that had been disallowed in a local journal called Janamat, in its issue of February 28, 1955.",
      "type": "material",
      "date": "1955-02-28",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In July, 1955, the first respondent, whose conduct formed the subject-matter of the questions and who was then functioning as a Sub-divisional Magistrate, filed a complaint against the appellant and two others, the editor, and the printer and publisher respectively of the journal.",
      "type": "material",
      "date": "1955-07",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The petition of complaint alleged that the appellant had made and published scandalous imputations against him intending them to be read by members of the public, that those imputations were false and unfounded and had been made with the definite intention of harming or with the knowledge or having reason to believe that they would harm the reputation of the complainant.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "The complainant alleged that being a Government servant, he had to obtain the necessary permission from the Government for instituting legal proceedings for the vindication of his character as a public servant and that accounted for the delay in filing the petition of complaint.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The petition of complaint charged the appellant with an offence under s. 500 of the Indian Penal Code and the second and third accused under s. 501 of the Indian Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "After several adjournments, the petitioner raised, by way of preliminary objection to the criminal prosecution, the question of his absolute privilege and immunity from prosecution under the provision of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "The learned Magistrate by his order dated October 11, 1955, overruled the objection and held that the privilege claimed by the accused was not an unqualified one. He relied on a judgment of the Calcutta High Court in the case of Dr. Suresh Chandra Banerjee v. Punit Goala.",
      "type": "procedural",
      "date": "1955-10-11",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Thereafter, the appellant moved the High Court under Art. 228 of the Constitution for having the case withdrawn to the High Court for determination of the constitutional question raised by him by way of defence, but that application was dismissed by a Bench of the High Court on November 9, 1955.",
      "type": "procedural",
      "date": "1955-11-09",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The appellant again moved the High Court and obtained a rule on several grounds including the question of the proceedings being barred by the provisions of Art. 194 of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "The learned Single Judge dismissed the application holding that a member of the Legislative Assembly had no absolute privilege in respect of the questions sought to be asked by him, which had been disallowed but he had published them all the same. The questions had never been asked in the House and therefore could not be said to form part of the proceedings of the House. The publication in the journal at the instance of the appellant could by no means be said to have been under the authority of the House.",
      "type": "procedural",
      "date": "1956-04-11",
      "source": "high_court"
    },
    {
      "id": "f14",
      "text": "The appellant moved the learned Judge for a certificate under Art. 132 of the Constitution, but that application was also refused.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "The appellant then moved this Court and obtained special leave to appeal from the judgment of the High Court refusing the claim of privilege. He also obtained stay of further proceedings in the Court of the Magistrate. The hearing of the appeal was ordered to be expedited on October 1, 1956.",
      "type": "procedural",
      "date": "1956-10-01",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant, as a member of the West Bengal Legislative Assembly, enjoys absolute privilege under Article 194 of the Constitution in respect of publishing questions sought to be asked in the Assembly but disallowed by the Speaker, such that he is immune from prosecution under s. 500 IPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The learned Judge below had erred in his interpretation of the provisions of Art. 194 of the Constitution and that on a proper construction of those provisions it should have been held that questions sought to be asked by a member of a Legislative Assembly, even though disallowed by the Speaker, formed part of the proceedings of the House, and, as such, their publication would not attract the provisions of the Indian Penal Code.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "Article 194 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "The provisions of Art. 194 should be liberally construed in favour of persons like elected members of the Assembly who are rendering public service not only by making speeches and asking questions in the Assembly, but also by publishing them in the public press with a view to apprising the country and, particularly the constituency of what had been happening in the House.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": "Article 194 of the Constitution"
    },
    {
      "id": "pa3",
      "text": "There was an absolute privilege in favour of a member and that, therefore, he could not be prosecuted for having published the questions he sought to put, but had been disallowed by the Speaker.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "Article 194(3) of the Constitution; privileges of House of Commons"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The publication complained against in this case was not under the authority of the Legislative Assembly of West Bengal.",
      "supporting_facts": [
        "f4",
        "f13"
      ],
      "legal_basis": "Article 194(2) of the Constitution"
    },
    {
      "id": "ra2",
      "text": "A member of the Legislative Assembly had no absolute privilege in respect of the questions sought to be asked by him, which had been disallowed but he had published them all the same. The questions had never been asked in the House and therefore could not be said to form part of the proceedings of the House. The publication in the journal at the instance of the appellant could by no means be said to have been under the authority of the House.",
      "supporting_facts": [
        "f2",
        "f4",
        "f13"
      ],
      "legal_basis": "Article 194 of the Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Clause (1) of Art. 194 does not call for any comment in this case because no question as regards freedom of speech in the Legislature of a State has been raised.",
      "addresses_issue": "i1",
      "key_observation": "Cl. (1) not applicable."
    },
    {
      "id": "cr2",
      "text": "Clause (2) of Art. 194 has laid down a bar against any proceedings, civil or criminal against any member of a Legislature of a State in respect of anything said or any vote given by him in the Legislature or any Committee thereof and no person shall be liable in a civil or criminal proceeding in respect of the publication of any report, paper, votes or proceedings under the authority of a House of such a Legislature.",
      "addresses_issue": "i1",
      "key_observation": "Publication not under authority of House; not 'anything said' in Legislature."
    },
    {
      "id": "cr3",
      "text": "Reliance on cl. (3) of Art. 194: Publication of a disallowed question by a member of an Assembly does not come within the powers, privileges and immunities of the members of the House of Commons of the Parliament of the United Kingdom at the commencement of the Constitution.",
      "addresses_issue": "i1",
      "key_observation": "English law: No absolute privilege for separate publication of speeches or extracts."
    },
    {
      "id": "cr4",
      "text": "In England, immunity of a member of the House of Commons is in respect of speeches made by him in Parliament, but it does not extend to the publication of the debate outside Parliament. Publication of extracts not absolutely privileged.",
      "addresses_issue": "i1",
      "key_observation": "Cites R. v. Lord Abingdon, Creevey's case, Wason v. Walter."
    },
    {
      "id": "cr5",
      "text": "There is no absolute privilege attaching to the publication of extracts from proceedings in the House of Commons. A member has absolute privilege for what he has spoken within the four walls of the House, but only qualified privilege if he causes it to be published in the public press.",
      "addresses_issue": "i1",
      "key_observation": "Privileges same as House of Commons until codified."
    },
    {
      "id": "cr6",
      "text": "It is not necessary to decide whether disallowed questions form part of proceedings, as there is no absolute privilege even for extracts of proceedings.",
      "addresses_issue": "i1",
      "key_observation": "Per Rule 27 and 29 of Assembly rules."
    },
    {
      "id": "cr7",
      "text": "Unless absolute privilege made out, prosecution cannot be quashed. Appellant must take his trial.",
      "addresses_issue": "i1",
      "key_observation": "No opinion on merits."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The provisions of Art. 194 do not confer absolute privilege on a member of the State Legislature for publishing disallowed questions outside the House.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Publication of disallowed questions in a journal is not protected under Art. 194(2) as it is neither said in the House nor under authority of the House.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Under Art. 194(3), privileges mirror those of House of Commons, which provide no absolute immunity for separate publications of speeches or extracts.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dr. Suresh Chandra Banerjee v. Punit Goala",
      "citation": "55 C.W.N. 745",
      "treatment": "followed",
      "relevance": "Magistrate relied on it to hold no unqualified privilege."
    },
    {
      "case_name": "M. S. M. Sharma v. Shri Sri Krishna Sinha",
      "citation": "1959 Suppl. 1 S.C.R. 806",
      "treatment": "distinguished",
      "relevance": "Dealt with publication of expunged speech and Assembly's contempt powers, not penal liability."
    },
    {
      "case_name": "R. v. Lord Abingdon",
      "citation": "1794 1 Esp. 226; 170 E.R. 337",
      "treatment": "referred",
      "relevance": "Member liable for publishing his own defamatory speech separately."
    },
    {
      "case_name": "Rex v. Creevey",
      "citation": "1813 1 M. & S. 273; 105 E.R. 102",
      "treatment": "referred",
      "relevance": "Member liable for correcting and publishing report of his own speech."
    },
    {
      "case_name": "Wason v. Walter",
      "citation": "1868 L.R. 4 Q.B. 73",
      "treatment": "referred",
      "relevance": "Publication of partial reports of parliamentary proceedings not absolutely privileged, analogous to court reports."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 194",
        "Article 228",
        "Article 132"
      ],
      "relevance": "Art.194 provides privileges; claim of absolute immunity rejected. Art.228 and 132 for High Court jurisdiction."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 500",
        "Section 501",
        "Section 499"
      ],
      "relevance": "Prosecution under s.500 (defamation) against appellant, s.501 against others; s.499 exceptions noted but not extending to legislative proceedings."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The claim of absolute privilege under Art.194 is rejected. The prosecution under s.500 IPC is allowed to proceed before the Magistrate. No opinion expressed on the merits of the defamation charge as evidence not recorded.",
    "relief_granted": "None; stay vacated implicitly.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"a member of Parliament had certainly a right to publish his speech, but that speech should not be made a vehicle of slander against any individual if it was, it was a libel.\"",
      "speaker": "court",
      "significance": "Quotes Lord Kenyon from R. v. Lord Abingdon on no absolute privilege for separate publications."
    },
    {
      "text": "\"the publication of such a portion of the proceedings is not within the privilege attaching to the publication of a faithful report of the proceedings of a House of the State Legislature.\"",
      "speaker": "court",
      "significance": "From M.S.M. Sharma case, distinguishing expunged speech publication."
    },
    {
      "text": "\"unless the appellant can make out an absolute privilege, in his own favour, in respect of the publication which is the subject-matter of the charge in this case, the prosecution against him cannot be quashed.\"",
      "speaker": "court",
      "significance": "Core holding rejecting immunity claim."
    }
  ],
  "_case_id": "1961_235",
  "_label": 0,
  "_text_length": 16834,
  "_extracted_at": "2026-02-10T19:32:48.385682"
}