{
  "metadata": {
    "case_name": null,
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO, J."
    ],
    "case_number": "Civil Appeal No. 272 of 1956",
    "date_of_judgment": "1961-02-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Ramchandar Jat originally owned Annas -10/8 share in Mauza Tamalawadi while the rest belonged to others.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Ramchandar executed a simple mortgage deed on July 27, 1920, in favour of Seth Ram Jiwan and two minors Ram Narain and Radhey Sham. The plaintiffs-respondents are the representatives of the mortgagees.",
      "type": "material",
      "date": "1920-07-27",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On August 27, 1926, the defendant-appellant purchased Annas -/5/4 share belonging to the other shareholders in the village.",
      "type": "material",
      "date": "1926-08-27",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Thereafter, the appellant brought a suit against Ramchandar who was lambardar of the village for profits, in which a decree was passed against Ramchandar.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In execution of that decree the appellant purchased the entire Annas -/10/8 share of Ramchandar in the village about the year 1932.",
      "type": "material",
      "date": "1932",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In consequence, the appellant became the owner of the entire village subject to the mortgage of the respondents on Annas -/5/4 share therein.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On July 27, 1932, the respondents sued Ramchandar on the basis of their mortgage-deed and a preliminary decree for sale was passed in March, 1937. To this suit the appellant was also a party.",
      "type": "procedural",
      "date": "1932-07-27",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The preliminary decree was followed by a final decree and thereafter the property was put to sale and was purchased by the respondents on March 1, 1940. This sale was confirmed on April 12, 1940, and a sale certificate was granted to the respondents.",
      "type": "procedural",
      "date": "1940-03-01",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "So by the year 1940 the respondents were the owners of Annas -/5/4 share in the village while the appellant was the owner of Annas -/10/8 share. The appellant was also a lambardar.",
      "type": "material",
      "date": "1940",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Ramchandar Jat held sir land in certain khasras with a total area of 252-49 acres.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On the sale of Ramchandar's share to the appellant, Ramchandar became an ex-proprietary tenant of his sir land.",
      "type": "material",
      "date": "1932",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Thereafter Ramchandar was ejected from his ex-proprietary tenancy sometime in 1936 and the lands came into possession of the appellant.",
      "type": "material",
      "date": "1936",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "There were certain other lands which were nominally recorded as Muafi Khairati in the name of Ramchandar's mother but were actually in the possession of Ramchandar. It appears that Ramchandar was ejected from these lands also and they came into the possession of the appellant.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Further the appellant as a lambardar came into possession of certain other lands by surrender or otherwise.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The respondents filed a suit for partition before the Sub-Divisional Officer, Hard, in 1942. In that suit they claimed half share in the lands of Ramchandar and his mother which came into the possession of the appellant. They also claimed a share in other lands which came into the possession of the appellant as lambardar.",
      "type": "procedural",
      "date": "1942",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Their case was that these lands were accession to the mortgage in their favour and they were therefore entitled to a proper share in them.",
      "type": "disputed",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f17",
      "text": "This claim was resisted by the appellant before the Sub-Divisional Officer. On October 20, 1943, the Sub-Divisional Officer passed an order which in effect rejected the contention of the respondents and accepted the plea of the appellant.",
      "type": "procedural",
      "date": "1943-10-20",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Thereupon the respondents filed the present suit for a declaration in the civil court in 1944 claiming that they were entitled to a proportionate share in the lands specified in the plaint.",
      "type": "procedural",
      "date": "1944",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "The suit was resisted by the appellant and his contention was that the respondents had purchased specific khudkashat and chhotaghas plots and that they therefore could not be allowed anything more than what was mentioned in the decree and the sale certificate which were the basis of their title. As the specific lands with respect to which the respondents claimed a declaration in this suit were not mentioned in the sale certificate, they were not entitled to any share in them.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f20",
      "text": "A large number of issues were framed by the trial court, which decreed a part of the claim put forward by the respondents but dismissed the rest.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "Consequently, the respondents went up in appeal to the High Court. The appeal was allowed so far as the respondents claim to one-half share in the sir plots held by Ramchandar was concerned. Further, they were allowed one-third share in the lands held by the mother of Ramchandar and also in certain other lands which came into the possession of the appellant as lambardar subject to payment of certain amounts.",
      "type": "procedural",
      "date": "1954-06-28",
      "source": "lower_court"
    },
    {
      "id": "f22",
      "text": "This was followed by an application by the appellant for leave to appeal to this Court and a certificate was granted by the High Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f23",
      "text": "The mortgage was without possession and the property mortgaged was mentioned in these terms: I do hereby mortgage without possession half share -/5/4, five annas and four pies, area 678.31 acres, jama-sarkar Rs. 326/10/8 together with khudkashat, chhotaghas, big shrubs, abadi, gair abadi, cultivated and that lying vacant, and the rights and privileges appertaining to water, forests, chahat, gardens, and right of cultivation, malguzari and trees of every kind whether giving fruits or no fruits and prohibited and unprohibited wood with entire rights and privileges appertaining to the village.",
      "type": "material",
      "date": "1920-07-27",
      "source": "court"
    },
    {
      "id": "f24",
      "text": "It will be seen that what was mortgaged was the entire half share of Ramchandar in -/10/8 share which he owned in the village.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f25",
      "text": "In the plaint in the mortgage suit, the property subject to the mortgage is mentioned in para. 2 thereof in exactly the same terms as in the mortgage deed. In para. 13 it is again recited that the mortgagor mortgaged -/5/4 share out of his -/10/8 share. Paragraph 13 then goes on to say that on the date of the mortgage, the mortgagor had certain khudkashat and chhotaghas lands and both cultivating and proprietary rights in them pertaining to half share only were liable to be sold.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f26",
      "text": "The prayer in the suit was for sale of the mortgaged property together with khudkashat, etc.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f27",
      "text": "The sale certificate certifies that the respondents had purchased -/5/4 share in the village with abadi, khudkashat, chhotaghas and all rights pertaining to the share.",
      "type": "material",
      "date": "1940-04-12",
      "source": "court"
    },
    {
      "id": "f28",
      "text": "It appears that these lands came into the possession of Ramchandar after the mortgage but before the institution of the mortgage suit. They were nominally recorded in the name of his mother and in 1932 after his entire share was purchased by the appellant he was recorded as an occupancy tenant of these lands. Later the appellant came into possession of them apparently as a lambardar.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the mortgage deed of 1920 included the sir plots in the possession of Ramchandar or the plots of Ramchandar's mother.",
      "framed_by": "appellant"
    },
    {
      "id": "i2",
      "text": "Whether these plots were included in the suit brought by the respondents on the basis of the mortgage-deed and the sale certificate.",
      "framed_by": "appellant"
    },
    {
      "id": "i3",
      "text": "Whether the respondents were entitled to these plots as accession to the mortgage.",
      "framed_by": "appellant"
    },
    {
      "id": "i4",
      "text": "Whether sir land was included in the mortgage of the entire -/5/4 share out of -/10/8 share, despite not being specifically mentioned.",
      "framed_by": "court"
    },
    {
      "id": "i5",
      "text": "Whether sections 49 and 50 of the Central Provinces Tenancy Act required sanction for mortgaging sir land without possession.",
      "framed_by": "appellant"
    },
    {
      "id": "i6",
      "text": "Whether upon extinction of Ramchandar's ex-proprietary tenancy in 1936, the sir land became an accession to the mortgage under s.70 of the Transfer of Property Act.",
      "framed_by": "court"
    },
    {
      "id": "i7",
      "text": "Whether the claim to lands in the name of Ramchandar's mother was barred by O.11 r.2 CPC.",
      "framed_by": "appellant"
    },
    {
      "id": "i8",
      "text": "Whether respondents are entitled to share in lands acquired by appellant as lambardar.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The mortgage deed of 1920 which is the basis of the title of the respondents did not include the sir plots in the possession of Ramchandar nor the plots of Ramchandar's mother. Nor were these plots included in the suit which was brought by the respondents on the basis of the mortgage-deed. Further, the sale certificate also did not include these plots. Therefore, the respondents were not entitled to these plots as accession to the mortgage.",
      "supporting_facts": [
        "f2",
        "f7",
        "f8",
        "f23",
        "f25",
        "f27"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The reason why sir land was not mentioned in the mortgage deed of 1920 was that otherwise sanction of the Revenue Officer would have been required under s.50 of the Tenancy Act.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Central Provinces Tenancy Act, No. 1 of 1920 ss.49, 50"
    },
    {
      "id": "pa3",
      "text": "The respondents had purchased specific khudkashat and chhotaghas plots and that they therefore could not be allowed anything more than what was mentioned in the decree and the sale certificate which were the basis of their title. As the specific lands with respect to which the respondents claimed a declaration in this suit were not mentioned in the sale certificate, they were not entitled to any share in them.",
      "supporting_facts": [
        "f8",
        "f19",
        "f27"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "The claim of the respondents to lands in the name of Ramchandar's mother was barred by O.11, r.2 of the Code of Civil Procedure.",
      "supporting_facts": [
        "f28"
      ],
      "legal_basis": "Code of Civil Procedure O.11 r.2; Hazarilal v. Hazarimal; Seth Manakchand v. Chaube Manoharlal"
    },
    {
      "id": "pa5",
      "text": "Accession to be available to the mortgage must be a legal accession.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Transfer of Property Act s.70"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "These lands were accession to the mortgage in their favour and they were therefore entitled to a proper share in them.",
      "supporting_facts": [
        "f12",
        "f13",
        "f14",
        "f16"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "What was mortgaged was the entire half share of Ramchandar in -/10/8 share which he owned in the village. The description of certain other things is merely by way of precaution, for even if that part was not there, the respondents being the mortgagees of -/5/4 share would be entitled to everything contained in that share. The mortgage therefore does not cut down the amplitude of the mortgage with respect to the entire -/5/4 share out of -/10/8 share of Ramchandar.",
      "addresses_issue": "i4",
      "key_observation": "Sir is not specifically mentioned but as the mortgage was of the entire -/5/4 share out of -/10/8 share it will include unless there is a specific exclusion of sir the area of sir also pertaining to the share mortgaged."
    },
    {
      "id": "cr2",
      "text": "Sections 49 and 50 of the Tenancy Act only come into play when the proprietor making a transfer loses his right to occupy any portion of his sir land temporarily or permanently and sanction has to be obtained under s.50 only where the transfer is to be made without reservation of the right of occupancy. But the mortgage in this case is a simple mortgage and there was no transfer of possession under it. Therefore the proprietor Ramchandar never lost his right to occupy his sir land by this mortgage and there was therefore no necessity for him to make any reservation in that respect or to apply for sanction under s.50.",
      "addresses_issue": "i5",
      "key_observation": "As the mortgage deed of 1920 stands, it is a mortgage of all the proprietary rights in -/5/4 share including the proprietary right in the sir pertaining to that share but as the proprietor was not losing his right to occupy the sir land, the mortgage being without possession, it was not necessary for him to make any application under s.50 of the Tenancy Act."
    },
    {
      "id": "cr3",
      "text": "In the plaint in the mortgage suit the property is mentioned in exactly the same terms as in the mortgage deed. No mention was made of sir in para 13 but that was not necessary, for the mortgage included the mortgage of sir land also pertaining to -/5/4 share though without possession. The prayer for sale of the mortgaged property together with khudkashat etc. was a mere matter of precaution.",
      "addresses_issue": "i2",
      "key_observation": "In any case the entire proprietary right in sir, khudkashat, etc., relating to -/5/4 share would be sold on a decree following on the mortgage."
    },
    {
      "id": "cr4",
      "text": "The sale certificate certifies purchase of -/5/4 share with abadi, khudkashat, chhotaghas and all rights pertaining to the share. The words all rights pertaining to the share would include such proprietary rights in the sir land as belonged to the share mentioned in the sale certificate.",
      "addresses_issue": "i2",
      "key_observation": "So far as sir land is concerned, the proprietary right in it pertaining to -/5/4 share was mortgaged and the respondents by their sale certificate got a right in the sir land also."
    },
    {
      "id": "cr5",
      "text": "When Ramchandar's ex-proprietary rights came to an end and the land came into the possession of the appellant and became khudkashat, the mortgage would cover this khudkashat land to the extent of the mortgagees share therein. When the ex-proprietary tenancy was extinguished and this land came in the possession of the lambardar mortgagor it, was an accession to the mortgage under s.70 of the Transfer of Property Act and the mortgagees could claim a share in it.",
      "addresses_issue": "i6",
      "key_observation": "There is no illegality in the accession which took place. There is also no doubt that the accession took place when the mortgage was still subsisting."
    },
    {
      "id": "cr6",
      "text": "The cases cited by appellant do not apply, because they are cases of foreclosure while in the present case the respondents suit was for sale of the share mortgaged with them. Further in the plaint, when specifying the khudkashat plots it was made clear that they were khudkashat on the date of the mortgage thus did not specify the khudkashat plots on the date of the plaint. The suit was for the sale of the entire /5/4 share and that would include khudkashat lands pertaining to the share existing at the time when the suit was filed. It is not necessary in a suit for sale to specify the lands in the possession of the mortgagor specifically and they would pass on sale along with the share sold.",
      "addresses_issue": "i7",
      "key_observation": "The claim therefore would not be barred under O.11, r.2, on the ground that these plots entered in the name of the mother of Ramchandar were not specifically mentioned in the plaint."
    },
    {
      "id": "cr7",
      "text": "The respondents would clearly be entitled to a share in certain lands which came into the possession of the appellant as a lambardar in the ordinary course of management on payment of proportionate expenses incurred by the appellant.",
      "addresses_issue": "i8",
      "key_observation": "This is what the High Court has ordered and we see no reason to disagree with that view."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The mortgage deed of 1920 mortgaged all the proprietary rights in -/5/4 share including the proprietary right in the sir pertaining to that share.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No sanction under s.50 Tenancy Act was required for the simple mortgage without possession.",
      "resolves_issue": "i5",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "The proprietary right in sir land pertaining to -/5/4 share was mortgaged and passed to respondents via sale certificate.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Upon extinction of ex-proprietary tenancy, sir land became accession to mortgage under s.70 TPA, entitling respondents to half share.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "Claim to mother's lands not barred by O.11 r.2 CPC; respondents entitled to share as possession was for entire body of proprietors.",
      "resolves_issue": "i7",
      "in_favor_of": "respondent"
    },
    {
      "id": "h6",
      "text": "Respondents entitled to share in lambardar lands on payment of proportionate expenses.",
      "resolves_issue": "i8",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hazarilal v. Hazarimal",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Cited by appellant on bar under O.11 r.2 CPC but distinguished as case of foreclosure not sale."
    },
    {
      "case_name": "Seth Manakchand v. Chaube Manoharlal",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Cited by appellant on bar under O.11 r.2 CPC but distinguished as case of foreclosure not sale."
    },
    {
      "case_name": "Unnamed case",
      "citation": "A.I.R. 1923 Nag. 130",
      "treatment": "referred",
      "relevance": "Distinguishes appellant's cases as foreclosure vs sale."
    },
    {
      "case_name": "Unnamed case",
      "citation": "A.I.R. 1944 P.C 46",
      "treatment": "referred",
      "relevance": "Distinguishes appellant's cases as foreclosure vs sale."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Provinces Land Revenue Act, No. 11 of 1917",
      "sections": [
        "s.68",
        "s.69",
        "s.2(17)",
        "s.2(5)"
      ],
      "relevance": "Defines sir land and khudkashat; sir is part of home-farm but different from khudkashat."
    },
    {
      "name": "Central Provinces Tenancy Act, No. 1 of 1920",
      "sections": [
        "s.49",
        "s.50"
      ],
      "relevance": "Deals with transfer of sir land; no sanction needed for simple mortgage without possession as no loss of occupancy right."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "s.70"
      ],
      "relevance": "Accession to mortgaged property upon extinction of ex-proprietary tenancy."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "O.11 r.2"
      ],
      "relevance": "Does not bar claim in mortgage sale suit for unspecified lands pertaining to share."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's decision allowing the respondents' claim to one-half share in the sir plots held by Ramchandar, one-third share in the lands held by the mother of Ramchandar, and share in other lands possessed by appellant as lambardar subject to payment of certain amounts. The appeal is dismissed.",
    "relief_granted": "Respondents entitled to shares in disputed lands as per High Court order.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "As the mortgage was of the entire -/5/4 share out of -/10/8 share it will include unless there is a specific exclusion of sir the area of sir also pertaining to the share mortgaged.",
      "speaker": "court",
      "significance": "Core holding on inclusion of sir land in mortgage."
    },
    {
      "text": "When the ex-proprietary tenancy was extinguished and this land came in the possession of the lambardar mortgagor it, was an accession to the mortgage under s.70 of the Transfer of Property Act.",
      "speaker": "court",
      "significance": "Explains entitlement to accession post-extinction of tenancy."
    },
    {
      "text": "It is not necessary in a suit for sale to specify the lands in the possession of the mortgagor specifically and they would pass on sale along with the share sold.",
      "speaker": "court",
      "significance": "Rejects bar under O.11 r.2 CPC."
    }
  ],
  "_case_id": "1961_15",
  "_label": 0,
  "_text_length": 17712,
  "_extracted_at": "2026-02-10T19:30:09.772949"
}