{
  "metadata": {
    "case_name": "Badri Narain Singh v. Kam Deo Prasad Singh & Ors.",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Civil Appeal No. 563 of 1960",
    "date_of_judgment": "1961-09-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Badri Narain Singh, the appellant, and four other persons including Kam Deo Prasad (respondent No. 1) and respondent No. 2 were candidates to the Bihar Legislative Assembly during the general election held in 1957.",
      "type": "background",
      "date": "1957",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Two candidates withdrew before the relevant date.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant secured the largest number of votes and was declared elected on March 14, 1957.",
      "type": "material",
      "date": "1957-03-14",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent No. 2 secured larger number of votes than Kam Deo Prasad (respondent No. 1).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Kam Deo Prasad filed an election petition under ss. 80 and 81 of the Representation of the People Act, 1951 challenging the election of the appellant on grounds that nomination of appellant and respondent No. 2, as Ghatwals holding office of profit, was against s. 7 of the Act, and appellant committed corrupt practices.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Kam Deo Prasad prayed for declaration that election of appellant was void and that he himself was duly elected.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Appellant denied the allegations.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Election Tribunal held appellant guilty of corrupt practices and that a Ghatwal was not a holder of office of profit; set aside election of appellant but did not grant declaration that Kam Deo Prasad was duly elected.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellant filed Election Appeal No. 7 of 1958 in Patna High Court against order setting aside his election.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Kam Deo Prasad filed Election Appeal No. 8 of 1958 against order not declaring him duly elected.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "High Court by one judgment: did not accept corrupt practice finding; accepted that appellant and respondent No. 2 as Ghatwals held offices of profit under Bihar Government; confirmed setting aside of appellant's election; declared Kam Deo Prasad duly elected from Sarath State Assembly Constituency in Santal Parganas district.",
      "type": "procedural",
      "date": "1959-03-20",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Separate decrees prepared: Appeal No. 7 dismissed; Appeal No. 8 allowed declaring Kam Deo Prasad elected.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appellant filed appeal by special leave against order in Election Appeal No. 8 of 1958.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "All grounds of appeal relate to finding that office of Ghatwal is office of profit.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Preliminary objection by respondent No. 1 that appeal incompetent as barred by res judicata since appellant did not appeal against dismissal of his Appeal No. 7.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the office of a Ghatwal is an office of profit under the Bihar Government.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the appeal is barred by res judicata as appellant did not challenge the High Court's dismissal of Election Appeal No. 7 confirming setting aside of his election on ground of holding office of profit.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Judgment in Election Appeal No. 7 cannot operate as res judicata in this appeal, relying on Narhari v. Shankar.",
      "supporting_facts": [
        "f9",
        "f11",
        "f13"
      ],
      "legal_basis": "s. 11 Code of Civil Procedure"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appeal incompetent as barred by res judicata; order in Appeal No. 7 setting aside appellant's election final; finding on office of profit operates as res judicata; cannot challenge declaration in favour of respondent No. 1.",
      "supporting_facts": [
        "f9",
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": "Principle of res judicata"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Narhari v. Shankar distinguishable; concerned interpretation of s. 11 CPC in context of one suit with multiple appeals on common issues; here, Appeals Nos. 7 and 8 had different subject matters though from same Tribunal proceeding.",
      "addresses_issue": "i2",
      "key_observation": "Appeal No. 7 related to validity of appellant's election; Appeal No. 8 to declaration for respondent No. 1; two separate decisions despite one judgment."
    },
    {
      "id": "cr2",
      "text": "Finding on Ghatwal holding office of profit basis for both appeals but decisions separate; since order in Appeal No. 7 stands, appellant cannot question that finding in this appeal against Appeal No. 8.",
      "addresses_issue": "i2",
      "key_observation": "Res judicata applies; appellant cannot challenge correctness of finding on office of profit."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Principle of res judicata bars appellant from questioning High Court's finding that he held office of profit, as that finding part of unappealed dismissal of his Appeal No. 7.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Narhari v. Shankar",
      "citation": "1950 S.C.R. 754",
      "treatment": "distinguished",
      "relevance": "Distinguished on facts; does not apply to res judicata between separate appeals with different subject matters."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "s. 7",
        "s. 80",
        "s. 81"
      ],
      "relevance": "Grounds for challenging nomination and election; office of profit disqualification."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s. 11"
      ],
      "relevance": "Res judicata principle interpretation."
    },
    {
      "name": "Limitation Act",
      "sections": [
        "s. 5"
      ],
      "relevance": "Mentioned in context of Narhari case."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 374"
      ],
      "relevance": "Disposal of appeals to Judicial Committee by Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upholds preliminary objection; holds appeal incompetent due to res judicata from unappealed dismissal of appellant's High Court Appeal No. 7 confirming setting aside of his election on ground of holding office of profit.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "To conclude, the election of the returned candidate is not valid, and the order of the Tribunal is, therefore, right, though on different grounds. Further, there, was only one seat, and three persons contested it... the only person left in the field was the petitioner Kam Deo Prasad Singh, and, therefore, he must be declared to be duly elected.",
      "speaker": "court",
      "significance": "High Court's reasoning for declaring respondent No. 1 elected after invalidating others' nominations."
    },
    {
      "text": "It is not well settled that where there has been one trial, one finding, and one decision, there need not be two appeals even though two decrees may have been drawn up.",
      "speaker": "court",
      "significance": "Quote from Narhari v. Shankar distinguished by Supreme Court."
    },
    {
      "text": "We are therefore of opinion that so long as the order in the appellants appeal No. 7 confirming the order setting aside his election on the ground that he was a holder of an office of profit under the Bihar Government and therefore could not have been a properly nominated candidate stands, he cannot question the finding about his holding an office of profit.",
      "speaker": "court",
      "significance": "Core holding on res judicata application."
    }
  ],
  "_case_id": "1961_336",
  "_label": 0,
  "_text_length": 15832,
  "_extracted_at": "2026-02-10T19:34:44.479638"
}