{
  "metadata": {
    "case_name": "Appellant v. Respondents",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Civil Appeal No. 458 of 1958",
    "date_of_judgment": "1961-03-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On information supplied by one Qurban Ahmad, the Assistant Custodian, Giridih, issued a notice under s. 7(1) of the Administration of Evacuee Property Act, 1950 to the appellant to show cause why holdings Nos. 326, 774 and 654 in his possession should not be declared as evacuee properties.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Assistant Custodian, after making the necessary inquiry, held that the said holdings were evacuee properties.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "The appellant filed a revision petition under s. 26 of the Act against the said order to the Deputy Custodian, Hazaribagh, who set aside the order of the Assistant Custodian and remanded the matter to him for disposal in accordance with law.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On April 26, 1954, the Assistant Custodian, Giridih, on a consideration of the evidence placed before him, held that the said properties were not evacuee properties, and on that finding he released them.",
      "type": "material",
      "date": "1954-04-26",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Thereafter, the Custodian, acting under s. 26(1) of the Act, called for the records of the case and, after hearing the appellant, by his order dated January 27, 1955, dropped the proceedings.",
      "type": "procedural",
      "date": "1955-01-27",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "On February 22, 1955, the Assistant Custodian, Head-quarters, Patna filed an appeal before the Custodian, under s. 24(1)(a) of the Act, against the order of the Assistant Custodian, Giridih, dated April 26, 1954, releasing the holdings of the appellant.",
      "type": "procedural",
      "date": "1955-02-22",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On August 4, 1955, the Custodian set aside the order of the Assistant Custodian, Giridih, and declared the shares of the brothers of the appellant in the holdings to be evacuee properties and referred the matter to the appropriate authority for the separation of their interest.",
      "type": "material",
      "date": "1955-08-04",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The appellant filed an application to the High Court under Art. 226 of the Constitution to quash the said order dated August 4, 1955, but that was dismissed by judgment and decree dated September 3, 1956, in M. J. No. 603 of 1955.",
      "type": "procedural",
      "date": "1956-09-03",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appeal by special leave to the Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "No appeal lay to the Custodian from the order of the Assistant Custodian, Giridih, at the instance of the Assistant Custodian, Headquarters, Patna.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Under s. 7-A of the Act the Custodian has no power after May 7, 1954, to declare any property to be evacuee property unless proceedings are pending on the said date for declaring such property as evacuee property, and that in the present case, as the appeal against the order of the Assistant Custodian was filed only on February 22, 1955, no proceeding was pending on the prescribed date.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "The Custodian acted perversely in condoning the delay in filing the appeal to him without assigning any reasons.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "The notice issued to the appellant under s. 7(1) of the Act was defective and, therefore, the proceedings taken pursuant thereto were void.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No appeal lay to the Custodian from the order of the Assistant Custodian, Giridih, at the instance of the Assistant Custodian, Headquarters, Patna, as 'any person aggrieved' under s.24 does not include a Custodian.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Administration of Evacuee Property Act, 1950, s.24; scheme of the Act"
    },
    {
      "id": "pa2",
      "text": "Under s. 7-A, Custodian had no power after May 7, 1954 to declare property evacuee unless proceedings pending on that date; appeal filed Feb 22, 1955 so no pending proceedings.",
      "supporting_facts": [
        "f4",
        "f6",
        "f7"
      ],
      "legal_basis": "s.7A of the Act"
    },
    {
      "id": "pa3",
      "text": "Custodian perversely condoned delay in filing appeal without reasons.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Notice under s.7(1) defective, proceedings void.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "s.7(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The words 'any person aggrieved' under s. 24 are comprehensive enough to include a Custodian, who can prefer an appeal against an order of an Assistant Custodian releasing properties under s.7.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.24; s.6 distribution of work"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "All officers (Custodian, Additional, Deputy, Assistant) are 'Custodians' under s.2(c); scheme of Act does not contemplate one Custodian appealing against another; 'any person aggrieved' in s.24 means persons whose properties declared evacuee or similar, not a Custodian.",
      "addresses_issue": "i1",
      "key_observation": "It would be anomalous were it to be held that a Custodian could prefer an appeal against the order of a Custodian."
    },
    {
      "id": "cr2",
      "text": "Ebrahim Aboobaker v. Custodian-General distinguished: that case involved private informant under rules, not Custodian vs Custodian.",
      "addresses_issue": "i1",
      "key_observation": "A subordinate officer of the Custodian... cannot be equated to a party in a lis."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Assistant Custodian, Headquarters, Patna, is not a person aggrieved within the meaning of s. 24 of the Act. The appeal to the Custodian, therefore, was not competent.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ebrahim Aboobaker v. Custodian-General of Evacuee Property",
      "citation": "1952 S.C.R. 696",
      "treatment": "distinguished",
      "relevance": "Held informant was 'person aggrieved' in context of rules allowing adjudication between informant and property owner; not applicable to Custodian appealing against another Custodian."
    }
  ],
  "statutes_cited": [
    {
      "name": "Administration of Evacuee Property Act, 1950 (Act 31 of 1950)",
      "sections": [
        "s.2(c)",
        "s.6",
        "s.7",
        "s.7A",
        "s.9",
        "s.10",
        "s.24",
        "s.26",
        "s.27"
      ],
      "relevance": "Defined Custodian broadly; powers to declare, vest, manage evacuee property; appeal and revision provisions; s.24 appeal only by aggrieved person not including Custodian; s.7A bars declarations post May 7,1954 without pending proceedings."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.226"
      ],
      "relevance": "Basis for High Court application to quash Custodian's order."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed; order of the High Court set aside; writ of certiorari issued to quash the order of the Custodian of Evacuee Property, Bihar dated August 4, 1955 setting aside the order of the Assistant Custodian, Giridih dated April 26, 1954 releasing holdings Nos. 326, 774 and 654.",
    "relief_granted": "Writ of certiorari quashing Custodian's order dated August 4, 1955.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It would be anomalous were it to be held that a Custodian could prefer an appeal against the order of a Custodian.",
      "speaker": "court",
      "significance": "Core reasoning rejecting appeal by one Custodian against another."
    },
    {
      "text": "The words 'any person aggrieved' in the context of the Act cannot include any Custodian as defined in the Act.",
      "speaker": "court",
      "significance": "Direct holding on interpretation of s.24."
    }
  ],
  "_case_id": "1961_29",
  "_label": 1,
  "_text_length": 13219,
  "_extracted_at": "2026-02-10T19:29:38.395334"
}