{
  "metadata": {
    "case_name": null,
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo J.",
      "Das Gupta J.",
      "Raghubar Dayal J.",
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 346 of 1958",
    "date_of_judgment": "1961-11-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant and the respondent entered into a partnership at Indore for working colliery mines at Kajora gram District Burdwan and manufacture of cement etc., in the name and style of Diamond Industries. The head office of the partnership was at Indore.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The partnership was dissolved by a deed of dissolution dated August 22, 1945. Under the terms of this deed, the appellant made himself liable to render full, correct and true account of all the moneys advanced by the respondent and also to render accounts of the said partnership and its business, and was held entitled to 1/4th of Rs. 4,00,000/- solely contributed by the respondent toward the capital of the partnership. He was, however, not entitled to get this amount unless and until he had rendered the accounts and they had been checked and audited.",
      "type": "material",
      "date": "1945-08-22",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The second proviso at the end of the covenants in the deed of dissolution reads: Provided however and it is agreed by and between the parties that as the parties entered into the partnership agreement at Indore Holkar State all disputes and differences whether regarding money or as to the relationship or as to their rights and liabilities of the parties hereto in respect of the partnership hereby dissolved or in respect of question arising by and under this document shall be decided amicably or in court at Indore and nowhere else.",
      "type": "material",
      "date": "1945-08-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On September 29, 1945, a registered letter on behalf of the respondent was sent to the appellant. This required the appellant to explain to and satisfy the respondent at Indore as to the accounts of the said colliery within three months of the receipt of the notice. It was said in the notice that the accounts submitted by the appellant had not been properly kept and that many entries appeared to be wilfully falsified, evidently with malafide intentions and that there appeared in the account books various false and fictitious entries causing wrongful loss to the respondent and wrongful gain to the appellant.",
      "type": "procedural",
      "date": "1945-09-29",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The appellant sent a reply to this notice on December 5, 1945, and denied the various allegations, and requested the respondent to meet him at Asansol or Kajoragram on any day suitable to him, within ten days from the receipt of that letter.",
      "type": "procedural",
      "date": "1945-12-05",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "On August 18, 1948, the appellant instituted Suit M. S. No. 33 of 1948 in the Court of the Subordinate Judge at Asansol against the respondent for the recovery of Rs. 1,00,000/- on account of his share in the capital and assets of the partnership firm Diamond Industries and Rs. 18,000/- as interest for detention of the money or as damages or compensation for wrongful withholding of the payment. In the plaint he mentioned about the respondents notice and his reply and to a second letter on behalf of the respondent and his own reply thereto. A copy of the deed of dissolution, according to the statement in paragraph 13 of the plaint, was filed along with it.",
      "type": "procedural",
      "date": "1948-08-18",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "On October 27, 1948, respondent filed a petition under s. 34 of the Arbitration Act in the Asansol Court praying for the stay of the suit in view of the arbitration agreement in the original deed of partnership. This application was rejected on August 20, 1949.",
      "type": "procedural",
      "date": "1948-10-27",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Meanwhile, on January 3, 1949, the respondent filed Civil Original Suit No. 71 of 1949 in the Court of the District Judge, Indore, against the appellant, and prayed for a decree for Rs. 1,90,519-0-6 against the appellant and further interest on the footing of settled accounts and in the alternative for a direction to the appellant to render true and full accounts of the partnership.",
      "type": "procedural",
      "date": "1949-01-03",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "On November 28, 1949, the respondent filed his written statement in the Asansol Court. Paragraphs 19 and 21 of the written statement are: With reference to paragraph 21 of the plaint, the defendant denies that the plaintiff has any cause of action against the defendant or that the alleged cause of action, the existence of which is denied, arose at Kajora Colliery. The defendant craves reference to the said deed of dissolution whereby the plaintiff and the defendant agreed to have disputes, if any, tried in the Court at Indore. In the circumstances, the defendant submits that this Court has no jurisdiction to try and entertain this suit. The suit is vexatious, speculative, oppressive and is instituted malafide and should be dismissed with costs.",
      "type": "procedural",
      "date": "1949-11-28",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Issues were struck on February 4, 1950. The first two issues are: Has this Court jurisdiction to entertain and try this suit? Has the plaintiff rendered and satisfactorily explained the accounts of the partnership in terms of the deed of dissolution of partnership?",
      "type": "procedural",
      "date": "1950-02-04",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "In December 1951, the respondent applied in the Court at Asansol for the stay of that suit in the exercise of its inherent powers. The application was rejected on August 9, 1952.",
      "type": "procedural",
      "date": "1951-12",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "The High Court of Calcutta confirmed this order on May 7, 1953, and directed that the hearing of the preliminary issue No.1 in the two Asansol suits should be taken up expeditiously.",
      "type": "procedural",
      "date": "1953-05-07",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "On April 28, 1950, the appellant applied to the Indore Court for staying that suit under ss. 10 and 151 Code of Civil Procedure. The application was rejected on July 5, 1951.",
      "type": "procedural",
      "date": "1950-04-28",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "The High Court of Madhya Bharat confirmed that order on August 20, 1953.",
      "type": "procedural",
      "date": "1953-08-20",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "On September 14, 1953, the respondent applied under s. 151, Code of Civil Procedure to the Indore Court, for restraining the appellant from continuing the proceedings in the suit filed by him in the Court at Asansol.",
      "type": "procedural",
      "date": "1953-09-14",
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "The learned Additional District Judge, Indore, issued interim injunction under O. XXXIX, Code of Civil Procedure, to the appellant restraining him from proceeding with his Asansol suit pending decision of the Indore suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Against this order, the appellant went in appeal to the High Court of Judicature at Madhya Bharat. The High Court dismissed the appeal by its order dated May 10, 1955.",
      "type": "procedural",
      "date": "1955-05-10",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "The appellant preferred this appeal by special leave against the High Court order.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Court could exercise its inherent powers under s. 151 CPC to issue temporary injunction when there are specific provisions in s. 94 and O. XXXIX CPC for interim injunctions.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Court, in the exercise of its inherent jurisdiction, exercised its discretion properly, keeping in mind the facts of the case.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "The legal effect of the second proviso in the deed of dissolution on the maintainability of the suit in the Court at Asansol.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Court could not exercise its inherent powers when there were specific provisions in the Code of Civil Procedure for the issue of interim injunctions, they being s. 94 and O. XXXIX.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "s. 94(c), O. XXXIX CPC; precedents like Varadacharlu v. Narsimha Charlu"
    },
    {
      "id": "pa2",
      "text": "The Court, in the exercise of its inherent jurisdiction, did not exercise its discretion properly.",
      "supporting_facts": [
        "f6",
        "f7",
        "f11",
        "f12"
      ],
      "legal_basis": "s. 151 CPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The appellant filed the suit at Asansol in order to put him to trouble, heavy expenses and wastage of time.",
      "supporting_facts": [
        "f6",
        "f15"
      ],
      "legal_basis": "Deed of dissolution proviso; s. 151 CPC"
    },
    {
      "id": "ra2",
      "text": "The suit at Asansol constitutes misuse and abuse of the process of the Court as it was in flagrant breach of the terms of the contract regarding Indore Court.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "O. XXXIX CPC; inherent powers"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Courts have inherent jurisdiction to issue temporary injunctions in circumstances which are not covered by the provisions of O. XXXIX, CPC. The provisions of the Code are not exhaustive.",
      "addresses_issue": "i1",
      "key_observation": "The latter view is correct that the Courts have inherent jurisdiction to issue temporary injunctions in circumstances which are not covered by O.XXXIX."
    },
    {
      "id": "cr2",
      "text": "In view of the facts of the case, the Courts below were in error in issuing a temporary injunction restraining the appellant from proceeding with the suit in the Asansol Court. Inherent powers are to be exercised in very exceptional circumstances.",
      "addresses_issue": "i2",
      "key_observation": "The question of issuing an order to a party restraining him from proceeding with any other suit in a regularly constituted Court of law deserves great care and consideration."
    },
    {
      "id": "cr3",
      "text": "No opinion expressed on the jurisdiction issue as it is pending in both suits.",
      "addresses_issue": "i3",
      "key_observation": "We do not propose to express any opinion on this question of jurisdiction."
    },
    {
      "id": "cr4",
      "text": "Shah J. separate opinion: Civil courts other than Chartered High Courts do not have inherent jurisdiction to issue temporary injunctions in cases not covered by O.39 rr.1 and 2 CPC.",
      "addresses_issue": "i1",
      "key_observation": "Power to issue an injunction is restricted by s.94 and O.39, and it is not open to the civil court to exercise that power ignoring the restrictions."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Courts have inherent power under s.151 CPC to issue temporary injunctions in circumstances not covered by O.XXXIX.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "The injunction order restraining appellant from proceeding with Asansol suit was not justified; appeal allowed.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Varadacharlu v. Narsimha Charlu",
      "citation": null,
      "treatment": "referred",
      "relevance": "View that Court cannot issue temporary injunction if circumstances do not fall within O.XXXIX."
    },
    {
      "case_name": "Govindarajulu v. Imperial Bank of India",
      "citation": null,
      "treatment": "referred",
      "relevance": "View that Court cannot issue temporary injunction if circumstances do not fall within O.XXXIX."
    },
    {
      "case_name": "Karuppayya v. Ponnuswami",
      "citation": null,
      "treatment": "referred",
      "relevance": "View that Court cannot issue temporary injunction if circumstances do not fall within O.XXXIX."
    },
    {
      "case_name": "Murugesa Mudali v. Angamuthu Mudali",
      "citation": null,
      "treatment": "referred",
      "relevance": "View that Court cannot issue temporary injunction if circumstances do not fall within O.XXXIX."
    },
    {
      "case_name": "Subramanian v. Seetarama",
      "citation": null,
      "treatment": "referred",
      "relevance": "View that Court cannot issue temporary injunction if circumstances do not fall within O.XXXIX."
    },
    {
      "case_name": "Dhaneshwar Nath v. Ghanshyam Dhar",
      "citation": null,
      "treatment": "followed",
      "relevance": "Court can issue interim injunction under circumstances not covered by O.XXXIX if interests of justice require."
    },
    {
      "case_name": "Firm Bichchha Ram v. Firm Baldeo Sahai",
      "citation": null,
      "treatment": "followed",
      "relevance": "Court can issue interim injunction under circumstances not covered by O.XXXIX."
    },
    {
      "case_name": "Bhagat Singh v. Jagbir Sawhney",
      "citation": null,
      "treatment": "followed",
      "relevance": "Court can issue interim injunction under circumstances not covered by O.XXXIX."
    },
    {
      "case_name": "Chinese Tannery Owners Association v. Makhan Lal",
      "citation": null,
      "treatment": "followed",
      "relevance": "Court can issue interim injunction under circumstances not covered by O.XXXIX."
    },
    {
      "case_name": "Padam Sen v. The State of Uttar Pradesh",
      "citation": null,
      "treatment": "followed",
      "relevance": "Inherent powers are in addition to specific powers; can issue commission under s.151 in circumstances not covered by s.75 and O.XXVI."
    },
    {
      "case_name": "Maqbul Ahmad v. Pratap Narain Singh",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Does not control inherent powers; no general discretion to dispense with Act provisions."
    },
    {
      "case_name": "Cohen v. Rothfield",
      "citation": null,
      "treatment": "referred",
      "relevance": "Power to restrain proceedings in another court to be exercised with great caution."
    },
    {
      "case_name": "Hyman v. Helm",
      "citation": null,
      "relevance": "Considerations for vexatious suits; multiplicity alone not sufficient."
    },
    {
      "case_name": "Menon v. Parvathi Ammal",
      "citation": null,
      "treatment": "referred",
      "relevance": "Courts not noticing injunction orders against parties."
    },
    {
      "case_name": "Harbhagat Kaur v. Kirpal Singh",
      "citation": null,
      "treatment": "referred",
      "relevance": "Courts not noticing injunction orders against parties."
    },
    {
      "case_name": "Shiv Charan Lal v. Phool Chand",
      "citation": null,
      "treatment": "followed",
      "relevance": "Court proceeded despite injunction from another court."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "s. 10",
        "s. 22",
        "s. 34 (Arbitration Act)",
        "s. 94",
        "s. 151",
        "O. XXXIX r.1",
        "O. XXXIX r.2",
        "O. XXVI",
        "s. 75",
        "s. 35A"
      ],
      "relevance": "Governing stay of suits, inherent powers, temporary injunctions, commissions, jurisdiction, costs."
    },
    {
      "name": "Arbitration Act",
      "sections": [
        "s. 34"
      ],
      "relevance": "Stay of suit due to arbitration agreement."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed with costs. The order of the High Court dated May 10, 1955, and the order of injunction by the Additional District Judge, Indore, restraining the appellant from proceeding with the suit at Asansol are set aside.",
    "relief_granted": "Set aside injunction order; appellant free to proceed with Asansol suit.",
    "costs": "Appeal allowed with costs."
  },
  "key_quotes": [
    {
      "text": "\"Nothing in this Code shall be deemed to limit or otherwise affect the inherent power of the Court to make such orders as may be necessary for the ends of the justice or to prevent abuse of the process of the Court.\"",
      "speaker": "court",
      "significance": "Quotes s.151 CPC, affirming inherent powers."
    },
    {
      "text": "We are of opinion that the latter view is correct and that the Courts have inherent jurisdiction to issue temporary injunctions in circumstances which are not covered by the provisions of O.XXXIX, Code of Civil Procedure.",
      "speaker": "court",
      "significance": "Core holding on inherent jurisdiction for injunctions."
    },
    {
      "text": "A Court ought not to achieve indirectly what it cannot do directly.",
      "speaker": "court",
      "significance": "Against indirect restraint on another court via party injunction."
    }
  ],
  "_case_id": "1961_339",
  "_label": 1,
  "_text_length": 42225,
  "_extracted_at": "2026-02-10T19:34:56.395224"
}