{
  "metadata": {
    "case_name": "State of Andhra Pradesh v. Respondent",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": "Criminal Appeal No. 192 of 1959",
    "date_of_judgment": "1961-04-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On January 20, 1955, the respondent came to Adoni on a passport granted by the Government of Pakistan which bore the date January 10, 1955. The passport had endorsed on it a visa granted by the Indian authorities which permitted the respondent to stay in India up to April 14, 1955.",
      "type": "material",
      "date": "1955-01-20",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent continued to stay on in India after April 14, 1955.",
      "type": "material",
      "date": "1955-04-15",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On some date, not precisely ascertainable from the record, he made a representation to the Government of India for extension of his visa till September 2, 1957, on grounds of health. The records do not however show what order, if any, was made on this representation.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On September 3, 1957, an order dated August 9, 1957, made by the Government of Andhra Pradesh requiring him to leave India, was served on the respondent.",
      "type": "material",
      "date": "1957-09-03",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The respondent did not leave India as directed by this order.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The respondent was convicted by the Judicial Magistrate of Adoni under s. 14 of the Foreigners Act, 1946. His appeal to the Sessions Judge of Kurnool was dismissed. He then moved the High Court of Andhra Pradesh in revision and the revision petition was allowed.",
      "type": "procedural",
      "date": "1958-10-27",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The passport showed that the respondent was born at Adoni in 1924. The respondent produced an extract from the municipal birth register, which showed that he was so born.",
      "type": "background",
      "date": "1924",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The only evidence on the record of the date when he left India shows that it must have been at the end of 1954 or early in 1955.",
      "type": "material",
      "date": "1954-12-31",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "There is evidence to show that he had been paying rent for his shop at Adoni for about ten years prior to 1958 and his parents, brothers, wife, and children were and had always been in India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The respondent was charged with the breach of the order to leave India which had been made under s. 3(2)(c) of the Foreigners Act.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondent was a foreigner within the meaning of the Foreigners Act?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the order under s. 3(2)(c) of the Foreigners Act could be made against the respondent and whether he could be convicted for breach of it?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the respondent, an Indian citizen, had acquired Pakistani citizenship under s. 9(2) of the Citizenship Act, 1955?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Judicial Magistrate found that by obtaining the passport from the Pakistan authorities, the respondent had disowned Indian nationality and ceased to be an Indian national. S. 8 of the Foreigners Act applied and a decision had been made that he was a foreigner as the Government had decided not to grant extension of visa.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "Foreigners Act s.8"
    },
    {
      "id": "pa2",
      "text": "Sessions Judge reasoned that the conduct of the respondent in applying for extension of time shows that he is not a citizen of India and has acquired citizenship of Pakistan.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Citizenship Act Rules r.30"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The respondent was not a foreigner.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 8 applies to a case where a foreigner is recognised as a national by the law of more than one foreign country or where it is uncertain what nationality if any is to be ascribed to a foreigner. It does not apply here as no such question arose.",
      "addresses_issue": "i1",
      "key_observation": "Magistrate erred in relying on s.8."
    },
    {
      "id": "cr2",
      "text": "The passport does not prove respondent was Pakistani national all along; at best shows he renounced Indian citizenship. Under s.9(2) Citizenship Act, courts have no jurisdiction to decide if Indian citizen acquired foreign citizenship; only Central Government can under r.30.",
      "addresses_issue": "i3",
      "key_observation": "No evidence Central Government decided he acquired Pakistani citizenship."
    },
    {
      "id": "cr3",
      "text": "Courts can decide if person is Indian citizen or foreigner from beginning. Evidence shows respondent born in India 1924, domiciled, family in India, short visit to Pakistan end 1954/early 1955, never migrated.",
      "addresses_issue": "i1",
      "key_observation": "Respondent discharged onus under s.9 Foreigners Act; proved Indian citizen under Art.5(a) Constitution."
    },
    {
      "id": "cr4",
      "text": "Sessions Judge erred by assuming renunciation without Central Government decision.",
      "addresses_issue": "i2",
      "key_observation": "No conviction possible without proving foreigner."
    },
    {
      "id": "cr5",
      "text": "Upholding High Court but not for its reasons; High Court erred on Art.7 migration post-1950 but unnecessary to decide as no migration at all.",
      "addresses_issue": "i1",
      "key_observation": "Respondent not foreigner; no order under s.3(2)(c) valid."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Respondent is not a foreigner; conviction under s.14 Foreigners Act not well-founded.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Courts cannot decide under Citizenship Act s.9(2) if Indian citizen acquired foreign citizenship; only Central Government.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No order under Foreigners Act s.3(2)(c) can be made against non-foreigner; breach conviction illegal.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Foreigners Act, 1946",
      "sections": [
        "s.14",
        "s.3(2)(c)",
        "s.8",
        "s.9",
        "s.2(a)"
      ],
      "relevance": "Conviction under s.14 for breach of s.3(2)(c) order; s.8 misapplied; s.9 onus on accused; s.2(a) defines foreigner."
    },
    {
      "name": "Citizenship Act, 1955",
      "sections": [
        "s.9(2)"
      ],
      "relevance": "Determines if Indian citizen acquired foreign citizenship; exclusive to Central Government."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.5(a)",
        "Art.6",
        "Art.7"
      ],
      "relevance": "Art.5(a) citizenship at commencement for born/domiciled; Art.7 on migration discussed but not decided."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Andhra Pradesh High Court's decision allowing the revision petition, set aside the conviction by the Magistrate and Sessions Judge, holding that the respondent was not a foreigner and no valid order under s.3(2)(c) of the Foreigners Act could be made against him.",
    "relief_granted": "Conviction quashed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "There can be no conviction unless it can be held on the evidence that the respondent is a foreigner, that is to say, a person who is not an Indian citizen see s. 2(a) of the Foreigners Act.",
      "speaker": "court",
      "significance": "Core holding on requirement to prove foreigner status."
    },
    {
      "text": "The respondent has clearly discharged the onus that lay on him under s. 9 of the Foreigners Act to prove that he was not a foreigner, by proving that he was born and domiciled in India prior to January 26, 1950.",
      "speaker": "court",
      "significance": "Explains how respondent proved citizenship."
    },
    {
      "id": "kq3",
      "text": "s. 9(2) of the Citizenship Act, 1955, provides that if any question arises as to whether an Indian citizen has acquired the citizenship of another country, it shall be determined by such authority and in such manner as may be prescribed.",
      "speaker": "court",
      "significance": "Limits court jurisdiction on citizenship acquisition."
    }
  ],
  "_case_id": "1961_412",
  "_label": 0,
  "_text_length": 11787,
  "_extracted_at": "2026-02-10T19:35:16.838471"
}