{
  "metadata": {
    "case_name": "Ram Singh v. State",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "RAGUHBAR DAYAL, J."
    ],
    "case_number": "Criminal Appeal No. 89 of 1961",
    "date_of_judgment": "1961-12-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Due to enmity, the appellant caused injuries to Sheo Sahai, who was sleeping in his cattle shed in village Bhadurpur Ghar, with a sword at about midnight on the night between June 14-15, 1960. Sheo Sahai died of the injuries received.",
      "type": "material",
      "date": "1960-06-14/15",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "The appellant thereafter proceeded to the Canal Distributory at some distance from the village and had a bath there.",
      "type": "material",
      "date": "1960-06-15",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Later on, he went to the Police Station, Ekdil, nine miles away and lodged a report. He delivered the sword which has been found by the Serologist to be stained with human blood.",
      "type": "material",
      "date": "1960-06-15",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Appellant denied the allegation that he had caused the death of Sheo Sahai and alleged that he was falsely accused. One Paley Singh informed him about the murder of Sheo Sahai and asked him to go to the Police Station, Ekdil, and to inform the Station Officer orally about the murder. He did accordingly. He was detained at the Police Station till 11 a.m., the next day and was then put up in the lock up. The Sub-Inspector took his thumb impression forcibly on three papers.",
      "type": "disputed",
      "date": "1960-06-15",
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "Dispute over purchase of cycle from deceased: appellant paid Rs. 10/- towards sale price, balance not paid, deal cancelled by Sheo Sahai.",
      "type": "background",
      "date": null,
      "source": "Ajit Singh PW5"
    },
    {
      "id": "f6",
      "text": "Quarrel during game of cards on June 12, 1960 between Sheo Sahai and appellant.",
      "type": "background",
      "date": "1960-06-12",
      "source": "Paley Singh PW2, Baij Nath PW4"
    },
    {
      "id": "f7",
      "text": "Appellant purchased sword on June 13, 1960 from Kehar Singh PW3. Receipt found on appellant when searched after arrest.",
      "type": "material",
      "date": "1960-06-13",
      "source": "Kehar Singh PW3"
    },
    {
      "id": "f8",
      "text": "Appellant deposited sword at Police Station, deposed by Madho Ram PW12 and Sri Kishan Singh SO PW16.",
      "type": "admitted",
      "date": "1960-06-15",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Extrajudicial confession by appellant to Ujagar Singh while bathing in Canal: appellant said he had murdered Sheo Sahai.",
      "type": "material",
      "date": "1960-06-15",
      "source": "Ujagar Singh"
    },
    {
      "id": "f10",
      "text": "Ujagar Singh was on field protecting crop from neel gais. Canal runs beside his field. Heard splashing, went to Canal bank, saw appellant bathing, asked reason, appellant confessed murder.",
      "type": "background",
      "date": "1960-06-15",
      "source": "Ujagar Singh"
    },
    {
      "id": "f11",
      "text": "Ujagar Singh went to village at 5 a.m., told people what appellant said. Supported by Paley Singh PW2 and Bishram Singh PW13.",
      "type": "procedural",
      "date": "1960-06-15",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "No blood stains on appellant or clothes when he presented at Police Station.",
      "type": "background",
      "date": "1960-06-15",
      "source": "Sri Kishan Singh"
    },
    {
      "id": "f13",
      "text": "Fields had chari and sugar-cane crop in middle of June.",
      "type": "background",
      "date": "1960-06",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Session Judge Etawah convicted appellant under s.302 IPC and sentenced to death.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Allahabad High Court dismissed appeal (Criminal Appeal No. 1782 of 60) and confirmed conviction and sentence (judgment dated December 8, 1960).",
      "type": "procedural",
      "date": "1960-12-08",
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the entire report dictated by the appellant at the Police Station is inadmissible in evidence as its contents amounted to a confession of the offence by the appellant made to a Police Officer.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the evidence relied upon by the High Court was sufficient to establish that the appellant had murdered Sheo Sahai.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the High Court was wrong in rejecting the statement of Ujagar Singh about the appellant's extra-judicial confession.",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether the facts of motive, purchase of sword a day before, depositing blood-stained sword, and extra-judicial confession establish the appellant committed the murder.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The entire report dictated by the appellant was inadmissible in evidence as its contents amounted to a confession of the offence by the appellant made to a Police Officer.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The evidence relied upon by the High Court was insufficient to establish that the appellant had murdered Sheo Sahai.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "It is unusual that a person who commits a murder in pursuance of an enmity arising out of minor disputes, would openly admit it to the first person he met and go to the Police Station.",
      "supporting_facts": [
        "f9",
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The High Court was wrong in rejecting the statement of Ujagar Singh about the appellants extra-judicial confession and that the extra-judicial confession together with the circumstances relied on by the High Court, fully make out the prosecution case.",
      "supporting_facts": [
        "f9",
        "f5",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Such portions of the report which did not amount to a direct admission of the appellants striking Sheo Sahai with a sword and thereby causing his death were admissible in evidence.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Do not consider it necessary to decide whether any portion of the report dictated by the appellant at the Police Station is admissible or not in evidence, as there is good independent evidence with respect to the four matters mentioned in the report: purchase of cycle, quarrel in cards, purchase of sword, deposit of sword.",
      "addresses_issue": "i1",
      "key_observation": "Independent witness testimony confirms these facts: Ajit Singh PW5 (cycle), Paley Singh PW2 & Baij Nath PW4 (cards), Kehar Singh PW3 (sword), Madho Ram PW12 & Kishan Singh PW16 (deposit)."
    },
    {
      "id": "cr2",
      "text": "High Court erred in rejecting Ujagar Singh's statement about extra-judicial confession. High Court's observations on improbability inconsistent and not supported.",
      "addresses_issue": "i3",
      "key_observation": "No enmity between Ujagar and appellant. Circumstances support: protecting crop from neel gais, bathing in canal probable in June heat to wash blood, no blood on person at PS, canal beside field."
    },
    {
      "id": "cr3",
      "text": "Extra-judicial confessions are not usually considered with favour but... such a confession coming from a person who has no reason to state falsely and to whom it is made in circumstances which tend to support his statement, should be believed.",
      "addresses_issue": "i4",
      "key_observation": "Ujagar's conduct reasonable as he was guarding crop."
    },
    {
      "id": "cr4",
      "text": "The extra-judicial confession finds ample support from purchase of sword day before, sword stained with human blood handed over by appellant, enmity.",
      "addresses_issue": "i2",
      "key_observation": "Fully establishes appellant committed murder."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant rightly convicted of the offence under s. 302, I.P.C., and awarded the proper sentence of death.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Extra-judicial confession to Ujagar Singh reliable and accepted.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Motive, sword purchase, blood-stained sword deposit, and confession sufficient to establish guilt.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302"
      ],
      "relevance": "Offence of murder; conviction and death sentence under this section confirmed."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by special leave against Allahabad High Court order confirming conviction and death sentence under s.302 IPC by Sessions Judge Etawah. Accepted extra-judicial confession and circumstances as proving guilt.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Extra-judicial confessions are not usually considered with favour but that does not mean that such a confession coming from a person who has no reason to state falsely and to whom it is made in circumstances which tend to support his statement, should not be believed.",
      "speaker": "court",
      "significance": "Principle for accepting extra-judicial confession applied here."
    },
    {
      "text": "The evidence of the appellants having enmity with Sheo Sahai, the appellants conduct in purchasing a sword and delivering it stained with human blood to the Police and the appellants confession to Ujagar Singh, fully establish that the appellant did commit the murder of Sheo Sahai.",
      "speaker": "court",
      "significance": "Crux of reasoning confirming conviction."
    }
  ],
  "_case_id": "1961_172",
  "_label": 0,
  "_text_length": 12963,
  "_extracted_at": "2026-02-10T19:31:51.323810"
}