{
  "metadata": {
    "case_name": "Defendant v. Smt. Vimla",
    "case_year": 1956,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Smt. Vimla (plaintiff) filed suit No. 73 of 1956 in the court of the Subordinate Judge, South Kanara, for decree for possession of lands, buildings, house-sites in Sch. A, movable properties in Sch. B, possession, management and account of properties in Sch. C, and institutions in Sch. D alleged to be private family religious endowments.",
      "type": "material",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f2",
      "text": "Shri Dharmasthala Manjayya Heggade (plaintiff's father) died on August 31, 1955.",
      "type": "background",
      "date": "1955-08-31",
      "source": "plaintiff"
    },
    {
      "id": "f3",
      "text": "Plaintiff claimed entitlement to suit properties upon father's death, but defendant wrongfully possessed them.",
      "type": "disputed",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f4",
      "text": "Plaintiff valued Sch. C and D under s. 28 of Madras Court-fees and Suits Valuation Act, 1955 at Rs. 21,000/- and paid court-fee of Rs. 275/-. Lands in Sch. A valued at 30 times assessment, buildings separately.",
      "type": "procedural",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f5",
      "text": "On June 28, 1956, Subordinate Judge held Rs. 34,577/- court-fee paid by plaintiff adequate on office objection.",
      "type": "procedural",
      "date": "1956-06-28",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Defendant filed written statement on September 9, 1956, objecting inter alia to valuation and court-fee.",
      "type": "procedural",
      "date": "1956-09-09",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Trial court raised issue on adequacy of court-fee.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "On February 13, 1957, defendant applied for Commissioner to value properties; court dismissed and declared fee adequate.",
      "type": "procedural",
      "date": "1957-02-13",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Defendant filed Revision Petition 272 of 1957 to High Court of Judicature at Bangalore; HC set aside order, directed trial court to ascertain value, appoint Commissioner if needed, decide afresh.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Subordinate Judge appointed Commissioner; report submitted, defendant objected, further and supplemental reports submitted.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Subordinate Judge held Sch. D extra commercium, fixed fee for possession; Sch. D trust properties, s.28 applies as rival trustees dispute; houses on revenue lands at market value or 30x assessment; valued Sch. A lands at Rs. 7,74,665/-, house-sites Rs. 27,625/-. Plaintiff paid additional fee.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Plaintiff and defendant filed separate revision petitions to High Court of Mysore; HC heard Advocate-General, confirmed Sub Judge except for Nelliyadi Beedu, directed trial court to determine if extra commercium after evidence.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Defendant preferred appeal to Supreme Court with special leave under Art. 136 against High Court order.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the defendant has a right to invoke revisional jurisdiction of the High Court under s.115 CPC against orders determining adequacy of court-fee paid by plaintiff on the plaint.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether court-fee adequacy is a matter only between plaintiff and State, or defendant can contest and seek revision.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "By s.12(2) of Madras Court-fees and Suits Valuation Act, 1955 (Act 14 of 1955), defendant invested with right to contest adequacy of court-fee in trial court and move High Court in revision if contrary order passed.",
      "supporting_facts": [
        "f6",
        "f9",
        "f12"
      ],
      "legal_basis": "Madras Court-fees and Suits Valuation Act, 1955 s.12(2)"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Court-fees Act enacted to collect revenue for State, not to arm contesting party with weapon to obstruct trial. Question of proper court-fee primarily between plaintiff and State; defendant has no grievance or right to appeal/revision thereon unless jurisdiction involved.",
      "addresses_issue": "i1",
      "key_observation": "Defendant may contest in trial court to assist, but no statutory right to move High Court in revision."
    },
    {
      "id": "cr2",
      "text": "Revisional jurisdiction under s.115 CPC strictly conditioned; no refusal/assumption of jurisdiction or illegality here. s.12(2) only enables raising plea in trial court, not revision to HC. s.19 allows inquiry/commission but doesn't arm defendant for revision.",
      "addresses_issue": "i2",
      "key_observation": "High Court grievously erred in entertaining revision applications by defendant on court-fee when no jurisdiction question involved; frustrated suit progress for five years."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Defendant has no right to move High Court in revision against trial court's order on adequacy of court-fee paid by plaintiff; such matters between plaintiff and State.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court erred in exercising revisional jurisdiction on court-fee issue at defendant's instance absent jurisdiction defect.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": null,
      "citation": null,
      "treatment": null,
      "relevance": "many precedents may be found for course of proceedings on court-fee objections"
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Court-fees and Suits Valuation Act, 1955",
      "sections": [
        "s. 28",
        "s. 12(2)",
        "s. 19"
      ],
      "relevance": "Valuation of properties, defendant's plea on adequacy, inquiry by court; applies to suit"
    },
    {
      "name": "Court-fees Act",
      "sections": [],
      "relevance": "Enacted to collect revenue; detailed provisions in Ch. III for fee collection"
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s. 115"
      ],
      "relevance": "Revisional jurisdiction strictly conditioned by cls. (a) to (c)"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 136"
      ],
      "relevance": "Special leave for appeal to Supreme Court"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court held that High Court erred in entertaining defendant's revision petitions on court-fee adequacy; defendant lacks locus standi to seek revision thereon as it is matter between plaintiff and State; process obstructed suit trial for nearly five years.",
    "relief_granted": "Appeal allowed; High Court order set aside implicitly by holding error in entertaining revisions.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Court-fees Act was enacted to collect revenue for the benefit of the State and not to arm a contesting party with a weapon of defence to obstruct the trial of an action.",
      "speaker": "court",
      "significance": "Core principle distinguishing purpose of court-fee legislation"
    },
    {
      "text": "Whether proper court-fee is paid on a plaint is primarily a question between the plaintiff and the State.",
      "speaker": "court",
      "significance": "Defines locus on court-fee disputes"
    },
    {
      "text": "The High Court grievously erred in entertaining revision applications on questions of court-fee at the instance of the defendant, when no question of jurisdiction was involved.",
      "speaker": "court",
      "significance": "Direct holding against High Court's exercise of jurisdiction"
    }
  ],
  "_case_id": "1961_182",
  "_label": 0,
  "_text_length": 8714,
  "_extracted_at": "2026-02-10T19:32:08.880961"
}