{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Respondents",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The first respondent filed a complaint against the second respondent, his clerk, in the court of the Presidency Magistrate, 19th Court, Bombay, alleging that the latter had committed offences under sections 381 and 385 of the Indian Penal Code.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In due course, the Magistrate framed charges against the second respondent under the said sections.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Pending the trial, the first respondent applied to the Magistrate to summon the income-tax authorities to produce certain letters alleged to have been written by the second respondent to the said authorities making baseless allegations against the first respondent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On March 27, 1958, the Commissioner of Income-tax wrote a letter to the Magistrate admitting that some letters written by the second respondent were with the income-tax department, but pleaded that they could not be produced in view of the provisions of section 54 of the Indian Income-tax Act, 1922.",
      "type": "admitted",
      "date": "1958-03-27",
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "The Presidency Magistrate, by his order dated May 16, 1958, overruled the objections and directed the Commissioner of Income-tax to produce the documents admitted to be in his possession or in the possession of officers subordinate to him.",
      "type": "procedural",
      "date": "1958-05-16",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The Commissioner of Income-tax preferred an appeal against the order to the High Court of Judicature at Bombay, but the same was rejected in limine.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The facts are not in dispute.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Presidency Magistrate held that the documents in question formed part of the record of the assessment proceeding and nothing has been placed before us to displace the said finding.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a court is entitled to require the Commissioner of Income-tax to produce documents forming part of the record of an assessment proceeding in view of section 54 of the Indian Income-tax Act, 1922.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the prohibition in section 54 of the Income-tax Act applies only to returns furnished or accounts or documents produced by an assessee before an income-tax authority and not to documents produced by third parties.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether the prohibition under section 54 of the Income-tax Act overrides the power given to a criminal court under section 94 of the Code of Criminal Procedure.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under section 54 of the Indian Income-tax Act, 1922, no court shall be entitled to require the appellant to produce before it the said documents as they formed part of the record of an assessment proceeding taken before the relevant income-tax authority.",
      "supporting_facts": [
        "f4",
        "f8"
      ],
      "legal_basis": "Section 54, Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The said prohibition in section 54 of the income-tax Act applies only to returns furnished or accounts or documents produced by an assessee before an income-tax authority and not to documents produced by third parties.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Section 54, Indian Income-tax Act, 1922"
    },
    {
      "id": "ra2",
      "text": "In any view, the said prohibition does not override the power given to a criminal court under section 94 of the Code of Criminal Procedure.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Section 94, Code of Criminal Procedure; Section 54, Indian Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The relevant part of section 54 of the Indian Income-tax Act declares that all particulars contained in any record of any assessment proceeding shall be treated as confidential, and notwithstanding anything contained in the Indian Evidence Act, 1872, no court shall, save as provided in this Act, be entitled to require any public servant to produce before it any such record or any part of any such record, or to give evidence before it in respect thereof.",
      "addresses_issue": "i1",
      "key_observation": "The section is in two parts: the first part declares confidentiality, and the second part debars the court from requiring production."
    },
    {
      "id": "cr2",
      "text": "Sub-sections (1) and (2) in effect prohibit a public servant from disclosing any particulars contained in any such document in court.",
      "addresses_issue": "i1",
      "key_observation": "The condition that documents form part of assessment proceedings is satisfied."
    },
    {
      "id": "cr3",
      "text": "This appeal is covered by the decision in Charu Chandra Kundu v. Gurupada Ghosh, where this Court held that income-tax authorities could not be required to produce a statement made by a third party in assessment proceedings.",
      "addresses_issue": "i1",
      "key_observation": "The attempted distinction that letters were sent by a third party fails as the precedent involved a third party's statement."
    },
    {
      "id": "cr4",
      "text": "The non-obstante clause in sub-section (1) of section 54 only relates to the Indian Evidence Act and not to the Code of Criminal Procedure; it makes clear that the general ban prevails notwithstanding anything to the contrary in the Indian Evidence Act.",
      "addresses_issue": "i3",
      "key_observation": "Section 54 contains an unconditional prohibition against a public servant producing any such document, not excluding criminal process."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 54 of the Indian Income-tax Act, 1922 prohibits a court from requiring production of documents forming part of assessment proceedings, even if written by a third party, and this prohibition is not overridden by section 94 CrPC.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Charu Chandra Kundu v. Gurupada Ghosh",
      "citation": null,
      "treatment": "followed",
      "relevance": "Held that income-tax authorities could not be required to produce a statement made by a third party in assessment proceedings in view of section 54."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "381",
        "385"
      ],
      "relevance": "Offences alleged against second respondent"
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "54"
      ],
      "relevance": "Prohibits production of assessment records; treated as confidential"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "94"
      ],
      "relevance": "Power of criminal court to summon documents; does not override Income-tax Act s.54"
    },
    {
      "name": "Indian Evidence Act, 1872",
      "sections": [],
      "relevance": "Non-obstante clause in Income-tax Act s.54 prevails over it"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court sustained the objections raised by the Commissioner of Income-tax against the production of the said documents, allowing the appeal by special leave against the High Court order rejecting the revision.",
    "relief_granted": "Direction to produce documents set aside",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "All particulars contained in any record of any assessment proceeding, shall be treated as confidential, and notwithstanding anything contained in the Indian Evidence Act, 1872, no court shall, save as provided in this Act, be entitled to require any public servant to produce before it any such record...",
      "speaker": "court",
      "significance": "Core provision interpreted and applied to bar production"
    },
    {
      "text": "This appeal is covered by the decision of this Court in Charu Chandra Kundu v. Gurupada Ghosh.",
      "speaker": "court",
      "significance": "Relies on precedent to decide the case"
    },
    {
      "text": "In the result, we sustain the objections raised by the Commissioner of Income-tax against the production of the said documents.",
      "speaker": "court",
      "significance": "Final holding in favor of appellant"
    }
  ],
  "_case_id": "1961_415",
  "_label": 1,
  "_text_length": 6382,
  "_extracted_at": "2026-02-10T19:35:59.045934"
}