{
  "metadata": {
    "case_name": "State of U.P. v. Respondent",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Civil Appeal No. 369 of 1957",
    "date_of_judgment": "1961-02-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On September 12, 1948, the respondent executed a wakf by oral recitation of Sigha and then it was written on a stamped paper which was signed by the respondent and attested by witnesses.",
      "type": "material",
      "date": "1948-09-12",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On September 15, 1948, it was presented to the Collector for his opinion under s. 31 as to the duty chargeable.",
      "type": "procedural",
      "date": "1948-09-15",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Collector himself was in doubt, he referred the matter to the Board of Revenue which held that the document was liable to duty in accordance with Art. 58 of the Stamp Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On October 29, 1951, the Collector held that Rs. 85,598/7/- were payable as stamp duty and ordered that it be deposited within fifteen days.",
      "type": "procedural",
      "date": "1951-10-29",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Notice to this effect was served on the respondent on November 10, 1951.",
      "type": "procedural",
      "date": "1951-11-10",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The respondent filed a petition in the High Court under Art. 226 which was dismissed on November 3, 1952 on the ground that it was premature.",
      "type": "procedural",
      "date": "1952-11-03",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On February 2, 1954, a further notice was served upon the respondent to deposit the amount of the stamp duty plus the penalty of Rs. 5/- within a month otherwise proceedings would be taken against him under s. 48 of the Stamp Act.",
      "type": "procedural",
      "date": "1954-02-02",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On March 1, 1954, the respondent filed a petition under Art. 226 of the Constitution in the Allahabad High Court challenging the legality of the imposition of the stamp duty and the penalty and prayed for a writ of certiorari.",
      "type": "procedural",
      "date": "1954-03-01",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "A full bench of the High Court quashed the order of the Collector.",
      "type": "procedural",
      "date": "1956-01-27",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appeal to Supreme Court on certificate granted by High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "The decision of this appeal depends upon the interpretation of ss. 31, 32 and 33 of the Stamp Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Collector can impound the instrument under s. 33 after determining the duty under s. 31 when the instrument was brought solely for opinion on duty chargeable.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "If an instrument whether stamped or not is submitted for the opinion of the Collector before it is executed, i.e., it is signed, then the Collector is required to give his determination of the duty chargeable and return the document to the person seeking his opinion but if the document is scribed on a stamped paper or unstamped paper and is executed then different consequences follow. In the latter case under s. 33 the Collector is required to impound the document if he finds that it is not duly stamped.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "Stamp Act ss. 31, 33"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "On his giving his opinion the Collector becomes functus officio and can take no action under s. 33.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Stamp Act s. 31"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The instrument in dispute was not produced as a piece of evidence nor for its being acted upon e.g. registration, nor for endorsement as under s. 32 of the Stamp Act but was merely brought before the Collector for seeking his advice as to what the proper duty would be.",
      "addresses_issue": "i2",
      "key_observation": "The words 'every person before whom any instrument is produced or comes in the performance of his functions' refer firstly to production before judicial or other officers performing judicial functions as evidence of any fact to be proved and secondly refer to other officers who have to perform any function in regard to those instruments when they come before them e.g. registration. They do not extend to the determination of the question as to what the duty payable is."
    },
    {
      "id": "cr2",
      "text": "Section 31 does not postulate anything further to be done by the Collector. It was conceded that if the instrument is unexecuted i.e. not signed, and the opinion of the Collector is sought, he has to give his opinion and return it with his opinion to the person seeking his opinion. The language in regard to executed and unstamped documents is not different and the powers and duties of the Collector in regard to those instruments are the same.",
      "addresses_issue": "i2",
      "key_observation": "After the determination of the duty the Collector becomes functus officio and the provisions of s. 33 have no application."
    },
    {
      "id": "cr3",
      "text": "The scheme of the Act shows that where a person is simply seeking the opinion of the Collector as to the proper duty in regard to an instrument, he approaches him under s. 31. If it is properly stamped and the person executing the document wants to proceed with effectuating the document or using it for the purposes of evidence, he is to make up the duty and under s. 32 the Collector will then make an endorsement and the instrument will be treated as if it was duly stamped from the very beginning. But if he does not want to proceed any further than seeking the determination of the duty payable then no consequence will follow.",
      "addresses_issue": "i1",
      "key_observation": "The provisions of s. 33 are a subsequent stage when something more than mere asking of the opinion of the Collector is to be done."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Power to impound is given in s. 33 of the Act. Under that section any person who is a Judge or is in-charge of a public office before whom an instrument chargeable with duty is produced or comes in the performance of his functions is required to impound the instrument if it appears to him not to be duly stamped. The question is does this power of impounding arise in the present case? ... as soon as the Collector determined the duty he became functus officio and he could not impound the instrument under s. 33 and consequential proceedings could not therefore be taken.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chuni Lal Burmans",
      "citation": "A.I.R. 1951 All. 851",
      "treatment": "followed",
      "relevance": "High Court agreed that the learned Judges deciding this case took a correct view of the words 'is produced or comes in the performance of his functions' used in Section 33 of the Act."
    },
    {
      "case_name": "Be Cooke and Kelly",
      "citation": "1932 I.L.R. 59 Cal. 1171",
      "treatment": "referred",
      "relevance": "Observations of Rankin C.J. drawn to attention but obiter as reference under s.57 incompetent."
    },
    {
      "case_name": "Collector, Ahmednagar v. Rambhau Tukaram Nirhali",
      "citation": "A.I.R. 1930 Bom. 392",
      "treatment": "followed",
      "relevance": "Doctrine of functus officio applied: after signing certificate of sale, Judge functus officio and could not impound."
    },
    {
      "case_name": "Paiku v. Gaya",
      "citation": null,
      "treatment": "followed",
      "relevance": "Same principle laid down as in Collector Ahmednagar case."
    },
    {
      "case_name": "Chunduri Panakala Rao v. Penugonda Kumaraswami",
      "citation": null,
      "treatment": "followed",
      "relevance": "Same principle laid down as in Collector Ahmednagar case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Stamp Act",
      "sections": [
        "31",
        "32",
        "33",
        "17",
        "35",
        "38(1)",
        "40(1)(a)",
        "41",
        "42",
        "48",
        "3",
        "2(11)",
        "2(14)",
        "2(12)",
        "9(12)"
      ],
      "relevance": "Interpretation of whether Collector can impound under s.33 after opinion under s.31; scheme of Act for determination of duty, endorsement, impounding, and consequences for unstamped instruments."
    },
    {
      "name": "Stamp Act Schedule",
      "sections": [
        "Art. 58"
      ],
      "relevance": "Board of Revenue held document liable to duty in accordance with this Article."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "226"
      ],
      "relevance": "Petitions filed under Art.226 for writ of certiorari to quash imposition of stamp duty and penalty."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "Chapter XII",
        "Chapter XXXVI"
      ],
      "relevance": "Proviso to s.33 Stamp Act exempts Magistrates or Judges from examining or impounding instruments in such proceedings."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's decision quashing the Collector's order imposing stamp duty of Rs. 85,595/7/- and penalty of Rs. 5/-, holding that the Collector became functus officio after determining the duty under s.31 and could not impound under s.33.",
    "relief_granted": "Order of Collector quashed (as upheld from High Court)",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "as soon as the Collector determined the duty he became functus officio and he, could not impound the instrument under s. 33 and consequential proceedings could not therefore, be taken.",
      "speaker": "court",
      "significance": "Core holding on Collector's powers post s.31 determination."
    },
    {
      "text": "The scheme of the Act shows that where a person is simply seeking the opinion of the Collector as to the proper duty in regard to an instrument, he approaches him under s. 31... But if he does not want to proceed any further than seeking the determination of the duty payable then no consequence will follow.",
      "speaker": "court",
      "significance": "Explains distinction in scheme of Stamp Act between seeking opinion and using instrument."
    }
  ],
  "_case_id": "1961_180",
  "_label": 0,
  "_text_length": 13581,
  "_extracted_at": "2026-02-10T19:31:56.933054"
}