{
  "metadata": {
    "case_name": "State v. Jagjit Singh",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Criminal Appeal No. 118 of 1961",
    "date_of_judgment": "1961-09-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent Jagjit Singh is a former captain of the Indian Army and was at the time of his arrest in December 1960 employed in the delegation in India of a French company.",
      "type": "background",
      "date": "1960-12",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The other two persons prosecuted along with the respondent were employed in the Ministry of Defence and the Army Headquarters, New Delhi.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The three persons were prosecuted for conspiracy and also under ss. 3 and 5 of the Indian Official Secrets Act, No. XIX of 1923. The case against them was that they in conspiracy had passed on official secrets to a foreign agency.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Respondent applied for bail to the Sessions Judge but his application was rejected by the Additional Sessions Judge, Delhi.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Respondent applied under s. 498 of the Code of Criminal Procedure to the Punjab High Court Circuit Bench at Delhi in Criminal Misc. No. 256-D of 1961.",
      "type": "procedural",
      "date": "1961-05-10",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "High Court granted bail to the respondent on the view that the matter whether s.3 or s.5 applied was arguable, other two persons released on bail, trial likely to take considerable time, respondent not likely to abscond.",
      "type": "procedural",
      "date": "1961-05-10",
      "source": "high_court"
    },
    {
      "id": "f7",
      "text": "State made application for special leave to Supreme Court, which was granted. Bail cancelled by interim order of this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent has been committed to the Court of Session along with the other two persons under s. 120-B of the Indian Penal Code and under ss. 3 and 5 of the Act read with s. 120-B. Prima facie a case found against respondent under s. 3.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Prosecution case is that it is the respondent who is in touch with the foreign agency and not the other two persons.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court erred in granting bail without first determining if the offence is bailable or non-bailable, and without considering it on the assumption that it falls under s. 3 of the Act which is non-bailable.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether bail should be granted in a non-bailable offence under s. 3 of the Indian Official Secrets Act considering the nature and seriousness of the offence.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the offence falls prima facie under s. 3 or s. 5 of the Act.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court committed basic error by not first deciding if offence bailable or non-bailable; should assume under s.3 (non-bailable) and consider factors like nature/seriousness of offence, evidence, possibility of presence at trial, tampering with witnesses, public/State interests.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "s. 496 CrPC (bailable offences); s. 498 CrPC (wide powers but considerations for non-bailable)"
    },
    {
      "id": "pa2",
      "text": "Offence under s.3 is serious, prejudicial to safety/interests of State, relates to military affairs, punishable up to 14 years; respondent key contact with foreign agency.",
      "supporting_facts": [
        "f3",
        "f8",
        "f9"
      ],
      "legal_basis": "s. 3 Indian Official Secrets Act, 1923"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "On facts disclosed, case only under s.5 of the Act which is bailable, not s.3 which is non-bailable; question arguable.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "ss. 3 and 5 Indian Official Secrets Act"
    },
    {
      "id": "ra2",
      "text": "Other two co-accused released on bail; respondent not likely to abscond, well connected; trial likely to take considerable time.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "First question in bail application is whether offence bailable or non-bailable; if non-bailable, consider further factors even under wide s.498 CrPC powers.",
      "addresses_issue": "i1",
      "key_observation": "High Court erred by not assuming s.3 applies and proceeding on 'arguable' basis that it might be s.5."
    },
    {
      "id": "cr2",
      "text": "Post High Court order, respondent committed under s.120B IPC and ss.3/5 Act r/w 120B; prima facie case under s.3 (non-bailable).",
      "addresses_issue": "i2",
      "key_observation": "Offence under s.3 prejudicial to State safety/interests, relates to military affairs, up to 14 years RI; seriousness outweighs other factors."
    },
    {
      "id": "cr3",
      "text": "Respondent's case distinguishable as he is in touch with foreign agency; others' bail prior to commitment irrelevant; no likelihood of long trial now.",
      "addresses_issue": "i2",
      "key_observation": "Discretion under s.498 should not be exercised for bail in such serious case."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In bail applications for non-bailable offences, court must first determine bailable nature; if non-bailable, consider seriousness, nature of offence, State interests etc., even under s.498 CrPC.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Bail should be refused in serious offences like s.3 Official Secrets Act affecting State safety/military affairs.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Official Secrets Act, 1923",
      "sections": [
        "s. 3",
        "s. 5"
      ],
      "relevance": "s.3 non-bailable offence of communicating secret official code/information useful to enemy, esp. re military affairs (up to 14 years); s.5 bailable."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 496",
        "s. 498"
      ],
      "relevance": "s.496 for bailable offences (bail as matter of right); s.498 wide High Court powers for bail but require considerations for non-bailable offences."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 120B"
      ],
      "relevance": "Criminal conspiracy read with ss.3/5 of Act."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order granting bail set aside. Respondent already arrested under interim order; no further order necessary.",
    "relief_granted": "Cancellation of bail to respondent",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "There is in our opinion a basic error in the order of the High Court. Whenever an application for bail is made to a court, the first question that it has to decide is whether the offence, for which the accused is being prosecuted is bailable or otherwise.",
      "speaker": "court",
      "significance": "Core principle for bail applications reiterated."
    },
    {
      "text": "Obviously, the offence is of a very serious kind affecting the safety or the interests of the State.",
      "speaker": "court",
      "significance": "Highlights gravity of s.3 Official Secrets Act offence justifying refusal of bail."
    }
  ],
  "_case_id": "1961_216",
  "_label": 1,
  "_text_length": 9302,
  "_extracted_at": "2026-02-10T19:32:38.944301"
}