{
  "metadata": {
    "case_name": "Certain Industrial Concerns v. State of Uttar Pradesh and Ors.",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal Nos. 327 and 363 to 369 of 1958",
    "date_of_judgment": "1961-03-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "There were disputes between the appellants (industrial concerns) and their workmen.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Disputes were referred for adjudication to industrial tribunals set up under general orders dated March 15, 1951 (G.O. Nos. 615 and 671) under s. 3 of U.P. Industrial Disputes Act, 1947.",
      "type": "procedural",
      "date": "1951-03-15",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Certain awards were passed by the industrial tribunals.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellants appealed the awards to the Labour Appellate Tribunal and failed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellants filed petitions under Art. 226 of the Constitution in Allahabad High Court challenging constitutionality of s. 3 of the Act and validity of the two general orders of March 15, 1951.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Allahabad High Court held s. 3 constitutional but the two general orders invalid; however, orders of reference were special orders under s. 3 and valid, so dismissed petitions. Judgments: March 6, 1956 (Writ 967/1953); February 1, 1957 (Writs 51,523,524,607,632,633,634/1955).",
      "type": "procedural",
      "date": "1956-03-06",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellants obtained certificates for leave to appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Preamble to G.O. No. 615 of March 15, 1951 invoked cls. (b),(c),(d),(g) of s.3 and s.8, superseding earlier order; set up conciliation boards and industrial tribunals.",
      "type": "background",
      "date": "1951-03-15",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "No recital in the preambles of G.O. Nos. 615 and 671 that State Government formed opinion as condition precedent under s.3.",
      "type": "disputed",
      "date": "1951-03-15",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellants contended no affidavit filed by State initially; State later filed affidavit in SC by Labour Secretary that drafts considered by Labour Minister, satisfied conditions for public convenience, order, supplies, employment.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "High Court commented on absence of State affidavit.",
      "type": "background",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Constitutionality of s. 3 of U.P. Industrial Disputes Act, 1947, particularly cls. (c), (d), (g) - whether excessive delegation of essential legislative function.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Validity of general orders Nos. 615 and 671 dated March 15, 1951 - whether lack of recital of condition precedent (State Government's opinion) renders them invalid, and if affidavit can cure defect.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether orders of reference were special orders under s. 3, making them valid even if general orders invalid (not decided by SC as unnecessary).",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "S. 3 unconstitutional as delegates essential legislative function (determination of policy and rule of conduct) to Government re cls. (c),(d),(g); no specification of powers/qualifications/place for tribunals.",
      "supporting_facts": [
        "f2",
        "f8"
      ],
      "legal_basis": "In re Delhi Laws Act (1951 SCR 747); Queen v. Burah"
    },
    {
      "id": "pa2",
      "text": "General orders invalid as no recital of condition precedent (Govt opinion for public safety etc.) in preamble; must be recited for validity, cannot be cured by affidavit; satisfaction part of legislative process.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Wichita Railroad Light Co. v. Public Utilities Commission; Herbert Mahler v. Howard Eby; Panama Refining Co. v. Ryan"
    },
    {
      "id": "pa3",
      "text": "Orders passed without actual satisfaction of State Government.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "S. 3 U.P. Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No need for recital of conditions precedent unless statute requires; presume satisfied unless contrary proved; distinction subjective opinion vs. hearing/finding; validity depends on actual formation of opinion before order.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "State of Bombay v. Purushottam Jog Naik (1952 SCR 674); Biswabhusan Naik v. State of Orissa (1955 SCR 92); State of Bombay v. Bhanji Munji (1955 SCR 777)"
    },
    {
      "id": "ra2",
      "text": "Affidavit shows satisfaction existed.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Legislature performed essential function: laid policy (when Govt may act for public safety etc.), how (general/special order), what (appoint courts, refer disputes, incidental); details subordinate rules within limits; not excessive delegation.",
      "addresses_issue": "i1",
      "key_observation": "S. 3 lays down conditions, manner, contents; policy formulated as binding rule of conduct."
    },
    {
      "id": "cr2",
      "text": "Accepts State affidavit: satisfaction existed before orders; condition precedent fulfilled.",
      "addresses_issue": "i2",
      "key_observation": "Drafts considered by Labour Minister; satisfied for public convenience, order, supplies, employment."
    },
    {
      "id": "cr3",
      "text": "Recital desirable but not necessary unless statute requires; defect curable by affidavit/other evidence proving satisfaction; presumption of regularity shifts burden if recital present; applies to subordinate legislation as to executive orders.",
      "addresses_issue": "i2",
      "key_observation": "Validity depends on actual satisfaction and making order, not recital in notification."
    },
    {
      "id": "cr4",
      "text": "Distinguishes US cases requiring express findings post-hearing; here subjective opinion, no such mandate.",
      "addresses_issue": "i2",
      "key_observation": "No statutory requirement for recital."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S. 3 constitutional; no excessive delegation of legislative essentials.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "General orders Nos. 615 and 671 valid under s. 3; lack of recital cured by affidavit proving satisfaction.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "In re The Delhi Laws Act, 1912",
      "citation": "1951 S.C.R. 747",
      "treatment": "followed",
      "relevance": "Defines essential legislative function (policy determination, rule of conduct); permissible delegation of details."
    },
    {
      "case_name": "Queen v. Burah",
      "citation": "1878 L.R. 5 I.A. 178",
      "treatment": "followed",
      "relevance": "Conditional legislation valid if legislature determines place, person, powers."
    },
    {
      "case_name": "State of Bombay v. Purushottam Jog Naik",
      "citation": "1952 S.C.R. 674",
      "treatment": "followed",
      "relevance": "Defective form in executive order curable by proof of validity."
    },
    {
      "case_name": "Biswabhusan Naik v. State of Orissa",
      "citation": "1955 1 S.C.R. 92",
      "treatment": "followed",
      "relevance": "Omission in sanction not fatal if proved aliunde."
    },
    {
      "case_name": "State of Bombay v. Bhanji Munji",
      "citation": "1955 1 S.C.R. 777",
      "treatment": "followed",
      "relevance": "Omission of purpose in requisition order not fatal if proved otherwise."
    },
    {
      "case_name": "King Emperor v. Sibnath Banerjee",
      "citation": "1944 F.C.R. 1; 1945 F.C.R. 195",
      "treatment": "followed",
      "relevance": "Presumption of regularity; burden shifts if recital present."
    },
    {
      "case_name": "Wichita Railroad Light Company v. Public Utilities Commission of Kansas",
      "citation": "1922 67 L. Ed. 124",
      "treatment": "distinguished",
      "relevance": "Required express finding post-hearing; not applicable here."
    },
    {
      "case_name": "Herbert Mahler v. Howard Eby",
      "citation": "1924 68 L. Ed. 549",
      "treatment": "distinguished",
      "relevance": "Statute required finding in record; hearing case."
    },
    {
      "case_name": "Panama Refining Company v. A.D. Ryan",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Section struck down for delegation; executive order fell with it."
    }
  ],
  "statutes_cited": [
    {
      "name": "United Provinces Industrial Disputes Act, 1947 (U.P. XXVIII of 1947)",
      "sections": [
        "Section 3 (cls. (b),(c),(d),(g))",
        "Section 8",
        "Section 19"
      ],
      "relevance": "Challenged for delegation; upheld; authorizes general/special orders for tribunals, references if govt opinion on public safety etc."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for High Court writ petitions."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld constitutionality of s. 3 and validity of general orders Nos. 615 and 671 of March 15, 1951, curing lack of recital via affidavit; unnecessary to decide on references as special orders; appellants fail on argued points, appeals fail.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The essentials of such function are the determination of the legislative policy and its formulation as a rule of conduct.\"",
      "speaker": "court",
      "significance": "Defines test for excessive delegation from Delhi Laws Act."
    },
    {
      "text": "\"So long as a policy is laid down and a standard established by statute no unconstitutional delegation of legislative power is involved...\"",
      "speaker": "court",
      "significance": "Permissible delegation principle applied to uphold s.3."
    },
    {
      "text": "\"...it is not necessary that the satisfaction of those conditions must be recited in the order itself, unless the statute requires it...\"",
      "speaker": "court",
      "significance": "Key holding on recitals in subordinate orders."
    }
  ],
  "_case_id": "1961_24",
  "_label": 0,
  "_text_length": 30106,
  "_extracted_at": "2026-02-10T19:29:50.969798"
}