{
  "metadata": {
    "case_name": "State of Bihar v. Respondent",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Civil Appeal No. 354 of 1957",
    "date_of_judgment": "1961-09-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent was inducted as a tenant on a tract of land measuring 245.69 acres in village Singpur by the then proprietor in November 1945.",
      "type": "background",
      "date": "1945-11",
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "In 1945 this area was forest land.",
      "type": "background",
      "date": "1945",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On September 15, 1946, a notification was published under section 14 of the Bihar Private Forest Act, 1946 declaring the Government's intention of constituting the forest a private protected forest. By the same notification the Governor further ordered that until the publication of a notification under s. 30 of the Act all the rights to cut, collect and remove trees or any class of trees in or from the forest shall cease to exist subject to conditions and specifications specified in the Second Schedule.",
      "type": "material",
      "date": "1946-09-15",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The result of this notification was that immediately on its publication in the Government Gazette the respondent's right to cut, collect and remove trees ceased so long as this forest continued to be a private forest.",
      "type": "material",
      "date": "1946-09-15",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On the 6th April, 1948, a notification under the proviso to s. 30 of the Bihar Private Forest Act, was published.",
      "type": "procedural",
      "date": "1948-04-06",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Zemindari interest of the proprietor became vested in the State of Bihar in consequence of a notification under the Bihar Land Reforms Act (Bihar Act XXX of 1952) on the 30th December, 1952. Respondent continued to remain in possession.",
      "type": "material",
      "date": "1952-12-30",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On January 22, 1953, there was a notification which both parties agree, was in substance under the proviso to s. 29 of the Indian Forest Act, 1927. In consequence of this notification the forests in Singpur Village became a protected forest.",
      "type": "material",
      "date": "1953-01-22",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On May 29, 1953, a further notification under section 30 of the Indian Forest Act was made prohibiting the breaking up or clearing the land of this and certain other protected forests for cultivation.",
      "type": "material",
      "date": "1953-05-29",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Local employees of the Forest Department acting under the Divisional Forest Officer, Gaya, started interfering with the agricultural operations carried on behalf of the respondent apparently on the strength of this notification of May 29, 1953.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The respondent sought the permission of the Collector of Gaya to start reclamation and cultivation of lands.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "On April 22, 1954 the Collector of Gaya gave the respondent permission to go ahead with the work of reclamation and cultivation in this area.",
      "type": "procedural",
      "date": "1954-04-22",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The Forest Officer however disregarded the Collector's orders and made the respondent to stop reclamation.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "On being approached by the respondent the Collector called upon the Forest Officer to furnish an explanation as to why he had flouted deliberately the Collector's orders.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Ultimately, the Bihar Government sent a telegram to the Collector, Gaya, on June 10, 1954 desiring that the order issued by the Collector on April 22, permitting the respondent to go ahead with the reclamation should be withdrawn pending the decision of the Government in the matter.",
      "type": "procedural",
      "date": "1954-06-10",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "The Collector forwarded a copy of this telegram to the respondent for information and necessary action on June 11, 1954.",
      "type": "procedural",
      "date": "1954-06-11",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "It does not appear that any further order has been made by Government in the matter.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "On August 2, 1954 the respondent made his application to the High Court of Judicature at Patna praying that an appropriate writ be issued for cancellation by the Government of Bihar of the directions given on June 10, 1954 to the Collector and for restraining the Government of Bihar and the Forest Officer from interfering with the petitioner's possession over this land in village Singpur.",
      "type": "procedural",
      "date": "1954-08-02",
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "Judgment and decree dated October 7, 1955, of the Patna High Court in Misc. Judicial Case No. 422 of 1954 allowing the petition, quashing the State Government's order conveyed in their telegram of the 10th June and the order of the Forest Officer dated the 1st May, by which this Officer had prohibited reclamation of the disputed land by the respondent.",
      "type": "procedural",
      "date": "1955-10-07",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondent's right to the land had ceased under s. 19 of the Bihar Private Forests Act on the publication of a notification by the Government of Bihar under the proviso to section 30 of that Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the order passed by the Forest Officer on the basis of Rule 4 of the Bihar Protected Forests Rules should prevail over the permission granted by the Collector under r. 8.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the prohibition by the State Government of clearing or breaking up for cultivation or for any other purpose of any land in a protected forest by the notification dated May 29, 1953, under s. 30 of the Indian Forest Act, 1927, must prevail over the permission given by the Collector.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The respondent's right to the land had been extinguished under section 19 of the Bihar Act IX of 1948, on the publication of a notification by the Government of Bihar under the proviso to section 30 of that Act. When a notification is made under the proviso to section 30, no further notification under section 30 need be made at all. The words 'notification under s. 30 is published' includes a notification made under the proviso to that section.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "Section 19, proviso to s.30 Bihar Private Forests Act, 1947"
    },
    {
      "id": "pa2",
      "text": "The Collector's order was of no avail in the face of rule 4 of the rules made by the Government of Bihar under section 32 which provides that no person shall cut, convert, or remove from the said forest or otherwise deal in trees etc., of the forest except in accordance with Rules 1, 2 and 3. Rule 8 has no operation so long as trees are standing and it is only if trees have been cut or removed under the provisions of rr. 1, 2 and 3 and only stumps of those trees are standing that the Collector can give permission.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Rules 1-4, Rule 8 Bihar Protected Forest Rules under s.32 Indian Forest Act, 1927"
    },
    {
      "id": "pa3",
      "text": "The prohibition by the State Government of clearing or breaking up for cultivation or for any other purpose of any land in a protected forest by the notification dated May 29, 1953, under s. 30 of the Indian Forest Act, 1927, must prevail over the permission given by the Collector.",
      "supporting_facts": [
        "f8",
        "f11"
      ],
      "legal_basis": "Section 30 Indian Forest Act, 1927"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The forest having become a protected forest under Chapter IV of the Indian Forest Act the Collector was the proper and competent authority to give permission to clear or break up for cultivation, land in this forest under Rule 8 of the rules made by the Government of Bihar in exercise of the power conferred by section 32 of the Indian Forest Act, 1927 and that neither the Forest Officer nor the Government of Bihar itself could in law interfere with what he was doing on the strength of that permission.",
      "supporting_facts": [
        "f7",
        "f11"
      ],
      "legal_basis": "Rule 8 Bihar Protected Forest Rules under s.32 Indian Forest Act, 1927"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The notification under the proviso to s.30 is not intended to amount to a final constitution of the private forest as a private protected forest. It is only pending the completion of the said enquiries, procedure and appeals. Extinction of rights under s.19 can take place only after the final notification under s.30 has been published.",
      "addresses_issue": "i1",
      "key_observation": "Rights other than landlords rights in respect of which no claim has been preferred under s.16 or which have not been disclosed by enquiry under s.17 were intended by the legislature to be extinguished only after the final notification is made."
    },
    {
      "id": "cr2",
      "text": "Rules 1 to 4 apply to the cutting or removal of trees where in spite of such cutting the forest would continue to be a forest but cutting of trees which is necessary for clearing the land for cultivation or any other purpose is not controlled by Rules 1,2,3 or 4 but only by Rule 8.",
      "addresses_issue": "i2",
      "key_observation": "Harmonious construction of Rules 4 and 8: Rule 8 under clause g of s.32 for clearing and breaking up land for cultivation."
    },
    {
      "id": "cr3",
      "text": "Section 34 provides that nothing in this Chapter shall be deemed to prohibit any act done... in accordance with rules made under s.32. The prohibition by notification under s.30 is ineffective where such clearing is being made in accordance with Rule 8.",
      "addresses_issue": "i3",
      "key_observation": "Prohibition under s.30 yields to permission under rules made under s.32 per s.34."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Notification under proviso to s.30 Bihar Private Forests Act does not extinguish rights under s.19 without final notification under main part of s.30.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Collector's permission under r.8 prevails over Forest Officer's powers under rr.1-4 for clearing land for cultivation.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "S.30 notification prohibition does not prevail over permission under r.8 due to s.34 Indian Forest Act.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bihar Private Forest Act, 1946 (or 1947, Act IX of 1948)",
      "sections": [
        "Section 14",
        "Section 15",
        "Section 16",
        "Section 17",
        "Section 19",
        "Section 22",
        "Section 23",
        "Section 27",
        "Section 30 (main and proviso)"
      ],
      "relevance": "Provisions for constituting private protected forests, claims procedure, extinction of rights only after final notification under s.30."
    },
    {
      "name": "Indian Forest Act, 1927",
      "sections": [
        "Section 29 (proviso)",
        "Section 30",
        "Section 32 (clauses a,b,c,d,g)",
        "Section 34"
      ],
      "relevance": "Constitution of protected forests, rules for regulating acts in protected forests, s.34 saves acts done per rules under s.32 from prohibitions."
    },
    {
      "name": "Bihar Land Reforms Act, 1950 (XXX of 1952)",
      "sections": [],
      "relevance": "Vesting of zemindari interests in State."
    },
    {
      "name": "Bihar Protected Forest Rules, 1953 (under s.32 Indian Forest Act)",
      "sections": [
        "Rule 1",
        "Rule 2",
        "Rule 3",
        "Rule 4",
        "Rule 8"
      ],
      "relevance": "Regulate cutting/removal of trees (rr.1-4) vs. clearing/breaking land for cultivation (r.8 by Collector)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed. High Court order upheld in substance but modified: instead of certiorari, writ in the nature of mandamus issued directing the State Government to cancel its order on the Collector made on June 10, 1954 and restraining the Government and the Forest Officer from interfering with the respondent's possession over 245.69 acres of land in village Singpur which he possesses as tenant.",
    "relief_granted": "Writ of mandamus directing cancellation of govt telegram of 10.6.1954 and restraining interference with possession.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is abundantly clear that the notification under the proviso is not intended to amount to a final constitution of the private forest as a private protected forest.\"",
      "speaker": "court",
      "significance": "Rejects extinguishment of rights under s.19 without final s.30 notification."
    },
    {
      "text": "\"The reasonable way of reading Rules 1 to 4 and Rule 8 appears to us to be that Rules 1 to 4 apply to the cutting or removal of trees where in spite of such cutting the forest would continue to be a forest but cutting of trees which is necessary for clearing the land for cultivation... is not controlled by Rules 1,2,3 or 4 but only by Rule 8.\"",
      "speaker": "court",
      "significance": "Harmonious construction prioritizing Collector's permission for reclamation."
    },
    {
      "text": "\"It follows clearly... from section 34 that the prohibition by notification of the clearing of land would be ineffective where such clearing is being made in accordance with Rule 8.\"",
      "speaker": "court",
      "significance": "S.34 overrides s.30 prohibition for acts per rules."
    }
  ],
  "_case_id": "1961_337",
  "_label": 0,
  "_text_length": 21797,
  "_extracted_at": "2026-02-10T19:34:49.535297"
}