{
  "metadata": {
    "case_name": "Custodian of Evacuee Property, Mysore v. Respondents",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeals Nos. 101 to 104 of 1957",
    "date_of_judgment": "1961-02-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On July 7, 1949, the then State of Mysore passed The Mysore Administration of Evacuee Property Emergency Act, No. XLVII of 1949 (first Mysore Act).",
      "type": "background",
      "date": "1949-07-07",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On September 21, 1949, the Custodian issued a notification declaring the properties of the two respondents as evacuee properties which had vested in him, as the respondents had become evacuees.",
      "type": "procedural",
      "date": "1949-09-21",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Two claims were filed under s. 8 of the first Mysore Act separately by the two respondents.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On November 29, 1949, the Mysore Administration of Evacuee Property Second Emergency Act, No. LXXIV of 1949 (second Mysore Act) came into force, repealing the first Mysore Act, with s. 53(2) deeming actions under first Act as under second.",
      "type": "background",
      "date": "1949-11-29",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On April 17, 1950, the Deputy Custodian dismissed the claims, declaring the properties were evacuee properties. On the same day, the Administration of Evacuee Property Act, No. XXXI of 1950 (the Act) came into force, applying to Mysore and repealing second Mysore Act by implication.",
      "type": "procedural",
      "date": "1950-04-17",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On August 22, 1950, appeals against April 17, 1950 order were allowed by the Custodian, holding there was no sufficient evidence to prove respondents as evacuees and properties could not be treated as evacuee properties.",
      "type": "procedural",
      "date": "1950-08-22",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On October 3, 1950, the Custodian-General gave notices to respondents under s. 27 of the Act in respect of August 22, 1950 order, asking to show cause why it be not revised.",
      "type": "procedural",
      "date": "1950-10-03",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On December 7, 1950, Administration of Evacuee Property Amendment Act, No. LXVI of 1950 amended s. 58 of the Act retrospectively from April 17, 1950, explicitly repealing corresponding state laws like second Mysore Act.",
      "type": "background",
      "date": "1950-12-07",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On February 11, 1952, Custodian-General set aside August 22, 1950 order and directed further proceedings before Custodian as original matter, to dispose afresh in light of evidence.",
      "type": "procedural",
      "date": "1952-02-11",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On April 7, 1952, Custodian ordered Deputy Custodian to record evidence and submit record for final disposal.",
      "type": "procedural",
      "date": "1952-04-07",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On December 2, 1952, Custodian held that the two respondents were evacuees and their properties were evacuee properties.",
      "type": "procedural",
      "date": "1952-12-02",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On January 2, 1953, two appeals filed to Mysore High Court against December 2, 1952 order.",
      "type": "procedural",
      "date": "1953-01-02",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On September 7, 1953, two writ petitions filed against December 2, 1952 order.",
      "type": "procedural",
      "date": "1953-09-07",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "On February 4, 1954, Mysore High Court by common judgment held appeals competent, Custodian-General had no power under s.27 to revise August 22, 1950 order, allowed appeals and writs, set aside December 2, 1952 order, restored August 22, 1950 order.",
      "type": "procedural",
      "date": "1954-02-04",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Certificates granted by High Court for appeals to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Custodian-General had jurisdiction under s. 27 of the Act to set aside the Custodian's order dated August 22, 1950.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether an appeal lay to the High Court from the Custodian's order dated December 2, 1952.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the High Court could interfere with the Custodian's order dated December 2, 1952 via writ of certiorari under Art. 226.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in holding Custodian-General had no power under s. 27 of the Act to set aside order of August 22, 1950.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": "s. 27 of Administration of Evacuee Property Act, 1950; s. 53(2) second Mysore Act; s. 58 as amended by Act LXVI/1950"
    },
    {
      "id": "pa2",
      "text": "High Court erred in holding appeal lay to it from order of December 2, 1952; could only consider writ petitions, and no writ of certiorari justified as order not without jurisdiction and no error of law apparent on face.",
      "supporting_facts": [
        "f11",
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": "Repeal of first Mysore Act; equivalence of procedures under later Acts; vested right of appeal taken away by necessary intendment"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Custodian-General had no jurisdiction to set aside order of August 22, 1950 under s. 27 of the Act.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": "s. 27 of the Act"
    },
    {
      "id": "ra2",
      "text": "Proceedings began under s. 8 of first Mysore Act; no corresponding provision in second Mysore Act or the Act; thus appeal lies to High Court under s. 30 of first Mysore Act as vested right.",
      "supporting_facts": [
        "f2",
        "f3",
        "f11",
        "f12"
      ],
      "legal_basis": "s. 8 and s. 30 first Mysore Act; s. 6(e) Mysore General Clauses Act; no necessary intendment to take away appeal right"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "First Mysore Act repealed by second Mysore Act (s.53(2) saves actions); second repealed by the Act from April 17, 1950 (confirmed retrospectively by Act LXVI/1950 s.58(2)); only the Act held field by October 1950.",
      "addresses_issue": "i1",
      "key_observation": "Custodian-General had wide power under s.27 to revise any order by Custodian as to legality or propriety; actions under prior Acts deemed under the Act."
    },
    {
      "id": "cr2",
      "text": "Proceedings under s.8 first Mysore Act substantially equivalent to s.5 second Mysore Act / s.7 the Act (investigation into whether property evacuee after notice/inquiry); deemed continued under later provisions by savings clauses.",
      "addresses_issue": "i2",
      "key_observation": "No vital difference in procedures; right of appeal to High Court under first Act taken away by necessary intendment, replaced by appeal to Custodian-General under later Acts."
    },
    {
      "id": "cr3",
      "text": "Custodian had jurisdiction post Custodian-General's valid order; issue whether respondents evacuees is factual; no patent error of law; High Court exceeded certiorari scope by reviewing facts/merits.",
      "addresses_issue": "i3",
      "key_observation": "Certiorari only for jurisdictional error, natural justice violation, or patent legal error; not for erroneous facts or wrong decisions."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Custodian-General had jurisdiction under s.27 of the Act to revise and set aside the Custodian's order dated August 22, 1950.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No appeal lay to High Court from Custodian's order dated December 2, 1952; vested right of appeal under first Mysore Act superseded by necessary intendment via later legislation providing appeal to Custodian-General.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "High Court could not issue certiorari against December 2, 1952 order: no jurisdictional defect, no error apparent on face; factual findings not reviewable.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Garikapatti Veeraya v. Subbiah Choudhury",
      "citation": "1957 S.C.R. 488",
      "treatment": "followed",
      "relevance": "Vested right of appeal is substantive, arises at commencement, can be taken away expressly or by necessary intendment."
    },
    {
      "case_name": "Hari Vishnu Kamath v. Syed Ahmed Ishaque",
      "citation": "1955 S.C.R. 1104",
      "treatment": "followed",
      "relevance": "Scope of certiorari: for jurisdictional errors, illegal exercise of jurisdiction, natural justice violations, or patent errors of law; not factual review or mere wrong decisions."
    }
  ],
  "statutes_cited": [
    {
      "name": "Mysore Administration of Evacuee Property Emergency Act, 1949",
      "sections": [
        "s. 2(c)",
        "s. 2(d)",
        "s. 5",
        "s. 6",
        "s. 8",
        "s. 30"
      ],
      "relevance": "Original proceedings commenced under notification s.6, claims s.8; appeal to High Court s.30; ipso facto vesting."
    },
    {
      "name": "Mysore Administration of Evacuee Property Second Emergency Act, 1949",
      "sections": [
        "s. 5",
        "s. 6",
        "s. 22",
        "s. 23",
        "s. 25",
        "s. 53(2)"
      ],
      "relevance": "Repealed first Act, saved actions; no ipso facto vesting, declaration after inquiry s.5 then vesting s.6; appeals to Custodian-General/District Judge; revisions."
    },
    {
      "name": "Administration of Evacuee Property Act, 1950",
      "sections": [
        "s. 2(c)",
        "s. 2(d)",
        "s. 5A",
        "s. 7(1)",
        "s. 24",
        "s. 27",
        "s. 58"
      ],
      "relevance": "Repealed state Acts; wide revision power Custodian-General s.27; appeals s.24; inquiry and declaration s.7 equivalent to prior procedures."
    },
    {
      "name": "Administration of Evacuee Property Amendment Act, 1950",
      "sections": [
        "s. 58(2)"
      ],
      "relevance": "Amended s.58 retrospectively from April 17, 1950, explicitly repealing corresponding state laws."
    },
    {
      "name": "Mysore General Clauses Act, 1899",
      "sections": [
        "s. 6(e)"
      ],
      "relevance": "Effects of repeal; proceedings under repealed Act may continue if no contrary intendment."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "High Court writ jurisdiction, including certiorari."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeals, set aside the High Court's order dated February 4, 1954, and restored the Custodian's order dated December 2, 1952. Noted that this does not preclude respondents from approaching Custodian-General under s.24 if right exists, as merits not considered.",
    "relief_granted": "Restoration of Custodian's order dated December 2, 1952 declaring properties as evacuee properties.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "s. 27 is very wide in terms and gives power to the Custodian-General at any time either on his own motion or on application made to him in this behalf, to call for the record of any proceeding in which any District Judge or Custodian has passed an order",
      "speaker": "court",
      "significance": "Establishes broad revisional jurisdiction of Custodian-General."
    },
    {
      "text": "the right of appeal is a substantive right and arises when a proceeding is commenced and cannot be taken away by subsequent legislation, except by express provision or necessary intendment.",
      "speaker": "court",
      "significance": "Cites principle from Garikapatti; applies necessary intendment to supersede appeal to High Court."
    },
    {
      "text": "Certiorari will not be issued to correct mere errors of fact... An error in the decision or determination itself may also be amenable to a writ of certiorari if it is a manifest error apparent on the face of the proceedings.",
      "speaker": "court",
      "significance": "Limits High Court's writ interference, quoting Hari Vishnu Kamath."
    }
  ],
  "_case_id": "1961_10",
  "_label": 1,
  "_text_length": 38501,
  "_extracted_at": "2026-02-10T19:29:59.579554"
}