{
  "metadata": {
    "case_name": "James Miranda v. Commissioner of Income-tax",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Civil Appeals Nos. 173 to 175 of 1960",
    "date_of_judgment": "1961-03-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The firm was carrying on the business of wine merchants at Bombay and came into existence prior to April 1, 1939.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The firm had been assessed to income-tax under the provisions of the Income-tax Act of 1918.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The firm which was registered under the provisions of the Income-tax Act of 1922 was dissolved on March 24, 1945.",
      "type": "material",
      "date": "1945-03-24",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "From March 25, 1945, a Private limited company i.e. S. S. Miranda and Co. Ltd. succeeded to the business of the firm.",
      "type": "material",
      "date": "1945-03-25",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "A claim made under s. 25(4) of the Act to the effect that no tax was payable on the profits of the registered firm for the period between April 1, 1944, to March 24, 1945, was allowed.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In respect of the chargeable accounting period April 1, 1944, to March 24, 1945, the registered firm was taxed to excess profits tax under the Excess Profits Tax Act, 1940.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "It also deposited as required certain sums of money under s. 10 of the Finance Act, 1942, read with s. 2 of the Excess Profits Tax Ordinance, 1943.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In accordance with those provisions the firm became entitled to repayment of a portion of the excess profits tax amounting to a sum of Rs. 2,35,704.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The shares of the three partners who are respective appellants in the three appeals were James Miranda Rs 58,926, Donald Miranda Rs. 58,926 and Mrs. N. Q. Miranda Rs. 1,17,854.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The Income-tax Officer rejected the submission that the amount refunded was business profit and therefore exempt from tax under s. 25(4) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The share of each of the appellants was assessed to income-tax and super tax and the balance after deducting the same he repaid to each of the partners but he computed the rate applicable to the tax by including the appellants total business income which was exempt under s. 25(4) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On appeal this assessment was confirmed but on further appeal the Income-tax Appellate Tribunal held that the sum which was refunded was income from business and was therefore, exempt from income-tax under s. 25(4) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "At the instance of the Commissioner of Income-tax, the Tribunal referred the question of law to the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The High Court held that the amount so refunded was income from other sources taxable under s. 12 of the Act and the appellants were therefore not entitled to the benefit of s. 25(4) of the Act.",
      "type": "procedural",
      "date": "1958-03-11",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appeals pursuant to certificate under s. 66A(2) of the Indian Income-tax Act, 1922 against the judgment and orders dated March 11, 1958, of the Bombay High Court in I.T.R. No. 36 of 1957.",
      "type": "procedural",
      "date": "1958-03-11",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the repayment of excess profits tax made by the Central Government in pursuance of Section 10 of the Indian Finance Act, 1942, or Section 2 of the Excess Profits Tax Ordinance, 1943, is profits from business for the purposes of Section 25(4) of the Indian Income-tax Act?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The amount refunded was income, profits and gains from business and fell under s. 10 of the Act and was therefore exempt under s. 25(4) of the Act.",
      "supporting_facts": [
        "f8",
        "f9",
        "f5"
      ],
      "legal_basis": "Section 10 and Section 25(4) of Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The amount so refunded was income from other sources taxable under s. 12 of the Act and the appellants were therefore not entitled to the benefit of s. 25(4) of the Act. Clearly the view of the Legislature was that this income should be treated as a statutory income with the consequences that must necessarily follow by reason of its being a statutory income.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 12 of Indian Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 12(1) of the Excess Profits Tax Act shows that the amount of excess profits tax payable in respect of a business for any chargeable accounting period was an allowable expenditure. Under s. 11(1) of the Indian Finance Act, 1946, any excess profits refunded under the provisions of Indian Finance Act, 1942, or of s. 2 of the Excess Profits Tax Ordinance, 1943, were deemed to be income and were to be treated as income of the previous year which constituted or which included the chargeable accounting period in respect of which the said sum was repayable.",
      "addresses_issue": "i1",
      "key_observation": "The sum repaid was to be treated as income for the purposes of the Act for the previous year, notwithstanding s. 34 of the Act."
    },
    {
      "id": "cr2",
      "text": "The preamble of the Excess Profits Tax Act shows that the object of that Act was to impose a tax on profits arising out of certain businesses. Therefore when any portion of the tax collected on excess profits tax was refunded under the provisions of the Finance Act, 1942 or the Excess Profits Tax Ordinance, 1943, it necessarily had the same quality which it had before the amount which was charged with the payment of tax had under the provisions of those Acts.",
      "addresses_issue": "i1",
      "key_observation": "When it was deposited with the Central Government it was a portion of the profits of the business of the assessee and when it was returned to the assessee it must be restored to its character of being a part of the profits of a business."
    },
    {
      "id": "cr3",
      "text": "The amount of excess profits tax was an allowable deduction for the purpose of computation of the business profits of an assessee under s. 12(1) of the Excess Profits Tax Act and when it or a portion of it was refunded it had to be treated as income of the assessee.",
      "addresses_issue": "i1",
      "key_observation": "Its nature remains the same. The effect of the deposit under the Acts above-mentioned, was as if a slice of the business profit was taken and deposited with the Central Government Treasury and then when it was found that a larger amount had been deposited than was exigible a portion of it was returned."
    },
    {
      "id": "cr4",
      "text": "In McGregor and Balfour Ltd. v. Commissioner of Income Tax, West Bengal, the amount received as a refund by the assessee was held to be income for the purpose of the Act and for assessment it was treated as income of the previous year.",
      "addresses_issue": "i1",
      "key_observation": "The intention underlying the two provisions is the same and the language is substantially similar."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The amount refunded was business profit and therefore exempt from tax under s. 25(4) of the Act.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "McGregor and Balfour Ltd. v. Commissioner of Income Tax, West Bengal",
      "citation": "1959 36 I.T.R. 65",
      "treatment": "followed",
      "relevance": "Amount received as refund held to be income treated as income of previous year; intention of legislature same as English provisions."
    },
    {
      "case_name": "W. Nesbitt Ltd. v. Mitchell",
      "citation": "1926 11 T.C. 211",
      "treatment": "referred",
      "relevance": "Repayment comes back without losing its character as sum taken out of profits subject to excess profits duty."
    },
    {
      "case_name": "Kirkes Trustees v. Commissioners of Inland Revenue",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Repayment treated as trading profits under Case I or Case VI of Schedule D; Case VI deals with annual profits and gains not falling in other cases."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 66A(2)",
        "s. 25(4)",
        "s. 12",
        "s. 34",
        "s. 10"
      ],
      "relevance": "Exemption for profits of dissolved registered firm; treatment of refunded amount as business income exempt under s. 25(4); deemed income of previous year."
    },
    {
      "name": "Excess Profits Tax Act, 1940",
      "sections": [
        "s. 12(1)"
      ],
      "relevance": "Excess profits tax payable in respect of business allowable as deduction in computing profits for income-tax."
    },
    {
      "name": "Indian Finance Act, 1942",
      "sections": [
        "s. 10"
      ],
      "relevance": "Provisions for repayment of excess profits tax."
    },
    {
      "name": "Excess Profits Tax Ordinance, 1943",
      "sections": [
        "s. 2"
      ],
      "relevance": "Provisions for repayment of excess profits tax."
    },
    {
      "name": "Indian Finance Act, 1946",
      "sections": [
        "s. 11(1)"
      ],
      "relevance": "Repaid excess profits tax deemed income of previous year constituting chargeable accounting period."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeals are allowed. The judgment and order of the High Court of Bombay is set aside. The amount refunded is held to be profits of business exempt under s. 25(4) of the Indian Income-tax Act, 1922.",
    "relief_granted": "Exemption from income-tax on shares of refunded excess profits tax under s. 25(4).",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "When it was deposited with the Central Government it was a portion of the profits of the business of the assessee and when it was returned to the assessee it must be restored to its character of being a part of the profits of a business. It cannot be said that its nature changes merely because it is refunded as a consequence of some provisions in the Finance Act or the Excess Profits Tax Ordinance.",
      "speaker": "court",
      "significance": "Core reasoning on unchanged character of refunded amount as business profits."
    },
    {
      "text": "The effect of the deposit under the Acts above-mentioned, was as if a slice of the business profit was taken and deposited with the Central Government Treasury and then when it was found that a larger amount had been deposited than was exigible a portion of it was returned. By being put in a Government Treasury it does not cease to be what it was before i.e. profits of a business.",
      "speaker": "court",
      "significance": "Analogy explaining retention of business profit nature."
    }
  ],
  "_case_id": "1961_120",
  "_label": 1,
  "_text_length": 11961,
  "_extracted_at": "2026-02-10T19:31:21.487796"
}