{
  "metadata": {
    "case_name": "Mohamed Noorullah v. Commissioner of Income-tax",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "KAPUR, J."
    ],
    "case_number": "Civil Appeals Nos. 303 to 307 of 1960",
    "date_of_judgment": "1961-01-18"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Khan Sahib Mohamed Oomer Sahib, carrying on business of manufacture and sale of Spade Clover brand Beedies, died on December 17, 1942, leaving minor son Mohamed Noorullah (appellant) by pre-deceased wife, widow Luthfunnissa Begum, and her four minor children.",
      "type": "background",
      "date": "1942-12-17",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Noorullah through next friend applied to sue in forma pauperis.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Two Advocates of Madras High Court appointed joint receivers of properties of deceased on March 17, 1943, by consent of parties.",
      "type": "procedural",
      "date": "1943-03-17",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Widow Luthfunnissa filed suit for partition on May 10, 1943, and applied for continuance of joint receivers; Noorullah opposed but receivers continued by order dated May 25, 1943.",
      "type": "procedural",
      "date": "1943-05-10",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Preliminary decree for partition passed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Business carried on without break: initially by Luthfunnissa and Dawood, then by joint receivers from date of appointment till November 25, 1946, when sold by auction to Noorullah.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Profits of business assessed to tax in hands of receivers as income of association of persons for assessment years 1944-45 to 1947-48 (accounting years calendar years 1943 to 1946).",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Appellant's contention that shares of profits of each heir should be separately taxed rejected by Income-tax authorities, Appellate Tribunal, and Madras High Court on reference under s.66(1).",
      "type": "procedural",
      "date": "1957-05-14",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "No dispute regarding income of properties taxed under s.9 of the Act.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Business inherited by heirs, nature such that it could not be divided, carried on as one whole with unity of control; all parties desired to preserve unity and continuity.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f11",
      "text": "Appellant's opposition to receivership was only to persons appointed, not to continuance of business or unity of control.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Tribunal finding: No change in continuity of business; from death till March 24, 1943, carried on by mutual agreement and consent by Luthfunnissa on behalf of herself, her minor children, and minor step-son Noorullah.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the income-tax assessment of the business of Spade Clover Beedies belonging to the estate of the deceased and carried on during the previous years 1943 to 1946 as an association of persons for the assessment years 1944-45 to 1947-48 is valid?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "On death of Mohamed Oomer, estate including business devolved upon heirs in specific shares.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No consensus of opinion between heirs, shown by appellant's application to sue in forma pauperis, widow's suit for partition, and objection to appointment of particular receivers.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Business carried on with consent of parties as one unit with unity of control; nature of business required it to be indivisible.",
      "supporting_facts": [
        "f6",
        "f10",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Opposition by appellant was only to persons appointed as receivers, not to continuance of business or unity of control; all sharers desired continuance.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Business continued without break by consent of all parties as one unit with unity of control, despite partition suit; nature required indivisibility.",
      "addresses_issue": "i1",
      "key_observation": "Heirs constituted association of persons as they pooled resources for common purpose of earning income from joint enterprise."
    },
    {
      "id": "cr2",
      "text": "Test for association of persons from precedents: combinations engaged in joint enterprise (not partnership), producing income; applies here as heirs elected to retain and manage business jointly.",
      "addresses_issue": "i1",
      "key_observation": "Suit for partition did not break unity; business carried on as single business by consent."
    },
    {
      "id": "cr3",
      "text": "Distinguished cases like S.C. Mazumdar (no business income, shares definite, no hand in business), Buldana (no agreement to share profits), Khan Bahadur (specific shares under waqf).",
      "addresses_issue": "i1",
      "key_observation": "Present case involves business income from unitary control by consent."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Assessment of business profits as income of association of persons valid under s.3 of the Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Bombay v. Indira Balkrishna",
      "citation": "1960 3 S.C.R. 513",
      "treatment": "followed",
      "relevance": "Laid down test for association of persons from earlier cases; accepted as correctly stating crucial test based on circumstances."
    },
    {
      "case_name": "In re B. N. Elias Others",
      "citation": "1935 3 I.T.R. 408",
      "treatment": "followed",
      "relevance": "Test: combinations in joint enterprise (not partnership) constitute association."
    },
    {
      "case_name": "Commissioner of Income-tax v. Laxmidas Devidas and Another",
      "citation": "1937 5 I.T.R. 584",
      "treatment": "followed",
      "relevance": "Association for acquiring/managing property to produce income taxable as such under ss.3 and 9."
    },
    {
      "case_name": "In re Dwarkanath Harischandra Pitale",
      "citation": "1937 5 I.T.R. 716",
      "treatment": "followed",
      "relevance": "Election to retain and manage property as joint venture constitutes association."
    },
    {
      "case_name": "Commissioner of Income-tax, Burma v. M. A. Baporia and Others",
      "citation": "1939 7 I.T.R. 225",
      "treatment": "referred",
      "relevance": "Mohammedan heirs become association if act shows intention; agent appointment sufficient."
    },
    {
      "case_name": "S. C. Mazumdar, Receiver, Trigunait Brothers Estate v. Commissioner of Income-tax",
      "citation": "1947 15 I.T.R. 484",
      "treatment": "distinguished",
      "relevance": "No business income; receiver in possession, assessees disassociated; contrary to Indira Balkrishna."
    },
    {
      "case_name": "Buldana District Main Cloth Importers Group, Khamgaon v. Commissioner of Income-tax, Nagpur",
      "citation": "1956 30 I.T.R. 61",
      "treatment": "distinguished",
      "relevance": "No agreement to carry on business or share profits; decided on own facts."
    },
    {
      "case_name": "Khan Bahadur M. Habibur Rahman v. Commissioner of Income-tax, Bihar Orissa",
      "citation": "1945 13 I.T.R. 189",
      "treatment": "distinguished",
      "relevance": "Definite shares under waqf; taxed per beneficiary share; decided on own facts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s. 66(1)",
        "s. 9",
        "s. 3",
        "s. 41(1)"
      ],
      "relevance": "Reference under s.66(1); property income under s.9 undisputed; business income assessable as association of persons under s.3; s.41(1) distinguished in cited case."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals by special leave against Madras High Court judgment affirming assessment of beedi business profits as income of association of persons dismissed; High Court right in conclusion.",
    "relief_granted": null,
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "the business was carried on with the consent of the parties. On this finding it has to be decided whether the business was the business of an association of persons. and its profits are assessable as such ?",
      "speaker": "court",
      "significance": "Frames core issue based on Tribunal finding."
    },
    {
      "text": "the heirs did form an association of persons within the meaning of s. 3 of the Act.",
      "speaker": "court",
      "significance": "Key holding on applicability despite partition suit."
    },
    {
      "text": "In fact, there was no change in the continuity of the business and from the date of death of Md. Oomer Sahib up to 24th March, 1943, the business was carried on by mutual agreement and consent...",
      "speaker": "tribunal",
      "significance": "Supports finding of consent and unity."
    }
  ],
  "_case_id": "1961_278",
  "_label": 0,
  "_text_length": 16382,
  "_extracted_at": "2026-02-10T19:33:20.000144"
}