{
  "metadata": {
    "case_name": "Rani Purnima Debi and Anr. v. Kumar Khagendra Narayan Deb",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 373/587",
    "date_of_judgment": "1961-08-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Kumar Chandra Narayan Deb (testator) died in June 1946.",
      "type": "background",
      "date": "1946-06",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Testator executed a will on December 29, 1943, in favour of respondent Kumar Khagendra Narayan Deb, giving entire property to respondent subject to respondent maintaining testator's widow and sister.",
      "type": "material",
      "date": "1943-12-29",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Will registered on January 27, 1944, with endorsement that testator admitted execution; application by testator's mukhtar-i-am on January 16, 1944; Sub-Registrar sent clerk Arabali who examined testator at Majikuchi.",
      "type": "material",
      "date": "1944-01-27",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "In August 1946, respondent applied before District Delegate, Gauhati, for letters of administration with the will annexed.",
      "type": "procedural",
      "date": "1946-08",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Appellants (testator's widow Rani Purnima Debi and married daughter) filed objections: will not duly and legally executed and attested; testator had no sound disposing mind; will outcome of undue influence and coercion by respondent.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Kumar Dwijendra Narayan Deb applied for probate of another will executed few months before testator's death; appellants objected on same grounds plus forgery; Dwijendra did not dispute respondent's will but contended it revoked by later will; respondent contended Dwijendra's will forgery.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Two suits tried together by Subordinate Judge at Gauhati: held Dwijendra's will not genuine, dismissed his application; respondent's will duly executed, attested, testator sound mind, no undue influence/coercion; granted letters of administration to respondent.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Three appeals to Assam High Court: appellants contested grant to respondent; Dwijendra contested grant to respondent and finding his will not genuine. High Court upheld trial court, dismissed appeals; Dwijendra's appeals final.",
      "type": "procedural",
      "date": "1954-02-02",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "High Court noted suspicious circumstances attending execution of respondent's will but held suspicion dispelled by registration in January 1944.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Will unnatural: testator left widow, married daughter (appellants), unmarried dependent sister; good relations with wife/sister; no specified maintenance amount or charge on properties; daughter completely disinherited though not well-off; respondent (distant relation) sole beneficiary.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Respondent took prominent part in execution, gets sole benefit.",
      "type": "material",
      "date": "1943-12-29",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Testator's signature on will not usual; right hand injured before; used to sign blank papers for court cases sent to lawyer Rameswar Sarma (attesting witness) or mukhtars.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Signature of testator not in same ink/pen as body of will.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Will attested by 16 persons; only 3 examined: Biswanath Bhattacharya (respondent's Purohit), Rameswar Sarma (testator's lawyer, later respondent's), Kulendra Narayan Deb (respondent's first cousin); independent witnesses like doctor, elder not produced.",
      "type": "material",
      "date": "1943-12-29",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Witnesses' evidence contradictory: Bhattacharya on adoption invitation vs. others; testator's wife presence/disapproval.",
      "type": "disputed",
      "date": "1943-12-29",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Rameswar Sarma denied working for respondent but son-in-law admitted it.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Registration: mukhtar-i-am applied; clerk Arabali went, testator admitted execution, signed bottom; Dehiram Bora identified; no reading over of will; no witnesses signed except identifier.",
      "type": "material",
      "date": "1944-01",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Testator died almost 2.5 years after registration (not 21 years as misstated).",
      "type": "background",
      "date": "1946-06",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the will dated December 29, 1943, propounded by respondent was duly and legally executed and attested.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether testator had sound disposing mind at time of execution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether will was outcome of undue influence and coercion by respondent.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether suspicious circumstances surrounding execution were dispelled by evidence including registration.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Will not duly and legally executed and attested.",
      "supporting_facts": [
        "f5",
        "f10",
        "f11",
        "f12",
        "f13",
        "f14",
        "f15",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Testator had no sound disposing mind.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Will outcome of undue influence and coercion by respondent.",
      "supporting_facts": [
        "f5",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Suspicious circumstances not dispelled by registration alone.",
      "supporting_facts": [
        "f9",
        "f17"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Will duly executed, attested, testator sound mind, no undue influence; suspicions dispelled by registration and evidence of attesting witnesses.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f14",
        "f17"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Mode of proving will: onus on propounder; in suspicious circumstances, must explain to satisfaction of court; principles from H. Venkatachala Iyengar v. B.N. Thimmajamma.",
      "addresses_issue": "i4",
      "key_observation": "Suspicious circumstances include unnatural dispositions, propounder active in execution, shaky signature, blank signed papers available, different ink."
    },
    {
      "id": "cr2",
      "text": "Attesting witnesses interested, contradictory evidence on execution details (e.g., wife's presence), no independent witnesses produced; evidence inadequate.",
      "addresses_issue": "i1",
      "key_observation": "Evidence does not dispel suspicions."
    },
    {
      "id": "cr3",
      "text": "Registration perfunctory: clerk not Sub-Registrar, no proof will read over or testator knew contents; mere admission of execution insufficient.",
      "addresses_issue": "i4",
      "key_observation": "Registration alone cannot dispel suspicions without close examination showing testator knew it was will."
    },
    {
      "id": "cr4",
      "text": "Will unnatural, unexplained; no knowledge of will post-registration assumed.",
      "addresses_issue": "i2",
      "key_observation": "Suspicious circumstances not removed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Propounder failed to prove due execution and attestation; suspicious circumstances not dispelled.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Mere registration insufficient to prove genuineness where suspicion exists, without evidence testator admitted execution knowing it was will.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "H. Venkatachala Iyengar v. B. N. Thimmajamma",
      "citation": "1959 Supp. 1 S.C.R. 426",
      "treatment": "followed",
      "relevance": "Principles governing proof of wills, onus on propounder in suspicious circumstances."
    },
    {
      "case_name": "Vellaswamy Sarvai v. L. Sivaraman Servai",
      "citation": "1930 I.L.R. 8 Ran. 179",
      "treatment": "referred",
      "relevance": "Registered wills not always genuine."
    },
    {
      "case_name": "Surendra Nath Lahiri v. Jnanendra Nath Lahiri",
      "citation": "A.I.R. 1932 Cal. 574",
      "treatment": "referred",
      "relevance": "Registered wills not always acted upon."
    },
    {
      "case_name": "Girja Datt Singh v. Gangotri Datt Singh",
      "citation": "A.I.R. 1955 S.C. 346",
      "treatment": "referred",
      "relevance": "Registered wills not always genuine."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Succession Act, 1925",
      "sections": [
        "s.63"
      ],
      "relevance": "Special requirement of attestation for wills; proof of execution and attestation."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgments of High Court and trial court set aside; respondent's application for letters of administration dismissed; no letters granted on basis of the will.",
    "relief_granted": "Appeal allowed, probate proceedings dismissed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Where, however, there were suspicious circumstances, the onus would be on the propounder to explain them to the satisfaction of the Court before the will could be accepted as genuine.",
      "speaker": "court",
      "significance": "States core principle of proof of wills from precedent."
    },
    {
      "text": "The mere fact that a will is registered will not by itself be sufficient to dispel all suspicion regarding it where suspicion exists, without submitting the evidence of registration to a close examination.",
      "speaker": "court",
      "significance": "Key holding on weight of registration."
    },
    {
      "text": "We are therefore not satisfied about the due execution and attestation of this will by the testator and hold that the propounder has been unable to dispel the suspicious circumstances which surround the execution and attestation of this will.",
      "speaker": "court",
      "significance": "Final conclusion leading to dismissal."
    }
  ],
  "_case_id": "1961_260",
  "_label": 1,
  "_text_length": 34353,
  "_extracted_at": "2026-02-10T19:33:25.478153"
}