{
  "metadata": {
    "case_name": "Four Appellants v. State",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Criminal Appeal No. 165 of 1960",
    "date_of_judgment": "1961-03-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants along with three other persons forcibly took two carts loaded with sugarcane from the field of Suraj Bhan through the field of Harphool to transport to public passage about a furlong and a half away.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Appellants party beat Harphool and others when Harphool protested against damage to his wheat and gram crop caused by carts.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Ram Chandar, one of the appellants, armed with hatchet (kulhari); others armed with lathis.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Harphool and others who came to his help struck the appellants party in self-defence.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Harphool died as a result of injuries received in the incident.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellants admitted taking carts through Harphool's field; alleged they asked to be excused, promised not to take carts through fields in future, pleaded to allow crossing small portion remaining to public passage.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Appellants alleged that despite their meek conduct, Harphool and companions attacked them, and they struck in self-defence.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Concurrent findings: (i) no passage through or along boundary of Harphool's field; (ii) when carts near passage and Harphool protested, appellants party began attack; (iii) appellants had no right of private defence of person but formed unlawful assembly with common object of committing criminal trespass over Harphool's field and using force to extent of causing death if necessary.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Two carts had not left Harphool's field; were inside field near boundary, several yards inside when incident took place.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "From site plan, appellants could have taken carts northwards from Suraj Bhan's field: shorter distance to public pathway, trespass through one field of own community Sandal Rajput; other fields of Suraj Bhan.",
      "type": "background",
      "date": "null",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellants chose longer route through fields of several Sainis including Harphool, causing damage to crops.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Harphool received seven injuries: one incised wound bone deep on right side of head; one contused wound bone deep on left side of head; died within 24 hours due to shock and haemorrhage from skull bone and brain injuries.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appeal by special leave from judgment dated December 19, 1958 of Allahabad High Court in Criminal Appeal No. 1010 of 1956, confirming conviction by Sessions Judge, Saharanpur for offences including s.302 r/w s.149 IPC.",
      "type": "procedural",
      "date": "1958-12-19",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether criminal trespass had come to an end when Harphool protested, ceasing any right of private defence of property for Harphool.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether injury causing death was caused in prosecution of common object for liability under s.149 IPC.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether unlawful assembly ceased after completion of common object, limiting liability to actual perpetrators.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether High Court misdirected itself in inferring common object of using force to extent of causing death.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Any right of private defence of property which Harphool had against criminal trespass by appellants party ceased when trespass over or trespassers indicated intention to cease.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "If one rioter causes injury for which others liable under s.149 IPC, injury must have been caused in prosecution of common object.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Section 149 IPC"
    },
    {
      "id": "pa3",
      "text": "Assembly ceases to be unlawful after completion of common object; only actual perpetrator liable for later criminal acts.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "High Court misdirected in raising inferences that common object was to force way through fields using force to cause death if necessary.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Criminal trespass had not come to an end; carts still inside Harphool's field near boundary, several yards inside; Harphool had right to prevent continuance of trespass.",
      "addresses_issue": "i1",
      "key_observation": "Appellants had no right to insist on continuing trespass to exit field; had to abide by Harphool's directions."
    },
    {
      "id": "cr2",
      "text": "Three propositions of law do not arise as based on supposition trespass ended and Harphool began attack, contrary to findings.",
      "addresses_issue": "i1",
      "key_observation": "No such finding by High Court."
    },
    {
      "id": "cr3",
      "text": "Common object was to force way through Harphool's field using force to cause death if necessary; death caused in prosecution of that object.",
      "addresses_issue": "i4",
      "key_observation": "Inferred from choice of longer damaging route despite shorter alternative; armed party (lathis and hatchet); prepared for violence against objectors."
    },
    {
      "id": "cr4",
      "text": "Northern route shorter to passage; chose longer route through multiple fields causing damage, foreseeable protests and clashes.",
      "addresses_issue": "i4",
      "key_observation": "Party of several armed persons likely prepared to use violence."
    },
    {
      "id": "cr5",
      "text": "Injuries to Harphool (seven, including two bone-deep head wounds) caused death by shock and haemorrhage; offence of murder under concerted acts.",
      "addresses_issue": "i2",
      "key_observation": "Death in prosecution of common object."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellants formed unlawful assembly with common object of criminal trespass and using force to cause death if necessary; liable under s.302 r/w s.149 IPC for murder of Harphool.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No right of private defence for appellants; Harphool's right of private defence of property subsisted as trespass ongoing.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Contentions on cessation of unlawful assembly do not apply as trespass not complete and attack in prosecution of common object.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "149"
      ],
      "relevance": "Conviction for murder read with common object of unlawful assembly; right of private defence implied."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by special leave, confirming the Allahabad High Court and Sessions Judge's convictions of appellants for offences including murder under s.302 r/w s.149 IPC.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Criminal trespass had number therefore companye to an end and therefore Harphool had the right to prevent the appellants party from companytinuing to companymit criminal trespass.",
      "speaker": "court",
      "significance": "Core reasoning on ongoing trespass and right of defence."
    },
    {
      "text": "It is therefore number unreasonable to companylude that the appellants party was prepared to use force against such an objector to achieve their object of taking the carts to the public pathway by a short-cut.",
      "speaker": "court",
      "significance": "Inference of common object from circumstances."
    },
    {
      "text": "The offence made out on account of the death of Harphool caused by the companycerted acts of the members of the appellants party has been rightly held to be the offence of murder.",
      "speaker": "court",
      "significance": "Confirmation of murder conviction."
    }
  ],
  "_case_id": "1961_404",
  "_label": 0,
  "_text_length": 9030,
  "_extracted_at": "2026-02-10T19:35:17.087872"
}