{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Bombay v. Assessee",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo J.",
      "Gajendragadkar J.",
      "Sarkar J."
    ],
    "case_number": "Civil Appeal No. 240 of 1955",
    "date_of_judgment": "1961-02-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Assessment year concerned was 1948-49, the accounting year being 2003 Sambat.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f2",
      "text": "At the relevant time, Bhavnagar was a ruling State and therefore outside British India (taxable territories).",
      "type": "background",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f3",
      "text": "There was a mill in Bhavnagar (Bhavnagar Mills) where the assessee and his brother Gordhandas had large sums in deposit, being profits earlier earned by them in Bhavnagar. The amounts deposited belonged to the assessee and his brother in equal shares.",
      "type": "background",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f4",
      "text": "The Bhavnagar Mills kept an account of these deposits, showing that on April 7, 1947, a sum of Rs. 50,000 had been paid out to Harkisondas Ratilal and another sum of Rs. 50,000 to Dilipkumar Trikamlal.",
      "type": "material",
      "date": "1947-04-07",
      "source": "tribunal"
    },
    {
      "id": "f5",
      "text": "There was another mill in Bombay (Bombay Mills). The account of the Bombay Mills showed that on April 3, 1947, Rs. 50,000 had been received from each of Harkisondas Ratilal and Dilipkumar Trikamlal.",
      "type": "material",
      "date": "1947-04-03",
      "source": "tribunal"
    },
    {
      "id": "f6",
      "text": "Harkisondas Ratilal and Dilipkumar Trikamlal were benamidars for the assessee and his brother. The entries indicated that the moneys had been withdrawn from the Bhavnagar Mills by the assessee and his brother and advanced to the Bombay Mills.",
      "type": "admitted",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f7",
      "text": "The assessee and his brother were in full control of both the Bhavnagar Mills and the Bombay Mills.",
      "type": "background",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f8",
      "text": "Tribunal concluded there had been a remittance of the assessee's profits from Bhavnagar to Bombay, namely Rs. 50,000 being half of the amounts mentioned, taxable under s. 4(1)(b)(iii).",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "Bombay High Court in Income-tax Reference No. 15 of 1953 dated September 3, 1953, answered the question in the negative: Whether there was any remittance by the petitioner to Bombay within the meaning of and assessable under s. 4(1)(b)(iii). High Court held it was substitution of one debtor for another, not receipt by assessee himself.",
      "type": "procedural",
      "date": "1953-09-03",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Supreme Court on April 24, 1958, referred the case back to Tribunal for further statement on how the cheque was brought from Bhavnagar to Bombay and agreement made.",
      "type": "procedural",
      "date": "1958-04-24",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Further facts by Tribunal: Bhavnagar Mills had account in Bank of India Limited at Bombay branch. Cheque book with assessee who had power to operate it. Assessee drew cheque on April 3, 1947, in Bombay, in favour of self, handed to Bombay Mills in Bombay for credit to Harkisondas Ratilal and Dilipkumar Trikamlal.",
      "type": "material",
      "date": "1947-04-03",
      "source": "tribunal"
    },
    {
      "id": "f12",
      "text": "Bombay Mills presented cheque to another branch of Bank of India in Bombay on same date for deposit. Actual entries in bank books on April 5, 1947.",
      "type": "material",
      "date": "1947-04-05",
      "source": "tribunal"
    },
    {
      "id": "f13",
      "text": "Bombay Mills made entries crediting moneys to Harkisondas Ratilal and Dilipkumar Trikamlal.",
      "type": "material",
      "date": "1947-04-03",
      "source": "tribunal"
    },
    {
      "id": "f14",
      "text": "Assessee instructed Bhavnagar Mills to debit joint account with Rs. 1 lac as paid to Harkisondas Ratilal and Dilipkumar Trikamlal. Entry made on April 7, 1947.",
      "type": "material",
      "date": "1947-04-07",
      "source": "tribunal"
    },
    {
      "id": "f15",
      "text": "Nothing done at Bhavnagar. Assessee utilised moneys from Bhavnagar Mills for advance to Bombay Mills as Bombay Mills needed moneys.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f16",
      "text": "Assessee was resident of Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts found by the Tribunal, there was any remittance by the assessee to Bombay within the meaning of and assessable under s. 4(1)(b)(iii) of the Income-tax Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the receipt in s. 4(1)(b)(iii) must be the first receipt, similar to s. 4(1)(a).",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the income was brought into or received in the taxable territories by the assessee.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Even on High Court's basis of substitution of debtor, money was received by assessee in Bombay when Bombay Mills credited the amount, as assessee advanced moneys to them creating debt.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "s. 4(1)(b)(iii)"
    },
    {
      "id": "pa2",
      "text": "Receipt by cheque credited to assessee amounts to receipt by assessee himself.",
      "supporting_facts": [
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No evidence agreement for advance made at Bhavnagar; cheque/money might have been delivered at Bhavnagar to Bombay Mills' agent; notional receipt and advance at Bhavnagar, then Bombay Mills' own money brought to Bombay.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "s. 4(1)(b)(iii)"
    },
    {
      "id": "ra2",
      "text": "Income already received in Bhavnagar; cannot be received again in Bombay; receipt must be first receipt.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Keshav Mills Ltd. v. CIT; s. 4(1)(b)(iii)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Scheme of s.4(1): cl.(a) covers receipt in taxable territories in previous year (first receipt); cl.(b)(iii) for resident, covers income accrued outside before previous year, brought or received in previous year; receipt in (b)(iii) need not be first receipt as income already received outside.",
      "addresses_issue": "i2",
      "key_observation": "Words 'received' derive colour from context; (b)(iii) implicit that income accrued and received outside earlier."
    },
    {
      "id": "cr2",
      "text": "On facts, assessee drew cheque in Bombay on Bhavnagar Mills' Bombay bank account, handed to Bombay Mills, credited to benamidars; clear receipt in Bombay of income accrued outside earlier.",
      "addresses_issue": "i1",
      "key_observation": "Indirect method (cheque to benamidars) still receipt by assessee himself."
    },
    {
      "id": "cr3",
      "text": "Distinguished High Court: unnecessary to decide if 'brought by him' requires physical bringing, as this is case of receipt.",
      "addresses_issue": "i3",
      "key_observation": "Reference to Bipin Lal Kuthiala: indirect method like directing debtor to pay another is receipt."
    },
    {
      "id": "cr4",
      "text": "Sarkar J.: Income received in Bhavnagar, not again in Bombay; but brought into Bombay by discharging debt via cheque, acquiring new debt from Bombay Mills.",
      "addresses_issue": "i1",
      "key_observation": "Bringing income includes changing shape to debt and discharging it in taxable territories."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Income under s.4(1)(b)(iii) taxable if accrued/arisen outside before previous year, received outside, and brought/received in taxable territories in previous year by resident; receipt need not be first receipt.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "On facts, Rs.50,000 received in Bombay by assessee; taxable under s.4(1)(b)(iii).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Keshav Mills Ltd. v. Commissioner of Income-tax",
      "citation": "1953 S.C.R. 950",
      "treatment": "distinguished",
      "relevance": "Receipt under s.4(1)(a) is first receipt; does not apply to (b)(iii)."
    },
    {
      "case_name": "Bipin Lal Kuthiala v. Commissioner of Income-tax, Punjab",
      "citation": "A.I.R. 1956 S.C. 634",
      "treatment": "followed",
      "relevance": "Indirect method of directing debtor outside to pay creditor inside is receipt inside."
    },
    {
      "case_name": "Board of Revenue v. Ripon Press",
      "citation": "1923 I.L.R. 46 Mad. 706",
      "treatment": "referred",
      "relevance": "Cannot receive same income twice, once outside and once inside."
    },
    {
      "case_name": "Sundar Das v. Collector of Gujrat",
      "citation": "1922 I.L.R. 3 Lah. 349",
      "treatment": "referred",
      "relevance": "Income under control cannot be received again."
    },
    {
      "case_name": "Gresham Life Assurance Society Ltd. v. Bishop",
      "citation": "1902 A.C. 287",
      "treatment": "referred",
      "relevance": "Income may be in forms representing money."
    },
    {
      "case_name": "Tennant v. Smith",
      "citation": "1892 A.C. 150",
      "treatment": "referred",
      "relevance": "Income may be conceived in other forms."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "s. 3",
        "s. 4(1)(a)",
        "s. 4(1)(b)(iii)",
        "s. 60(2)"
      ],
      "relevance": "Defines total income including income brought into or received in taxable territories under s.4(1)(b)(iii) for residents."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, High Court judgment set aside. Question answered in affirmative: remittance taxable under s.4(1)(b)(iii). Appellant gets costs of appeal and in High Court.",
    "relief_granted": "Assessment upheld; income of Rs.50,000 included in total income.",
    "costs": "Appellant gets costs of this appeal and in the court below."
  },
  "key_quotes": [
    {
      "text": "\"the receiving in the taxable territories need not be the first receipt.\"",
      "speaker": "court",
      "significance": "Key holding distinguishing s.4(1)(b)(iii) from s.4(1)(a)."
    },
    {
      "text": "\"There was thus clearly receipt in the previous year of income etc. which had accrued to the respondent outside the taxable territories before the previous year.\"",
      "speaker": "court",
      "significance": "Applies facts to section, finding receipt by assessee."
    },
    {
      "text": "\"you cannot receive the same sum of money qua income twice over, once outside British India and once inside it.\"",
      "speaker": "court",
      "significance": "Cites inherent nature of receipt, but distinguishes for (b)(iii)."
    }
  ],
  "_case_id": "1961_283",
  "_label": 1,
  "_text_length": 29875,
  "_extracted_at": "2026-02-10T19:34:11.908177"
}