{
  "metadata": {
    "case_name": "Andalammal v. M. Raghava Mudaliar",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 204/1956",
    "date_of_judgment": "1961-01-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Madhava Ramanuja Mudaliar died on March 22, 1893, issueless, survived by widow Manickammal, widowed mother Rengammal, sister Andalammal, respondent and his sister Apurupammal (children of second sister Ammakannu Ammal), and Ethirajammal (daughter of third sister).",
      "type": "background",
      "date": "1893-03-22",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "After death, property came into possession of widow Manickammal, who obtained letters of administration from Madras High Court.",
      "type": "material",
      "date": "1893-04-26",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Relations between widow Manickammal and mother-in-law Rengammal embittered, leading to disputes settled by arbitrators; settlement recorded in writing on May 27, 1893 (Ex. D-2).",
      "type": "material",
      "date": "1893-05-27",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Settlement (Ex. D-2) terms: Item No. 1 house divided between respondent/Apurupammal (one share), Ethirajammal (one share), Andalammal (one share); Serial No. 2 and 3 houses/shops to be sold, proceeds to discharge debts of deceased and father, deduct administration/sale expenses, balance divided equally between widows (subject to Rs. 1,000/- to mother-in-law); Serial No. 4 lands to maternal uncle; Serial No. 5 moveables divided half-half. Clause: Breach does not cancel agreement or affect prior title.",
      "type": "material",
      "date": "1893-05-27",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Krishnasamy Mudaliar (defendant 3) objected to settlement, but abandoned objections; executed sale deed conveying reversionary rights to widows on September 10, 1894 (Ex. D-3), recognizing absolute title.",
      "type": "material",
      "date": "1894-09-10",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Widows enjoyed properties as agreed.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On February 4, 1895, widows sold item No. 1 Schedule II (Nos. 126 and 127, Anna Pillai Street and Audiappa Naick Street) to Thatha Venkata Raghava Subbu Chetty; appellant is successor in title.",
      "type": "material",
      "date": "1895-02-04",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Composite deed of partition and administration executed by widows on May 27, 1895 (Ex. D-5): Delivered house blocks to donees, lands to uncle, discharged debts, met administration expenses.",
      "type": "material",
      "date": "1895-05-27",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Manickammal died October 18, 1941; Rengammal died June 1921; reversion fell open on Manickammal's death.",
      "type": "procedural",
      "date": "1941-10-18",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Respondent filed Suit No. 56 of 1946 in Madras High Court Original Side claiming alienations not binding, entitled to possession free of encumbrance; schedule had four items, appeal concerns item No. 1.",
      "type": "procedural",
      "date": "1946",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Trial court (Mr. Justice Kunhiraman) held family arrangement binding, respondent received benefit, precluded from challenging; dismissed suit.",
      "type": "procedural",
      "date": "1951-02-23",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court in O.S. Appeal No. 13/1948 allowed respondent's appeal: Not bona fide family settlement; no surrender, no ratification, no legal necessity; decreed possession, mesne profits to Official Referee.",
      "type": "procedural",
      "date": "1951-02-23",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Respondent minor in 1893, not party to transactions.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Respondent obtained patta/certificate from Collector for property under Ex. D-5; filed in Suit No. 495/1916, not produced.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f15",
      "text": "In Civil Suit No. 495/1916 (Apurupammal v. respondent), respondent admitted compromise settlement during widow's life tenancy (Ex. D-15, P-3).",
      "type": "material",
      "date": "1916",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "In Civil Suit No. 1117/1921 (Masilamani Mudaly v. others), respondent as defendant 7 supported challenge to arrangement; suit dismissed for want of prosecution (Ex. P-16).",
      "type": "material",
      "date": "1921",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Respondent's oral evidence: Grandmother gave house with patta saying she was dying; in possession/enjoyment; unaware of 1895 document until 1916, division in 1910; quarrels between widows.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "Earlier arrangement February 7, 1887 between Govinda Mudaliar and Madhava Ramanuja Mudaliar (Ex. D-1).",
      "type": "background",
      "date": "1887-02-07",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Letters of administration imposed limitation on dealing with property without sanction.",
      "type": "material",
      "date": "1893-04-26",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Ex. D-5 consideration: Total ~Rs. 10,000; Rs. 776 debts; Rs. 558 document expenses; Rs. 409 funeral expenses; others not legal necessity.",
      "type": "material",
      "date": "1895-05-27",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether respondent ratified the 1893 arrangement and subsequent transactions by conduct, receiving benefits with full knowledge, precluding challenge as reversioner.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether transactions justified by legal necessity.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether arrangement was a valid family arrangement binding on reversioner.",
      "framed_by": "appellant"
    },
    {
      "id": "i4",
      "text": "Whether plea of surrender sustainable.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Agreement Ex. D-2 and composite deed Ex. D-5 were family arrangement binding on respondent; respondent received benefit and ratified by conduct.",
      "supporting_facts": [
        "f4",
        "f8",
        "f13",
        "f14",
        "f15",
        "f16",
        "f17"
      ],
      "legal_basis": "Family arrangement under Hindu Law"
    },
    {
      "id": "pa2",
      "text": "Transfer to predecessor supported by legal necessity.",
      "supporting_facts": [
        "f7",
        "f20"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Plea of surrender.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Respondent ratified per Sahu Madho Das v. Pandit Mukand Ram: Assent with knowledge precludes challenge.",
      "supporting_facts": [
        "f14",
        "f15",
        "f17"
      ],
      "legal_basis": "Sahu Madho Das v. Pandit Mukand Ram (1955) 2 SCR 22"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Alienations by widows without legal necessity, not binding on reversioner; entitled to possession on reversion opening.",
      "supporting_facts": [
        "f1",
        "f2",
        "f9",
        "f10"
      ],
      "legal_basis": "Hindu Law - widow's alienations voidable by reversioner"
    },
    {
      "id": "ra2",
      "text": "Not family arrangement; minor, not party; no ratification as benefits during widow's life, no full knowledge of rights.",
      "supporting_facts": [
        "f13",
        "f15",
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "No legal necessity; letters of administration limited dealings; Ex. D-5 gives effect to invalid Ex. D-2.",
      "supporting_facts": [
        "f19",
        "f20"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Transaction not family arrangement; conceded; Ex. D-3 mere spes successionis sale; Ex. D-5 carries out invalid arrangement; respondent minor, not party.",
      "addresses_issue": "i3",
      "key_observation": "Original transaction not family arrangement under Hindu Law."
    },
    {
      "id": "cr2",
      "text": "No ratification: Patta routine post-registration; Suit 495/1916 admission limited to widow's life; Suit 1117/1921 support but no duty to prosecute; oral evidence credible, no knowledge of rights pre-1929 Act II; benefit possibly under 1887 arrangement.",
      "addresses_issue": "i1",
      "key_observation": "Mere receipt of benefit does not preclude; requires assent to arrangement itself with knowledge."
    },
    {
      "id": "cr3",
      "text": "No legal necessity: Most consideration not debts (funeral, document expenses); no sanction under letters of administration; to avoid sanction.",
      "addresses_issue": "i2",
      "key_observation": "Only Rs. 776 debts; rest not legal necessity."
    },
    {
      "id": "cr4",
      "text": "Plea of surrender conceded unsustainable.",
      "addresses_issue": "i4",
      "key_observation": "Not sustainable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Presumptive reversioner not precluded merely by receiving benefit; requires ratification with full knowledge assenting to arrangement itself.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Impugned transactions not justified by legal necessity.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Not family arrangement binding on reversioner.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sahu Madho Das v. Pandit Mukand Ram",
      "citation": "1955 2 SCR 22",
      "treatment": "followed",
      "relevance": "Ratification/estoppel requires assent to arrangement itself with knowledge; mere gift acceptance by minors not ratification."
    },
    {
      "case_name": "Dhiyan Singh v. Jugal Kishore",
      "citation": "1952 SCR 478",
      "treatment": "followed",
      "relevance": "Estoppel where party settles own claim as reversioner."
    },
    {
      "case_name": "Kanhai Lal v. Brij Lal",
      "citation": "1919 LR 45 IA 118",
      "treatment": "referred",
      "relevance": "Estoppel where reversioner settles claim based on title."
    },
    {
      "case_name": "Rangaswami Gounden v. Nachiappa Gounden",
      "citation": "1918 LR 46 IA 72",
      "treatment": "followed",
      "relevance": "Reversioner not precluded by mortgage including alienated property; can wait till reversion opens; mere benefit no bar."
    },
    {
      "case_name": "Ramgouda Annagouda v. Bhausaheb",
      "citation": "1927 LR 54 IA 396",
      "treatment": "followed",
      "relevance": "Reversioners parties to connected transactions precluded."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hindu Law of Inheritance (Amendment) Act, 1929",
      "sections": [
        "Act II of 1929"
      ],
      "relevance": "Elevated sister's sons like respondent in reversioner succession."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed appellant's appeal, upheld High Court decree allowing respondent's suit for possession of item No. 1 Schedule II, as alienations not binding, no ratification, no legal necessity; suit to proceed for mesne profits.",
    "relief_granted": "Possession to respondent; mesne profits ascertainment.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"it is settled law that an alienation by a widow in exercise of her powers is not altogether void but only voidable by the reversioners who may either singly or as a body be precluded from exercising their right to avoid it either by express ratification or by acts which treat it as valid or binding.\"",
      "speaker": "court",
      "significance": "Principle on voidable alienations and preclusion by ratification."
    },
    {
      "text": "\"mere receipt of benefit under an arrangement by which a Hindu widow alienates the property of her deceased husband would not preclude a presumptive reversioner from disputing the validity of the said alienation when he becomes the actual reversioner.\"",
      "speaker": "court",
      "significance": "Limits doctrine of ratification to full knowledge and assent."
    },
    {
      "text": "\"to hold that by doing so he barred himself from asserting his own title to a part of what was mortgaged seems to their Lordships a quite unwarrantable proposition.\"",
      "speaker": "court",
      "significance": "From Rangaswami; mere benefit no bar (adopted by court)."
    }
  ],
  "_case_id": "1961_100",
  "_label": 0,
  "_text_length": 30271,
  "_extracted_at": "2026-02-10T19:30:36.053463"
}