{
  "metadata": {
    "case_name": "Union of India v. Maharaja Krishnagarh Mills Ltd.",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "SINHA, C.J."
    ],
    "case_number": "Civil Appeal No. 252 of 1956",
    "date_of_judgment": "1961-01-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is a cloth mill located in Krishnagarh in District Jaipur in the State of Rajasthan.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent had a stock of manufactured cloth on April 1, 1949, and also manufactured cloth during the period April 1, 1949 to March 31, 1950.",
      "type": "admitted",
      "date": "1949-04-01 to 1950-03-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In respect of such cloth an excise duty became payable under the Rajasthan Excise Duties Ordinance, 1949 (XXV of 1949), at rates set forth in the schedule to the Ordinance.",
      "type": "admitted",
      "date": "1949-04-01 to 1950-03-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The sum of Rs. 1,56,291 odd became payable on that account out of which only a sum of Rs. 19,739 odd was paid to the Government of Rajasthan, thus leaving the sum of Rs. 1,36,551 odd outstanding against the respondent.",
      "type": "admitted",
      "date": "1949-04-01 to 1950-03-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After the Indian Constitution came into effect on January 26, 1950, the Central Excise and Salt Act, 1944, and the rules framed thereunder were extended to the State of Rajasthan by s. 11 of the Finance Act of 1950, effective from April 1, 1950.",
      "type": "background",
      "date": "1950-01-26",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant claimed that as a result of the agreement between the Government of India and the State of Rajasthan dated February 25, 1950, and of the Constitution, the Union of India became entitled to realise the arrears of the excise duty in respect of the cloth manufactured by the respondent before April 1, 1950.",
      "type": "disputed",
      "date": "1950-02-25",
      "source": "appellant"
    },
    {
      "id": "f7",
      "text": "In enforcement of that claim the Superintendent of Central Excise, Jaipur, served a notice dated February 16, 1951, on the respondent demanding payment of the outstanding amount of Rs. 1,36,551 odd.",
      "type": "procedural",
      "date": "1951-02-16",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The respondent filed a writ petition in the High Court of Rajasthan, Jaipur, under Art. 226 of the Constitution against the Union of India, Central Board of Revenue, Collector of Central Excise for Rajasthan, and Superintendent of Central Excise, Jaipur.",
      "type": "procedural",
      "date": "1951",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The writ petition prayed for a writ of prohibition prohibiting the appellants from imposing, levying or collecting any tax or duty by way of excise.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Division Bench of High Court (Ranawat and Sharma, JJ.) referred two questions to Full Bench on November 5, 1951.",
      "type": "procedural",
      "date": "1951-11-05",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Full Bench (Wanchoo, C.J., Ranawat and Dave, JJ.) delivered judgment on November 24, 1952, upholding contentions of the petitioner (respondent here).",
      "type": "procedural",
      "date": "1952-11-24",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court by judgment dated September 29, 1953, issued direction against opposite party not to recover Rs. 1,36,551-12 and awarded costs to petitioner.",
      "type": "procedural",
      "date": "1953-09-29",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court granted certificate for appeal to Supreme Court under Arts. 132(1) and 133(1)(c).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Rajasthan Excise Duties Ordinance, XXV of 1949, promulgated by Rajpramukh on September 5, 1949.",
      "type": "background",
      "date": "1949-09-05",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Notification dated September 15, 1949, published in Rajasthan Raj Patra (Hindi Gazette) dated Margashirsa Krishna 7, Saturday, Samvat 2006, containing Ordinance and Rules adopting Jaipur Excise Duty Rules of 1945.",
      "type": "background",
      "date": "1949-09-15",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Agreement between President of India and Rajpramukh of Rajasthan on February 25, 1950, accepting recommendations of Indian States Finance Enquiry Committee, 1948-49.",
      "type": "background",
      "date": "1950-02-25",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether by virtue of Articles 278, 294 and 295 of the Constitution of India and the agreement entered into between the President of India and the Rajpramukh of Rajasthan on the 25th of February, 1950, the Union of India is entitled to levy and recover arrears of excise duty on cloth held in stock or manufactured before the 1st of April, 1950, in case excise duty thereon was payable to the State of Rajasthan under the provisions of the Rajasthan Excise Duties Ordinance No. 25 of 1949?",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Whether the publication of the Government notification by which the Jaipur Excise Rules were adopted under the provisions of the Rajasthan Excise Ordinance was sufficient publication within the meaning of s. 28 of the Rajasthan Excise Duties Ordinance No. 25 of 1949, and whether the publication of the aforesaid notification should be deemed to have been properly authenticated by authentication of the publication of the Ordinance. If not, whether want of authentication would have the effect of invalidating the said Excise Rules?",
      "framed_by": "lower_court"
    },
    {
      "id": "i3",
      "text": "Whether the Union of India was entitled to levy and recover arrears of excise duty on cotton cloth for the period April 1, 1949, to March 31, 1950, from the respondent, considering Arts. 277, 278, 294 and 295 of the Constitution and the agreement.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The rules framed under s. 37 of the Central Excise and Salt Act, 1944, became applicable to the State of Rajasthan with effect from April 1, 1950, as a result of s. 11 of the Finance Act, 1950.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Central Excise and Salt Act, 1944 s.37; Finance Act, 1950 s.11"
    },
    {
      "id": "pa2",
      "text": "By virtue of s. 3 of Rajasthan Excise Duties Ordinance XXV of 1949, excise duty was levied on cloth produced and manufactured in Rajasthan on and after April 1, 1949.",
      "supporting_facts": [
        "f3",
        "f14"
      ],
      "legal_basis": "Rajasthan Excise Duties Ordinance, 1949 s.3"
    },
    {
      "id": "pa3",
      "text": "In pursuance of Arts. 278 and 295 of the Constitution, the President entered into agreement with Rajpramukh on February 25, 1950, accepting recommendations of Indian States Finance Enquiry Committee, whereby Union became entitled to claim and recover all excise duties, assessed or unassessed, which Rajasthan was entitled to recover from April 1, 1949.",
      "supporting_facts": [
        "f6",
        "f16"
      ],
      "legal_basis": "Constitution Arts. 278, 295; Agreement dated 1950-02-25"
    },
    {
      "id": "pa4",
      "text": "The authentication in the Gazette covered both the Ordinance and the Rules.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Rajasthan Excise Duties Ordinance, 1949 s.28"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Central Government had no jurisdiction to levy any tax before January 26, 1950; Central Excise and Salt Act was not in force in Rajasthan before April 1, 1950; without application of rules under s.37 of Central Excise Act to Rajasthan (only on December 16, 1950), no duty could be imposed.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Central Excise and Salt Act, 1944"
    },
    {
      "id": "ra2",
      "text": "Art. 277 provides a complete answer to the claim of Union to collect dues anterior to April 1, 1950; agreement overridden by Art. 277; agreement contemplates duty leviable by Government of India.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Constitution Art. 277"
    },
    {
      "id": "ra3",
      "text": "The Hindi Gazette did not contain authentication of the Rules; publication not properly authenticated under s.28.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Rajasthan Excise Duties Ordinance, 1949 s.28"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The authentication by the Law Secretary in the Gazette was intended to govern not only the Ordinance but also the Rules; formal requirements of s.28 satisfied as authentication covers entire notification.",
      "addresses_issue": "i2",
      "key_observation": "Whether authentication appears at beginning or end is not material if it substantially covers the matter."
    },
    {
      "id": "cr2",
      "text": "Since Ordinance and Rules properly promulgated, Rajasthan Government entitled to levy and collect duty; respondent paid part thereof.",
      "addresses_issue": "i2",
      "key_observation": "Rs. 19,739 paid confirms levy validity."
    },
    {
      "id": "cr3",
      "text": "Agreement dated Feb 25, 1950, incorporates Committee report taking over federal revenues including excise duties and arrears from prescribed date; Art. 278(1)(a) allows agreement overriding other provisions including Art. 277.",
      "addresses_issue": "i1",
      "key_observation": "Art. 278 overrides pro tanto Art. 277; agreement displaces Art. 277 operation."
    },
    {
      "id": "cr4",
      "text": "Cotton excise duty leviable only by Union (Entry 84 Union List); Art. 277 saving provision yields to Art. 278 and agreement.",
      "addresses_issue": "i3",
      "key_observation": "Agreement cedes right to levy and collect arrears to Centre."
    },
    {
      "id": "cr5",
      "text": "High Court erred in holding Art. 277 overrides Art. 278; agreement read with report covers cotton excise as federal revenue.",
      "addresses_issue": "i1",
      "key_observation": "No specific mention needed; incorporated by reference."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rules under Rajasthan Excise Duties Ordinance, 1949 properly published and authenticated under s.28.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Union of India entitled to levy and recover arrears of excise duty for period April 1, 1949 to March 31, 1950 via agreement and Arts. 278, 295 overriding Art. 277.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 132(1)",
        "Art. 133(1)(c)",
        "Art. 226",
        "Art. 277",
        "Art. 278",
        "Art. 294",
        "Art. 295"
      ],
      "relevance": "Art. 278 enables agreement overriding Art. 277 for levy/collection of Union duties in Part B States; transfers arrears to Union."
    },
    {
      "name": "Rajasthan Excise Duties Ordinance, 1949 (XXV of 1949)",
      "sections": [
        "s.3",
        "s.5",
        "s.26",
        "s.28"
      ],
      "relevance": "Levied excise on cloth from April 1, 1949; s.28 requires publication/authentication of rules in Gazette; Jaipur Rules adopted."
    },
    {
      "name": "Central Excise and Salt Act, 1944",
      "sections": [
        "s.37"
      ],
      "relevance": "Extended to Rajasthan from April 1, 1950; rules thereunder applicable from that date."
    },
    {
      "name": "Finance Act, 1950",
      "sections": [
        "s.11"
      ],
      "relevance": "Extended Central Excise Act to Rajasthan from April 1, 1950."
    },
    {
      "name": "Jaipur Excise Duties Act of 1945",
      "sections": [],
      "relevance": "Jaipur Excise Duty Rules of 1945 adopted for Rajasthan."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment of Rajasthan High Court dated September 29, 1953 set aside; Union of India entitled to recover arrears of Rs. 1,36,551 odd excise duty.",
    "relief_granted": "Right to recover arrears affirmed; writ of prohibition quashed implicitly.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Article 278, therefore, is in the nature of a saving provision permitting the States to levy a tax or a duty which, after the Constitution, could be levied only by the Centre. But Art. 277 must yield to any agreement made between the Government of India and the Government of a State in Part B\"",
      "speaker": "court",
      "significance": "Core reasoning on Art. 278 overriding Art. 277"
    },
    {
      "text": "\"The agreement read with Art. 278, as already indicated, in terms, overrides the provisions of Art. 277.\"",
      "speaker": "court",
      "significance": "Direct holding on constitutional interplay"
    },
    {
      "text": "\"With effect from the prescribed date, the Centre will take over all federal sources of Revenue ... and all current outstandings including ... arrears\"",
      "speaker": "court",
      "significance": "Key excerpt from incorporated Committee report via agreement"
    }
  ],
  "_case_id": "1961_280",
  "_label": 1,
  "_text_length": 23423,
  "_extracted_at": "2026-02-10T19:34:08.223521"
}