{
  "metadata": {
    "case_name": "Kirloskar Oil Engines Ltd. v. Workmen",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 587 of 1960",
    "date_of_judgment": "1961-11-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Certain disputes pending between the appellant (Kirloskar Oil Engines Ltd., Kirkee, Poona) and the respondents (its workmen) were referred to the Industrial Tribunal by the Government of Maharashtra.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The disputes related to seven demands made by the respondents, two of which were in regard to privilege leave and allowances.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Tribunal made its award in two parts; Part I dealing with privilege leave and different kinds of allowances was made on June 30, 1958, and published on July 7, 1958.",
      "type": "procedural",
      "date": "1958-06-30",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On August 2, 1958, the appellant applied to the State Government for reference of certain points to the Tribunal for clarification under s. 36A of the Industrial Disputes Act, 1947.",
      "type": "procedural",
      "date": "1958-08-02",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "An order of reference was made in respect of the two items: privilege leave and allowances.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Tribunal clarified its direction on privilege leave by adding that every workman must put in 240 days or more of actual working during the previous calendar year to be entitled, aligning with s. 79 of the Factories Act, 1948.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Paragraph 10 of the original award directed: 'All the workmen, both daily and monthly rated, get privilege leave according to the provisions of the Factories Act. ... I therefore direct that all the workmen of the Kirloskar Oil Engines Ltd., Poona, shall be granted 15 days privilege leave including privilege leave under the Factories Act which will be allowed to be accumulated up to 45 days.'",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The appellant apprehended that the direction might justify 15 days privilege leave irrespective of actual attendance, even if absent 360 days but name on muster roll.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Paragraph 14 of the original award directed: 'if a workman has to work on a weekly off or on a holiday paid or unpaid he should be paid 1 1/2 times his wages and dearness allowance over and above substituted holiday.'",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The Tribunal held that the direction in paragraph 14 needed no clarification as the appellant was seeking modification, which could not be done under s. 36A.",
      "type": "procedural",
      "date": "1958-12-16",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The clarification award was submitted to the Government; appellant appealed by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "In 1956 and 1957, due to shortage of electrical energy, State Government compelled factories to change weekly holidays from Sunday to another weekday.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "This argument about changed weekly holidays was not raised before the Tribunal in the original proceedings.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Under s. 2(f) and s. 52 of Factories Act, appellant could have declared another day as first day of the week.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the proceedings under s. 36A of the Industrial Disputes Act, 1947 permit clarification that amounts to modification of the award, or are limited to interpretation of ambiguous provisions.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Tribunal was justified in refusing clarification on the payment direction in paragraph 14 regarding work on weekly off or holiday.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The words in paragraph 10 on privilege leave were wide enough to allow claim even without 240 days attendance; sought clarification requiring 240 days actual work per s. 79 Factories Act.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "s. 79 Factories Act, 1948"
    },
    {
      "id": "pa2",
      "text": "Direction in paragraph 14 on 1 1/2 times payment plus substituted holiday for work on weekly off/holiday imposes heavy burden, especially when whole factory works due to changed holidays in 1956-57; no deprivation of company of colleagues.",
      "supporting_facts": [
        "f9",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Accumulation of privilege leave up to 45 days not justified.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s. 36A empowers reference only for difficulties or doubts as to interpretation of award provisions; Tribunal decides after hearing parties, decision final. Scope limited to interpretation, not propriety, correctness or validity of provisions.",
      "addresses_issue": "i1",
      "key_observation": "Enquiry under s. 36A limited to interpretation; grievances on merits via Art. 136 appeal."
    },
    {
      "id": "cr2",
      "text": "Privilege leave clarification granted as it resolved ambiguity aligning with s. 79 Factories Act.",
      "addresses_issue": "i1",
      "key_observation": "Not intended to depart from s. 79 principle."
    },
    {
      "id": "cr3",
      "text": "No new plea on accumulation propriety entertainable; not raised before Tribunal, outside s. 36A scope.",
      "addresses_issue": "i1",
      "key_observation": "Cannot raise merits in clarification proceedings."
    },
    {
      "id": "cr4",
      "text": "Paragraph 14 clear and unambiguous; appellant seeks modification based on changed holidays (not raised originally), not interpretation. Tribunal right to refuse.",
      "addresses_issue": "i2",
      "key_observation": "s. 36A not for review/modification; could have declared alternate weekly off day under Factories Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Proceedings under s. 36A limited to resolving difficulties/doubts on interpretation of award provisions; cannot address merits, propriety or modification.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Tribunal justified in clarifying privilege leave per s. 79 but refusing clarification on paragraph 14 as it was clear and appellant sought modification.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 36A"
      ],
      "relevance": "Limits clarification proceedings to interpretation of award provisions only, not modification or merits."
    },
    {
      "name": "Factories Act, 1948",
      "sections": [
        "s. 79",
        "s. 52",
        "s. 2(f)"
      ],
      "relevance": "s. 79 basis for privilege leave entitlement after 240 days work; s. 52 and s. 2(f) allow declaring alternate weekly off day."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The Supreme Court upheld the Tribunal's clarification award, confirming that under s. 36A, only interpretive clarifications are permitted, not modifications. Privilege leave was clarified to require 240 days attendance; refusal on allowances upheld as provision clear.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The scope of the enquiry under s. 36A is limited to the decision of the difficulties or doubts arising as to the interpretation of any provision in the award.",
      "speaker": "court",
      "significance": "Defines precise limits of s. 36A proceedings."
    },
    {
      "text": "A proceeding contemplated by s. 36A is not a proceeding intended to enable the tribunal to review or modify its own order it is intended to enable the tribunal only to clarify the provisions of its award.",
      "speaker": "court",
      "significance": "Distinguishes clarification from review/modification."
    }
  ],
  "_case_id": "1961_340",
  "_label": 0,
  "_text_length": 12404,
  "_extracted_at": "2026-02-10T19:34:41.844595"
}