{
  "metadata": {
    "case_name": "Durgah Committee, Ajmer v. Municipal Committee, Ajmer & Anr.",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Criminal Appeal No. 162 of 1959",
    "date_of_judgment": "1961-04-24"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On June 13, 1950, the Municipal Committee, Ajmer (respondent 2), issued a notice against the appellant, Durgah Committee, Ajmer, under s. 153 of the Ajmer-Merwara Municipalities Regulation, 1925, calling upon it to carry out repairs in the Jhalra Wall which was in a dilapidated condition.",
      "type": "background",
      "date": "1950-06-13",
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "The appellant did not comply with the said requisition.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent 2 served another notice on the appellant under s. 220 of the Regulation on July 3, 1950, intimating that the required repairs would be carried out at the expense of respondent 2 and the cost incurred by it would be recovered from the appellant.",
      "type": "procedural",
      "date": "1950-07-03",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "The appellant took no steps to make the repairs and respondent 2 proceeded to get the repair work done at its expense which amounted to Rs. 17,414.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Under s. 222(4) of the Regulation this sum became recoverable from the appellant as a tax. A notice of demand in that behalf was issued on the appellant on April 1, 1952.",
      "type": "procedural",
      "date": "1952-04-01",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "In pursuance of the said notice respondent 2 applied to the Additional Tehsildar and Magistrate II Class, Ajmer, for the recovery of the said amount under s. 234 of the Regulation.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "In the proceedings before the learned Magistrate the appellant raised certain pleas. These pleas were rejected and an order was passed calling upon the appellant to pay the dues in question by August 30, 1956.",
      "type": "procedural",
      "date": "1956-08-30",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Against this order the appellant preferred a criminal revision application in the Court of the Sessions Judge, Ajmer. The learned Sessions Judge considered the contentions raised by the appellant and held that the view taken by the Magistrate cannot be said to be incorrect and so there was no ground to interfere in revision.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Feeling aggrieved by the dismissal of its revision application the appellant moved the High Court of Judicature for Rajasthan in its revisional jurisdiction (D. B. Criminal Revision No. 47 of 1957). Before the High Court, on behalf of respondent 1, the State of Rajasthan, as well as respondent 2, a preliminary objection was raised that the criminal revision application filed by the appellant was incompetent since the Magistrate who entertained respondent 2's application made under s. 234 was not an inferior criminal court under s. 439 of the Code of Criminal Procedure. This preliminary objection was upheld by the High Court and the criminal revision application dismissed on that ground on January 13, 1959.",
      "type": "procedural",
      "date": "1959-01-13",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The appellant came to this Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Magistrate who entertained the application made before him by respondent 2 under s. 234 was an inferior criminal court under s. 439 of the Code of Criminal Procedure.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether proceedings under s. 234 of the Regulation provide the only opportunity to challenge the validity of the notice under s. 153 or the claim under s. 222.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether an appeal lies under s. 93(1) against the demand made under s. 222(4).",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether the proceedings under s. 234 were incompetent because no demand had been made in the manner prescribed by rule.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "In determining the nature of the proceedings under s. 234 and the character of the Magistrate who entertains an application made under the said section, it is important to bear in mind that a person in the position of the appellant has no other opportunity to challenge the validity of the notice as well as the validity of the claim made against him by the Committee. The proceedings should be deemed to be judicial proceedings and the Magistrate should be held to be an inferior criminal court.",
      "supporting_facts": [
        "f1",
        "f3",
        "f5",
        "f6"
      ],
      "legal_basis": "s. 234 of the Ajmer-Merwara Municipalities Regulation, 1925; s. 439 CrPC"
    },
    {
      "id": "pa2",
      "text": "The proceedings under s. 234 taken against the appellant by respondent 2 were incompetent because a demand has not been made by respondent 2 on the appellant in the manner prescribed by rule as required by s. 234, since rules have not been framed under the Regulation.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "s. 234 of the Regulation"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Preliminary objection that the criminal revision application filed by the appellant was incompetent since the Magistrate who entertained respondent 2's application made under s. 234 was not an inferior criminal court under s. 439 of the Code of Criminal Procedure.",
      "supporting_facts": [
        "f6",
        "f7",
        "f9"
      ],
      "legal_basis": "s. 439 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Explained the scheme of the material provisions of the Regulation: s. 153 empowers Municipality to order repairs; s. 220 allows repairs after notice if non-compliance; s. 222 allows recovery of cost, and under sub-s. (4) recoverable as tax; s. 234 provides for recovery on application to Magistrate by distress and sale.",
      "addresses_issue": "i1",
      "key_observation": "Object of s. 234 is to obtain order for recovery by distress and sale of movable property."
    },
    {
      "id": "cr2",
      "text": "Rejected appellant's main argument: assumption incorrect because appeal lies under s. 93(1) against levy as tax per fiction in s. 222(4); s. 226 confirms appealability of orders under s. 222.",
      "addresses_issue": "i2",
      "key_observation": "Full effect to legal fiction in s. 222(4): recovery as tax under s. 234 available, and appeal under s. 93(1) available."
    },
    {
      "id": "cr3",
      "text": "Proceedings under s. 234 are no more than recovery proceedings; questions on validity of notice/claim to be raised in appeal under s. 93(1); enquiry under s. 234 limited, ministerial rather than judicial; Magistrate is persona designata, not inferior criminal court.",
      "addresses_issue": "i1",
      "key_observation": "Claim is for recovery of tax by distress and sale; proceeding civil nature, not criminal."
    },
    {
      "id": "cr4",
      "text": "On merits, rejected no-demand argument: absence of rules does not make statutory power under s. 222(1) unenforceable; demand notice served entitled respondent 2 to recover.",
      "addresses_issue": "i4",
      "key_observation": "No form prescribed does not mean no demand possible."
    },
    {
      "id": "cr5",
      "text": "Referred to various High Court decisions illustrating that Magistrates in similar recovery proceedings are not inferior criminal courts.",
      "addresses_issue": "i1",
      "key_observation": "Different High Courts have taken view that such Magistrates are not inferior criminal courts under CrPC."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Magistrate who entertained the application under s. 234 is not an inferior criminal court under s. 439 CrPC; he is persona designata.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Appeal lies under s. 93(1) against demand under s. 222(4) as it is deemed a tax levy.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Application under s. 234 competent despite no rules framed for demand notice.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Crown through Municipal Committee, Ajmer v. Amba Lal",
      "citation": "Ajmer-Merwara Law Journal, Vol. V, p. 92",
      "treatment": "distinguished",
      "relevance": "Held Magistrate under s. 234 is inferior criminal court; Court disagreed as reasoning flawed."
    },
    {
      "case_name": "Re Dinbai Jijibhai Khambatta",
      "citation": "1919 I.L.R. 43 Bom. 864",
      "treatment": "referred",
      "relevance": "Bombay HC held order under s. 161(2) Bombay District Municipalities Act revisable under s. 435 CrPC."
    },
    {
      "case_name": "V. B. D'Monte v. Bandra Borough Municipality",
      "citation": "I.L.R. 1950 Bom. 522",
      "treatment": "followed",
      "relevance": "Full Bench Bombay HC: revision under municipal act s. 110 is special jurisdiction, not under s. 435 CrPC; civil nature."
    },
    {
      "case_name": "Emperor v. Devappa Ramappa",
      "citation": "1918 43 Bom. 607",
      "treatment": "distinguished",
      "relevance": "Took contrary view, not followed in D'Monte."
    },
    {
      "case_name": "Re Dalsukhram Hurgovandas",
      "citation": "1907 6 Cr. L.J. 425",
      "treatment": "referred",
      "relevance": "Bombay HC: Magistrate under s. 86 Bombay District Municipal Act not inferior criminal court."
    },
    {
      "case_name": "Municipal Committee, Lashkar v. Shahabuddin",
      "citation": "A.I.R. 1952 M.B. 48",
      "treatment": "referred",
      "relevance": "Madhya Bharat HC: Magistrate under s. 153 Gwalior Municipal Act not inferior criminal court; administrative order."
    },
    {
      "case_name": "Mithan Musammat v. The Municipal Board of Agra & Anr.",
      "citation": "I.L.R. 1956 2 All. 60",
      "treatment": "referred",
      "relevance": "Allahabad HC: Magistrate under s. 247(1) U.P. Municipalities Act not inferior criminal court."
    },
    {
      "case_name": "Madho Ram v. Rex",
      "citation": "I.L.R. 1950 All. 392",
      "treatment": "referred",
      "relevance": "Allahabad HC: Similar holding as Mithan Musammat."
    }
  ],
  "statutes_cited": [
    {
      "name": "Ajmer-Merwara Municipalities Regulation, 1925",
      "sections": [
        "s. 153",
        "s. 220",
        "s. 222",
        "s. 222(4)",
        "s. 93",
        "s. 93(1)",
        "s. 226",
        "s. 234"
      ],
      "relevance": "Governs notices for repairs, execution of repairs, recovery as tax, appeal against levy, machinery for recovery by Magistrate."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 439",
        "s. 435"
      ],
      "relevance": "Defines inferior criminal court for revisional jurisdiction; Magistrate under s. 234 not such a court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The Supreme Court upholds the Rajasthan High Court's order dismissing the criminal revision as incompetent, holding that the Magistrate under s. 234 is not an inferior criminal court under s. 439 CrPC, and rejects other contentions of the appellant.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the Magistrate who entertains the application and holds the enquiry does so because he is designated in that behalf and so he must be treated as a persona designata and not as a Magistrate functioning and exercising his authority under the Code of Criminal Procedure.",
      "speaker": "court",
      "significance": "Core holding on status of Magistrate under s. 234."
    },
    {
      "text": "If by the fiction introduced by s. 222(4) the amount in question is to be deemed as if it were a tax it is obvious that full effect must be given to this legal fiction and in consequence just as a result of the said section the recovery procedure prescribed by s. 234 becomes available to the Committee so would the right of making an appeal prescribed by s. 93(1) be available to the appellant.",
      "speaker": "court",
      "significance": "Explains appealability under s. 93 due to tax fiction."
    },
    {
      "id": "kq3",
      "text": "the proceedings initiated before a Magistrate are no more than recovery proceedings.",
      "speaker": "court",
      "significance": "Characterizes nature of s. 234 proceedings as ministerial/recovery."
    }
  ],
  "_case_id": "1961_41",
  "_label": 0,
  "_text_length": 20399,
  "_extracted_at": "2026-02-10T19:29:41.151651"
}