{
  "metadata": {
    "case_name": "Petitioner (joint Hindu family firm) v. State of Orissa",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "VENKATARAMA AIYAR, J."
    ],
    "case_number": "Petition No. 12 of 1959",
    "date_of_judgment": "1961-03-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The petitioner is a joint Hindu family firm carrying on business at Berhampur in the State of Orissa, and registered as a dealer under the provisions of the Orissa Sales Tax Act, 1947.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Its business consists in the purchase of castor seeds, turmeric, gingili and other commodities locally, and selling them to dealers outside the State.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Sales Tax Officer, Berhampur, included in the taxable turnover of the petitioner the purchase of goods made by it inside the State but sold to dealers outside the State and imposed a tax of Rs. 27,161-13-0 on account of such sales during the sixteen quarters commencing from April 1, 1952, and ending with March 31, 1956.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The sales to the petitioner were not included in the taxable turnover of the sellers by reason of the registration certificate which the petitioner had obtained on a declaration that the goods were to be resold in Orissa.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In violation of this declaration the petitioner sold the goods to dealers outside the State.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The impugned tax has been levied under s. 5 of the Orissa Sales Tax Act, 1947.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the purchases made inside the State of Orissa but sold outside the State were in the course of inter-State trade, such that a tax thereon contravenes Art. 286(2) of the Constitution.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The purchases in question were made in the course of inter-State trade, and that a tax thereon was in contravention of Art. 286(2), as the goods were purchased for the purpose of being sold to dealers outside the State, and they were in fact so sold.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Art. 286(2); Messrs. Mohanlal Hargovind Das v. State of Madhya Pradesh"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The transactions of sales which have been taxed were wholly inside the State of Orissa; they were sales by persons in the State of Orissa to persons within the State of Orissa, of goods which were in Orissa.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "s. 5 of the Orissa Sales Tax Act, 1947"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under s. 5 of the Act, when a sale is to a registered dealer who declares that his purchases are for resale in Orissa, it is excluded from the seller's turnover; if the registered dealer sells outside, his purchases are liable to be included in his turnover and assessed to sales tax.",
      "addresses_issue": "i1",
      "key_observation": "That precisely is what has happened in this case."
    },
    {
      "id": "cr2",
      "text": "The present levy is not on the sales by the petitioner to persons outside the State, but on the purchases by him inside the State. The former sales are in the course of inter-State trade and not taxable under Art. 286(2), but the latter are purely intra-state sales.",
      "addresses_issue": "i1",
      "key_observation": "The fact that the purchaser sold those very goods to dealers outside the State is not relevant, as those sales are distinct and separate."
    },
    {
      "id": "cr3",
      "text": "In Mohanlal Hargovind Das case, the assessment was on purchases from dealers in Bombay under which goods were transported from Bombay to Madhya Pradesh; here, the purchases involved no movement of goods outside Orissa.",
      "addresses_issue": "i1",
      "key_observation": "In order that a sale or purchase might be inter-State, it is essential that there must be transport of goods from one State to another under the contract of sale or purchase."
    },
    {
      "id": "cr4",
      "text": "A sale could be said to be in the course of inter-State trade only if: 1. A sale of goods and 2. a transport of those goods from one State to another under the contract of sale. Unless both conditions are satisfied, there can be no sale in the course of inter-State trade.",
      "addresses_issue": "i1",
      "key_observation": "Observations from Bengal Immunity Co. Ltd. v. State of Bihar."
    },
    {
      "id": "cr5",
      "text": "A purchase made inside a State, for sale outside the State cannot itself be held to be in the course of inter-State trade, and the imposition of a tax thereon is not repugnant to Art. 286(2).",
      "addresses_issue": "i1",
      "key_observation": "On the same principles as applicable to Art. 286(1)(b)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The purchases by the petitioner inside Orissa are purely intra-state transactions and a tax imposed thereon does not offend Art. 286(2) of the Constitution.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Messrs. Mohanlal Hargovind Das v. State of Madhya Pradesh",
      "citation": "1955 2 S.C.R 509",
      "treatment": "distinguished",
      "relevance": "Distinguished because there purchases involved transport of goods from another State under the contract; here no such movement."
    },
    {
      "case_name": "Bengal Immunity Company Limited v. State of Bihar",
      "citation": "1955 2 S.C.R. 603",
      "treatment": "followed",
      "relevance": "Defines inter-State sale as requiring sale of goods and transport under the contract of sale."
    },
    {
      "case_name": "State of Travancore-Cochin v. Shanmuga Vilas Cashew Nut Factory",
      "citation": "1954 S.C.R. 53",
      "treatment": "referred",
      "relevance": "Analogous to Art. 286(1)(b); only sales occasioning export/import are exempt, not preceding or following sales."
    }
  ],
  "statutes_cited": [
    {
      "name": "Orissa Sales Tax Act, 1947",
      "sections": [
        "s. 5"
      ],
      "relevance": "Basis for levy on taxable turnover of purchases by registered dealer who breaches declaration of resale in Orissa."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 32",
        "Art. 286(2)"
      ],
      "relevance": "Art. 32 for petition; Art. 286(2) prohibits State tax on inter-State sale/purchase."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court rejected the petitioner's contention that the tax on intra-state purchases violated Art. 286(2), holding the transactions to be purely intra-state and not involving transport under the purchase contract.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Except in so far as Parliament may by law otherwise provide, no law of a State shall impose, or authorise the imposition of, a tax on the sale or purchase of any goods where such sale or purchase takes place in the course of inter-State trade or commerce.\"",
      "speaker": "court",
      "significance": "Quotes Art. 286(2) as applicable provision prior to sixth amendment."
    },
    {
      "text": "\"A sale could be said to be in the course of inter-State trade only if two conditions occur: 1. A sale of goods and 2. a transport of those goods from one State to another under the contract of sale.\"",
      "speaker": "court",
      "significance": "Key test from Bengal Immunity for inter-State trade."
    },
    {
      "text": "\"In order that a sale or purchase might be inter-State, it is essential that there must be transport of goods from one State to another under the contract of sale or purchase.\"",
      "speaker": "court",
      "significance": "Court's holding distinguishing intra-state purchases."
    }
  ],
  "_case_id": "1961_350",
  "_label": 0,
  "_text_length": 7899,
  "_extracted_at": "2026-02-10T19:34:41.704695"
}