{
  "metadata": {
    "case_name": "Petition No. 90 of 1956 (Nagpur Mill Majdoor Sangh Petitioner)",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "MUDHOLKAR, J."
    ],
    "case_number": "Original Jurisdiction Petition No. 90 of 1956",
    "date_of_judgment": "1961-01-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Two unions of textile workers in Nagpur: Rashtriya Mill Majdoor Sangh (branch of Indian National Trade Union Congress) and Nagpur Mill Majdoor Sangh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Rashtriya Mill Majdoor Sangh entered into agreement with Empress Mills management regarding closure of Empress Mill No. 1 for rebuilding and employment of workers in third shift. Opposed by Nagpur Mill Majdoor Sangh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On January 25, 1956, group of workers from Nagpur Mill Majdoor Sangh went in procession to office of Rashtriya Mill Majdoor Sangh at Gujars Wada, Mahal, Nagpur. Scuffle took place.",
      "type": "material",
      "date": "1956-01-25",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Offence under s. 452 read with s. 147 IPC registered by police on January 27, 1956.",
      "type": "procedural",
      "date": "1956-01-27",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Large procession of Nagpur Mill Majdoor Sangh workers marched through Nagpur shouting provocative slogans.",
      "type": "material",
      "date": "1956-01-27",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On the same night, meeting at Kasturchand Park where speakers instigated Nagpur Mill Majdoor Sangh workers to offer satyagraha in front of Empress Mill No. 1 and take procession to Rashtriya office.",
      "type": "material",
      "date": "1956-01-27",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On January 28, 1956, workers of Nagpur Mill Majdoor Sangh assembled in large numbers at Mahal Chowk and Mahal Road, blocking traffic, squatting and refusing to move.",
      "type": "material",
      "date": "1956-01-28",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "District Magistrate passed order at 4:00 a.m. on January 29, 1956 under s. 144 CrPC, effective immediately for 15 days, prohibiting inter alia assembly of five or more persons in specified areas.",
      "type": "material",
      "date": "1956-01-29",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Petitioner held public meeting outside the area covered by the order, criticised District Magistrate, exhorted workers to contravene the order and take out processions.",
      "type": "material",
      "date": "1956-01-29",
      "source": "petitioner",
      "disputed": true
    },
    {
      "id": "f10",
      "text": "Petitioner arrested by Nagpur police for offences under ss. 143 and 188 IPC read with s. 117 CrPC, produced before magistrate, remanded to jail custody till February 15, 1956.",
      "type": "procedural",
      "date": "1956-01-29",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Petitioner's bail application rejected as accusation related to non-bailable offence.",
      "type": "procedural",
      "date": "1956-02",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court at Nagpur rejected bail application on February 22, 1956.",
      "type": "procedural",
      "date": "1956-02-22",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Petition under s. 491 CrPC for habeas corpus dismissed by High Court on May 9, 1956.",
      "type": "procedural",
      "date": "1956-05-09",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "High Court refused certificate under Art. 132 as no substantial question of law regarding Constitution interpretation and not fit.",
      "type": "procedural",
      "date": "1956-05",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Present petition under Art. 32 presented to Supreme Court on April 23, 1956. Admitted but stay rejected. Later notice of motion on May 6, order on May 28 to record prosecution evidence but stay judgment.",
      "type": "procedural",
      "date": "1956-04-23",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "After Supreme Court stay, petitioner released on bail by trying magistrate.",
      "type": "procedural",
      "date": "1956-05-28",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether s. 144 CrPC confers unreasonable restrictions on freedoms under Art. 19(1)(a) and (b) of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the District Magistrate's order under s. 144 CrPC is unconstitutional as going beyond Art. 19(2) and (3).",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether remedy against s. 144 order is illusory, lacking judicial review.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether s. 144 uses unreasonable test of likelihood/tendency for criminality in advance.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether s. 144 substitutes suppression for duty to maintain order.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "S. 144 CrPC confers very wide powers on District Magistrate, constituting whole legal machinery with illusory check via petition to him, making him judge in own cause; revision to High Court also illusory, no proper judicial review.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Art. 19(1)(a), (b); s. 144 CrPC"
    },
    {
      "id": "pa2",
      "text": "S. 144 adopts likelihood or tendency as tests for criminality in advance, which is unreasonable.",
      "supporting_facts": [],
      "legal_basis": "Schenck v. U.S."
    },
    {
      "id": "pa3",
      "text": "S. 144 substitutes suppression of lawful activity for duty to maintain order.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Even if s. 144 valid, DM's order places restrictions beyond Art. 19(2),(3); directed to public generally though dispute industrial; no comprehensive exemptions; vague on 'provocative slogans'.",
      "supporting_facts": [
        "f2",
        "f8"
      ],
      "legal_basis": "Art. 19(2),(3)"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S. 144 confers powers on magistrates (not executive), requires written order with material facts, enumerates specific restraints, temporary (max 2 months), for emergency to prevent disorders; magistrates act judicially.",
      "addresses_issue": "i1",
      "key_observation": "Powers conditioned, not arbitrary; for public weal."
    },
    {
      "id": "cr2",
      "text": "'General public' not used; aims at public order within Art. 19(2),(3); no need for special law solely for restrictions.",
      "addresses_issue": "i1",
      "key_observation": "Restrictions reasonable in interests of public order."
    },
    {
      "id": "cr3",
      "text": "Magistrate must enquire or satisfy from knowledge/report to state material facts; not arbitrary.",
      "addresses_issue": "i1",
      "key_observation": "Enquiry implied."
    },
    {
      "id": "cr4",
      "text": "Power only in emergency for specific dangers; no absolute rights under Art. 19; initial opinion with executive magistrate reasonable as duty of executive.",
      "addresses_issue": "i1",
      "key_observation": "Satisfaction not purely subjective; notice ordinarily required."
    },
    {
      "id": "cr5",
      "text": "Remedies: application to magistrate (judicial), revision to High Court u/ss. 435/439 CrPC; prosecution allows challenge; not illusory.",
      "addresses_issue": "i1",
      "key_observation": "Judicial review available."
    },
    {
      "id": "cr6",
      "text": "Anticipatory action permissible under Art. 19(2),(3) for public order; Schenck doctrine not applicable due to constitutional differences.",
      "addresses_issue": "i4",
      "key_observation": "Proximity and degree; emergency allows prevention."
    },
    {
      "id": "cr7",
      "text": "Anticipatory action discharges duty to maintain order.",
      "addresses_issue": "i5",
      "key_observation": "Not suppression."
    },
    {
      "id": "cr8",
      "text": "Order to public practical as hard to differentiate; exemptions possible via application; religious/funeral exempted; 'provocative slogans' contextual, not vague.",
      "addresses_issue": "i2",
      "key_observation": "Order valid."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S. 144 CrPC does not place unreasonable restrictions on Art. 19(1)(a),(b); valid existing law.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "District Magistrate's order under s. 144 not unconstitutional.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "P. T. Chandra, Editor, Tribune v. Emperor",
      "citation": null,
      "treatment": "followed",
      "relevance": "High Court can interfere in revision if no connection between prohibited act and apprehended danger."
    },
    {
      "case_name": "Schenck v. U.S.",
      "citation": "249 U.S. 47",
      "treatment": "distinguished",
      "relevance": "Clear and present danger test not applicable under Indian Constitution."
    },
    {
      "case_name": "State of Madras v. V.G. Row",
      "citation": "1952 S.C.R. 597",
      "treatment": "referred",
      "relevance": "Fundamental rights under Art. 19 subject to restrictions in cls. 2-6."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 32",
        "Art. 19(1)(a)",
        "Art. 19(1)(b)",
        "Art. 19(2)",
        "Art. 19(3)",
        "Art. 132"
      ],
      "relevance": "Petition for enforcement of fundamental rights; restrictions on speech/assembly in interests of public order reasonable."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "s. 144",
        "s. 117",
        "s. 491",
        "s. 435",
        "s. 439",
        "s. 134"
      ],
      "relevance": "DM's emergency order valid; remedies via application, revision; judicial safeguards."
    },
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "s. 143",
        "s. 188",
        "s. 452",
        "s. 147"
      ],
      "relevance": "Offences for disobedience, house-trespass with rioting."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Petition under Art. 32 dismissed holding s. 144 CrPC and the District Magistrate's order constitutional and valid; non-constitutional challenges left for trial. Special leave petition noted with similar points.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Looking at the section as a whole it would be clear that, broadly speaking, it is intended to be availed of for preventing disorders, obstructions and annoyances and is intended to secure the public weal.",
      "speaker": "court",
      "significance": "Core purpose and validity of s. 144 CrPC."
    },
    {
      "text": "The powers are exercisable by responsible magistrates and these magistrates have to act judicially. Moreover, the restraints permissible under the provision are of a temporary nature and can only be imposed in an emergency.",
      "speaker": "court",
      "significance": "Safeguards making restrictions reasonable."
    },
    {
      "text": "Anticipatory action of the kind permissible under s. 144 is not impermissible under cls. 2 and 3 of Art. 19.",
      "speaker": "court",
      "significance": "Rejects advance criminality argument."
    }
  ],
  "_case_id": "1961_0",
  "_label": 0,
  "_text_length": 31143,
  "_extracted_at": "2026-02-10T19:28:57.899457"
}