{
  "metadata": {
    "case_name": "Owner of Urrunabund Tea Estate v. State of Assam",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Petitions Nos. 236 and 237 of 1960",
    "date_of_judgment": "1961-08-09"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Petitioner owns a tea estate called the Urrunabund Tea Estate in village Udarbund in the District of Cachar in the State of Assam. The extent of the Tea Estate is about 2682 acres. Out of the said area, 553.73 acres are under tea cultivation and the rest, according to the Petitioner, is utilised for the purpose of tea industry and for purposes connected with the said industry.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "The respondents do not admit that the remaining area beyond 553.73 acres under tea is utilised for tea industry purposes and state in the counter-affidavit that the remaining area is lying fallow and unutilised.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "On December 4, 1959, the Deputy Commissioner of Cachar at Silchar, respondent No. 2 issued a notification requisitioning an area of 183 bighas of land of the said Tea Estate.",
      "type": "procedural",
      "date": "1959-12-04",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "By another notification dated December 5, 1959, the Deputy Commissioner requisitioned another extent of 149 bighas 19 kathas and 11 chattacks of land of the said Tea Estate.",
      "type": "procedural",
      "date": "1959-12-05",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The petitioner filed two petitions in this Court under Art. 32 of the Constitution praying for the issue of writs of mandamus directing the respondents to forbear from giving effect to the said orders.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The Assam Land, Requisition and Acquisition Act, 1948, was passed by the Assam Legislature and it received the assent of the Governor on November 14, 1948. It is a pre-Constitution Act.",
      "type": "background",
      "date": "1948-11-14",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Tea Act of 1953 was a Central Act which received the assent of the President on May 28, 1953.",
      "type": "background",
      "date": "1953-05-28",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether tea industry is a matter for exclusive legislation by the Parliament under Entry 52, List I of the Seventh Schedule to the Constitution, and therefore, the Assam Land Requisition and Acquisition Act of 1948, in so far as it provides for the requisition and acquisition of a tea estate or lands appertaining to it, is ultra vires the State Legislature.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the said Act is also constitutionally void as it offends Art. 31(2) of the Constitution, inasmuch as it does not either provide for payment of compensation for the property requisitioned or specify the principles on which and the manner in which compensation is to be determined.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Tea industry is a matter for exclusive legislation by the Parliament under Entry 52, List I of the Seventh Schedule to the Constitution, and therefore, the Assam Land Requisition and Acquisition Act of 1948, in so far as it provides for the requisition and acquisition of a tea estate or lands appertaining to it, is ultra vires the State Legislature.",
      "supporting_facts": [
        "f1",
        "f6",
        "f7"
      ],
      "legal_basis": "Entry 52, List I, Seventh Schedule; Tea Act, 1953; Art. 372"
    },
    {
      "id": "pa2",
      "text": "The said Act is also constitutionally void as it offends Art. 31(2) of the Constitution, inasmuch as it does not either provide for payment of compensation for the property requisitioned or specify the principles on which and the manner in which compensation is to be determined.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Art. 31(2)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The remaining area beyond tea cultivation is lying fallow and unutilised.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Assam Act was constitutionally valid at the time it was passed as a pre-Constitution Act under Entry 9, List II of the Government of India Act, 1935. The Tea Act, 1953 does not alter, repeal or amend the Assam Act as they deal with different matters: the Assam Act concerns requisition and acquisition of land in public interest, while the Tea Act concerns control and development of the tea industry, including provisions contemplating compulsory acquisition of tea lands. The two Acts were passed for different purposes.",
      "addresses_issue": "i1",
      "key_observation": "A comparative study of both the Acts makes it clear that the two Acts deal with different matters and were passed for different purposes. The Tea Act in no sense of the term can be described as one altering, repealing or amending the Act passed by the Assam Legislature."
    },
    {
      "id": "cr2",
      "text": "The Act satisfies Art. 31(2) as Sections 7 and 8 provide for agreed compensation or, in case of disagreement, reference to Court where provisions of Land Acquisition Act, 1894 apply mutatis mutandis. Principles from Sections 23 etc. of Land Acquisition Act can be applied to requisition with appropriate changes, such as using market value of the interest deprived rather than land acquired.",
      "addresses_issue": "i2",
      "key_observation": "The expression mutatis mutandis means with due alteration of details. We do not see any difficulty in applying those principles for paying compensation in the matter of requisition of land."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The first contention is rejected as the Assam Act remains valid post-Constitution and is not affected by the Tea Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The second contention is rejected as the Act provides for compensation satisfying Art. 31(2).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 32",
        "Art. 31(2)",
        "Art. 372"
      ],
      "relevance": "Basis for petitions; requirement for compensation in acquisition/requisition; continuance of pre-Constitution laws"
    },
    {
      "name": "Assam Land (Requisition and Acquisition) Act, 1948",
      "sections": [
        "Section 3",
        "Section 4",
        "Section 6",
        "Section 7",
        "Section 8"
      ],
      "relevance": "Empowers requisition and acquisition of land; provides for compensation agreed or by reference to Court"
    },
    {
      "name": "Tea Act, 1953",
      "sections": [
        "Section 2",
        "Section 15(1)(b)"
      ],
      "relevance": "Declares Union control over tea industry expedient; contemplates compulsory acquisition of tea lands"
    },
    {
      "name": "Land Acquisition Act, 1894",
      "sections": [
        "Sections 23, 24, 25",
        "Part III"
      ],
      "relevance": "Principles for compensation applied mutatis mutandis to requisition references"
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Entry 9, List II",
        "Entry 34, List I"
      ],
      "relevance": "Basis for pre-Constitution validity of Assam Act"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Both contentions raised by the petitioner are rejected. No other point is raised.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A comparative study of both the Acts makes it clear that the two Acts deal with different matters and were passed for different purposes.",
      "speaker": "court",
      "significance": "Rejects ultra vires challenge by distinguishing scope of Assam Act and Tea Act"
    },
    {
      "text": "The expression mutatis mutandis means with due alteration of details.",
      "speaker": "court",
      "significance": "Explains application of Land Acquisition Act principles to requisition compensation"
    },
    {
      "text": "For the aforesaid reasons, we reject this contention. No other point is raised.",
      "speaker": "court",
      "significance": "Concludes dismissal of petitions"
    }
  ],
  "_case_id": "1961_213",
  "_label": 0,
  "_text_length": 15886,
  "_extracted_at": "2026-02-10T19:32:41.345105"
}