{
  "metadata": {
    "case_name": "Chaurasia Limestone Company v. Rewa Coalfields Limited",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 276 of 1958",
    "date_of_judgment": "1961-05-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent Rewa Coalfields Limited is a registered company whose coal-mines are situated at Burhar and Umaria. Its registered office is at Calcutta.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant is a firm, Chaurasia Limestone Company, Satna, Vindhya Pradesh, partners Ramlal, Motilal and Chhotelal. Prepares and deals in limestone at Maihar and Satna and purchased coal from respondent's coal-mines at Umaria by means of permits issued by Coal Commissioner Calcutta.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant purchased from respondent 3,307 tons of coal at the rate of Rs. 14-9-0 per ton between January 1952, and March 1953. Price Rs. 48,158-4-0.",
      "type": "material",
      "date": "1952-01 to 1953-03",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Respondent filed suit in Court of District Judge, Umaria, claiming Rs. 52,514-14-0 including interest until date of suit.",
      "type": "procedural",
      "date": "1953-10-06",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Appellant disputed substantial part of claim, urged amount arbitrarily calculated, due price paid for substantial part, stopped purchasing from respondent and obtaining supplies from Messrs Sood Brothers, Calcutta, to whom payments duly made. Admitted liability Rs.7,496-11-0 and readiness to pay.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "On date when respondent led evidence and appellant's turn to lead evidence, appellant applied for adjournment to produce additional evidence, granted on condition pay Rs. 200/- costs to respondent. Appellant did not appear nor pay costs on subsequent date.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Trial Court proceeded ex-parte, made findings in favour of respondent, passed ex-parte decree for Rs. 52,535-7-0 with proportionate costs and interest at 6% per annum from October 6,1953 until payment.",
      "type": "procedural",
      "date": "1954-11-09",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellant preferred appeal to Court of Judicial Commissioner, Vindhya Pradesh, Rewa (Appeal No. 16 of 1955) on February 17, 1955.",
      "type": "procedural",
      "date": "1955-02-17",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Last date for filing appeal was February 16, 1955. Ramlal, partner in charge of limitation, fell ill on February 16, 1955.",
      "type": "material",
      "date": "1955-02-16",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Appellant filed application under s. 5 Limitation Act on February 19, 1955 praying condonation of one day's delay, supported by affidavit and medical certificate.",
      "type": "procedural",
      "date": "1955-02-19",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Judicial Commissioner accepted illness on Feb 16 but held appellant showed lack of diligence during major portion of limitation period by putting off filing till last date, rejected condonation, dismissed appeal on August 6, 1955.",
      "type": "procedural",
      "date": "1955-08-06",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellant applied for certificate under Art. 133 Constitution, granted on ground of conflict of judicial opinion on construction of s.5 Limitation Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Construction of s. 5 of the Indian Limitation Act IX of 1908: meaning of 'within such period' - whether appellant must explain conduct and show diligence during the whole period of limitation prescribed, or only the delay after the last day.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Ex-parte decree should be set aside and case remanded to trial Court to allow appellant to lead evidence and dispose in accordance with law.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "One day's delay in filing appeal satisfactorily explained by illness of Ramlal on last day (Feb 16, 1955); appellant had right to file on last day.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Section 5, Limitation Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant had not shown diligence during major portion of limitation period, put off filing till last date; illness of Ramlal on last day not sufficient cause for condonation.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Section 5, Limitation Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Words 'within such period' in s.5 mean the period ending with last day of limitation; appellant need only show sufficient cause for not filing on last day and explain subsequent delay day by day; no need to explain conduct during whole prior period as that would be unreasonable and repugnant to context.",
      "addresses_issue": "i1",
      "key_observation": "Expiration of limitation gives right to decree-holder not to be lightly disturbed, but s.5 discretion advances substantial justice with liberal construction absent negligence."
    },
    {
      "id": "cr2",
      "text": "Even after sufficient cause shown, condonation not matter of right; court exercises discretion considering relevant facts like diligence/bona fides, but limited; not enquiry into entire prior period (contrast s.14).",
      "addresses_issue": "i1",
      "key_observation": "Here, no facts against appellant beyond general lack of diligence; Judicial Commissioner erred in rejecting solely on duty to file early."
    },
    {
      "id": "cr3",
      "text": "Conflict in High Courts: Calcutta HC (Karalicharan) supports appellant's view; Nagpur, Patna against, based on general considerations of procrastination irrelevant to s.5 construction.",
      "addresses_issue": "i1",
      "key_observation": "PC cases distinguished as not directly on point or involving s.14."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under s.5 Limitation Act, 'within such period' does not require explanation of diligence during entire limitation period; sufficient to explain why not filed on last day and subsequent delay.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Krishna v. Chattapan",
      "citation": "1890 I.L.R. 13 Mad. 269",
      "treatment": "referred",
      "relevance": "s.5 gives discretion to be exercised judicially for substantial justice with liberal construction of sufficient cause."
    },
    {
      "case_name": "Karalicharan Sarma v. Apurbakrishna Bajpeyi",
      "citation": "I.L.R. 58 Cal 549",
      "treatment": "followed",
      "relevance": "Enough to show sufficient cause for not filing on last day; no need to explain whole period."
    },
    {
      "case_name": "Kedarnath v. Zumberlal",
      "citation": "A.I.R. 1916 Nag. 39",
      "treatment": "distinguished",
      "relevance": "Held waiting till last day negligence even if delay explained; based on general considerations irrelevant to s.5."
    },
    {
      "case_name": "Jahar Mal v. G. M. Pritchard",
      "citation": "A.I.R. 1919 Pat. 503",
      "treatment": "distinguished",
      "relevance": "Not entitled to condone if put off to last moment; general observations on procrastination."
    },
    {
      "case_name": "Ram Narain Joshi v. Parmeshwar Narain Mehta",
      "citation": "1902 L.R. 30 I.A. 20",
      "treatment": "distinguished",
      "relevance": "Delay between specific dates not satisfactorily explained; different facts."
    },
    {
      "case_name": "Bri Indar Singh v. Kanthi Ram",
      "citation": "1917 L.R. 44 I.A. 218",
      "treatment": "distinguished",
      "relevance": "Dealt with s.14 read with s.5; conditions of s.14 not to same extent for pure s.5 cases."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Limitation Act IX of 1908",
      "sections": [
        "Section 5"
      ],
      "relevance": "Provides for condonation of delay if sufficient cause shown for not preferring appeal within prescribed period; 'within such period' construed as up to last day."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133"
      ],
      "relevance": "Certificate of fitness granted for appeal to Supreme Court."
    },
    {
      "name": "Limitation Act (historical)",
      "sections": [
        "Section 5A (1877 Act)"
      ],
      "relevance": "Predecessor provisions; explanation in current s.5 similar."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 25"
      ],
      "relevance": "Mentioned in PC case distinguished."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; one day delay condoned; case remanded to Court of Judicial Commissioner for disposal on merits in accordance with law.",
    "relief_granted": "Delay condoned; remand for hearing on merits.",
    "costs": "Appellant to pay respondent costs of this Court."
  },
  "key_quotes": [
    {
      "text": "\"in all cases falling under s. 5 what the party has to show is why he did not file an appeal on the last day of limitation prescribed.\"",
      "speaker": "court",
      "significance": "Core holding on construction of 'within such period' in s.5."
    },
    {
      "text": "\"To hold that the expression within such period means during such period would in our opinion be repugnant in the context.\"",
      "speaker": "court",
      "significance": "Rejects interpretation requiring explanation of entire limitation period."
    },
    {
      "text": "\"s. 5 gives the Court a discretion which ... is to be exercised ... to advance substantial justice when no negligence nor inaction nor want of bona fide is imputable to the appellant.\"",
      "speaker": "court",
      "significance": "Quotes Madras HC on liberal construction and purpose of s.5."
    }
  ],
  "_case_id": "1961_296",
  "_label": 1,
  "_text_length": 23047,
  "_extracted_at": "2026-02-10T19:34:08.551466"
}