{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Bombay City v. Legal Representatives of Mafatlal Gagalbhai",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeal by Commissioner of Income-tax Bombay City on certificate granted by High Court of Bombay against its judgment and order dated March 18, 1954.",
      "type": "procedural",
      "date": "1954-03-18",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "High Court answered three questions referred by Income-tax Appellate Tribunal in favour of the assessee Mafatlal Gagalbhai; his legal representative Navinchandra Mafatlal died, present respondents are legal representatives of Navinchandra Mafatlal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Concerned with assessment of Mafatlal Gagalbhai for accounting years 1941 and 1942, corresponding to assessment years 1942-43 and 1943-44.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Assessed under section 23(3) on total income of Rs. 3,76,539 (1942-43) and Rs. 4,42,693 (1943-44); appeal preferred in first year, appeals to AAC and Tribunal unsuccessful in second.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In accounting year 1941, held 12,485 ordinary shares and 2,500 preference shares in Gagalbhai Jute Mills Ltd., Calcutta.",
      "type": "material",
      "date": "1941",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In accounting year 1942, held ordinary shares less by 300 and same 2,500 preference shares.",
      "type": "material",
      "date": "1942",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "No dividend declared on ordinary or preference shares at general meetings for years ending March 31, 1941 and March 31, 1942.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Income-tax Officer passed order on February 20, 1947, applying section 23A to company, deeming Rs. 5,71,072 (1941-42) and Rs. 10,00,411 (1942-43) distributed as dividend to shareholders.",
      "type": "material",
      "date": "1947-02-20",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "ITO reopened assessments of Mafatlal Gagalbhai under section 34, adding Rs. 4,48,502 and Rs. 7,96,082 as deemed distributed on ordinary shares.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Company appealed s23A order to AAC, who agreed with ITO.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Legal representative of assessee appealed to AAC against tax on additional sums, order confirmed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Company appealed to Tribunal; Tribunal on July 29, 1948, held undistributed profits should first be distributed to preference shareholders, balance to ordinary shareholders.",
      "type": "procedural",
      "date": "1948-07-29",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Assessee's legal rep appealed to Tribunal but withdrew appeals with leave upon seeing company's Tribunal order, to avoid additional tax.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "On remand, ITO reopened assessment without s34 notice on January 23, 1950, reduced deemed distribution on ordinary shares, included on preference shares, added note giving effect to Tribunal directions, issued demand notice.",
      "type": "procedural",
      "date": "1950-01-23",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Legal rep appealed to AAC, held no appeal lay under s30, dismissed; Tribunal confirmed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Tribunal at instance of legal rep stated case under s66(1), referred three questions to High Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "High Court (Chagla CJ and Tendolkar J) held s23A procedural or computation section, not giving right to assess; required s34 action; followed S.G. Cambatta v. CIT.",
      "type": "procedural",
      "date": "1954-03-18",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Tribunal earlier stated no need for s34 action after s23A order.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the orders of the Income-tax Officer dated January 23, 1950, are appealable?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether it was incumbent upon the Income-tax Officer to take action under section 34 of the Income-tax Act before he revised the assessment on January 23, 1950?",
      "framed_by": "tribunal"
    },
    {
      "id": "i3",
      "text": "If the answer to question No. 2 is in the affirmative, whether the bar of limitation specified in section 34 of the Income-tax Act would apply to the inclusion in the total income of a shareholder of the dividend which is deemed to have been distributed under section 23A of the Act?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Section 23A is a self-contained section and brings to charge dividends deemed to have been distributed and, in terms does not require any other assessment proceedings either by way of section 23 or section 34 of the Act.",
      "supporting_facts": [
        "f14",
        "f18"
      ],
      "legal_basis": "Section 23A of Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Action under section 34 was necessary, and notice was a condition precedent; act of ITO in bringing to charge without s34 notice illegal.",
      "supporting_facts": [
        "f14",
        "f17"
      ],
      "legal_basis": "Sections 23A, 34 Income-tax Act; S.G. Cambatta v. CIT"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 23A does not provide for any assessment being made; it only talks of fictional income being included in total income for purpose of assessing; assessment has to be made under other provisions including s34.",
      "addresses_issue": "i2",
      "key_observation": "Follows Sardar Baldev Singh v. CIT; High Court decision correct."
    },
    {
      "id": "cr2",
      "text": "Sardar Baldev Singh not obiter; court stated its own view despite Solicitor-General's concession.",
      "addresses_issue": "i2",
      "key_observation": "Clear pronouncement binding."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Assessment cannot be made under section 23A alone; requires proceedings under other provisions including section 34 with notice.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court decision that ITO's action without s34 illegal is correct.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "S.G. Cambatta v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "High Court followed it holding s23A procedural/computation section, not charging; quoted Chagla J. and Stone CJ."
    },
    {
      "case_name": "Sardar Baldev Singh v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Supreme Court held s23A does not provide for assessment; must use s34 etc.; not obiter."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "23A",
        "34",
        "23(3)",
        "66(1)",
        "30"
      ],
      "relevance": "S23A deems distribution for inclusion in shareholder's income but requires assessment under s34 with notice; no notice issued, assessment illegal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court judgment answering questions in favour of assessee; held that Income-tax Officer's reassessment orders dated January 23, 1950 without s34 notice were illegal as s23A requires assessment proceedings under s34.",
    "relief_granted": "High Court decision in favour of assessee upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Section 23A is a mandatory section and lays down rules of computation in computing the total income of the shareholder referred to in that section\" per Chagla, J.",
      "speaker": "petitioner_counsel",
      "significance": "High Court reliance on Cambatta case characterizing s23A."
    },
    {
      "text": "\"It seems to us that the Tribunal was wrong... Section 23A does not provide for any assessment being made. It only talks of the fictional income being included... assessment has to be made under the other provisions of the Act, including section 34.\"",
      "speaker": "court",
      "significance": "Supreme Court's binding interpretation of s23A and need for s34."
    }
  ],
  "_case_id": "1961_102",
  "_label": 0,
  "_text_length": 8875,
  "_extracted_at": "2026-02-10T19:30:35.752753"
}