{
  "metadata": {
    "case_name": "Appellant Company v. Respondents (Owners of No. 5, Raja Rajkissen Street, Calcutta)",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 82 of 1957",
    "date_of_judgment": "1961-02-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents are owners of premises No. 5, Raja Rajkissen Street, Calcutta. Appellant was contractual tenant from June 15, 1917, till June 15, 1947, under three successive tenancies for 10 years each.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Under first tenancy, rent Rs. 84-15-0 per month; second tenancy Rs. 180 per month; third tenancy Rs. 225 per month. Premises used for manufacturing tin canisters and open land.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Contractual tenancy determined by efflux of time on June 15, 1947. No fresh contractual tenancy since then.",
      "type": "material",
      "date": "1947-06-15",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Calcutta Rent Ordinance V of 1946 issued September 30, 1946, with s.12 protecting tenants from eviction if rent paid and conditions performed. Replaced by Act I of 1947, then West Bengal Act V of 1948 continuing provisions.",
      "type": "background",
      "date": "1946-09-30",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "West Bengal Premises Rent Control Temporary Provisions Act XXXVIII of 1948 from December 1, 1948, repealed prior Act but continued tenant protection. Repealed by West Bengal Premises Rent Control Act, 1950, s.12 prohibiting eviction except where premises reasonably required for building/rebuilding or own occupation.",
      "type": "background",
      "date": "1948-12-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "By letter dated May 15, 1957, respondents called upon appellant to vacate on expiry of tenancy period. Appellant did not deliver possession but continued to pay stipulated rent, accepted by respondents.",
      "type": "procedural",
      "date": "1957-05-15",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Under s.9 of 1948 Act, Controller fixed standard rent at Rs. 455 per month. After 1950 Act, reduced to Rs. 247-8-0.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Notice served October 10, 1950, requiring appellant (described as monthly tenant) to vacate by April 14, 1951. Ground: premises reasonably required for putting up new buildings.",
      "type": "material",
      "date": "1950-10-10",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Respondents sued in Court of Small Causes, Calcutta, for ejectment decree. Trial court decreed in favour of respondents.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appeal to Special Bench, Court of Small Causes: decree reversed. Held appellant tenant holding over by acceptance of rent after 1947; manufacturing tenancy requires six months' notice expiring with year of tenancy; no such notice, suit fails.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appeal to Calcutta High Court: Special Bench decree reversed, trial court decree restored.",
      "type": "procedural",
      "date": "1955-04-04",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appeal to Supreme Court with certificate under Art. 133(1)(c) of Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appellant continued paying contractual rent and later statutory rent after 1947.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Does acceptance of rent by landlord from tenant after determination of contractual tenancy confer upon the tenant the right of a tenant holding over within the meaning of s.116 of the Transfer of Property Act, in view of rent control legislation granting statutory protection?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "By acceptance of rent after determination of tenancy in June 1947, appellant continued as tenant holding over. As purpose was manufacturing, tenancy determinable only by six months' notice expiring with year of tenancy; no such notice served.",
      "supporting_facts": [
        "f3",
        "f6",
        "f10",
        "f13"
      ],
      "legal_basis": "Section 116 and 106, Transfer of Property Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No fresh contractual tenancy after 1947. Acceptance of rent does not create tenancy holding over under s.116 TPA due to rent control laws providing statutory protection, not contractual right.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f8"
      ],
      "legal_basis": "Rent control statutes including West Bengal Premises Rent Control Act 1950 s.12; s.116 TPA"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Acceptance of rent from statutory tenant under rent control laws after expiry of contractual tenancy does not amount to assent creating new tenancy under s.116 TPA. Tenant in possession by statutory immunity, not contractual right.",
      "addresses_issue": "i1",
      "key_observation": "Statutory protection prohibits court action, not voluntary assent by landlord."
    },
    {
      "id": "cr2",
      "text": "Quoting Kai Khushroo v. Bai Jerbai: Acceptance of rent from statutory tenant does not create new tenancy; tenant cannot claim fresh notice to quit.",
      "addresses_issue": "i1",
      "key_observation": "Tenant on sufferance unless express assent; rent control cases differ."
    },
    {
      "id": "cr3",
      "text": "Description of appellant as 'monthly tenant' in notice not indicative of new contractual tenancy; under 1950 Act, appellant was 'tenant' by definition including post-termination occupiers.",
      "addresses_issue": "i1",
      "key_observation": "No conduct justifying inference of fresh contract."
    },
    {
      "id": "cr4",
      "text": "Once prohibition removed (e.g., reasonable requirement ground), landlord's right to evict under ordinary law; no need for s.106 TPA notice.",
      "addresses_issue": "i1",
      "key_observation": "Occupation by statute, not contract."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Acceptance of rent and failure to evict due to statutory prohibition does not confer tenant holding over status under s.116 TPA. No fresh contractual tenancy; no need for s.106 notice.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kai Khushroo v. Bai Jerbai",
      "citation": "1949 F.C.R. 262",
      "treatment": "followed",
      "relevance": "Acceptance of rent from statutory tenant post-lease expiry does not create new tenancy under s.116 TPA; distinguishes from ordinary cases."
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [
        "Section 116",
        "Section 106"
      ],
      "relevance": "Defines tenant holding over by acceptance of rent or assent; applied but not triggered due to rent control."
    },
    {
      "name": "Calcutta Rent Ordinance, V of 1946",
      "sections": [
        "Section 12"
      ],
      "relevance": "Protected tenants from eviction if rent paid; included post-termination occupiers."
    },
    {
      "name": "Premises Rent Control Act I of 1947",
      "sections": [],
      "relevance": "Replaced Ordinance with similar provisions."
    },
    {
      "name": "West Bengal Act V of 1948",
      "sections": [],
      "relevance": "Continued prior protections."
    },
    {
      "name": "West Bengal Premises Rent Control Temporary Provisions Act XXXVIII of 1948",
      "sections": [
        "Section 9"
      ],
      "relevance": "Fixed standard rent; continued tenant protection."
    },
    {
      "name": "West Bengal Premises Rent Control Act, 1950",
      "sections": [
        "Section 12"
      ],
      "relevance": "Prohibited eviction except reasonable requirement for building/occupation; defined tenant to include post-termination occupiers."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(c)"
      ],
      "relevance": "Certificate for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Calcutta High Court order restoring decree of trial court in favour of respondents for ejectment of appellant. Held no tenant holding over status created by rent acceptance under rent control regime.",
    "relief_granted": "Decree for ejectment in favour of respondents-landlords.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "acceptance of rent from the tenant by the landlord after the expiration or determination of the contractual tenancy will not afford ground for holding that the landlord has assented to a new contractual tenancy.",
      "speaker": "court",
      "significance": "Core holding distinguishing rent control cases from s.116 TPA."
    },
    {
      "text": "Under the Rent Restriction Statutes at the material time, statutory immunity was granted to the appellant against eviction, and acceptance of the amounts from him which were equivalent to rent after the contractual tenancy had expired... did not amount to acceptance of rent from a lessee within the meaning of s. 116.",
      "speaker": "court",
      "significance": "Explains why no holding over tenancy."
    },
    {
      "text": "Occupation of premises by a tenant whose tenancy is determined is by virtue of the protection granted by the statute and not because of any right arising from the contract which is determined.",
      "speaker": "court",
      "significance": "Clarifies basis of possession post-1947."
    }
  ],
  "_case_id": "1961_381",
  "_label": 0,
  "_text_length": 12022,
  "_extracted_at": "2026-02-10T19:35:20.278995"
}