{
  "metadata": {
    "case_name": "Gian Chand and Ors. v. State",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "AYYANGAR, J."
    ],
    "case_number": "Criminal Appeal No. 194 of 1960",
    "date_of_judgment": "1961-11-13"
  },
  "facts": [
    {
      "id": "f1",
      "text": "City Inspector of Police, Jullundur received information that some smugglers were on the point of transporting gold from Amritsar into Jullundur.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "At about mid-night on July 16, 1958, further information that some of these had actually come and were present in the house of Gian Chand-the first appellant. A raid-party was organised and the house of the first appellant was surrounded and raided at about 3 A.M. on the early morning of July 17,1958. In the course of the search certain bars of gold were found on the person of some of the inmates of the house and in the house itself, as also a large amount of cash.",
      "type": "material",
      "date": "1958-07-17",
      "source": "police"
    },
    {
      "id": "f3",
      "text": "Thereafter the first appellant, his wife-the third appellant-and her brother-the second appellant-were arrested, the gold found was seized and a complaint filed charging the three accused of offences under ss. 411 and 414 of the Indian Penal Code.",
      "type": "procedural",
      "date": "1958-07-17",
      "source": "police"
    },
    {
      "id": "f4",
      "text": "This charge of receiving stolen property preferred against the three appellants was, however, not proceeded with and the Police Inspector made a report to the Court on January 7, 1959, that no case had been made out against them, and the case was thereupon dropped.",
      "type": "procedural",
      "date": "1959-01-07",
      "source": "police"
    },
    {
      "id": "f5",
      "text": "Meanwhile, the Assistant Collector of Customs contacted the City Police at Jullundur and made an application to the Court of the First Class Magistrate, Jullundur for the delivery of these gold-bars to the Customs authorities obviously under s. 180 of the Sea Customs Act and they were delivered to the Customs authorities on January 7, 1959.",
      "type": "procedural",
      "date": "1959-01-07",
      "source": "customs"
    },
    {
      "id": "f6",
      "text": "Very soon thereafter a notice was issued to the appellants to show cause why the gold in the possession of the Customs authorities should not be confiscated under s. 167(8) of the Sea Customs Act, and after considering the explanations of the appellants the Collector passed an order directing the confiscation of the gold. That order has become final.",
      "type": "procedural",
      "date": null,
      "source": "customs"
    },
    {
      "id": "f7",
      "text": "During the proceedings before the Customs authorities for confiscation, sanction was accorded to prosecute the appellants for an offence under s. 167(81) Sea Customs Act. Convicted by the First Class Magistrate of Jullundur. Appeals to Sessions Judge, Jullundur upheld convictions though sentence reduced for third appellant. Revision to Punjab High Court dismissed on January 20, 1960.",
      "type": "procedural",
      "date": "1960-01-20",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellants obtained leave from this Court under Art. 136 of the Constitution and filed the appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the gold bars were seized under the Sea Customs Act within the meaning of s. 178A so as to shift the burden of proving they are not smuggled goods to the person from whose possession they were seized.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the prosecution established that the gold was smuggled and that the accused knowingly acquired possession or were concerned in carrying, keeping or concealing it with intent to defraud the Government under s. 167(81) Sea Customs Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The delivery of gold to Customs under s. 180 after seizure by police under CrPC is not a 'seizure under this Act' within s. 178A, as seizure by police was not under Sea Customs Act but other laws; thus onus not shifted to accused.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5"
      ],
      "legal_basis": "Sea Customs Act ss. 178, 178A, 180"
    },
    {
      "id": "pa2",
      "text": "Constitutional validity of s. 178A challenged but now not live issue.",
      "supporting_facts": [],
      "legal_basis": "Sea Customs Act s. 178A"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The conveyance and deposit in the office of the Customs authority under the second paragraph of s. 180 involves a seizure under the Act.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Sea Customs Act s. 180; meaning of 'seize' as taking into possession"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sections 178, 178A, 180 draw distinction between seizure under the Act (by Customs officer under s. 178) and seizure by police under other laws (CrPC). Delivery under s. 180 is not seizure under the Act.",
      "addresses_issue": "i1",
      "key_observation": "Seizure under s. 178A means take possession contrary to wishes of owner by authority under the Act; police seizure deprives accused of possession, transfer to Customs is not fresh seizure."
    },
    {
      "id": "cr2",
      "text": "Burden under s. 178A(1) is on person from whose possession goods taken; when delivered by Magistrate, not from accused's possession.",
      "addresses_issue": "i1",
      "key_observation": "Leads to absurdity if burden on accused after Magistrate's delivery."
    },
    {
      "id": "cr3",
      "text": "Magistrate applied s. 178A but also discussed evidence; Sessions Judge upheld on alternative footing even without s. 178A; High Court relied solely on s. 178A.",
      "addresses_issue": "i2",
      "key_observation": "High Court judgment cannot be upheld; revision must be reconsidered on prosecution evidence independently."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Delivery of goods to Customs authorities under s. 180 after police seizure is not 'seizure under this Act' for s. 178A; presumption and burden shift under s. 178A not applicable.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Collector of Customs, Madras v. Nathella Sampathu Chetty",
      "citation": null,
      "treatment": "referred",
      "relevance": "Dealt with details of circumstances and construction of s. 178A Sea Customs Act."
    }
  ],
  "statutes_cited": [
    {
      "name": "Sea Customs Act",
      "sections": [
        "167(8)",
        "167(81)",
        "178",
        "178A",
        "180"
      ],
      "relevance": "Prosecution under 167(81) for possession of smuggled gold; s.178A shifts burden if seized under Act; s.180 for delivery by police to Customs."
    },
    {
      "name": "Foreign Exchange Regulation Act, 1947",
      "sections": [
        "8(1)"
      ],
      "relevance": "Prohibits bringing gold into India without Reserve Bank permission; notification bans import of gold."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "411",
        "414"
      ],
      "relevance": "Initial charges against appellants for receiving stolen property, later dropped."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "136"
      ],
      "relevance": "Special leave for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "High Court judgment cannot be upheld as it proceeded solely on applicability of s. 178A which does not apply; Sessions Judge had independent finding on merits not considered by High Court; revision petition must be reconsidered on prosecution evidence without s. 178A.",
    "relief_granted": "High Court order set aside implicitly; matter for reconsideration by High Court on merits.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the delivery of the goods to the Customs authorities under the latter part of s. 180 is not seizure under the Act within the meaning of s. 178A.\"",
      "speaker": "court",
      "significance": "Core holding on inapplicability of burden-shifting provision."
    },
    {
      "text": "\"A seizure under the Act is one for which the authority to seize is conferred by the Act and in the context it could be referred to as a seizure under s. 178.\"",
      "speaker": "court",
      "significance": "Distinguishes types of seizures."
    },
    {
      "text": "\"it would lead to an absurdity to hold that the section contemplated proof to the contrary by the Magistrate under whose orders the delivery was effected.\"",
      "speaker": "court",
      "significance": "Rejects respondent's broad interpretation of seizure."
    }
  ],
  "_case_id": "1961_223",
  "_label": 1,
  "_text_length": 17098,
  "_extracted_at": "2026-02-10T19:32:40.319738"
}