{
  "metadata": {
    "case_name": "Appellant v. Mahalakshmi Bahuji Maharaj & Anr.",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Civil Appeal No. 143 of 1956",
    "date_of_judgment": "1961-09-13"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant and second respondent are descendants of Vallabhacharyaji, a Vaishnava teacher over 400 years ago who established shrines (Gadis) in Gujarat and other places.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "A shrine was established at Nadiad more than 100 years ago; around 1899, a descendant adopted as Anniruddhalalji Murlidharji became head of Nadiad shrine and possessed its properties.",
      "type": "background",
      "date": "1899",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Anniruddhalalji became head of Moti Haveli at Jamnagar by adoption in 1913, taking name Anniruddhalalji Brijeshji; adoptions per Goda Dattak custom.",
      "type": "background",
      "date": "1913",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Anniruddhalalji died on December 17, 1935, leaving widow Mahalakshmi Bahuji Maharaj (first respondent).",
      "type": "material",
      "date": "1935-12-17",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Post-death, talks of adopting one of appellant's sons (appellant being natural brother of Anniruddhalalji) per Goda Dattak, but fruitless.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On June 1, 1946, second respondent (also Vallabhacharya descendant) adopted by first respondent.",
      "type": "material",
      "date": "1946-06-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant filed suit challenging validity of second respondent's adoption, seeking declaration he is not legally adopted son, no rights in properties; appellant nearest heir; widow's limited rights; injunction, accounts, etc.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Factum of adoption proved (Issue No. 6), not challenged.",
      "type": "admitted",
      "date": "null",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Trial Court framed 19 issues, including Issue 8 (customs on adoptee from adoptive father's family and no wife's sister's husband) and Issue 12 (prohibition to adopt except appellant or his sons).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Trial Court held no proof of customs (Issue 8 negative), letter Ex. 115 inspired by plaintiff, oral evidence unreliable (Issue 12 negative); rejected sapindas consent argument; dismissed suit with costs.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Bombay High Court in First Appeal No. 57 of 1949 (judgment September 23, 1952) agreed on customs and prohibition; refused sapindas plea for lack of pleading/issue; rejected amendment; dismissed appeal with costs.",
      "type": "procedural",
      "date": "1952-09-23",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Special leave appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Preliminary objection: Appeal infructuous per s.14 Hindu Succession Act as widow in possession becomes full owner if adoption invalid; but properties may be Devattar; separate suit pending; court decides merits, leaves s.14 open.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Plaintiff's witness Chandras Shankar Laxmishakar Upadhyaya stated objects of Goda adoption: perform worship of Thakorji, continue tradition; perform shraddha after death; continue line.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Letter Ex. 115: Anniruddhalalji expressed desire for Gokul Nath (plaintiff's son); authorized widow to adopt.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether under Goda Dattak custom, adoptee must be from adoptive father's family if possible.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether under Goda Dattak custom, widow cannot adopt her sister's husband.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Anniruddhalalji impliedly prohibited adoption except appellant or his sons.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether adoption invalid without husband's sapindas' consent under Madras School of Mitakshara.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under Goda Dattak custom, adoptee must be from adoptive father's family if possible; appellant and sons available.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Goda Dattak custom (Issue 8)"
    },
    {
      "id": "pa2",
      "text": "Under Goda Dattak custom, widow cannot adopt her sister's husband as son.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Goda Dattak custom (Issue 8); Dharmashastras, Dattak Mimansa"
    },
    {
      "id": "pa3",
      "text": "Anniruddhalalji expressed desire/implied prohibition: only appellant or his sons; via Ex. 115, oral evidence.",
      "supporting_facts": [
        "f5",
        "f15"
      ],
      "legal_basis": "Implied prohibition (Issue 12)"
    },
    {
      "id": "pa4",
      "text": "No sapindas' consent; governed by Madras School of Mitakshara.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Madras School of Mitakshara Law"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No proof of customs barring sister's husband or requiring family member.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Ex. 115 written by widow herself, not under influence; no prohibition beyond preference for one son.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Appeal infructuous per s.14 Hindu Succession Act; widow full owner if adoption invalid.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Section 14, Hindu Succession Act"
    },
    {
      "id": "ra4",
      "text": "Husband authorized adoption in lifetime; no need for sapindas consent.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Husband's authority"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Objects of Goda adoption (worship, shraddha, continue line) do not require adoptee from same family or bar sister's husband; no texts/authority prohibit; Dattak Mimansa rule recommendatory.",
      "addresses_issue": "i1",
      "key_observation": "No custom proved barring adoption from other Vallabhacharya family or wife's sister's husband."
    },
    {
      "id": "cr2",
      "text": "Plaintiff's evidence weak; defendant's instances of adoptions from other families; no authoritative proof.",
      "addresses_issue": "i1",
      "key_observation": "Plaintiff failed to establish customs."
    },
    {
      "id": "cr3",
      "text": "Ex. 115 shows preference for Gokul Nath but no prohibition on others; oral evidence unreliable/uncorroborated.",
      "addresses_issue": "i3",
      "key_observation": "No implied prohibition proved."
    },
    {
      "id": "cr4",
      "text": "Husband authorized widow to adopt (Ex. 115); no need for sapindas consent even if Madras Mitakshara applies.",
      "addresses_issue": "i4",
      "key_observation": "Authority from husband present."
    },
    {
      "id": "cr5",
      "text": "Decline to decide s.14 Hindu Succession Act effect; merits only, as properties may be Devattar.",
      "addresses_issue": null,
      "key_observation": "Leave open for separate claim."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No custom under Goda Dattak requiring adoptee from adoptive father's family if possible.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No custom barring adoption of wife's sister's husband under Goda Dattak.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No implied prohibition by Anniruddhalalji against adopting anyone except appellant or sons.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Adoption valid; husband's authority negates need for sapindas consent.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mrs. Abhiraj Kuer v. Debendra Singh",
      "citation": "C.A. No. 379 of 1958 decided on 15.9.61",
      "treatment": "followed",
      "relevance": "Dattak Mimansa rule against Viruddha Sambandha putra is recommendatory, not mandatory."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hindu Succession Act",
      "sections": [
        "Section 14"
      ],
      "relevance": "May confer full ownership on widow in possession if adoption invalid; not decided on merits."
    },
    {
      "name": "Mitakshara Law (Madras School)",
      "sections": [],
      "relevance": "Requires husband's sapindas consent for widow's adoption absent husband's authority; inapplicable here due to authority."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding the validity of the adoption of respondent No. 2 by the widow under Goda Dattak custom, rejecting all grounds of challenge including customs, implied prohibition, and sapindas consent; left open claim under s.14 Hindu Succession Act.",
    "relief_granted": "None; adoption upheld.",
    "costs": "Not specified; lower courts awarded costs to respondents."
  },
  "key_quotes": [
    {
      "text": "It is obvious that if the above be the objects of Goda adoption it must be implicit in the nature of Goda adoption that anybody who would be incapable of accomplishing any of these objects would be ineligible for adoption.",
      "speaker": "court",
      "significance": "Explains basis for eligibility under Goda adoption."
    },
    {
      "text": "We have however held in Mrs. Abhiraj Kuer v. Debendra Singh... that this rule in Dattaka Mimansa against Viruddha Sambandha putra is only recommendatory and not mandatory.",
      "speaker": "court",
      "significance": "Rejects bar on certain relations for adoption."
    },
    {
      "text": "All that the letter shows however is that Anniruddhalalji had expressed a desire that Gokul Nath who is plaintiffs son should be taken in adoption to him.",
      "speaker": "court",
      "significance": "Interprets Ex. 115 as preference, not prohibition."
    }
  ],
  "_case_id": "1961_267",
  "_label": 0,
  "_text_length": 21947,
  "_extracted_at": "2026-02-10T19:33:29.605898"
}