{
  "metadata": {
    "case_name": "Municipal Corporation of Nagpur v. Respondents",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": "Civil Appeal No. 508 of 1960",
    "date_of_judgment": "1962-11-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Bombay High Court at Nagpur issued a writ on April 23, 1959, in Special Civil Application No. 110 of 1959, restraining the Municipal Corporation of Nagpur from carrying out a resolution proposing to send two of its members as delegates to a Health Congress at Harrogate in the UK and sanctioning certain expenses in connection with the delegation.",
      "type": "procedural",
      "date": "1959-04-23",
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "The convenors of the Health Congress at Harrogate sent an invitation to the Municipal Corporation of Nagpur to send delegates.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Delegates at the Congress would discuss subjects of common interest representing all aspects of public health; there would be a health exhibition showing latest equipment and products; delegates might visit water supply undertakings, sewage disposal works, housing schemes, hospitals, health service centres, food factories and canteens.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Health Congress was held from April 27 to May 1, 1959; over 2,600 attended the previous one.",
      "type": "background",
      "date": "1959-04-27",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The proposed delegates were lawyers, described by High Court as non-technical men.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "There was a head in the budget dealing with allowances payable to members of the Corporation.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The writ petition did not allege that the resolution was bad because expenses were outside the budget.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "High Court placed some budget papers before it at its request but Corporation objected to challenge on budget grounds without pleadings.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "High Court held that the Corporation acted honestly and circumstances did not warrant inference of mala fides.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Municipal Corporation had power under section 58(s) of the City of Nagpur Corporation Act, 1948, to send delegates to the Health Congress at Harrogate to promote public health.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there was a reasonable and legitimate connection between sending delegates and promotion of public health at Nagpur.",
      "framed_by": "lower_court"
    },
    {
      "id": "i3",
      "text": "Whether the delegates, being non-technical (lawyers), could benefit from the Congress.",
      "framed_by": "lower_court"
    },
    {
      "id": "i4",
      "text": "Whether the Corporation's capacity to make use of knowledge gained was limited.",
      "framed_by": "lower_court"
    },
    {
      "id": "i5",
      "text": "Whether the resolution was invalid due to lack of budget provision under section 84, and possibility of transfer under section 88.",
      "framed_by": "lower_court"
    },
    {
      "id": "i6",
      "text": "Whether the issue was academic since the Congress was over.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Corporation had power under section 58(s) to send delegates as it promotes public health by acquiring useful knowledge.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "City of Nagpur Corporation Act, 1948, s.58(s); Mayor etc. of Westminster v. London and North Western Railway Company"
    },
    {
      "id": "pa2",
      "text": "It is not for courts to interfere with the mode in which the Corporation exercises its powers.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Mayor etc. of Westminster v. London and North Western Railway Company (1905 A.C. 426)"
    },
    {
      "id": "pa3",
      "text": "Budget head for members' allowances covers expenses; even if not, section 88 allows transfer of funds.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "City of Nagpur Corporation Act, 1948, ss.84, 88"
    },
    {
      "id": "pa4",
      "text": "Writ petition did not challenge on budget grounds; no proper pleadings.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Issue not academic; important for future guidance on Corporation's powers.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Article 136 of the Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No reasonable and legitimate connection between sending delegates and promotion of public health at Nagpur.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "City of Nagpur Corporation Act, 1948, s.58(s)"
    },
    {
      "id": "ra2",
      "text": "Subjects at Congress highly technical; delegates (lawyers) unlikely to benefit.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Corporation's capacity to use knowledge gained extremely limited.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "No budget provision for delegation expenses; resolution beyond powers under s.84.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "City of Nagpur Corporation Act, 1948, s.84"
    },
    {
      "id": "ra5",
      "text": "Question academic as Congress over.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sending delegates authorised by s.58(s) as it promotes public health by acquiring useful knowledge of public health matters, equipment, and trends.",
      "addresses_issue": "i1",
      "key_observation": "Delegate would acquire useful knowledge concerning public health utilisable at Nagpur."
    },
    {
      "id": "cr2",
      "text": "Courts should not interfere with mode of exercising statutory power if authorised.",
      "addresses_issue": "i1",
      "key_observation": "Not for court to decide delegation constitution."
    },
    {
      "id": "cr3",
      "text": "No doubt subjects not highly technical given large attendance; delegates could acquire general knowledge.",
      "addresses_issue": "i2",
      "key_observation": "Over 2,600 attended previous Congress."
    },
    {
      "id": "cr4",
      "text": "Reasonable connection exists; Corporation can increase capacity and better discharge functions.",
      "addresses_issue": "i2",
      "key_observation": "Absurd to say Corporation cannot improve public health services."
    },
    {
      "id": "cr5",
      "text": "Budget may cover under allowances head; s.88 allows transfer; no pleadings in writ petition; s.84 may not invalidate resolution.",
      "addresses_issue": "i5",
      "key_observation": "Challenge involves fact without pleadings disadvantages Corporation."
    },
    {
      "id": "cr6",
      "text": "Issue not academic; vital for Corporation's future rights under statute.",
      "addresses_issue": "i6",
      "key_observation": "Repeated challenges could always claim mootness."
    },
    {
      "id": "cr7",
      "text": "s.58(s) in general words embraces innovations; not confined to 1948 contemplations.",
      "addresses_issue": "i1",
      "key_observation": "Statutes embrace future developments."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Corporation authorised under s.58(s) to send delegates; reasonable connection to public health promotion.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court erred in issuing writ; no interference with Corporation's exercise of power.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Resolution not invalid for budget reasons; writ petition lacked pleadings.",
      "resolves_issue": "i5",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "Issue not academic under Art.136.",
      "resolves_issue": "i6",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mayor, etc. of Westminster v. London and North Western Railway Company",
      "citation": "1905 A.C. 426",
      "treatment": "followed",
      "relevance": "Courts should not interfere with mode of acting if authorised by statute."
    }
  ],
  "statutes_cited": [
    {
      "name": "City of Nagpur Corporation Act, 1948",
      "sections": [
        "s.58(s)",
        "s.84",
        "s.88"
      ],
      "relevance": "s.58(s) authorises actions promoting public health including sending delegates; s.84 prohibits unbudgeted expenditure but may not invalidate resolution; s.88 allows budget transfers."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court allowed the appeal, holding that the Municipal Corporation had power under s.58(s) to send delegates, there was reasonable connection to public health, budget issues did not invalidate the resolution, and the High Court erred in issuing the writ.",
    "relief_granted": "Appeal allowed; High Court writ set aside.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "if what a Corporation proposes to do is what it had been authorised by its incorporating statute to do, it is not the business of a court to interfere with the mode in which the Corporation decides to act",
      "speaker": "court",
      "significance": "Principle limiting judicial interference in corporate statutory powers."
    },
    {
      "text": "by sending delegates to the Congress, the appellant Corporation would have acquired useful knowledge connected with public health which it could utilise later to promote public health at Nagpur.",
      "speaker": "court",
      "significance": "Core holding on s.58(s) authorisation."
    },
    {
      "text": "It was not a case where it could be said that the delegation proposed to be sent would have been of no benefit to the appellant Corporation at all",
      "speaker": "court",
      "significance": "Rejects High Court's scepticism on benefit."
    },
    {
      "text": "the High Court held that the appellant Corporation had acted honestly. It observed that the circumstances did not warrant the inference that the action of the Corporation was mala fide.",
      "speaker": "lower_court",
      "significance": "Admits no mala fides, supporting reversal."
    }
  ],
  "_case_id": "1962_379",
  "_label": 1,
  "_text_length": 11160,
  "_extracted_at": "2026-02-10T20:01:50.561215"
}