{
  "metadata": {
    "case_name": "Dault Ram v. State",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Criminal Appeal No. 126 of 1960",
    "date_of_judgment": "1962-01-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Dault Ram was working as a Patwari.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On August 19, 1958, appellant wrote a letter to the Tehsildar of Pathankot that on the previous day he had been set upon by two persons Hans Raj and Kans Raj who beat him severely and robbed him of certain of his official papers and some money, which was with him, partly belonging to him and partly to the Government. At the end of the letter, he stated that the letter was written for his information.",
      "type": "material",
      "date": "1958-08-19",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Tehsildar forwarded the letter to the Sub-Divisional Officer who sent it on to the police.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The police enquired into the facts and reported that the allegations in the letter were false.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant entered into some sort of compromise with Hans Raj and Kans Raj and wrote another letter saying that as they were his relatives and he had found the papers and money, the proceedings if any be dropped and the papers be consigned to the record room.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Tehsildar asked the police that a calendar be drawn up.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Police launched prosecution against appellant under s. 182 IPC, after trial found guilty and sentenced to three months rigorous imprisonment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant's appeal and revision in Punjab High Court dismissed in limine on November 23, 1959, in Criminal Revision No. 1445 of 1959.",
      "type": "procedural",
      "date": "1959-11-23",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant obtained special leave from Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant has served out his entire sentence.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a complaint in writing as required by s. 195 CrPC had been presented by the public servant concerned (Tehsildar) for taking cognizance of offence under s. 182 IPC, or whether the police could file a charge sheet directly.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No complaint in writing by the public servant concerned (Tehsildar) was presented as required by s. 195 CrPC.",
      "supporting_facts": [
        "f2",
        "f3",
        "f7"
      ],
      "legal_basis": "s. 195 CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "s. 195 CrPC complied with as when allegations disproved, letter of Superintendent of Police forwarded to Tehsildar who asked for a calendar; this paper filed along with charge sheet satisfies requirements.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "s. 195 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appellant moved Tehsildar (public servant concerned) with false averment of facts charging Hans Raj and Kans Raj with offences, anticipating action even if stated for information; second letter shows he anticipated action.",
      "addresses_issue": "i1",
      "key_observation": "Offence under s. 182 IPC complete when appellant moved Tehsildar believing action would be taken."
    },
    {
      "id": "cr2",
      "text": "s. 195 CrPC explicit: No court shall take cognizance of offence under ss. 172-188 IPC except on complaint in writing of public servant concerned or subordinate; absolute bar against court taking seisin except as provided.",
      "addresses_issue": "i1",
      "key_observation": "Tehsildar did not file complaint in writing; charge sheet by Station House Officer does not satisfy."
    },
    {
      "id": "cr3",
      "text": "Tehsildar's later request for calendar after police report does not constitute complaint in writing by public servant concerned as required.",
      "addresses_issue": "i1",
      "key_observation": "Cognizance wrongly assumed without complaint; trial without jurisdiction ab initio."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "For prosecution under s. 182 IPC, complaint in writing must be by public servant concerned (here Tehsildar); police charge sheet insufficient; trial vitiated for want of jurisdiction.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 182",
        "ss. 172 to 188"
      ],
      "relevance": "Offence under s. 182 requires complaint under s. 195 CrPC by public servant concerned; offence complete upon false information given to public servant with belief action would be taken."
    },
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "s. 195"
      ],
      "relevance": "No court shall take cognizance of offences under ss. 172-188 IPC except on written complaint of public servant concerned or subordinate; absolute bar."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; conviction and sentence set aside as trial court took cognizance without complaint in writing from Tehsildar as required by s. 195 CrPC; trial without jurisdiction ab initio.",
    "relief_granted": "Conviction quashed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"No Court shall take cognizance- (a) of any offence punishable under sections 172 to 188 of the Indian Penal Code, except on the complaint in writing of the public servant concerned, or of some other public servant to whom he is subordinate.\"",
      "speaker": "court",
      "significance": "Direct quote of s. 195 CrPC central to decision"
    },
    {
      "text": "The words \"no court shall take cognizance\" ... show that there is an absolute bar against the court taking seisin of the case except in the manner provided by the section.",
      "speaker": "court",
      "significance": "Explains mandatory nature of s. 195 CrPC"
    },
    {
      "text": "The trial was thus without jurisdiction ab initio and the conviction cannot be maintained.",
      "speaker": "court",
      "significance": "Core holding quashing conviction"
    }
  ],
  "_case_id": "1962_7",
  "_label": 1,
  "_text_length": 6206,
  "_extracted_at": "2026-02-10T19:56:27.973367"
}