{
  "metadata": {
    "case_name": "Commissioner of Income Tax, Kerala and Coimbatore v. Helen Rubber Industries, Ltd., Kottayam",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 466 of 1960",
    "date_of_judgment": "1962-01-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Messrs. Helen Rubber Industries, Ltd. is a Company, which was incorporated in the former State of Travancore with its registered office at Kottayam.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In the year 1941, the assessee Company granted a lease of the factory to certain persons for a period of 15 years. From that year, the rent and royalty received from the lessees were the only source of income.",
      "type": "background",
      "date": "1941",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Disputes having arisen, the lessees suspended payment from June 1946. Litigation followed but the dispute was settled by the assessee Company receiving Rs. 23,000/- odd in full satisfaction.",
      "type": "background",
      "date": "1946-06",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The year of account of the assessee Company is the Calendar year.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Before the extension of the Indian Income-tax Act, there was in force in Travancore State, the Travancore Income-tax Act, 1121 M. E. (Act XXIII of 1121 M. E.), which came into force on the first day of Chingom 1122 M. E. (August 17, 1946). The assessment year under the Travancore Act ended on the last day of Karkadakom, which corresponds to August 16, 1947.",
      "type": "background",
      "date": "1946-08-17",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The assessee Company declared losses in the account years 1946 (Rs. 4031-10-0, assessment year 1123 M.E. 17-8-1947 to 16-8-1948), 1947 (Rs. 6605-1-6, assessment year 1124 M.E. 17-8-1948 to 16-8-1949), and 1948 (Rs. 2604-13-9, assessment year 1125 M.E. 17-8-1949 to 16-8-1950). Total loss Rs. 13241-9-3.",
      "type": "material",
      "date": "1946-01-01 to 1948-12-31",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Indian Income-tax Act was extended to Travancore-Cochin by s. 3 of the Indian Finance Act, 1950.",
      "type": "procedural",
      "date": "1950-04-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The dispute is about the right of the assessee Company to carry forward the loss of the year 1946 under the provisions of the Travancore Act read with s. 24(2) of the Indian Income-tax Act and the Taxation Laws (Part B States) Removal of Difficulties Order, 1950 to the assessment year 1951-52 (year of account Calendar Year 1950).",
      "type": "disputed",
      "date": "1951-04-01 to 1952-03-31",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Income-tax Officer held that the loss of the year 1946 could not be carried forward to that year, since it had lapsed after two years under s. 32 of the Travancore Act, and s. 24(2) was not applicable, in view of paragraph 3 of the Order.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "The order of the Income-tax Officer was confirmed in appeal by the Appellate Assistant Commissioner and the Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The Tribunal was moved for a case, but declined to state one but the High Court called for a statement of the case under s. 66(2) and the question was decided in favour of the assessee Company.",
      "type": "procedural",
      "date": "1958-10-31",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "High Court of Kerala answered in favour of the respondent the question: Whether under the provisions of the Indian Income-tax Act the petitioner is entitled to carry forward the loss for a period of six years notwithstanding the fact that during the period when the loss had occurred, the law applicable was the Travancore Income-tax Act? High Court granted certificate under s. 66A(2).",
      "type": "procedural",
      "date": "1958-10-31",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The assessee Company was not represented at the hearing before this Court.",
      "type": "procedural",
      "date": "1962-01-16",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether under the provisions of the Indian Income-tax Act the assessee is entitled to carry forward the loss for a period of six years notwithstanding the fact that during the period when the loss had occurred, the law applicable was the Travancore Income-tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court was not right in the answer it gave. The loss of 1946 could not be carried forward since it had lapsed after two years under s. 32 of the Travancore Act, and s. 24(2) was not applicable in view of paragraph 3 of the Taxation Laws (Part B States) Removal of Difficulties Order, 1950.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Travancore Income-tax Act s.32; Taxation Laws (Part B States) Removal of Difficulties Order, 1950 para 3"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 32 of the Travancore Act was a reproduction of Indian s. 24(2) except for changes in dates corresponding to Malayalam calendar. Paragraph 3 of the Removal of Difficulties Order provided that losses prior to previous year for assessment year ending 31st March 1950 would be set off in the same manner, to the same extent, and up to the same year of assessment as it would have been had the State law continued in force.",
      "addresses_issue": "i1",
      "key_observation": "The law to apply to the loss of 1946 (previous year prior to 1-1-1949) is the Travancore Act, under which loss could be carried forward only for two years, lapsing before 1951-52 assessment."
    },
    {
      "id": "cr2",
      "text": "The previous year for assessment year ending 31st March 1950 was calendar year 1-1-1949 to 31-12-1949, to which Indian IT Act applies. Earlier years governed by Travancore Act via para 3.",
      "addresses_issue": "i1",
      "key_observation": "Loss of 1946 (assessment year 1123 M.E. 17-8-1947 to 16-8-1948) could be carried forward only to 1947 and 1948, up to assessment year 1125 M.E. (17-8-1949 to 16-8-1950), beyond which it lapsed."
    },
    {
      "id": "cr3",
      "text": "The Removal of Difficulties Order did not enlarge rights; it preserved State law rights without enlargement or curtailment. Cited Indore Malwa United Mills Ltd. v. CIT.",
      "addresses_issue": "i1",
      "key_observation": "High Court erred in thinking the Order enlarged rights to six years under Indian IT Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The assessee is not entitled to carry forward the 1946 loss for six years under Indian Income-tax Act s.24(2); governed by Travancore Act s.32 via Removal of Difficulties Order para 3, limited to two years carry forward, which had lapsed.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Indore Malwa United Mills Ltd. v. Commissioner of Income tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "The only right integration has given to an assessee is the right contained in para 3 of the Removal of Difficulties Order, 1950; if State law permitted carry forward, that right preserved under Indian IT Act, in same manner, extent and up to year as per State law."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 24(2)",
        "s. 66(2)",
        "s. 66A(2)"
      ],
      "relevance": "s.24(2) allowed carry forward of losses for six years (for losses after certain date); referenced but not applicable due to prior State law governance"
    },
    {
      "name": "Travancore Income-tax Act, 1121 M.E. (Act XXIII of 1121 M.E.)",
      "sections": [
        "s. 32"
      ],
      "relevance": "Reproduction of Indian s.24(2) with adjusted dates; governed carry forward of 1946 loss for only two years"
    },
    {
      "name": "Indian Finance Act, 1950",
      "sections": [
        "s. 3",
        "s. 13(1)",
        "s. 12"
      ],
      "relevance": "Extended Indian IT Act to Part B States like Travancore-Cochin from 1-4-1950; s.13(1) ceased prior State laws except for pre-1950-51 assessments; s.12 enabled Removal of Difficulties Order"
    },
    {
      "name": "Taxation Laws (Part B States) Removal of Difficulties Order, 1950",
      "sections": [
        "para 3"
      ],
      "relevance": "Losses prior to previous year for 1950-51 assessment to be set off as per State law, in same manner, extent, up to same year as if State law continued"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal filed by the Commissioner of Income Tax succeeds and is allowed. The judgment and order of the Kerala High Court dated October 31, 1958 answering the question in favour of the assessee is reversed.",
    "relief_granted": "None specified beyond allowing appeal",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Carry-forward and set off of previous losses-where in any previous year prior to the previous year for the assessment for the year ending on the 31st day of March 1950, an assessee has sustained a loss... such loss would be so set off... in the same manner, to the same extent, and up to the same year of assessment as it would have been set off had the State law continued to be in force.\"",
      "speaker": "court",
      "significance": "Core provision of Removal of Difficulties Order para 3 determining application of State law limits"
    },
    {
      "text": "\"The High Court, with all due respect, was not right in thinking that the Removal of Difficulties Order, 1950 was meant to enlarge the rights of the new assessees... The rights were neither enlarged nor curtailed.\"",
      "speaker": "court",
      "significance": "Rejects High Court's interpretation; clarifies no enlargement of carry-forward period"
    }
  ],
  "_case_id": "1962_4",
  "_label": 1,
  "_text_length": 11736,
  "_extracted_at": "2026-02-10T19:56:31.916418"
}