{
  "metadata": {
    "case_name": "Narain Singh v. State",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Criminal Appeal No. 218 of 1959",
    "date_of_judgment": "1962-08-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On October 31, 1958, in the evening, Narain Singh and his three nephews were irrigating their field when Bachan Singh diverted the flow of water into his own field.",
      "type": "material",
      "date": "1958-10-31",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Narain Singh and his nephews were enraged, leading to a quarrel with Bachan Singh, and they made a murderous assault on him.",
      "type": "disputed",
      "date": "1958-10-31",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Prosecution alleged Mehar Singh armed with spear, Pakhar Singh with kaholi, Mewa Singh with salang, Narain Singh with stick.",
      "type": "disputed",
      "date": "1958-10-31",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Complaint lodged with police; Bachan Singh removed to Civil Hospital, Ludhiana.",
      "type": "procedural",
      "date": "1958-10-31",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Sub-Inspector recorded Bachan Singh's statement; First Class Magistrate recorded dying declaration on evening of November 2, 1958.",
      "type": "procedural",
      "date": "1958-11-02",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Bachan Singh died on November 3, 1958.",
      "type": "material",
      "date": "1958-11-03",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Narain Singh's defense: He was alone, objected to water diversion, Bachan caught hold, threw him down, attempted to strangle; Narain used small kirpan in self-defense causing a couple of injuries.",
      "type": "admitted",
      "date": "1958-10-31",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Pakhar Singh and Mewa Singh denied presence at scene.",
      "type": "background",
      "date": "1958-10-31",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Mehar Singh claimed he was present, came from khal on alarm, unarmed, rescued Narain, did not injure Bachan.",
      "type": "background",
      "date": "1958-10-31",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Narain Singh and Mehar Singh had injuries: Narain six contused injuries; Mehar one incised and four abraded contusions, noticed on medical exam.",
      "type": "material",
      "date": "1958-10-31",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Prosecution witness Jagir Singh varied story from original complaint.",
      "type": "disputed",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Kaka, claimed eye-witness, did not support prosecution.",
      "type": "disputed",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Hakku not examined by prosecutor, tendered for cross.",
      "type": "procedural",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Johri, not in complaint, examined by prosecutor.",
      "type": "disputed",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Two dying declarations of Bachan Singh tendered: one by Investigating Officer, one by Magistrate.",
      "type": "disputed",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Bachan had four incised injuries: three on chest, one on ring finger left; could be caused by spear or kirpan, not salang or kaholi.",
      "type": "material",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Sessions Judge: Prosecution evidence unreliable; dying declarations unreliable; acquitted nephews; convicted Narain under s.304 Part II based on his statement, held exceeded self-defense.",
      "type": "procedural",
      "date": "1959",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "High Court upheld conviction under s.304 Part II, reduced sentence to 3 years RI.",
      "type": "procedural",
      "date": "1959-09-08",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Narain Singh caused injuries to Bachan Singh with a kirpan and exceeded the right of private defence of person.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the statement of the accused under s.342 CrPC can be dissected to convict him by accepting admission but rejecting explanation of self-defense.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Narain acted in exercise of right of self-defence; Bachan threw him down and attempted to strangle; used kirpan causing injuries; others not involved or unarmed.",
      "supporting_facts": [
        "f7",
        "f9",
        "f10"
      ],
      "legal_basis": "Right of private defence under Indian Penal Code"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Narain Singh and nephews in common intention assaulted Bachan with weapons including stick by Narain.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "s.302 read with s.34 IPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Prosecution evidence unreliable; Sessions and High Court rejected it; injuries caused by Narain's kirpan per his statement, but nephews not involved.",
      "addresses_issue": "i1",
      "key_observation": "Courts accepted case not put by prosecution, relying only on accused's s.342 statement."
    },
    {
      "id": "cr2",
      "text": "Under s.342 CrPC, statement to explain prosecution evidence; cannot dissect to pick incriminative part ignoring explanation; must consider entirety.",
      "addresses_issue": "i2",
      "key_observation": "Admission with self-defense explanation cannot be used divorced from explanation."
    },
    {
      "id": "cr3",
      "text": "Prosecution failed to establish guilt; burden on accused only if prosecution case made out; here plea is composite, court cannot assume facts not proved and reject justification without evidence.",
      "addresses_issue": "i1",
      "key_observation": "If reasonable apprehension of strangulation, right of defence extends to causing death."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Accused's statement under s.342 CrPC cannot be partially accepted for conviction while rejecting self-defense explanation; prosecution evidence insufficient.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No conviction sustainable as prosecution case not proved and self-defense plea cannot be rejected without evidence disproving it.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "304 Part II",
        "34"
      ],
      "relevance": "Charged under 302/34; convicted under 304 Part II; right of private defence exception considered"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "342"
      ],
      "relevance": "Statement of accused used for conviction by lower courts; Supreme Court held cannot be dissected"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court acquitted Narain Singh of offence under s.304 Part II IPC, set aside conviction and sentence by Sessions Court and High Court.",
    "relief_granted": "Acquittal",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is not open to the Court to dissect the statement and to pick out a part of the statement which may be incriminative, and then to examine whether the explanation furnished by the accused for his conduct is supported by the evidence on the record.",
      "speaker": "court",
      "significance": "Core holding on use of s.342 CrPC statement"
    },
    {
      "text": "There can be no doubt that if a person reasonably apprehends that his assailant is attempting to strangulate him, exercise of the right of defence of person extends even to causing death of the assailant.",
      "speaker": "court",
      "significance": "On extent of private defence right"
    }
  ],
  "_case_id": "1962_60",
  "_label": 1,
  "_text_length": 12578,
  "_extracted_at": "2026-02-10T19:57:03.596028"
}