{
  "metadata": {
    "case_name": "Appellant v. Respondents",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Civil Appeal No. 586 of 1962",
    "date_of_judgment": "1962-10-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "There is a country liquor shop in Dumka Town. Originally one Hari Prasad Sah was the licensee of that shop, but his licence was cancelled by the Excise Authorities.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "A notice was issued inviting applications for the settlement of the shop. One Jadu Manjhi, along with others, applied for the licence.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On March 22, 1961, for the settlement of the shop lots were drawn by the Deputy Commissioner, Santal Parganas, and the draw was in favour of Jadu Manjhi.",
      "type": "material",
      "date": "1961-03-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Hari Prasad filed against the order of the Deputy Commissioner before the Commissioner of the Santal Parganas and it was dismissed. He moved the Board of Revenue, Bihar, and obtained a stay of the settlement.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On July 13, 1961, the Board of Revenue dismissed the petition filed by Hari Prasad Sah.",
      "type": "procedural",
      "date": "1961-07-13",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Meanwhile, Jadu Manjhi died and when the fact was brought to the notice of the Deputy Commissioner, he decided to hold a fresh lot on June 19, 1961 and the lot was drawn in favour of the appellant.",
      "type": "material",
      "date": "1961-06-19",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Hari Prasad Sah filed a petition in the revenue court and obtained a stay of the settlement of the shop in favour of the appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Meanwhile one Basantilal Bhagat filed an application under Art. 226 in the High Court at Patna and obtained an interim stay but he withdrew his application on September 8, 1961.",
      "type": "procedural",
      "date": "1961-09-08",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On September 11, 1961, the appellant furnished security and the shop was settled on him and a licence was issued in his name.",
      "type": "material",
      "date": "1961-09-11",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "After the expiry of the period of the said licence, it was renewed in his favour for 1962.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On June 19, 1961, one Phudan Manjhi, son of Jadu Manjhi, filed a petition before the Deputy Commissioner for substituting his name in the place of his father on the basis of the lot drawn in favour of his father.",
      "type": "material",
      "date": "1961-06-19",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The Deputy Commissioner rejected the application of Phudan Manjhi.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Phudan Manjhi preferred an appeal against that order to the Commissioner of Excise and the Commissioner remanded the case to the Deputy Commissioner to consider the fitness of Phudan Manjhi to get the licence and to consider whether the provisions of r. 145 of the Excise Manual, Vol. II, would apply.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "One Bhagwan Rajak, who was an applicant before the Deputy Commissioner, filed an application before the Commissioner alleging that there should have been a fresh advertisement for the settlement of the shop according to cl. 13 of r.101 of the Excise Manual- Vol. III.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On March 13, 1962, the Commissioner allowed Bhagwan Rajak's application and directed the Deputy Commissioner to take steps for a fresh settlement of the shop in accordance with rules.",
      "type": "procedural",
      "date": "1962-03-13",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Against the said orders the appellant filed petitions before the Board of Revenue and the said Board, by its order dated May 30, 1962, dismissed the petitions and directed that unless the Deputy Commissioner came to a definite conclusion that Phudan Manjhi was unfit to hold the licence, he should be selected as a licensee in accordance with r. 145 of the Excise Manual, Vol. II.",
      "type": "procedural",
      "date": "1962-05-30",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The result of the said proceedings is that the appellants licence was cancelled and the Deputy Commissioner was directed to hold a fresh settlement giving a preferential treatment to Phudan Manjhi.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "The appellant filed a petition under Art. 226 of the Constitution, in the High Court at Patna to quash the said orders. Neither Phudan Manjhi nor Bhagwan Rajak, whose favour the Board of Revenue decided the petition, was made a party.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "It is represented that pursuant to the orders of the Board of Revenue the Deputy Commissioner made an enquiry, came to the conclusion that Phudan Manjhi was not fit to be selected for the grant of a licence, and that he has not yet made a fresh settlement in view of the pendency of the present appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "The High Court of Judicature at Patna rejecting in limine an application for a writ of certiorari filed under Art. 226 on July 3, 1962.",
      "type": "procedural",
      "date": "1962-07-03",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in a writ in the nature of certiorari filed under Art. 226 of the Constitution the party or parties in whose favour a tribunal or authority had made an order, which is sought to be quashed, is or are necessary party or parties.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Board of Revenue acted without jurisdiction in directing a fresh settlement, as neither r. 101 nor r. 145 of Excise Manual would apply.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Board of Revenue acted without jurisdiction in directing a fresh settlement, as neither r. 101 nor r. 145 of Excise Manual would apply to the facts of the case: r. 101 does not apply as no licence was cancelled for malpractices, and r. 145 is not attracted as Jadu Manjhi was not a licensee since no licence was issued in his favour.",
      "supporting_facts": [
        "f3",
        "f6",
        "f9"
      ],
      "legal_basis": "r. 101 Excise Manual Vol. III, cl. 13; r. 145 Excise Manual Vol. II"
    },
    {
      "id": "pa2",
      "text": "In such a writ the said tribunal or authority is the only necessary party and the parties in whose favour the said tribunal or authority made an order or created rights are not necessary parties but may at best be only proper parties.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Preliminary objection that, as Phudan Manjhi and Bhagwan Rajak, who were necessary parties to the writ petition, were not made parties, the High Court was fully justified in dismissing the petition in limine.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": "Art. 226 Constitution; principles of natural justice"
    },
    {
      "id": "ra2",
      "text": "Whether or not the authority concerned is necessary party, the said parties would certainly be necessary parties, for otherwise the High Court would be deciding a case behind the back of the parties that would be affected by its decision.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "A necessary party is one without whom no order can be made effectively; a proper party is one in whose absence an effective order can be made but whose presence is necessary for a complete and final decision.",
      "addresses_issue": "i1",
      "key_observation": "Principle on necessary and proper parties."
    },
    {
      "id": "cr2",
      "text": "Certiorari lies to remove for the purpose of quashing the proceedings of inferior courts of record or other persons or bodies exercising judicial or quasi-judicial functions. A certiorari lies only in respect of a judicial or quasi-judicial act as distinguished from an administrative act.",
      "addresses_issue": "i1",
      "key_observation": "Nature of writ of certiorari; test from Lord Atkin in King v. Electricity Commissioners."
    },
    {
      "id": "cr3",
      "text": "The tribunal or authority is a necessary party. The parties in whose favour the order is made are also necessary parties, as the High Court cannot vacate the order without them being before it.",
      "addresses_issue": "i1",
      "key_observation": "Successful parties before tribunal are necessary parties to writ petition."
    },
    {
      "id": "cr4",
      "text": "In the present case Phudan Manjhi and Bhagwan Rajak were parties before the Commissioner as well as before the Board of Revenue. They succeeded and the orders were in their favour. They were necessary parties.",
      "addresses_issue": "i1",
      "key_observation": "Appellant struck them out and did not apply to implead; petition incompetent."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In a writ of certiorari not only the tribunal or authority whose order is sought to be quashed but also parties in whose favour the said order is issued are necessary parties.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The petition filed by the appellant was incompetent and was rightly rejected by the High Court as necessary parties were not impleaded.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "The King v. The Electricity Commissioner",
      "citation": "1924 1 K. B. 171",
      "treatment": "followed",
      "relevance": "Classic test of judicial act by Lord Atkin LJ."
    },
    {
      "case_name": "The King v. London County Council",
      "citation": "1931 2 K. B. 215, 243",
      "treatment": "followed",
      "relevance": "Dissection of concept of judicial act by Lord Justice Slesser."
    },
    {
      "case_name": "Ahmedalli v. M. D. Lalkaka",
      "citation": "A.I.R. 1954 Bom. 33",
      "treatment": "followed",
      "relevance": "Tribunal and all parties affected by order are necessary parties."
    },
    {
      "case_name": "Kanglu Baula v. Chief Executive Officer",
      "citation": "A.I.R. 1955 Nag. 49",
      "treatment": "followed",
      "relevance": "Petition dismissed as persons declared elected not joined as parties."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Writ of certiorari filed under Art. 226; jurisdiction of High Court."
    },
    {
      "name": "Excise Manual",
      "sections": [
        "r. 145 Vol. II",
        "r. 101 Vol. III, cl. 13"
      ],
      "relevance": "Rules on settlement of liquor shop licence; applicability disputed."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court accepted the preliminary objection, held that the writ petition was incompetent for non-impleadment of necessary parties Phudan Manjhi and Bhagwan Rajak, upheld the High Court's rejection in limine, and dismissed the appeal without expressing view on merits.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A necessary party is one without whom no order can be made effectively a proper party is one in whose absence an effective order can be made but whose presence is necessary for a complete and final decision on the question involved in the proceeding.",
      "speaker": "court",
      "significance": "Defines necessary vs proper parties."
    },
    {
      "text": "To summarize in a writ of certiorari not only the tribunal or authority whose order is sought to be quashed but also parties in whose favour the said order is issued are necessary parties.",
      "speaker": "court",
      "significance": "Core holding of the judgment."
    },
    {
      "text": "Wherever any body of persons having legal authority to determine questions affecting the rights of subjects, and having the duty to act judicially act in excess of their legal authority they are subject to the controlling jurisdiction of the Kings Bench Division exercised in these writs.",
      "speaker": "court",
      "significance": "Test for judicial act from precedent."
    }
  ],
  "_case_id": "1962_219",
  "_label": 0,
  "_text_length": 19933,
  "_extracted_at": "2026-02-10T19:59:22.891294"
}