{
  "metadata": {
    "case_name": "Karsan v. State",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Criminal Appeal No. 223 of 1959",
    "date_of_judgment": "1962-01-24"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant and two others convicted by Additional Sessions Judge, Gohilwad, under ss. 302 and 201 IPC for murder of Kanji; sentenced to life imprisonment under s.302 and seven years rigorous imprisonment under s.201, sentences concurrent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "High Court set aside conviction of Nanji Ravji but upheld convictions and sentences of appellant and Karamshi Bhawan.",
      "type": "procedural",
      "date": "1959-04-14",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Deceased Kanji had illicit connection with Shrimati Shantu, sister of Karamshi, and followed Smt. Baghu, sister of appellant.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Five days before occurrence, appellant Karsan, Karamshi, Nanji and Gumansinh (approver) met and decided to murder Kanji; Gumansinh to decoy deceased to Vadi of appellant.",
      "type": "material",
      "date": null,
      "source": "approver"
    },
    {
      "id": "f5",
      "text": "At sunset on March 19, 1958, deceased decoyed to place and murdered by appellant with blows from sharp cutting instrument called Dharia.",
      "type": "material",
      "date": "1958-03-19",
      "source": "approver"
    },
    {
      "id": "f6",
      "text": "Dead body wrapped in scarf of deceased, carried by appellant to dry bed of river, buried in pit.",
      "type": "material",
      "date": "1958-03-19",
      "source": "approver"
    },
    {
      "id": "f7",
      "text": "On March 26, 1958, brother of deceased reported disappearance to police, suspected three uncles of appellant.",
      "type": "procedural",
      "date": "1958-03-26",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Appellant and other accused taken into custody by police.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "One accused in custody went to village, sought help of Shamji and Manilal (PWs), confessed to them; they reported to police.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "On March 31, 1958, Gumansinh and Karamshi made confessions recorded by Magistrate.",
      "type": "procedural",
      "date": "1958-03-31",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Between March 26 and March 31, 1958, recoveries of various articles made.",
      "type": "material",
      "date": "1958-03-26 to 1958-03-31",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "At instance of appellant, dead body (trunk) and head recovered from distant well.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "At instance of Nanji on March 28, 1958, scarf discovered in pit where dead body allegedly first buried; scarf had hairs similar to those of appellant and deceased per Chemical Examiner.",
      "type": "material",
      "date": "1958-03-28",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "On March 27, 1958, at instance of appellant, silver buttons stained with human blood and small stick like button belonging to deceased discovered from appellant's field.",
      "type": "material",
      "date": "1958-03-27",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "High Court rejected Karamshi's confession as not voluntary.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "High Court acquitted Nanji due to no corroboration of approver's statement regarding him; place of burial not discovered at his instance; production of stick, shirt, trousers inconsequential; oral evidence contrary to medical evidence.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Pit in dry river bed dug up; no dead body found, only ulna bone and heel of human foot.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Dharia (cutting instrument) recovered but disregarded by High Court.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether evidence of approver is corroborated in material particulars connecting appellant with the offence, sufficient for conviction under ss. 302 and 201 IPC.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Sufficiency of recoveries (dead body, blood-stained buttons, scarf with hairs) to connect appellant with murder.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Approver's evidence, even if accepted as true, not corroborated in material particulars connecting appellant with offence; contradicted as body not found in pit, only bone and heel found.",
      "supporting_facts": [
        "f6",
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No evidence how/when body removed from pit, dismembered, thrown into well.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Scarf recovery innocuous; not shown to belong to appellant but to his father; Chemical Examiner's evidence on hairs inadmissible under s.45 Evidence Act, merely resemblance, not expert opinion.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "s.45 Evidence Act"
    },
    {
      "id": "pa4",
      "text": "Recovery of trunk and head shows only knowledge of location, infers s.201 offence, not s.302.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Approver's testimony reliable; corroborated by discoveries: dead body and head from well at appellant's instance, blood-stained buttons at his instance, scarf from pit with hairs of appellant and deceased.",
      "supporting_facts": [
        "f12",
        "f14",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Law requires corroboration of material parts of accomplice's story connecting accused with crime to satisfy reasonable minds of truthfulness; may be circumstantial.",
      "addresses_issue": "i1",
      "key_observation": "Corroboration need not be direct evidence of commission."
    },
    {
      "id": "cr2",
      "text": "Approver's confessional statement connects appellant: dharia blows (disregarded), body tied in pania scarf (scarf recovered with hairs), appellant carried body to pit, told head thrown in well; though some contradictions, other circumstances corroborate.",
      "addresses_issue": "i1",
      "key_observation": "Recoveries somewhat contradictory but other evidence connects."
    },
    {
      "id": "cr3",
      "text": "Pointing out dead body alone insufficient for murder but with blood-stained buttons (presumption of participation per Wasin Khan), scarf belonging to appellant with hairs of both (microscopic exam possible per medical jurisprudence).",
      "addresses_issue": "i2",
      "key_observation": "Three facts connect: body pointing, buttons, scarf hairs."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Approver's evidence sufficiently corroborated by circumstances connecting appellant with commission of offence; conviction under ss.302 and 201 upheld.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Vemireddy Satyanarayan Reddy v. The State of Hyderabad",
      "citation": null,
      "treatment": "followed",
      "relevance": "Corroboration of accomplice evidence need not be direct; circumstantial sufficient if satisfies reasonable minds."
    },
    {
      "case_name": "Wasin Khan v. The State of Uttar Pradesh",
      "citation": null,
      "treatment": "followed",
      "relevance": "Recent unexplained possession of stolen property presumes participation in robbery/murder, depending on circumstances."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "201"
      ],
      "relevance": "Conviction for murder and causing disappearance of evidence."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "45"
      ],
      "relevance": "Admissibility of expert opinion on hair similarity questioned."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by special leave, upheld High Court's conviction and sentences of appellant under ss.302 and 201 IPC, finding approver's evidence sufficiently corroborated by recoveries of body, blood-stained buttons, and scarf with hairs.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "What the law requires in the case of an accomplices evidence is that there should be such corroboration of the material Parts of the story connecting the accused with the crime as will satisfy reasonable minds that the approver can be regarded as a truthful witness.",
      "speaker": "court",
      "significance": "States test for corroboration of accomplice evidence."
    },
    {
      "text": "Thus, we have besides the evidence of the approver three important facts which connect the appellant with the commission of the offence. His pointing out the dead body, his pointing out the silver buttons of the deceased which were stained with human blood and the presence of his hairs on a pania scarf on which there were the hairs of the deceased also.",
      "speaker": "court",
      "significance": "Summarizes key corroborative circumstances upholding conviction."
    }
  ],
  "_case_id": "1962_319",
  "_label": 0,
  "_text_length": 11016,
  "_extracted_at": "2026-02-10T20:01:06.262845"
}