{
  "metadata": {
    "case_name": "Appellant v. State",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur J."
    ],
    "case_number": "Criminal Appeal No. 167 of 1961",
    "date_of_judgment": "1962-01-18"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Information received by Police Superintendent Kanga that premises at block No. 6, plot No. 144 Shivaji Park, Bombay were being used as a brothel and appellant was supplying girls for prostitution.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Police laid a trap: sent Manmohan Anandji Mehta (to ask for girl) and Prabhakar K. Loke (panch witness); Sub-Inspector Purohit gave two marked 100 rupees notes to Mehta.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Mehta and Loke went to appellant's house, asked for girls; appellant showed Kamal Govind (Rs.100) and Indu Bapurao Salunke (Rs.50); Mehta selected Kamal, paid one marked 100 rupees note to appellant who put it under her blouse.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Mehta and Kamal went to kitchen, undressed, found naked in compromising position.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "On signal, Superintendent Kanga and Sub-Inspector Purohit entered; Loke directed to kitchen; police found Mehta and Kamal naked; they dressed; Mehta returned second 100 rupees note to Kanga.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Woman panch searched appellant, recovered marked 100 rupees note from under her blouse; male members were in adjoining passage.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Appellant tried by Additional Chief Presidency Magistrate, Esplanade, Bombay for offences under ss.3, 4(1) of Suppression of Immoral Traffic in Women and Girls Act, 1956; acquitted.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Bombay High Court in Criminal Appeal No. 906 of 1961 set aside acquittal on September 29 and October 11, 1961; sentenced appellant to one year rigorous imprisonment and ordered eviction from premises.",
      "type": "procedural",
      "date": "1961-09-29",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "High Court accepted testimony of Loke, Mehta, Kanga, Purohit regarding payment, recovery, and events in kitchen.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the prosecution evidence, particularly regarding payment and recovery of marked currency during trap and search, is reliable given absence of woman search witness production and possible presence of men during search.",
      "framed_by": "appellant"
    },
    {
      "id": "i2",
      "text": "Whether High Court in appeal had power to order eviction of appellant from premises under s.18 of the Act.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Evidence of recovery should not be accepted as woman panch not produced; search of woman invalid if men present, per ss.52,103 CrPC emphasizing decency; no evidence men left hall.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "ss.52, 103 CrPC; Purvez Ardeshir Poonawalla v. State of Bombay; Malak Khan v. Emperor"
    },
    {
      "id": "pa2",
      "text": "High Court could not order eviction as power under s.18 Act only for Magistrate; appellate court powers limited under s.423 CrPC to reverse acquittal, order retrial etc., not eviction.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s.18 Suppression of Immoral Traffic Act; s.423 CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Testimony of Mehta, Loke, police officers corroborated; payment proved independently; High Court accepted evidence.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Testimony of Mehta and Loke corroborated by police officers Kanga and Purohit who found Mehta and Kamal naked in compromising position; recovery by woman panch deposed by Purohit, Kanga, Loke.",
      "addresses_issue": "i1",
      "key_observation": "High Court accepted Loke's testimony on payment; no reason to depart."
    },
    {
      "id": "cr2",
      "text": "Precedents on search witnesses not directly applicable as payment proved by accepted evidence of Mehta to appellant before girl went for prostitution; recovery even if flawed does not disprove payment.",
      "addresses_issue": "i1",
      "key_observation": "Trap reprehensible, especially using student Loke and agent Mehta, but evidence credible."
    },
    {
      "id": "cr3",
      "text": "High Court convicting under s.3 Act has power under s.18(1) proviso to order eviction without further notice.",
      "addresses_issue": "i2",
      "key_observation": "s.18 expressly authorizes court convicting under s.3 or s.7 to pass eviction orders."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Payment of Rs.100 proved; appellant guilty of offences under ss.3, 4(1) of the Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court had jurisdiction to order eviction upon conviction under s.3.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Purvez Ardeshir Poonawalla v. State of Bombay",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Emphasized necessity of producing search witnesses under s.103 CrPC, but not directly applicable here."
    },
    {
      "case_name": "Malak Khan v. Emperor",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Presence of search witnesses desirable; absence weakens evidence, but not applicable as payment independently proved."
    },
    {
      "case_name": "Brannan v. Peek",
      "citation": null,
      "treatment": "referred",
      "relevance": "Police should not send persons to commit offence to detect another; analogy to aiding prostitution."
    }
  ],
  "statutes_cited": [
    {
      "name": "Suppression of Immoral Traffic in Women and Girls Act, 1956",
      "sections": [
        "s.3",
        "s.4(1)",
        "s.7",
        "s.18"
      ],
      "relevance": "Offences of keeping brothel, living on prostitution earnings, procuring; s.18 empowers convicting court to order eviction."
    },
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "s.52",
        "s.103",
        "s.423"
      ],
      "relevance": "Search procedures emphasizing decency; appellate powers."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Bombay High Court's reversal of acquittal, conviction under ss.3, 4(1) of the Act, sentence of one year rigorous imprisonment, and eviction order from premises.",
    "relief_granted": "None to appellant; conviction and eviction affirmed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The testimony of Manmohan Anandji Mehta and Loke by itself may not, in the circumstances of the case, be of much value but their testimony receives corroboration and thus gives credence to the prosecution case.",
      "speaker": "court",
      "significance": "Explains acceptance of trap evidence due to corroboration."
    },
    {
      "text": "It cannot be too strongly emphasised that it is wholly wrong for a police officer or any other person to be sent to commit an offence in order that an offence by another person may be detected.",
      "speaker": "court",
      "significance": "Criticism of police trap methods, quoting Brannan v. Peek."
    },
    {
      "text": "A court convicting a person of any offence under section 3 or section 7 may pass orders under sub-section (1) without further notice to such person.",
      "speaker": "court",
      "significance": "Justifies High Court's eviction power under s.18 Act."
    }
  ],
  "_case_id": "1962_101",
  "_label": 0,
  "_text_length": 11863,
  "_extracted_at": "2026-02-10T19:57:54.361695"
}