{
  "metadata": {
    "case_name": "Durga Prasad & Anr. v. Official Liquidator of the Banaras Bank Ltd.",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 569 of 1960",
    "date_of_judgment": "1962-12-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Banaras Bank Ltd. was directed to be wound up by order of the Allahabad High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "A committee of inspection was appointed under s. 178-A of the Indian Companies Act, 1913 to act with the Official Liquidator, and Durga Prasad was one of the members.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Official Liquidator advertised for sale two houses which formed part of the assets of the Bank.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Roshan Lal made an offer to purchase the two houses for Rs. 18,000/-, which was accepted by the Official Liquidator and sanctioned by the Court, and the houses were sold to Roshan Lal on August 2, 1941.",
      "type": "material",
      "date": "1941-08-02",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Roshan Lal transferred the houses to Durga Prasad reciting in the deed that Durga Prasad was the real owner and that the sale deed from the Official Liquidator was obtained benami for Durga Prasad.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On learning about the conveyance, the Official Liquidator moved the High Court of Allahabad for an order declaring the sale null and void and directing Durga Prasad to surrender and retransfer the houses to the Bank.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The High Court held that the sale deed was obtained by Durga Prasad who was the real purchaser, that he had suppressed his interest, and that being a member of the committee of inspection, he occupied the position of a trustee and was precluded from buying the property of the Bank, and directed Durga Prasad to convey the houses to the Official Liquidator.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The High Court's order was confirmed in appeal under cl. 10 of the Letters Patent by a Division Bench in Special Appeal No. 214 of 1956, judgment dated September 9, 1958.",
      "type": "procedural",
      "date": "1958-09-09",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The High Court certified the case under Art. 133(1) of the Constitution for appeal to the Supreme Court, observing that it involved a claim respecting property of value not less than Rs. 20,000/-, relying on Shri Deoki Nandan v. State of Uttar Pradesh.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court had jurisdiction to grant a certificate under Art. 133(1)(a) of the Constitution without certifying that the appeal involved a substantial question of law, in a case where the Division Bench confirmed a single judge's judgment.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Durga Prasad, as a member of the committee of inspection, occupied the position of a trustee and was precluded from purchasing the Bank's property benami.",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Requested that in any event special leave to appeal under Art. 136 of the Constitution be granted.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Article 136 of the Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The appeal is incompetent, for the High Court had no jurisdiction to grant the certificate under Art. 133(1)(a) of the Constitution without certifying that the appeal involved some substantial question of law.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Article 133(1)(a) of the Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In Deoki Nandan v. State of Uttar Pradesh, the Allahabad High Court held that the words 'the Court immediately below' in Art. 133(1) must be a court other than the High Court, and a single judge is not subordinate; but appeal from Division Bench lies as of right if property value exceeds Rs. 20,000/- without substantial question of law.",
      "addresses_issue": "i1",
      "key_observation": "This contention must succeed."
    },
    {
      "id": "cr2",
      "text": "Cited Toolsey Persaud Bhuckt v. Benayek Misser where Privy Council required substantial question of law for certification from Division Bench appeal under Letters Patent.",
      "addresses_issue": "i1",
      "key_observation": "Single judge of High Court trying original proceeding is court immediately below Division Bench."
    },
    {
      "id": "cr3",
      "text": "Cited Probhawati Kunwar v. Panmal Lodha where Calcutta High Court held appeal to Privy Council cannot be certified without substantial question of law when Division Bench confirms single judge.",
      "addresses_issue": "i1",
      "key_observation": "Similar to present case."
    },
    {
      "id": "cr4",
      "text": "In Ladli Prasad Jaiswal v. Karnal Distillery Co. Ltd., this Court held single judge in second appeal under s.100 CPC is court immediately below Division Bench under Letters Patent; concession made that single judge in original jurisdiction is also court immediately below.",
      "addresses_issue": "i1",
      "key_observation": "Expression 'Court immediately below' does not mean subordinate court; appeal cannot be entertained without certification of substantial question of law."
    },
    {
      "id": "cr5",
      "text": "Having regard to all circumstances, not a fit case for special leave under Art. 136.",
      "addresses_issue": "i1",
      "key_observation": "Appeal dismissed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A Division Bench of the High Court confirming judgment of single judge cannot certify appeal under Art. 133(1)(a) without certifying substantial question of law, as single judge is the court immediately below.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shri Deoki Nandan v. State of Uttar Pradesh",
      "citation": "A.I.R. 1959 All. 15",
      "treatment": "referred",
      "relevance": "Allahabad High Court view on Art. 133(1) for appeals from Division Bench dismissing writ appeal"
    },
    {
      "case_name": "Toolsey Persaud Bhuckt v. Benayek Misser",
      "citation": "1896 L.R. 28 I.A. 102",
      "treatment": "followed",
      "relevance": "Privy Council required substantial question of law for certification from Letters Patent appeal"
    },
    {
      "case_name": "Probhawati Kunwar v. Panmal Lodha",
      "citation": "1941 45 Cal. WN. 1002",
      "treatment": "followed",
      "relevance": "Calcutta High Court: no certification without substantial question when Division Bench confirms single judge"
    },
    {
      "case_name": "Ladli Prasad Jaiswal v. The Karnal Distillery Company Ltd.",
      "citation": "1964 Vol. I S.C.R. 270",
      "treatment": "followed",
      "relevance": "Supreme Court: single judge is court immediately below Division Bench under Art. 133(1)(a)"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Companies Act, 1913",
      "sections": [
        "s. 178-A"
      ],
      "relevance": "Appointment of committee of inspection"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(a)",
        "Article 136",
        "Article 226"
      ],
      "relevance": "Certification for appeal; special leave; writ jurisdiction"
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "s. 100"
      ],
      "relevance": "Second appeal jurisdiction of single judge"
    },
    {
      "name": "Code of Civil Procedure, 1882",
      "sections": [
        "s. 696"
      ],
      "relevance": "Terms identical to Art. 133(1) for Privy Council appeals"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal was held incompetent as the High Court lacked jurisdiction to grant certificate under Art. 133(1)(a) without certifying substantial question of law; special leave under Art. 136 denied; appeal dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In our view this contention must succeed.\"",
      "speaker": "court",
      "significance": "Court agrees appeal incompetent"
    },
    {
      "text": "\"the expression Court immediately below used in Art. 133(1)(a) does not mean Court subordinate to the High Court.\"",
      "speaker": "court",
      "significance": "Key interpretation distinguishing subordination from immediate appeal court"
    },
    {
      "text": "\"The appeal cannot accordingly be entertained.\"",
      "speaker": "court",
      "significance": "Dismissal on jurisdictional grounds"
    }
  ],
  "_case_id": "1962_280",
  "_label": 0,
  "_text_length": 6890,
  "_extracted_at": "2026-02-10T20:00:09.134209"
}