{
  "metadata": {
    "case_name": "Lodna Colliery Co. Ltd. v. Proprietors of land in C.S. Khatian No. 611",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal J."
    ],
    "case_number": "Civil Appeal No. 405 of 1956",
    "date_of_judgment": "1962-01-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The plaintiffs are the proprietors of the land in suit in C. S. Khatian No. 611 and Sub-Khatians Nos. 612 and 613 of village Sripur in Touzi No. 2597 of the Burdwan Collectorate.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Maharaja of Burdwan is the proprietor of the lands in village Sripur appertaining to Touzi No. 12 of Burdwan Collectorate. He let out those lands to the Pals and Goswamis of Sripur in Putni right.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Putnidars also took colliery mining lease of those lands from the Maharaja and, thereafter, both the Maharaja and the Putnidars granted the colliery mining lease of those lands to one P. K. Chatterji of Ikrah who, in his turn, granted a sublease of the same to Messrs. Lodna Colliery Co. Ltd., the predecessor-in-interest of the defendant company, the Lodna Colliery Co. 1920 Ltd.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "A portion of the lands in suit subsided and on enquiry the plaintiffs found that the defendant company had cut away a large quantity of the underground colliery from the lands, in suit.",
      "type": "material",
      "date": null,
      "source": "plaintiffs"
    },
    {
      "id": "f5",
      "text": "The plaintiffs sued for the recovery of damages for colliery wrongfully taken away by the defendant from the land in suit and for other wrongs.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The land in suit had been permanently settled with the plaintiffs after it had been resumed as invalid Lakhraj land.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The invalid Lakhraj tenure in the land in suit in favour of the predecessors-in-interest of the plaintiffs was resumed by the Government under the provisions of Regulation II of 1819 and, thereafter, was permanently settled with them at the fixed revenue.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The Trial Court held that the plaintiffs had right to the minerals under the soil of the land settled with them. It accordingly decreed the suit in part.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The decree was confirmed by the High Court on September 11, 1952, in Appeal from original Decree No. 162 of 1949.",
      "type": "procedural",
      "date": "1952-09-11",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The land in suit originally granted to predecessors-in-interest under Brahmottar and Debutter grants, the grantees under which had no rights in the sub-soil of the land granted.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f11",
      "text": "Exhibit 10 is the Robakari of the Deputy Collector of Burdwan, dated April 15, 1841, with respect to Touzi No. 2597, in pursuance of which permanent settlement was made with Madhusudan Roy and Sitaram Roy, predecessors-in-interest of the plaintiffs.",
      "type": "background",
      "date": "1841-04-15",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "In proceedings between Government and Manik Chandra Roy, Madhusudan Roy, Sitaram Roy etc., the invalid revenue free land consisting of Brahmottar land measuring 156 bighas 10 cattahs and Debutter land 18 bighas 20 cattahs was resumed and assessed to land revenue in April 1837.",
      "type": "background",
      "date": "1837-04",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Settlement made with Manik Chandra Roy on April 19, 1838; later separately with Madhusudan Roy and Sitaram Roy.",
      "type": "background",
      "date": "1838-04-19",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Amalnama, Exhibit 2, issued by Deputy Collector, Burdwan, on April 15, 1841, directing payment of rents to settlers.",
      "type": "background",
      "date": "1841-04-15",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Exhibit 6a is certified copy of settlement khatian No. 611 describing interest as Bajeapti resumed Lakheraj, proprietors including son of Madhusudan Roy and sons of Sitanath Roy, superior interest with King Emperor of India.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the person with whom a resumed invalid Lakhraj revenue free land was permanently settled has rights in the sub-soil minerals.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The person with whom resumed invalid Lakhraj land had been settled has no rights in the sub-soil.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": "Principle from Hari Narayan Singh v. Sriram Chakravarti and later Privy Council decisions; original Brahmottar and Debutter grants did not convey sub-soil rights"
    },
    {
      "id": "pa2",
      "text": "Records prior to resumption showed lands as Brahmottar and Debutter lands of predecessors, so no sub-soil rights absent definite evidence of conveyance.",
      "supporting_facts": [
        "f10",
        "f12"
      ],
      "legal_basis": "Hari Narayan Singh case and later decisions"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Plaintiffs have proprietary right to sub-soil minerals as land permanently settled after resumption.",
      "supporting_facts": [
        "f6",
        "f7",
        "f11",
        "f15"
      ],
      "legal_basis": "Provisions of Regulations enacted by Governor-General in Council; same rights as zamindars"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Regulation XIX of 1793 dealt with validity of titles to revenue-free lands; grantees or possessors until dispossessed considered proprietors with same right of property as proprietors of estates or taluks, subject to revenue.",
      "addresses_issue": "i1",
      "key_observation": "Grantees of invalid Lakhraj lands had same right of property as zamindars, including sub-soil."
    },
    {
      "id": "cr2",
      "text": "Regulation VIII of 1793 settled with actual proprietors of the soil; made permanent by Regulation I of 1793.",
      "addresses_issue": "i1",
      "key_observation": "Zemindars recognized as proprietors of the soil."
    },
    {
      "id": "cr3",
      "text": "Preamble to Regulation II of 1793: property in the soil vested in landholders.",
      "addresses_issue": "i1",
      "key_observation": "Zemindars proprietors of soil, rights extend to sub-soil minerals."
    },
    {
      "id": "cr4",
      "text": "Privy Council in Ranjit Singh v. Kali Dasi Debi confirmed zamindars as proprietors post-1793 settlement.",
      "addresses_issue": "i1",
      "key_observation": "Zamindars have prima facie title to lands, including sub-soil."
    },
    {
      "id": "cr5",
      "text": "Cases like Hari Narayan Singh etc. hold tenure-holders from zamindars have no sub-soil rights absent express grant, but here land held directly from Government post-resumption, not subordinate tenure.",
      "addresses_issue": "i1",
      "key_observation": "Principle does not apply; plaintiffs have zamindar-like rights."
    },
    {
      "id": "cr6",
      "text": "Exhibits 10, 2, 6a confirm plaintiffs' predecessors as proprietors under King Emperor.",
      "addresses_issue": "i1",
      "key_observation": "Same rights as other proprietors."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The right of property of the person with whom resumed invalid Lakhraj land had been settled, being the same as of the zemindars, extends to the sub-soil minerals of the land held by them.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ranjit Singh v. Kali Dasi Debi",
      "citation": null,
      "treatment": "followed",
      "relevance": "Zamindars recognized as proprietors of soil post-1793 settlement, prima facie title to lands."
    },
    {
      "case_name": "Hari Narayan Singh v. Sriram Chakravarti",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Tenure-holders from zamindars have no sub-soil rights absent express grant; does not apply to direct settlement from Government."
    },
    {
      "case_name": "Durga Prasad Singh v. Braja Nath Bose",
      "citation": null,
      "treatment": "followed",
      "relevance": "Zamindars have sub-soil rights; tenure-holders do not absent grant."
    },
    {
      "case_name": "Sashi Bhushan Misra v. Jyoti Prashad Singh Deo",
      "citation": null,
      "treatment": "followed",
      "relevance": "Principle that minerals not part of grant to tenure-holder absent express evidence."
    },
    {
      "case_name": "Raghunath Roy Marwari v. Raja of Jheria",
      "citation": null,
      "treatment": "followed",
      "relevance": "Rent-free tenure makes no difference; no sub-soil rights absent express grant."
    }
  ],
  "statutes_cited": [
    {
      "name": "Regulation XIX of 1793",
      "sections": [
        "Section II Clause First",
        "Section III Clause First",
        "Section IV"
      ],
      "relevance": "Grantees of invalid grants considered proprietors with zamindar rights subject to revenue; disputes private."
    },
    {
      "name": "Regulation VIII of 1793",
      "sections": [
        "Section IV"
      ],
      "relevance": "Settlement with actual proprietors of the soil."
    },
    {
      "name": "Regulation I of 1793",
      "sections": [
        "Section IV"
      ],
      "relevance": "Permanent settlement with zemindars and proprietors."
    },
    {
      "name": "Regulation II of 1793",
      "sections": null,
      "relevance": "Property in soil vested in landholders; revenue fixed forever."
    },
    {
      "name": "Regulation II of 1819",
      "sections": [
        "Section III"
      ],
      "relevance": "Resumption of invalid Lakhraj lands; assessment procedure."
    },
    {
      "name": "Regulation III of 1828",
      "sections": null,
      "relevance": "Changes in resumption procedure."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the decree of the Trial Court and High Court in favour of the plaintiffs, holding that they have proprietary rights including sub-soil minerals in the resumed invalid Lakhraj land permanently settled with their predecessors.",
    "relief_granted": "Decree in favour of plaintiffs confirmed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the grantees or the present possessors, until dispossessed by a decree of the Diwani Adalat, are to be considered as the proprietors of the lands with, the same right of property therein as is declared to be vested in proprietors of estates",
      "speaker": "court",
      "significance": "Establishes equal proprietary rights for Lakhraj grantees post-resumption."
    },
    {
      "text": "the property in the soil has been declared to be vested in the landholders, and the revenue payable to Government from each estate has been fixed for ever",
      "speaker": "court",
      "significance": "Confirms vesting of soil property in proprietors like zamindars."
    },
    {
      "text": "We are therefore of opinion that the right of property of the person with whom resumed invalid Lakhraj land had been settled, being the same as of the zemindars, extends to the sub-soil minerals",
      "speaker": "court",
      "significance": "Core holding on sub-soil rights."
    }
  ],
  "_case_id": "1962_6",
  "_label": 0,
  "_text_length": 18015,
  "_extracted_at": "2026-02-10T19:56:40.590784"
}