{
  "metadata": {
    "case_name": "Company v. Workmen (represented by unions)",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 359 of 1961",
    "date_of_judgment": "1962-03-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant company carrying on business in Calcutta paid closing bonus at the rate of one month's pay to its workmen from 1948 to 1957.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1958, profits of the appellant fell considerably, and the quantum of closing bonus was reduced to half a month's pay.",
      "type": "material",
      "date": "1958-03-31",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Dispute raised by respondents' workmen represented by two unions claiming one month's bonus as usual.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Appellant paid two kinds of bonuses: Puja bonus before Puja festival and closing bonus after close of financial year ending March 31 each year.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Closing bonus paid after accounts for the year were made up and profit ascertained.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Puja bonus increased as profits increased to help workmen at festival time.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Company formerly belonged to another owner; no closing bonus paid from 1940 to 1945; no payment in 1946 and 1947 after merger with appellant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "From 1948, after trading results for year ending March 31, 1948 known, one month's basic wages paid as closing bonus in addition to Puja bonus.",
      "type": "admitted",
      "date": "1948-03-31",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Puja bonus originally one month's basic wages, gradually increased to two months from 1955.",
      "type": "background",
      "date": "1955",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "For 1958, appellant paid two months Puja bonus but reduced closing bonus to half a month's basic wages due to profits falling from Rs. 27 lacs in 1957 to little over Rs. 15 lacs in 1958.",
      "type": "material",
      "date": "1958",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "In 1959, when profits went up again, appellant paid one month's pay as closing bonus.",
      "type": "background",
      "date": "1959",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appellant paid dividend at 2 1/2 per centum in 1958.",
      "type": "material",
      "date": "1958",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "No loss incurred by appellant during 1948 to 1957.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Third Industrial Tribunal, West Bengal, award dated April 18, 1960, in case No. VIII 153 of 1959: not implied condition or customary; but further half month's basic salary as profit bonus using Full Bench formula.",
      "type": "procedural",
      "date": "1960-04-18",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the management was justified in reducing the quantum of closing bonus to half a month's pay in 1958.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether closing bonus of one month's pay had become an implied condition of service.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether closing bonus was a customary bonus independent of profits.",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether any further amount besides half a month's pay could be awarded as profit bonus on the basis of Full Bench formula.",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Payment of closing bonus at uniform rate of one month's pay for ten years prior to 1958 had not turned it into an implied condition of service as it was profit bonus depending on profits made.",
      "supporting_facts": [
        "f5",
        "f2"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Closing bonus paid after accounts made up and profit ascertained, showing dependence on profits; uniform rate fortuitous.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Not customary bonus as no connection with festival, paid after profits known.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "If profit bonus, no available surplus to justify more than half month's pay already given.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Full Bench formula in Associated Cement Companies Limited v. Its Workmen"
    },
    {
      "id": "pa5",
      "text": "Tribunal erred in allowing only 2 1/2% interest on paid-up capital instead of usual 6% under Full Bench formula.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Full Bench formula"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Closing bonus paid at uniform rate from 1948 to 1957, become implied condition of service.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "In alternative, payment acquired character of customary bonus, not dependent on profits.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Tribunal correctly held not proved as implied condition of service, relying on Ispahani case.",
      "addresses_issue": "i2",
      "key_observation": "Paid after profits known; no payment in loss year."
    },
    {
      "id": "cr2",
      "text": "Not customary bonus as no connection with festival and not paid in loss year.",
      "addresses_issue": "i3",
      "key_observation": "Customary bonus connected to festival per Graham and Elias cases."
    },
    {
      "id": "cr3",
      "text": "Tribunal wrong in allowing only 2 1/2% interest on paid-up capital; usual 6% under Full Bench formula not linked to actual dividend.",
      "addresses_issue": "i4",
      "key_observation": "Increases amount due, no surplus for further bonus."
    },
    {
      "id": "cr4",
      "text": "Closing bonus always after trading results known; no loss in 1948-1957; not paid pre-1948; depends on profits.",
      "addresses_issue": "i2",
      "key_observation": "Nature of profit bonus despite uniform rate for 10 years."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Closing bonus not implied condition of service or customary bonus; profit bonus dependent on profits.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Under Full Bench formula, 6% interest on paid-up capital; no available surplus for further bonus beyond half month's pay already given.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Messrs. Ispahani Limited Calcutta v. Ispahani Employees Union",
      "citation": "1960 1 S.C.R. 24",
      "treatment": "followed",
      "relevance": "Not implied condition if not paid in loss year"
    },
    {
      "case_name": "Associated Cement Companies Limited v. Its Workmen",
      "citation": "1959 S.C.R. 925",
      "treatment": "followed",
      "relevance": "Full Bench formula for profit bonus"
    },
    {
      "case_name": "Graham Trading Co. Ltd. v. Its Workmen",
      "citation": "1960 1 S.C.R. 107",
      "treatment": "followed",
      "relevance": "Customary bonus connected with festival"
    },
    {
      "case_name": "B. N. Elias Co. Ltd. Employees Union v. B.N. Elias Co. Limited",
      "citation": "1960 3 S.C.R. 382",
      "treatment": "followed",
      "relevance": "Customary bonus only if connected to festival where terms governed by contract"
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; tribunal's award set aside; claim of workmen for any closing bonus over and above half month's pay already paid by appellant for 1958 rejected.",
    "relief_granted": "None to workmen",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The return on paid-up capital provided in the Full-Bench formula is not linked with actual dividends that might be declared by a company.",
      "speaker": "court",
      "significance": "Rejects linking interest rate to dividend paid"
    },
    {
      "text": "Customary bonus of the nature dealt with in Graham Trading Co. Ltd. v. Its Workmen is always connected with some festival.",
      "speaker": "court",
      "significance": "Distinguishes closing bonus from customary bonus"
    },
    {
      "id": "kq3",
      "text": "Closing bonus has been paid on the basis of the trading results of the previous year and depended upon the profits earned in the previous year.",
      "speaker": "court",
      "significance": "Determines nature as profit bonus, not implied condition"
    }
  ],
  "_case_id": "1962_27",
  "_label": 1,
  "_text_length": 11419,
  "_extracted_at": "2026-02-10T19:56:36.026501"
}