{
  "metadata": {
    "case_name": "Appellants v. Sri Sankaraswamigal Mutt",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Civil Appeals Nos. 228 and 229 of 1962",
    "date_of_judgment": "1962-09-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The first appellant is a limited company carrying on transport business. The second appellant is its managing director. The first appellant took over the business of Swami Motor Service Company, of which the second appellant was the Managing Partner.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In his capacity as Managing Partner of the said company, the second appellant took a lease of a vacant site, being survey No. 2770, belonging to the first respondent.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "After the first appellant took over the business of the said partnership company including its leasehold interest in the said site, the first respondent recognized it as its tenant and was receiving the rent from it.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "It is alleged that the appellants constructed many valuable structures on the said site.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "The first respondent i.e., Sri Sankaraswamigal Mutt, through its trustee, filed a suit, O. S. No. 103 of 1953, in the court of the District Munsif, Tanjore, for evicting the appellant company from the site and on July 30, 1954 a compromise-decree for eviction was made therein giving six months time for the appellant-company to vacate the site.",
      "type": "material",
      "date": "1954-07-30",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The decree-holder filed an execution petition in the said court against the first appellant for executing the decree.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Pending the execution petition, Madras Act XIX of 1955 was passed empowering the State Government to extend the Madras City Tenants Protection Act, 1921 (III of 1922), hereinafter called the Principal Act, to any municipal town by notification in the Fort St. George Gazette.",
      "type": "background",
      "date": "1955",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In exercise of the powers conferred by Act XIX of 1955, the Government made an order notifying the Town of Tanjore to come within the purview of the Principal Act.",
      "type": "procedural",
      "date": null,
      "source": "state"
    },
    {
      "id": "f9",
      "text": "Under the provisions of the Principal Act, the appellants filed Original Petition No. 39 of 1956 in the said court for an order directing the execution of a conveyance of the said site in favour of the company on payment of a price fixed by the court.",
      "type": "procedural",
      "date": "1956",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Those proceedings took a tortuous course mainly, it is alleged, on account of obstructive tactics adopted by the respondents in anticipation of an expected legislation withdrawing the benefits conferred on tenants of non-residential buildings in the Town of Tanjore.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "As anticipated the State Legislature passed Act XIII of 1960, amending the Principal Act the effect of the amendment was to withdraw the protection given to tenants of non-residential buildings in the municipal town of Tanjore and certain other towns.",
      "type": "material",
      "date": "1960",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Under the provisions of the impugned Act, proceedings instituted under the provisions of the Principal Act relating to non-residential buildings situated in towns other than those preferred would abate.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The appellants filed a petition under Art. 226 of the Constitution in the High Court of judicature at Madras for the issue of a writ of mandamus directing the District Munsif to dispose of the petition in accordance with the provisions of s. 9 of the Principal Act, as it stood before its amendment by Act XIII of 1960.",
      "type": "procedural",
      "date": "1960",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "In Civil Appeal No. 229 of 1962 the subject matter is a site, being survey No. 74, Railway Road, Tanjore belonging to the first respondent to this appeal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The appellants father executed a lease deed in favour of the first respondent in respect of some parts of the said site the lease deed contained a clause giving an option to the tenant to renew the lease for a further period of 10 years.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "It is alleged that the appellants father had erected substantial structures at heavy cost on the site even before the said lease as he was in possession of the said site as a tenant under the predecessor of the first respondent.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "After the expiry of 10 years, the appellants father exercised the option and continued to be in possession of the property as tenant.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "The first respondent filed a suit O. S. No. 315 of 1950 in the Court of the District Munsif, Tanjore, for evicting the appellant from the property, and obtained a compromise decree dated January 10, 1952.",
      "type": "material",
      "date": "1952-01-10",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Under the compromise decree the tenancy was extended to 12 years from January 1, 1952 and after the expiry of that period the first respondent was entitled to execute the decree and take possession of the site after removing the superstructures.",
      "type": "material",
      "date": "1952-01-01",
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "Subsequently as already notified, the provisions of the Principal Act were extended to the Town of Tanjore. Thereupon the appellants father filed O. P. No. 43 of 1956 in the Court of the District Munsif, Tanjore, for an order directing the first respondent to convey the site in his favour on payment of the price to be fixed by the court.",
      "type": "procedural",
      "date": "1956",
      "source": "petitioner"
    },
    {
      "id": "f21",
      "text": "As in the first case, in this case also the proceedings dragged on till the Act of 1960 was passed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "The appellant filed a petition under Art. 226 of the Constitution in the High Court of judicature at Madras for the issue of a writ of mandamus directing the District Munsif, Tanjore, to dispose of the application in accordance with the provisions of the Principal Act prior to its amendment by Act XIII of 1960.",
      "type": "procedural",
      "date": "1960",
      "source": "petitioner"
    },
    {
      "id": "f23",
      "text": "In both the petitions the appellants attacked the constitutional validity of Act XIII of 1960.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f24",
      "text": "The High Court, by a common order, upheld the constitutional validity of the said Act following the decision of a division Bench of the same Court, in Swaminathan v. Sundara.",
      "type": "procedural",
      "date": "1961-06-26",
      "source": "lower_court"
    },
    {
      "id": "f25",
      "text": "These two appeals, as aforesaid, have been preferred on certificate issued by the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "The 1960 Act infringes the fundamental right of the appellants under Art. 14 of the Constitution for two reasons: (i) while the object of enacting the 1960 Act was for safeguarding tenants from eviction from residential buildings, its provisions introduce a classification between non-residential buildings in different municipal areas and gives relief to tenants of non-residential buildings in some towns and refuses to give the same relief to similar tenants of such buildings in other towns in the State and such a classification has absolutely no relevance to the object sought to be achieved by the Act and (ii) the 1960 Act makes a distinction between non-residential buildings in Madras, Salem, Madurai, Coimbatore and Tiruchirappalli on the one hand and those in other towns, including Tanjore, on the other and gives protection to the tenants of such buildings in the former group and denies the same to tenants of similar buildings in the latter group, though the alleged differences between the two sets of localities have no reasonable relation to the object sought to be achieved, namely, the protection of tenants who have built substantial structures from eviction.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "The 1960 Act also offends Arts. 19(1)(f) and 31(1) of the Constitution as it is not a reasonable restriction in the interest of the public on the proprietary rights acquired by the appellants under the earlier Act XIX of 1955.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The 1960 Act infringes Art.14 by introducing unreasonable classification between non-residential buildings in different municipal areas, with no relevance to the object of safeguarding tenants from eviction.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "Article 14 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "The 1960 Act makes a distinction between non-residential buildings in specified towns (Madras, Coimbatore, Madurai, Salem, Tiruchirappalli) and others like Tanjore, with no reasonable relation to protecting tenants with substantial structures.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "Article 14 of the Constitution"
    },
    {
      "id": "pa3",
      "text": "The 1960 Act offends Arts. 19(1)(f) and 31(1) as it is not a reasonable restriction on proprietary rights acquired under Act XIX of 1955.",
      "supporting_facts": [
        "f7",
        "f8",
        "f11"
      ],
      "legal_basis": "Articles 19(1)(f) and 31(1) of the Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "ss. 3 and 9 of the Principal Act could not be invoked by the appellants, as the lease deeds executed by them contain a clear covenant that they would vacate their lands within a prescribed period and as they had put up their buildings subsequent to the execution of the lease deeds.",
      "supporting_facts": [
        "f2",
        "f15"
      ],
      "legal_basis": "ss. 3 and 9 of Principal Act; lease deeds"
    },
    {
      "id": "ra2",
      "text": "The 1960 Act neither offends Art. 14 nor Art. 19 of the Constitution.",
      "supporting_facts": [],
      "legal_basis": "Articles 14 and 19 of the Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "There is always a presumption in favour of the constitutionality of an enactment... classification must be founded on intelligible differential and the differential must have a rational relation to the object sought to be achieved by the statute.",
      "addresses_issue": "i1",
      "key_observation": "On the basis of the allegations made in the affidavit filed on behalf of the State of Madras, supported as it is by the statistical data furnished before us, we hold that there are real differences between non-residential buildings in the towns of Madurai, Coimbatore, Salem and Tiruchirappalli and those in other towns of the Madras State which have reasonable nexus to the object sought to be achieved by the Act."
    },
    {
      "id": "cr2",
      "text": "Art. 19(1)(f) applies both to concrete as well as to abstract rights of property... a law depriving a person of his property would be bad unless it amounts to a reasonable restriction in the interest of the general public.",
      "addresses_issue": "i2",
      "key_observation": "The phraseology used in Art. 19(1)(f) is wide and prima facie it takes in its sweep both abstract and concrete rights of property."
    },
    {
      "id": "cr3",
      "text": "A statutory right to apply for the purchase land is not a right of property... The right conferred is a right to purchase land. If such a right conferred under a contract is not a right of property, the fact that such a right stems from a statute cannot obviously expand its content or make it any the less a non-proprietary right.",
      "addresses_issue": "i2",
      "key_observation": "The 1960 Act does not in any way affect the appellants fundamental right."
    },
    {
      "id": "cr4",
      "text": "The object of the Principal Act was to protect the tenants not only of dwelling houses in the City of Madras but also of other buildings in that City.",
      "addresses_issue": "i1",
      "key_observation": "So it is not correct to state that the object of the Act is only to protect the tenants of residential buildings."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The 1960 Act, in so far as it withdrew the rights conferred upon the tenants of non-residential buildings in Tanjore, does not offend Art. 14 of the Constitution.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The right under s.9 of the Principal Act (right to apply for order directing landlord to sell land for price fixed by court) is not a right to property, hence 1960 Act does not deprive appellants of property rights under Arts. 19(1)(f) and 31(1).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shri Ram Krishna Dalmia v. Shri Justice S. R. Tendolkar",
      "citation": "1959 S.C.R. 279",
      "treatment": "followed",
      "relevance": "Presumption of constitutionality and principles of classification under Art.14"
    },
    {
      "case_name": "Budhan Choudhry v. The State of Bihar",
      "citation": "1955 1 S.C.R. 1045",
      "treatment": "referred",
      "relevance": "Classification may be founded on different bases, such as geographical"
    },
    {
      "case_name": "The State of West Bengal v. Anwar Ali Sarkar",
      "citation": "1952 S.C.R. 284",
      "treatment": "referred",
      "relevance": "Principles of classification under Art.14"
    },
    {
      "case_name": "Swaminathan v. Sundara",
      "citation": "I.L.R. 1961 Mad. 976",
      "treatment": "followed",
      "relevance": "High Court upheld validity of 1960 Act"
    },
    {
      "case_name": "The State of West Bengal v. Subodh Gopal Bose",
      "citation": "1954 S.C.R. 587",
      "treatment": "referred",
      "relevance": "Distinction between abstract and concrete property rights under Arts.19 and 31"
    },
    {
      "case_name": "Commissioner, Hindu Religious Endowments, Madras v. Sri Lakshmindra Thirtha Swamiar of Sri Shirur Mutt",
      "citation": "1954 S.C.R. 1005",
      "treatment": "followed",
      "relevance": "Art.19(1)(f) applies to concrete as well as abstract rights"
    },
    {
      "case_name": "Chiranjit Lal Chowdhuri v. The Union of India",
      "citation": "1950 S.C.R. 869",
      "treatment": "referred",
      "relevance": "Right to hold property under Art.19(1)(f)"
    },
    {
      "case_name": "Kavalappara Kottarathil Kochuni v. The State of Madras",
      "citation": "1960 3 S.C.R. 887",
      "treatment": "followed",
      "relevance": "Law depriving property must not infringe Art.19"
    },
    {
      "case_name": "Jayvantsinghji v. State of Gujarat",
      "citation": "1962 Supp. 2 S.C.R. 411",
      "treatment": "distinguished",
      "relevance": "Statutory sale effecting title passage creates property right, but not mere right to purchase"
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras City Tenants' Protection Act, 1921 (Principal Act, III of 1922)",
      "sections": [
        "s.2(1)",
        "s.2(1-A)",
        "s.3",
        "s.4",
        "s.6",
        "s.9",
        "s.12"
      ],
      "relevance": "Gives tenants right to compensation on ejectment and option to purchase land; applied to non-residential buildings until amended"
    },
    {
      "name": "Madras Act XIX of 1955",
      "sections": [],
      "relevance": "Empowered extension of Principal Act to other towns including Tanjore; conferred rights on tenants of non-residential buildings"
    },
    {
      "name": "Madras Act XIII of 1960",
      "sections": [
        "s.3",
        "s.9"
      ],
      "relevance": "Amended Principal Act to restrict to residential buildings except in specified areas; abated pending proceedings and extinguished rights re non-residential buildings in towns like Tanjore"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14",
        "Article 19(1)(f)",
        "Article 31(1)",
        "Article 226"
      ],
      "relevance": "Challenged on grounds of equality, property rights; writ of mandamus sought"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals challenging the constitutional validity of Madras Act XIII of 1960 are dismissed. The Act does not violate Articles 14, 19(1)(f) or 31(1). The High Court's order upholding the Act is affirmed. No mandamus to direct District Munsif to proceed under unamended s.9.",
    "relief_granted": "None",
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "there is always a presumption in favour of the constitutionality of an enactment and the burden is upon him who attacks it to show that there has been a clear transgression of the constitutional principles",
      "speaker": "court",
      "significance": "Sets standard for challenging legislation under Art.14"
    },
    {
      "text": "Art. 19(1)(f) applies equally to concrete as well as abstract rights of property.",
      "speaker": "court",
      "significance": "Clarifies scope of property rights protection"
    },
    {
      "text": "a statutory right to apply for the purchase land is not a right of property.",
      "speaker": "court",
      "significance": "Holds no property right under s.9, so no Art.19/31 violation"
    },
    {
      "text": "In the result, the appeals fail and are dismissed with costs.",
      "speaker": "court",
      "significance": "Final disposition"
    }
  ],
  "_case_id": "1962_63",
  "_label": 0,
  "_text_length": 46402,
  "_extracted_at": "2026-02-10T19:57:28.950292"
}