{
  "metadata": {
    "case_name": "Burmah Shell Oil Storage Distributing Company of India Ltd. v. Belgaum Borough Municipality",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 431/1961",
    "date_of_judgment": "1962-11-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Company deals in petrol and other petroleum products manufactured in refineries outside the octroi limits of Belgaum Municipality and brings them inside for use or consumption by itself or for sale to dealers, licensees, Government, local bodies, and private concerns.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Company has a Divisional Office and Depot in Belgaum; petition filed by Divisional Manager.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Goods brought by Company divided into four categories: (1) Goods consumed by the Company; (2) Goods sold by Company through dealers or itself and consumed within octroi limits by others; (3) Goods sold inside limits but consumed outside; (4) Goods sent from Depot inside limits to extra-municipal points for consumption by others.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Period concerned: October 22, 1955 to October 22, 1958; octroi duty levied on all goods irrespective of categories amounted to Rs. 1,40,544.51.",
      "type": "material",
      "date": "1955-10-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Company filed writ petition under Article 226 against Municipality to prohibit levy of octroi on products brought inside for sale; dismissed by Mysore High Court on May 31, 1960.",
      "type": "procedural",
      "date": "1960-05-31",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appeal by certificate under Article 133(1)(b) granted by High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Belgaum Municipality governed by Bombay Municipal Boroughs Act, 1925; power to levy octroi under section 73(iv): on animals or goods brought within octroi limits for consumption, use or sale therein (sale added by Bombay Act 35 of 1954 effective May 5, 1954).",
      "type": "background",
      "date": "1954-05-05",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Procedure for imposing tax under sections 75, 76; rules under section 58(j); by-laws under section 61(n).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Octroi Rules and By-laws framed in 1925 continued; Rule 4(1) not reframed post-1954 amendment.",
      "type": "background",
      "date": "1925",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Company claimed not liable for octroi on categories other than first; High Court rejected but Municipality agreed to refund fourth category per rules.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Dispute narrowed to second and third categories; Company admits liability on first category; Municipality offers refund on fourth on proof.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether octroi is leviable under Bombay Municipal Boroughs Act, 1925 on goods brought into octroi limits for sale therein but not consumed or used therein by the importer.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether amendment adding 'sale' to section 73(iv) required fresh procedure under sections 75-77 and 58(j) read with section 60, as it imposed a new tax.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Words 'consumption or use' refer to consumption or use by the person bringing the goods; 'sale' introduces a third party; pre-1954, octroi only on goods for own consumption/use, not sale.",
      "supporting_facts": [
        "f3",
        "f7"
      ],
      "legal_basis": "Entry 49, List II, Government of India Act 1935; Entry 52, State List, Constitution; Bombay Municipal Boroughs Act, 1925 s.73(iv) pre-amendment"
    },
    {
      "id": "pa2",
      "text": "Post-1954 amendment adding 'sale' required reframing rules and following procedure under ss.75,76,58(j),60; failure invalidates levy on goods for sale.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Bombay Municipal Boroughs Act, 1925 ss.75,76,58(j),60,77; Burmah Shell Oil Storage and Dist. Co. v. Manmad Municipality AIR 1958 Bom 43"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Prepared to grant refund for fourth category goods re-exported on proof; liable on others.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Octroi Rules and By-laws"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Octroi historically on goods brought into local area for consumption, use or sale therein; even pre-1954, sale implicit if goods meant for ultimate consumption/use in area by buyers.",
      "addresses_issue": "i1",
      "key_observation": "'Consumption' has wider meaning including distribution to consumers; 'use' covers goods not used up; taxable event is entry for repose in area."
    },
    {
      "id": "cr2",
      "text": "Amendment adding 'sale' did not alter nature/incidence/rate of tax; no new tax, thus no need for fresh procedure under ss.75-77.",
      "addresses_issue": "i2",
      "key_observation": "Tax remained same; amplification aligned with constitutional description but concept included sale pre-amendment."
    },
    {
      "id": "cr3",
      "text": "Company liable on categories 1,2,3; refund for 4 per rules; distinguishes terminal tax.",
      "addresses_issue": "i1",
      "key_observation": "Goods brought for sale to consumers/dealers for use/consumption in area taxable, even if later taken out."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Octroi payable on goods brought into octroi limits for consumption by importer or sold therein to consumers/dealers for ultimate use/consumption in area, irrespective of actual later consumption location.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No requirement for new imposition procedure post-1954 amendment as tax unchanged.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Burmah Shell Oil Storage and Dist. Co. v. Manmad Municipality",
      "citation": "AIR 1958 Bom 43",
      "treatment": "distinguished",
      "relevance": "Petitioner relied on for new tax post-amendment needing procedure; court holds not applicable as no new tax."
    },
    {
      "case_name": "State of Bombay v. United Motors India Ltd.",
      "citation": "1953 SCR 1069",
      "treatment": "followed",
      "relevance": "Wider meaning of 'consumption' under Art.286: references distribution to consumers, not just importer."
    },
    {
      "case_name": "Anwarkhan Mahboob Co. v. State of Bombay",
      "citation": "1961 1 SCR 709",
      "treatment": "followed",
      "relevance": "Expansive definition of 'consumption' including intermediate/final acts, utilization of commodities."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Municipal Boroughs Act, 1925",
      "sections": [
        "73(iv)",
        "75",
        "76",
        "77",
        "58(j)",
        "60",
        "61(n)",
        "2(12)"
      ],
      "relevance": "Authorizes octroi on goods for consumption/use/sale therein; procedures for imposition; amendment added 'sale'; rules/by-laws for levy/refunds."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "226",
        "133(1)(b)",
        "286"
      ],
      "relevance": "Writ petition; appeal certificate; explanation of 'consumption'."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "Sch. VII List II Entry 49"
      ],
      "relevance": "Cesses on entry of goods for consumption, use or sale; historical context distinguishing octroi from terminal tax."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; Company liable to pay octroi on goods in categories 1,2,3 brought into Belgaum octroi limits; refund available for category 4 per rules on proof of re-export.",
    "relief_granted": "None beyond existing refund procedure for re-exported goods.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'The expression 'for the purpose of consumption' in that State must... be understood as having reference not merely to the individual importer or purchaser but as contemplating distribution eventually to consumers in general within the State.'",
      "speaker": "court",
      "significance": "Defines broad scope of 'consumption' including by others in area."
    },
    {
      "text": "The act of sale is merely the means for putting the goods in the way of use or consumption. It is an earlier stage, the ultimate destination of the goods being use or consumption.",
      "speaker": "court",
      "significance": "Clarifies sale implicit in pre-amendment octroi if for ultimate use/consumption in area."
    },
    {
      "text": "In our opinion, even without the word 'sale' in the Boroughs Act the position was the same provided the goods were sold in the local area to a consumer who bought them for the purpose of use or consumption.",
      "speaker": "court",
      "significance": "Holds amendment not creating new tax."
    }
  ],
  "_case_id": "1962_166",
  "_label": 0,
  "_text_length": 30125,
  "_extracted_at": "2026-02-10T19:58:38.569201"
}