{
  "metadata": {
    "case_name": "Union of India v. Balakrishna Flour Mills",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Ayyangar, J."
    ],
    "case_number": "Civil Appeal No. 568 of 1960",
    "date_of_judgment": "1962-04-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent imported from Australia a quantity of oats described in indent, contract and shipping documents as standard feed-oats, consisting of oats in whole grain.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Import during period July to December 1952 when consignment reached India.",
      "type": "background",
      "date": "1952-07 to 1952-12",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Controversy on classification under Import Trade Control Schedules: Item 42 'Fodder, bran and pollards-O.G.L.-Soft' (open general licence, no special import licence needed) or Item 32 'Grain, not otherwise specified, including broken grain but excluding flour - a oats b others --Ports -Nil---A.V.' (licence necessary from Joint Chief Controller or Deputy Chief Controller, actual users could apply, quotas specified).",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent carried on business in fodder under name Balakrishna Flour Mills, placed order with Australian firm for whole grain feed-oats without obtaining import licence.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Goods arrived in Madras on August 1, 1952; Customs Authorities insisted on production of licence to clear goods.",
      "type": "procedural",
      "date": "1952-08-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Assistant Collector held goods fell within Item 32, no licence held, contravention of s.19 Sea Customs Act read with s.3(2) Imports Exports Control Act 1947; directed confiscation and fine of Rs.5,000/- in lieu of confiscation.",
      "type": "procedural",
      "date": "1956-04-06 prior",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appeal to Collector of Customs rejected.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Respondent moved Madras High Court for writ of mandamus under s.45 Specific Relief Act.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "In affidavit, respondent contended oats in full-grain fell within Item 42 (fodder): imported solely for feeding race-horses at Bangalore; in South India oats not used as human food but only as horse feed; misled by affirmative answer from Deputy Chief Controller of Imports, Madras on query whether feed-oats importable under OGL serial No.42.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Single Judge dismissed application: Customs classification of uncrushed feed-oats as grain not fodder not perverse or mala fide.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Division Bench allowed appeal, issued direction prohibiting Collector and subordinates from collecting fines/penalties.",
      "type": "procedural",
      "date": "1956-04-06",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appeal to Supreme Court on certificate of fitness under Art.133(1)(c) granted by Madras High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Deputy Chief Controller's letter dated September 14, 1951: 'Feed oats classifiable under serial 42 of Part IV can be imported under Open General License No. XXIII.'",
      "type": "background",
      "date": "1951-09-14",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Deputy Chief Controller's further letter January 1, 1952 clarifying: whole grain oats fall within Item 32, crushed oats as fodder Item 42; respondent denied receipt, no specific finding by High Court.",
      "type": "disputed",
      "date": "1952-01-01",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Contract for purchase entered beginning of June 1952.",
      "type": "background",
      "date": "1952-06",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Nature and extent of jurisdiction possessed by High Court in considering validity of order of Customs Authorities interpreting provisions of entries in Tariff Schedule as regards imposition of duties.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Proper classification of imported whole grain feed-oats: within Item 42 (Fodder) or Item 32 (Grain - oats).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Uncrushed oats answer description of grain, fall within Item 32; decision rationally supportable, not perverse; even if oats capable of use as horse feed, not excluded from grain as not solely animal food.",
      "supporting_facts": [
        "f1",
        "f3",
        "f6"
      ],
      "legal_basis": "Venkateswaram v. Wadhwani"
    },
    {
      "id": "pa2",
      "text": "Item 32 specifically references 'oats' under grains.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Oats in full-grain fell within Item 42 (fodder) as imported for horse-feed, not human food in South India; misled by Deputy Chief Controller's affirmative reply.",
      "supporting_facts": [
        "f9",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Customs classification decision not final, open to judicial review; Item 32 'grain' excludes grains used as fodder.",
      "supporting_facts": [
        "f3",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court jurisdiction limited: primarily for Import Control authorities to classify; Court interferes only if construction perverse (no reasonable person could adopt). If two reasonable constructions, one favouring Revenue, Court cannot prefer other.",
      "addresses_issue": "i1",
      "key_observation": "Customs holding oats as grain not perverse."
    },
    {
      "id": "cr2",
      "text": "Uncrushed oats are grain; capable of human food use (not solely animal feed like true fodder); all coarse grains serve both man and cattle.",
      "addresses_issue": "i2",
      "key_observation": "Oats belong to category of grain."
    },
    {
      "id": "cr3",
      "text": "Item 32 specifically 'a oats b others'; High Court overlooked full entry.",
      "addresses_issue": "i2",
      "key_observation": "Specific reference places oats in Item 32."
    },
    {
      "id": "cr4",
      "text": "Deputy Chief Controller's 1951 letter unclear; 1952 clarification distinguishes whole vs crushed; authorities may consider in modifying penalty.",
      "addresses_issue": "i2",
      "key_observation": "No finding on receipt, but relevant for penalty."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court erred in interfering with Customs order; classification of whole grain feed-oats as grain under Item 32 correct and reasonable.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Oats not excluded from 'grain' merely because usable as horse feed; specific entry confirms classification.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Venkateswaram v. Wadhwani",
      "citation": "AIR 1961 SC 1506",
      "treatment": "followed",
      "relevance": "Limits of Court jurisdiction in classification by authorities: interfere only if perverse."
    }
  ],
  "statutes_cited": [
    {
      "name": "Sea Customs Act",
      "sections": [
        "s.19",
        "s.167(8)"
      ],
      "relevance": "Contravention basis for confiscation and penalty."
    },
    {
      "name": "Imports and Exports (Control) Act, 1947",
      "sections": [
        "s.3(2)"
      ],
      "relevance": "Read with Sea Customs Act for import licence requirement."
    },
    {
      "name": "Specific Relief Act",
      "sections": [
        "s.45"
      ],
      "relevance": "Basis for writ of mandamus application; narrower power than Art.226."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.133(1)(c)",
        "Art.226"
      ],
      "relevance": "Certificate for appeal; comparison of High Court powers."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, order of Division Bench of Madras High Court set aside, respondent's application under s.45 Specific Relief Act dismissed. Authorities may consider clarification letters in modifying penalty quantum.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "if in doing so, these authorities adopted a construction which no reasonable person could adopt i.e., if the construction was perverse then it was a case in which the Court was competent to interfere.",
      "speaker": "court",
      "significance": "Defines limits of judicial review on classification."
    },
    {
      "text": "the mere fact therefore that a grain is capable of being used as horse or other cattle feed does not make it fodder excluding it from the category of grain to which it admittedly belongs.",
      "speaker": "court",
      "significance": "Core reasoning on classification of oats."
    },
    {
      "text": "In the present case it could not be contended that uncrushed oats did not answer the description of grain.",
      "speaker": "court",
      "significance": "Rejects respondent's fodder claim."
    }
  ],
  "_case_id": "1962_326",
  "_label": 1,
  "_text_length": 11022,
  "_extracted_at": "2026-02-10T20:01:01.063915"
}