{
  "metadata": {
    "case_name": "Appellant v. Respondents",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Civil Appeal No. 233 of 1962",
    "date_of_judgment": "1962-07-30"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Notification of election to the Panchayat of Byappanahalli from its first constituency: 6-2-1960.",
      "type": "procedural",
      "date": "1960-02-06",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Date by which candidates had to file nomination papers: 16-3-1960.",
      "type": "procedural",
      "date": "1960-03-16",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant and five others filed their nomination papers within the prescribed date.",
      "type": "procedural",
      "date": "1960-03-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Date of the scrutiny of nomination papers: 18-3-1960.",
      "type": "procedural",
      "date": "1960-03-18",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Polling took place on April 13, 1960. Votes: Appellant 169, Respondent 2 158, Respondent 1 128, Respondent 3 115, Respondent 4 38, Respondent 5 46.",
      "type": "material",
      "date": "1960-04-13",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Declaration of result: 14-4-1960. Appellant and Respondent 2 duly declared elected.",
      "type": "material",
      "date": "1960-04-14",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondent 1 filed election petition under s.13 of Mysore Village Panchayats and Local Boards Act, 1959 in Court of Second Munsiff, Bangalore, for declaration that appellant was not duly elected and Respondent 1 was duly elected.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Case of Respondent 1: Appellant's name not in authenticated list of voters published under r.3 cl.5 of Mysore Panchayats Rules 1959 on nomination date; appellant not ordinarily resident of Byappanahalli.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Munsiff held appellant ordinarily resident and qualified for electoral roll, but name not included in authenticated list; set aside appellant's election and declared Respondent 1 elected.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "On appeal, Mysore High Court disagreed with Munsiff's reasoning but agreed with conclusion: appellant's name included in legislative constituency roll in violation of r.26 ROP Rules 1956, so void. Judgment dated August 2, 1961 in Writ Petition No. 814 of 1961.",
      "type": "procedural",
      "date": "1961-08-02",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant filed appeal by special leave to Supreme Court. No appearance by respondents.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Election petition admitted appellant's name was in authenticated list on nomination date.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Appellant's name included in electoral roll of Mysore Legislative Assembly before nomination date, but Electoral Registration Officer did not follow r.26 procedure.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the election of the appellant can be set aside on the ground that his name was included in the electoral roll illegally, in violation of r.26 of Representation of the People (Preparation of Electoral Rolls) Rules, 1956.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether civil courts have jurisdiction under s.30 of Representation of the People Act, 1950 to question the legality of inclusion of name by Electoral Registration Officer.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the inclusion was a nullity or merely illegal, rectifiable only by appeal.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether there is improper acceptance of nomination under s.13(3)(a)(i) of Mysore Act if name is in voters list but included illegally.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in considering legality of inclusion in electoral roll as s.30 ROP Act 1950 bars jurisdiction of civil courts to question actions of Electoral Registration Officer.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Section 30, Representation of the People Act, 1950"
    },
    {
      "id": "pa2",
      "text": "Inclusion illegal due to non-compliance with r.26 but not a nullity; officer had jurisdiction, non-compliance makes action illegal but appealable under s.24, not challengeable in civil court.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Rule 26, Representation of the People (Preparation of Electoral Rolls) Rules, 1956; Section 24, ROP Act 1950"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant's name not in authenticated list of voters on nomination date; not ordinarily resident of Byappanahalli.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Rule 3 cl.5, Mysore Panchayats and Taluk Boards Election Rules, 1959"
    },
    {
      "id": "ra2",
      "text": "Name included in legislative roll in direct violation of r.26 ROP Rules 1956, so void. (High Court view)",
      "supporting_facts": [
        "f10",
        "f13"
      ],
      "legal_basis": "Rule 26, ROP (Preparation of Electoral Rolls) Rules, 1956"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Authenticated list not produced but admitted in election petition that appellant's name was included; no need to prove admitted fact.",
      "addresses_issue": "i1",
      "key_observation": "Admission in petition binds."
    },
    {
      "id": "cr2",
      "text": "s.30 ROP Act 1950 bars civil courts from questioning Electoral Registration Officer's action; illegal inclusion rectifiable only by appeal or other prescribed remedy.",
      "addresses_issue": "i2",
      "key_observation": "Action illegal but not nullity; officer had jurisdiction, non-compliance does not oust jurisdiction."
    },
    {
      "id": "cr3",
      "text": "Under s.9 and s.10 Mysore Act, legislative roll deemed voters list for Panchayat; Secretary maintains authenticated copy. Name in list qualifies candidate unless disqualified under s.11.",
      "addresses_issue": "i1",
      "key_observation": "Voters list final for election purposes."
    },
    {
      "id": "cr4",
      "text": "No improper acceptance of nomination under s.13(3)(a)(i) Mysore Act as name in voters list qualifies under s.10.",
      "addresses_issue": "i4",
      "key_observation": "No provision to set aside election for illegal inclusion in list."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Civil courts barred by s.30 ROP Act from questioning Electoral Registration Officer's illegal inclusion of name.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Illegal inclusion not nullity; procedure non-compliance does not affect jurisdiction.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Voters list final; no ground under s.13(3)(a)(i) Mysore Act to set aside election.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "Appellant's election not liable to be set aside.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Mysore Village Panchayats and Local Boards Act, 1959 (Mysore Act No. 10 of 1959)",
      "sections": [
        "Section 9",
        "Section 10",
        "Section 11",
        "Section 13(3)(a)(i)"
      ],
      "relevance": "Electoral roll of legislative assembly deemed voters list (s.9); qualification to stand for election if name in list unless disqualified (s.10); grounds for setting aside election including improper acceptance of nomination (s.13)"
    },
    {
      "name": "Representation of the People Act, 1950 (Central Act XLIII of 1950)",
      "sections": [
        "Section 23",
        "Section 24",
        "Section 30"
      ],
      "relevance": "Application for inclusion in electoral roll (s.23); appeals (s.24); bar on civil court jurisdiction to question Electoral Registration Officer's actions (s.30)"
    },
    {
      "name": "Mysore Panchayats and Taluk Boards Election Rules, 1959",
      "sections": [
        "Rule 3 cl.5"
      ],
      "relevance": "Publication and authentication of voters list"
    },
    {
      "name": "Representation of the People (Preparation of Electoral Rolls) Rules, 1956",
      "sections": [
        "Rule 26",
        "Rule 27"
      ],
      "relevance": "Procedure for applications under s.23 ROP Act including notice and objections (r.26); appeals (r.27)"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed. High Court's order setting aside appellant's election reversed. Appellant's election upheld as voters list final and no jurisdiction in civil court to question inclusion; no improper acceptance of nomination.",
    "relief_granted": "Election of appellant restored",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Under s. 30 of the Representation of the People Act,1950, no civil court shall have jurisdiction to question the legality of any action taken by, or under the authority of, the electoral registration officer.",
      "speaker": "court",
      "significance": "Core holding barring civil court jurisdiction"
    },
    {
      "text": "The non-compliance with the procedure prescribed does not affect his jurisdiction, though it may render his action illegal.",
      "speaker": "court",
      "significance": "Distinguishes illegal action from nullity"
    },
    {
      "text": "The Act proceeds on the basis that the voters list is final for the purpose of election.",
      "speaker": "court",
      "significance": "Explains finality of electoral roll"
    }
  ],
  "_case_id": "1962_143",
  "_label": 1,
  "_text_length": 12627,
  "_extracted_at": "2026-02-10T19:58:35.360695"
}