{
  "metadata": {
    "case_name": "Lala Kapurchand Godha and another v. Mir Nawab Himayatalikhan Azamjah (Prince of Berar)",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das, J."
    ],
    "case_number": "Civil Appeal No. 52 of 1960",
    "date_of_judgment": "1962-04-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On or about January 31, 1937 Baboo Mull and Co. sold and delivered to the Prince of Berar in Bombay various articles of jewellery the aggregate value of which was Rs. 13,20,750/-",
      "type": "material",
      "date": "1937-01-31",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Lala Kapurchand Godha and Lala Heeralal Godha carried on business in jewellery in partnership with their father and one Lala Baboo Mull since deceased in the name and style of Baboo Mull and Co. Appellants own the entire interest in the subject matter",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "A writing dated January 31, 1937 (Ex. A) executed by the Prince of Berar acknowledging purchase of jewellery from appellants at Rs. 13,20,750/- and promising to pay the sum with 10% simple interest at his option and leisure on behalf of himself and heirs etc.",
      "type": "material",
      "date": "1937-01-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Jewellery was in fact delivered by the appellants to the respondent after January 31, 1937",
      "type": "admitted",
      "date": "1937-01-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondent passed various acknowledgements of liability and promise to pay, last on February 15/16, 1948, admitting liability for Rs. 27,79,078-2-0",
      "type": "material",
      "date": "1948-02-15",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On April 30, 1948, appellants presented their bill; in January 1949, one appellant interviewed respondent who said Nizam had passed the bill",
      "type": "procedural",
      "date": "1948-04-30",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In 1949, after Police Action, Committee set up on February 8, 1949 by Military Governor (Princes Debts Settlement Committee) to scrutinize debts of Prince of Berar and younger brother",
      "type": "background",
      "date": "1949-02-08",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On February 19, 1949, appellants petitioned Military Governor for payment or return of jewellery",
      "type": "procedural",
      "date": "1949-02-19",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Committee considered appellants' claim in para 11, recommended Rs. 20 lacs in full satisfaction, no return of jewellery; reduced by 10% assuming inflated prices, interest at 6%",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Committee: Zaheruddin Ahmed (Controller of Accounts) and A.N. Shah (ICS)",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "September 27, 1949: Rs.11,25,000/- paid to appellants (Ex. B receipt, no mention of full satisfaction); dispute on share resolved later",
      "type": "material",
      "date": "1949-09-27",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "February 14, 1950: Rs.8,75,000/- paid, total Rs.20 lacs; receipt Ex. C: 'in full and final payment of the balance of rupees twenty lacs... reserving however my right to recover the balance amount due to me under the said pronote from the Prince of Berar'",
      "type": "material",
      "date": "1950-02-14",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Authorities refused payment on Ex. C due to reservation; appellants then discharged all promissory notes including last one with 'received payment in full' by Kapurchand Godha",
      "type": "material",
      "date": "1950-02-14",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "August 14, 1950: Appellants served notice on respondent for balance Rs.9,99,940/- with 10% interest",
      "type": "procedural",
      "date": "1950-08-14",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Suit instituted February 5, 1951 in Bombay High Court for recovery",
      "type": "procedural",
      "date": "1951-02-05",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Trial by Coyajee J.: Issue No.6 - whether appellants accepted Rs.20 lacs in full satisfaction and surrendered writings duly discharged (absolute release); held no accord and satisfaction relying on Ex.C",
      "type": "procedural",
      "date": "1958-04-15",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Appeal by respondent: Chagla CJ and Mody J., judgment April 15, 1958: held yes, accord and satisfaction per s.63 Contract Act, dismissed suit with costs",
      "type": "procedural",
      "date": "1958-04-15",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Certificate under s.110 CPC by Bombay HC for appeal to SC",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Evidence of Putta Madhava Rao (Asst Accountant-General): Appellants insisted full claim, protested but Committee clear no more; for second payment, refused Ex.C, required full satisfaction endorsements on pronotes; Kapurchand protested but endorsed",
      "type": "disputed",
      "date": "1950-02-14",
      "source": "petitioner"
    },
    {
      "id": "f20",
      "text": "Evidence of Kapurchand Godha: Similar to Madhava Rao, protested but endorsed full payment on pronotes to get cheque",
      "type": "disputed",
      "date": "1950-02-14",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellants had accepted payment of Rs. 20 lacs in full satisfaction of their claim against the respondent and surrendered all the writings duly discharged and there was absolute release of the debt (principal issue No.6)",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Crucial question is intention of creditor in accepting Rs.20 lacs; effect of Ex.C reserving right to recover balance from Prince; trial court (Coyajee J.) correct, appellate court did not attach sufficient importance",
      "supporting_facts": [
        "f12",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Reliance on Day v. McLea and Neuchatel Asphalte Co. Ltd. v. Barnett: keeping money not conclusive of accord and satisfaction, question of fact on terms",
      "supporting_facts": [
        "f19",
        "f20"
      ],
      "legal_basis": "Day v. McLea (1899) 32 QBD 610; Neuchatel Asphalte Co. Ltd. v. Barnett (1957) 1 All ER 362"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellants accepted Rs.20 lacs in full satisfaction, duly discharged pronotes by endorsing full satisfaction; s.63 Indian Contract Act applies",
      "supporting_facts": [
        "f13",
        "f17",
        "f19",
        "f20"
      ],
      "legal_basis": "Section 63 Indian Contract Act; Section 41 Indian Contract Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Evidence of Madhava Rao and Kapurchand Godha decisive: Authorities refused second payment unless full satisfaction endorsed on pronotes; appellants protested but agreed and endorsed before receiving money; no coercion plea raised earlier",
      "addresses_issue": "i1",
      "key_observation": "Appellants gave full discharge when receiving second instalment; facts establish accord and satisfaction"
    },
    {
      "id": "cr2",
      "text": "S.63 Contract Act and Ill.(c) directly cover: promisee may accept any satisfaction he thinks fit; acceptance from third person (Hyderabad authorities) discharges promisor per s.41",
      "addresses_issue": "i1",
      "key_observation": "Appellants accepted Rs.20 lacs in full satisfaction, cannot sue for balance"
    },
    {
      "id": "cr3",
      "text": "Distinguished Day v. McLea and Neuchatel: Here facts clearly show appellants accepted on condition of full satisfaction, no ambiguity",
      "addresses_issue": "i1",
      "key_observation": "Appellants unambiguously told unless full satisfaction no payment; they accepted condition"
    },
    {
      "id": "cr4",
      "text": "Hirachand supports: Accepted on terms offered, cannot claim balance",
      "addresses_issue": "i1",
      "key_observation": "Must take money on terms offered"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellants accepted Rs.20 lacs in full satisfaction of claim per s.63 and Ill.(c) Indian Contract Act; discharged pronotes; cannot enforce balance against respondent per s.41",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Day v. McLea",
      "citation": "(1899) 32 QBD 610",
      "treatment": "distinguished",
      "relevance": "Keeping cheque not conclusive of accord; question of fact on terms - but here facts show clear acceptance on full satisfaction terms"
    },
    {
      "case_name": "Neuchatel Asphalte Co. Ltd. v. Barnett",
      "citation": "(1957) 1 All ER 362",
      "treatment": "distinguished",
      "relevance": "No intention to accept in full due to circumstances - but here clear condition imposed and accepted"
    },
    {
      "case_name": "Hirachand Punamchand v. Temple",
      "citation": "(1911) 2 KB 330",
      "treatment": "followed",
      "relevance": "Creditor accepts less amount on terms offered in full settlement, cannot sue for balance"
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s. 110"
      ],
      "relevance": "Certificate granted by Bombay High Court for appeal to Supreme Court"
    },
    {
      "name": "Indian Contract Act, 1872",
      "sections": [
        "s. 63",
        "s. 41"
      ],
      "relevance": "s.63: Promisee may remit or accept any satisfaction; Ill.(c): Lesser payment accepted discharges whole claim; s.41: Acceptance from third person discharges promisor"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Bombay High Court appellate decision, held accord and satisfaction established, appellants accepted Rs.20 lacs in full discharge of claim under s.63 Contract Act, dismissed suit with costs (as per lower appellate court).",
    "relief_granted": null,
    "costs": "Dismissed with costs (as per appellate court)"
  },
  "key_quotes": [
    {
      "text": "\"Ordinarily, a plaintiff would have been in a most difficult and unenviable position to enforce this claim after having endorsed those documents namely Ex. No. 1 as payment in full satisfaction. But evidently payment in full satisfaction there meant full satisfaction as regards the liability of the Hyderabad State\"",
      "speaker": "Coyajee J. (trial court)",
      "significance": "Trial court's reasoning favoring appellants, reversed on appeal"
    },
    {
      "text": "Every promisee may dispense with or remit, wholly or in part, the performance of the promise made to him, or may extend the time for such performance or may accept instead of it any satisfaction which he thinks fit.",
      "speaker": "court",
      "significance": "Quotes s.63 Indian Contract Act, basis of holding"
    },
    {
      "text": "\"The clear effect is that the authorities who were paying the money in discharge of the debt of the respondent made it clear that they would pay the money only if a full satisfaction of the claim was given by the appellants.\"",
      "speaker": "court",
      "significance": "Key finding on intention and condition for payment"
    }
  ],
  "_case_id": "1962_327",
  "_label": 0,
  "_text_length": 23319,
  "_extracted_at": "2026-02-10T20:01:04.361210"
}