{
  "metadata": {
    "case_name": "Laxman (Plaintiff-Appellant) v. State of Bombay (Respondent No. 1) & Ors.",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Civil Appeal No. 206 of 1960",
    "date_of_judgment": "1962-12-13"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The plaintiffs family are grantees of the Patilki Watan of some villages in Umbergaon taluka of the Thana District of Maharashtra, including the villages of Solsumbha, Maroli and Vavji.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Defendants 2 to 4 also belong to the family of the plaintiff. The plaintiff represents the seniormost branch of the family while the defendants 2 to 4 represent other branches.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The dispute relates to the Patilki of Solsumbha.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The relevant facts which are no longer in dispute.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Under the Bombay Hereditary Offices Act, 1874, the person who actually performs the duty of a hereditary Office for the time being is called an Officiator.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Officiator had been selected from the branch of the plaintiff from the year 1870 in which year the propositus Krishna Rao Pimputkar died.",
      "type": "background",
      "date": "1870",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "After Krishna Rao's death, he was succeeded by his eldest son Vasudev, upon whose death in 1893 his eldest son Sadashiv was the Officiator.",
      "type": "background",
      "date": "1893",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Sadashiv died in 1901 and was succeeded by Purshottam, who was Officiator till the year 1921 when, because of the disqualification incurred by him, a deputy was appointed in his place.",
      "type": "background",
      "date": "1901",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Purshottam died in 1940 and his son the plaintiff-appellant Laxman became the Officiator.",
      "type": "background",
      "date": "1940",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In the year 1914 the descendants of Krishnarao, who were till then joint, effected a partition of the family property which consisted of inam and Watan lands in various villages including the villages of Solsumbha, Maroli and Vavji. The document embodying the partition is Ex. 49.",
      "type": "material",
      "date": "1914",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Under the 1914 partition, lands which had so far been assigned for remuneration of the Patilki of Solsumbha were allotted to the branch of the defendants while some other lands were given to the branch of the plaintiff.",
      "type": "material",
      "date": "1914",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Purshottam had not subscribed to the partition deed in the beginning but later on he acquiesced in it and the Courts below held that he was a party to the partition.",
      "type": "procedural",
      "date": "1914",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "After Purshottam incurred disqualification, the deputies who acted for him were not allowed to take possession of the lands of Solsumbha inspite of the objections raised by these persons. They were instead allowed a remuneration of Rs. 240/- per annum which was to be paid by the members of the family in possession of the Watan lands.",
      "type": "material",
      "date": "1921",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "This position continued till 1946.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "After the death of Purshottam the plaintiff was initially appointed Patil for five years. But eventually he was appointed officiator for life.",
      "type": "procedural",
      "date": "1940",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "In the year 1944 the plaintiff moved the Government, vide Ex. 47, for the resumption of the Watan lands which were in the possession of defendants 2 to 4 and for making them over to him.",
      "type": "procedural",
      "date": "1944",
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "The Government, after causing some enquiry to be made, resumed those lands by its order dated October 9, 1946, Ex. 36, and directed their restoration to the plaintiff.",
      "type": "procedural",
      "date": "1946-10-09",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "The defendants thereafter moved the Government for reconsideration of that order.",
      "type": "procedural",
      "date": "1946",
      "source": "respondent"
    },
    {
      "id": "f19",
      "text": "The Government eventually modified its previous order by directing that the defendants 2 to 4, who were in possession of the lands, should continue to retain it but that they should pay such amount of rent as may be fixed by Government from time to time. This order was passed on May 2, 1947, and by virtue of that order the rent payable by defendants 2 to 4 was raised from Rs. 240/- to Rs. 1,000/-.",
      "type": "procedural",
      "date": "1947-05-02",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "The plaintiff thereupon instituted the suit for a declaration that the order of the Government dated May 2, 1947, and an ancillary order dated March 1, 1949, are null and void and inoperative; that the defendants should remove all obstruction and hindrances caused to the property acquired by the plaintiff as Watan grant and give the same into the plaintiffs possession; that the defendants should render to the plaintiff the account of the income from his property and pay him the costs of the suit.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f21",
      "text": "The suit was resisted by the defendants, the first of whom was the State of Bombay, on various grounds including that the orders complained of were administrative orders and no suit lies to set them aside, that the suit was barred by s. 4(b) of the Bombay Act 10 of 1876 and that the suit was barred by limitation.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f22",
      "text": "When the defendants preferred an appeal before the District judge they confined their attack to the decree to one ground only and that was about the competence of Government to reconsider the order of 1946.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f23",
      "text": "Trial court decreed in favour of plaintiff-appellant. District Judge, Thana, set aside the decree. Bombay High Court in Second Appeal No. 1533 of 1952 affirmed the decree of the District Judge dated February 17, 1955.",
      "type": "procedural",
      "date": "1955-02-17",
      "source": "lower_court"
    },
    {
      "id": "f24",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order of the Collector under s.12 of the Bombay Hereditary Offices Act, 1874 is administrative in character or quasi-judicial.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Government had competence to reconsider, revise or review its order dated October 9, 1946 passed under s.79 of the Watan Act in the absence of a provision empowering it to do so.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the suit is barred by s.4(b) of Bombay Act 10 of 1876 (Bombay Revenue Jurisdiction Act) or s.4(a).",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order made by Government on October 9, 1946, was a judicial order passed by the Government in exercise of its revisional jurisdiction under s.79 of the Watan Act and it was not competent to the Government to revise or review that order in the absence of a provision in the Act empowering the Government to do so.",
      "supporting_facts": [
        "f17",
        "f19"
      ],
      "legal_basis": "Bombay Hereditary Offices Act, 1874 ss.79, 11, 12"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The orders complained of were administrative orders and no suit lies to set them aside.",
      "supporting_facts": [
        "f17",
        "f19"
      ],
      "legal_basis": "Bombay Hereditary Offices Act, 1874 s.12, s.74"
    },
    {
      "id": "ra2",
      "text": "The suit was barred by the provisions of s.4(b) of the Bombay Act 10 of 1876.",
      "supporting_facts": [
        "f20"
      ],
      "legal_basis": "Bombay Revenue Jurisdiction Act, 1876 s.4(b)"
    },
    {
      "id": "ra3",
      "text": "The discretion conferred upon the Collector by s.12 either to evict a person in wrongful possession or to require him to pay rent is of an administrative nature and therefore the order of the Collector made under s.12 can be varied from time to time by the Collector or can be challenged only by appeal or revision under the Act.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "Bombay Hereditary Offices Act, 1874 ss.11, 12"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Before action under s.12, the Collector has to make a declaration under s.11 supported by reasons in writing after holding an enquiry hearing both parties, so procedure is quasi-judicial. The order under s.12 affects rights, appealable under s.77, revisable under s.79, hence not administrative.",
      "addresses_issue": "i1",
      "key_observation": "The whole process including order under s.12 is quasi-judicial."
    },
    {
      "id": "cr2",
      "text": "The enquiry under s.11 is quasi-judicial; discretion under s.12 does not make it administrative as it resolves lis between Watandar and alienee.",
      "addresses_issue": "i1",
      "key_observation": "Even discretion in judicial proceedings does not convert to administrative."
    },
    {
      "id": "cr3",
      "text": "Distinguishes English cases like Robinson as scheme different; relies on Gullapalli and Ghanshyam Das Gupta for quasi-judicial where lis and duty to act judicially.",
      "addresses_issue": "i1",
      "key_observation": "Here there is lis between Watandar out of possession and alienee."
    },
    {
      "id": "cr4",
      "text": "Government's order Oct 1946 under s.12(a) read with s.79 after enquiry is quasi-judicial; no power to review absent express provision; subsequent order May 1947 ultra vires.",
      "addresses_issue": "i2",
      "key_observation": "Finality attaches to order under s.79."
    },
    {
      "id": "cr5",
      "text": "No relief sought against Government; prayers redundant or misjoinder; suit not for claim against Government re hereditary office property; orders null and void ab initio.",
      "addresses_issue": "i3",
      "key_observation": "Civil courts can examine if tribunal acted within jurisdiction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The order of a Collector under s.12 is quasi-judicial, not administrative.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Government's order of October 1946 quasi-judicial under s.79; subsequent order of May 2, 1947 ultra vires and beyond jurisdiction.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Suit not barred by s.4(a) or s.4(b) of Bombay Revenue Jurisdiction Act, 1876 as no relief against Government and orders null ab initio.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gullapalli Nageswara Rao v. Andhra Pradesh Road Transport Corporation",
      "citation": "1959 Supp 1 SCR 319",
      "treatment": "followed",
      "relevance": "Order quasi-judicial where lis and duty to act judicially even against authority."
    },
    {
      "case_name": "Board of High School and Intermediate Education U.P. v. Ghanshyam Das Gupta",
      "citation": "1962 Supp 2 SCR 36",
      "treatment": "followed",
      "relevance": "Quasi-judicial when contest between authority and person opposing, statute imposes judicial duty."
    },
    {
      "case_name": "Robinson v. Minister of Town and Country Planning",
      "citation": "1947 1 All ER 851",
      "treatment": "distinguished",
      "relevance": "Different scheme; criticised; enquiry quasi-judicial but final decision administrative."
    },
    {
      "case_name": "Franklin v. Minister of Town and Country Planning",
      "citation": "1948 AC 87",
      "treatment": "distinguished",
      "relevance": "Minister's role different; no lis."
    },
    {
      "case_name": "Ramrao Jankiram Kadam v. State of Bombay",
      "citation": "1963 Supp 1 SCR 322",
      "treatment": "followed",
      "relevance": "S.4(c) Bombay Revenue Jurisdiction Act not bar where purported act null and void."
    },
    {
      "case_name": "Bhujangrao Daulatrao v. Malojirao Daulatrao",
      "citation": "1952 SCR 402",
      "treatment": "distinguished",
      "relevance": "Bar under s.4 where claim against Crown re Saranjam lands; here no relief against Govt."
    },
    {
      "case_name": "Province of Bombay v. Hormusji",
      "citation": "1947 LR 74 IA 103",
      "treatment": "referred",
      "relevance": "Civil courts jurisdiction to decide ultra vires."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Hereditary Offices Act, 1874",
      "sections": [
        "s.5",
        "s.7",
        "s.11",
        "s.12",
        "s.74",
        "s.77",
        "s.79"
      ],
      "relevance": "Prohibits alienation without sanction; Collector declares null/void (s.11), evict/levy rent (s.12) quasi-judicial; appeal s.77, revision s.79; no review power."
    },
    {
      "name": "Bombay Revenue Jurisdiction Act, 1876",
      "sections": [
        "s.4(a)",
        "s.4(b)"
      ],
      "relevance": "Bars civil court jurisdiction over claims against Govt re hereditary office property; not applicable here as no relief against Govt, orders null."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; decision of Bombay High Court reversed; decree of trial court restored declaring Govt orders of May 2, 1947 and March 1, 1949 null and void; defendants to deliver possession of Watan lands to plaintiff and render accounts.",
    "relief_granted": "Declaration orders null/void; possession of Watan lands; accounts of income.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We must, therefore, hold that the whole process, including the order made under s.12 of the Act, is a quasi-judicial one and not administrative as contended for by the defendants-respondents.",
      "speaker": "court",
      "significance": "Core holding on nature of proceedings under ss.11-12."
    },
    {
      "text": "Finality attaches to the Governments order under s.79 and in the absence of any express provision empowering it to review the order we are clear that the subsequent order made by the Government on May 2, 1947 is ultra vires and beyond its jurisdiction.",
      "speaker": "court",
      "significance": "Determines invalidity of review order."
    },
    {
      "text": "It is settled law that the civil courts have the power and jurisdiction to consider and decide whether a tribunal of limited jurisdiction has acted within the ambit of the powers conferred upon it by the statute.",
      "speaker": "court",
      "significance": "Affirms civil court jurisdiction over ultra vires acts."
    }
  ],
  "_case_id": "1962_403",
  "_label": 1,
  "_text_length": 33629,
  "_extracted_at": "2026-02-10T20:02:51.774054"
}