{
  "metadata": {
    "case_name": "Official Assignee, High Court, Bombay v. Respondents (firm T.A. Doshi creditors)",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 291 of 1960",
    "date_of_judgment": "1962-11-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On January 25, 1950, a petition (I.P. No. 2 of 1950) was presented in District Court, Bellary, by some creditors of the firm T.A. Doshi, Bombay (the firm) for adjudicating the firm as insolvent.",
      "type": "procedural",
      "date": "1950-01-25",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Pending adjudication in Bellary, the District Court appointed Official Receiver as interim Receiver at instance of petitioning creditors; Receiver authorised to take possession of certain goods of insolvent in transit to Bombay, took possession, disposed of them under court orders, and deposited sale-proceeds in court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Respondents claimed entitlement to part of deposited money as Railway Receipt for goods sold was made over to them by insolvent for consideration; they borrowed from bank on its security and faced repayment demand after seizure.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "District Court allowed respondents' application; permitted withdrawal of amount on giving security and undertaking to redeposit with 6% interest when called upon; respondents withdrew on April 6, 1950. Claim remains untried.",
      "type": "procedural",
      "date": "1950-04-06",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "On April 14, 1950, similar insolvency petition (I.P. No. 52 of 1950) filed against firm by other creditors on original side of Bombay High Court.",
      "type": "procedural",
      "date": "1950-04-14",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Bombay High Court passed adjudication order on April 17, 1950; all properties of insolvent vested in Official Assignee of Bombay.",
      "type": "procedural",
      "date": "1950-04-17",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Official Assignee moved District Court, Bellary (I.A. No. 183 of 1950) to stay proceedings there and transfer assets, books to Bombay; respondents made parties.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "On December 13, 1950, Bellary District Court passed adjudication order and on Official Assignee's application: directed its Official Receiver to move Bombay HC to annul its April 17, 1950 order; status quo pending; if Bombay decides for administration there, hand over assets to Official Assignee.",
      "type": "procedural",
      "date": "1950-12-13",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Respondents preferred appeal against December 13, 1950 order of Bellary Court.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Official Receiver took no action on direction to move Bombay HC for long time.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Official Receiver moved Bombay HC for annulment; Bombay HC declined, directed continuance as estate more conveniently administered in Bombay.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "On October 15, 1951, Official Assignee filed I.A. No. 171 of 1951 in Bellary Court noting non-compliance, seeking direction to respondents to deposit withdrawn amounts with interest, transfer sums, assets, books, file to Bombay.",
      "type": "procedural",
      "date": "1951-10-15",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Bellary Court, apprised of Bombay HC refusal to annul, allowed Official Assignee's application: directed Official Receiver to transmit accounts/deposits; respondents to refund withdrawn amounts with 6% interest for transfer to Bombay.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Respondents appealed Bellary Court's order to Andhra High Court at Guntur (Appeal against order No. 94 of 1952); High Court allowed appeal, held Official Assignee's application did not satisfy s.77 Provincial Insolvency Act, more convenient to administer at Kurnool District Court post-reorganisation.",
      "type": "procedural",
      "date": "1955-10-21",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "In whom does the property of the insolvent vest: Official Assignee (Bombay High Court under Presidency Act) or Official Receiver (Bellary District Court under Provincial Act), considering dates of adjudication and relation back provisions?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Official Assignee's application (I.A. 171/1951) satisfied requirements of s.77 Provincial Insolvency Act for transfer of assets, or required formal request from Bombay High Court?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Bellary Court's December 13, 1950 order was final and operative post Bombay HC's refusal to annul.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Property vested in Official Assignee upon Bombay HC adjudication on April 17, 1950 (relating back to March 14, 1950 per s.51 Presidency Act); Bellary adjudication on Dec 13, 1950 cannot divest it via relation back to Jan 25, 1950 (s.28(7) Provincial Act), as vesting under s.17 Presidency Act is statutory and prior.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "Presidency Towns Insolvency Act ss.17, 51; Provincial Insolvency Act ss.28(2), 28(7)"
    },
    {
      "id": "pa2",
      "text": "Official Assignee's I.A. 171/1951 not under s.77 but enforcing Bellary's own Dec 13, 1950 order (non-complied by Receiver); post Bombay refusal to annul, order fully operative directing transfer.",
      "supporting_facts": [
        "f8",
        "f10",
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": "Provincial Insolvency Act s.77; res judicata"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Official Assignee's application did not meet s.77 requirements (no request from Bombay HC); more convenient to administer estate at Kurnool/Bellary.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Provincial Insolvency Act s.77"
    },
    {
      "id": "ra2",
      "text": "Though Bombay HC principal court, subsidiary claim re Railway Receipt can be tried at Bellary for convenience.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Property vests in Official Assignee on making of adjudication order (s.17 Presidency Act); Bellary's later order cannot divest via relation back (s.28(7) Provincial Act has no divesting provision); relation back aids recovery from third parties, not divesting prior vesting.",
      "addresses_issue": "i1",
      "key_observation": "Vesting under s.17 is statutory; no purpose in divesting for creditor protection."
    },
    {
      "id": "cr2",
      "text": "s.77 requires court-to-court request, not officer's application; but here Official Assignee enforced Bellary's own Dec 13, 1950 order (final, res judicata, parties included), fully operative post Bombay refusal.",
      "addresses_issue": "i2",
      "key_observation": "Application corollary to earlier order; s.77 not applicable."
    },
    {
      "id": "cr3",
      "text": "Bellary Dec 13 order final; Bombay principal court for entire proceedings, but liberty to respondents to seek trial of their claim there for convenience.",
      "addresses_issue": "i3",
      "key_observation": "No opinion on subsidiary trial venue; remit to Bombay HC discretion."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Insolvent's property validly vested in Official Assignee, Bombay; not divested by later Bellary adjudication.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Bellary District Court order directing transfer restored; s.77 inapplicable as enforcing own prior final order.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Respondents liberty to apply to Bombay HC within 2 months for their claim trial at Bellary; else redeposit and transfer.",
      "resolves_issue": "i3",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Official Assignee of Madras v. Official Assignee of Rangoon by his Agent Subramania Aiyar",
      "citation": "I.L.R. 42 Mad. 121",
      "treatment": "followed",
      "relevance": "Prior adjudication vests property in that court's Official Assignee; later adjudication (even on earlier acts) does not divest."
    },
    {
      "case_name": "In re King Co.",
      "citation": "30 Cal. 542",
      "treatment": "referred",
      "relevance": "s.77 requires formal court request/letter, not officer's application."
    }
  ],
  "statutes_cited": [
    {
      "name": "Presidency Towns Insolvency Act",
      "sections": [
        "Section 17",
        "Section 51",
        "Section 126"
      ],
      "relevance": "s.17: vesting on adjudication; s.51: relation back to act of insolvency; s.126: courts auxiliary like s.77."
    },
    {
      "name": "Provincial Insolvency Act",
      "sections": [
        "Section 28(2)",
        "Section 28(7)",
        "Section 77"
      ],
      "relevance": "s.28(2): vesting on adjudication; s.28(7): relation back to petition date; s.77: courts auxiliary via formal request."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; Andhra High Court order set aside; Bellary District Court order restored with modification giving respondents liberty to apply to Bombay HC within 2 months for trial of their claim at Bellary, else redeposit withdrawn amount with interest for transfer to Bombay.",
    "relief_granted": "Transfer of assets/books to Bombay Official Assignee; conditional liberty on respondents' claim.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the property of the insolvent vests in the Official Assignee by virtue of the operation of s. 17 of the Presidency Act.\"",
      "speaker": "court",
      "significance": "Core holding on priority of vesting."
    },
    {
      "text": "\"the doctrine of relating back ... could have no application in the present case because the vesting in the Official Assignee is the result of a statutory provision\"",
      "speaker": "court",
      "significance": "Explains why relation back does not divest prior vesting."
    },
    {
      "text": "\"the order passed by the District Court directing the transfer ... was, in a sense, a corollary to the earlier order passed by it on December 13, 1950.\"",
      "speaker": "court",
      "significance": "Justifies s.77 inapplicability."
    }
  ],
  "_case_id": "1962_85",
  "_label": 1,
  "_text_length": 25253,
  "_extracted_at": "2026-02-10T19:57:55.315069"
}