{
  "metadata": {
    "case_name": "Appellants v. Respondent No. 1",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Criminal Appeal No. 5 of 1960",
    "date_of_judgment": "1962-01-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants convicted by Panchayati Adalat on February 5, 1950, for offence under s. 379 IPC and sentenced to fine of Rs. 75/- each",
      "type": "material",
      "date": "1950-02-05",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Revision against conviction order dismissed by Allahabad High Court on May 13, 1953",
      "type": "procedural",
      "date": "1953-05-13",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Proceedings initiated in January 1958 for recovery of fine imposed by Panchayati Adalat",
      "type": "procedural",
      "date": "1958-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Objection raised in revision that fine recovery barred by s. 70 IPC; Sub-Divisional Magistrate held recovery barred on February 6, 1958",
      "type": "procedural",
      "date": "1958-02-06",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Revision to District Magistrate who recommended setting aside Sub-Divisional Magistrate's order on ground of no period of limitation",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Allahabad High Court accepted District Magistrate's recommendation by order dated September 7, 1959, holding no limit to time for realising fines by Panchayati Adalat",
      "type": "procedural",
      "date": "1959-09-07",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appeal by special leave against High Court order",
      "type": "procedural",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Applicability of s. 70 of the Indian Penal Code to fines imposed in convictions for offences under IPC tried by Panchayati Adalats",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether period of limitation under s. 70 IPC starts from date of Panchayati Adalat conviction or from dismissal of revision by High Court",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Fine recovery barred under s. 70 IPC as six years expired from date of Panchayati Adalat conviction; s. 70 applies even to Panchayati Adalats as U.P. Panchayat Raj Act does not make it inapplicable and s. 94 provides for recovery by Sub-Divisional Magistrate as if passed by him",
      "supporting_facts": [
        "f1",
        "f3",
        "f4"
      ],
      "legal_basis": "s. 70 IPC; U.P. Panchayat Raj Act ss. 52, 54, 83, 94"
    },
    {
      "id": "pa2",
      "text": "Terminus quo under s. 70 IPC is date of sentence by Panchayati Adalat, not High Court revision dismissal, as appeal/revision does not arrest sentence unless ordered",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "s. 70 IPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No period of limitation for recovery of fines imposed by Panchayati Adalat; s. 70 IPC not applicable to convictions by Panchayati Adalats",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "U.P. Panchayat Raj Act ss. 52, 54, 83, 94; Rule 82"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s. 70 IPC applies to fines by Panchayati Adalats as U.P. Panchayat Raj Act does not prescribe limitation or exclude s. 70 IPC; s. 83 makes CrPC, Evidence Act, Limitation Act inapplicable only to extent not made applicable by Act, but Act silent on limitation for fines; s. 94 supports applicability as SDM recovers as if fine passed by him",
      "addresses_issue": "i1",
      "key_observation": "District Magistrate and High Court erred in holding s. 70 IPC inapplicable"
    },
    {
      "id": "cr2",
      "text": "Under s. 70 IPC, terminus quo is date of sentence by court passing it (Panchayati Adalat); revision/appeal does not arrest sentence operation unless specifically ordered",
      "addresses_issue": "i2",
      "key_observation": "Limitation starts from Panchayati Adalat conviction date, not High Court revision dismissal"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s. 70 IPC applies to recovery of fines imposed by Panchayati Adalats; recovery barred after six years from conviction date",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Limitation period under s. 70 IPC runs from date of Panchayati Adalat sentence, not High Court revision dismissal",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 70",
        "s. 379"
      ],
      "relevance": "s. 70 provides six-year limitation for fine recovery; applies to Panchayati Adalat fines; s. 379 offence convicted under"
    },
    {
      "name": "U.P. Panchayat Raj Act, 1947",
      "sections": [
        "s. 52",
        "s. 54",
        "s. 83",
        "s. 94"
      ],
      "relevance": "s. 52: offences cognizable by Panchayati Adalats; s. 54: penalties; s. 83: CrPC, Evidence Act, Limitation Act inapplicable except as per Act; s. 94: recovery of fines, including by SDM as if passed by him"
    },
    {
      "name": "U.P. Panchayat Raj Rules",
      "sections": [
        "Rule 82"
      ],
      "relevance": "Deals with writing off irrecoverable fines; no provision on limitation period"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order set aside; recovery of fine held barred under s. 70 IPC from date of Panchayati Adalat conviction",
    "relief_granted": "Recovery proceedings quashed as time-barred",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "In our opinion the District Magistrate as well as the High Court were in error in holding that the period of limitation provided by s. 70 of the Indian Penal Code is inapplicable to the recovery of fines imposed by Panchayati Adalats.",
      "speaker": "court",
      "significance": "Core holding that s. 70 IPC applies"
    },
    {
      "text": "the language of s. 70 prescribes the terminus quo to be the date of passing of the sentence by Court which passes such order and the filing of appeal or revision does not, unless specifically ordered, arrest the operation of the order",
      "speaker": "court",
      "significance": "Clarifies starting point of limitation period"
    }
  ],
  "_case_id": "1962_395",
  "_label": 1,
  "_text_length": 5238,
  "_extracted_at": "2026-02-10T20:02:29.523048"
}