{
  "metadata": {
    "case_name": "Appellants (Tenants) v. Respondent No. 1 (Landlord)",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 646 of 1961",
    "date_of_judgment": "1962-01-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are five tenants evicted from certain shops and chobaras in the town of Patiala.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Landlord (first respondent) made application in June 1957 under s.13 of the Patiala and East Punjab States Union Urban Rent Restriction Ordinance, 2006 BK No. VIII of 2006 BK.",
      "type": "procedural",
      "date": "1957-06",
      "source": "landlord"
    },
    {
      "id": "f3",
      "text": "Grounds urged by landlord: (a) non-payment of rent by tenants, (b) non-payment of house tax by tenants, (c) shops in state of great disrepair and dilapidated, landlord wished to rebuild after dismantling, obtained sanction of Municipal Committee to proposed plan of construction, accumulated some building material.",
      "type": "disputed",
      "date": null,
      "source": "landlord"
    },
    {
      "id": "f4",
      "text": "Tenants resisted the application.",
      "type": "procedural",
      "date": null,
      "source": "tenants"
    },
    {
      "id": "f5",
      "text": "Rent Controller framed issues on three grounds; first two ceased to be material.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Rent Controller on third ground: Building hardly in dilapidated condition (solitary witness admitted not seen inside, landlord did not give evidence); ample evidence building in good condition.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Landlord's financial status: Witnesses knew nothing of means; brother could not give details; plan required Rs.20,000; income Rs.200 per month, family of wife and five children.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "40 bags of cement purchased but greater part used in building latrines, remainder insufficient.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Rent Controller decided issue against landlord.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellate authority confirmed findings: shops and chobaras in good condition, landlord not in good faith as no means to build.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Revision application filed in Punjab High Court under s.15(5) of East Punjab Urban Rent Restriction Act, 1949.",
      "type": "procedural",
      "date": null,
      "source": "landlord"
    },
    {
      "id": "f12",
      "text": "High Court allowed revision: Landlord genuinely wants to rebuild; actual condition irrelevant; referred to offer to put tenants back if not demolished within month; ordered eviction with two months to vacate.",
      "type": "procedural",
      "date": "1961-04-07",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "High Court referred to earlier decision Civil Revision No.223 of 1960 by Gosain J.: Only point is whether requirement bona fide; condition irrelevant.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the revision application is competent under s.16(4) of the Ordinance, as decision of appellate authority final, and s.15(5) of East Punjab Act does not apply.",
      "framed_by": "appellants"
    },
    {
      "id": "i2",
      "text": "Whether interpretation of s.13(3)(a)(iii) read with s.13(3)(b) correct: bona fides of landlord's claim to rebuild requires consideration of surrounding circumstances like building condition, means etc., or only intention.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether High Court could reverse concurrent findings of fact without re-appraising evidence.",
      "framed_by": "appellants"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Revision application incompetent because under s.16(4) of Ordinance, appellate authority decision final, not liable to revision; s.15(5) of East Punjab Act does not apply.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "s.16(4) Patiala Ordinance; s.15(5) East Punjab Act"
    },
    {
      "id": "pa2",
      "text": "High Court erred in interpretation of s.13(3)(a)(iii) and reversing concurrent findings without re-appraising evidence.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8",
        "f9",
        "f10"
      ],
      "legal_basis": "s.13 Patiala Ordinance"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Revision application maintainable, relying on Moti Ram v. Suraj Bhan.",
      "supporting_facts": [],
      "legal_basis": "Moti Ram v. Suraj Bhan"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Even if revision lay, High Court erred in interpretation: s.13 requires Controller satisfied claim bona fide, considering surrounding circumstances like condition of building, situation, profitable use, means of landlord etc.; not just stated intention.",
      "addresses_issue": "i2",
      "key_observation": "Claim must be honest in circumstances; interpretation by Punjab High Court too narrow."
    },
    {
      "id": "cr2",
      "text": "Rent Acts purpose defeated if landlords evict on bare plea without establishing bona fides re circumstances.",
      "addresses_issue": "i2",
      "key_observation": "Two tribunals thoroughly examined and found no dilapidation, no means."
    },
    {
      "id": "cr3",
      "text": "High Court powers under s.15(5) do not include reversing concurrent findings without showing error or re-examining evidence; Judge concluded without discussing evidence.",
      "addresses_issue": "i3",
      "key_observation": "No attempt to demonstrate impropriety of order."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Controller must consider all circumstances (condition, means etc.) to satisfy bona fides of claim under s.13(3)(a)(iii).",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court cannot reverse concurrent findings without reasons or re-appraisal.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Moti Ram v. Suraj Bhan",
      "citation": null,
      "treatment": "followed",
      "relevance": "Revision maintainable in analogous circumstances."
    },
    {
      "case_name": "Civil Revision No. 223 of 1960 (Gosain J.)",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Narrow view that only bona fide intention matters, condition irrelevant; too narrow construction."
    }
  ],
  "statutes_cited": [
    {
      "name": "Patiala and East Punjab States Union Urban Rent Restriction Ordinance, 2006 BK No. VIII of 2006 BK",
      "sections": [
        "s.13(1)",
        "s.13(3)(a)",
        "s.13(3)(a)(iii)",
        "s.13(3)(b)",
        "s.13(4)",
        "s.16(4)"
      ],
      "relevance": "Governs eviction for rebuilding; requires bona fide claim considering circumstances; appellate finality."
    },
    {
      "name": "East Punjab Urban Rent Restriction Act, 1949 (Act 3 of 1949)",
      "sections": [
        "s.15(5)"
      ],
      "relevance": "Revision powers of High Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order dated April 7, 1961 set aside; order of appellate authority restored (eviction denied).",
    "relief_granted": "Restoration of appellate authority order in favor of tenants.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The Controller has to be satisfied about the genuineness of the claim. To reach this conclusion, obviously the Controller must be satisfied about the reality of the claim made by the landlord, and this can only be established by looking at all the surrounding circumstances\".",
      "speaker": "court",
      "significance": "Defines scope of bona fides inquiry under s.13."
    },
    {
      "text": "\"It is not enough that the landlord comes forward, and says that he entertains a particular intention, however strongly, said to be entertained by him.\"",
      "speaker": "court",
      "significance": "Rejects bare intention test."
    },
    {
      "text": "\"The very purpose of the Rent Restriction Acts would be defeated, if the landlords were to come forward and to get tenants turned out, on the bare plea that they want to reconstruct the houses\".",
      "speaker": "court",
      "significance": "Explains legislative purpose."
    }
  ],
  "_case_id": "1962_98",
  "_label": 1,
  "_text_length": 14039,
  "_extracted_at": "2026-02-10T19:57:54.780327"
}