{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. Afco Private Ltd.",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 21 of 1962",
    "date_of_judgment": "1962-10-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "For the year of account ending March 31, 1955, Afco Private Ltd. earned a total income which was finally computed in assessment proceedings by order of the Income-tax Tribunal, at Rs. 49,843/-",
      "type": "material",
      "date": "1955-03-31",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The company declared a dividend of Rs. 11,712/- on July 13, 1955, and before the close of the year of assessment 1955-56 declared an additional dividend of Rs.5,612/-, thereby distributing in the aggregate dividend which was not less than 60% of the total income, reduced by the income-tax and super-tax payable by it.",
      "type": "material",
      "date": "1955-07-13",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The company then claimed rebate at the rate of one anna in the rupee on the amount computed according to Schedule 1, Part 1, Item B read with s. 2 of the Finance Act 15 of 1955.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "The Income-tax Officer and the Appellate Assistant Commissioner rejected the claim because in their view the claimant was a company to which the provisions of s. 23A of the Income-tax Act could be made applicable.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "In appeal, the Income-tax Appellate Tribunal, Bombay, reversed the order of the Income-tax authorities.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The Tribunal opined that the expression 'cannot be made applicable' in Item B of Part 1 of Schedule 1 of Finance Act 15 of 1955 must be read in conjunction with s. 23A of the Income-tax Act, and the benefit of rebate provided by the Finance Act, 1955, cannot be denied to a Private Company if the conditions prescribed in s. 23A are fulfilled.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The following question referred by the Tribunal to the High Court of judicature at Bombay was answered in the affirmative: Whether on the facts and in the circumstances of the case, the assessee company having distributed dividends of over 60% of the company's total income less income-tax and super-tax payable thereon is entitled to the rebate of 1 anna per rupee on the undistributed balance of profits as provided in clause (1) of the proviso to item B of Part 1 of the 1st Schedule to the Finance Act of 1955?",
      "type": "procedural",
      "date": "1958-09-23",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appeal by special leave from the judgment and order dated September 23, 1958, of the Bombay High Court in I.T. Reference No. 87 of 1957.",
      "type": "procedural",
      "date": "1958-09-23",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the assessee company having distributed dividends of over 60% of the company's total income less income-tax and super-tax payable thereon is entitled to the rebate of 1 anna per rupee on the undistributed balance of profits as provided in clause (1) of the proviso to item B of Part 1 of the 1st Schedule to the Finance Act of 1955?",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Interpretation of the expression 'a company to which the provisions of section 23A of the Income-tax Act cannot be made applicable' in Item B of Part 1 of Schedule 1 of Finance Act 15 of 1955 - whether it refers to companies against which an order under s.23A can never be made, or only where an order cannot be made in the circumstances.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The claimant was a company to which the provisions of s. 23A of the Income-tax Act could be made applicable. The expression 'company to which the provisions of s. 23A of the Income-tax Act cannot be made applicable' is descriptive of a class of companies against which in no circumstances can an order under s. 23A be made, and private limited companies being companies in respect of which an order under s. 23A can be made if the conditions prescribed relating to distribution of dividend are fulfilled, the benefit of rebate is not admissible in their favour.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 23A of the Income-tax Act; Finance Act 15 of 1955 Schedule 1 Item B"
    },
    {
      "id": "pa2",
      "text": "Legislative history of Finance Acts of 1956 and 1957 supports restricting rebate to public companies.",
      "supporting_facts": [],
      "legal_basis": "Finance Acts of 1956 and 1957"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The expression 'cannot be made applicable' must be read in conjunction with s. 23A of the Income-tax Act, and the benefit of rebate cannot be denied to a Private Company if the conditions prescribed in s. 23A are fulfilled.",
      "supporting_facts": [
        "f2",
        "f5",
        "f6"
      ],
      "legal_basis": "Section 23A of the Income-tax Act; Finance Act 15 of 1955 Schedule 1 Item B"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Legislature has used the expression 'cannot be made applicable' which clearly means that the applicability of s. 23A depends upon an order to be made by the Income-tax Officer, and not upon any exclusion by the provisions of the Act.",
      "addresses_issue": "i2",
      "key_observation": "Before an order can be made under s. 23A, the Income-tax Officer has to ascertain (i) whether the company conforms to the description in sub-s. (9) of s. 23A; if it does the Income-tax Officer has no power to make an order and (ii) if the company is not one which falls within cl. (9) of s. 23A whether having regard to inadequacy of the declaration of dividend, an order for payment of super-tax should not, because of the losses incurred by the company in the earlier years, or to the smallness of the profits in the previous year, be made."
    },
    {
      "id": "cr2",
      "text": "The language used by the Legislature clearly indicates that it is only when an order under s. 23A will not, having regard to the circumstances be justified that the right to obtain rebate under the Finance Act 15 of 1955 is claimable. The Legislature has not enacted that the benefit of rebate is admissible only to companies against which the order under sub-s. (1) of s. 23A can never be made.",
      "addresses_issue": "i2",
      "key_observation": "Legislative history as disclosed by the earlier Finance Acts supports this interpretation."
    },
    {
      "id": "cr3",
      "text": "The legislative history instead of supporting the case of the Income-tax Department yields inference against their interpretation.",
      "addresses_issue": "i2",
      "key_observation": "If it was intended to exclude private limited companies from the benefit of rebate the Legislature would have adopted the same phraseology as was used in that Act in dealing with the rebates in prescribing rates of super-tax."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Income-tax Appellate Tribunal and the High Court were right in holding that the expression 'cannot be made applicable' only refers to a state of affairs in which having regard to the circumstances an order under s. 23A of the Indian Income-tax Act cannot be made.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The company was entitled to the rebate claimed by it.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "Section 23A(1)",
        "Section 23A(9)",
        "Section 18(3)"
      ],
      "relevance": "Provisions for ordering super-tax on undistributed balance if dividends less than 60% of total income reduced by taxes; exclusion for companies in which public substantially interested; private companies under Companies Act 1913 deemed not substantially interested."
    },
    {
      "name": "Finance Act 15 of 1955",
      "sections": [
        "Schedule 1 Part 1 Item B",
        "Section 2"
      ],
      "relevance": "Prescribed rates of tax and rebate of one anna per rupee on excess where total income reduced exceeds dividends declared and company to which s.23A cannot be made applicable."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [
        "Definition of private company"
      ],
      "relevance": "Private company as defined is not a company in which public substantially interested for purposes of s.23A."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Bombay High Court's affirmative answer to the reference question, holding that Afco Private Ltd. was entitled to the rebate of one anna per rupee on the undistributed balance as it had distributed dividends exceeding 60% of total income less taxes, and provisions of s.23A could not be made applicable in the circumstances.",
    "relief_granted": "Rebate allowed to assessee company",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Legislature has used the expression 'cannot be made applicable' which clearly means that the applicability of s. 23A depends upon an order to be made by the Income-tax Officer, and not upon any exclusion by the provisions of the Act.",
      "speaker": "court",
      "significance": "Core interpretation of the key phrase determining eligibility for rebate."
    },
    {
      "text": "In our judgment the Income-tax Appellate Tribunal and the High Court were right in so holding.",
      "speaker": "court",
      "significance": "Affirmation of lower courts' decision in favor of assessee."
    }
  ],
  "_case_id": "1962_221",
  "_label": 0,
  "_text_length": 15326,
  "_extracted_at": "2026-02-10T19:59:15.410584"
}