{
  "metadata": {
    "case_name": "Petitioners v. Respondents (Deogad Gold Seizure Case)",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "SHAH, J."
    ],
    "case_number": "Writ Petition No. 65 of 1962",
    "date_of_judgment": "1962-10-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioners and others were in possession of evidence concerning commission of offences of conspiracy to smuggle gold from foreign countries into the port of Deogad in the District of Ratnagiri, contrary to the provisions of the Sea Customs Act and the Foreign Exchange Regulation Act.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "P. N. Kalyankar, Sub-Inspector of Customs and Central Excise, arrested the petitioners and produced them before the Judicial Magistrate First Class, Deogad.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "On December 29, 1961, the Government of Maharashtra promulgated a notification under s. 14 of the Code of Criminal Procedure, 1898 as amended by Bombay Act XXIII of 1951, appointing Mr. V. M. Gehani as a Special Judicial Magistrate having jurisdiction over the area comprising Greater Bombay and Ratnagiri District, and conferring upon him all the powers of a Presidency Magistrate in respect of the trial in the case involving the seizure of approximately 49,990 tolas of foreign gold known as the Deogad Gold Seizure Case.",
      "type": "procedural",
      "date": "1961-12-29",
      "source": "state_government"
    },
    {
      "id": "f4",
      "text": "On January 10, 1962, the Government of Maharashtra gave consent in writing under s. 196-A(2) of the Code of Criminal Procedure to the institution of criminal proceedings against the petitioners and eight others for offences under s. 120B IPC r/w s. 167(81) Sea Customs Act, s. 120B IPC r/w s. 8(1) FERA, and s. 120B IPC r/w s. 8(1) and s. 23 FERA.",
      "type": "procedural",
      "date": "1962-01-10",
      "source": "state_government"
    },
    {
      "id": "f5",
      "text": "H. R. Jokhi, Assistant Collector of Customs Central Excise, Marine Prevention Division, Collectorate of Central Excise Bombay, instituted a complaint in the Court of the Special Magistrate against 16 persons including the petitioners alleging conspiracy at Bombay, Janjira, Dabhol and Deogad and other places to smuggle large quantities of gold into India during October 1959 to end of April 1961, acquiring possession of 49,990 tolas of gold valued at over Rs. 70,00,000/- contrary to Sea Customs Act and FERA.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Petitioners applied to the Special Magistrate to be tried at Deogad or Ratnagiri as they are permanent residents of Deogad, carrying on occupations there, had arranged defence there, and it would be just and convenient; application rejected by Magistrate.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Petitioners moved High Court of Bombay for transfer to Deogad or Ratnagiri or direction to Special Magistrate to try there; application dismissed.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Petitioners filed petition in Supreme Court under Art. 32 for writ of certiorari quashing notification dated December 29, 1961, or declaring s.14 CrPC as amended ultra vires, and for trial at Deogad or Ratnagiri.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Petitioners are permanent residents of Deogad carrying on occupations there.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Offences alleged: conspiracy and substantive offences under Sea Customs Act and FERA at Bombay, Janjira, Dabhol, Deogad; importation at Deogad port.",
      "type": "disputed",
      "date": "1959-10 to 1961-04",
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether s. 14 of the Code of Criminal Procedure as amended by Bombay Act 23 of 1951 and the Notification dated December 29, 1961 appointing Mr. V.M. Gehani as Special Judicial Magistrate infringe Art. 14 of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Notification is discriminatory as it requires petitioners to travel to Bombay for trial causing inconvenience, unlike ordinary trials at local magistrate.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether appeal from Special Magistrate (with Presidency powers) directly to High Court discriminates compared to appeal to Sessions Court then revision to High Court if tried locally.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "s. 14 CrPC as amended by Bombay Act 23 of 1951 and Notification infringe Art. 14 by allowing appointment of Special Magistrate with Presidency powers over Greater Bombay and Ratnagiri.",
      "supporting_facts": [
        "f3",
        "f8"
      ],
      "legal_basis": "Art. 14 of Constitution"
    },
    {
      "id": "pa2",
      "text": "Notification discriminatory as petitioners must travel over 300 miles to Bombay where Magistrate normally sits, unlike others tried locally; Magistrates available in Deogad.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": "Art. 14; Bidi Supply Co. v. Union of India"
    },
    {
      "id": "pa3",
      "text": "Appeal lies directly to High Court from Special Magistrate, unlike two-tier appeal (Sessions then High Court) if tried locally, creating procedural discrimination.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Code of Criminal Procedure appeal provisions"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "s. 14 CrPC valid as upheld in M.K. Gopalan; amendment only adds consultation and allows Presidency towns, no substantive difference.",
      "supporting_facts": [],
      "legal_basis": "s. 14 CrPC; M.K. Gopalan v. State of MP"
    },
    {
      "id": "ra2",
      "text": "Notification constitutes Special Magistrate with jurisdiction over area including offence places; no prescription of sitting place; inconvenience not for court to speculate.",
      "supporting_facts": [
        "f3",
        "f7"
      ],
      "legal_basis": "s. 14 CrPC; no provision fixing Magistrate sittings"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s. 14 CrPC as amended valid; follows M.K. Gopalan; amendment removes Presidency town bar, requires High Court consultation; Special Magistrate can have Presidency powers.",
      "addresses_issue": "i1",
      "key_observation": "Law vesting discretion to appoint Special Magistrate not discriminatory under Art. 14."
    },
    {
      "id": "cr2",
      "text": "Notification valid; constitutes jurisdiction over Greater Bombay and Ratnagiri for this case; Bidi Supply irrelevant as it concerned transfer of pending case, not constitution of Special Magistrate for present/future cases.",
      "addresses_issue": "i1",
      "key_observation": "s. 14 covers particular cases, classes, or generally in local area, including future cases."
    },
    {
      "id": "cr3",
      "text": "No discrimination in inconvenience; Magistrate can sit anywhere in jurisdiction; High Court rejected transfer; conspiracy spans areas, Magistrate has jurisdiction over all.",
      "addresses_issue": "i2",
      "key_observation": "No duty to hold sittings in particular place; no ulterior purpose."
    },
    {
      "id": "cr4",
      "text": "Appeal difference arises from lawful conferment of Presidency powers, not discrimination; could have been filed in Bombay Presidency Magistrate court anyway.",
      "addresses_issue": "i3",
      "key_observation": "Incidental right of appeal follows jurisdiction type."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s. 14 of CrPC as amended by Bombay Act 23 of 1951 does not infringe Art. 14.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Notification dated Dec 29, 1961 appointing Special Magistrate valid and not discriminatory.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No discrimination in place of trial or appeal procedure.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "M. K. Gopalan v. State of Madhya Pradesh",
      "citation": "1955 1 S.C.R. 168",
      "treatment": "followed",
      "relevance": "s. 14 CrPC not discriminatory under Art. 14"
    },
    {
      "case_name": "Bidi Supply Company v. Union of India",
      "citation": "1956 S.C.R. 267",
      "treatment": "distinguished",
      "relevance": "Concerned transfer of pending assessment case under Income-tax Act; not applicable to constitution of Special Magistrate under s.14 CrPC"
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "s. 14",
        "s. 196-A(2)",
        "s. 6-A",
        "s. 20",
        "s. 182"
      ],
      "relevance": "Appointment of Special Magistrate, consent for prosecution, jurisdiction, appeal routes"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 14",
        "Art. 32"
      ],
      "relevance": "Equality before law; writ jurisdiction"
    },
    {
      "name": "Sea Customs Act, 1878",
      "sections": [
        "s. 167(81)"
      ],
      "relevance": "Offences of smuggling gold"
    },
    {
      "name": "Foreign Exchange Regulation Act, 1947",
      "sections": [
        "s. 8(1)",
        "s. 23"
      ],
      "relevance": "Offences of smuggling gold"
    },
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "s. 120B"
      ],
      "relevance": "Conspiracy offences"
    },
    {
      "name": "Bombay Act XXIII of 1951",
      "sections": [],
      "relevance": "Amends CrPC s.14 and adds s.6-A for Maharashtra"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court dismissed the writ petition, upholding the validity of s.14 CrPC as amended and the notification appointing the Special Magistrate, finding no infringement of Art. 14 or discrimination.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"a law vesting discretion in an authority to appoint a Special Magistrate under s. 14 of the Code of Criminal Procedure to try cases entirely under the normal Procedure cannot be regarded as discriminatory and is not hit by Art. 14 of the Constitution.\"",
      "speaker": "court",
      "significance": "Relies on M.K. Gopalan to uphold s.14"
    },
    {
      "text": "\"The constitution of a Special Magistrate does not amount either directly or indirectly to a transfer of any case.\"",
      "speaker": "court",
      "significance": "Distinguishes Bidi Supply case"
    },
    {
      "text": "\"There is no provision in the Code of Criminal Procedure which enjoins upon a Magistrate the duty to hold his sitting in any particular place.\"",
      "speaker": "court",
      "significance": "Rejects inconvenience argument"
    }
  ],
  "_case_id": "1962_360",
  "_label": 0,
  "_text_length": 22055,
  "_extracted_at": "2026-02-10T20:01:58.147906"
}