{
  "metadata": {
    "case_name": "Chinnaswamy Reddy v. State",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO, J."
    ],
    "case_number": "Criminal Appeal No. 6 of 1960",
    "date_of_judgment": "1962-07-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The house of Ramayya in Dudyia was burgled on the night of April 20, 1957. Ramayya and his wife were sleeping outside and on waking in the morning they found that the house had been burgled and valuable property stolen.",
      "type": "material",
      "date": "1957-04-20",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "The matter was reported to the police and during the course of investigation the police recovered 17 ornaments on the information given by the appellant.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "The other accused Hussain Saheb had also given information on the basis of which another stolen ornament was recovered.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Appellant stated that he would show the place where he had hidden the ornaments. Thereafter he went to the garden and dug out two bundles containing the seventeen ornaments from there.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "The other accused had stated that he had given the ornament to Bada Sab and took the police party to Bada Sab who returned the ornament.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Assistant Sessions Judge convicted appellant under s. 411 IPC and other accused under ss. 457 and 380 IPC.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Sessions Judge acquitted both accused on appeal, holding recovery from garden accessible to all, statement 'he had hidden the ornaments' inadmissible, and case against other accused doubtful.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Ramayya filed revision against acquittals in Andhra Pradesh High Court (Cr. Revision Case No. 403 of 1958 and Criminal Revision Petn. No. 337 of 1957).",
      "type": "procedural",
      "date": "1959-07-01",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "High Court allowed revision and directed retrial by Sessions Judge on original charges.",
      "type": "procedural",
      "date": "1959-07-01",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Only Chinnaswamy Reddy (appellant) appealed to Supreme Court by special leave; other accused did not appeal.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court could interfere with the Sessions Judge's order of acquittal in revision at the instance of a private party and order retrial, without exceptional circumstances and without violating s.439(4) CrPC by indirectly converting acquittal into conviction.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the part of the appellant's statement 'he had hidden the ornaments' is admissible under s.27 of the Indian Evidence Act, or only the part pointing out the place.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No exceptional circumstances justifying High Court interference with acquittal in revision by private party.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "s.439 CrPC; D. Stephens v. Nosibolla; Logendranath Jha v. Shri Polailal Biswas"
    },
    {
      "id": "pa2",
      "text": "High Court indirectly converted acquittal into conviction by ordering retrial after detailed reappraisal of evidence.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "s.439(4) CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "High Court justified in interfering due to Sessions Judge wrongly ruling out admissible evidence under s.27 Evidence Act.",
      "supporting_facts": [
        "f4",
        "f5",
        "f7"
      ],
      "legal_basis": "s.27 Indian Evidence Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Revisional jurisdiction under s.439 CrPC not lightly exercised by private complainant against acquittal; only in exceptional cases like manifest illegality, gross miscarriage of justice, or overlooking material evidence.",
      "addresses_issue": "i1",
      "key_observation": "High Court cannot convert acquittal to conviction directly or indirectly via retrial after reappraising evidence."
    },
    {
      "id": "cr2",
      "text": "Sessions Judge wrongly held inadmissible the part of appellant's statement 'where he had hidden the ornaments'; entire statement relates distinctly to discovery and is admissible under s.27 Evidence Act.",
      "addresses_issue": "i2",
      "key_observation": "Words 'where he had hidden them' distinctly relate to discovery, not past history of crime; admissible whether confessional or not."
    },
    {
      "id": "cr3",
      "text": "Ruling out admissible evidence is exceptional circumstance justifying interference with acquittal; High Court erred in detailed evidence reappraisal, loading dice against accused.",
      "addresses_issue": "i1",
      "key_observation": "Proper course: remand to appellate court (Sessions Judge) for rehearing after considering admissible evidence, not retrial."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court justified in setting aside acquittal due to wrongful exclusion of admissible evidence under s.27 Evidence Act, but should not have ordered retrial after detailed evidence analysis; instead, direct Sessions Judge to rehear appeal.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    },
    {
      "id": "h2",
      "text": "Entire statement of accused leading to discovery - including 'he had hidden the ornaments' - is admissible under s.27 Evidence Act if it relates distinctly to the fact discovered.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "D. Stephens v. Nosibolla",
      "citation": "1951 S.C.R. 284",
      "treatment": "followed",
      "relevance": "Limits on High Court's revisional jurisdiction against acquittal by private party; only in exceptional cases for public justice."
    },
    {
      "case_name": "Logendranath Jha v. Shri Polailal Biswas",
      "citation": "1951 S.C.R. 676",
      "treatment": "followed",
      "relevance": "High Court cannot convert acquittal to conviction even indirectly by retrial after reappraising evidence; detailed consideration loads dice against accused."
    },
    {
      "case_name": "Pulukuri Kotayya v. King-Emperor",
      "citation": "1946 L.R. 74 I.A. 65",
      "treatment": "followed",
      "relevance": "Interpretation of s.27 Evidence Act: only information relating distinctly to discovery admissible; example distinguishes past user from discovery-related facts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "411",
        "457",
        "380"
      ],
      "relevance": "Appellant charged under s.411 (dishonestly receiving stolen property); other accused under ss.457 (house-breaking by night), 380 (theft in dwelling)."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "439",
        "417",
        "423"
      ],
      "relevance": "s.439 confers revisional powers but sub-s.(4) prohibits converting acquittal to conviction; s.417 for state appeals; s.423 appellate powers."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "27",
        "25",
        "26"
      ],
      "relevance": "s.27 exception to ss.25-26: so much of information from accused in police custody as relates distinctly to fact discovered is admissible."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal allowed with modification: High Court's order of retrial set aside; Sessions Judge directed to rehear the appeal after considering the full admissible statement under s.27 Evidence Act, without being influenced by High Court's observations on evidence. Case of other accused not addressed as no appeal filed.",
    "relief_granted": "Remand to Sessions Judge for rehearing of appeal",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The revisional jurisdiction conferred on the High Court under s. 439 of the Code of Criminal Procedure is not to be lightly exercised when it is invoked by a private complainant against an order of acquittal.",
      "speaker": "court",
      "significance": "Defines limits on High Court's power in private revisions against acquittal."
    },
    {
      "text": "Sub-section (4) of s. 439 forbids a High Court from converting a finding of acquittal into one of conviction and that makes it all the more incumbent on the High Court to see that it does not convert the finding of acquittal into one of conviction by the indirect method of ordering retrial.",
      "speaker": "court",
      "significance": "Prohibits indirect conversion of acquittal via retrial."
    },
    {
      "text": "The whole of this statement in our opinion relates distinctly to the discovery of ornaments and is admissible under s. 27 of the Indian Evidence Act.",
      "speaker": "court",
      "significance": "Holds entire statement, including possession-implying words, admissible under s.27."
    }
  ],
  "_case_id": "1962_52",
  "_label": 1,
  "_text_length": 22266,
  "_extracted_at": "2026-02-10T19:57:12.291988"
}