{
  "metadata": {
    "case_name": "Prabhu v. State",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "R. Das, J."
    ],
    "case_number": "Criminal Appeal No. 50 of 1962",
    "date_of_judgment": "1962-05-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Bhagwan Ahir, step-brother of appellant's father Budhai, resident of village Bandi, Rae Bareli district, had four bighas pasture land and seven bighas cultivated land, no male issue, daughters married, aged about 80.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Appellant Prabhu and father Budhai lived in village Gulariya, 2-3 miles from Bandi; Budhai worked in Burdwan, Bengal.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Four years before murder, appellant and mother came to reside with Bhagwan to help with cultivation, but appellant rendered no assistance; after about a year, turned out and returned to Gulariya.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "About a month and half before murder, appellant and father asked Bhagwan to transfer land to appellant; Bhagwan refused, citing no assistance, planned to give to granddaughter Kumari Sarju (aged 5, staying with him).",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Night between March 19-20, 1961, Bhagwan sleeping in front of house with granddaughter Sarju; Naiku (PW1, neighbour) sleeping nearby heard noise at midnight, called out no response, heard running shoes, called others, found Bhagwan dead with multiple incised injuries on head and neck.",
      "type": "material",
      "date": "1961-03-19/20",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Sarju stained with blood but uninjured and asleep.",
      "type": "material",
      "date": "1961-03-19/20",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Naiku informed police station (8 miles away); no accused named as no one seen.",
      "type": "procedural",
      "date": "1961-03-20",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Third day after murder (March 22, 1961), appellant came to Brij Lal (PW2) in Bandi, made enquiries rousing suspicion; Sub-Inspector present, interrogated appellant.",
      "type": "material",
      "date": "1961-03-22",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Appellant produced from house kulhari (axe), shirt, dhoti - bloodstained with human blood (per Chemical Analyst and Serologist); recovery in presence of Lal Bahadur Singh and Wali Mohammad.",
      "type": "material",
      "date": "1961-03-22",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Postmortem: 13 injuries, 11 incised, head/face injuries fractured skull bones; death due to skull fractures, hemorrhage, shock.",
      "type": "material",
      "date": "1961-03-20 approx",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Appellant denied asking for land, denied producing bloodstained articles, claimed they not his, defence: living in Burdwan with father, returned March 21, 1961, case due to enmity.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f12",
      "text": "Sessions Judge convicted appellant of murder, death sentence; High Court (Allahabad, Lucknow Bench) dismissed appeal, accepted reference, confirmed conviction and sentence (Sept 12, 1961).",
      "type": "procedural",
      "date": "1961-09-12",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Supreme Court granted special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether prosecution evidence, particularly motive and recovery of bloodstained articles, establishes guilt beyond reasonable doubt.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Admissibility of statements made by appellant to Sub-Inspector regarding recovery of bloodstained axe, shirt, dhoti under Sections 25, 26, 27 of Indian Evidence Act.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Evidence raises suspicion but does not establish beyond reasonable doubt that appellant murdered; statements to police inadmissible under ss.25,26 Evidence Act; excluding them, remaining evidence insufficient.",
      "supporting_facts": [
        "f5",
        "f9",
        "f11"
      ],
      "legal_basis": "Sections 25, 26, 27 Indian Evidence Act; circumstantial evidence must be complete chain inconsistent with innocence"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Production of bloodstained weapon sufficient evidence, citing State of U.P. v. Deoman Upadhyaya.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "State of U.P. v. Deoman Upadhyaya (1961) 1 SCR 14"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Murder proved by postmortem; no eyewitnesses; motive established by PWs 1 and 2 (prior stay, refusal of land).",
      "addresses_issue": "i1",
      "key_observation": "Motive satisfactory but operates on appellant and father."
    },
    {
      "id": "cr2",
      "text": "Recovery witnesses: Lal Bahadur Singh (PW4) testified production but no statement; Wali Mohammad not examined; Dodi Baksh Singh (PW3) testified inadmissible statements hit by ss.25,26; no discovery under s.27 as statements about past use/history not relating distinctly to fact discovered (per Pulukuri Kottaya).",
      "addresses_issue": "i2",
      "key_observation": "Statements that axe used in murder or clothes his inadmissible; no proof axe/clothes belonged to appellant."
    },
    {
      "id": "cr3",
      "text": "Mere production of bloodstained articles + motive insufficient; circumstantial chain incomplete, consistent with innocence (e.g., articles kept by someone else); Deoman case had complete chain, not merely production.",
      "addresses_issue": "i1",
      "key_observation": "Prosecution left missing links."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Circumstantial evidence must form complete chain leading to conclusion inconsistent only with guilt; here incomplete.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Statements to police about past use of articles inadmissible under s.27 Evidence Act unless relating distinctly to discovery of fact (place/knowledge).",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pulukuri Kottaya v. King Emperor",
      "citation": "1947 L.R. 74 I.A. 65",
      "treatment": "followed",
      "relevance": "Interpretation of s.27 Evidence Act: information must relate distinctly to fact discovered (place from which object produced, accused's knowledge); past user/history inadmissible."
    },
    {
      "case_name": "State of U.P. v. Deoman Upadhyaya",
      "citation": "1961 1 S.C.R. 14",
      "treatment": "distinguished",
      "relevance": "Circumstantial chain complete with other evidence, not merely production of bloodstained weapon."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Evidence Act",
      "sections": [
        "Section 25",
        "Section 26",
        "Section 27"
      ],
      "relevance": "Statements to police inadmissible (ss.25,26); only part relating to discovery admissible (s.27); applied to exclude appellant's statements about axe used in murder and ownership of clothes."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; conviction and death sentence set aside due to incomplete circumstantial evidence after excluding inadmissible statements.",
    "relief_granted": "Acquittal by setting aside conviction and sentence.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is fallacious to treat the fact discovered within the section as equivalent to the object produced... Information as to past user... is not related to its discovery.\"",
      "speaker": "court",
      "significance": "Explains scope of s.27 Evidence Act, basis for excluding statements."
    },
    {
      "text": "\"Circumstantial evidence must be such as to lead to a conclusion which... is inconsistent only with the guilt of the accused person and not with his innocence.\"",
      "speaker": "court",
      "significance": "Standard for circumstantial evidence applied to find chain incomplete."
    }
  ],
  "_case_id": "1962_208",
  "_label": 1,
  "_text_length": 14673,
  "_extracted_at": "2026-02-10T19:59:16.361758"
}