{
  "metadata": {
    "case_name": "State of Madhya Pradesh & Ors. v. Munwar Shoe Company",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das, J."
    ],
    "case_number": "Civil Appeal No. 373 of 1961",
    "date_of_judgment": "1962-08-24"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent carried on the business of importing and selling different types of footwear in the State of Madhya Pradesh under the name and style of Munwar Shoe Company, Indore.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "During the assessment year 1956-57 the taxable turnover of the goods sold by the respondent was determined to be a little over Rs. 60,000/-, and he was assessed to sales tax on his taxable turnover in accordance with item 32 Sch.3 of the notification dated October 24, 1953 issued under s. 5 of the Madhya Bharat Sales Tax Act, 1950.",
      "type": "material",
      "date": "1956-1957",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Item 32 of Sch. 3 of the notification dated October 24, 1953: '32 All leather goods and all shoes, chappals, footwear etc. Point of sale in Madhya Bharat at which tax is payable: Sale by importer or manufacturer.'",
      "type": "material",
      "date": "1953-10-24",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Exemption notification dated May 27, 1955 under s. 4(3) of the Act exempting from sales tax all such shoes the selling price of which does not exceed rupees two per pair and such country shoes which are prepared by the manufacturer himself and for the production of which power is not used in any stage if the same are sold by the Manufacturer himself or any member of his family.",
      "type": "material",
      "date": "1955-05-27",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Notification dated January 28, 1956 superseding the previous one: Exempted from payment of sales tax, in case of sale by the manufacturer or any member of his family, the sale of all such shoes, chappals, country shoes and footwears which are hand-made and which are not manufactured on power machine and whose sale price does not exceed Rs. 12/8/- per pair.",
      "type": "material",
      "date": "1956-01-28",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Sales Tax Officer negatived respondent's contention for exemption under notification dated January 28, 1956, as respondent was importer and dealer, not manufacturer or member of family, and assessed sales tax on total turnover by order dated March 25, 1958.",
      "type": "procedural",
      "date": "1958-03-25",
      "source": "sales_tax_officer"
    },
    {
      "id": "f7",
      "text": "Respondent filed petition under Art. 226 in Madhya Pradesh High Court, Misc. Petition No. 274 of 1958, contending exemption applies to hand-made footwear not exceeding Rs. 12/8/- per pair, and if limited to manufacturer, it contravenes Art. 304(a).",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "High Court quashed the assessment order dated March 25, 1958, held exemption applies to hand-made shoes etc. whether made within or outside State if other conditions satisfied, reading in consonance with Art. 301, and directed fresh assessment.",
      "type": "procedural",
      "date": "1959-12-14",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appeal by special leave to Supreme Court by State of Madhya Pradesh, Commissioner of Sales Tax, and Sales Tax Officer, Circle No.2, Indore.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the exemption notification dated January 28, 1956 applies to sales of hand-made footwear (price not exceeding Rs. 12/8/- per pair) by an importer like the respondent, or only to sales by the manufacturer or member of his family.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the notification dated January 28, 1956 contravenes Art. 304(a) of the Constitution by discriminating between locally manufactured and imported footwear.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The notification dated January 28, 1956 lays down three conditions for exemption: (1) hand-made not on power machine, (2) price not exceeding Rs. 12/8/-, (3) sale by manufacturer or member of family; respondent as importer does not satisfy third condition.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f5",
        "f6"
      ],
      "legal_basis": "Madhya Bharat Sales Tax Act, 1950 s.5 notification Oct 24, 1953 item 32 Sch.3"
    },
    {
      "id": "pa2",
      "text": "The phrase 'in case of sale by the manufacturer' refers to the taxable sale in the State by importer/manufacturer as per Sch.3, not sale outside State to importer.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "No discrimination under Art. 304(a) as conditions apply equally to local and imported footwear; protects small manufacturers.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Art. 304(a); Orient Weaving Mills v. Union of India; British India Corp. v. Collector of Central Excise"
    },
    {
      "id": "pa4",
      "text": "Even if exemption notification invalid under Art. 304(a), the Oct 24, 1953 notification under s.5 remains valid, and respondent liable on total turnover.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "Madhya Bharat Sales Tax Act s.4(3), s.5; Ram Narain Sons Ltd. v. Asst. Commr. of Sales Tax"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Notification Jan 28, 1956 exempts all sales of hand-made shoes etc. price not exceeding Rs. 12/8/- per pair, regardless of seller; condition 'sale by manufacturer' if interpreted strictly would discriminate under Art. 304(a).",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Art. 304(a), Art. 301"
    },
    {
      "id": "ra2",
      "text": "Discrimination as small manufacturer outside State must travel to sell in State for exemption, unlike local manufacturer.",
      "supporting_facts": [
        "f1",
        "f5"
      ],
      "legal_basis": "Art. 304(a)"
    },
    {
      "id": "ra3",
      "text": "Omission of 'himself' from 1956 notification compared to 1955 allows agents/servants; notifications must be read together, invalidating both if exemption struck down.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Notification Jan 28, 1956 requires three conditions cumulatively: hand-made, price <= Rs.12/8/-, sale by manufacturer/family member; 'in case of sale' refers to taxable event in State under item 32 Sch.3.",
      "addresses_issue": "i1",
      "key_observation": "High Court's interpretation obliterates third condition; cannot delete by interpretation."
    },
    {
      "id": "cr2",
      "text": "No discrimination under Art. 304(a): conditions apply equally to local and imported; protects small hand-made manufacturers; inconvenience of travel not discrimination.",
      "addresses_issue": "i2",
      "key_observation": "Exemption for sales in State; out-of-State sales not taxable anyway."
    },
    {
      "id": "cr3",
      "text": "Even if exemption notification invalid, Oct 24, 1953 notification valid; no wrongful inclusion as respondent not entitled to exemption.",
      "addresses_issue": "i2",
      "key_observation": "Ram Narain principle inapplicable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Exemption under Jan 28, 1956 notification available only if sale by manufacturer/family in State; respondent importer not entitled.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Notification does not discriminate under Art. 304(a).",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Orient Weaving Mills (P) Ltd. v. Union of India",
      "citation": "1962 Supp. 3 S.C.R. 481",
      "treatment": "followed",
      "relevance": "Classification for small manufacturers upheld."
    },
    {
      "case_name": "British India Corporation Ltd. v. Collector of Central Excise, Allahabad",
      "citation": "1963 3 S.C.R. 642",
      "treatment": "followed",
      "relevance": "Classification in interests of small manufacturers upheld."
    },
    {
      "case_name": "Ram Narain Sons Ltd. v. Assistant Commissioner of Sales Tax",
      "citation": "1955 2 S.C.R. 483",
      "treatment": "distinguished",
      "relevance": "Principle of total invalidity for wrongful inclusion does not apply here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madhya Bharat Sales Tax Act, 1950 (Act 30 of 1950)",
      "sections": [
        "Section 3",
        "Section 4(3)",
        "Section 5"
      ],
      "relevance": "Charging section, exemption power, rate and point of tax; notifications issued thereunder."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 301",
        "Article 304(a)"
      ],
      "relevance": "Writ jurisdiction; freedom of trade; prohibition on discriminatory taxes on inter-state trade."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment and order of Madhya Pradesh High Court dated December 14, 1959 set aside; writ petition dismissed.",
    "relief_granted": "None to respondent; upholds assessment.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The notification clearly lays down three conditions for the grant of exemption... All the three conditions laid down in the notification must be fulfilled before the exemption referred to therein can be claimed and we cannot, by interpretation, delete one of the conditions.\"",
      "speaker": "court",
      "significance": "Core holding on interpretation of exemption notification."
    },
    {
      "text": "\"It is obvious that the exemption is for the protection and benefit of small manufacturers who make hand-made shoes of small value and who may be unable to compete with large-scale manufacturers of footwear made on machines.\"",
      "speaker": "court",
      "significance": "Justification for no discrimination under Art. 304(a)."
    }
  ],
  "_case_id": "1962_303",
  "_label": 1,
  "_text_length": 18485,
  "_extracted_at": "2026-02-10T20:00:59.674579"
}