{
  "metadata": {
    "case_name": "Continental Export and Import Company v. Commissioner of Income-tax",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": "Civil Appeals Nos. 325 and 326 of 1960",
    "date_of_judgment": "1962-01-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a firm at Gudur, Andhra Pradesh, doing business in Mica under the name and style of the Continental Export and Import Company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "During the years of account 1948-49 and 1949-50, corresponding to assessment years 1949-50 and 1950-51, the assessee firm exported Mica to Japan.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Mica was not directly exportable to Japanese buyers as Japan was under military occupation, but to Boeki-Cho (Board of Trade).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The assessee firm engaged San-Ei Trading Co. Ltd., Tokyo (a non-resident company), as its agents to negotiate orders and handle affairs in Japan.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Two agreements: first for quarter July to September 1948 with 4% commission on gross sale proceeds; second for indefinite period with 2% commission.",
      "type": "material",
      "date": "1948-07-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Commission amounts due: Rs. 26,254-9-1 for 1948-49 and Rs. 11,272-8-8 for 1949-50.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "These amounts included in price of Mica exported were received by assessee firm in India, but could not be sent to Japanese Company due to Exchange Control laws.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Agreements provided: 'In view of the difficulties in this country it is requested that the first party credits all these amounts to the account of the second party with them without remitting the same until definite instructions are received by the first party.'",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "During the two years, total Rs. 13,319-12-4 paid to Japanese Company directly or through others as instructed.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Income-tax authorities treated assessee firm as statutory agent of Japanese Company and assessed tax on the two amounts.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "ITO order confirmed on appeal; Tribunal set aside, holding income accrued/arose in Japan, not received in taxable territories; s.4(1)(a) subordinate to s.4(1)(c).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Commissioner obtained reference to High Court (Referred No. 50 of 1954) on whether sums chargeable under s.4(1)(a).",
      "type": "procedural",
      "date": "1956-02-21",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "High Court answered against assessee, granted certificate for appeal.",
      "type": "procedural",
      "date": "1956-02-21",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the aforesaid sum of Rs. 26,255-0-0 and Rs. 11,272-0-0 being selling commission credited to the aforesaid non-resident company's account in the Books of the assessee are chargeable in the hands of the assessee under s. 4(1)(a) for the assessment years 1949-50 and 1950-51?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Income to Japanese Company accrued or arisen in Japan and could not be said to have been received by the Japanese Company in the taxable territories, since s.4(1)(a) was subordinate to s.4(1)(c). Reference in s.4(1)(a) to income received in India refers only to situation in s.4(1)(b); cannot add liability beyond s.4(1)(c). Income accrued abroad cannot accrue again in India; subsequent receipt not chargeable.",
      "supporting_facts": [
        "f2",
        "f4",
        "f6",
        "f7"
      ],
      "legal_basis": "Section 4(1)(a), (b), (c)"
    },
    {
      "id": "pa2",
      "text": "Japanese Company did not actually receive it in British India; only debtor-creditor relation; mere entry in account books not a receipt; no provision deems book entry as receipt.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 4(1)(a)"
    },
    {
      "id": "pa3",
      "text": "Cl.(a) of s.4(1) delimited by cl.(c); clauses interdependent.",
      "supporting_facts": [],
      "legal_basis": "Section 4(1)(a), (c)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Assessee firm is statutory agent under s.43 due to business connection; liable under s.42.",
      "supporting_facts": [
        "f4",
        "f5",
        "f10"
      ],
      "legal_basis": "Sections 42, 43"
    },
    {
      "id": "ra2",
      "text": "Actual or deemed receipt of income in taxable territories by or on behalf of non-residents attracts tax under s.4(1)(a) even if not chargeable under s.4(1)(c). Receipt alone sufficient, whether accrued inside or outside.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 4(1)(a), (c)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Assessee firm treated as statutory agent under s.42 and s.43 due to business connection with non-resident; vicariously liable.",
      "addresses_issue": "i1",
      "key_observation": "Business connection subsisted; assessee assessee for s.42 purposes."
    },
    {
      "id": "cr2",
      "text": "S.4(1)(a) general, applies to resident or non-resident; not confined like (b) or (c); clauses (a) and (c) read disjunctively; receipt in taxable territories sufficient, independent of accrual.",
      "addresses_issue": "i1",
      "key_observation": "Cl.(a) not subjected to limitation of accrual in taxable territories."
    },
    {
      "id": "cr3",
      "text": "Crediting amounts to Japanese Company's account per agreement constitutes receipt; money held as deposit at disposal of company, not mere debt; character changed like bank deposit.",
      "addresses_issue": "i1",
      "key_observation": "Japanese Company disposed of part by instructions, confirming receipt."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The sums credited to non-resident's account in assessee's books are chargeable under s.4(1)(a) as received in taxable territories; High Court right.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Turner Morrison Co. Ltd. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Person with business connection can be statutory agent under s.43; vicariously liable under ss.40,42; s.4(1)(a) general, applies where receipt in India without need for fiction if actually received."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "4(1)(a)",
        "4(1)(b)",
        "4(1)(c)",
        "42",
        "43",
        "18"
      ],
      "relevance": "S.4(1)(a) taxes receipt in taxable territories independently; s.42 deems income from business connection in territories; s.43 defines statutory agent."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeals, upholding the High Court's decision that the commissions credited to the non-resident Japanese company's account in the assessee's books are chargeable to tax under section 4(1)(a) in the hands of the assessee as statutory agent.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Actual or deemed receipt, of income in the taxable territories by or on behalf of non-residents attracts tax under section 4(1)(a) even though the income may not be chargeable under section 4(1)(c) by reason of its having accrued or arisen outside.\"",
      "speaker": "court",
      "significance": "Clarifies independence of s.4(1)(a) from s.4(1)(c)"
    },
    {
      "text": "\"The clauses are capable of being read independently, though, sometimes, they may operate together.\"",
      "speaker": "court",
      "significance": "Holds s.4(1)(a) and (c) disjunctive"
    },
    {
      "text": "\"Till the money was so credited, there might be a relation of debtor and creditor but after the amounts were credited, the money was held by the assessee firm as a deposit.\"",
      "speaker": "court",
      "significance": "Book credit constitutes receipt as deposit at disposal"
    }
  ],
  "_case_id": "1962_381",
  "_label": 0,
  "_text_length": 12635,
  "_extracted_at": "2026-02-10T20:01:45.730845"
}