{
  "metadata": {
    "case_name": "Assessees (Banking Company) v. Income-tax Authorities",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Assessees are a public limited company carrying on the business of banking.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In proceedings for assessment of income-tax for the year 1950-51, assessees claimed Rs. 4,22,582 due from Messrs. Nandlal Inderchand, written off as irrecoverable in the year of account 1949, as bad and doubtful debt under section 10(2)(xi) of the Indian Income-tax Act.",
      "type": "material",
      "date": "1949",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Rs. 4,22,582 consisted of: Rs. 2,11,089 due from Messrs. Nandlal Inderchand under account commenced in 1943, with pledged shares of value Rs. 28,000 odd.",
      "type": "material",
      "date": "1943",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Rs. 1,02,325 originally due from B.I.G. Co., Calcutta (no security).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Rs. 1,09,168 originally due from Fulchand Srinarain, Calcutta (no security).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On December 3, 1947, accounts of B.I.G. Co. and Fulchand Srinarain transferred to account of Messrs. Nandlal Inderchand and amalgamated.",
      "type": "material",
      "date": "1947-12-03",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Messrs. Nandlal Inderchand were interested in the businesses of B.I.G. Co. and Fulchand Srinarain, but did not guarantee the loans to them.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Accounts of B.I.G. Co. and Fulchand Srinarain had not been operated since 1946; in 1947, those firms not in position to pay.",
      "type": "material",
      "date": "1946",
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "Income-tax Officer disallowed entire Rs. 4,22,582, holding it became irrecoverable in 1947.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellate Assistant Commissioner held Rs. 2,11,089 (Nandlal) became irrecoverable in year of account 1950; Rs. from B.I.G. Co. and Fulchand Srinarain in 1947; entire amount not allowable as bad debt in 1949.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Income-tax Appellate Tribunal accepted AAC findings that amounts from B.I.G. Co. and Fulchand Srinarain became irrecoverable in 1947, not allowable in 1949; finding on Nandlal amount not challenged.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f12",
      "text": "Tribunal declined to refer to High Court under section 66(1) on amounts due from B.I.G. Co. and Fulchand Srinarain.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f13",
      "text": "High Court by order dated July 31, 1957, directed Tribunal to state case under section 66(2) on question regarding Rs. 2,11,493 claimed as bad debt for AY 1950-51.",
      "type": "procedural",
      "date": "1957-07-31",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "High Court held conclusion that debt became irrecoverable in 1947 was one of fact, not liable to be reopened in reference under section 66, as there was evidence supporting AAC and Tribunal conclusions.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Assessees appealed to Supreme Court with special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "No evidence that Nandlal Inderchand were exclusive owners of B.I.G. Co. and Fulchand Srinarain businesses; only interested.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Apart from pledge of shares of small value, no evidence of assets of Nandlal Inderchand to satisfy liability for debts of B.I.G. Co. and Fulchand Srinarain.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "After amalgamation, amount exceeding Rs. two lakhs due, shares pledged less than 1/7th of total, security wholly insufficient.",
      "type": "material",
      "date": "1947",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, in the circumstances of the case, the income-tax department was legally justified in rejecting the claim of the assessee under section 10(2)(xi) of the Income-tax Act with regard to the amount of Rs. 2,11,493 claimed as bad debt for the assessment year 1950-51?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether amalgamation of accounts on December 3, 1947, revived debts that had become irrecoverable in 1947, allowing them to be treated as bad debts in 1949?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the question of when a debt becomes bad is a question of fact not open to re-appreciation by High Court in reference under section 66?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "It was open to the assessees to amalgamate the three accounts of the same debtor and if the debtor was in a position to pay and did pay some amounts towards the consolidated account, it could not be said that because nothing was recovered in the years prior to amalgamation the debts must be deemed to have become bad in those previous years.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Entire amount of Rs. 4,22,582 had become irrecoverable in 1947; amounts due from B.I.G. Co. and Fulchand Srinarain became irrecoverable in 1947 as accounts not operated since 1946, firms not in position to pay, no guarantee by Nandlal Inderchand, insufficient security.",
      "supporting_facts": [
        "f8",
        "f7",
        "f17",
        "f18"
      ],
      "legal_basis": "section 10(2)(xi) of the Indian Income-tax Act"
    },
    {
      "id": "ra2",
      "text": "Nandlal amount became irrecoverable in year of account 1950, not 1949.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Undoubtedly, on December 3, 1947, the amounts due in the accounts of B.I.G. Co. and Fulchand Srinarain were transferred to the account of Messrs. Nandlal Inderchand and amalgamated; Nandlal interested but no guarantee; accounts not operated since 1946; in 1947 not in position to pay; Tribunal held debts bad in 1947.",
      "addresses_issue": "i1",
      "key_observation": "There was evidence on which Tribunal could hold debt bad in 1947."
    },
    {
      "id": "cr2",
      "text": "No evidence Nandlal exclusive owners of B.I.G. and Fulchand businesses; no evidence of assets to satisfy liabilities apart from small pledge; security insufficient.",
      "addresses_issue": "i2",
      "key_observation": "Pledge value less than 1/7th of total debt."
    },
    {
      "id": "cr3",
      "text": "Question whether a debt is bad debt and when it became bad is question of fact; if evidence justifies conclusion, High Court cannot re-appreciate in reference under section 66.",
      "addresses_issue": "i3",
      "key_observation": "Cites Privy Council in CIT v. S.M. Chitnavis: questions of fact to be decided by Tribunal."
    },
    {
      "id": "cr4",
      "text": "If debt bad in 1947, mere subsequent unilateral amalgamation by creditor with recoverable debt does not cease to be bad.",
      "addresses_issue": "i2",
      "key_observation": "Amalgamation does not revive bad debt."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The income-tax department was legally justified in rejecting the claim under section 10(2)(xi) regarding the amount claimed as bad debt for AY 1950-51.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Whether a debt is a bad debt, and if so, at what point of time it became a bad debt, are questions of fact to be decided by the Tribunal.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Unilateral amalgamation of bad debts with another debt does not make the bad debts recoverable.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax v. S. M. Chitnavis",
      "citation": null,
      "treatment": "followed",
      "relevance": "Interpreting section 24 of Indian Income-tax Act, 1922: whether debt bad and when, are questions of fact for Tribunal."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "10(2)(xi)",
        "66(1)",
        "66(2)"
      ],
      "relevance": "Allowance of bad debts in computing business profits; reference to High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the assessee's appeal with special leave against the High Court's order in the reference, upholding that the Income-tax authorities' conclusion that the debts became irrecoverable in 1947 was a finding of fact supported by evidence, not open to interference, and amalgamation did not alter their status as bad debts allowable only in the year they became bad.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Whether a debt is a bad debt, and, if so, at what point of time it became a bad debt, are questions which in their Lordships view are questions of fact, to be decided in the event of dispute by the appropriate Tribunal, and not by the ipse dixit of anyone else.\"",
      "speaker": "court",
      "significance": "Establishes that bad debt determination is factual, binding if evidence supports."
    },
    {
      "text": "The assessee has no option of declaring a debt as bad. In every case it is a question of fact, to be determined after consideration of all relevant circumstances.",
      "speaker": "court",
      "significance": "Emphasizes objective assessment of when debt becomes irrecoverable."
    },
    {
      "text": "If the debt had become bad in the year 1947, by its mere subsequent amalgamation unilaterally made by the creditor with a debt which was recoverable, it did not cease to be bad.",
      "speaker": "court",
      "significance": "Rejects petitioner's amalgamation argument."
    }
  ],
  "_case_id": "1962_121",
  "_label": 0,
  "_text_length": 7173,
  "_extracted_at": "2026-02-10T19:58:57.183833"
}