{
  "metadata": {
    "case_name": null,
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO, J."
    ],
    "case_number": "Civil Appeal No. 195 of 1962",
    "date_of_judgment": "1962-07-31"
  },
  "facts": [
    {
      "id": "f1",
      "text": "A new route Gopalganj-Pahlezghat was advertised by the North Bihar Regional Transport Authority in July 1957 and applications were invited for permanent stage carriage permits; the advertisement stated that there were two vacancies on the route.",
      "type": "background",
      "date": "1957-07",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "A number of persons applied for the two permits.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In January 1958, the Regional Transport Authority granted permits to the appellant and another person.",
      "type": "procedural",
      "date": "1958-01",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The order of the Regional Transport Authority was taken in appeal to the Appellate Authority, which however failed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Sudhakar Sharma (respondent No. 1) moved the High Court under Art. 226 of the Constitution and in April 1960 the High Court quashed the order of the Appellate Authority on the basis of the judgment of this Court in Ram Gopal v. Anant Prasad.",
      "type": "procedural",
      "date": "1960-04",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The case went back to the Appellate Authority for rehearing.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Appellate Authority modified the order of the Regional Transport Authority: the permit granted to the appellant was cancelled and in his place a permit was granted to Sudhakar Sharma; the permit granted to the other person was not interfered with.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The appellant made an application to the State Government under s. 64-A of the Motor Vehicles Act, No.4 of 1939, as amended by the Bihar Amendment Act No. 27 of 1950.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The Minister for Transport heard the application and upheld the order of the Appellate Authority but ordered that an additional service be allowed to the appellant for the said route, increasing permits to three.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Ram Kailash Pandey, whose application under s. 64-A had been dismissed, filed a writ petition before the High Court challenging the order of the Minister for Transport granting an additional permit to the appellant.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Parties to the writ petition: appellant, two persons to whom permits were granted, State of Bihar, Appellate Authority, Regional Transport Authority.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "High Court held that the State Government had no power under s. 64-A to increase the number of permits from two to three; set aside that part of the order granting the third permit to the appellant but refused to interfere with the rest.",
      "type": "procedural",
      "date": "1961-08-24",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appellant applied for certificate to appeal to Supreme Court, refused; then moved for special leave, which was granted.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the State Government acting under s. 64-A of the Bihar Amendment Act had the power to increase the number of permits for which application had been invited by the Regional Transport Authority from two to three.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The State Government has the same power under s. 64-A as the Regional Transport Authority has, as held by this Court in Ram Gopal's case, and it was therefore open to the State Government to increase the number of permits as the Regional Transport Authority would always have the power to increase the number of permits whenever it thought necessary to do so.",
      "supporting_facts": [
        "f1",
        "f3",
        "f9"
      ],
      "legal_basis": "Ram Gopal v. Anant Prasad; s. 64-A Motor Vehicles Act"
    },
    {
      "id": "pa2",
      "text": "There were no limits fixed by the Regional Transport Authority under s. 47(3) as no resolution on record, so open to increase.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "s. 47(3) Motor Vehicles Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The State Government had no power when dealing with an application under s. 64-A to increase the number of permits to be granted from two (limit fixed by Regional Transport Authority) to three; order granting third permit without jurisdiction.",
      "supporting_facts": [
        "f1",
        "f12"
      ],
      "legal_basis": "s. 64-A Motor Vehicles Act; s. 47(3)"
    },
    {
      "id": "ra2",
      "text": "Respondent No. 1 (Sudhakar Sharma) had locus standi as contending he should have been granted permit not appellant.",
      "supporting_facts": [
        "f7",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Detailed scheme of Motor Vehicles Act Chapter IV: s.47(3) empowers RTA to limit number of stage carriages; grants under s.48 subject to s.47 limits; appellate and revisional powers under s.64 and s.64-A confined to choosing between applicants within fixed limits, not revising limits.",
      "addresses_issue": "i1",
      "key_observation": "Power under s.48, s.64, s.64-A subject to s.47(3) limits; cannot increase number on revision by aggrieved person."
    },
    {
      "id": "cr2",
      "text": "In case of new route advertised for first time with two vacancies, infer limit fixed under s.47(3) by RTA.",
      "addresses_issue": "i1",
      "key_observation": "Advertisement for two vacancies on new route implies limit decided under s.47(3)."
    },
    {
      "id": "cr3",
      "text": "Revisional authority under s.64-A (Bihar) confined to matters RTA and Appellate Authority could consider under s.48 and s.64; follows Ram Gopal and Arunachalam Pillai.",
      "addresses_issue": "i1",
      "key_observation": "Cannot pass orders beyond authority of subordinate bodies."
    },
    {
      "id": "cr4",
      "text": "Agrees Allahabad HC view over Rajasthan HC; respondent No.1 had locus standi.",
      "addresses_issue": "i1",
      "key_observation": "Limit binds all: RTA, Appellate, Revisional authorities."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "State Government under s.64-A Bihar Amendment had no power to increase permits from two to three when limit inferred from advertisement for new route under s.47(3); appellate/revisional powers confined within limits.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ram Gopal v. Anant Prasad",
      "citation": "1960 3 S.C.R. 764",
      "treatment": "followed",
      "relevance": "State Govt under s.64-A has same powers as subordinate authorities."
    },
    {
      "case_name": "A.S.T. Arunachalam Pillai v. Messrs. Southern Roadways Private Limited",
      "citation": "1959 Supp. 2 S.C.R. 692",
      "treatment": "followed",
      "relevance": "Revisional power under s.64-A cannot exceed powers of authority revised."
    },
    {
      "case_name": "The Automobile Transport Rajasthan v. Shri Nahtu Ram Mirdha",
      "citation": "I.L.R. 1959 Raj. 120",
      "treatment": "distinguished",
      "relevance": "Held appellate not bound by limit under old s.48(a); Court prefers contrary view."
    },
    {
      "case_name": "Mohammad Luqman Sharif v. State Transport Authority",
      "citation": "A.I.R. 1961 All. 342",
      "treatment": "followed",
      "relevance": "Appellate cannot refix number fixed under old s.48(a)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act, 1939",
      "sections": [
        "s.42",
        "s.43",
        "s.44",
        "s.45",
        "s.46",
        "s.47",
        "s.48",
        "s.57",
        "s.64",
        "s.64-A"
      ],
      "relevance": "Scheme for grant of stage carriage permits; limits under s.47(3) bind grants under s.48, appeals s.64, revisions s.64-A."
    },
    {
      "name": "Bihar Amendment Act No. 27 of 1950",
      "sections": [
        "s.64-A"
      ],
      "relevance": "Provides revisional power to State Govt; applied assuming not repealed."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Basis for High Court writ quashing orders."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court agreed with the Patna High Court that the State Government lacked power under s.64-A to grant a third permit beyond the two-vacancy limit fixed by the Regional Transport Authority for the new route; appeal dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the power of the revisional authority is confined only to considering matters which the Regional Transport Authority and the Appellate Authority could have considered under s. 48 and s. 64.\"",
      "speaker": "court",
      "significance": "Defines scope of s.64-A revisional power."
    },
    {
      "text": "\"when it is a case of a new route which is being open for the first time and an advertisement is issued calling for applications for such a new route specifying the number of vacancies for it, we think, it is reasonable to infer that ... that shows the limit which must have been decided upon by the Regional Transport Authority under s. 47(3)\".",
      "speaker": "court",
      "significance": "Inference of limit from advertisement for new route."
    }
  ],
  "_case_id": "1962_53",
  "_label": 0,
  "_text_length": 27811,
  "_extracted_at": "2026-02-10T19:57:05.902961"
}