{
  "metadata": {
    "case_name": "Appellants v. Respondent",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO, J."
    ],
    "case_number": "Civil Appeal No. 367 of 1959",
    "date_of_judgment": "1962-02-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a lessee from the owner of the land and his lease comprises a larger area of land including the land of which the respondent is the tenant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant claimed he was the landowner and the respondent was a tenant-at-will under him.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Appellant had less than thirty standard acres and required the land for his own cultivation.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Application filed by appellant before the Assistant Collector under s.14-A read with s.9(1) of the Punjab Security of Land Tenures Act, No. X of 1953, for ejectment of the respondent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Assistant Collector held that the respondent was liable to ejectment and allowed the application.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Respondent appealed to the Collector, urging that only a landowner could dispossess a tenant-at-will under s.14-A, and appellant was merely a landlord, not a landowner.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Collector accepted the contention, held appellant not a landowner, allowed appeal, and dismissed the application for ejectment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellant appealed to the Commissioner, contending he was a landowner within s.2(1) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Commissioner held that position of a lessee was like a mortgagee with possession and a lessee was a landowner for all purposes, allowed appeal, restored order of Assistant Collector.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Respondent filed revision to Financial Commissioner, who held mere lessee with only constructive possession could not be included in term 'landowner', allowed revision, set aside Commissioner's order, restored Collector's order dismissing application.",
      "type": "procedural",
      "date": "1957-11-23",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant applied to Supreme Court for special leave, which was granted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appellant is not an allottee or a lessee as defined in cls. (b) and (c) of s.2 of the East Punjab Displaced Persons Land Resettlement Act, No. XXXVI of 1949.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appellant is not a mortgagee with possession.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "In the copy of the Girdawari entries, the appellant is shown as a tenant, the entry being 'Tekan and others, Gairmaurasian first through Ganeshi Gair Maurasi secondhalf'.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant, a lessee, is a 'landowner' within the meaning of s.2(1) of the Punjab Security of Land Tenures Act, No. X of 1953, and thus entitled to eject the respondent under s.14-A.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellant is a landowner within the meaning of s.2(1) of the Act and entitled to eject the respondent.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "s.2(1) of Punjab Security of Land Tenures Act, 1953; s.3(2) of Punjab Land Revenue Act, 1887 (enjoyment of part of profits of estate)"
    },
    {
      "id": "pa2",
      "text": "Position of a lessee is just like a mortgagee with possession and a lessee is a landowner for all purposes.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Only a landowner could dispossess a tenant-at-will under s.14-A, and appellant was merely a landlord, not a landowner.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "s.14-A of Punjab Security of Land Tenures Act, 1953"
    },
    {
      "id": "ra2",
      "text": "Mere lessee with only constructive possession could not be included in the term 'landowner' as used in the Act.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Definition of 'landowner' in s.2(1) of Punjab Security of Land Tenures Act, 1953"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Definition of 'landowner' in s.2(1) of Punjab Security of Land Tenures Act includes person defined as such in Punjab Land Revenue Act, 1887, and specified others; appellant not allottee, lessee under Resettlement Act, or mortgagee with possession.",
      "addresses_issue": "i1",
      "key_observation": "Appellant can only claim to be landowner if defined as such in Punjab Land Revenue Act, 1887."
    },
    {
      "id": "cr2",
      "text": "Under s.3(2) of Punjab Land Revenue Act, 1887, 'landowner' does not include a tenant; last part of definition applies to persons other than tenants.",
      "addresses_issue": "i1",
      "key_observation": "Must determine if appellant is a tenant."
    },
    {
      "id": "cr3",
      "text": "Under s.4(5) of Punjab Tenancy Act, 1887, 'tenant' means a person who holds land under another and is liable to pay rent; appellant as lessee holds land under owner and liable to pay lease money as rent.",
      "addresses_issue": "i1",
      "key_observation": "Appellant satisfies definition of tenant and does not come within exceptions."
    },
    {
      "id": "cr4",
      "text": "Appellant shown as tenant in Girdawari entries.",
      "addresses_issue": "i1",
      "key_observation": "Confirms appellant is tenant, hence not landowner."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant as lessee is a tenant under s.4(5) of Punjab Tenancy Act and thus not a 'landowner' under s.3(2) of Punjab Land Revenue Act or s.2(1) of Punjab Security of Land Tenures Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Punjab Security of Land Tenures Act, No. X of 1953",
      "sections": [
        "s.14-A",
        "s.9(1)",
        "s.2(1)"
      ],
      "relevance": "Governs ejectment by small landowner; defines 'landowner'"
    },
    {
      "name": "Punjab Land Revenue Act, No. XVII of 1887",
      "sections": [
        "s.3(2)"
      ],
      "relevance": "Defines 'landowner' as incorporated in Punjab Security of Land Tenures Act"
    },
    {
      "name": "East Punjab Displaced Persons (Land Resettlement) Act, No. XXXVI of 1949",
      "sections": [
        "s.2 (clauses b and c)"
      ],
      "relevance": "Included lessees and allottees in definition of 'landowner', but appellant not qualifying"
    },
    {
      "name": "Punjab Tenancy Act, No. XVI of 1887",
      "sections": [
        "s.4(5)"
      ],
      "relevance": "Defines 'tenant'; appellant qualifies as tenant"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court held that the appellant lessee is a tenant and not a landowner under the relevant definitions, thereby upholding the Financial Commissioner's order dismissing the ejectment application.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'Landowner means a person defined as such in the Punjab Land Revenue Act, 1887... and shall include an allottee and lessee as defined in clauses (b) and (c) respectively of section 2 of the East Punjab Displaced Persons Land Resettlement Act, 1949...'",
      "speaker": "court",
      "significance": "Core definition central to the issue"
    },
    {
      "text": "'The appellant is therefore clearly a tenant within s.4(5) of the Punjab Tenancy Act. He cannot therefore be a landowner under s.3(2) of the Punjab Land Revenue Act.'",
      "speaker": "court",
      "significance": "Key holding resolving the legal issue"
    }
  ],
  "_case_id": "1962_287",
  "_label": 0,
  "_text_length": 7293,
  "_extracted_at": "2026-02-10T20:01:07.461034"
}