{
  "metadata": {
    "case_name": "Trustees of the Port of Madras v. Steamer Agents",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Civil Appeals Nos. 187 to 191 of 1962",
    "date_of_judgment": "1962-12-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are Trustees of the Port of Madras (Board). Respondents are partnership firms or limited companies carrying on business of steamer agents at Madras.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Board, with sanction of Central Government, amended Madras Port Trust Scale of Rates in 1958, adding scale E under Chapter V, effective March 1, 1958. Scale E charges masters, owners or agents of vessels for Port Trust labour requisitioned and supplied but not fully or properly utilised, including idle labour due to ship lapses and extra payment for multiple hooks at hatch.",
      "type": "material",
      "date": "1958-03-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Labour requisition form modified to include undertaking by steamer-agents to pay charges in Board's scale of rates for idle or improperly utilised labour and multiple hooks.",
      "type": "material",
      "date": "1958-03-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Amendments made under s. 42 of Madras Port Trust Act, 1905.",
      "type": "procedural",
      "date": "1958",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondents filed writ petitions under Art. 226 in Madras High Court praying mandamus directing Board not to enforce scale E rates and not to require new form.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Single judge dismissed writs. Appellate bench allowed writs, issued mandamus, holding Board had no authority for scale E rates payable by vessel masters/owners/agents; services deemed for consignee.",
      "type": "procedural",
      "date": "1961-03-03",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Steamer agents inform Traffic Manager probable arrival date, tonnage hatch-wise, hatches to be worked. Revised procedure from Aug 1, 1957 requires application and deposit before berthing for overtime, cranes, etc., and from Mar 1, 1958 for scale E.",
      "type": "background",
      "date": "1957-08-01",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Operation at quay: Stevedore labour (Madras Dock Labour Board) boards vessel, prepares slings, works winches, hoists cargo to quayside. Shore labour unsling, Trust tally clerk issues receipt under s.39(3). Shore labour moves to shed/stack for delivery to consignee after payment of dues.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Board adopted piece-rate scheme per Jeejeebhoy Committee; scale E part of it. Prior to Mar 1, 1958, shore labour cost met by Port Trust, no distinction for idle time.",
      "type": "background",
      "date": "1958-03-01",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Under new scheme, scale E charges excluded from harbour dues; steamer-agent responsible.",
      "type": "material",
      "date": "1958-03-01",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Harbour dues under scale A include overhead, storage rent, porterage from landing to storage.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Ship-owner liable under bill of lading until delivery to consignee. Board provides services like moving goods from landing to storage/delivery, receipt for goods; these services to ship-owner.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Board collects harbour dues from consignee as agent of ship-owner/master/steamer agent who are primarily liable.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Past practice: Agents inform Board of shore labour needs orally then via form; new form adds undertaking for scale E.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Scale E details: Idle time charges (64 np/hr 8hr shift, 80 np/hr 6.5hr); sent away after start Rs.2.50/half shift; multiple hook allowances Rs.1.25/1.66 per mazdoor.",
      "type": "material",
      "date": "1958-03-01",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Circular Feb 25, 1958 explained piece-rate scheme to increase out-turn; wages linked to productivity, idle allowance for reasons beyond workmen control attributable to vessel.",
      "type": "background",
      "date": "1958-02-25",
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Piece-rate: Gang (1 maistri +14 workers) per hook; datum lines per cargo type; earnings increase with output.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Board has authority under Madras Port Trust Act to levy scale E charges on masters, owners or agents of vessels for Port Trust shore labour rendered idle or for multiple hooks, and to require undertaking in requisition form.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether services under s.39 (receiving/removing goods) are rendered to ship-owner/steamer agent or to consignee.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether ship-owner's liability ends upon discharge over rail/landing on quay with receipt under s.39(3).",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Scale E charges are for services to ship-owner under s.42; harbour dues collected from consignee as agent of ship-owner; Board takes charge as bailee of ship-owner.",
      "supporting_facts": [
        "f2",
        "f8",
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": "Madras Port Trust Act ss.39,40,42; Indian Contract Act ss.148,151,152,161"
    },
    {
      "id": "pa2",
      "text": "Object of scale E is to expedite discharge benefiting ship; practical to charge ship-owner as goods not consignee-wise; past practice of agents requisitioning labour.",
      "supporting_facts": [
        "f7",
        "f14",
        "f16"
      ],
      "legal_basis": "s.42 Madras Port Trust Act"
    },
    {
      "id": "pa3",
      "text": "Multiple hook allowance benefits ship for faster discharge.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Piece-rate scheme"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Ship-owners/agents not liable for shore labour charges; borne by consignee. Services for goods, not vessel.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s.39 Madras Port Trust Act"
    },
    {
      "id": "ra2",
      "text": "Board power only for services rendered, not compensation for default. Prior practice: landing charges paid by consignee, merged into harbour dues.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "s.42 Madras Port Trust Act"
    },
    {
      "id": "ra3",
      "text": "Ship-owner liability ends when goods over rail/landed and receipt given; subsequent services for consignee. Requisition for Board's convenience, on behalf of consignee.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Indian Carriage of Goods by Sea Act 1925; bill of lading"
    },
    {
      "id": "ra4",
      "text": "Imposition illegal, unreasonable restriction on business under Art.19(1)(g).",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Constitution Art.19(1)(g), Art.226"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Board not obliged to perform s.39 services unless required by owner (incl. agent); steamer-agent requires services with knowledge of ship details, requisitions labour.",
      "addresses_issue": "i1",
      "key_observation": "Performance consequent on requirement by owner; steamer-agent in position to require."
    },
    {
      "id": "cr2",
      "text": "Liability under sanctioned scale E (force of law per s.44) arises from rates/conditions for services, not just undertaking in form.",
      "addresses_issue": "i1",
      "key_observation": "Sanctioned rates have force of law."
    },
    {
      "id": "cr3",
      "text": "Scale E for idle labour/multiple hooks benefits ship (expedites discharge); practical as cargo not consignee-wise; ship-owner bailee until delivery per bill of lading.",
      "addresses_issue": "i2",
      "key_observation": "Board bailee of ship-owner per ss.39,40; not agent of consignee."
    },
    {
      "id": "cr4",
      "text": "Receiving goods under s.39(b) on behalf of ship-owner; receipt absolves ship from loss/damage but not delivery to consignee without bill of lading.",
      "addresses_issue": "i3",
      "key_observation": "Delivery to Board not to consignee."
    },
    {
      "id": "cr5",
      "text": "Charges not damages but for labour engaged/required by ship-agent; idle time paid at wage rate for reasons attributable to vessel.",
      "addresses_issue": "i1",
      "key_observation": "Not compensation but service charges."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Board authorised to levy scale E charges on masters/owners/agents for specified labour; can require undertaking in requisition form.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "s.39 services rendered to ship-owner/steamer-agent, who is bailor; Board bailee until delivery to consignee.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Ship-owner liability continues beyond rail/quay landing until actual delivery per bill of lading.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Great Eastern Shipping Co. Ltd. v. Govindasamy",
      "citation": "I.L.R. 1957 Mad. 840",
      "treatment": "distinguished",
      "relevance": "Not direct authority; assumed Port Trust agent of consignee but disputed here."
    },
    {
      "case_name": "Peterson v. Freebody Co.",
      "citation": "1895 2 Q.B.D. 294",
      "treatment": "distinguished",
      "relevance": "Delivery requires ship-owner put goods reachable by consignee; not equivalent to handing to statutory Board."
    },
    {
      "case_name": "British Ship-owners Co. Limited v. Grimond",
      "citation": "1876 III Sess. Cases IV Series 968",
      "treatment": "distinguished",
      "relevance": "Delivery to porters employed by consignee is to consignee; not applicable as consignees not obliged to engage shore labour."
    },
    {
      "case_name": "Sze Hai Tong Bank Ltd. v. Rambler Cycle Co. Ltd.",
      "citation": "1959 A.C. 576",
      "treatment": "referred",
      "relevance": "Ship-owner delivers against bill of lading; clause limiting liability not protect delivery without it."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Port Trust Act, 1905",
      "sections": [
        "s.5(7)",
        "s.39",
        "s.40",
        "s.41-A",
        "s.42",
        "s.44",
        "s.50",
        "s.51",
        "s.52",
        "s.53",
        "s.54",
        "s.56",
        "s.57",
        "s.58",
        "s.59",
        "s.95"
      ],
      "relevance": "Empowers Board to provide/undertake services, frame sanctioned scale of rates with force of law; Board bailee; lien on goods; receipt absolves ship."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.226"
      ],
      "relevance": "Writs filed to challenge enforcement of scale E."
    },
    {
      "name": "Indian Contract Act, 1872",
      "sections": [
        "ss.148",
        "151",
        "152",
        "161"
      ],
      "relevance": "Board's responsibility as bailee of ship-owner."
    },
    {
      "name": "Indian Carriage of Goods by Sea Act, 1925",
      "sections": [
        "Art.I, Art.III Rule 6 Schedule"
      ],
      "relevance": "Carrier responsibility until delivery to entitled person."
    },
    {
      "name": "Indian Ports Act, 1908",
      "sections": [
        "XV of 1908"
      ],
      "relevance": "Fees for vessel services."
    },
    {
      "name": "Indian Railways Act, 1890",
      "sections": null,
      "relevance": "Applies to goods received for rail carriage."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed appeals with costs, set aside High Court order, dismissed writ petitions. Held scale E charges validly levied on steamer agents; Board can enforce rates and require form undertaking.",
    "relief_granted": "Appeals allowed; writs quashed.",
    "costs": "Costs in Supreme Court and High Court to appellants."
  },
  "key_quotes": [
    {
      "text": "\"The liability to pay these charges, however, does not arise on account of the undertaking but on account of the sanctioned scale of rates at which and the conditions under which the Board would perform those services. Section 44 of the Act provides that such sanctioned rates and conditions shall have the force of law.\"",
      "speaker": "court",
      "significance": "Confirms legal basis of charges independent of form."
    },
    {
      "text": "\"It is clear therefore that when the Board takes charge of the goods from the ship-owner, the ship-owner is the bailor and the Board is the bailee.\"",
      "speaker": "court",
      "significance": "Establishes bailment relationship key to liability."
    },
    {
      "text": "\"The charges are for labour rendered idle on account of some default on the part of the ship-owner or his agent and not on account of anything which is within the control of the workmen.\"",
      "speaker": "court",
      "significance": "Justifies scale E as service charges, not damages."
    }
  ],
  "_case_id": "1962_393",
  "_label": 1,
  "_text_length": 57347,
  "_extracted_at": "2026-02-10T20:02:37.690363"
}