{
  "metadata": {
    "case_name": "Appellant v. State of Orissa & Ors.",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 407/61",
    "date_of_judgment": "1962-03-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant made an application to the State Government of Orissa in 1949 for grant of a mining lease for manganese ore over an area comprising 5400 acres situated in the district of Keonjhar.",
      "type": "background",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant was the first applicant for the lease of the aforesaid area, and subsequently other persons applied for lease of the same area including Messrs. Tata Iron and Steel Company Limited (Tatas), the intervener.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Government of Orissa decided to grant the lease in favour of Tatas and in January 1956 referred the matter to the Central Government for its approval under r. 32 of the Mineral Concession Rules, 1949.",
      "type": "procedural",
      "date": "1956-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellant made a representation to the Central Government against the recommendation of the State Government.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On April 9, 1957, the Central Government turned down the recommendation of the State Government about the grant of the mining lease to Tatas. It directed that the applications received prior to the application of Tatas should be considered according to the Rules but added that in case the Government of Orissa desired to work the area on a departmental basis, the Central Government would have no objection to consider a proposal for that purpose.",
      "type": "procedural",
      "date": "1957-04-09",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Thereafter the State Government rejected the application of the appellant in December 1957 on the ground that the State Government proposed to arrange for the exploitation of the area in the public sector.",
      "type": "procedural",
      "date": "1957-12",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The appellant filed an application for review to the Central Government under r. 57 of the Rules. This application was rejected by the Central Government in June 1959.",
      "type": "procedural",
      "date": "1959-06",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The appellant filed a petition under Art. 226 of the Constitution in the Orissa High Court in July 1959. This petition was dismissed by the High Court on August 23, 1960, on the ground that it had no jurisdiction to deal with the matter as the final order was passed by the Central Government beyond its territorial jurisdiction.",
      "type": "procedural",
      "date": "1959-07",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The appellant applied to the High Court for a certificate to appeal to the Supreme Court, which was rejected. Special leave was then granted by the Supreme Court.",
      "type": "procedural",
      "date": "1960-08-23",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "The limit of the jurisdiction of the High Court under Art. 226 in circumstances where the final order rejecting the application was passed by the Central Government located beyond the territorial jurisdiction of the High Court.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Central Government had merely dismissed the review petition, so the effective order rejecting the appellant's application for the mining lease was that of the State Government, and therefore the High Court would have jurisdiction to grant a writ under Art. 226. The principle in Election Commission India v. Saka Venkata Subba Rao would not apply. Reliance placed on State of Uttar Pradesh v. Mohammed Nooh.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Art. 226; State of Uttar Pradesh v. Mohammed Nooh (1958 S.C.R. 595)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The High Court had no jurisdiction under Art. 226 as the final order was passed by the Central Government not located within the territories subject to the High Court's jurisdiction.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Art. 226; Election Commission India v. Saka Venkata Subba Rao (1953 S.C.R. 1144)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "There is a two-fold limitation on the power of the High Court to grant a writ under Art. 226: (1) the power is exercised throughout territories in relation to which it exercises jurisdiction, writs cannot run beyond those territories; (2) the person or authority must be within those territories.",
      "addresses_issue": "i1",
      "key_observation": "View reaffirmed in Lt. Col. Khajoor Singh v. Union of India."
    },
    {
      "id": "cr2",
      "text": "Principle in Mohammed Nooh's case does not apply as it dealt with pre-Constitution dismissal not gaining efficacy from later orders; here, the review by Central Government effectively rejected the application.",
      "addresses_issue": "i1",
      "key_observation": "Principle of merger applicable to inferior authority's order when superior outside jurisdiction, as writ against inferior would be infructuous (approved in A. Thangal Kunju Musaliar v. M. Venkitachalam Potti)."
    },
    {
      "id": "cr3",
      "text": "Under r. 60 of the Rules, the order of the Central Government on review prevails and is final; thus, Central Government's dismissal of review effectively and finally rejected the appellant's application.",
      "addresses_issue": "i1",
      "key_observation": "Issuing writ against State Government would be useless as Central Government's order would stand."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Orissa High Court had no jurisdiction to issue a writ under Art. 226 as the final effective order rejecting the appellant's mining lease application was that of the Central Government, not situated within the High Court's territorial jurisdiction.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Election Commission India v. Saka Venkata Subba Rao",
      "citation": "1953 S.C.R. 1144",
      "treatment": "followed",
      "relevance": "Laid down two-fold limitations on High Court's Art. 226 jurisdiction regarding territory and amenability."
    },
    {
      "case_name": "State of Uttar Pradesh v. Mohammed Nooh",
      "citation": "1958 S.C.R. 595",
      "treatment": "distinguished",
      "relevance": "Dealt with pre-Constitution dismissal not subject to Art. 226; merger principle not applicable to departmental orders in that context."
    },
    {
      "case_name": "Lt. Col. Khajoor Singh v. Union of India",
      "citation": "1961 2 S.C.R. 828",
      "treatment": "followed",
      "relevance": "Reaffirmed territorial limitations on Art. 226 jurisdiction."
    },
    {
      "case_name": "A. Thangal Kunju Musaliar v. M. Venkitachalam Potti",
      "citation": "1955 2 S.C.R. 1196",
      "treatment": "followed",
      "relevance": "Approved High Court view that writ against inferior authority within jurisdiction is infructuous if superior authority outside jurisdiction has passed order."
    },
    {
      "case_name": "Shivji Nathubhai v. Union of India",
      "citation": null,
      "treatment": "referred",
      "relevance": "Explained that under Rules, State Government order effective until review; distinguished as not requiring Central confirmation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Jurisdiction of High Courts to issue writs limited to territories and authorities within jurisdiction."
    },
    {
      "name": "Mineral Concession Rules, 1949",
      "sections": [
        "r. 32",
        "r. 57",
        "r. 59",
        "r. 60"
      ],
      "relevance": "r.32: Preference to first applicant unless special reasons with Central approval; r.57: Review; r.60: Central Government order on review is final."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave is dismissed. The Supreme Court holds that the Orissa High Court correctly found it lacked jurisdiction under Art. 226 to entertain the writ petition, as the final order rejecting the appellant's mining lease application was effectively passed by the Central Government outside the High Court's territorial jurisdiction.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is well settled by a series of decisions of this Court beginning with Saka Venkata Subba Rao's case that there is two-fold limitation on the power of the High Court to grant a writ under Art. 226.",
      "speaker": "court",
      "significance": "Defines the core territorial limitations on High Court writ jurisdiction."
    },
    {
      "text": "Clearly therefore r. 60 provides that where there is a review petition against the order passed in the first instance by the State Government, the order of the Central Government passed in review would prevail and would be the final order.",
      "speaker": "court",
      "significance": "Explains why Central Government's order is final and effective, depriving High Court of jurisdiction."
    }
  ],
  "_case_id": "1962_20",
  "_label": 0,
  "_text_length": 12656,
  "_extracted_at": "2026-02-10T19:56:46.057598"
}