{
  "metadata": {
    "case_name": "Petition No. 62 of 1962 (Company v. Union of India)",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO, J."
    ],
    "case_number": "Petition No. 62 of 1962",
    "date_of_judgment": "1962-09-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner No. 1 is a public limited company engaged in the manufacture of engineering goods, structural fabrication and rolling stock, and the Employees Provident Funds Act, 1952 applies to the Company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Company has a production bonus scheme in force which provides for payment of production bonus over and above wages fixed by the major engineering award of 1958, published in the Calcutta Gazette dated November 5, 1958, which governs 74 major engineering concerns including the Company.",
      "type": "background",
      "date": "1958-11-05",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The award fixes basic wages and dearness allowance on time rate basis for the entire major engineering industry and is still in force.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Company has two production bonus schemes: one for hourly rated workers (revised from January 1, 1962, applicable quarterly, bonus begins when output reaches 1300 tons per quarter, no bonus if below) and one for the rest (annual, bonus begins at 5000 tons per year, no bonus if below).",
      "type": "material",
      "date": "1962-01-01",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Negotiations are going on for revising the old scheme for other staff to bring it in line with the new scheme for hourly rated workers.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Employees' Provident Funds Scheme, 1952 framed in September 1952 is applicable to the Company.",
      "type": "background",
      "date": "1952-09",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Central Government on March 7, 1962 directed that production bonus payable as part of contract of employment satisfies definition of basic wages under s.2(b), to effect recovery of provident fund contributions on production bonus without delay, and deposit arrears from January 1, 1960.",
      "type": "material",
      "date": "1962-03-07",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Present writ petition filed in April 1962 against the Central Government's decision communicated in March 1962.",
      "type": "procedural",
      "date": "1962-04",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Writ Petition No. 64 of 1962 (Jay Engineering Works Limited v. Union of India) heard along with this petition; additional affidavits to be filed regarding its production bonus scheme.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Various kinds of bonuses (production, festival/puja, customary, attendance, profit) were known and in force in industries before 1952.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether production bonus is included within the term 'basic wages' as defined in s.2(b) of the Employees Provident Funds Act, 1952.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Bonus without any qualification is excluded from 'basic wages' in s.2(b); therefore all kinds of bonus (profit, production, attendance, festival) are excluded whether implied condition of service or customary.",
      "supporting_facts": [
        "f2",
        "f4",
        "f6"
      ],
      "legal_basis": "s.2(b) of Employees Provident Funds Act, 1952; s.6"
    },
    {
      "id": "pa2",
      "text": "Legislature aware of various bonuses when passing Act in 1952; Central Government cannot include production bonus in basic wages under s.19A.",
      "supporting_facts": [
        "f7",
        "f10"
      ],
      "legal_basis": "s.2(b), s.6, s.19A Employees Provident Funds Act, 1952"
    },
    {
      "id": "pa3",
      "text": "Including production bonus would violate Art.14 as not a general feature of all concerns, leading to unequal contributions.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Article 14 of Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Production bonus is incentive wage, part of 'all emoluments earned by employee while on duty... in accordance with terms of contract of employment'; qualifies as basic wages.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s.2(b) Employees Provident Funds Act, 1952"
    },
    {
      "id": "ra2",
      "text": "'Bonus' in exception cl.(ii) of s.2(b) refers only to profit bonus, as per industrial adjudication before 1952.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "s.2(b) Employees Provident Funds Act, 1952"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Basic wages includes all emoluments earned per contract paid in cash, but exceptions in cl.(ii) of s.2(b) exclude payments not earned/payable in all concerns or by all employees of a concern, e.g., house-rent, overtime, commission; dearness allowance excluded but included in s.6.",
      "addresses_issue": "i1",
      "key_observation": "Basis of exclusion: not common to all concerns/employees."
    },
    {
      "id": "cr2",
      "text": "'Bonus' in cl.(ii) without qualification includes all kinds known before 1952 (production, puja, customary, attendance, profit); legislature aware; not limited to profit bonus.",
      "addresses_issue": "i1",
      "key_observation": "Bonus of all kinds excluded to ensure uniform incidence of PF across concerns."
    },
    {
      "id": "cr3",
      "text": "Production bonus is incentive beyond base/standard time wages; workers not bound to exceed standard; extra payment is production bonus, not basic wages.",
      "addresses_issue": "i1",
      "key_observation": "Typical production bonus scheme excludes it from basic wages per exception for bonus."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Production bonus of the type in force in the Company is excluded from 'basic wages' under s.2(b); Central Government's direction under s.19A including it is incorrect.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Messrs. Titaghur Paper Mills Co. Limited v. Its Workmen",
      "citation": "1959 Supp. 2 S.C.R. 1012",
      "treatment": "referred",
      "relevance": "Production bonus in force long before 1952; nature as incentive wage."
    },
    {
      "case_name": "Messrs. Ispahani Limited Calcutta v. Ispahani Employees Union",
      "citation": "1960 1 S.C.R. 24",
      "treatment": "referred",
      "relevance": "Festival/puja bonus as implied term before 1952."
    },
    {
      "case_name": "The Graham Trading Co. (India) Limited v. Its Workmen",
      "citation": "1960 1 S.C.R. 107",
      "treatment": "referred",
      "relevance": "Customary bonus in connection with festival before 1952."
    },
    {
      "case_name": "Millowners Association v. The Rashtriya Mill Mazdoor Sangh, Bombay",
      "citation": "1950 I.L.J. 1247",
      "treatment": "referred",
      "relevance": "Profit bonus principles; term 'bonus for the year' used."
    }
  ],
  "statutes_cited": [
    {
      "name": "Employees Provident Funds Act, No. 19 of 1952",
      "sections": [
        "s.2(b)",
        "s.5",
        "s.6",
        "s.19A"
      ],
      "relevance": "Definition of basic wages excludes production bonus; contributions on basic wages, DA, retaining allowance; Central Govt power to remove difficulties."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 14"
      ],
      "relevance": "Writ petition for enforcement of fundamental rights; equality argument not decided."
    },
    {
      "name": "Coal Mines Provident Fund and Bonus Schemes Act, No. 46 of 1948",
      "sections": [],
      "relevance": "Provided for attendance bonus before 1952."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Writ petition allowed; held that production bonus is excepted from 'basic wages'; Central Government's decision communicated on March 7, 1962 directing PF contributions on production bonus set aside.",
    "relief_granted": "Quashing of Central Government's direction",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'Basic wages' means all emoluments which are earned by an employee while on duty or on leave with wages in accordance with the terms of the contract of employment and which are paid or payable in cash to him, but does not include... bonus...",
      "speaker": "court",
      "significance": "Core definition and exception central to the issue."
    },
    {
      "text": "The basis for the exclusion in cl. (ii) of the exceptions in s. 2(b) is that all that is not earned in all concerns or by all employees of a concern is excluded from basic wages.",
      "speaker": "court",
      "significance": "Key reasoning for interpreting exceptions, including bonus."
    },
    {
      "text": "Production bonus of this type is excluded from the definition of basic wages in s. 2(b) and therefore the decision of the Central Government... is incorrect.",
      "speaker": "court",
      "significance": "Direct holding on the main issue."
    }
  ],
  "_case_id": "1962_61",
  "_label": 1,
  "_text_length": 26801,
  "_extracted_at": "2026-02-10T19:57:15.801797"
}