{
  "metadata": {
    "case_name": "National Union of Commercial Employees & Anr v. M/s. Pereira & Fazalbhoy & Co.",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 24 of 1961",
    "date_of_judgment": "1962-02-13"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In August, 1957 the appellant wrote to the respondent firm setting forth certain demands on behalf of its employees. These demands related to bonus for the years 1955-56 and 1956-57 and to certain other matters.",
      "type": "background",
      "date": "1957-08",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "As the parties could not agree, the dispute was taken before the Conciliation Officer.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The Conciliation Officer failed to bring about a settlement and submitted his failure report to the Government of Bombay.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The State Government referred the dispute in regard to the bonus for the two years 1956 and 1957 for adjudication before an Industrial Tribunal under section 12(5) of the Industrial Disputes Act No. 14 of 1947.",
      "type": "procedural",
      "date": null,
      "source": "government"
    },
    {
      "id": "f5",
      "text": "Before the Tribunal, the respondents raised a preliminary objection that the profession followed by them was not an industry within the meaning of the Act, and so the dispute was not an industrial dispute, the reference incompetent, and Tribunal had no jurisdiction. The Tribunal upheld the objection and held it had no jurisdiction.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The order of the Tribunal was challenged by the appellants before the Bombay High Court by Special Civil Application No. 2789 of 1958 under Articles 226 and 227. The High Court held the firm did not constitute an industry, dispute not industrial, Tribunal right, petition dismissed.",
      "type": "procedural",
      "date": "1958-11-20",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "High Court granted certificate, appellants appealed to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Respondents firm carries on the work of Solicitors in Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Partnership deed of respondents provided that all expenses of the business of the partnership or losses incurred in carrying on the business of the partnership shall be borne out of the profits or capital.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondents firm which carries on the work of Solicitors in Bombay can be said to constitute an industry under s. 2(j) of the Industrial Disputes Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Distinction between professional service rendered by individual and by firm consisting of several partners; organised and institutionalised service by firm attracts s.2(j) due to cooperation between employers and employees engaged for different categories of work, facilitating more work quickly and efficiently.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "State of Bombay v. Hospital Mazdoor Sabha (working test)"
    },
    {
      "id": "pa2",
      "text": "Respondents themselves described their work as 'business of solicitors' in partnership deed.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Dickson v. Jones"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Profession followed by them was not an industry within the meaning of the Act, dispute not industrial dispute, reference incompetent, Tribunal no jurisdiction.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s.2(j) Industrial Disputes Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Words of s.2(j) wide but line drawn to exclude some; working principle: activity systematically undertaken for production/distribution of goods or material services to community with employees' help, organised like trade/business, not casual/pleasure; cooperation employer-employees for satisfaction of material human needs.",
      "addresses_issue": "i1",
      "key_observation": "Applies test from Hospital Mazdoor Sabha case."
    },
    {
      "id": "cr2",
      "text": "Distinction individual vs firm not logical; single solicitor also employs staff, cooperation same.",
      "addresses_issue": "i1",
      "key_observation": "Cannot confine to organisational aspect of firm."
    },
    {
      "id": "cr3",
      "text": "Cooperation must be direct/essential for production of goods/rendering service; partnership capital-labour leads to production/service.",
      "addresses_issue": "i1",
      "key_observation": "Examples: textile mill (direct contribution to goods), hospital (employees directly involved in patient services post-diagnosis/treatment)."
    },
    {
      "id": "cr4",
      "text": "Solicitors' service essentially individual, depends on professional equipment/knowledge/efficiency; subsidiary work (clerks, typists, menials) incidental, no direct nexus to professional service rendered to client.",
      "addresses_issue": "i1",
      "key_observation": "Work of clerk/accountant no direct/essential connection to solicitor's advice."
    },
    {
      "id": "cr5",
      "text": "Liberal professions like attorney not intended in s.2(j); no active cooperation capital-labour, principal capital is intellectual equipment.",
      "addresses_issue": "i1",
      "key_observation": "Broad considerations exclude liberal professions."
    },
    {
      "id": "cr6",
      "text": "Description as 'business' in partnership deed irrelevant; loose sense, but s.2(j) requires working test.",
      "addresses_issue": "i1",
      "key_observation": "Dickson v. Jones on restraint of trade not determinative."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Work of solicitors firm is not an industry under s.2(j) of the Industrial Disputes Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Bombay v. Hospital Mazdoor Sabha",
      "citation": "1960 2 S.C.R. 866",
      "treatment": "followed",
      "relevance": "Working principle/test for 'industry' under s.2(j); hospitals as industry."
    },
    {
      "case_name": "Brij Mohan Bagaria v. N. Chatterjee",
      "citation": "A.I.R. 1958 Cal. 460",
      "treatment": "followed",
      "relevance": "Solicitors firm not industry."
    },
    {
      "case_name": "D.P. Dunderdale v. G.P. Mukherjee",
      "citation": "A.I.R. Cal. 465",
      "treatment": "followed",
      "relevance": "Solicitors firm not industry."
    },
    {
      "case_name": "Federated Municipal and Shire Council Employees Union of Australia v. Melbourne Corporation",
      "citation": "1919 26 C.L.R. 508",
      "treatment": "referred",
      "relevance": "Concept of industrial dispute excludes legal/medical professions lacking capital-labour cooperation."
    },
    {
      "case_name": "Dickson v. Jones",
      "citation": "1939 3 All. E.R. 182",
      "treatment": "distinguished",
      "relevance": "Solicitors' work as 'business' for restraint of trade, not determinative for s.2(j) industry."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s.2(j)",
        "s.12(5)",
        "s.2(n)"
      ],
      "relevance": "Definition of 'industry'; reference of dispute; public utility service including hospitals."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 227"
      ],
      "relevance": "Basis for High Court writ petition."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed upholding Bombay High Court and Industrial Tribunal; solicitors firm not an industry under s.2(j), no jurisdiction to adjudicate bonus dispute.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"...as a working principle, it may be stated that an activity systematically or habitually undertaken for the production or distribution of goods or for the rendering of material services to the community at large or a part of such community with the help of employees is an undertaking.\"",
      "speaker": "court",
      "significance": "Defines test for 'industry' from Hospital case."
    },
    {
      "text": "\"The cooperation between capital and labour or between the employer and his employees which is treated as a working test... is the cooperation which is directly involved in the production of goods or in the rendering of service.\"",
      "speaker": "court",
      "significance": "Clarifies essential direct cooperation required."
    },
    {
      "text": "\"...the service rendered by a solicitor functioning either individually or working together with partners is service which is essentially individual it depends upon the professional equipment, knowledge and efficiency of the solicitor concerned.\"",
      "speaker": "court",
      "significance": "Why solicitors' firm fails the test."
    },
    {
      "text": "\"A person following a liberal profession does not carry on his profession in any intelligible sense with the active cooperation of his employees...\"",
      "speaker": "court",
      "significance": "Excludes liberal professions broadly."
    }
  ],
  "_case_id": "1962_104",
  "_label": 0,
  "_text_length": 24618,
  "_extracted_at": "2026-02-10T19:57:50.644593"
}