{
  "metadata": {
    "case_name": "Chinna Gowda v. State (Criminal Appeal Nos. 172 & 173 of 1961)",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Criminal Appeal Nos. 172 & 173 of 1961",
    "date_of_judgment": "1962-04-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Murder of entire family of Mariappa Gowda consisting of eight persons on the night intervening 12th and 13th February 1958 in Handigodu hamlet of village Viavalli.",
      "type": "material",
      "date": "1958-02-12/13",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Mariappa Gowda took residence in Handigodu 8-10 years prior to murder, became prosperous, arousing envy of appellant Chinna Gowda.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Numerous disputes over field boundaries, trespasses, water flow between Mariappa Gowda and Chinna Gowda.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Strained relations between Mariappa Gowda and appellants Chinna Gowda and Rame Gowda prior to murders.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Rame Gowda lived with Mariappa Gowda, leased lands from him, fell out; Mariappa reluctant to issue rent receipts.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "On intervention of Chandiah Hegde PW 67, Mariappa issued receipt to Rame Gowda containing false recital of surrender of leased land.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Rame Gowda stopped Mariappa's bullock cart and challenged eviction; complained to Singappagowda that Mariappa cheated him and threatened action.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Mariappa's house situated 1.5 furlongs from Chinna Gowda's house; no other house nearer; lived with wife Bellamma and six children; kept dog (died few days prior), light outside, loaded gun.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Morning of Feb 13 1958, PW 12 Narayan found doors open, inmates dead in pools of blood; informed PW 31 Harithal Chandegowda; police informed, investigation commenced.",
      "type": "procedural",
      "date": "1958-02-13",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Seven accused and PW 40 Venkappa Naika (later approver) arrested; confessions by Venkappa Naika, Accused 3 Manjappa Gowda, Accused 4 Manjappa Naika; retracted at committal.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Sessions Judge convicted all seven under IPC 302, death sentences; High Court acquitted A2 Shivappa Naika and A7 Gunde Gowda, confirmed conviction and death for Chinna Gowda and Rame Gowda, life for others.",
      "type": "procedural",
      "date": "1961-07-07",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Special leave granted under Art. 136; appeals before Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Approver Venkappa Naika's evidence: Met Chinna Gowda prior day, took arrack to his house evening Feb 12; met others in garden; drank arrack, ate; Chinna Gowda instigated to kill Mariappa; went to house, killed all with choppers, looted cash and jewellery.",
      "type": "disputed",
      "date": "1958-02-12",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "PW 16 Dugamma (neighbour): Heard Ramappa Naika say 'Torch light fell'; saw torch light at night, spoke to Chinna Gowda.",
      "type": "disputed",
      "date": "1958-02-12/13",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "PW 59 Mariappa (son of Rame Gowda, servant of Chinna Gowda): Saw Venkappa arrive, go to garden; Chinna Gowda etc. had meals, saw torch flash, went to garden briefly, returned; Chinna warned not to tell.",
      "type": "disputed",
      "date": "1958-02-12",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Chinna Gowda arranged loan of Rs 600 from PW 75 T Shivaiah for Feb 13 but did not go.",
      "type": "circumstantial",
      "date": "1958-02-13",
      "source": "prosecution"
    },
    {
      "id": "f17",
      "text": "Appellants did not enquire about incident or visit hospital unlike other villagers.",
      "type": "circumstantial",
      "date": "1958-02-13",
      "source": "prosecution"
    },
    {
      "id": "f18",
      "text": "Confessions of Manjappa Gowda and Manjappa Naika recorded March 27/29 1958; retracted.",
      "type": "procedural",
      "date": "1958-03-27/29",
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether conviction of appellants can be sustained on evidence of approver without corroboration in material particulars, corroborated only by retracted confessions and other evidence.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Reliance on evidence of approver Venkappa Naika, corroborated by retracted confessions of A3 and A4, evidence of PW 16 Dugamma and PW 59 Mariappa, failure to take loan, failure to enquire about murders.",
      "supporting_facts": [
        "f13",
        "f14",
        "f15",
        "f16",
        "f17",
        "f18"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Evidence of PW 16 Dugamma and PW 59 Mariappa does not corroborate approver on material particulars and contradicts on important points like timing and movements.",
      "addresses_issue": "i1",
      "key_observation": "No corroboration from these witnesses."
    },
    {
      "id": "cr2",
      "text": "Retracted confessions weaker evidence, not tested by cross-examination; recorded after police custody together, possible concert; magistrate did not adequately warn A4.",
      "addresses_issue": "i1",
      "key_observation": "Cannot safely rely as corroboration per Bhuboni Sahu."
    },
    {
      "id": "cr3",
      "text": "Failure to take loan suspicious but does not prove participation.",
      "addresses_issue": "i1",
      "key_observation": "Circumstantial but insufficient."
    },
    {
      "id": "cr4",
      "text": "Approver's evidence alone insufficient: bad character, retracted confession earlier, illicit liquor seller.",
      "addresses_issue": "i1",
      "key_observation": "Requires corroboration in material particulars per s.133, 114(b) Evidence Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Conviction cannot be sustained solely on uncorroborated evidence of approver.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bhuboni Sahu v. The King",
      "citation": "1949 L.R. 76 I.A. 147",
      "treatment": "followed",
      "relevance": "Courts require corroboration of approver evidence in material particulars; danger of false implication; retracted confessions not sufficient corroboration without independence."
    },
    {
      "case_name": "Kashmira Singh v. State of Madhya Pradesh",
      "citation": "1952 S.C.R. 526",
      "treatment": "followed",
      "relevance": "Confessions under s.30 can lend assurance but weaker than tested evidence; danger in using one accomplice to corroborate another."
    },
    {
      "case_name": "Sarwan Singh v. The State of Punjab",
      "citation": "1957 S.C.R. 953",
      "treatment": "followed",
      "relevance": "Magistrate must ensure accused mind free from police influence, give time to reflect, warn properly before recording confession under s.164 CrPC."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302"
      ],
      "relevance": "Offence of murder for which accused convicted."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "133",
        "114(b)",
        "30"
      ],
      "relevance": "Conviction on approver evidence permitted but prudence requires corroboration; presumption accomplice unworthy unless corroborated; confessions of co-accused usable but weak."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "164"
      ],
      "relevance": "Recording of confessions; requirements for voluntariness and warnings."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "136"
      ],
      "relevance": "Special leave to appeal."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court held that the evidence of the approver lacks sufficient corroboration in material particulars from independent sources, retracted confessions unreliable, other circumstances insufficient; convictions of appellants Chinna Gowda and Rame Gowda not sustainable.",
    "relief_granted": "Appeals allowed, convictions and sentences set aside.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the Courts, as a matter of prudence, always require that the evidence of the approver should be corroborated in material particulars.",
      "speaker": "court",
      "significance": "States the rule of prudence under Evidence Act s.133 and 114(b)."
    },
    {
      "text": "A confession cannot be regarded as a piece of satisfactory evidence because it is not made in the presence of the person or persons whom it incriminates and consequently cannot be tested by cross-examination.",
      "speaker": "court",
      "significance": "Explains weakness of retracted confessions under s.30 Evidence Act."
    },
    {
      "text": "his evidence, standing by itself, cannot, therefore, carry conviction.",
      "speaker": "court",
      "significance": "Concludes approver's evidence insufficient alone."
    }
  ],
  "_case_id": "1962_130",
  "_label": 1,
  "_text_length": 29698,
  "_extracted_at": "2026-02-10T19:58:34.481052"
}