{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Bombay v. Assessee",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 420 of 1961",
    "date_of_judgment": "1962-02-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee received a sum of Rs. 40,000 on July 20, 1946.",
      "type": "material",
      "date": "1946-07-20",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In proceedings for assessment year 1946-47, the sum came to the notice of the Income-tax Officer, but since the receipt fell within the accounting year relative to assessment year 1947-48, it was not assessed, with a note that it would be considered in 1947-48 assessment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In the return filed for assessment year 1947-48, the amount was not shown by the assessee.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Income-tax Officer overlooked the note at the end of his order in the previous year's assessment, resulting in the item being omitted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The assessee appealed to the Appellate Assistant Commissioner against his assessment for 1947-48.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "While the appeal was pending, the Income-tax Officer wrote a letter to the Appellate Assistant Commissioner intimating he would like to be present and requesting assessment of Rs. 40,000.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Appellate Assistant Commissioner issued notice, assessed the amount, and included it in the original assessment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The assessee contended that Rs. 40,000 represented a receipt of capital nature, while it was held to be on revenue account.",
      "type": "disputed",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f9",
      "text": "The Tribunal agreed with the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f10",
      "text": "On application of the assessee, the Tribunal referred two questions to the High Court under s. 66(1).",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f11",
      "text": "The High Court answered the first question against the Department and declined to answer the second as academic, in judgment dated March 14, 1958, in I.T.R. No. 54 of 1957.",
      "type": "procedural",
      "date": "1958-03-14",
      "source": "high_court"
    },
    {
      "id": "f12",
      "text": "Appeal filed by special leave against Bombay High Court judgment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of the case the Appellate Assistant Commissioner was competent to enhance the assessment of the appellant for the assessment year 1947-48 by a sum of Rs. 40,000?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether on the facts and circumstances of the case the said sum of Rs. 40,000 is a revenue receipt and assessable to tax in the assessment year 1947-48?",
      "framed_by": "tribunal"
    },
    {
      "id": "i3",
      "text": "Whether in an appeal filed by assessee, the Appellate Assistant Commissioner can find a new source of income not considered by the Income-tax Officer and assess it under his powers granted by s. 31 of the Income-tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Appellate Assistant Commissioner can enhance the assessment including by discovering new sources of income not mentioned in the return and not considered by the Income-tax Officer, as 'enhance the assessment' refers to the ultimate amount payable based on true total income.",
      "supporting_facts": [
        "f1",
        "f3",
        "f4",
        "f6",
        "f7"
      ],
      "legal_basis": "Section 31(3) Income-tax Act; Commissioner of Income-tax v. McMillan & Co."
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The powers of the Appellate Assistant Commissioner are confined to what was before the Income-tax Officer and considered by him; he cannot introduce new sources of income, and if needed, should remand the case.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Narrondas Manordas v. Commissioner of Income-tax; Jagarnath Therani v. Commissioner of Income-tax; Gajalakshmi Ginning Factory v. Commissioner of Income-tax"
    },
    {
      "id": "ra2",
      "text": "Assessing new sources deprives assessee of findings by two tribunals and right of appeal; escaped income from new sources covered by ss. 34 and 33B.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Sections 34, 33B Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 31(3) empowers AAC to confirm, reduce, enhance or annul assessment, or remand, but powers are revisional and confined to the subject-matter of the assessment before ITO; cannot travel outside the record to find new sources not disclosed.",
      "addresses_issue": "i3",
      "key_observation": "Uniform view of High Courts for 37 years limits AAC to matters considered by ITO; legislature did not amend s.31 despite opportunities."
    },
    {
      "id": "cr2",
      "text": "Provisions like ss.34 and 33B exist for escaped income from new sources after special procedure.",
      "addresses_issue": "i3",
      "key_observation": "AAC has appellate and revisional jurisdiction but not to initiate new assessments beyond ITO's record."
    },
    {
      "id": "cr3",
      "text": "McMillan case approved revisional powers but left open the question of new sources; does not overrule prior view.",
      "addresses_issue": "i3",
      "key_observation": "SC has not expressed final opinion contrary to High Court views."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellate Assistant Commissioner cannot enhance assessment by discovering and assessing new sources of income not considered by Income-tax Officer.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "AAC powers under s.31(3) confined to record before ITO (return and assessment order); new sources require ss.34/33B procedure.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Narrondas Manordas v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Bombay HC view that AAC powers confined to subject-matter of assessment considered by ITO."
    },
    {
      "case_name": "Jagarnath Therani v. Commissioner of Income-tax",
      "citation": "1925 I.L.R. 4 Pat. 385",
      "treatment": "followed",
      "relevance": "Patna HC: AAC cannot assess new sources beyond subject-matter of assessment."
    },
    {
      "case_name": "Gajalakshmi Ginning Factory v. Commissioner of Income-tax",
      "citation": "1942 22 I.T.R. 502, 510",
      "treatment": "followed",
      "relevance": "Madras HC: AAC enhancement restricted to income subject-matter before ITO."
    },
    {
      "case_name": "Bishwanath Prasad Bhagwat Prasad v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "referred",
      "relevance": "Approved Madras view (obiter)."
    },
    {
      "case_name": "Commissioner of Income-tax v. McMillan & Co.",
      "citation": "1958 S.C.R. 689",
      "treatment": "distinguished",
      "relevance": "Approved revisional powers but left open new sources issue."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "31",
        "66(1)",
        "34",
        "33B",
        "6"
      ],
      "relevance": "s.31 limits AAC enhancement powers; s.66(1) for reference; ss.34,33B for escaped new income."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave, upholding the Bombay High Court's decision that the Appellate Assistant Commissioner lacked competence to enhance the assessment by including Rs. 40,000 as a new source not considered by the ITO.",
    "relief_granted": "High Court judgment affirmed in favor of assessee.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the Appellate Assistant Commissioner has revisional powers, but that they are confined to what was before the Income-tax Officer and considered by the latter.",
      "speaker": "court",
      "significance": "Summarizes the upheld High Court view on AAC powers."
    },
    {
      "text": "In view of the provisions of ss. 34 and 33B by which escaped income can be brought to tax, there is reason to think that the view expressed uniformly about the limits of the powers of the Appellate Assistant Commissioner to enhance the assessment has been accepted by the legislature.",
      "speaker": "court",
      "significance": "Justifies adherence to prior interpretation due to legislative inaction."
    },
    {
      "text": "we do not think that we should interpret, s. 31 differently from what has been accepted in India as its true import, particularly as that view is also reasonably possible.",
      "speaker": "court",
      "significance": "Final holding declining to expand AAC powers."
    }
  ],
  "_case_id": "1962_10",
  "_label": 0,
  "_text_length": 12987,
  "_extracted_at": "2026-02-10T19:56:38.538515"
}