{
  "metadata": {
    "case_name": "State (Appellants) v. Inamdar of village Chinnavenkatapuram (Respondent)",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 242 of 1960",
    "date_of_judgment": "1962-03-30"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent was the sole inamdar of village Chinnavenkatapuram in the Parlakimidi zamindari in the district of Srikakulam.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Madras Estates Land (Reduction of Rent) Act, No. XXX of 1947 (the Act), came into force from January 7, 1948, to provide for reduction of rents payable by ryots in estates governed by the Madras Estates Land Act, No. 1 of 1908, to the level of assessments in neighbouring ryotwari areas, with collection exclusively by the State Government.",
      "type": "background",
      "date": "1948-01-07",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Act applied to all estates as defined in s. 3(2) of the Madras Estates Land Act.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Section 2 of the Act provided for appointment of special officer to recommend fair rates of rent after enquiries.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Section 3 empowered State Government, after considering special officer's report and Board of Revenue remarks, to fix rates by gazette order effective from Fasli year 1357.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Rents fixed under Section 3 recovered by State; after deducting recovery costs, peshkash, cesses, paid to landholder.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Section 7: Landholder not entitled to collect rents thereafter.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Notification issued under the Act fixing rates for respondent's estate: wet and dry lands reduced to half existing rates; dry land with agraharam well water to one-sixth.",
      "type": "material",
      "date": "1950-06-27",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Respondent filed writ petition on March 21, 1952, challenging notification: (i) estate not within Madras Estates Land Act; (ii) drastic reduction depriving right to hold property under Art. 19(1)(f).",
      "type": "procedural",
      "date": "1952-03-21",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "State opposed: after cess, quit-rent, 10% collection charges, net income Rs. 603/-; reduction not drastic.",
      "type": "disputed",
      "date": null,
      "source": "state"
    },
    {
      "id": "f11",
      "text": "High Court arguments by respondent: (i) not an estate; (ii) notification offends Art. 19(1)(f); (iii) Act ultra vires Art. 31 and s.299 GOI Act 1935.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Full Bench reference: Whether Rajah of Bobbili v. State of Madras holds Act does not offend s.299(2) GOI Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Full Bench held Act valid, no acquisition under s.299(2) even widely interpreted; reasonable restriction under Art. 19(1)(f); reduction to ryotwari level prima facie reasonable, but case-specific if substantial deprivation.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Division Bench: Respondent abandoned 'not estate' point; prior net income Rs. 3,875/-, after reduction Rs. 457/13/8; held below 25% threshold = unreasonable restriction; notification bad.",
      "type": "material",
      "date": "1957-09-11",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "High Court granted certificate for appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Constitutionality of the Madras Estates Land (Reduction of Rent) Act, 1947, particularly whether it violates Art. 19(1)(f), Art. 31 of Constitution or s.299 GOI Act 1935.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether the specific notification fixing reduced rents for respondent's estate amounts to unreasonable restriction on right to hold property under Art. 19(1)(f) due to drastic reduction leaving net income below 25% of prior income.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in holding reduction below 25% of prior net income per se unreasonable; percentage arbitrary; favors rack-renters over humane landholders; reduction to highest ryotwari rates reasonable basis regardless of prior rack-renting.",
      "supporting_facts": [
        "f8",
        "f14"
      ],
      "legal_basis": "Art. 19(1)(f)"
    },
    {
      "id": "pa2",
      "text": "Act constitutional: reduces rents to ryotwari level to check rack-renting; enacted under item 21 List II GOI Act; reasonable restriction.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Art. 19(1)(f); item 21 List II Sch. VII GOI Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Estate not within Madras Estates Land Act; reduction so drastic (net loss alleged Rs. 655/-) as to deprive right to hold property.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Art. 19(1)(f)"
    },
    {
      "id": "ra2",
      "text": "Act ultra vires s.299(2) GOI Act and Art. 31 (though not seriously pursued in SC).",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "s.299(2) GOI Act 1935; Art. 31 Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Act constitutional: object to check rack-renting by reducing to ryotwari levels; reasonable restriction under Art. 19(1)(f).",
      "addresses_issue": "i1",
      "key_observation": "Reduction to prevailing ryotwari rates reasonable basis."
    },
    {
      "id": "cr2",
      "text": "Attack under wide 'acquisition' in s.299 GOI Act concluded by Guru Dutt Sharma v. State of Bihar.",
      "addresses_issue": "i1",
      "key_observation": "No live issue."
    },
    {
      "id": "cr3",
      "text": "High Court wrong on 25% threshold: arbitrary; reduction basis (ryotwari rates) reasonable per se; prior income ratio irrelevant as favors rack-renters; actual net Rs. 457/- left; theoretical zero income impossible.",
      "addresses_issue": "i2",
      "key_observation": "Reasonableness judged by basis, not percentage drop."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Act lays down reasonable restrictions on right to hold property under Art. 19(1)(f); constitutional.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Notification valid; reduction to ryotwari level reasonable regardless of drop below 25% prior net income.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rajah of Bobbili v. State of Madras",
      "citation": "1952 1 M.L.J. 174",
      "treatment": "followed",
      "relevance": "Act does not offend s.299(2) GOI Act; mere rent reduction not acquisition; Full Bench upheld as good law even with wider 'acquisition'."
    },
    {
      "case_name": "Guru Dutt Sharma v. State of Bihar",
      "citation": "1962 2 S.C.R. 29",
      "treatment": "followed",
      "relevance": "Concludes against wide interpretation of 'acquisition' in s.299 GOI Act."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Estates Land (Reduction of Rent) Act, 1947",
      "sections": [
        "2",
        "3",
        "4",
        "5",
        "6",
        "7"
      ],
      "relevance": "Provides for reduction of rents to ryotwari level, fixation by notification, collection by State, payment to landholder after deductions."
    },
    {
      "name": "Madras Estates Land Act, 1908",
      "sections": [
        "3(2)"
      ],
      "relevance": "Defines 'estates' to which the 1947 Act applies."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "19(1)(f)",
        "31"
      ],
      "relevance": "Art. 19(1)(f): reasonable restrictions on right to hold property; Art. 31: acquisition challenged."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "299(2)"
      ],
      "relevance": "Challenged as violated by Act; mere rent reduction not 'acquisition'."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court judgment and order dated September 11, 1957 set aside; writ petition dismissed; Act and notification held constitutional and valid.",
    "relief_granted": "None to respondent; notification upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the reduction of the prevailing rents to the ryotwari level was an unreasonable restriction on the right of the landholder of an estate to hold property under Art. 19(1)(f).\"",
      "speaker": "court",
      "significance": "Holds Act constitutional."
    },
    {
      "text": "\"Once this basis is accepted as reasonable, we fail to see how the ratio between what the landholder was getting before the reduction and what he gets after the reduction will make what is per se reasonable into an unreasonable restriction.\"",
      "speaker": "court",
      "significance": "Rejects 25% threshold; reasonableness by basis, not percentage."
    },
    {
      "text": "\"the basis on which the reduction is made is the same in both cases and is reasonable, we see no reason for holding that a notification which may in a given case result in a fall of the net income which is even below 25 per centum of the previous net income would necessarily be bad\"",
      "speaker": "court",
      "significance": "Overrules High Court's arbitrary test."
    }
  ],
  "_case_id": "1962_193",
  "_label": 1,
  "_text_length": 18443,
  "_extracted_at": "2026-02-10T19:59:20.983291"
}