{
  "metadata": {
    "case_name": "Three Kapurs (Respondents) v. Three Brothers (Appellants)",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "AYYANGAR, J."
    ],
    "case_number": "Civil Appeal No. 176 of 1960",
    "date_of_judgment": "1962-11-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On March 27, 1954, the three Kapurs (respondents) filed original Suit No. 29 of 1954 before the District Judge Bangalore against the 3 appellants (brothers) for recovery of over Rs. 50,000/- and subsequent interest and costs due on a simple mortgage.",
      "type": "material",
      "date": "1954-03-27",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Before the suit came on for trial, parties filed a memo of compromise dated September 30, 1955, praying that the suit be decreed in terms thereof.",
      "type": "procedural",
      "date": "1955-09-30",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Court accepted the application and passed a decree as prayed: 'It is ordered and decreed that the plaintiffs suit be and the same is hereby decreed as per terms of the compromise, the copy of which is hereunto annexed.'",
      "type": "procedural",
      "date": "1955-09-30",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Terms of the Razinama: (1) Defendants agree to decree as prayed for. (2) Mortgaged properties hereby sold for amount of decree in full satisfaction; defendants to execute regular sale deed within ten days. (3) Properties put in possession of plaintiff decree-holder by 3rd defendant; JD 1 & 2 to pay rent Rs.75 each for shops 12 & 14 Godown Street; attornment for other tenants. (4) On JDs tendering decree amount within one year from decree date through court or otherwise, DHs to reconvey at their cost; time essence; default in rent loses right to reconveyance. (5) Attachment on properties of 2nd & 3rd defendants raised. (6) Properties not subject to attachment; if attachment subsists, mortgage security not merged.",
      "type": "material",
      "date": "1955-09-30",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellants did not execute regular sale-deed within ten days from September 30, 1955.",
      "type": "disputed",
      "date": "1955-10-10",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondents filed Interlocutory Application No. 6 of 1955 (later Execution Application No. 83 of 1956) on October 31, 1955, for directing appellants to execute sale-deed, annexing draft sale-deed reciting cls. 3 to 6 of razinama.",
      "type": "procedural",
      "date": "1955-10-31",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Disputes between parties, each accusing the other of non-compliance with compromise.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellants filed application on March 16, 1956, praying sale-deed in favour of third party who agreed to pay full decree amount per cl.4.",
      "type": "procedural",
      "date": "1956-03-16",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Appellants' applications opposed by respondents; further similar applications proceeded on basis that compromise-decree executable without further suit; appellants did not succeed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellants opposed E.A. 83/1956 on ground that relief not executable, requires separate suit as not relating to suit within O. XXIII r.3 CPC.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "District Judge upheld objection, rejected respondents' prayer for directing execution of sale-deed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court reversed District Judge's order on appeal (R.A. No. 268/1957) by judgment dated June 2, 1958.",
      "type": "procedural",
      "date": "1958-06-02",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appeal to Supreme Court on certificate of fitness under Art. 133(1)(a) Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether clause 2 of the compromise decree (directing execution of sale-deed conveying suit properties to respondents) is executable in execution proceedings or requires independent suit.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Relief of directing execution of sale-deed not available in execution but only by separate suit, as it does not relate to the suit within O. XXIII r.3 CPC.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "O. XXIII r.3 CPC"
    },
    {
      "id": "pa2",
      "text": "On proper construction of compromise, consideration was mere agreement to execute conveyance, not actual execution; decree under cl.1 satisfied immediately on filing compromise; cl.2 opening words refer to agreement; cls.3-6 inter se rights, not executable via decree.",
      "supporting_facts": [
        "f4",
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Court should not direct execution of conveyance without incorporating conditions in cls.3-6 and without examining entitlement to reconveyance under those clauses.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Entitled to execute decree in respect of clause 2 of compromise.",
      "supporting_facts": [
        "f6",
        "f4"
      ],
      "legal_basis": "O. XXIII r.3 CPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Decree embodies entire razinama including all terms; common ground.",
      "addresses_issue": "i1",
      "key_observation": "Proceed on basis that executability of particular term can be questioned in execution."
    },
    {
      "id": "cr2",
      "text": "Terms of compromise relate to suit: properties are mortgaged ones liable in execution; sale price is suit amount; conveyance is consideration for compromise.",
      "addresses_issue": "i1",
      "key_observation": "Nothing outside scope of suit."
    },
    {
      "id": "cr3",
      "text": "Rejects construction that mere agreement to convey satisfies decree; actual conveyance required; sale under cl.2 not absolute but subject to cls.3-6 as integrated scheme, but agreement to convey still requires execution.",
      "addresses_issue": "i1",
      "key_observation": "Cannot treat decree as satisfied merely by agreement."
    },
    {
      "id": "cr4",
      "text": "High Court directed execution only of cl.2; no opinion on other clauses as not raised; appellants can agitate rights under cls.3-6 in appropriate proceedings.",
      "addresses_issue": "i1",
      "key_observation": "Question of entitlement to reconveyance factual, to be investigated separately."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court justified in directing appellants to execute sale-deed conveying suit properties to respondents in execution proceedings of decree.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "O. XXIII r. 3"
      ],
      "relevance": "Governs passing of decree on compromise; decree executable so far as relates to suit."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 133(1)(a)"
      ],
      "relevance": "Basis for certificate granting appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; High Court's reversal of District Judge upheld; respondents entitled to execute clause 2 of compromise decree directing appellants to execute sale-deed; other clauses left open for future proceedings.",
    "relief_granted": "Direction to execute sale-deed under cl.2 upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The property which was to be conveyed consisted entirely of property included in the mortgage and which was therefore liable to be sold in execution of the mortgage decree which was the relief sought in the plaint.\"",
      "speaker": "court",
      "significance": "Explains why compromise relates to suit, making it executable."
    },
    {
      "text": "\"We find ourselves wholly unable to accept this argument... it would, however, not be a proper construction of the 1st sentence of cl. 2 to say that the mere agreement to convey and not an actual conveyance was intended to operate as a satisfaction of the decree.\"",
      "speaker": "court",
      "significance": "Rejects appellants' primary construction argument."
    },
    {
      "text": "\"The decree-holder is entitled to execute the decree in respect of clause 2 of the compromise. No opinion is expressed as to the executability of the other clauses.\"",
      "speaker": "court",
      "significance": "High Court's view adopted; limits scope to cl.2."
    }
  ],
  "_case_id": "1962_341",
  "_label": 0,
  "_text_length": 12561,
  "_extracted_at": "2026-02-10T20:01:55.938207"
}