{
  "metadata": {
    "case_name": "Kanji Manji v. Trustees of the Port of Bombay",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 302 of 1961",
    "date_of_judgment": "1962-02-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Suit filed by Trustees of the Port of Bombay for ejectment of appellant Kanji Manji and Rupji Jeraji (deceased before suit) from plot at Haji Bunder, Mazgaon, Sewri Reclamation Estate, Bombay, admeasuring 5066 619 square yards, Cadastral Survey No. 272/145 of Parel-Sewree Division, and for possession. Claim for Rs. 10,871-14-0 arrears of water charges and property taxes not concerned.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Suit decreed by Bombay City Civil Court ordering appellant to vacate and deliver vacant possession.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Appeal against decree filed in Bombay High Court, dismissed summarily on September 24, 1959. High Court refused certificate for appeal.",
      "type": "procedural",
      "date": "1959-09-24",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Special leave obtained, present appeal filed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In 1924, Trustees granted lease of land to Mancherji Vadilal and Company for 10 years commencing December 14, 1923. Rent: peppercorn first 6 months, then Rs. 633-5-4 monthly. Lessees to construct bullock stables and offices in first 6 months per specifications. Right to remove buildings within 3 months after term expiry if covenants performed, else buildings belong to Trustees.",
      "type": "background",
      "date": "1924-12-14",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Unclear what happened after 1924 lease expiry.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On August 11, 1942, Trustees granted monthly tenancy of land together with buildings thereon to Moreshwar Narayan Dhotre and Dinshaw Rustomji Ogre (Messrs. Dinshaw and Company) at Rs. 300 monthly rent, clear of deductions, plus rates/taxes. No additions/alterations without consent. Yield up cleared and levelled land on termination. Terminable by 1 calendar month's notice expiring on 1st of month. Right to remove buildings during notice period if covenants observed.",
      "type": "background",
      "date": "1942-08-11",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On February 28, 1947, Moreshwar and Dinshaw assigned rights to Rupji Jeraji and Kanji Manji for Rs. 22,250 (Ex. D), accepted by Trustees. Assignment as joint tenants.",
      "type": "background",
      "date": "1947-02-28",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On January 25, 1956, Trustees sent notice to Rupji Jeraji and Kanji Manji to vacate and deliver vacant possession by February 29, 1956. Not complied with.",
      "type": "procedural",
      "date": "1956-01-25",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Plaint amended by striking out name of Rupji Jeraji (deceased).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant raised pleas: notice invalid (served only on Kanji Manji, not heirs of Rupji); non-joinder of heirs; jurisdiction in Small Causes Court under Rent Act; protection under s.4(4)(a) not s.4(1); cannot evict sub-tenants making vacant possession impossible.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Trial court held tenancy joint, notice to one sufficient, no non-joinder; Rent Act s.4(1) applies not s.4(4)(a); jurisdiction in City Civil Court.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether notice to one joint tenant sufficient and suit not bad for non-joinder of heirs of other joint tenant.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether Bombay Rents, Hotel and Lodging Houses Rates Control Act, 1947 applies to suit for eviction from land belonging to local authority (Trustees of Port of Bombay), particularly s.4(1) vs s.4(4)(a), and consequent jurisdiction (City Civil Court vs Small Causes).",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether contract to deliver vacant possession impossible due to Rent Act protection for sub-tenants, rendering claim incompetent.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Notice dated January 25, 1956 invalid as served only on Kanji Manji, not heirs/legal representatives of Rupji Jeraji. Suit bad for non-joinder of heirs as necessary parties.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Suit governed by Bombay Rents Act 1947; protection under s.4(4)(a) not subs.(1); jurisdiction lies in Court of Small Causes, Bombay.",
      "supporting_facts": [
        "f1",
        "f11"
      ],
      "legal_basis": "Bombay Rents, Hotel and Lodging Houses Rates Control Act, 1947 s.4(4)(a)"
    },
    {
      "id": "pa3",
      "text": "Cannot evict sub-tenants due to Rent Act prohibition; impossible to deliver vacant possession, rendering claim incompetent.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Bombay Rents Act 1947"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Tenancy joint; notice to one joint tenant sufficient; no non-joinder issue.",
      "supporting_facts": [
        "f8",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Rent Act s.4(1) applies, exempting premises belonging to local authority; s.4(4)(a) limited to buildings, not land; suit for land only, jurisdiction in City Civil Court.",
      "supporting_facts": [
        "f1",
        "f7"
      ],
      "legal_basis": "Bombay Rents Act 1947 s.4(1), s.4(4)(a)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Tenancy joint per assignment deed ('assign... with the Assignees as Joint Tenants'), accepted by Trustees; notice to one joint tenant sufficient; suit properly framed.",
      "addresses_issue": "i1",
      "key_observation": "Once joint tenancy, notice to one sufficient."
    },
    {
      "id": "cr2",
      "text": "Suit for eviction from land only; 'premises' under s.5(8) includes land. s.4(1) exempts premises belonging to local authority generally. Bhatia case holds exemption absolute for such premises. Amendment s.4(4)(a) limited to buildings erected on such land (enables sub-tenancies, excludes from s.4(1) only those buildings), not land itself.",
      "addresses_issue": "i2",
      "key_observation": "s.4(4)(a) deals only with buildings, not land; local authority can evict from land without Rent Act impediment."
    },
    {
      "id": "cr3",
      "text": "1942 lease of land together with buildings thereon; buildings belong to lessors (precarious title, monthly tenancy terminable by notice, removal grace period only). Not buildings 'erected under agreement' but leased out belonging to Trustees.",
      "addresses_issue": "i2",
      "key_observation": "Leasehold interest precarious; assignees cannot claim buildings separate from land ownership."
    },
    {
      "id": "cr4",
      "text": "Impossibility argument: appellant does not claim whole lease void (which would justify suit); only vacant possession clause affected. Whether Port Trust can evict sub-tenants later not opined upon.",
      "addresses_issue": "i3",
      "key_observation": "Partial impossibility does not void eviction from land."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Notice to one joint tenant sufficient; no non-joinder defect.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Bombay Rents Act 1947 does not apply to eviction from land belonging to local authority; s.4(1) exempts, s.4(4)(a) limited to buildings; jurisdiction in City Civil Court.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Claim for vacant possession competent despite sub-tenants.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bhatia Co-operative Housing Society Ltd. v. D. Patel",
      "citation": "1953 SCR 185",
      "treatment": "followed",
      "relevance": "s.4(1) of Rent Act exempts premises belonging to local authority absolutely; three parts of s.4(1); land/buildings belong to lessor."
    },
    {
      "case_name": "Ram Bhagwandas v. Bombay Corporation",
      "citation": "I.R. 1956 Bom. 364",
      "treatment": "followed",
      "relevance": "s.4(4)(a) protects tenants in buildings on local authority land constructed under agreement; limited to buildings not land; phrase 'erected on any land held...' descriptive at time protection sought."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Rents, Hotel and Lodging Houses Rates Control Act, 1947",
      "sections": [
        "s.4(1)",
        "s.4(4)(a)",
        "s.5(8)",
        "s.15"
      ],
      "relevance": "s.4(1) exempts premises of local authority; s.4(4)(a) deems certain buildings as not belonging to local authority for Act application, enables sub-tenancies; s.5(8) defines premises to include land; s.15 prohibits sub-letting."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed. Suit for ejectment from land upheld; Rent Act does not apply; notice and jurisdiction proper.",
    "relief_granted": "Ejectment and possession to Trustees upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Once it is held that the tenancy was joint, a notice to one of the joint tenants was sufficient, and the suit for the same reason was also good.\"",
      "speaker": "court",
      "significance": "Rejects notice and non-joinder pleas."
    },
    {
      "text": "\"The import of sub-s. 4(a) of s.4 was thus limited to buildings, and did not extend to land.\"",
      "speaker": "court",
      "significance": "Core holding on Rent Act applicability."
    },
    {
      "text": "\"The truth is that the lessor after the building was erected became the owner of it and all the time thereafter the demised premises which include the building have belonged to him...\"",
      "speaker": "court",
      "significance": "From Bhatia case, affirms ownership vests in lessor."
    }
  ],
  "_case_id": "1962_106",
  "_label": 0,
  "_text_length": 22283,
  "_extracted_at": "2026-02-10T19:57:56.308677"
}