{
  "metadata": {
    "case_name": "Deepak Trading Corporation v. State",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Criminal Appeal No. 107 of 1961",
    "date_of_judgment": "1962-09-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant was carrying on business in the name of Deepak Trading Corporation at Bulakhidas Building, Vithaldas Road, Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On December 27, 1958, the Sub Inspector of Police, accompanied by the Drug Inspector, raided the said building and found large quantities of absorbent cotton wool, roller bandages, gauze and other things.",
      "type": "material",
      "date": "1958-12-27",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "The appellant was not only storing these goods in large quantities but was actually manufacturing them in Bombay and passing them off as though they were manufactured by a firm of repute in Secunderabad.",
      "type": "disputed",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f4",
      "text": "The samples of the aforesaid articles and lint were sent to the Government Analyst, who reported that out of the samples sent to him only the lint was of standard quality and the other articles were not of standard quality.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "The appellant was prosecuted before the Presidency Magistrate, 16th Court Bombay, for an offence under s. 18 of the Act, inter alia, for manufacturing drugs which were not of standard quality.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "The learned Presidency Magistrate acquitted the appellant on the ground that the prosecution had failed to prove that the articles were in the possession of the appellant.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The High Court on a review of the evidence came to a different conclusion and found that the said articles were not only found in the possession of the appellant but also were manufactured by him and that they were below the standard prescribed.",
      "type": "procedural",
      "date": "1961-06-16",
      "source": "high_court"
    },
    {
      "id": "f8",
      "text": "On the finding, it convicted the appellant and sentenced him to undergo rigorous imprisonment for three months and to pay a fine of Rs. 500/- under each count.",
      "type": "procedural",
      "date": "1961-06-16",
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the said articles (absorbent cotton wool, roller bandages, gauze) are drugs within the meaning of s.3(b) of the Drugs Act, 1940, as amended by the Drugs Amendment Act, 1955.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The said articles had not been proved to be below the prescribed standard.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The said articles are not drugs within the meaning of s.3(b) of the Act.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "s.3(b) Drugs Act, 1940"
    },
    {
      "id": "pa3",
      "text": "Sought to rely upon a report of a high powered committee consisting of expert doctors, who expressed the opinion that surgical dressings did not come under the purview of the Drugs Act.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Surgical instruments would not fall within the definition and that gauze and lint would fall within the same class.",
      "supporting_facts": [],
      "legal_basis": "s.3(b) Drugs Act, 1940"
    },
    {
      "id": "pa5",
      "text": "An impassioned appeal was made for reducing the sentences imposed upon the appellant.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The articles were found in possession of appellant, manufactured by him, below standard, and are drugs under s.3(b).",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f7"
      ],
      "legal_basis": "s.3(b), s.18 Drugs Act, 1940"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The said definition of drug is comprehensive enough to take in not only medicines but also substances intended to be used for or in the treatment of diseases of human beings or animals.",
      "addresses_issue": "i1",
      "key_observation": "Expression 'substances' must be something other than medicines but which are used for treatment."
    },
    {
      "id": "cr2",
      "text": "Absorbent cotton wool, roller bandages and gauze are substances within the meaning of the said expression.",
      "addresses_issue": "i1",
      "key_observation": "The said articles are sterilized or otherwise treated to make them disinfectant and then used for surgical dressing; they are essential materials for treatment in surgical cases."
    },
    {
      "id": "cr3",
      "text": "The Legislature designedly extended the definition of drug so as to take in substances which are necessary aids for treating surgical or other cases. The main object of the Act is to prevent substandard drugs.",
      "addresses_issue": "i1",
      "key_observation": "That would certainly be defeated if the necessary concomitants of medical or surgical treatment were allowed to be diluted."
    },
    {
      "id": "cr4",
      "text": "It is not necessary to define exhaustively the substances falling within the definition of drugs; whether or not surgical instruments are drugs, the articles concerned in this case are.",
      "addresses_issue": "i1",
      "key_observation": "Opinion of the medical experts would not help in construing a statutory provision."
    },
    {
      "id": "cr5",
      "text": "This was a gross case where large quantities of spurious drugs had been manufactured by the appellant and passed off as goods manufactured by a firm of repute. The appellant was guilty of an anti-social act of a very serious nature.",
      "addresses_issue": null,
      "key_observation": "The punishment of rigorous imprisonment for three months was more lenient than severe. There is no case for interference with the sentences."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The said articles are substances used for or in the treatment within the meaning of s.3(b) of the Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Conviction and sentence upheld; no interference.",
      "resolves_issue": null,
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Drugs Act, 1940 (as amended by Drugs Amendment Act, 1955)",
      "sections": [
        "s.3(b)",
        "s.18"
      ],
      "relevance": "Definition of 'drug' under s.3(b) includes the articles in question as substances used for or in the treatment; offence of manufacturing substandard drugs under s.18."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the judgment of the Bombay High Court is dismissed. The conviction under s.18 of the Drugs Act and sentence of rigorous imprisonment for three months and fine of Rs.500 under each count are upheld.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'drug includes all medicines for internal or external use of human beings or animals and all substances intended to be used for or in the treatment mitigation or prevention of disease in human beings or animals other than medicines...'",
      "speaker": "court",
      "significance": "Verbatim definition of 'drug' under s.3(b) central to the issue."
    },
    {
      "text": "The said articles are sterilized or otherwise treated to make them disinfectant and then used for surgical dressing they are essential materials for treatment in surgical cases.",
      "speaker": "court",
      "significance": "Explains why articles qualify as 'substances' for treatment."
    },
    {
      "text": "The main object of the Act is to prevent substandard in drugs, presumably for maintaining high standards of medical treatment.",
      "speaker": "court",
      "significance": "States purpose of the Act justifying expansive definition."
    },
    {
      "text": "We, therefore, hold, agreeing with the High Court, that the said articles are substances used for or in the treatment within the meaning of s. 3(b) of the Act.",
      "speaker": "court",
      "significance": "Core holding on the legal issue."
    }
  ],
  "_case_id": "1962_358",
  "_label": 0,
  "_text_length": 6766,
  "_extracted_at": "2026-02-10T20:01:45.736125"
}