{
  "metadata": {
    "case_name": "Appellants v. Respondent",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha C.J.",
      "Subba Rao J.",
      "Ayyangar J.",
      "Mudholkar J."
    ],
    "case_number": "Civil Appeal No. 25 of 1961",
    "date_of_judgment": "1962-03-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent held certain zamindari and agricultural properties in different districts of the State of Uttar Pradesh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On December 22, 1952, the Additional Collector, Banaras, in exercise of the powers conferred on him under the provisions of the U. P. Agricultural Income-Tax Act III of 1949, assessed the respondent to an agricultural income-tax of Rs. 99,964-12-0 for the year 1359 fasli.",
      "type": "material",
      "date": "1952-12-22",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On September 30, 1955, the respondent filed a petition before the High Court under Art. 226 of the Constitution for quashing the said order on the ground that the Additional Collector, Banaras, had no jurisdiction to make the said assessment.",
      "type": "procedural",
      "date": "1955-09-30",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "On November 22, 1955, Mehrotra J., allowed the writ petition quashing the said assessment. The State of Uttar Pradesh did not prefer an appeal against the said order and allowed it to become final.",
      "type": "procedural",
      "date": "1955-11-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On February 9, 1956, the State of Uttar Pradesh promulgated an Ordinance, being Ordinance No. 11 of 1956, which was subsequently replaced by U. P. Act No. XIV of 1956. Under the provisions of the Ordinance, the assessments made by the Additional Collector were retrospectively validated and, under s.6 thereof, a right was conferred upon any party to the proceedings under the U.P. Agricultural Income-tax Act, 1948, to apply within 90 days for a review of the said proceedings wherein any assessment made by an Additional Collector was set aside merely on the ground that the assessing authority had no jurisdiction to make the assessment.",
      "type": "material",
      "date": "1956-02-09",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Pursuant to the provisions of s.6 of the said Ordinance, on March 14, 1956, the appellants filed an application in the High Court at Allahabad for review of its order dated November 22, 1955.",
      "type": "procedural",
      "date": "1956-03-14",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The said application was heard by Mehrotra, J., who held that s. 11 of the Act, which corresponds to s.6 of the Ordinance, did not entitle the appellant to file an application for review of an order made by the High Court under Art. 226 of the Constitution. The appellants' petition was dismissed on that ground.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The appellants preferred an appeal against the said order to a division Bench of that court. Nootham, C.J., and Srivastava, J., who heard the appeal, dismissed it on two grounds: (1) under Ch. VIII r.5 of the Rules of Court, a special appeal against an order of a single Judge of the court can be maintained only if that order amounts to a Judgment, and an order refusing an application for review not being a Judgment cannot be the subject of an appeal; (2) on merits, that is on the construction of s. 11 of the Act, the view taken by Mehrotra, J. was correct.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The present appeal by special leave is directed against the judgment and order of a division Bench of the Allahabad High Court confirming those of a single Judge of that court dismissing the application filed by the appellant to review the order of the High Court dated November 22, 1955.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order of Mehrotra, J., dismissing the application for review of his earlier order is a 'Judgment' within the meaning of Ch. VIII r. 5 of the Rules of Court and cl.10 of the Letters Patent for the High Court of Allahabad, and therefore an appeal lies against that order to a division Bench of that court.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the terms of s. 11 of the U.P. Act XIV of 1956 are comprehensive enough to take in an order made by the High Court under Art. 226 of the Constitution quashing the order of assessment and even if there is some lacuna, the provisions shall be so construed as to carry out clear intention of the Legislature.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the application for review filed by the appellants could be treated as one filed under Order 47 of the Code of Civil Procedure, and the earlier order reviewed on the ground that there is an error apparent on the face of the record.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order of Mehrotra, J., dismissing the application for review of his earlier order is a 'Judgment' within the meaning of Ch. VIII r. 5 of the Rules of Court and, therefore, an appeal lies against that order to a division Bench of that court.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Ch. VIII r.5 of the Rules of Court; cl.10 of Letters Patent"
    },
    {
      "id": "pa2",
      "text": "The terms of s. 11 of the Act are comprehensive enough to take in an order made by the High Court under Art. 226 of the Constitution quashing the order of assessment and even if there is some lacuna, the provisions shall be so construed as to carry out clear intention of the Legislature.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "s.11 U.P. Act XIV of 1956; Maxwell on Interpretation of Statutes p.68; Crawford on Statutory Construction p.492"
    },
    {
      "id": "pa3",
      "text": "In any view, the application for review filed by the appellants could be treated as one filed under Order 47 of the Code of Civil Procedure, and the earlier order reviewed on the ground that there is an error apparent on the face of the record.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Order 47 Code of Civil Procedure"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The appellants had no right under s.11 of the Act to file an application for review of an order made by the High Court under Art. 226 of the Constitution.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s.11 U.P. Act XIV of 1956"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The order of Mehrotra, J., dismissing the application for review is a judgment within the meaning of cl.10 of the Letters Patent as well as Ch.VIII r.5 of the Rules of Court, as it determines rights of parties under the amending Act, denying the appellants' statutory right to have the earlier order reviewed.",
      "addresses_issue": "i1",
      "key_observation": "A valuable and substantive right conferred upon a party to the proceeding; decision thereon decides rights of parties."
    },
    {
      "id": "cr2",
      "text": "s.11 does not apply to an order made by the High Court under Art.226, as a petition under Art.226 is not a proceeding under the Principal Act (U.P. Agricultural Income-tax Act, 1948); it is a proceeding under the Constitution in exercise of original jurisdiction.",
      "addresses_issue": "i2",
      "key_observation": "Plain reading of words; cannot rewrite section; Art.226 proceedings not continuation of proceedings under the Act."
    },
    {
      "id": "cr3",
      "text": "Second part of s.11 would conflict with Art.226 if applied to High Court orders, as it imposes mandatory duty contrary to discretionary power under Art.226; construction confining to courts/authorities other than under Art.226 saves section from constitutional invalidity.",
      "addresses_issue": "i2",
      "key_observation": "No state law can derogate from High Court's powers under Art.226."
    },
    {
      "id": "cr4",
      "text": "Cannot treat application as under O47 CPC at this late stage: not pleaded earlier, raises controversial questions like limitation, applicability to Art.226 orders, etc.",
      "addresses_issue": "i3",
      "key_observation": "Highly belated attempt; not justified."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The order of Mehrotra J dismissing the review application is a 'judgment' appealable to division bench; division bench erred on maintainability.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "s.11 of U.P. Act XIV of 1956 does not apply to orders made by High Court under Art.226 of the Constitution.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Application cannot be converted to one under Order 47 CPC at this stage.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Justices of the Peace for Calcutta v. The Oriental Gas Co.",
      "citation": "1872 8 Beng. L.R. 433",
      "treatment": "followed",
      "relevance": "Defines 'judgment' in cl.15 Letters Patent as decision affecting merits by determining some right or liability."
    },
    {
      "case_name": "Hadjee Ismael v. Hadjee Mahommed",
      "citation": "1874 13 Beng. L.R. 91",
      "treatment": "referred",
      "relevance": "Appeal lies from order refusing to set aside leave to sue under cl.12 Letters Patent."
    },
    {
      "case_name": "Tuljaram v. Alagappa",
      "citation": "I.L.R. 35 Mad. 1",
      "treatment": "followed",
      "relevance": "Test for 'judgment': effect in suit/proceeding; if puts end to proceeding."
    },
    {
      "case_name": "Muhammad Naim-Ullah Khan v. Ihsan-Ullah Khan",
      "citation": "I.L.R. 14 All. 226",
      "treatment": "referred",
      "relevance": "Order not appealable under O.43 r.1 CPC not appealable under cl.10 Letters Patent."
    },
    {
      "case_name": "Manohar v. Baliram",
      "citation": "I.L.R. 1952 Nag. 471",
      "treatment": "referred",
      "relevance": "Definition of judgment: decides controversy conclusively so far as court concerned."
    },
    {
      "case_name": "Venkataratnam v. Secretary of State for India",
      "citation": "1930 I.L.R. 53 Mad. 979",
      "treatment": "followed",
      "relevance": "Writ of certiorari issued in original jurisdiction."
    },
    {
      "case_name": "Ryots of Garabandho v. Zamindar of Parlakimedi",
      "citation": "I.L.R. 1938 Mad. 816",
      "treatment": "followed",
      "relevance": "Writ of certiorari in original jurisdiction."
    },
    {
      "case_name": "Ramayya v. State of Madras",
      "citation": "A.I.R. 1952 Mad. 300",
      "treatment": "followed",
      "relevance": "Art.226 proceedings exercise original jurisdiction."
    },
    {
      "case_name": "Moulvi Hamid Hassan Nomani v. Banwarilal Roy",
      "citation": "1942 I.L.T. 32",
      "treatment": "followed",
      "relevance": "Issue of writs is matter of original jurisdiction."
    },
    {
      "case_name": "Budge Budge Municipality v. Mangru",
      "citation": "1952 57 C.W.N. 25",
      "treatment": "followed",
      "relevance": "Art.226 jurisdiction is original, special jurisdiction."
    }
  ],
  "statutes_cited": [
    {
      "name": "U.P. Agricultural Income-tax Act, 1948",
      "sections": [
        "Section 2(4)",
        "Section 14",
        "Section 44(2)(c)"
      ],
      "relevance": "Principal Act; assessments under it validated retrospectively by amending Act."
    },
    {
      "name": "U.P. Act No. XIV of 1956",
      "sections": [
        "Section 2",
        "Section 10",
        "Section 11"
      ],
      "relevance": "Amends principal Act retrospectively; validates assessments by Additional Collectors; provides for review of proceedings where assessments set aside for lack of jurisdiction."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 245"
      ],
      "relevance": "High Court power to issue writs in original jurisdiction; state legislature cannot derogate from it."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order 47",
        "Order 43"
      ],
      "relevance": "Review on error apparent; appealability."
    },
    {
      "name": "U.P. Land Revenue Act, 1901",
      "sections": [],
      "relevance": "Definition of Collector includes Additional Collector."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court held that while the single judge's order refusing review was a 'judgment' appealable to the division bench, s.11 of the U.P. Act XIV of 1956 does not apply to Art.226 orders of the High Court, and the review application could not be treated as under O.47 CPC. The appeal was dismissed confirming the High Court's order.",
    "relief_granted": null,
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "'Judgment' in clause 15 means a decision which affects the merits of the question between the parties by determining some right or liability.",
      "speaker": "court",
      "significance": "Adopted definition from Couch CJ to determine appealability."
    },
    {
      "text": "The test seems to me to be not what is the form of the adjudication, but what is its effect in the suit or proceeding in which it is made.",
      "speaker": "court",
      "significance": "White CJ test for 'judgment' under Letters Patent."
    },
    {
      "text": "A petition under Art. 226 of the Constitution cannot be a proceeding under the Act; it is a proceeding under the Constitution.",
      "speaker": "court",
      "significance": "Core reasoning why s.11 does not apply."
    },
    {
      "text": "No law made by the Legislature of a State can be in derogation of the powers of the High Court under Art. 226 of the Constitution.",
      "speaker": "court",
      "significance": "Constitutional bar to applying s.11's mandatory injunction to High Court."
    }
  ],
  "_case_id": "1962_244",
  "_label": 0,
  "_text_length": 32320,
  "_extracted_at": "2026-02-10T20:00:25.425830"
}