{
  "metadata": {
    "case_name": "Union of India v. Delhi Cloth & General Mills Co. Ltd. & Ors.",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Civil Appeals Nos. 168-170 of 1960",
    "date_of_judgment": "1962-10-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Three companies manufacturing Vanaspati filed writ petitions under Art 226 challenging imposition of excise duty on manufacture of refined oil from raw oil under item 23 of First Schedule to Central Excises and Salt Act 1944.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Petitioners purchase groundnut and til oil from open market or manufacturers, subject them to processes to manufacture Vanaspati, the only finished product liable to excise duty as vegetable product.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "No intermediate product produced that falls within item 23 as vegetable non-essential oils; demand for duty illegal.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "In course of Vanaspati manufacture from raw groundnut/til oil, petitioners produce refined oil after processes with aid of power, which falls within item 23 and is liable to duty.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Affidavit of P.S. Krishnan, Chief Chemist: Raw oils contain impurities (mucilaginous matter, free fatty acids, moisture); refining before hydrogenation: add alkali to form soap and remove impurities, settle, draw supernatant, treat with bleaching earth/carbon, filter; results in refined oil suitable for hydrogenation, marketable, sometimes further deodorized; uses power.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Refined oil colourless/slightly coloured, clear, no odour; raw oil turbid, coloured; marketed separately e.g., groundnut oil vs refined groundnut oil.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Experts for petitioners agree impurities removed before hydrogenation but refined oil for edible purposes includes neutralization, bleaching, and deodorisation; without deodorisation, not refined oil due to odours.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Dr. Homi Ruttonji Nanji affidavit: Refined oil per manufacturers/trade includes all three processes; ISI specification for refined groundnut oil: neutralised with alkali, bleached with fullers earth/activated carbon, deodorised with steam.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Affidavits from marketers of branded refined oils (Falika, Tripti etc.): Always deodorised before marketing as refined oil.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Deodorisation applied after hydrogenation in petitioners' factories.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Punjab High Court allowed writs, held no liability under item 23 (now 12), directed withdrawal of demands.",
      "type": "procedural",
      "date": "1958-10-10",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether intermediate product after refining raw oil but before deodorisation and hydrogenation is 'refined vegetable non-essential oil' as known to the market, liable to excise duty under item 23 of First Schedule to Central Excises and Salt Act 1944.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether processes of neutralisation and bleaching on raw oil amount to 'manufacture' of excisable goods, or mere processing.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Petitioners (companies, respondents in SC) produce refined oil known to market at intermediate stage before Vanaspati using power-driven processes; this is liable under item 23 even if not sold, as duty on manufacture not sale; further processing to Vanaspati (liable under item 13) does not exempt.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Item 23 First Schedule, Central Excises and Salt Act 1944"
    },
    {
      "id": "pa2",
      "text": "Even without deodorisation, after neutralisation/bleaching, it is non-essential vegetable oil of some sort; manufacture complete upon change via processes.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Item 23 ('all sorts'), s.2(f) definition of manufacture"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No intermediate refined oil produced; only Vanaspati as finished product; refined oil per trade/ISI requires deodorisation, applied after hydrogenation or not at all in their process before Vanaspati.",
      "supporting_facts": [
        "f2",
        "f7",
        "f8",
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Processing impurities removal not 'manufacture'; manufacture requires new substance known to market.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No evidence appellants produced even one case of non-deodorised refined oil marketed; ISI specification and trade affidavits confirm deodorisation essential for refined oil; books cited vague, not specific to Indian market/groundnut oil.",
      "addresses_issue": "i1",
      "key_observation": "Without deodorisation, substance not refined oil as known to consumers/commercial community."
    },
    {
      "id": "cr2",
      "text": "Manufacture implies transformation into new article with distinctive name/character/use known to market; mere change/processing insufficient; goods must be marketable.",
      "addresses_issue": "i2",
      "key_observation": "Excise on manufacture of goods, i.e., new substance known to market."
    },
    {
      "id": "cr3",
      "text": "S.2(f) definition includes incidental processes to clarify item wording ('in or in relation to manufacture... with aid of power'), not to equate processing to manufacture liable to duty.",
      "addresses_issue": "i2",
      "key_observation": "'All sorts' covers raw/refined but requires manufacture of market-known goods."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No manufacture of refined vegetable non-essential oil at intermediate stage; raw oil does not become refined oil known to market before Vanaspati.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Processing short of producing new marketable substance not 'manufacture' for excise; s.2(f) limited to incidental processes.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Central Excises and Salt Act, 1944",
      "sections": [
        "Item 23 First Schedule (now Item 12)",
        "Item 13 First Schedule (formerly 11)",
        "S. 2(f)"
      ],
      "relevance": "Excise duty on manufacture of vegetable non-essential oils all sorts where process with power used; definition of manufacture includes incidental processes."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for writ petitions challenging excise demands."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court, held no excise liability on intermediate product as not refined oil known to market; directed authorities to withdraw demands.",
    "relief_granted": "Writs allowed; excise demands quashed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'Manufacture implies a change, but every change is not manufacture... there must be transformation; a new and different article must emerge having a distinctive name, character or use.'",
      "speaker": "court",
      "significance": "Defines 'manufacture' for excise purposes."
    },
    {
      "text": "Refined groundnut oil - Groundnut oil which has been refined by neutralisation with alkali, bleached with fullers earth and/or Activated Carbon, and deodorised with steam.",
      "speaker": "court",
      "significance": "ISI specification confirms deodorisation essential for refined oil."
    },
    {
      "text": "The sole purpose of inserting this definition [s.2(f)] is to make it clear that... the word manufacture has been used to mean a process incidental to the manufacture of the article.",
      "speaker": "court",
      "significance": "Limits scope of 'manufacture' definition."
    }
  ],
  "_case_id": "1962_155",
  "_label": 0,
  "_text_length": 20673,
  "_extracted_at": "2026-02-10T19:58:34.297070"
}