{
  "metadata": {
    "case_name": "Members of Gujarat and Kathiawar Presbyterian Joint Board (United Church of Northern India) v. State of Bombay",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "SHAH, J."
    ],
    "case_number": "Writ Petition No. 76 of 1957",
    "date_of_judgment": "1962-08-30"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioners profess the Christian faith and belong to the United Church of Northern India. They are members of the Gujarat and Kathiawar Presbyterian Joint Board (society) which conducts 42 primary schools and Mary Brown Memorial Training College at Borsad, District Kaira.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Teachers trained in the college are absorbed in the society's primary schools and other Christian Mission Schools conducted by the United Church of Northern India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Cost of maintaining the college and primary schools met out of donations from Irish Presbyterian Mission, fees from scholars, and grant-in-aid under the Education Code of the State Government.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Primary schools and college conducted for benefit of religious denomination of United Church of Northern India and Indian Christians generally, though admission not denied to other communities.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Training course in college is of two years duration; originally 25 students in First Year and 25 in Second Year.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Till 1952, surplus accommodation available after admitting students for society's primary schools.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "College recognised by Government of Bombay for training students for examination held by Education Department for certificates for trained teachers.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In each District of State of Bombay, District School Board or Municipal School Board maintains primary education.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "State maintains Training Colleges to provide trained teachers for School Boards.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "November 1952: Government of Bombay ordered all private Training Colleges to reserve 60% seats for School Board teachers nominated by Government.",
      "type": "material",
      "date": "1952-11",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Society protested; negotiations led to agreement to admit 20 students yearly (10 in each class). June 1953: 10 students nominated. June 1954: another 10.",
      "type": "material",
      "date": "1953-06 to 1954-06",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "May 28, 1955: Government order for 80% seats reserved in non-Government Training Colleges for District/Municipal School Board teachers from 1955-56. Recited 40,000 untrained primary teachers needing training.",
      "type": "material",
      "date": "1955-05-28",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "June 13, 1955: Educational Inspector, Kaira District informed Principal to reserve 80% seats for School Board teachers; no private students beyond 20% without permission.",
      "type": "material",
      "date": "1955-06-13",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "June 15, 1955: Principal expressed inability to comply.",
      "type": "material",
      "date": "1955-06-15",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Correspondence ensued; Department insisted on 80% reservation and no fresh admissions.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "December 27, 1955: Educational Inspector warned management for irregularity, no grant unless 80% reserved from 1956-57, maintain one division II Year 1956-57, no fresh I Year without permission, threat of withdrawal of recognition.",
      "type": "material",
      "date": "1955-12-27",
      "source": "respondent"
    },
    {
      "id": "f17",
      "text": "February 10, 1956: Society submitted memorial to Minister for Education protesting threats.",
      "type": "procedural",
      "date": "1956-02-10",
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "March 12, 1956: Informed grant withheld for refusal to reserve seats.",
      "type": "material",
      "date": "1956-03-12",
      "source": "respondent"
    },
    {
      "id": "f19",
      "text": "March 22, 1956: Society requested permission to fill 12 places each year, reserve remaining 60%.",
      "type": "procedural",
      "date": "1956-03-22",
      "source": "petitioner"
    },
    {
      "id": "f20",
      "text": "March 29, 1956: Educational Inspector: no private candidates to I Year without permission; provisional grant Rs. 8,000 on condition of 80% reservation from 1956-57 and hostel.",
      "type": "material",
      "date": "1956-03-29",
      "source": "respondent"
    },
    {
      "id": "f21",
      "text": "April 18, 1956: 80% seats for I Year School Board teachers, continue to II Year, hostel, observe festivals of all religions, common place for prayers.",
      "type": "material",
      "date": "1956-04-18",
      "source": "respondent"
    },
    {
      "id": "f22",
      "text": "May 9, 1956: No deputations made for 1956-57, no grant, for failure to assure compliance.",
      "type": "material",
      "date": "1956-05-09",
      "source": "respondent"
    },
    {
      "id": "f23",
      "text": "June 9, 1956: Admit up to 80% School Board teachers or withdraw recognition under Rule 11.",
      "type": "material",
      "date": "1956-06-09",
      "source": "respondent"
    },
    {
      "id": "f24",
      "text": "Rules: Rule 5(2) Primary Training Colleges: Govt fixes % seats for Board teachers. Rules 11,12,14 for recognition of Private Primary Training Institutions: open to all, reserve seats for Board teachers, representation to Backward classes, women provisions, withdrawal for non-compliance.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f25",
      "text": "Petitioners moved Supreme Court for writ of mandamus directing State and Director not to compel reservation of 80% or any seats, not to compel compliance with Rules 5(2),11,12,14, not to withdraw recognition or withhold grant.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f26",
      "text": "Government makes annual grant of Rs. 8,000 under Education Code (administrative directions). Recognition needed for students to appear at govt exams.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f27",
      "text": "College non-profit, depends on donations and grant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f28",
      "text": "Affidavit of Dr. D.V. Chickermane: 8,900 primary schools, 40,000 untrained teachers; need to train 2,000/year, depute 1,600 to private colleges requiring 80% reservation.",
      "type": "disputed",
      "date": "1955",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the government orders reserving 80% seats for School Board teachers, threats to withhold grant and withdraw recognition infringe Articles 19(1)(f), 19(1)(g), 26(a),(b),(c),(d), and 30(1) of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the State can impose conditions of 80% seat reservation in minority-run aided and recognised training college in public interest without violating Art. 30(1).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Fundamental rights under Arts. 30(1), 26(a),(b),(c),(d), 19(1)(f),(g) violated by letters/orders dated May 28, 1955, Dec 27, 1955, March 29, 1956 threatening withholding grant and withdrawal of recognition.",
      "supporting_facts": [
        "f12",
        "f16",
        "f20"
      ],
      "legal_basis": "Articles 19(1)(f),(g), 26(a)-(d), 30(1); Commissioner Hindu Religious Endowments v. Sri Lakshmindra (1954 SCR 1005)"
    },
    {
      "id": "pa2",
      "text": "Interference with management amounts to infringement of property rights under Art. 19(1)(f).",
      "supporting_facts": [
        "f1",
        "f2",
        "f26"
      ],
      "legal_basis": "Art. 19(1)(f)"
    },
    {
      "id": "pa3",
      "text": "Regulations cannot be in interest of outsiders but only for efficiency of the institution.",
      "supporting_facts": [
        "f28"
      ],
      "legal_basis": "Art. 30(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Right under Art. 30(1) subject to regulations in national/public interest if not destructive of minority character; conditions for grant/recognition valid.",
      "supporting_facts": [
        "f28",
        "f10",
        "f12",
        "f24"
      ],
      "legal_basis": "Kerala Education Bill case (1959 SCR 995); Rules 5(2), 11,14"
    },
    {
      "id": "ra2",
      "text": "State not bound to grant aid or recognition; can impose conditions on admissions for public need of trained teachers.",
      "supporting_facts": [
        "f8",
        "f9",
        "f28"
      ],
      "legal_basis": "Art. 30(1),(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Art. 19(1)(f) not infringed as no deprivation of property; mere management interference not property right. Distinguished Sri Lakshmindra and Dwarka Nath cases.",
      "addresses_issue": "i1",
      "key_observation": "Interference with right of bare management does not amount to infringement of right to property under Art. 19(1)(f)."
    },
    {
      "id": "cr2",
      "text": "Art. 19(1)(g) not infringed; running educational institution not 'profession, occupation, trade or business'.",
      "addresses_issue": "i1",
      "key_observation": "No infringement of Art. 19(1)(g)."
    },
    {
      "id": "cr3",
      "text": "No opinion needed on Art. 26 in view of Art. 30(1) decision.",
      "addresses_issue": "i1",
      "key_observation": "Art. 26 protects religious affairs management."
    },
    {
      "id": "cr4",
      "text": "Rules/orders make serious inroads on administration right under Art. 30(1): restrict student choice, enforce via grant/recognition threats.",
      "addresses_issue": "i2",
      "key_observation": "Art. 30(1) absolute, not subject to reasonable restrictions like Art. 19."
    },
    {
      "id": "cr5",
      "text": "State can impose regulations for efficiency, discipline etc., but must be in interests of institution's educational character, not outsiders/public generally. Dual test: reasonableness and conducive to educational character.",
      "addresses_issue": "i2",
      "key_observation": "Regulations conceived in interests of college, not public."
    },
    {
      "id": "cr6",
      "text": "Kerala Education Bill not authority for all non-destructive public interest regulations; no general test laid down there.",
      "addresses_issue": "i2",
      "key_observation": "Right under Art. 30(1) real, not to be whittled down by public interest measures destroying administration power."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rule 5(2) of Rules for Primary Training Colleges, Rules 11 and 14 for recognition of Private Primary Training Institutions, insofar as they authorise reservation of seats for government nominees, and directions for 80% reservation, infringe Art. 30(1).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Petitioners entitled to writs quashing compulsion to reserve seats under government orders, subject to deletion of reference to cl.12 of rules.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner, Hindu Religious Endowments, Madras v. Sri Lakshmindra Thirtha Swamiar of Sri Shiru Mutt",
      "citation": "1954 S.C.R. 1005",
      "treatment": "distinguished",
      "relevance": "Mahant has proprietary interest blending office and property; petitioners have no such rights."
    },
    {
      "case_name": "Sri Dwarka Nath Tewari v. State of Bihar",
      "citation": "A.I.R. 1959 S.C. 249",
      "treatment": "distinguished",
      "relevance": "Govt cannot divest trustees of school property by executive order; no such deprivation here."
    },
    {
      "case_name": "Kerala Education Bill case",
      "citation": "1959 S.C.R. 995",
      "treatment": "distinguished",
      "relevance": "State can impose reasonable regulations for aided institutions but not annihilative; not authority for all non-destructive public interest measures."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 19(1)(f)",
        "Article 19(1)(g)",
        "Article 26(a)",
        "Article 26(b)",
        "Article 26(c)",
        "Article 26(d)",
        "Article 30(1)",
        "Article 30(2)",
        "Article 32"
      ],
      "relevance": "Fundamental rights to establish/administer minority institutions absolute under Art. 30(1); no infringement of Arts. 19,26 found."
    },
    {
      "name": "Rules for Primary Training Colleges",
      "sections": [
        "Rule 5(2)"
      ],
      "relevance": "Authorises govt to fix % seats for Board teachers; held infringing Art. 30(1)."
    },
    {
      "name": "Rules for recognition of Private Primary Training Institutions",
      "sections": [
        "Rule 11",
        "Rule 12",
        "Rule 14"
      ],
      "relevance": "Permit seat reservation, withdrawal of recognition/grant for non-compliance; infringing Art. 30(1) insofar as reservations."
    },
    {
      "name": "Education Code of Bombay",
      "sections": [],
      "relevance": "Administrative directions for grants; college receives Rs. 8,000 annually."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Writs issued directing State of Bombay and Director of Education not to compel society to reserve 80% or any seats for government-nominated teachers, not to enforce Rules 5(2),11,14 re reservations, not to withdraw recognition or withhold grant on that ground; prayers (a),(b),(c),(d) granted with deletion of cl.12 reference.",
    "relief_granted": "Writ of mandamus quashing impugned orders and threats re seat reservations.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "If every order which while maintaining the formal character of a minority institution destroys the power of administration is held justifiable because it is in the public or national interest, though not in its interest as an educational institution, the right guaranteed by Art. 30(1) will be but a teasing illusion, a promise of unreality.",
      "speaker": "court",
      "significance": "Core holding on scope of Art. 30(1) protection against public interest regulations."
    },
    {
      "text": "Regulation made in the true interests of efficiency of instruction, discipline, health, sanitation, morality, public order and the like may undoubtedly be imposed. Such regulations are not restrictions on the substance of the right which is guaranteed: they secure the proper functioning of the institution.",
      "speaker": "court",
      "significance": "Defines permissible regulations under Art. 30(1)."
    },
    {
      "text": "All minorities... have by Art. 30(1) an absolute right to establish and administer educational institutions of their choice and any law or executive direction which seeks to infringe the substance of that right under Art. 30(1) would to that extent be void.",
      "speaker": "court",
      "significance": "Emphasises absolute nature of Art. 30(1)."
    }
  ],
  "_case_id": "1962_356",
  "_label": 1,
  "_text_length": 34081,
  "_extracted_at": "2026-02-10T20:02:09.798250"
}