{
  "metadata": {
    "case_name": "East India Commercial Co. Ltd. & Anr. v. Collector of Customs, Calcutta",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar J.",
      "Subba Rao J.",
      "Mudholkar J."
    ],
    "case_number": "Civil Appeal No. 383 of 1960",
    "date_of_judgment": "1962-05-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants brought into India from USA a large quantity of electrical instruments (fluorescent tubes and fixtures) under a licence.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Licence granted on October 8, 1948 to first appellant company for import from USA, stated goods required for modernising lighting system of factory at Ellore, Madras; condition: goods to be utilised only for consumption as raw material or accessories in licence holder's factory and no portion sold to any party.",
      "type": "material",
      "date": "1948-10-08",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Goods cleared from customs end of February 1949.",
      "type": "procedural",
      "date": "1949-02-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Authorities received information that goods were being sold in market in breach of licence condition; police seized large stock from appellants' godown on August 12, 1949 pursuant to search warrant.",
      "type": "disputed",
      "date": "1949-08-12",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Prosecution under s.420 r/w s.120B IPC against company officers including second appellant; discharged by Presidency Magistrate on July 27, 1953 under s.253 CrPC, holding no proof licensing authority deceived.",
      "type": "procedural",
      "date": "1953-07-27",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Prosecution under s.5 Import and Exports Control Act 1947 against second appellant and another; acquitted by trial court, confirmed by Calcutta High Court on March 3, 1955 by Sen J., holding breach of licence condition not offence under s.5 as not breach of order under Act.",
      "type": "procedural",
      "date": "1955-03-03",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "High Court order on January 16, 1953 directing seized goods sold, proceeds Rs.4,15,000 kept with Chief Presidency Magistrate.",
      "type": "procedural",
      "date": "1953-01-16",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Collector of Customs served notice on August 28, 1955 (clarified as May 28, 1955 in Subba Rao J.) to show cause why sale proceeds not confiscated under s.167(8) Sea Customs Act r/w s.3(2) Import Control Act and penalty imposed; alleged import illegal as licence obtained by fraudulent misrepresentation and goods sold in breach of condition.",
      "type": "material",
      "date": "1955-05-28",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Appellants filed petition under Art.226 Constitution before Calcutta High Court for writ of prohibition; dismissed by Sinha J., appeal dismissed by Division Bench on January 5, 1959.",
      "type": "procedural",
      "date": "1959-01-05",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Collector of Customs has jurisdiction under s.167(8) Sea Customs Act r/w s.3(2) Import and Exports Control Act 1947 to confiscate goods (or sale proceeds) for breach of condition in licence issued under order prohibiting/restricting import, or only for import contrary to prohibition/restriction itself.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether breach of licence condition amounts to breach of order under s.3(1) Import Control Act.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether prior decision of Calcutta High Court binding on Collector as inferior tribunal.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether sale proceeds of seized goods can be confiscated instead of goods.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Collector has jurisdiction only to decide if goods imported contrary to prohibition/restriction under s.3(1) Import Act, not breach of licence condition post-import.",
      "supporting_facts": [
        "f2",
        "f8"
      ],
      "legal_basis": "s.167(8) Sea Customs Act; s.3 Import Control Act"
    },
    {
      "id": "pa2",
      "text": "Breach of licence condition not breach of order under Act; prior Calcutta HC decision in Criminal Revision No.1124/1953 (Sen J.) binding on Collector.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.5 Import Control Act; Art.227 Constitution"
    },
    {
      "id": "pa3",
      "text": "Licence validly obtained and subsisting at import; post-import breach or misrepresentation does not render import without licence.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5"
      ],
      "legal_basis": "s.167(8) Sea Customs Act"
    },
    {
      "id": "pa4",
      "text": "Sale proceeds not 'goods' liable to confiscation under s.167(8).",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s.167(8) Sea Customs Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Collector has jurisdiction to inquire if import contrary to restrictions; breach of licence condition is breach of order.",
      "supporting_facts": [
        "f2",
        "f4",
        "f8"
      ],
      "legal_basis": "s.167(8) Sea Customs Act r/w s.3(2) Import Act; Notification No.2-ITC/48"
    },
    {
      "id": "ra2",
      "text": "Notice not statutory but intimation; jurisdiction determined on full inquiry; prior criminal court findings not binding on customs authorities.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Principles of natural justice"
    },
    {
      "id": "ra3",
      "text": "Licence obtained by fraudulent misrepresentation renders import without valid licence; goods sold in breach.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s.167(8) Sea Customs Act"
    },
    {
      "id": "ra4",
      "text": "Sale proceeds represent goods, liable to confiscation as goods deteriorating and sold per court order.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s.167(8) Sea Customs Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sarkar J.: Collector has jurisdiction to decide if breach of licence condition is breach of order; such breach is breach of order itself as conditions regulate post-import use; supported by precedents; sale proceeds confiscable.",
      "addresses_issue": "i1",
      "key_observation": "Breach of condition in licence issued under s.3 order is breach of the order; jurisdiction not ousted by defences."
    },
    {
      "id": "cr2",
      "text": "Subba Rao J. (for self and Mudholkar J.): Writ of prohibition maintainable if notice shows no jurisdiction; breach of licence condition not breach of s.3 order; Notifications 23-ITC/43 and 2-ITC/48 do not impose such condition as order; public notices not statutory orders; prior HC binding on inferior tribunals; licence not cancelled, import valid; sale proceeds represent goods.",
      "addresses_issue": "i1",
      "key_observation": "s.167(8) applies only to contravention of order under s.3(1), not licence condition; Calcutta HC law binding under Art.227."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Breach of condition in import licence issued under s.3 Import Control Act is not contravention of the order itself, hence no jurisdiction under s.167(8) Sea Customs Act for confiscation.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Law declared by High Court binding on tribunals under its superintendence (Art.227).",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Sale proceeds of court-ordered sale of deteriorating goods represent the goods and are confiscable if goods were.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Willingale v. Norris",
      "citation": "1909 1 K.B. 57",
      "treatment": "followed",
      "relevance": "Breach of regulation under statute is breach of statute itself."
    },
    {
      "case_name": "Wicks v. Director of Public Prosecutions",
      "citation": "1947 A.C. 362",
      "treatment": "followed",
      "relevance": "Valid regulation under Act regarded as enactment itself."
    },
    {
      "case_name": "Emperor Abdul Hamid",
      "citation": "A.I.R. 1923 Pat. 1",
      "treatment": "followed",
      "relevance": "Notification under statute is part of law."
    }
  ],
  "statutes_cited": [
    {
      "name": "Sea Customs Act, 1878",
      "sections": [
        "s.19",
        "s.167(8)",
        "s.182"
      ],
      "relevance": "Prohibits/restricts import; provides for confiscation and penalty for contravention; Collector authorised to adjudicate."
    },
    {
      "name": "Imports and Exports (Control) Act, 1947",
      "sections": [
        "s.3(1)",
        "s.3(2)",
        "s.5"
      ],
      "relevance": "Central Govt. power to prohibit/restrict import by order; goods deemed prohibited under Sea Customs Act; penalty for contravention of order."
    },
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "s.420",
        "s.120B"
      ],
      "relevance": "Prosecution for cheating and conspiracy in obtaining licence."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "s.253"
      ],
      "relevance": "Discharge of accused."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.226",
        "Art.227",
        "Art.215"
      ],
      "relevance": "Writ of prohibition; High Court superintendence over tribunals; court of record."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed with costs per majority (Subba Rao J. and Mudholkar J.); order of Calcutta High Court set aside; writ of prohibition issued restraining Collector of Customs from proceeding with inquiry under s.167(8) Sea Customs Act.",
    "relief_granted": "Writ of prohibition against customs proceedings.",
    "costs": "Costs awarded to appellants."
  },
  "key_quotes": [
    {
      "text": "\"To break the regulations made under the authority of a statute is to break the statute itself.\"",
      "speaker": "court",
      "significance": "Sarkar J. citing Willingale v. Norris on treating licence conditions as part of order."
    },
    {
      "text": "The law declared by the highest court in the State is binding on authorities or tribunals under its superintendence, and they cannot ignore it.",
      "speaker": "court",
      "significance": "Subba Rao J. holding prior Calcutta HC decision binding on Collector."
    },
    {
      "text": "All goods to which any order under sub-section (1) applies shall be deemed to be goods of which the import or export has been prohibited or restricted under s.19 of the Sea Customs Act.",
      "speaker": "court",
      "significance": "Quoting s.3(2) Import Act, key to deeming provision for jurisdiction."
    }
  ],
  "_case_id": "1962_436",
  "_label": 1,
  "_text_length": 63435,
  "_extracted_at": "2026-02-10T20:03:16.442833"
}