{
  "metadata": {
    "case_name": "Civil Appeals Nos. 494 and 495 of 1957",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeals Nos. 494 and 495 of 1957",
    "date_of_judgment": "1962-08-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant took a lease of the Parlakimedi Samasthanam Rice and Oil Mill for three years from 1941 to 1944 under a registered lease-deed on the 9th December, 1940. The rent agreed to be paid was Rs. 7,000 per annum.",
      "type": "background",
      "date": "1940-12-09",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For the working of the Mill, the appellant took six partners with him and their shares in the partnership were duly determined. The partnership carried on the work of milling rice and extracting oil from ground-nuts.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellant also carried on another business in paddy and ground-nuts and in this business too he took as his partners four out of his six partners in the business of milling rice and extracting oil from ground-nuts. Amongst these partners was respondent No. IV. Gurumurty Raju.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "This latter business was carried on for about 14 months until the end of March, 1942. Two of the partners then retired from the said business and took away their shares in the Capital and the profits.",
      "type": "background",
      "date": "1942-03-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The remaining three partners continued the business of the firm: the appellant had As.0.7.3 share, respondent No. 2 had 0.6.9 share and respondent No. 1 along with respondent No. 4 had 0.2.0 share. Thus, the partnership, in fact, consisted of five partners respondents 1 and 4 being together entitled to a share of As. 0.2.0.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The business of the partnership thus carried on by these partners went on till the 15th September, 1942. Respondent No. 1 then demanded that the accounts should be made and the profits divided between the partners.",
      "type": "material",
      "date": "1942-09-15",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "As a result of this demand, the partnership was stopped, accounts were made and profits divided. The appellant and respondent No. 2 took away their respective amounts, but respondent No. 1 claimed for himself alone the amount due to him and respondent No. 4, whereas respondent No. 4 demanded that the said amount should be divided half and half between him and respondent No. 1.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent No. 1 proceeded to file a criminal complaint in the Court of the Joint Magistrate at Berhampur against six persons, including the appellant. In this complaint he alleged that the six accused persons had committed offences under ss. 420, 465, 468 and 477 read with s. 107 and 120-B of the Indian Penal Code. The substance of the charge was that the accounts of the partnership had been fraudulently altered with a view to show that respondent No. 4 was entitled to share equally the profits with respondent No. 1.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "In these proceedings, respondent No. 1 obtained an attachment of the account-books of the two businesses carried on by the appellant with his partners. This criminal complaint was numbered as Criminal Case No. 139 of 1943, and after process was issued on it and some preliminary steps had been taken, it stood adjourned for hearing to December 30, 1943.",
      "type": "procedural",
      "date": "1943-12-30",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On December 30, 1943, respondent No. 1 and the accused persons entered into an agreement (Exbt. 1) as a result of which the dispute between the appellant and others and respondent No. 1 was agreed to be referred to the arbitration of Mr. Murty on the respondent No. 1 agreeing to withdraw his criminal complaint.",
      "type": "material",
      "date": "1943-12-30",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Accordingly, when the criminal case was called out for hearing on that date, respondent No. 1 stated that he had no evidence to support his case and so, the complaint was dismissed and the arbitration paper signed by the parties was handed over to the arbitrator, Mr. Murty.",
      "type": "procedural",
      "date": "1943-12-30",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The arbitrator then began his proceedings and after recording evidence, he pronounced his award ex-parte on September 14, 1946.",
      "type": "procedural",
      "date": "1946-09-14",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "During the pendency of the said arbitration proceedings, the appellant had applied to the Subordinate Judge at Berhampur for removing the arbitrator on the ground of his misconduct under ss. 5 and 11 of the Arbitration Act (M.J.C. No. 34 of 1944). The said application was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The appellant then preferred a Revision Application against the order of the trial Judge (Revision Petition No. C.R. 78 of 1946), but the said petition was also dismissed on March 26, 1949.",
      "type": "procedural",
      "date": "1949-03-26",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Pending the disposal of the said Revision Petition, the award was pronounced on September 14, 1946.",
      "type": "procedural",
      "date": "1946-09-14",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "After the award was thus pronounced, respondent No. 1 made an application to the Subordinate Judge at Berhampur on December 10, 1946 (M.J.C. No. 105 of 1946) under ss. 14 and 30 of the Arbitration Act for the filing of the award and for passing a decree in terms thereof.",
      "type": "procedural",
      "date": "1946-12-10",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The appellant filed an application on January 14, 1947, in the same Court under s. 33 of the Arbitration Act for setting aside the award (J.C. No. 8 of 1947).",
      "type": "procedural",
      "date": "1947-01-14",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Both the trial Court and the High Court of Orissa have answered the question of validity of the Muchalika Agreement in the negative.",
      "type": "procedural",
      "date": "1954-03-05",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "The appellant has come to this Court with a certificate granted by the High Court under Art. 133 of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Muchalika Agreement of Reference which was executed by the appellant and the four respondents in favour of Tanguda Narasimhamurty on the 30th of December, 1943, is invalid because its consideration was opposed to public policy under s. 23 of the Indian Contract Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The arbitration agreement is invalid under s. 23 of the Indian Contract Act because its consideration was the withdrawal and non-prosecution of the criminal complaint filed by respondent No. 1, which involved non-compoundable offences and is opposed to public policy.",
      "supporting_facts": [
        "f8",
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "Section 23 of the Indian Contract Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The agreement was entered into because Mr. Murty offered to settle the disputes between the parties and the parties accepted his advice, not as a consideration for withdrawing the criminal case.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Agreements made by parties for stifling prosecution are not enforced by Courts on the ground that the consideration for such agreements is opposed to public policy. If a person sets the machinery of the Criminal Law into action on the allegation that the opponent has committed a non-compoundable offence and by the use of this coercive criminal process he compels the opponent to enter into an agreement, that agreement would be treated as invalid.",
      "addresses_issue": "i1",
      "key_observation": "Once the machinery of the Criminal Law is set into motion on the allegation that a non-compoundable offence has been committed, it is for the criminal courts alone to deal with that allegation."
    },
    {
      "id": "cr2",
      "text": "The evidence adduced by the appellant is consistent, satisfactory and categorical, whereas the evidence of respondent No. 1 and of the arbitrator is not categorical to the contrary and at best is ambiguous. The circumstances attending the execution of the document and the sequence of events clearly show that the promise of respondent No. 1 to withdraw and not to prosecute the criminal case was a consideration for the arbitration agreement.",
      "addresses_issue": "i1",
      "key_observation": "Clause 5 of the agreement corroborates the appellant's case as it authorised the arbitrator to decide who should bear the costs of the criminal proceedings."
    },
    {
      "id": "cr3",
      "text": "The High Court failed to consider the relevant evidence properly and criticised the appellant erroneously for not raising the point earlier.",
      "addresses_issue": "i1",
      "key_observation": "The evidence clearly supports the appellant's case."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The arbitration agreement executed by the parties on December 30, 1943, is invalid under s. 23 of the Indian Contract Act, because its consideration was opposed to public policy.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sudhindra Kumar v. Ganesh Chandra",
      "citation": "1939 I Cal. 241",
      "treatment": "referred",
      "relevance": "No court of law can countenance or give effect to an agreement which attempts to take the administration of law out of the hands of the judges and put in the hands of private individuals."
    },
    {
      "case_name": "Bhowanipur Banking Corporation Ltd. v. Sreemati Durgesh Nandini Dasi",
      "citation": "A.I.R. 1941 P.C. 95",
      "treatment": "referred",
      "relevance": "To insist on reparation as a consideration for promise to abandon criminal proceedings is a serious abuse of the right of private prosecution. It is immaterial whether the debt was real or a crime committed; what matters is the understanding that the promise is in exchange for not prosecuting."
    },
    {
      "case_name": "Kamini Kumar Basu v. Virendra Nath Basu",
      "citation": "1930 L.R. 57 I.A. 117",
      "treatment": "followed",
      "relevance": "If it is an implied term of a reference to arbitration that a complaint of a non-compoundable offence shall not be proceeded with, the consideration is unlawful on the ground of public policy, irrespective of whether prosecution commenced."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Contract Act",
      "sections": [
        "23"
      ],
      "relevance": "Every agreement of which the object or consideration is unlawful is void if opposed to public policy."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "420",
        "465",
        "468",
        "477",
        "107",
        "120B"
      ],
      "relevance": "Offences alleged in the criminal complaint, which were non-compoundable."
    },
    {
      "name": "Arbitration Act",
      "sections": [
        "5",
        "11",
        "14",
        "30",
        "33"
      ],
      "relevance": "Provisions used for removal of arbitrator, filing award, setting aside award."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "133"
      ],
      "relevance": "Certificate granted by High Court for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The two appeals are allowed, the application made by respondent No. 1 (M.J.C. 105 of 1946) for passing a decree in terms of the award is dismissed and the application made by the appellant (M.J.C. No. 8 of 1947) for setting aside the award is allowed.",
    "relief_granted": "Award set aside; arbitration agreement declared invalid.",
    "costs": "The appellant would be entitled to his costs from respondent No. 1 throughout."
  },
  "key_quotes": [
    {
      "text": "\"Agreement made by parties for stifling prosecution are not enforced by Courts on the ground that the consideration for such agreements is opposed to public policy.\"",
      "speaker": "court",
      "significance": "Core principle applied to invalidate the agreement."
    },
    {
      "text": "\"Once the machinery of the Criminal Law is set into motion on the allegation that a non-compoundable offence has been committed, it is for the criminal courts and criminal courts alone to deal with that allegation.\"",
      "speaker": "court",
      "significance": "Explains why stifling prosecution is against public policy."
    },
    {
      "text": "\"No Court of law can countenance or give effect an agreement which attempts to take the administration of law out of the hands of the judges and put in the hands of private individuals.\"",
      "speaker": "court",
      "significance": "Quote from cited precedent reinforcing public policy."
    }
  ],
  "_case_id": "1962_147",
  "_label": 1,
  "_text_length": 28500,
  "_extracted_at": "2026-02-10T19:58:36.872304"
}