{
  "metadata": {
    "case_name": "State of Gujarat v. Kansara Manilal Bhikhalal",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On June 21, 1960, at 5-50 A.M. the Inspector of Factories, Bhavnagar, visited Saurashtra Metal and Mechanical Works, Wadhwan City, which is a factory within the meaning of s. 2(m) of Factories Act, 1948.",
      "type": "material",
      "date": "1960-06-21",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Inspector found seven workmen working on a machine and on examining the notice of period of work for adult workers and the register of workers he found that three of the workmen belonged to a group which was expected to begin work from 7 A.M.",
      "type": "material",
      "date": "1960-06-21",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Inspector commenced proceedings under s. 63 of the Factories Act 1948 against the respondent Mr. Kansara Manilal Bhikhalal as the occupier manager of the factory, after issuing notice to him to show cause.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Inspector asked for enhanced penalty under s. 94 of the Factories Act because the said Mr. Manilal Bhikhalal was convicted on a previous occasion in three cases.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "As three workmen were concerned three separate complaints were filed in the Court of the Judicial Magistrate, First Class, Wadhwan City.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Defence of the respondent was that he was not the occupier and manager of the factory. One Mr. Dangi and the respondent are partners. They have another factory at Dharangadhra and the defence was that Mr. Bhikhalal was manager at the Dharangadhra factory and Mr. Dangi was manager at Wadhwan.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Another defence was that a machine had gone out of order the previous day and after it was repaired work was started a little earlier the next day, because production had suffered and goods were required.",
      "type": "disputed",
      "date": "1960-06-20",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The Inspector was informed by a letter Ext. 11 written on the 20th about the change of timing though the letter, unfortunately, did not reach the Inspector till the 22nd.",
      "type": "disputed",
      "date": "1960-06-20",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "It was admitted that this change in the hours of work was not notified and displayed as required by s. 61(1).",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "It was urged that s. 61(10) permitted a change to be made in the system of work in a factory and as this provision was fully complied with, there was no offence.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "The Judicial Magistrate did not accept these defences. According to him, Mr. Dangi's letter Ext. 15 showed that the respondent was the occupier and the manager of the factory at Wadhwan.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "On the second defence the Magistrate was of the opinion that the hours of work could not be changed without the permission of the Inspector of Factories under sub-s. (10) of s. 61.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The contention on behalf of the respondent that this being the first change it was not necessary to wait for one week before making another change, was not accepted because it was held that the factory manager must always wait for one week before introducing a change.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The respondent was, therefore, convicted under s. 63 of the Factories Act in respect of three offences and under s. 94, enhanced punishment was imposed upon him by ordering him to pay a fine of Rs. 100 in respect of each offence.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "On appeal the Sessions Judge of Surendranagar ordered the acquittal of the respondent.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "The learned Sessions Judge held that the second part of s. 61(10) applied to a case of second or subsequent change and this being the first change it did not fall within the second part. According to the Sessions Judge, it fell in the first part of the sub-section and the change could not be said to have been effected in breach of that part since the Inspector of Factories was informed about the change.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "The learned Sessions Judge was also of the opinion that s. 117 of the Factories Act protected the action because it was bonafide.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "The State of Gujarat appealed against the acquittal but was unsuccessful. A Division Bench of the High Court which heard the appeal agreed with the Sessions Judge in his interpretation of s. 61(10) and did not express any opinion on s. 117 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "In this appeal filed by special leave of this Court these two points have again arisen for our consideration.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the employment of three workers before their scheduled shift time on June 21, 1960, constituted an offence under s. 63 of the Factories Act, 1948, particularly in light of s. 61(10).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the respondent was the occupier and manager of the factory.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether s. 117 of the Factories Act protects the respondent from prosecution.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The hours of work must correspond with notice under s. 61 and register under s. 62; breach of s. 63 occurred as workers worked contrary to notice and register.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Sections 61, 62, 63 of Factories Act"
    },
    {
      "id": "pa2",
      "text": "Enhanced penalty under s. 94 due to previous convictions.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 94 of Factories Act"
    },
    {
      "id": "pa3",
      "text": "Respondent is occupier and manager as per Ext. 15.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "S. 117 does not protect actions contrary to the Act.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Section 117 of Factories Act; precedents like Public Prosecutor v. Vattem Venkatramayya, Provincial Government v. Seth Chapsi"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Respondent was not the occupier and manager; Mr. Dangi was manager at Wadhwan.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Machine out of order previous day, repaired, work started early for production; letter Ext. 11 sent on 20th informing Inspector of change.",
      "supporting_facts": [
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": "S. 61(10) of Factories Act"
    },
    {
      "id": "ra3",
      "text": "First change, so no need for one week wait or Inspector sanction under s. 61(10); notified Inspector before change.",
      "supporting_facts": [
        "f10",
        "f16"
      ],
      "legal_basis": "S. 61(10) of Factories Act"
    },
    {
      "id": "ra4",
      "text": "S. 117 protects bonafide action.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "S. 117 of Factories Act; Ranjit Singh v. Emperor AIR 1943 Oudh 308, Public Prosecutor v. Mangaldas Thakkar AIR 1958 Andh Pra 79"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S. 61(10) contemplates change in the system of work necessitating recast of notice, affecting whole group, not casual early start for individual workers; this case not covered by s. 61(10).",
      "addresses_issue": "i1",
      "key_observation": "Words 'change in the system of work... which will necessitate a change in the notice' refer to overall change, not individual timing."
    },
    {
      "id": "cr2",
      "text": "Respondent is occupier and manager as found by Magistrate and evidenced by Ext. 15.",
      "addresses_issue": "i2",
      "key_observation": "Letter of Mr. Dangi Ext. 15 clearly establishes respondent as occupier and manager."
    },
    {
      "id": "cr3",
      "text": "S. 117 protects only acts done or intended under the Act, not contrary to it; requires compliance or intended compliance with Act provisions; no protection for breach however honest.",
      "addresses_issue": "i3",
      "key_observation": "Protection conferred only if person required to do/omit something under Act; s. 101 provides separate safeguard for occupier/manager."
    },
    {
      "id": "cr4",
      "text": "S. 59 overtime not applicable without exempting rules under s. 64; no such claim or justification.",
      "addresses_issue": "i1",
      "key_observation": "Departure from hours only per exempting rules for urgency relating to factory."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Employment of workers contrary to notice under s. 61(1) without exempting provision constitutes offence under s. 63; not saved by s. 61(10).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Respondent is occupier and manager liable under the Act.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "S. 117 does not confer immunity for breach of Act.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ranjit Singh v. Emperor",
      "citation": "A.I.R. 1943 Oudh 308",
      "treatment": "referred",
      "relevance": "Cited by respondent for wide protection under s. 117 to occupiers etc."
    },
    {
      "case_name": "Ranjit Singh v. Emperor",
      "citation": "A.I.R. 1943 Oudh 311",
      "treatment": "referred",
      "relevance": "Cited by respondent for wide protection under s. 117."
    },
    {
      "case_name": "Public Prosecutor v. Mangaldas Thakkar",
      "citation": "A.I.R. 1958 Andh. Pra. 79",
      "treatment": "referred",
      "relevance": "Cited by respondent supporting wide s. 117 protection."
    },
    {
      "case_name": "In re. P. Lakshmaiah Naidu",
      "citation": "I.L.R. 1958 Andh. Pra. 925",
      "treatment": "referred",
      "relevance": "Cited by respondent supporting wide s. 117 protection."
    },
    {
      "case_name": "Public Prosecutor v. Vattem Venkatramayya",
      "citation": null,
      "treatment": "followed",
      "relevance": "Supports narrow interpretation of s. 117."
    },
    {
      "case_name": "Provincial Government, C.P. and Berar v. Seth Chapsi Dhanji",
      "citation": "I.L.R. 1940 Nag. 257; A.I.R. 1938 Nag. 408",
      "treatment": "followed",
      "relevance": "Supports that s. 117 requires act under the Act, not contrary; occupier responsibility unless s. 101 used."
    },
    {
      "case_name": "Superintendent and Remembrancer of Legal Affairs, Bengal v. H. E. Watson",
      "citation": null,
      "treatment": "referred",
      "relevance": "Cited by State on s. 117."
    }
  ],
  "statutes_cited": [
    {
      "name": "Factories Act, 1948",
      "sections": [
        "2(m)",
        "51",
        "52",
        "54",
        "55",
        "56",
        "58",
        "59",
        "61",
        "62",
        "63",
        "64",
        "92",
        "94",
        "101",
        "108",
        "117"
      ],
      "relevance": "Breach of s. 63 for hours not corresponding to notice s.61 and register s.62; s.61(10) not applicable; enhanced penalty s.94; no protection under s.117."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court sets aside acquittal by Sessions Judge and High Court, convicts respondent under s. 63 read with s. 94 of Factories Act for three offences, sentences to pay a fine.",
    "relief_granted": "Conviction and sentence restored/imposed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"That sub-section speaks of change in the system of work in any factory which will necessitate a change in the notice and these words refer not to a departure from the notice but to a change in the system, a change which would require the notice to be recast.\"",
      "speaker": "court",
      "significance": "Core interpretation rejecting application of s.61(10) to facts."
    },
    {
      "text": "\"The protection conferred can only be claimed by a person who can plead that he was required to do or omit to do something under the Act or that he intended to comply with any of its provisions. It cannot confer immunity in respect of actions which are not done under the Act but are done contrary to it.\"",
      "speaker": "court",
      "significance": "Defines scope of s.117 protection."
    },
    {
      "text": "\"Compliance with the peremptory provisions of the Act is essential and unless the occupier or the manager brings the real offender to book he must bear the responsibility.\"",
      "speaker": "court",
      "significance": "Explains liability and s.101 safeguard."
    }
  ],
  "_case_id": "1962_134",
  "_label": 1,
  "_text_length": 15147,
  "_extracted_at": "2026-02-10T19:58:41.988511"
}