{
  "metadata": {
    "case_name": "Ram Kishore & Anr. v. Kamal Narayan",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Civil Appeal No. 523 of 1960",
    "date_of_judgment": "1962-11-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "There exists at Raipur in Madhya Pradesh an old Math by the name of Dudhadhari Math within which is a temple where the idols of Shri Ramchandra, Sita, Laxman, Bharat, Satrughan and Hanumanji have been worshipped for very many years.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For the expenses of the worship of the deities and for the upkeep of the temple, one village by the name of Hirmi was dedicated by Dinanath Sao, a wealthy inhabitant of the locality.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The main controversy in the present litigation is whether another village of the name of Telibandha which also belonged to Dinanath was dedicated absolutely to the temple either by Dinanath Sao himself or later on by his descendants.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The two appellants, both descendants of Dinanath Sao brought the present suit under s. 92 of the Code of Civil Procedure, 1908, for removal of the respondent Kamal Narayan, another descendant of Dinanath Sao, from the office of trustee of the God Shri Ramchandraji Swamy for the village of Telibandha and for accounts.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Appellants' case: Telibandha was dedicated to the temple of Shri Ramchandraji as early as 1857 by Dinanath Sao himself and later on in the year 1896 when a partition took place between his descendants who were up till that time living jointly, all the sharers only re-affirmed the dedication made by Dinanath Sao of this village of Telibandha but themselves dedicated the village Telibandha to the deities in this temple by accepting the award made by the Panchas.",
      "type": "material",
      "date": "1857",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Dinanath died in 1862, leaving his two sons Sobharam and Keshoram.",
      "type": "background",
      "date": "1862",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Sobha Ram had three sons, Sarjoo Prasad, Gokul Prasad and Jamna Prasad. Keshoram had also three sons, Ramdin, Gajanand and Nand Kishore.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "At the time of the partition in 1896 Sarjoo Prasad was dead and the parties to the partition were Sarjoo Prasads four sons, Ram Saran Lal, Ramhirde, Ram Krishna and Ramanuj, representing Sarjoo Prasads branch and the other five grand-sons of Dinanath.",
      "type": "material",
      "date": "1896",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The first appellant Ram Kishore is the son of Nand Kishore Sao, while the second appellant, Ramanuj is Sarjoo Prasads son. The respondent is the son of Ram Saran Lal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "By the award of 1896, it is the plaintiffs case, Ram Saran Lal was not given any proprietary interest in the village Telibandha but was merely made the Manager on behalf of the deities for this property.",
      "type": "material",
      "date": "1896",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "On Ram Saran Lals death in 1930, Kamal Narayan, his son became the trustee.",
      "type": "material",
      "date": "1930",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "According to the plaintiffs the temple was a public temple and the trust a public trust.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "The plaintiffs allege that Kamal Narayan committed several breaches of trust by the sale of certain lands of Mouza Telibandha for the sum of Rs. 1,06,774/1/- and in other ways.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "The plaintiffs first approached the Court of the Additional District judge, Raipur with a petition under s. 3 of the Charitable and Religious Trusts Act for directions on Kamal Narayan as provided in that section. Directions were accordingly issued by the Additional District judge but with this the respondent did not comply.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "It was then that the present suit was brought by the plaintiffs without the previous consent of the Advocate-General as is permitted by s. 6 of the Charitable and Religious Trusts Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "The plaintiffs have prayed for a declaration that Telibandha village was held by the defendant in the trust for Shri Ramchandra of the Dudhadhari Math and that he had committed breaches of such trust for his removal from the position of a trustee and for appointment of the first plaintiff in his place for an order on him to render accounts since 1936 and to deposit Rs. 1,06,774/1/- which he got as sale proceeds.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "The defendant denied that Telibandha was ever dedicated.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "As regards the Award of 1896 his plea was that it did not express accurately the decision of the Arbitrators and that, in any case, it was superseded by the Award of Mr. Bagchi on May 14, 1898, which was accepted by all the sharers as the actual settlement of their own and on the basis of which a suit brought to challenge the validity of the earlier award was dismissed as compromised.",
      "type": "disputed",
      "date": "1898-05-14",
      "source": "respondent"
    },
    {
      "id": "f19",
      "text": "The defendants case is that there was no trust, either express or constructive, created at any time by any one in respect of Telibandha village that neither he nor his father was trustee in respect of this village and there was no breach of trust by him.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f20",
      "text": "To explain his possession of the village the defendant referred to a partition in 1901 between Sarjoo Prashads four sons, on the one hand and Jamuna Prasad, on the other, at which, it was said, that Telibandha fell to the share of Sarjoo Prasads four sons.",
      "type": "procedural",
      "date": "1901",
      "source": "respondent"
    },
    {
      "id": "f21",
      "text": "Thereafter in 1913, there was a further partition between Sarjoo Prasads four sons and the defendant at which Telibandha was allotted to defendants father Ramsaranlal alone.",
      "type": "procedural",
      "date": "1913",
      "source": "respondent"
    },
    {
      "id": "f22",
      "text": "On a consideration of the evidence the Trial Court held that there had been a valid dedication in respect of the village Telibandha for the Temple of Shri Ramchandra Swamy. It was not satisfied that the dedication had been made by Dinanath himself but held that there was such a dedication sometime before 1896 and that that dedication was confirmed by all the sharers at the time of the partition of 1896.",
      "type": "material",
      "date": "1896",
      "source": "lower_court"
    },
    {
      "id": "f23",
      "text": "As regards the Bagchi Award, the learned judge was of opinion that it did purport to revoke the dedication and to allot the village to the members of one branch of the family with only a moral obligation to look after the temple but this later Award had all along remained a dead letter and did not affect the Panch Faisla Award of 1896.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f24",
      "text": "The Trial Court held that a valid trust had been created in favour of the temple and it was a public religious trust, as Shri Ramchandra temple, for which the trust was created, was a public institution.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f25",
      "text": "The Court found that the defendant was the trustee of this public trust, and had committed breaches of trust by transferring trust properties and appropriating its proceeds and finally by his express repudiation of this trust and was therefore liable to be removed.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f26",
      "text": "Accordingly, it passed a decree declaring that defendant No. 1 had committed breaches of trust as a trustee of the village Telibandha for the temple of Shri Ramchandra Swamy and removing the defendant from the office of the trustee. By the decree the Court also directed the defendant to deposit a sum of Rs.1,06,774/1/-in Court. The first plaintiff Ram Kishore Lal was appointed the trustee in place of the defendant. It was also ordered that a commissioner would be appointed later on to enquire into the alienations made by the defendant and to take accounts of the trust from the year 1936.",
      "type": "procedural",
      "date": "1952",
      "source": "lower_court"
    },
    {
      "id": "f27",
      "text": "On appeal by the defendant, the High Court of judicature at Nagpur has set aside the judgment and decree of the Trial Court and ordered the dismissal of the suit.",
      "type": "procedural",
      "date": "1957-12-05",
      "source": "lower_court"
    },
    {
      "id": "f28",
      "text": "The High Court was of opinion that the dedication of the village Telibandha had not been proved. The High Court agreed with the Trial Court that dedication by Dinanath Sao himself, by a Patha in 1857 as alleged in the plaint had not been established but disagreeing with the Trial Court, it held that there was no absolute dedication of the village for the purpose of the temple by the Panch Faisla Award of 1896 and no trust was created thereby.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f29",
      "text": "On a construction of this document the learned judges of the High Court held that it did not show more than a partial dedication of the village as distinguished from an absolute dedication.",
      "type": "material",
      "date": "1896",
      "source": "lower_court"
    },
    {
      "id": "f30",
      "text": "Against this decision of the High Court the present appeal was filed by the plaintiffs on a certificate granted by the High Court under Art. 133 (1) (b) of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f31",
      "text": "Immediately after the award was made [1896], it was presented before the Sub Registrar, Raipur, for registration. Within a few days, however, an application in connection with this matter appears to have been made before the Civil judge, Raipur.",
      "type": "procedural",
      "date": "1896",
      "source": "court"
    },
    {
      "id": "f32",
      "text": "In this Ramsaranlal stated his objection to the award on the ground that the Panchas did not read out the award before him, that they had asked him to state in writing his objections which he did but they did not take any evidence. The Civil judge rejected Ramsaran Lals contention and returned the award to the Sub-Registrar with a direction to register it in due course and also directed the Panchas to file it in a Civil Court after it had been duly registered.",
      "type": "procedural",
      "date": "1896",
      "source": "court"
    },
    {
      "id": "f33",
      "text": "It appears that after this the award was duly registered.",
      "type": "procedural",
      "date": "1896",
      "source": "court"
    },
    {
      "id": "f34",
      "text": "In November of the same year however Ramsaranlals three brothers brought a suit in the Court of the Civil judge at Raipur in which they sought to have this registered award set aside. Ramsaranlal and other sharers were impleaded, in the suit as defendants.",
      "type": "procedural",
      "date": "1896-11",
      "source": "court"
    },
    {
      "id": "f35",
      "text": "After some evidence had been recorded the hearing was adjourned on the prayer of the parties who wanted to settle the dispute amicably. Mr. Bagchi who was the pleader of some of the plaintiffs was orally requested by the parties to decide whether the award of the panchas was proper or not and to make changes, if necessary, and on May 14, 1896 Mr. Bagchi made his award. On the same date an application for compromise was filed in Court. Accordingly, the Court dismissed the suit as compromised.",
      "type": "procedural",
      "date": "1896-05-14",
      "source": "court"
    },
    {
      "id": "f36",
      "text": "Mathura Prasad stated in answer to a question from the Court: At that time there was no question as to what should be done with the savings from the income of the village Telibandha, after meeting the requirements of the temple, because the income those days was not much while the expenses which used to be incurred on the temple were far in excess of the income from the village.",
      "type": "admitted",
      "date": "1896",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether by the Punch Faisla Award of 1896 an absolute dedication of the village Telibandha was made in favour of Shri Ramchandra Swamy temple or whether the village was given in full proprietorship to Ramsaran Lal with only a charge on it to meet the expenses of the temple.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the temple was a public temple and the trust a public trust.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the defendant committed breaches of trust.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether a partition Award of this nature can under the Hindu Law create a valid dedication in favour of a deity.",
      "framed_by": "respondent"
    },
    {
      "id": "i5",
      "text": "Whether the Bagchi Award superseded the 1896 Panch Faisla Award.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Telibandha was dedicated to the temple of Shri Ramchandraji as early as 1857 by Dinanath Sao himself and later on in the year 1896... all the sharers only re-affirmed the dedication made by Dinanath Sao... but themselves dedicated the village Telibandha to the deities in this temple by accepting the award made by the Panchas.",
      "supporting_facts": [
        "f5",
        "f8",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The temple was a public temple and the trust a public trust. Kamal Narayan committed several breaches of trust by the sale of certain lands... for Rs. 1,06,774/1/- and in other ways.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": "s. 92 CPC; s. 3 and s. 6 Charitable and Religious Trusts Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Telibandha was never dedicated. As regards the Award of 1896... it did not express accurately the decision of the Arbitrators and... it was superseded by the Award of Mr. Bagchi on May 14, 1898...",
      "supporting_facts": [
        "f17",
        "f18",
        "f20",
        "f21"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "There was no trust, either express or constructive, created at any time... neither he nor his father was trustee... and there was no breach of trust by him.",
      "supporting_facts": [
        "f19"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "A partition Award of this nature cannot under the Hindu Law create a valid dedication in favour of a deity.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Hindu Law"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "On a construction of paragraph 2 of the Panch Faisala... by this Award Telibandha village was dedicated absolutely to the temple of Shri Ramchandra Swamy and Ramsaran Lal was given possession of it as the manager and trustee of the temple.",
      "addresses_issue": "i1",
      "key_observation": "The use of words Kul haq haquq samet milkiyat ke raises a presumption of absolute ownership but is displaced by subsequent provisions indicating dedication for temple purposes, prohibition on alienation, etc."
    },
    {
      "id": "cr2",
      "text": "The act of the Panchas was thus really the act of the owners of the property and as owners had full right to make a valid dedication to the deity the dedication as made in Para. 2 of the Panch Faisla must be held to be valid.",
      "addresses_issue": "i4",
      "key_observation": "Panchas acted with consent of all sharers."
    },
    {
      "id": "cr3",
      "text": "Mr. Bagchis award can have no legal effect in respect of the dedication already made. Once an absolute dedication... had been made... the former owners... had no legal authority to go behind that dedication.",
      "addresses_issue": "i5",
      "key_observation": "Bagchi award did not set aside the 1896 award; suit dismissed as compromised without finding infirmity."
    },
    {
      "id": "cr4",
      "text": "The course of conduct of the parties is of no relevance for the construction of a document which is itself unambiguous.",
      "addresses_issue": "i1",
      "key_observation": "No need to examine oral or documentary evidence on dealings with property."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "By the Panch Faisla Award of 1896 an absolute dedication of the village Telibandha was made in favour of Shri Ramchandra Swamy temple.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "The Bagchi Award did not supersede or invalidate the 1896 dedication.",
      "resolves_issue": "i5",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "A partition award can create a valid dedication if made with consent of owners.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sahebzada Mohd. Kamgar Shah v. Jagdish Chandra Deo Dhabal Deo",
      "citation": "1960 3 S.C.R. 604, 611",
      "treatment": "followed",
      "relevance": "In case of conflict in document, earlier absolute title prevails over later restrictions."
    },
    {
      "case_name": "Lalit Mohan Singh Roy v. Chukkun Lal Roy",
      "citation": "1897 L.R. 24 I.A. 76",
      "treatment": "referred",
      "relevance": "Words 'Malik' sufficient for heritable alienable estate unless context indicates otherwise."
    },
    {
      "case_name": "Surajmani v. Rabi Nath Ojha",
      "citation": "1907 L.R. 35 I.A. 17",
      "treatment": "referred",
      "relevance": "Word 'Malik' imports full proprietary rights unless qualified by context."
    },
    {
      "case_name": "Saraju Bala Devi v. Jyotirmoyee Devi",
      "citation": "1931 L.R. 58 I.A 270",
      "treatment": "referred",
      "relevance": "Context must be examined even if 'Malik' used."
    },
    {
      "case_name": "Mohamed Shumsool v. Shewukram",
      "citation": "1874 L R. 2 I.A. 7",
      "treatment": "referred",
      "relevance": "Examine whole document and circumstances for intention."
    },
    {
      "case_name": "Rai Bajrang Bahadur Singh v. Thakurain Bakhtrai Kuer",
      "citation": "1953 S.C.R. 232",
      "treatment": "followed",
      "relevance": "Words like 'Malik' presume absolute estate unless context or restrictions indicate otherwise; read whole document."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "s. 92"
      ],
      "relevance": "Suit brought under this for removal of trustee and accounts."
    },
    {
      "name": "Charitable and Religious Trusts Act",
      "sections": [
        "s. 3",
        "s. 6"
      ],
      "relevance": "Prior petition for directions; suit without AG consent permitted by s.6."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 133 (1) (b)"
      ],
      "relevance": "Certificate for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Appeal allowed; High Court judgment and decree set aside; held that village Telibandha absolutely dedicated to temple; case remanded to High Court for disposal after deciding other issues like public character of trust, breaches etc.",
    "relief_granted": "Declaration of absolute dedication; remand for further issues",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "by this Award Telibandha village was dedicated absolutely to the temple of Shri Ramchandra Swamy and Ramsaran Lal was given possession of it as the manager and trustee of the temple.",
      "speaker": "court",
      "significance": "Core holding on construction of 1896 award."
    },
    {
      "text": "The golden rule of construction, it has been said, is to ascertain the intention of the parties to the instrument after considering all the words, in their ordinary, natural sense.",
      "speaker": "court",
      "significance": "Principle applied to interpret the award."
    },
    {
      "text": "Once an absolute dedication of the property had been made in December 1896 in favour of Shri Ramchandra Swamy temple the former owners of the property had no legal authority to go behind that dedication.",
      "speaker": "court",
      "significance": "Explains why Bagchi award ineffective."
    }
  ],
  "_case_id": "1962_274",
  "_label": 1,
  "_text_length": 30825,
  "_extracted_at": "2026-02-10T20:00:37.523943"
}