{
  "metadata": {
    "case_name": "Bagalkot Cement Co. Ltd. v. The Workmen",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 577 of 1960",
    "date_of_judgment": "1962-01-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant Bagalkot Cement Co. Ltd. is a Limited Company registered under the Indian Companies Act, 1930 it carries on the business of manufacturing cement and for that purpose, it owns a factory as well as a limestone Quarry at Bagalkot in the State of Mysore.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "As required by s. 3 of the Act, the appellant submitted draft Standing Orders on the 3rd March, 1958, to the Certifying Officer and the Regional Labour Commissioner (Central), Madras, in order that they should be certified.",
      "type": "procedural",
      "date": "1958-03-03",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Certifying Officer considered the draft submitted by the appellant, heard the appellant and its employees, the respondents and passed an order of certification on the 16th June, 1959. While considering the draft for the purpose of certification, the Certifying Officer, however, made certain amendments in, and additions to, the said draft. Amongst the additions made, clause 7 in paragraph 11 was one.",
      "type": "procedural",
      "date": "1959-06-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Paragraph 11 of the draft Standing Orders submitted by the appellant dealt with the question of leave. Paragraph 11 (1) of the draft provided that holidays with pay will be allowed as provided for in the Factories Act, 1948, and other holidays in accordance with law and contract.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Clause 7 added by Certifying Officer to paragraph 11: The workmen shall be allowed during the course of a year- (a) Ten festival holidays with pay for the celebration of important festivals which will be fixed before the commencement of every calendar year in consultation with the workmen including the Republic Day (26th January) and the Independence Day (15th August) and/or any other paid holidays as may be declared and notified by the Government from time to time. Those workmen that are required to work on festivals and National Holidays shall be given an equal number of compensatory holidays on day convenient to the company, and (b) Fifteen days casual leave with wages. This will include all kinds of leave due to sickness or any other cause. Casual leave will not be allowed for more than 3 days at a time except in the case of sickness and emergencies at the discretion of the company. Wages shall be allowed for those days remaining un-availed by the workers at the end of the year. (d) Fourteen days annual leave to all classes of workers who have put in 265 attendances in a year as defined in the Mines Act. This includes statutory leave. All leave should be applied for only in the prescribed form.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The appellant contended before the Certifying Officer that it was outside his jurisdiction to deal with the topics covered by clause 7 which he wanted to add but its objection was overruled.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Against the order passed by the Certifying Officer certifying the Standing Orders with the additions and amendments made by him, the appellant preferred an appeal under section 6 of the Act to the appellate authority, viz., the Chief Labour Commissioner (Central), New Delhi, on the 5th July 1959.",
      "type": "procedural",
      "date": "1959-07-05",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The appellate authority, in substance, agreed with the view taken by the Certifying Officer and retained the addition made by him by the insertion of clause 7 to paragraph 11. He, however, made slight modifications: in clause (a) there will be seven festival holidays instead of ten; in clause (b) there will be ten days casual leave instead of fifteen days. Clause (d) was amended: Casual leave will not be allowed to be accumulated. Unavailed casual leave shall lapse at the close of the calendar year. Clause (e) amended to: Annual leave with wages will be allowed as per provisions of the Mines Act.",
      "type": "procedural",
      "date": "1959-10-15",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The order of the appellate authority was passed on October 15, 1959.",
      "type": "procedural",
      "date": "1959-10-15",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Against this order, the appellant applied for special leave to this Court and special leave was granted to it on the 1st February, 1960.",
      "type": "procedural",
      "date": "1960-02-01",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "The scope and effect of clause 5 in the Schedule to the Industrial Employment (Standing Orders) Act, 1946: whether it empowers the Certifying Officer to deal with the substantive question of the extent and quantum of leave and holidays, or only conditions subject to which leave and holidays can be granted and the procedure in respect thereof and the authority which may grant such leave and holidays.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The jurisdiction conferred on the certifying authority by clause 5 in the Schedule does not empower the certifying authority to deal with the substantive question of the extent and quantum of leave and holidays. It only requires the Standing Orders to provide for conditions subject to which leave and holidays can be granted and the procedure in respect thereof and the authority which may grant such leave and holidays. The quantum of leave and holidays which should be granted to the workmen is outside the purview of the Schedule and as such, cannot be included in the Standing Orders.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Clause 5 of the Schedule to the Industrial Employment (Standing Orders) Act, 1946"
    },
    {
      "id": "pa2",
      "text": "Clause 3 in the Schedule refers to shift working, including substantive provision. If the Legislature had intended substantive provision as to leave and holiday, it would have referred to leave and holidays only in cl 5 without additional words of limitation.",
      "supporting_facts": [],
      "legal_basis": "Clauses 3 and 5 of the Schedule"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "To adopt the narrow construction of the word 'conditions' in cl. 5 would defeat the very purpose of cl. 5. Merely providing for the procedure of application and for the authority who would grant leave and holidays without stipulating as to the quantum of leave and holidays would be almost meaningless.",
      "supporting_facts": [],
      "legal_basis": "Clause 5 of the Schedule; object of the Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The object of the Act was to require the employers to make the conditions of employment precise and definite and the act ultimately intended to prescribe these conditions in the form of standing orders so that what used to be governed by a contract heretofore would not be governed by the statutory standing orders. The word 'conditions' in cl. 5 of the Schedule has to be reasonably construed in a broad and liberal sense. A provision or a stipulation as to leave and holidays would necessarily include a provision for the quantum of holidays and leave.",
      "addresses_issue": "i1",
      "key_observation": "Dictionary meaning of 'condition' is a provision or a stipulation; consistent with preamble."
    },
    {
      "id": "cr2",
      "text": "The first three clauses dealing with the conditions, the procedure and the authority would apply both to leave and holidays and it is not easy to appreciate what conditions could be prescribed by the standing orders for the purpose of holidays without quantum.",
      "addresses_issue": "i1",
      "key_observation": "Broad construction makes cl. 5 self-sufficient."
    },
    {
      "id": "cr3",
      "text": "Reference to Model Standing Orders: Clause 9 provides for holidays with pay as per Factories Act; Clause 10 provides quantum of casual leave (10 days). This supports broad construction.",
      "addresses_issue": "i1",
      "key_observation": "Model orders include quantum under cl. 5 matters."
    },
    {
      "id": "cr4",
      "text": "Clauses like 8 (termination) and 9 (misconduct) include substantive provisions; consistent to include quantum of leave/holidays under cl. 5. Modifications possible under s. 10 after 6 months.",
      "addresses_issue": "i1",
      "key_observation": "No hardship; aligns with scheme."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Clause 5 of the Schedule includes provision for the quantum of leave and holidays; Certifying Officer and appellate authority had jurisdiction to add clause 7 to paragraph 11 specifying such quantum.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Industrial Employment (Standing Orders) Act, 1946",
      "sections": [
        "s. 3",
        "s. 4",
        "s. 5",
        "s. 6",
        "s. 10",
        "Schedule cl. 5",
        "s. 13A"
      ],
      "relevance": "Governs submission, certification, appeal, and content of Standing Orders; scope of cl. 5 interpreted to include quantum of leave/holidays."
    },
    {
      "name": "Factories Act, 1948",
      "sections": [
        "Chapter VI"
      ],
      "relevance": "Referenced for holidays with pay in draft and model orders."
    },
    {
      "name": "Mines Act",
      "sections": [],
      "relevance": "Referenced for holidays with pay and annual leave attendances in certified orders."
    },
    {
      "name": "Indian Companies Act, 1930",
      "sections": [],
      "relevance": "Appellant registered under it."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The addition of clause 7 in paragraph 11 of the Standing Orders by the Certifying Officer, as modified by the appellate authority, is upheld as within jurisdiction under clause 5 of the Schedule.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The word 'conditions' in cl. 5. of the Schedule has to be reasonably construed in a broad and liberal sense. The dictionary meaning of the word condition is a provision or a stipulation.",
      "speaker": "court",
      "significance": "Core of interpretation of cl. 5 to include quantum."
    },
    {
      "text": "This appeal by special leave raises a short question about the scope and effect of clause 5 in the Schedule to the Industrial Employment (Standing Orders) Act, 1946.",
      "speaker": "court",
      "significance": "Frames the sole issue."
    },
    {
      "id": "kq3",
      "text": "In the result, the appeal fails and is dismissed.",
      "speaker": "court",
      "significance": "Final disposition."
    }
  ],
  "_case_id": "1962_179",
  "_label": 0,
  "_text_length": 24371,
  "_extracted_at": "2026-02-10T19:59:20.043906"
}