{
  "metadata": {
    "case_name": "Precious Electric Co. v. Commissioner of Income-tax",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 332 of 1961",
    "date_of_judgment": "1962-12-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Before the year 1938, the two appellants and one Jehangir Irani were carrying on business in electric goods including electric bulbs under two firm names: Precious Electric Co. and J. Pirojsha Co.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In June, 1938, Precious Electric Co. entered into an agreement with M/s. Philips Electrical Co. India Ltd. by which the Company demarcated a territory for the Firm, undertaking to sell and deliver electric bulbs therein exclusively to the Firm.",
      "type": "material",
      "date": "1938-06",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "By a letter annexure to the agreement, the Company agreed to sell electric bulbs to the Firm at ex-warehouse prices subject to a commission of 12-21% on the gross invoice amount and further discount of 2% on net invoice prices to cover breakage or fault in manufacture.",
      "type": "material",
      "date": "1938-06",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "If the Company sold any goods directly to buyers in the territory, the Company would pay to the Firm compensation amounting to 5% of the net amount of invoices covering such sales.",
      "type": "material",
      "date": "1938-06",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Firm undertook to sell only Philips bulbs in the territory and to prevent re-exportation of the bulbs by third parties.",
      "type": "material",
      "date": "1938-06",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The agreement was deemed made as from July 1, 1938, and would continue unless determined by either party by giving three months prior notice by registered letter on June 30, 1939 or any subsequent June 30.",
      "type": "material",
      "date": "1938-07-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The agreement continued for a period of sixteen years.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On March 8, 1954, the Company sent a letter to the Firm informing that the agreement would come to an end from June 30, 1954, and sent a draft of a new agreement.",
      "type": "material",
      "date": "1954-03-08",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Some negotiations followed but no fresh agreement was signed.",
      "type": "material",
      "date": "1954",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On May 28, 1954, the two assessees and the Manager of the Firm met representatives of the Company to discuss the new agreement; nothing much came of it, and since Bombay branch was taking over, a working scheme for transition was recorded in minutes signed by representatives.",
      "type": "material",
      "date": "1954-05-28",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Minutes covered period of transition: Philips Bombay Branch to continue distribution, Precious to furnish dealer list and supplies over past six months; execution of local orders in two months, overseas in five months; cooperation for winding up, attention to I.S.D. contracts and public bodies.",
      "type": "procedural",
      "date": "1954-05-28",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Minutes on stocks: Philips to dispose of stocks quickly, classified into easily saleable, requiring sales efforts (4-6 weeks), slow moving taken over by Bombay Branch at original invoice price minus deductions if deteriorated.",
      "type": "material",
      "date": "1954-05-28",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Miscellaneous minutes: As a gesture of goodwill, Philips prepared to pay in quarterly instalments to each of the three partners (Pirojsha H. Devecha, Khurshedji A. Irani, Noshir J. Irani) Rs. 40,000/- per annum for three years from expiry of contract.",
      "type": "material",
      "date": "1954-05-28",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Philips willing to continue Precious as regular lamp dealers, profits additional to three years remuneration.",
      "type": "material",
      "date": "1954-05-28",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "In account year ended December 31, 1954 (assessment year 1955-56), each of the three partners received two quarterly payments of Rs. 10,000 each (total Rs. 20,000 per appellant).",
      "type": "material",
      "date": "1954-12-31",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Income-tax Officer taxed Rs. 20,000 for each appellant as compensation under s. 10(5A) of Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Appellate Assistant Commissioner held s. 10(5A) not apply as not agents and no legal damage, but sum taxable receipt.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Assessees appealed to Tribunal raising contentions: compensation for termination constituting framework of business; ex-gratia/testimonial; to individuals not firm; exempt u/s 4(3)(vii). Tribunal rejected but referred three questions to High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "High Court judgment and order dated June 23, 1959, in Income-tax Reference No. 51 of 1958: answered first question yes (taxable), second yes (not exempt u/s 4(3)(vii)), third unanswered; certified fit for appeal.",
      "type": "procedural",
      "date": "1959-06-23",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Appeal to Supreme Court on certificate granted by High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the receipt of Rs. 20,000/- is a taxable receipt for the purpose of the Indian Income-tax Act, 1922?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If so, is it liable to be not included in the total income of the recipient by reason of Section 4(3)(vii)?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Does the said receipt fall within the mischief of Section 10(5A)(d) and as such liable to tax accordingly?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The agreement was not a trading agreement but constituted an asset on the termination of which compensation was paid to make up for the loss of this capital asset; involved monopoly right, favourable terms, compensation for invasion, discount for breakage; constituted money-making apparatus.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Agreement ran for sixteen years, likely to continue unless terminated; termination not premature but loss of expected rights.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Alternatively, amount not referable to future service (became ordinary dealers); not past service (fully remunerated); ex-gratia payment in nature of testimonial or solatium.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": "Income-tax Commissioner v. Shaw Wallace Co."
    },
    {
      "id": "pa4",
      "text": "Alternatively, receipt not liable u/s 4(3)(vii).",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Section 4(3)(vii)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Business of selling bulbs part of activities; agreement conferred favourable mode of acquiring stock-in-trade only, not capital asset; termination not leading to capital loss; monopoly incidental to trading agreement.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "No premature termination; agreement exhausted itself; even if capital, payment after exhaustion is revenue u/s 12.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "Section 12"
    },
    {
      "id": "ra3",
      "text": "Payment to supplement business receipt next three years, not testimonial.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Agreement not ordinary trading agreement but created monopoly right of purchase and sale in territory, advantage of enduring nature; terminable but likely to continue as profitable; loss falls on capital asset, not ordinary trading.",
      "addresses_issue": "i1",
      "key_observation": "The agreement constituted a source and a monopoly, and which gave an enduring advantage to a trader in his trade."
    },
    {
      "id": "cr2",
      "text": "Payment not related to termination per agreement terms (no compensation provided for termination); not measure of lost profits; ad hoc payment out of gratitude for partners' qualities and past association building sales organisation.",
      "addresses_issue": "i1",
      "key_observation": "The payment was in token of appreciation and was not related to any business done or to loss of profits and it was not recompense for services past or future."
    },
    {
      "id": "cr3",
      "text": "Not for past or future services; past remunerated, future only winding up with minimal assistance like customer list.",
      "addresses_issue": "i1",
      "key_observation": "The payment was thus not related to any service either in the past or in the future."
    },
    {
      "id": "cr4",
      "text": "High Court erred; distinguished cases like Bush Beach (different agreement, premature termination affecting new field but business continued unaffected).",
      "addresses_issue": "i1",
      "key_observation": "Impossible to describe this agreement as a trading agreement."
    },
    {
      "id": "cr5",
      "text": "Not income, profits or gains; s.4(3)(vii) saves casual non-recurring receipts if income, but here not income; assessees not employees.",
      "addresses_issue": "i2",
      "key_observation": "The receipt would be saved by s. 4(3)(vii) from being included in the total income in any event. But... not being income... has no application."
    },
    {
      "id": "cr6",
      "text": "S.10(5A) not apply: not agents, firm not agent.",
      "addresses_issue": "i3",
      "key_observation": "The fourth category also does not apply as the appellants in their individual capacity were not holding an agency and the Firm of which they were partners was also not an agent."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Receipt of Rs. 20,000 not a taxable receipt under Income-tax Act, 1922.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Section 4(3)(vii) does not apply as not income.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Receipt does not fall within Section 10(5A)(d).",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bush, Beach & Gent. Ltd. v. Road",
      "citation": "1939 22 Tax Cases 519",
      "treatment": "distinguished",
      "relevance": "Distinguished as agreement different: fixed term prematurely terminated, minimum quantities, new business field but overall business unaffected; payment replacement of profits."
    },
    {
      "case_name": "Glenboig Union Fireclay Co. Ltd. v. Commissioner of Inland Revenue",
      "citation": "1922 Tax Cas 427",
      "treatment": "referred",
      "relevance": "No relation between measure used for calculating result and quality of figure arrived."
    },
    {
      "case_name": "Short Bros. Ltd. v. Commissioners of Inland Revenue",
      "citation": "1927 12 Tax Cas. 955",
      "treatment": "referred",
      "relevance": "Trading contract terminated, compensation for loss of profits ordinary trading receipt."
    },
    {
      "case_name": "Commissioner of Inland Revenue v. Northfleet Coal and Ballast Co. Ltd.",
      "citation": "1927 12 Tax Cas. 1102",
      "treatment": "referred",
      "relevance": "Compensation to get rid of contract held trading profit."
    },
    {
      "case_name": "Van den Berghs Ltd. v. Clark",
      "citation": "1935 19 Tax Cas. 390",
      "treatment": "followed",
      "relevance": "Cancellation of agreements relating to whole structure of profit-making apparatus; capital receipt."
    },
    {
      "case_name": "Income-tax Commissioner v. Shaw Wallace Co.",
      "citation": "1932 L.R. 59 I.A. 206",
      "treatment": "referred",
      "relevance": "Payment as solatium."
    },
    {
      "case_name": "Commissioner of Income-tax v. Vazir Sultan & Sons",
      "citation": "1959 Supp. 2 S.C.R. 375",
      "treatment": "referred",
      "relevance": "General principles on nature of receipt."
    },
    {
      "case_name": "Godrej & Co. v. Commissioner of Income-tax",
      "citation": "1960 1 S.C.R. 527",
      "treatment": "referred",
      "relevance": "General principles."
    },
    {
      "case_name": "Commissioner of Income-tax v. Jairam Valji",
      "citation": "1959 35 I.T.R. 148",
      "treatment": "referred",
      "relevance": "General principles."
    },
    {
      "case_name": "Senairam Doongarmall v. Commissioner of Income-tax",
      "citation": "1961 42 I.T.R. 392",
      "treatment": "referred",
      "relevance": "General principles; did not adopt 'solatium'."
    },
    {
      "case_name": "Chibbett v. Joseph Robinson & Sons",
      "citation": "1924 9 T.C. 49",
      "treatment": "referred",
      "relevance": "No magic in 'testimonial'; solatium term."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 10(5A)",
        "Section 4(3)(vii)",
        "Section 12",
        "Section 4"
      ],
      "relevance": "Determined nature of receipt: not compensation u/s 10(5A); not taxable income; exempt if casual/non-recurring u/s 4(3)(vii) but not needed as not income."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; answers to all three questions against the Department: receipt not taxable, s.4(3)(vii) not applicable as not income, not u/s 10(5A)(d). High Court judgment reversed.",
    "relief_granted": "Appeal succeeds; receipts not taxable.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The agreement constituted a source and a monopoly, and which gave an enduring advantage to a trader in his trade. The loss of such an agreement must be regarded as falling on the capital asset.\"",
      "speaker": "court",
      "significance": "Classifies agreement as capital asset, payment as capital receipt."
    },
    {
      "text": "\"The payment was in token of appreciation and was not related to any business done or to loss of profits and it was not recompense for services past or future.\"",
      "speaker": "court",
      "significance": "Determines true nature of payment as non-taxable gratitude payment."
    },
    {
      "text": "\"It is not the motive of the person who pays that is relevant. More relevance attaches to the nature of the receipt in the hands of the person who receives it.\"",
      "speaker": "court",
      "significance": "Key principle for characterizing receipts."
    }
  ],
  "_case_id": "1962_172",
  "_label": 1,
  "_text_length": 35675,
  "_extracted_at": "2026-02-10T19:58:51.033288"
}