{
  "metadata": {
    "case_name": "Appellants v. State of Madhya Pradesh",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "SINHA, C. J."
    ],
    "case_number": "Civil Appeal No. 645/1961",
    "date_of_judgment": "1962-11-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Haji Syed Zahiruddin of Bhopal held a mining lease-Ex. P-2-dated May 29, 1923 in respect of 189-76 acres of land in the district of Chindwara, for extracting coal.",
      "type": "background",
      "date": "1923-05-29",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellants took an assignment of that lease by Ex. P1 dated September 4, 1940.",
      "type": "background",
      "date": "1940-09-04",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "There were coal bearing areas adjacent to the area covered by the lease aforesaid. The appellants were anxious to acquire those adjacent collieries from their respective owners.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The transfers in favour of the appellants could not take place without the sanction of the State Government.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After protracted correspondence and negotiations, the Government agreed to grant the necessary sanction to the transfer of those adjacent lands to the appellants subject to the condition that they took a consolidated lease in respect of the whole additional area at an enhanced rate of royalty.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellants entered into an agreement with the Government on January 11, 1946 Ex.P3 by which the rate of royalty payable to Government was raised from Rs. 5/-to Rs. 10/-per ton.",
      "type": "material",
      "date": "1946-01-11",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Though no formal lease deed was executed, the appellants worked the mines with the permission of the Government during the period October 27, 1947 to June 30, 1949.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In respect of the coal thus extracted, the appellants paid to the Government the sum of Rs. 40865/-, including interest, by way of royalty.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The plaintiffs paid the aforesaid sum under protest in February-March, 1950.",
      "type": "material",
      "date": "1950-02",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The plaintiffs commenced the present action in February 1951, for a declaration that they were not bound by the terms of the agreement dated January 11, 1946, and that, therefore, they were not liable to pay to Government any sum in excess of that fixed by the lease of 1923, and by the lease of January 21, 1944, in respect of lands transferred to them. They also claimed an injunction against the defendant, the State of Madhya Pradesh, and refund of the said amount of Rs. 40865/- plus interest.",
      "type": "procedural",
      "date": "1951-02",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Additional District Judge, Chindwara, in Civil Suit No. 3-A of 1951, decided on September 25, 1952, decreed the plaintiff's claim for Rs. 40865/- and interest.",
      "type": "procedural",
      "date": "1952-09-25",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Madhya Pradesh High Court in First Appeal No. 181/52, judgment dated April 20, 1957, reversed the trial court and dismissed the suit.",
      "type": "procedural",
      "date": "1957-04-20",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court granted certificate on April 16, 1958 under Art. 133 of the Constitution.",
      "type": "procedural",
      "date": "1958-04-16",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the agreement dated January 11, 1946 (Ex. P3) was void as it was in contravention of r. 50 of the Mining Rules of 1913",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the agreement was in contravention of s. 4 of the Mines and Minerals Regulation and Development Act XIII of 1948",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the agreement was entered into under the influence of misrepresentation by Government that it was going to adopt a new policy in respect of mining leases, including grant of leases at enhanced royalty",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The agreement aforesaid was void as it was in contravention of r. 50 of the Mining Rules of 1913, as also that the same was in contravention of s. 4 of the Mines and Minerals Regulation and Development Act XIII of 1948.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": "r. 50 Mining Rules 1913; s. 4 Mines and Minerals Regulation and Development Act 1948"
    },
    {
      "id": "pa2",
      "text": "A representation was made by the Government in the correspondence that passed between the parties that Government was going to adopt a new policy in respect of mining leases, including grant of leases at enhanced royalty. The agreement had been entered into under the influence of that misrepresentation and was, therefore, not enforceable against them.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The Rules of 1913 were in terms imperative and had statutory force which bound the State Government, and that any lease or agreement entered into between the parties in violation of the terms of these Rules would be wholly void.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Mining Rules 1913"
    },
    {
      "id": "pa4",
      "text": "The terms imposed upon the appellants by the State would amount to deprivation of property without the authority of law.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Art. 31(1) of the Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Mineral Rules of 1913 had no binding effect after the Constitution Act of 1935, so far as the Provinces were concerned those Rules were mere departmental instructions for the guidance of subordinate officers of the Government and that the Government was free to make its own bargain in respect of fresh leases.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Government of India Act 1935"
    },
    {
      "id": "ra2",
      "text": "The Mines and Minerals Regulation and Development Act of 1948, read with the Rules made thereunder, did not apply to the leases in question as these Rules came into force later.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Mines and Minerals Regulation and Development Act 1948"
    },
    {
      "id": "ra3",
      "text": "There was no misrepresentation made by Government to the plaintiffs, though it was true that Government had intended to promulgate fresh rules which envisage revised scales of royalty, but which ultimately did not materialise.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Those rules were promulgated by the Governor General in Council, under the sanction of the Secretary of State for India in Council, and as such they were binding on the officials of the Government as departmental instructions, but were not binding on the Government itself.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Mining Rules 1913, Rule 1"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 1 of Mining Rules 1913 makes it clear that the Government concerned may make an exception to the general rule laid down in the rule. No license to prospect for minerals or lease of mines and minerals can be granted by any Local Government otherwise than in accordance with these rules, except with the previous sanction of the Secretary of State for India in Council, or with that of the Governor-General in Council under any general or special authority which he may have received in this behalf from the Secretary of State in Council.",
      "addresses_issue": "i1",
      "key_observation": "Exceptions possible by higher authority; post 1935 by Governor, who was lessor here (Ex. P3), so presumed in interest of State."
    },
    {
      "id": "cr2",
      "text": "The Rules of 1913 were not statutory.",
      "addresses_issue": "i1",
      "key_observation": "Counsel conceded not statutory."
    },
    {
      "id": "cr3",
      "text": "The Act of 1948 came into force on September 8, 1948, and the Mineral Concession Rules, 1949, came into effect on October 25, 1949. These rules apparently have no retrospective effect. Section 4: No mining lease shall be granted after the commencement of this Act except in accordance with the rules made under this Act.",
      "addresses_issue": "i2",
      "key_observation": "Agreement finalised January 1946, operations Oct 1947-June 1949 before rules effective."
    },
    {
      "id": "cr4",
      "text": "It is a little difficult to appreciate this ground of attack. The agreement is not questioned on the ground that there was any undue influence or coercion exercised by the grantor in insisting upon the more onerous terms under the agreement. As pointed out by the High Court, the appellants were in a hurry to take the additional area and work the coal mines on terms which were mutually agreed between the parties.",
      "addresses_issue": "i3",
      "key_observation": "No misrepresentation vitiating contract; entered with eyes open."
    },
    {
      "id": "cr5",
      "text": "The State has not deprived them of any property. What they have paid to the Government was realisable under the terms of the contract, which is not vitiated.",
      "addresses_issue": "i1",
      "key_observation": "No violation of Art. 31(1)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The agreement dated January 11, 1946 (Ex. P3) is valid and binding; not void under Mining Rules 1913.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Mines and Minerals Regulation and Development Act 1948 and Rules 1949 do not apply retrospectively to the agreement and operations prior to October 25, 1949.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No misrepresentation vitiating the agreement; parties entered with eyes open.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Mining Rules 1913",
      "sections": [
        "Rule 1",
        "r. 50"
      ],
      "relevance": "Governed granting of leases; exceptions allowed by higher authority; not statutory and not binding on Government itself"
    },
    {
      "name": "Mines and Minerals (Regulation and Development) Act, 1948",
      "sections": [
        "s. 4",
        "s. 5"
      ],
      "relevance": "No mining lease granted after commencement except per rules; rules (Mineral Concession Rules 1949) effective Oct 25, 1949, no retrospective effect"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 133",
        "Art. 31(1)"
      ],
      "relevance": "Certificate for appeal; no deprivation of property without authority of law"
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [],
      "relevance": "Constitutional changes substituted Governor for Secretary of State/Governor-General for making exceptions under Rules 1913"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the High Court's decree dismissing the suit. The agreement Ex. P3 is held valid and binding, plaintiffs not entitled to declaration, injunction or refund of Rs. 40865/- paid under protest.",
    "relief_granted": "None",
    "costs": "Costs throughout (as per High Court)"
  },
  "key_quotes": [
    {
      "text": "\"Rule 1, which runs as follows, itself makes it clear that the Government concerned may make an exception to the general rule laid down in the rule.\"",
      "speaker": "court",
      "significance": "Core reasoning on why Mining Rules 1913 did not invalidate the agreement"
    },
    {
      "text": "\"They, with their eyes open and after thoroughly discussing the matter between themselves and the Government, had entered into those terms of agreement.\"",
      "speaker": "court",
      "significance": "Rejects misrepresentation claim; upholds contract validity"
    },
    {
      "text": "\"Ultimately, he had to concede that the Rules were not statutory.\"",
      "speaker": "court",
      "significance": "Undermines petitioner's primary argument on statutory force of Rules 1913"
    }
  ],
  "_case_id": "1962_227",
  "_label": 0,
  "_text_length": 12997,
  "_extracted_at": "2026-02-10T19:59:27.448242"
}