{
  "metadata": {
    "case_name": "Madan Gopal v. Respondents",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 329 of 1960",
    "date_of_judgment": "1962-08-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant Madan Gopal was appointed an Inspector of Consolidation by order dated October 5, 1953 of the Settlement Commissioner of the Patiala and East Punjab States Union. The appointment was on temporary basis and terminable with one month's notice.",
      "type": "background",
      "date": "1953-10-05",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On February 5, 1955, the appellant was served with a charge-sheet by the Settlement Officer, Bhatinda that he the appellant had received Rs. 150/- as illegal gratification from one Darbara Singh and had demanded Rs. 30/- as illegal gratification from one Ude Singh. The appellant was called upon to show cause why disciplinary action should be taken against him if the allegations in the charge sheet were proved.",
      "type": "material",
      "date": "1955-02-05",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellant submitted his explanation to the charge-sheet.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On February 22, 1955, the Settlement Officer submitted his report to the Deputy Commissioner Bhatinda, that the charge relating to receipt of illegal gratification from Darbara Singh was proved.",
      "type": "procedural",
      "date": "1955-02-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Deputy Commissioner by order dated March 17, 1955 ordered that the services of Madan Gopal Inspector be terminated forthwith and that in lieu of notice he will get one month's pay as required by the Rules.",
      "type": "material",
      "date": "1955-03-17",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant requested the Deputy Commissioner to review the order, and also submitted a memorial to the Minister for Revenue affairs. Having failed to obtain relief.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The appellant applied to the High Court of Pepsu for a writ under Art. 226 of the Constitution quashing the order dated March 17, 1955 on the ground inter alia that the order of dismissal from service was in contravention of Art. 311 of the Constitution as no reasonable opportunity to show cause against the order of dismissal was at all given. He also challenged the authority of the Settlement Officer to hold the enquiry and submitted that the procedure followed by that Officer in making the enquiry was irregular.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The petition was transferred to the High Court of Punjab on the reorganization of the State of Punjab.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Mr. Justice Bishan Narain who heard the application issued the writ prayed for, because, in his view, the order of termination of employment was in the nature of an order of punishment and the provisions of Art. 311(2) had not been complied with by the Enquiry Officer, the Deputy Commissioner or the Settlement Commissioner, the order was invalid.",
      "type": "procedural",
      "date": "1958-10-28",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "In appeal under the Letters Patent, the order was reversed by a Division Bench of the High Court. The High Court held that the appellant was a temporary servant and had no right to hold the post he was occupying and by the impugned order the appellant was not dismissed or removed from service, but his employment was terminated in exercise of authority reserved under the terms of employment, and no penalty was imposed upon the appellant.",
      "type": "procedural",
      "date": "1958-10-28",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The appellant was given an opportunity to make his defence and it appears that witnesses in support of the charge and in defence were examined before the Settlement Officer.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The Settlement Officer reported that on the evidence he was satisfied that the appellant had received Rs. 150/- as illegal gratification and that the appellant did not enjoy good reputation and was a person of doubtful integrity.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "In the written statement filed by the State in the High Court it was expressly admitted that the employment of the appellant was terminated on March 17, 1955.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order terminating the appellant's services was in the nature of punishment attracting the protection of Article 311(2) of the Constitution, given that it followed an enquiry into allegations of misconduct and cast a stigma on the appellant.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the appellant, as a temporary employee, was entitled to the protection of Article 311(2) despite the terms of his appointment allowing termination with one month's notice.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order of termination from service was in contravention of Art. 311 of the Constitution as no reasonable opportunity to show cause against the order of dismissal was given.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Article 311 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "Challenged the authority of the Settlement Officer to hold the enquiry and submitted that the procedure followed by that Officer in making the enquiry was irregular.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The appellant was a temporary servant and had no right to hold the post; employment was terminated in exercise of authority under terms of employment, without imposing penalty.",
      "supporting_facts": [
        "f1",
        "f10"
      ],
      "legal_basis": "Terms of appointment"
    },
    {
      "id": "ra2",
      "text": "Enquiry was made for the purpose of ascertaining whether the appellant who was a temporary employee should be continued in service or discharged under the terms of his employment, and protection of Art. 311(2) not attracted.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "State of Orissa v. Ram Narayan Das"
    },
    {
      "id": "ra3",
      "text": "The order dated March 17, 1955, was not the effective order; effective order being one passed by the Settlement Officer on March 30, 1955.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The termination amounted to casting a stigma affecting his future career because a charge-sheet was served alleging receipt and demand of illegal gratification, enquiry held, and termination followed finding of proof.",
      "addresses_issue": "i1",
      "key_observation": "Such a termination amounted to casting a stigma affecting his future career."
    },
    {
      "id": "cr2",
      "text": "Citing State of Bihar v. Gopi Kishore Prasad: If instead of terminating service without enquiry, employer holds enquiry into alleged misconduct, termination is by way of punishment as it puts stigma on competence affecting future career; entitled to Art. 311(2) protection.",
      "addresses_issue": "i1",
      "key_observation": "Principle applies to temporary employees as much as probationers."
    },
    {
      "id": "cr3",
      "text": "Protection of Art. 311(2) applies as much to temporary public servants as to permanent; appellant not given reasonable opportunity against proposed action.",
      "addresses_issue": "i2",
      "key_observation": "Art. 311(2) violated."
    },
    {
      "id": "cr4",
      "text": "Rejects contention that effective order was by Settlement Officer on March 30, 1955; record shows termination on March 17, 1955, admitted by State.",
      "addresses_issue": "i1",
      "key_observation": "No such order of March 30 on record."
    },
    {
      "id": "cr5",
      "text": "Distinguishes State of Orissa v. Ram Narayan Das: There enquiry was to ascertain fitness for confirmation, not into misconduct for punishment; here enquiry was into misdemeanour for disciplinary action including dismissal.",
      "addresses_issue": "i1",
      "key_observation": "Enquiry here was punitive in nature."
    },
    {
      "id": "cr6",
      "text": "Whether order is by way of punishment determined by tests in Parshotam Lal Dhingra case.",
      "addresses_issue": "i1",
      "key_observation": "Fact of holding enquiry not decisive; purpose and effect decisive."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Termination of service of temporary employee following enquiry into misconduct allegations, resulting in stigma, is punitive and attracts Art. 311(2) protection requiring reasonable opportunity.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Art. 311(2) applies to temporary public servants; here no reasonable opportunity given, so order invalid.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Bihar v. Gopi Kishore Prasad",
      "citation": "A.I.R. 1960 S.C. 689",
      "treatment": "followed",
      "relevance": "Third proposition: Termination after enquiry into misconduct is punitive, entitling to Art. 311(2) protection, applies to temporary employees."
    },
    {
      "case_name": "State of Orissa v. Ram Narayan Das",
      "citation": "1961 1 S.C.R. 606",
      "treatment": "distinguished",
      "relevance": "Enquiry there for confirmation fitness, not misconduct punishment; differs from punitive enquiry here."
    },
    {
      "case_name": "Parshotam Lal Dhingra",
      "citation": "1958 S.C.R. 828",
      "treatment": "referred",
      "relevance": "Tests to determine if termination is by way of punishment."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 311"
      ],
      "relevance": "Art. 226 for writ petition; Art. 311(2) requires reasonable opportunity before dismissal/removal; violated here."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court allowed the appeal, holding that the termination order was punitive, violated Art. 311(2) as no reasonable opportunity was given, reversing the Division Bench of the High Court.",
    "relief_granted": "Quashing of termination order dated March 17, 1955 implied by upholding single judge's writ.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"But if instead of terminating such a persons service without any enquiry, the employer chooses to hold an enquiry into his alleged misconduct... the termination of service is by way of punishment, because it puts a stigma on his competence and thus affects his future career.\"",
      "speaker": "court",
      "significance": "Core principle from Gopi Kishore Prasad applied to temporary employees."
    },
    {
      "text": "\"It is not well-settled that the protection of Art. 311(2) of the Constitution applies as much to a temporary public servant as to permanent public servants.\"",
      "speaker": "court",
      "significance": "Establishes Art. 311(2) protection for temporary servants."
    },
    {
      "text": "\"Such a termination amounted to casting a stigma affecting his future career.\"",
      "speaker": "court",
      "significance": "Determines nature of termination as punitive."
    }
  ],
  "_case_id": "1962_59",
  "_label": 1,
  "_text_length": 9188,
  "_extracted_at": "2026-02-10T19:57:11.570036"
}