{
  "metadata": {
    "case_name": "Board of High School and Intermediate Education, U.P. v. Respondents",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 132 of 1959",
    "date_of_judgment": "1962-02-06"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The three respondents were students of G. S. Hindu Intermediate College at Sikandrarao and appeared at the Intermediate Commerce Examination conducted by the appellant in the year 1954.",
      "type": "background",
      "date": "1954",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On June 12, 1954, the result of the examination was published in newspapers and the three respondents passed in the second division.",
      "type": "material",
      "date": "1954-06-12",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Thereafter they prosecuted further studies.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In December 1954, their fathers and guardians received information from the Principal of the G. S. Hindu Intermediate College that the Examinations Committee of the appellant (hereinafter referred to as the Committee) had cancelled the result of the respondents for the examination of 1954 and further that they had been debarred from appearing at the examination of 1955.",
      "type": "material",
      "date": "1954-12",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Committee had never afforded any opportunity to the respondents to rebut the allegations made against them and they were never informed about the nature of the unfair means used by them in the said examination.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The first thing they came to know was the resolution of the Committee canceling their results and debarring them from appearing in the examination of 1955.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The respondents filed a writ petition in the Allahabad High Court contending violation of principles of natural justice and provisions of the U.P. Intermediate Education Act, No. II of 1921 and the U.P. Education Code.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The appellant opposed the application stating that respondents had used unfair means, cases reported to Committee under Regulations, thorough inquiry held, but no opportunity afforded to respondents.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f9",
      "text": "Learned Single Judge rejected the petition holding no duty to act judicially or statutory obligation to hear examinees.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Respondents appealed (Special Appeal No. 291 of 1955), heard by Dayal and Brijmohan Lall, JJ., who differed on whether hearing required even if administrative.",
      "type": "procedural",
      "date": "1956-03-23",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Third Judge (Agarwala, J.) held respondents entitled to hearing even if administrative, appeal allowed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Allahabad High Court granted certificate for appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Examinations Committee was required to afford an opportunity of hearing to the respondents before cancelling their results and debarring them, even if acting administratively.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Committee has a duty to act judicially under the Act and Regulations when dealing with cases of examinees using unfair means.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Where a body is acting merely administratively, it is not necessary to give a hearing; principles of natural justice including audi alteram partem apply only to judicial or quasi-judicial bodies.",
      "supporting_facts": [
        "f5",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No express duty cast by Act or Regulations to act judicially; large number of cases make it impractical.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "U.P. Intermediate Education Act, No. II of 1921; Regulations"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Committee under duty to act judicially considering circumstances; entitled to opportunity to meet case of unfair means before action.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Principles of natural justice; U.P. Intermediate Education Act, No. II of 1921; U.P. Education Code"
    },
    {
      "id": "ra2",
      "text": "Mere absence of express provision in Act/Regulations not determinative; duty inferred from nature of rights affected.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Committee acts quasi-judicially under Rule 1(1) Chap. VI as it must objectively determine facts like use of unfair means based on materials before awarding penalty; serious consequences require hearing.",
      "addresses_issue": "i2",
      "key_observation": "Even without two contesting parties, duty to act judicially arises from statute's scheme, nature of rights, and effects on examinee."
    },
    {
      "id": "cr2",
      "text": "Principles of natural justice apply; examinee must be heard as Committee depends on materials placed before it.",
      "addresses_issue": "i1",
      "key_observation": "No opportunity given here, vitiating the order."
    },
    {
      "id": "cr3",
      "text": "High Court wrong that action merely administrative, but correct in allowing writ for lack of hearing.",
      "addresses_issue": "i1",
      "key_observation": "Quasi-judicial body must follow natural justice."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Examinations Committee acts quasi-judicially under Rule 1(1) Chap. VI and must give opportunity of hearing to examinee before penal action.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Failure to provide hearing vitiates the order canceling results and debarring respondents.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Province of Bombay v. Kusaldas S. Advani",
      "citation": "1950 S.C.R. 621",
      "treatment": "followed",
      "relevance": "Principles on what constitutes quasi-judicial act; duty to act judicially inferred from statute."
    },
    {
      "case_name": "Nagendra Nath Bora v. Commissioner of Hills Division",
      "citation": "1958 S.C.R. 1240",
      "treatment": "followed",
      "relevance": "Acting upon principles of quasi-judicial duty."
    },
    {
      "case_name": "Shri Radheshyam Khare v. State of Madhya Pradesh",
      "citation": "1959 S.C.R. 1440",
      "treatment": "followed",
      "relevance": "Acting upon principles of quasi-judicial duty."
    },
    {
      "case_name": "Gullapalli Nageswara Rao v. Andhra Pradesh State Road Transport Corporation",
      "citation": "1959 Supp. 1 S.C.R. 319",
      "treatment": "followed",
      "relevance": "Acting upon principles of quasi-judicial duty."
    },
    {
      "case_name": "Shivaji Nathubhai v. Union of India",
      "citation": "1960 2 S.C.R. 775",
      "treatment": "followed",
      "relevance": "Acting upon principles of quasi-judicial duty."
    },
    {
      "case_name": "R. v. Manchester Legal Aid Committee",
      "citation": "1952 2 Q.B. 413",
      "treatment": "referred",
      "relevance": "Duty to act judicially arises in widely different circumstances."
    },
    {
      "case_name": "Dipa Pal v. University of Calcutta",
      "citation": "A.I.R. 1952 Cal. 594",
      "treatment": "followed",
      "relevance": "Committee must act judicially and give hearing in similar circumstances."
    },
    {
      "case_name": "B.C. Das Gupta v. Bijoyranjan Rakshit",
      "citation": "A.I.R. 1953 Cal. 212",
      "treatment": "followed",
      "relevance": "Committee must act judicially and give hearing in similar circumstances."
    },
    {
      "case_name": "Local Government Board v. Arlidge",
      "citation": null,
      "treatment": "referred",
      "relevance": "Adequate opportunity to present case required; procedure depends on tribunal."
    }
  ],
  "statutes_cited": [
    {
      "name": "U.P. Intermediate Education Act, No. II of 1921",
      "sections": [
        "Section 7",
        "Section 13",
        "Section 14",
        "Section 15",
        "Section 20"
      ],
      "relevance": "Powers of Board to constitute committees, delegate powers, make regulations and bye-laws; no express duty to act judicially but inferred."
    },
    {
      "name": "Regulations under U.P. Intermediate Education Act",
      "sections": [
        "Chapter VI, Rule 1(1)"
      ],
      "relevance": "Duty of Examinations Committee to consider cases of unfair means etc. and award penalties; implicit requirement to act on materials and quasi-judicially."
    },
    {
      "name": "U.P. Education Code",
      "sections": [],
      "relevance": "Procedure alleged violated by Committee."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, holding that though the High Court erred in classifying the Committee's action as merely administrative, it correctly allowed the writ petition because no opportunity of hearing was given to the respondents, violating principles of natural justice as the Committee acts quasi-judicially.",
    "relief_granted": "Writ petition upheld; Committee's resolution canceling results and debarring respondents quashed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the principles of natural justice which require that the other party, namely, the examinee in this case must be heard, will apply to the proceedings before the Committee.\"",
      "speaker": "court",
      "significance": "Core holding on application of audi alteram partem."
    },
    {
      "text": "\"The effect of the decision of the Committee may in an extreme case blast the career of a young student for life and in any case will put a serious stigma on the examinee concerned.\"",
      "speaker": "court",
      "significance": "Justifies quasi-judicial duty due to serious consequences."
    },
    {
      "text": "\"if a statutory authority has power to do any act which will prejudicially affect the subject... the final determination of the authority will yet be a quasi-judicial act provided the authority is required by the statute to act judicially.\"",
      "speaker": "court",
      "significance": "Quotes Province of Bombay case on quasi-judicial test."
    }
  ],
  "_case_id": "1962_8",
  "_label": 0,
  "_text_length": 21982,
  "_extracted_at": "2026-02-10T19:56:35.854750"
}