{
  "metadata": {
    "case_name": "Muthavalli of Jumma Masjid, Mercara v. Ganapathi and others",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar, J."
    ],
    "case_number": "Civil Appeal No. 207 of 1956",
    "date_of_judgment": "1962-01-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "There was a joint family consisting of three brothers, Santhappa, Nanjundappa and Basappa. Santhappa died unmarried, Basappa died in 1901 leaving widow Gangamma, Nanjundappa died in 1907 leaving widow Ammakka who succeeded to all family properties.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On death of Ammakka in 1910, estate devolved on Basappa, Mallappa and Santhappa, sisters' grandsons of Nanjundappa as next reversioners.",
      "type": "background",
      "date": "1910",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On August 5, 1900, Nanjundappa and Basappa executed usufructuary mortgage over suit properties to one, assigned to Appanna Shetty who filed O.S. 9 of 1903 resulting in compromise decree allowing enjoyment till August 1920, thereafter revert to family.",
      "type": "material",
      "date": "1900-08-05",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "By sale deed Ex. III dated November 18, 1920, three reversioners Basappa, Nallappa and Santhappa sold suit properties to Ganapathi (under whom respondents claim) for Rs. 2000, reciting properties belonged to joint family of Nanjundappa and Basappa, devolved on them as reversioners after Ammakka's death.",
      "type": "material",
      "date": "1920-11-18",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On March 12, 1921, vendors executed deed Ex. IV rectifying Ex. III by including certain items left out by oversight.",
      "type": "material",
      "date": "1921-03-12",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Ganapathi sued for possession based on Ex. III and IV; contested by Gangamma claiming properties were self-acquisitions of her husband Basappa.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Subordinate Judge of Coorg, District Judge on appeal, and Judicial Commissioner in second appeal held for Gangamma that properties were self-acquisitions.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Gangamma died on February 17, 1933, before second appeal finally disposed.",
      "type": "material",
      "date": "1933-02-17",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Ganapathi applied to revenue authorities to transfer patta from Gangamma to himself per Ex. III; appellant intervened claiming Jumma Masjid entitled under gift by Gangamma on September 5, 1932, and release deed by Santhappa on March 3, 1933 relinquishing half-share for Rs. 300.",
      "type": "procedural",
      "date": "1933",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Revenue authorities by order Ex. II dated September 9, 1933 declined appellant's title and directed patta to Ganapathi; Ganapathi got possession.",
      "type": "procedural",
      "date": "1933-09-09",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant instituted suit on January 2, 1945 for recovery of half-share in properties held by Gangamma and mesne profits, basing title on gift by Gangamma Sep 5, 1932 and release Ex. A by Santhappa March 3, 1933; claimed vendors' transfer void as spes successionis during Gangamma's life.",
      "type": "procedural",
      "date": "1945-01-02",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Respondents' defence: Santhappa estopped as sold representing present title as reversioner of Nanjundappa; appellant gets no title under Ex. A.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "District Judge of Coorg held gift not established (abandoned in High Court), and Ganapathi got good title under s.43 TPA as acted on representation; dismissed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "High Court Madras appeal referred to Full Bench due to conflict; agreed purchaser acted on representation of present interest, not mere spes; s.43 applied, title passed on Gangamma's death 1933; dismissed appeal.",
      "type": "procedural",
      "date": "1952-11-05",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Leave to appeal to Supreme Court granted by High Court of Mysore under Art. 133(1)(c).",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a transfer of property for consideration made by a person who represents that he has a present and transferable interest therein, while he possesses in fact only a spes successionis, is within the protection of s.43 of the Transfer of Property Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "S.43 must be read subject to s.6(a) TPA which prohibits transfer of spes successionis; applying s.43 to such cases nullifies s.6(a); s.43 limited to cases other than s.6(a); no estoppel against statute; illustration to s.43 repugnant.",
      "supporting_facts": [
        "f4",
        "f11"
      ],
      "legal_basis": "Transfer of Property Act s.6(a), s.43"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Ganapathi purchased under Ex. III on faith of representation of present title as reversioners after Ammakka's death; estopped from denying; good title under s.43 TPA when title acquired on Gangamma's death; Ex. A no title to appellant.",
      "supporting_facts": [
        "f4",
        "f5",
        "f8",
        "f14"
      ],
      "legal_basis": "Transfer of Property Act s.43"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S.43 applies whenever person transfers property without title on representation of present transferable interest, transferee takes for consideration; subsequent acquisition by transferor feeds title to transferee if contract subsists; absolute, no difference if defect is no interest or spes successionis.",
      "addresses_issue": "i1",
      "key_observation": "S.43 enacts rule of estoppel (evidence), s.6(a) substantive law prohibiting transfer simpliciter of spes; different fields, no conflict."
    },
    {
      "id": "cr2",
      "text": "Reject importing exception into s.43 for s.6(a); would rewrite section; illustration to s.43 covers spes (Hindu son sells father's retained field, inherits); not repugnant.",
      "addresses_issue": "i1",
      "key_observation": "Illustrations relevant/value in construction unless clearly repugnant."
    },
    {
      "id": "cr3",
      "text": "S.43 protects transferees for consideration acting on representation whether fraudulent/erroneous; immaterial if transferor bona fide; distinguishes minors' cases (capacity not title).",
      "addresses_issue": "i1",
      "key_observation": "Preponderance of authority favors application to misrepresented present title even if actually spes."
    },
    {
      "id": "cr4",
      "text": "Overrules Official Assignee Madras v. Sampath Naidu; approves Alamanaya Kunigari Nabi Sab v. Murukuti Papiah, Shyam Narain v. Mangal Prasad etc.; distinction: if transfer professes spes, void under s.6(a); if represents present interest, s.43 applies.",
      "addresses_issue": "i1",
      "key_observation": "Here, vendors represented present title as reversioners post-Ammakka."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "When a person transfers property representing present interest whereas actually only spes successionis, transferee entitled to benefit of s.43 if took on faith of representation for consideration.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Santhappa represented present entitlement in Ex. III, purchaser acted thereon; title acquired under s.43 on Gangamma's death Feb 17, 1933; Ex. A no title to appellant.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Vickers v. Evans",
      "citation": null,
      "treatment": "referred",
      "relevance": "Not entitled to read words into Act unless clear reason within four corners."
    },
    {
      "case_name": "Alamanaya Kunigari Nabi Sab v. Murukuti Papiah",
      "citation": null,
      "treatment": "followed",
      "relevance": "S.43 applies to representation of present title even if actually spes; distinguishes professing transfer of chance."
    },
    {
      "case_name": "Official Assignee, Madras v. Sampath Naidu",
      "citation": null,
      "treatment": "overruled",
      "relevance": "Erroneously held s.43 not apply to spes even misrepresented as present; ignores estoppel principle."
    },
    {
      "case_name": "Shyam Narain v. Mangal Prasad",
      "citation": null,
      "treatment": "followed",
      "relevance": "S.43 applies where erroneous representation of full ownership, transferee acts thereon."
    },
    {
      "case_name": "Mahomed Syedol Ariffin v. Yeoh Oai Gark",
      "citation": null,
      "treatment": "referred",
      "relevance": "Value of illustrations in construction; not reject unless repugnant."
    },
    {
      "case_name": "Ananda Mohan Roy v. Gour Mohan Mullick",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Prohibits enforcing contracts to transfer spes; not applicable to transfers representing present title."
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act",
      "sections": [
        "Section 43",
        "Section 6(a)"
      ],
      "relevance": "S.43 protects transferee where transferor represents present title actually lacking (including spes), subsequent acquisition feeds title; s.6(a) prohibits direct transfer of spes but not overridden."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(c)"
      ],
      "relevance": "Leave to appeal granted."
    },
    {
      "name": "Contract Act",
      "sections": [
        "Section 23"
      ],
      "relevance": "Mentioned in context of void contracts for spes transfers."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed affirming High Court; respondents' title under Ex. III and IV prevails over appellant's under Ex. A by operation of s.43 TPA upon acquisition of title on Gangamma's death.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The sole point for determination in this appeal is, whether a transfer of property for consideration made by a person who represents that he has a present and transferable interest therein, while he possesses, in fact, only a spes successionis, is within the protection of s. 43 of the Transfer of Property Act.\"",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "\"Section 6(a) enacts a rule of substantive law, while s. 43 enacts a rule of estoppel which is one of evidence. The two provisions operate on different fields, and under different conditions.\"",
      "speaker": "court",
      "significance": "Resolves apparent conflict between sections."
    },
    {
      "text": "\"We accordingly hold that when a person transfers property representing that he has a present interest therein, whereas he has, in fact, only a spes successionis, the transferee is entitled to the benefit of s. 43.\"",
      "speaker": "court",
      "significance": "Key holding on s.43 applicability."
    }
  ],
  "_case_id": "1962_0",
  "_label": 0,
  "_text_length": 26434,
  "_extracted_at": "2026-02-10T19:56:39.843258"
}