{
  "metadata": {
    "case_name": "Jitmal Bhuramal v. Commissioner of Income-tax",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Messrs. Jitmal Bhuramal is a Hindu undivided family consisting of four sons and grandsons of Bhuramal: Hiralal, Gulzarilal, Kunjlal, Madanlal, and Gobhardanlal (son of Gulzarilal).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The family does business in grains, kirana etc. at Madhupur under two names: Jitmal Bhuramal and Bhuramal Hiralal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The family through its karta (Hiralal) was a partner in firm Hiralal Gulzarilal with 12 annas share; Rameshwar Lal (stranger) had 4 annas share.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Assessment year 1953-54.",
      "type": "procedural",
      "date": "1953-54",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Hiralal (karta) entered into two agreements with junior members: they agreed to serve HUF on monthly payments - Rs.200 to Gulzarilal, Rs.150 each to Kunjlal and Madanlal, Rs.100 to Gobhardanlal.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "By first agreement, Gulzarilal and Madanlal to look after HUF interests in the partnership; Kunjlal and Gobhardanlal to look after HUF business.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In year of account for 1953-54, Rs.6,600 paid as remuneration to four junior members: Rs.3,850 to Gulzarilal and Madanlal for services to partnership; Rs.2,750 to Kunjlal and Gobhardanlal for services to HUF.",
      "type": "material",
      "date": "1953-54",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Income-tax Officer, Santhal Parganas, by order dated December 31, 1953, allowed only Rs.50 per month to Gobhardanlal as expense; disallowed rest of Rs.6,000 claim under section 10(2)(xv).",
      "type": "procedural",
      "date": "1953-12-31",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellate Assistant Commissioner confirmed ITO order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Income-tax Appellate Tribunal allowed deduction of full remuneration to Gobhardanlal and Kunjlal but disallowed Rs.3,850 to Gulzarilal and Madanlal, as they rendered service to the firm (separate entity), not to HUF.",
      "type": "procedural",
      "date": "1955-09-28",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Assessee applied under section 66(1); Tribunal referred question to High Court of Patna under section 66(2).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court answered question against assessee; appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in the facts and circumstances of the case, the assessee, namely, the Hindu undivided family, who is a partner in the partnership business of Hiralal Gulzarilal, is entitled to a deduction of Rs. 3,850 from the assessment of income-tax for the relevant year under section 10(2)(xv) of the Income-tax Act?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in apprehending the finding of fact given by the Tribunal.",
      "supporting_facts": [
        "f10",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Tribunal finding that Gulzarilal and Madanlal rendered service to the firm (separate entity), not to HUF, makes assessee's case difficult.",
      "addresses_issue": "i1",
      "key_observation": "HUF allowed to deduct salaries to members if for commercial expediency and service to the family."
    },
    {
      "id": "cr2",
      "text": "Partnership is separate entity; HUF as partner through karta has no place in partnership; junior members serving partnership serve separate entity.",
      "addresses_issue": "i1",
      "key_observation": "Service to partnership cannot be service to HUF for deduction under section 10(2)(xv)."
    },
    {
      "id": "cr3",
      "text": "High Court rightly answered question in negative, though for different reasons.",
      "addresses_issue": "i1",
      "key_observation": "Cannot be said to be wholly and exclusively for the HUF."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Hindu undivided family not entitled to deduct Rs.3,850 paid to Gulzarilal and Madanlal under section 10(2)(xv) as services were to the partnership firm, a separate entity.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dulichand Laxminarayan v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Partnership relation between persons; HUF or firm not a 'person' in partnership."
    },
    {
      "case_name": "Charandas Haridas v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Where HUF partner through karta, coparcenary has no place in partnership; karta is everything."
    },
    {
      "case_name": "Commissioner of Income-tax v. Nandlal Gandalal",
      "citation": null,
      "treatment": "followed",
      "relevance": "HUF as such cannot exercise control/management over partnership business."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "10(2)(xv)",
        "66(1)",
        "66(2)"
      ],
      "relevance": "Deduction for remuneration if wholly and exclusively for business; reference to High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court's answer to the reference question against the assessee, holding that payments to Gulzarilal and Madanlal for services to the partnership firm were not deductible by the HUF under section 10(2)(xv), though for reasons different from High Court.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A Hindu undivided family is allowed to deduct salaries paid to members of the family, if the payment is made as a matter of commercial or business expediency but the service must be to the family.",
      "speaker": "court",
      "significance": "Core principle for allowability of deduction under section 10(2)(xv)."
    },
    {
      "text": "If the coparcenary had no place in the partnership, any service to the partnership cannot be described as service to the Hindu undivided family.",
      "speaker": "court",
      "significance": "Distinguishes service to firm from service to HUF."
    }
  ],
  "_case_id": "1962_14",
  "_label": 0,
  "_text_length": 5967,
  "_extracted_at": "2026-02-10T19:56:38.028555"
}