{
  "metadata": {
    "case_name": "Executive Engineer, Golaghat v. Tulsi Singh",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "VENKATARAMA AIYAR, J."
    ],
    "case_number": "Civil Appeal No. 14 of 1962",
    "date_of_judgment": "1962-03-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The ferry at Neparpatty has been declared to be a public ferry under s.4 of the Northern India Ferries Act, 1878.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On January 23, 1961, the Executive Engineer, Golaghat, put up the lease of the ferry for the year 1961-62 for public auction under s.8 of the Act.",
      "type": "procedural",
      "date": "1961-01-23",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "At the auction, Tulsi Singh (first respondent) gave a bid for Rs. 4,200/-, Indra Deo Singh for Rs. 4,050/- and Phukan Chandra Gohain (second respondent) for Rs. 3,000/-.",
      "type": "material",
      "date": "1961-01-23",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Executive Engineer made the order: 'Sold to Shri Phukan Chandra Gohain at Rs. 3,000/- Rupees Three thousand only as the two other highest bidders fall in special List.'",
      "type": "procedural",
      "date": "1961-01-23",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Under Rule 19a, acceptance of the bid is subject to approval of the Chief Engineer, who must consider factors under Rule 19.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Chief Engineer approved the decision of the Executive Engineer dated January 23, 1961, and the sale to the second respondent was confirmed.",
      "type": "procedural",
      "date": "1961-01-23",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On February 6, 1961, the first respondent applied to the Chief Engineer for accepting his bid and settling the ferry on him.",
      "type": "procedural",
      "date": "1961-02-06",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "By order dated April 7, 1961, the Chief Engineer rejected the first respondent's petition.",
      "type": "procedural",
      "date": "1961-04-07",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On May 9, 1961, the first respondent filed a writ petition in the High Court of Assam under Art. 226 attacking the order of the Executive Engineer dated January 23, 1961, as contrary to the Act and Rules, praying settlement on him.",
      "type": "procedural",
      "date": "1961-05-09",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The Assam High Court by judgment dated July 11, 1961, set aside the settlement in favour of the second respondent as violative of s.8 and Rule 19, and declared the first respondent entitled to the settlement as highest bidder.",
      "type": "procedural",
      "date": "1961-07-11",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Special lists prepared by Government/Officers of persons suspected or confirmed connected with smuggling activities under prohibition policy; policy not to grant ferries etc. to such persons.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "First respondent prosecuted under s.4 of Assam Ganja and Bhang Prohibition Act but discharged.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appeal by special leave to Supreme Court from High Court judgment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the settlement by the Executive Engineer, Golaghat of the ferry at Neparpatty on the second respondent, Phuka Chandra Gohain, on January 23, 1961 was in accordance with the provisions of the Northern India Ferries Act, 1878 and the rules framed thereunder.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the High Court could direct settlement of the ferry to the first respondent as the highest bidder.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "If there are materials before the conducting officer on which he could refuse the highest bid under Rule 19, his decision is not liable to be reviewed by the Court.",
      "supporting_facts": [
        "f4",
        "f11"
      ],
      "legal_basis": "Section 8, Rule 19 of Northern India Ferries Act"
    },
    {
      "id": "pa2",
      "text": "First respondent in special list as suspected smuggler, hence not of good conduct; rejection justified under Rule 19 as putting smuggler in charge of ferry would help evade prohibition laws.",
      "supporting_facts": [
        "f4",
        "f11",
        "f12"
      ],
      "legal_basis": "Rule 19(iii)"
    },
    {
      "id": "pa3",
      "text": "Even if order invalid, Court cannot direct settlement to first respondent; matter for authorities to reconsider afresh.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Verappa Pillai v. Raman & Raman Ltd."
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Power of Executive Engineer derived from s.8 and Rules; sale generally to highest bidder, but officer may refuse highest for reasons recorded, considering factors in Rule 19.",
      "addresses_issue": "i1",
      "key_observation": "Discretion wide but not unrestricted; Chief Engineer must satisfy factors considered."
    },
    {
      "id": "cr2",
      "text": "Only ground for rejection: first respondent in special list; special list confidential, no disclosure of basis, sources or procedure; unsafe to rely solely for civil rights.",
      "addresses_issue": "i1",
      "key_observation": "Special list not material under s.35 Evidence Act; no other materials to reject highest bid."
    },
    {
      "id": "cr3",
      "text": "Prosecution ended in discharge; no independent opinion by Executive Engineer; rejection not in accordance with s.8 or Rule 19.",
      "addresses_issue": "i1",
      "key_observation": "High Court correct that rejection invalid."
    },
    {
      "id": "cr4",
      "text": "High Court erred in declaring first respondent entitled and directing settlement; such direction exceeds jurisdiction under Art.226.",
      "addresses_issue": "i2",
      "key_observation": "Authorities to reconsider afresh; as in Verappa Pillai case."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rejection of highest bid not in accordance with s.8 or Rule 19 due to lack of materials.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Court cannot direct settlement to highest bidder; remit to authorities for fresh decision.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Verappa Pillai v. Raman & Raman Ltd.",
      "citation": null,
      "treatment": "followed",
      "relevance": "High Court cannot direct grant of permits/settlement exceeding jurisdiction under Art.226; authorities to decide afresh."
    }
  ],
  "statutes_cited": [
    {
      "name": "Northern India Ferries Act, 1878",
      "sections": [
        "Section 4",
        "Section 8",
        "Section 12 (Rule 19)"
      ],
      "relevance": "Governs declaration of public ferries, letting tolls by auction, discretion to refuse highest bidder for recorded reasons considering specified factors."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for writ petition; limits High Court jurisdiction not to substitute executive decision."
    },
    {
      "name": "Assam Ganja and Bhang Prohibition Act",
      "sections": [
        "Section 4"
      ],
      "relevance": "First respondent prosecuted but discharged; materials insufficient even for administrative action."
    },
    {
      "name": "Indian Evidence Act, 1872",
      "sections": [
        "Section 35"
      ],
      "relevance": "Special list does not qualify as public document for reliance."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court upheld High Court's finding that settlement to second respondent invalid for non-compliance with s.8 and Rule 19 due to lack of materials justifying rejection of highest bid, but set aside High Court's direction declaring first respondent entitled to settlement; matter to be reconsidered afresh by authorities.",
    "relief_granted": "High Court judgment modified; authorities directed to reconsider settlement in accordance with law.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Sold to Shri Phukan Chandra Gohain at Rs. 3,000/- Rupees Three thousand only as the two other highest bidders fall in special List.\"",
      "speaker": "court",
      "significance": "Order of Executive Engineer showing sole ground for rejecting highest bid."
    },
    {
      "text": "\"While such lists might serve a purpose in guiding Criminal Intelligence Department, it will be unsafe to rely solely on them for deciding civil rights of persons.\"",
      "speaker": "court",
      "significance": "Rejects reliance on special list as basis for administrative discretion."
    },
    {
      "text": "\"such a direction was clearly in excess of the powers and jurisdiction of the High Court.\"",
      "speaker": "court",
      "significance": "Limits judicial interference in executive discretion per Verappa Pillai."
    }
  ],
  "_case_id": "1962_247",
  "_label": 0,
  "_text_length": 10449,
  "_extracted_at": "2026-02-10T20:00:15.840944"
}