{
  "metadata": {
    "case_name": "Maulud Ahmad v. State",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Criminal Appeal No. 97 of 1961",
    "date_of_judgment": "1962-11-13"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Some Railway officers and others, including one Chauhan, Railway Guard, went on two trollies towards Bhitra for a shoot. Chauhan had with him a double barrelled gun of twelve bore bearing No. 23727.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "On either side of the Railway line there were reserve forests of the State. Some of the group got down from the trollies, flashed a search-light and fired their guns. Two persons were shot dead.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Chauhan in order to create evidence in his favour got a report entered by the appellant, a Police Head Constable in the General diary of the Police Station purporting to have been taken on December 13, 1956, at 6.45 P.M. to the effect that Chauhan had deposited the said gun in the Police Station.",
      "type": "disputed",
      "date": "1956-12-13",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Many other manipulations were made by the appellant in the Police record to bring it in conformity with the said false entry.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Several persons, including Chauhan and the appellant were prosecuted under ss. 304-A, 201/109, 120-B and 218/109 of the Indian Penal Code, as well under s. 26 of the Indian Forest Act, and they were tried by the Additional Sessions Judge, Kheri.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant was also charged under s. 218 of the Indian Penal Code. All the accused were acquitted except the appellant who was convicted under s. 218 of the Indian Penal Code and sentenced to two years rigorous imprisonment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The appeal filed by him to the High Court was dismissed.",
      "type": "procedural",
      "date": "1961-02-01",
      "source": "high_court"
    },
    {
      "id": "f8",
      "text": "There were three guns with the party, including Chauhan's gun. That between miles 8 and 9 after the trollies were stopped and were placed by the side of the track, Ramdeo trolly man and Lala went away and shortly after that four gun-shots were heard and shortly after that Lala returned alone and then all the members of the party excepting Ramdeo returned to Mailani by the Cane Special.",
      "type": "admitted",
      "date": "1956-12-14 to 1956-12-15",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "That at the time when the four gun-shots were heard, Chauhan and Gupta were standing just near the track with their guns in their hands and, Dilawar, Amin and Hira also remained standing by the side of the track.",
      "type": "admitted",
      "date": "1956-12-14 to 1956-12-15",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Ramdeo and Chhotey were likely to have received gun-shot injuries between 7-20 to 7-40 P.M. in the night between December 14 and 15, 1956.",
      "type": "material",
      "date": "1956-12-14",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The learned Additional Sessions judge found that there was no direct or substantial evidence of any kind connecting any of the five accused, including Chauhan, with the death of Ramdeo and Chhotey.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Chauhan was in the shooting party that day, that he carried a gun with him, that two persons were killed with gun shots.",
      "type": "admitted",
      "date": "1956-12-14",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The appellant intentionally falsified the official record with a view to save Chauhan.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Chauhan's signature was not found against the entry of deposit of the gun on December 13, 1956, and also against the entry of the return of the gun on December 18, 1956.",
      "type": "admitted",
      "date": "1956-12-13",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Prosecution against the appellant having been launched three months after the entry is alleged to have been made by him in the Police diary.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "As Chauhan was acquitted of all the offences with which he was charged, the charge against the appellant under s. 218, Indian Penal Code, should fall with it.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "The prosecution against the appellant having been launched three months after the entry is alleged to have been made by him in the Police diary was barred by limitation under s. 42 of the Police Act.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "As Chauhan was acquitted of all the offences with which he was charged, the charge against the appellant under s. 218, Indian Penal Code, should fall with it due to alleged inconsistency and conflict between the acquittal of Chauhan and the conviction of the appellant.",
      "supporting_facts": [
        "f6",
        "f11"
      ],
      "legal_basis": "s. 218 Indian Penal Code"
    },
    {
      "id": "pa2",
      "text": "The prosecution against the appellant having been launched three months after the entry is alleged to have been made by him in the Police diary was barred by limitation under s. 42 of the Police Act.",
      "supporting_facts": [
        "f3",
        "f15"
      ],
      "legal_basis": "s. 42 Police Act"
    },
    {
      "id": "pa3",
      "text": "Appeal for reduction of sentence on the ground that the Head Constable was only a tool in the hands of a superior officer who might have been approached by Chauhan.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Whether Chauhan was guilty or not, at the time the false entries were made in the case diary there was every likelihood of Chauhan being prosecuted along with others for causing the death of Ramdeo and Chhotey. Indeed as expected Chauhan and others were prosecuted though they were acquitted. On the said facts the mere acquittal of Chauhan cannot displace the finding that the appellant manipulated the record with an intent thereby to save or knowing it to be likely that he would thereby save Chauhan from legal punishment.",
      "addresses_issue": "i1",
      "key_observation": "The mere fact that Chauhan was subsequently acquitted could not make it any the less an offence under s. 218 of the Indian Penal Code."
    },
    {
      "id": "cr2",
      "text": "The acquittal of Chauhan for the abetment of the offence under s. 218/109 does not affect the conviction of the appellant under s. 218 as the gravamen against Chauhan was abetment, and he was given benefit of doubt, but appellant's intent to save Chauhan was established.",
      "addresses_issue": "i1",
      "key_observation": "Whether the acquittal of Chauhan was correct or not, the conviction of the appellant is not inconsistent with that acquittal."
    },
    {
      "id": "cr3",
      "text": "Section 42 of the Police Act applies only to prosecutions for something done or intended to be done under the provisions of the Police Act or under general police powers given by the Act. It does not apply to prosecution under s. 218 IPC, which is under a different Act. By s. 36 of Police Act, s. 42 does not preclude prosecution under any other Act.",
      "addresses_issue": "i2",
      "key_observation": "The prosecution in the present case was for an offence under s. 218 of the Indian Penal Code which is an offence under a different act."
    },
    {
      "id": "cr4",
      "text": "There is nothing on the record to disclose that Chauhan approached any superior officer and that the appellant had manipulated the records on the dictation of such an officer. If a police officer manipulates the record such as police diary etc., it will be the end of honest criminal investigation. Such offences shall receive deterrent punishment. The punishment awarded errs more on the side of leniency.",
      "addresses_issue": null,
      "key_observation": "Pure surmise; nothing improbable in direct approach to appellant."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The conviction of the appellant under s. 218 IPC is not inconsistent with the acquittal of Chauhan.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Section 42 of the Police Act does not bar the prosecution under s. 218 IPC.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "The decision of the High Court is correct.",
      "resolves_issue": null,
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 218",
        "s. 304-A",
        "s. 201/109",
        "s. 120-B",
        "s. 218/109"
      ],
      "relevance": "Appellant convicted under s. 218 for falsifying record with intent to save person from legal punishment; others charged but acquitted."
    },
    {
      "name": "Indian Forest Act",
      "sections": [
        "s. 26"
      ],
      "relevance": "Accused charged under this section but acquitted."
    },
    {
      "name": "Police Act",
      "sections": [
        "s. 42",
        "s. 36",
        "s. 29",
        "s. 44"
      ],
      "relevance": "s. 42 limitation does not apply to IPC offence; s. 36 clarifies no preclusion of other Acts; s. 29 and 44 relate to duties violated but prosecuted under IPC."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the judgment of the Allahabad High Court confirming conviction under s. 218 IPC and sentence of two years rigorous imprisonment is dismissed. The decision of the High Court is correct.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The crux of the section so far as it is relevant to the present inquiry is that the public servant should have acted in the manner contemplated by this section with an intent thereby to save or knowing it to be likely that he will thereby save any person from legal punishment.",
      "speaker": "court",
      "significance": "Explains essential ingredient of s. 218 IPC."
    },
    {
      "text": "If a police officer manipulates the record such as police diary etc., it will be the end of honest criminal investigation in our country. Such offences shall receive deterrent punishment.",
      "speaker": "court",
      "significance": "Justifies upholding stern punishment for tampering with police records."
    }
  ],
  "_case_id": "1962_165",
  "_label": 0,
  "_text_length": 12697,
  "_extracted_at": "2026-02-10T19:58:37.425327"
}