{
  "metadata": {
    "case_name": "Peareylal v. Rameshwar Dass",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Civil Appeal No. 338/1960",
    "date_of_judgment": "1962-12-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Girdhari Lal, resident of Delhi, executed a will dated February 8, 1897, bequeathing his property, both movable and immovable, to his wife Mst. Kishen Dei and adopted son Nathi Mal.",
      "type": "material",
      "date": "1897-02-08",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Nathi Mal, the adopted son, predeceased Girdhari Lal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Girdhari Lal died in 1923.",
      "type": "background",
      "date": "1923",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After Girdhari Lal's death, Mst. Kishen Dei executed a will dated October 8, 1941, bequeathing the property in dispute i.e., house No. 2045 situate in Delhi, to her brother's grandson, Rameshwar Dass.",
      "type": "material",
      "date": "1941-10-08",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Peareylal, the defendant, has been in occupation of a portion of the said house.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "After the death of Mst. Kishen Dei, Peareylal refused to execute a lease deed in favour of Rameshwar Dass or pay him rent in respect of the portion occupied by him.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Rameshwar Dass filed a suit in the Court of the Subordinate Judge, Delhi, for evicting Peareylal from the portion of the house occupied by him.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Defendant Peareylal pleaded that plaintiff Rameshwar Dass had no title to the property as Mst. Kishen Dei did not get absolute interest under her husband's will; also pleaded that Girdhari Lal dedicated the house under a will to Shiv Temple in Gali Patashe Minor and appointed him trustee.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Subordinate Judge found that under 1897 will, Mst. Kishen Dei got absolute interest; defendant's will not proved and Girdhari Lal not of sound mind on date alleged; decreed in favour of plaintiff.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "District Judge on appeal held Kishen Dei got only limited estate under 1897 will, so could not confer interest by her will; did not decide on defendant's will; set aside decree and dismissed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court (Khosla J.) in second appeal: under 1897 will, life interest to Kishen Dei with gift over to son which failed, so absolute under s.112 Indian Succession Act; alternatively absolute interest; restored Subordinate Judge's decree.",
      "type": "procedural",
      "date": "1951-08-31",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "No argument before Khosla J. on defendant's will, in view of Subordinate Judge's finding.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Division Bench (Weston CJ and Falshaw J) in Letters Patent Appeal No. 64 of 1949: on construction of 1897 will, on failure of bequest to Nathi Mal, widow Kishen Dei takes absolute interest; confirmed Khosla J.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Defendant did not rely on his will even before Division Bench.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Testator Girdhari Lal reached age of nearly 50, adopted Nathi Mal (7 years) with consent, agreement from father Bega Mal; wife Kishen Dei daughter of Bega Mal; owned one storeyed house in Delhi, Bazar Khari Baoli, Gali Batashan, and goods.",
      "type": "background",
      "date": "1897",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Testator lived about a quarter century after 1897 will without changing it, though son predeceased wife.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "On a true construction of the will of 1897 executed by Girdhari Lal, did Mst. Kishen Dei get only a life estate or absolute interest therein?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Did the High Court err in considering and giving a finding on the truth and validity of the will alleged by defendant?",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "On true construction of 1897 will, Mst. Kishen Dei got only life estate; therefore plaintiff got no title under her will.",
      "supporting_facts": [
        "f1",
        "f15"
      ],
      "legal_basis": "Construction relying on sentence: 'The said Mst. Kishen Dei should live in this house and said Nathi Mal will get all the proprietary rights just like the testator.'"
    },
    {
      "id": "pa2",
      "text": "High Court wrong in considering truth and validity of defendant's will, as District Judge did not decide it.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Under 1897 will, absolute bequest to wife with gift over to son by way of defeasance.",
      "supporting_facts": [
        "f1",
        "f2",
        "f15",
        "f16"
      ],
      "legal_basis": "Indian Succession Act ss. 75, 82, 86; meaning of 'malik' as absolute ownership."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In construing 1897 will, read as whole to ascertain testator's intention; give effect to every expression; words used in same sense (s.86 ISA); all parts related (s.82); consider circumstances (s.75). Testator had wife and adopted son, no other relations.",
      "addresses_issue": "i1",
      "key_observation": "Three possible schemes: life estate to wife remainder to son; joint; absolute to wife defeasible by son surviving."
    },
    {
      "id": "cr2",
      "text": "Testator described own interest as 'malik' (absolute); used same for wife and then son after her death; 'malik' means absolute owner unless context otherwise.",
      "addresses_issue": "i1",
      "key_observation": "Cites Privy Council in Sasiman Chowdhurain: 'malik' apt for full proprietary rights."
    },
    {
      "id": "cr3",
      "text": "Reconcile absolute bequests: absolute to wife, gift over to son as defeasance if son survives wife; avoids intestacy if son predeceases.",
      "addresses_issue": "i1",
      "key_observation": "Prefers construction avoiding intestacy and giving full effect to words over one cutting down clear meaning."
    },
    {
      "id": "cr4",
      "text": "Sentence about wife living in house and son proprietary rights like testator: mere wish to keep intact for son, not limiting wife's estate.",
      "addresses_issue": "i1",
      "key_observation": "Cannot rewrite will or cut down 'malik'."
    },
    {
      "id": "cr5",
      "text": "Second point on defendant's will not allowed: not raised below after Subordinate Judge's finding against it; mixed question of fact/law, no exceptional grounds.",
      "addresses_issue": "i2",
      "key_observation": "Subordinate Judge found will not proved, testator not sound mind."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under 1897 will, absolute interest to Mst. Kishen Dei, gift over to Nathi Mal by way of defeasance; since son predeceased, she took absolutely.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sasiman Chowdhurain v. Shib Narayan Chowdhury",
      "citation": "1921 L.R. 49 I.A. 25, 35",
      "treatment": "followed",
      "relevance": "'Malik' describes full proprietary rights including alienation unless context indicates otherwise."
    },
    {
      "case_name": "Ram Gopal v. Nand Lal",
      "citation": "1950 S.C.R. 766, 773",
      "treatment": "followed",
      "relevance": "Accepted Privy Council on 'malik'; meaning depends on context; construe entire document."
    },
    {
      "case_name": "Subbamma v. Ramanaidu",
      "citation": "A.I.R. 1937 Mad. 476, 477",
      "treatment": "distinguished",
      "relevance": "Gift over indicates prior limited interest if not mere defeasance; but facts differ, construe on own terms."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Succession Act",
      "sections": [
        "Section 112",
        "Section 86",
        "Section 82",
        "Section 75"
      ],
      "relevance": "S.112: life estate becomes absolute on failure of gift over; ss.86,82,75: rules of construction of wills."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed confirming High Court judgment restoring decree for eviction in favour of Rameshwar Dass; held Kishen Dei took absolute interest under 1897 will.",
    "relief_granted": "Eviction decree in favour of respondent Rameshwar Dass upheld.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "'Malik' when used in a will... apt to describe an owner possessed of full proprietary rights, including a full right of alienation, unless... context... indicate[s] that such full proprietary rights were not intended.",
      "speaker": "court",
      "significance": "Defines key term 'malik' as absolute ownership."
    },
    {
      "text": "Where apparently conflicting dispositions can be reconciled by giving full effect to every word used... such a construction should be accepted instead of... cutting down the clear meaning of the words used by the testator.",
      "speaker": "court",
      "significance": "Principle adopted for construing the will."
    },
    {
      "text": "When I die then Mst. Kishen Dei, my wife, and after the death of the said Mussammat, my adopted son Nathi Mal, will become malik of all my movable and immovable property without partnership with anybody.",
      "speaker": "court",
      "significance": "Key operative clause of 1897 will using 'malik' twice."
    }
  ],
  "_case_id": "1962_90",
  "_label": 0,
  "_text_length": 17139,
  "_extracted_at": "2026-02-10T19:57:57.289590"
}