{
  "metadata": {
    "case_name": "Commissioner of War Profits Tax v. Binod Mills Co. Ltd.",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "AYYANGAR, J."
    ],
    "case_number": "Civil Appeals Nos. 228 to 230 of 1960",
    "date_of_judgment": "1962-04-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent-Binod Mills Co. Ltd. had its business at Ujjain in the State of Gwalior and was liable to War Profits Tax under the Gwalior War Profits Tax Ordinance, Samvat 2001.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The company was managed by managing agency firm M/s. Binodiram Balchand which had controlling interest in the company by reason of its shareholding exceeding 50% of the issued share capital.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "M/s. Binodiram Balchand were directors of the company within the meaning of s. 2(10) of the Ordinance.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The company was assessed to War Profits Tax for three chargeable accounting periods: July 1, 1944 to December 31, 1944; January 1, 1945 to December 31, 1945; and January 1, 1946 to June 30, 1946.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "During each of these periods, the company paid remuneration to its managing agents and claimed to deduct it in computing its business profits.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Assessing officer disallowed the deduction on the ground that the remuneration received by the managing agency firm had not been factually assessed in the hands of the managing agent, hence covered by opening words of r. 4(1) and not saved by proviso (b).",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Appeal against assessment order dismissed by appellate authority and by Commissioner of War Profits Tax in revision.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Commissioner submitted reference under s. 46(1) of the Ordinance to Madhya Pradesh High Court (Indore Bench) in Civil Reference No. 15 of 1952, consolidated for three periods, on the question: Whether in computing the profits of a business carried on by a company deduction shall be made in respect of any remuneration to any managing-agent where such remuneration is included in the profits of the managing agents business for the purposes of the War Profits Tax?",
      "type": "procedural",
      "date": "1957-02-04",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "High Court answered the question in favour of the respondent-company, holding remuneration paid to managing agent with controlling interest was permissible deduction.",
      "type": "procedural",
      "date": "1957-02-04",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellant obtained certificates under s. 47 of the Ordinance for appeals to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Before departmental authorities, company contended 'included' meant 'disclosed in the return' of director; M/s. Binodiram Balchand disclosed managing agency commission in their P&L for Samvat 2000, 2001, 2002 but claimed not liable to tax, claim accepted.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "This contention rejected by departmental authorities and not repeated before High Court or Supreme Court.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Remuneration received by managing agent was liable to be included in computation of its profits for War Profits Tax.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Meaning of the expression 'is included in the profits of the managing agents business' in r.4(1) proviso (b) of Sch.1 of the Ordinance, and whether remuneration paid to managing agent (with controlling interest) is deductible in computing company's profits for War Profits Tax.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Deduction disallowed because remuneration not factually assessed in hands of managing agent; covered by r.4(1) opening words, not saved by proviso (b).",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Rule 4(1)(b) Sch.1, Gwalior War Profits Tax Ordinance Samvat 2001"
    },
    {
      "id": "pa2",
      "text": "'Included' refers to inclusion by assessing authority in assessment order against managing agent; unless actually assessed there, company cannot claim deduction.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Rule 4(1)(b) Sch.1"
    },
    {
      "id": "pa3",
      "text": "Proviso confers option on controlling director/managing agent to include remuneration in own return (taxed personally) or company's return (no deduction); failure to include in own return opts for company taxation.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Rule 4(1)(b) Sch.1"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Remuneration to managing agent deductible even if paid to one with controlling interest.",
      "supporting_facts": [
        "f5",
        "f11"
      ],
      "legal_basis": "Rule 4(1)(b) proviso (b) Sch.1"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Scheme of Ordinance: Independent units of assessment; profits from business aggregated per unit; general deduction for business expenditure under r.1(1)(xi), but r.4(1) exception for controlled companies unless proviso (b) applies.",
      "addresses_issue": "i1",
      "key_observation": "Remuneration to managing agent is business profit taxable in agent's hands."
    },
    {
      "id": "cr2",
      "text": "'Is included' posits actual inclusion, but possible meanings: in agent's return; in assessment order; or liable under Ordinance.",
      "addresses_issue": "i1",
      "key_observation": "Rejects appellant's High Court argument of inclusion only by assessing authority in order; no discretion to choose assessee."
    },
    {
      "id": "cr3",
      "text": "Rejects Mr. Sen's argument of option via inclusion in return: no reverse exemption; leads to anomalies like shifting tax burden to other shareholders; no relief if company assessed first.",
      "addresses_issue": "i1",
      "key_observation": "Not designed for double taxation avoidance as suggested."
    },
    {
      "id": "cr4",
      "text": "'Included' means liable to inclusion under Ordinance terms; defaults by agent or officer don't prejudice company; proviso inapplicable only if not liable to tax (e.g., s.5(1)(b)).",
      "addresses_issue": "i1",
      "key_observation": "Here, remuneration liable in agent's profits; deduction allowable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In computing company's profits, deduction permissible for remuneration to managing agent if such remuneration is included (liable to be included) in profits of managing agent's business for War Profits Tax purposes, notwithstanding controlling interest.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": null,
      "citation": "Rule 7(2)(b) of Sch.1 to Excess Profits Tax Act, 1940",
      "treatment": "referred",
      "relevance": "Ordinance modeled on it; same terms as proviso (b) but interpretation undecided by courts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Gwalior War Profits Tax Ordinance, Samvat 2001",
      "sections": [
        "s.2(5)",
        "s.2(10)",
        "s.2(13)",
        "s.2(16)",
        "s.4(1)",
        "s.5(1)(b)",
        "s.46(1)",
        "s.47",
        "Sch.1 r.1(1)(xi)",
        "Sch.1 r.4(1)(b)"
      ],
      "relevance": "Charging section, definitions, computation rules; key issue on interpretation of r.4(1)(b) proviso (b) for deduction in controlled companies."
    },
    {
      "name": "Indian Income-Tax Act",
      "sections": [],
      "relevance": "Pattern followed in r.1 of Sch.1 for permissible deductions."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court's answer to reference in favour of respondent-company; deduction of remuneration paid to managing agents allowable as it was liable to inclusion in managing agent's profits under the Ordinance.",
    "relief_granted": "Deduction allowed in computation of company's War Profits Tax.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'is included' as equivalent to 'is liable to be included' and that as it was not contested before them that if the assessment-officer had been so minded he could have included this sum in the profits of the managing-agents business, the terms of proviso (b) were satisfied.",
      "speaker": "lower_court",
      "significance": "High Court's interpretation adopted by Supreme Court."
    },
    {
      "text": "We therefore consider that the learned Judges of the High Court answered the question referred to them correctly.",
      "speaker": "court",
      "significance": "Final affirmation upholding deduction."
    }
  ],
  "_case_id": "1962_372",
  "_label": 0,
  "_text_length": 24913,
  "_extracted_at": "2026-02-10T20:01:47.041804"
}