{
  "metadata": {
    "case_name": "Company v. Respondents",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "KAPUR J."
    ],
    "case_number": "Writ Petition No. 184 of 1961",
    "date_of_judgment": "1962-01-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant Company is a limited company carrying on in the State of Assam its business of manufacturing, selling and supplying iron and steel materials.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "It held a Registration Certificate under the Assam Sales Tax Act, as it was before the amendment of 1960.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Under that Act all its purchases for use in manufacture or production of goods taxable under the Act were exempt from sales tax.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Amendment introduced in s. 15 of the Assam Sales Tax Act, 1947 by s. 2 of the Assam Sales Tax Amendment Act, 1960 (Act XIII of 1960), by which sub-s. (b) of item (i) of sub-cl. (b) of cl. (1) was deleted.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Thereby sales of goods to a registered dealer intended for use in production of goods for sale became liable to sales tax.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "After the amendment there was a deletion in the Registration Certificate of certain goods, e.g., cast iron, iron plates, steel bars and galvanised wire which were used by the petitioner in the manufacture of its finished products which were also taxable in the State.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Consequently it has become liable to pay tax on those goods purchased for use in the manufacture of goods and the cost of production has thereby gone up.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Section 9 of the Act provides for compulsory registration. Section 12 provides that a dealer registered under s. 9 shall be granted a certificate of registration which shall specify the class or classes of goods.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Section 15(1)(b)(i)(b) dealt with exemptions for sale to registered dealer of goods intended for use in manufacture or production of any goods taxable under the Act; this sub-clause has been omitted by the amending Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Refusal to amend the Registration Certificate by reinstating the articles mentioned above.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the amendment introduced by Act XIII of 1960 is violative of Art. 14 because it discriminates between manufacturers who supply goods according to orders received and others who manufacture goods on their own account and sell them.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the restriction imposed by the Amending Act is excessive and violative of Art. 19(1)(g).",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the refusal to amend the Registration Certificate by reinstating the articles mentioned above affects the rights of the petitioner Company under Art. 19(1)(g).",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The amendment introduced by Act XIII of 1960 is violative of Art. 14 because it discriminates between materials which were to be used for manufacture of goods and to be sold on their own account and materials which were purchased for use in the execution of any contract.",
      "supporting_facts": [
        "f4",
        "f5",
        "f9"
      ],
      "legal_basis": "Article 14"
    },
    {
      "id": "pa2",
      "text": "The object of the amendment was to prevent evasion of Sales Tax by manufacturing goods and sending them out of the State and therefore that object could have been achieved by taxing only those materials which were so intended; discrimination introduced by differentiating between materials bought for articles to be supplied against a contract and articles produced and sold by the petitioner; no reasonable classification or intelligible differentia.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "Article 14"
    },
    {
      "id": "pa3",
      "text": "The restriction imposed by the Amending Act is excessive and violative of Art. 19(1)(g); by this means the petitioner will not be able to compete with the manufacturers outside the State of Assam.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Article 19(1)(g)"
    },
    {
      "id": "pa4",
      "text": "The refusal to amend the Registration Certificate affects the rights of the petitioner Company under Art. 19(1)(g).",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Article 19(1)(g)"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The amending Act is really a part of the General Sales Tax Act of the State of Assam the object of which is to raise revenue; it is for the Legislature to decide as to what articles it should tax; if it decided to tax certain articles in order to effectuate its policy it is difficult to see how that would introduce discrimination.",
      "addresses_issue": "i1",
      "key_observation": "Discrimination is not on articles but on persons; goods supplied against a contract and goods manufactured and sold by the petitioner are not similarly situated."
    },
    {
      "id": "cr2",
      "text": "The provision against discrimination is not on articles but on persons. It has not been shown how the imposition of this tax is an unreasonable restriction on the rights of the petitioner to carry on trade.",
      "addresses_issue": "i1",
      "key_observation": "Goods which are purchased are put to different uses and if the legislature thinks that certain classes of goods should pay the tax and not others that is a question of policy into which the courts cannot enter; per se there is no discrimination."
    },
    {
      "id": "cr3",
      "text": "There is no force in the second contention either [regarding Art. 19(1)(g)].",
      "addresses_issue": "i2",
      "key_observation": "Assuming petitioner cannot compete with outside manufacturers, it is a matter of legislative policy."
    },
    {
      "id": "cr4",
      "text": "In view of our decision on these two points the third point, that is, the refusal of the Sales Tax Officer to amend the registration certificate will have no force.",
      "addresses_issue": "i3",
      "key_observation": "Third issue falls with the first two."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The amendment does not violate Art. 14 as there is no discrimination; goods supplied against contract and goods manufactured for own sale are not similarly situated.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The restriction is not excessive or violative of Art. 19(1)(g); legislative policy on taxation not subject to court interference on competition grounds.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Refusal to amend registration certificate does not violate Art. 19(1)(g).",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Assam Sales Tax Act, 1947 (Act XVII of 1947)",
      "sections": [
        "s. 2(2)(a)(b)",
        "s. 9",
        "s. 12",
        "s. 15(1)(b)(i)(b)"
      ],
      "relevance": "Scheme of the Act providing for registration, certificates, and exemptions for sales to registered dealers for use in manufacture; sub-clause (b) deleted by amendment"
    },
    {
      "name": "Assam Sales Tax Amendment Act, 1960 (Act XIII of 1960)",
      "sections": [
        "s. 2"
      ],
      "relevance": "Amends s. 15 of 1947 Act by deleting exemption for sales to registered dealers intended for use in manufacture or production of goods for sale"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 32",
        "Art. 14",
        "Art. 19(1)(g)"
      ],
      "relevance": "Petition under Art. 32 challenging amendment as violative of Arts. 14 and 19(1)(g)"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The petition under Art. 32 challenging the amendment to s. 15 of the Assam Sales Tax Act as violative of Arts. 14 and 19(1)(g) fails on all grounds; no discrimination or unreasonable restriction found.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is for the Legislature to decide as to what articles it should tax and what articles it should not tax and if it decided to tax certain articles in order to effectuate its policy it is difficult to see how that would introduce discrimination.",
      "speaker": "court",
      "significance": "Rejects Art. 14 challenge emphasizing legislative taxing power"
    },
    {
      "text": "The provision against discrimination is not on articles but on persons.",
      "speaker": "court",
      "significance": "Key observation distinguishing basis of Art. 14 equality"
    },
    {
      "text": "In the result this petition fails and is dismissed and the rule is discharged.",
      "speaker": "court",
      "significance": "Final disposition of the case"
    }
  ],
  "_case_id": "1962_181",
  "_label": 0,
  "_text_length": 6534,
  "_extracted_at": "2026-02-10T19:59:16.673137"
}