{
  "metadata": {
    "case_name": "Union of India v. Respondent",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 294 of 1960",
    "date_of_judgment": "1962-04-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is a displaced person who migrated from what is now part of West Pakistan to India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent had agricultural land as well as houses in the rural area in the place from where he migrated.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "The respondent was allowed 2-1/2 acres of land in the Punjab in lieu of the agricultural land left by him in what is now Pakistan.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In addition, the respondent left behind a house and a shop.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The respondent claimed Rs. 12,000/- for the house and Rs. 8,000/- for the shop as compensation.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The Additional Settlement Commissioner allowed his claim to the extent of Rs. 6,674/- for the house and Rs. 6,120/- for the shop, the total thus coming to Rs. 12,796/- . This was adjudged in March 1955.",
      "type": "material",
      "date": "1955-03",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Thereafter, the respondent made an application to the Settlement Officer Jaipur in March 1956 for compensation under the Act.",
      "type": "procedural",
      "date": "1956-03",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "This claim of the respondent was rejected by the Assistant Settlement Officer Jaipur on the ground that it could not be entertained in view of r. 65 of the Rules, as he was allotted agricultural land to the extent of 2-1/2 acres.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The respondent then appealed to the Regional Settlement Commissioner who upheld the order of the Assistant Settlement Officer.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Thereafter the respondent filed a writ petition before the High Court of Rajasthan (D.B. Civil Writ Case No. 39 of 1957), judgment and order dated October 3, 1958.",
      "type": "procedural",
      "date": "1958-10-03",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "The High Court accepted the contention that in order to determine the limit of Rs. 10,000/- provided in r. 65(2) the value of all the rural buildings left by him in Pakistan should be added up and if the total is more than Rs. 10,000/- he is entitled to compensation.",
      "type": "material",
      "date": "1958-10-03",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The High Court directed that the respondent should be paid compensation to which he was entitled under the Rules for the rural buildings left by him the value of which collectively was more than Rs. 10,000/-.",
      "type": "material",
      "date": "1958-10-03",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The respondent did not settle in the village in which he had been allotted agricultural land and therefore could not get the advantage of r. 57.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether it is possible to add up the value of more than one rural building, each of which is less than Rs.10,000/- or Rs.20,000/- in order to reach the total of Rs. 10,000/- or Rs. 20,000/- for the purpose of taking the case for compensation for rural buildings out of the ambit of r.65 of the Rules framed under the Displaced Persons (Compensation and Rehabilitation) Act, 1954.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "r. 65 was framed primarily in pursuance of an inter Dominion agreement by which it was agreed that no compensation should be payable for a rural building where its value is less than Rs.20,000/-. A rural building worth less than Rs.20,000/- was treated as an adjunct to the agricultural land left by a displaced person in Pakistan and it was decided to give compensation for any rural building which was less than Rs 20,000/- in value by other ways and not as cash compensation. This other way is provided in r. 57.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "r.65, r.57, r.97 of the Rules; inter-Dominion agreement"
    },
    {
      "id": "pa2",
      "text": "When r. 65 provides that no compensation would be given for any rural building which was worth less than Rs.20,000/- or Rs.10,000/- it referred to the value of each building and the case could not be taken out of the ambit of r. 65 if a displaced person had left more than one rural building and the value of all such buildings was more than Rs.10,000/- or Rs.20,000/- taken together.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "r.65"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "If r. 65 is not unambiguous on this point and can have two meanings, it should be so interpreted as to favour the displaced person so that he may get some compensation for the rural buildings left by him in Pakistan.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The words 'any rural building' in r. 65 though in singular, can be read in plural also in view of s. 13 of the General Clauses Act, and that they should be so read in order to help the displaced person in getting compensation.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s.13 General Clauses Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 65 came up for consideration in this Court once before in Makhanlal Malhotra v. Union of India where its constitutionality was upheld. The background from inter-Dominion Conference (Karachi 1949, New Delhi March 1949) shows that buildings in rural areas of value of Rs. 20,000/- or more should be considered substantial buildings and lesser value treated as appendages of agricultural land.",
      "addresses_issue": "i1",
      "key_observation": "The basis for purposes of value was the building and the ownership of the building had nothing to do with this limit."
    },
    {
      "id": "cr2",
      "text": "The intention behind the agreement was to treat only buildings which were individually more than Rs. 20,000/- as substantial buildings for which compensation would be granted while other buildings each of which was less than that value would not be considered substantial buildings but would be treated as merely appendages to agricultural properties.",
      "addresses_issue": "i1",
      "key_observation": "This value of Rs. 20,000/- has been reduced to Rs. 10,000/- in r. 65(2) for those to whom less than four acres was allotted, but subject to the same limitation i.e., individual building."
    },
    {
      "id": "cr3",
      "text": "The scheme under the Act and Rules (Chapters IV, V, VI; r.44, r.47, r.57) is that where a person has left both agricultural land and rural buildings, he gets agricultural land allotted, and for rural buildings less than the limit, compensated via r.57 (house or site with grant). Separate cash compensation only if individual building exceeds limit.",
      "addresses_issue": "i1",
      "key_observation": "r.65 specifically prohibits separate compensation for such buildings worth less than the limit."
    },
    {
      "id": "cr4",
      "text": "r.65 speaks of each building being of that value and does not contemplate totalling up the value of a number of buildings. s.13 General Clauses Act does not apply as repugnant to subject and context.",
      "addresses_issue": "i1",
      "key_observation": "It is the building that has to be taken into account in determining the limits in r.65 and not the ownership."
    },
    {
      "id": "cr5",
      "text": "The respondent could have been allotted under r.57 if he settled in the allotted village, but his choice not to do so does not warrant interpreting r.65 differently.",
      "addresses_issue": "i1",
      "key_observation": "Loss is of his own choice."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A displaced person is not entitled to compensation if he has left more than one rural building, the value of each being less than Rs. 10,000/- or Rs. 20,000/-, though the total value of such buildings left by him may be more than Rs. 10,000/- or Rs. 20,000/-. Values cannot be aggregated; each building considered individually.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chanan das Mukhi v. Union of India",
      "citation": "I.L.R. 1960 1 Punj. 153",
      "treatment": "followed",
      "relevance": "Full Bench held each rural building must individually exceed Rs.10,000/- or Rs.20,000/-; no aggregation."
    },
    {
      "case_name": "Totaram Teckchand v. H.K. Choudhari",
      "citation": "A.I.R. 1960 Bom. 528",
      "treatment": "distinguished",
      "relevance": "Took view similar to Rajasthan HC allowing aggregation."
    },
    {
      "case_name": "Makhanlal Malhotra v. Union of India",
      "citation": "1961 2 S.C.R. 120",
      "treatment": "followed",
      "relevance": "Upheld constitutionality of r.65; discussed background of inter-Dominion agreements."
    }
  ],
  "statutes_cited": [
    {
      "name": "Displaced Persons (Compensation and Rehabilitation) Act, 1954",
      "sections": [
        "Rules: r.65(1), r.65(2), r.57, r.97, r.44, r.47"
      ],
      "relevance": "Governs payment of compensation; r.65 bars separate compensation for rural buildings below specified value unless individually exceeding limit; r.57 provides alternative via house/site allotment."
    },
    {
      "name": "General Clauses Act",
      "sections": [
        "s.13"
      ],
      "relevance": "Singular includes plural unless repugnant to subject or context; held not applicable here."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed and the order of the High Court is set aside. The writ petition filed by the respondent is dismissed.",
    "relief_granted": null,
    "costs": "The High Court awarded no costs to the respondent."
  },
  "key_quotes": [
    {
      "text": "The short question raised in this appeal by special leave is whether it is possible to add up the value of more than one rural building, each of which is less than Rs.10,000/- or Rs.20,000/- in order to reach the total of Rs. 10,000/- or Rs. 20,000/- for the purpose of taking the case for compensation for rural buildings out of the ambit of r.65",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "It is clear in that background that when r. 65 speaks of any rural building the assessed value of which is less than Rs. 20,000/- or Rs. 10,000/- it speaks of each building being of that value and does not contemplate totalling up of the value of a number of buildings",
      "speaker": "court",
      "significance": "Key holding on interpretation of r.65."
    },
    {
      "text": "We are therefore of opinion that the view taken by the High Court is incorrect and this appeal must be allowed.",
      "speaker": "court",
      "significance": "Concludes in favor of appellants."
    }
  ],
  "_case_id": "1962_386",
  "_label": 1,
  "_text_length": 18532,
  "_extracted_at": "2026-02-10T20:01:58.420038"
}