{
  "metadata": {
    "case_name": "Deputy Commissioner, Kheri v. Respondents",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO, J."
    ],
    "case_number": "Civil Appeal No. 29 of 1958",
    "date_of_judgment": "1962-02-06"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Certain decretal moneys were deposited in the then Chief Court of Oudh at Lucknow.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondents applied to the Chief Court for permission to withdraw the moneys on furnishing security and were permitted to do so.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "A registered security bond was executed and registered in Simla in 1949 by which a house there was given in security for withdrawal of the money.",
      "type": "material",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Before the money could be withdrawn, the Inspector of Stamps reported on March 15, 1950, that the so called security bond was in reality a mortgage deed without possession and was insufficiently stamped. He reported that it should be impounded and the deficit stamp duty of Rs. 482/11/- and a penalty amounting to Rs. 4,826/14/- should be levied.",
      "type": "disputed",
      "date": "1950-03-15",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On April 5, 1950, the Deputy Commissioner, Kheri, acting as Collector passed the order: 'In case the parties have any objection, they put it in writing which will be referred to the Board of Revenue.'",
      "type": "procedural",
      "date": "1950-04-05",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On July 5, 1950, the respondents objected that the document was not a mortgage deed and that no duty or penalty was payable, and further that as the document had not been till then accepted by the court, it was only a tentative document.",
      "type": "procedural",
      "date": "1950-07-05",
      "source": "respondents"
    },
    {
      "id": "f7",
      "text": "On August 3, 1950, the judicial officer before whom the security bond was filed impounded it under s. 33 of the Indian Stamp Act and forwarded it to the Deputy Commissioner, Kheri, under s. 38 of the Act.",
      "type": "procedural",
      "date": "1950-08-03",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In November 1950, the respondents filed further objections before Stamp Officer/Treasury Officer, Kheri, from whom the Deputy Commissioner had called for a report.",
      "type": "procedural",
      "date": "1950-11",
      "source": "respondents"
    },
    {
      "id": "f9",
      "text": "In December 1950, the Treasury Officer made a report to the effect that the view of the Inspector of Stamps was correct and duty and penalty as reported were due. The respondents' case was that the Treasury Officer did not give them any hearing before making the report.",
      "type": "procedural",
      "date": "1950-12",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On the Treasury Officer's report, the Deputy Commissioner made the order 'Realise'. He is said to have given no hearing to the respondents.",
      "type": "procedural",
      "date": "1950-12",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "In January 1951, the respondents filed a revision against the order of the Deputy Commissioner before the Board of Revenue.",
      "type": "procedural",
      "date": "1951-01",
      "source": "respondents"
    },
    {
      "id": "f12",
      "text": "In March 1951, the Deputy Commissioner referred the matter to the Board of Revenue under s. 56(2) of the Act.",
      "type": "procedural",
      "date": "1951-03",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "In July 1951, the Board of Revenue disposed of the matter and upheld the order of the Collector. The respondents complained that the Board did not give them a hearing.",
      "type": "procedural",
      "date": "1951-07",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "In November 1951, the respondents filed a writ petition in the Allahabad High Court.",
      "type": "procedural",
      "date": "1951-11",
      "source": "respondents"
    },
    {
      "id": "f15",
      "text": "The writ petition was dismissed by the learned Single Judge on May 3, 1956, on the ground that neither the Act nor the Rules provided for any hearing, and that the Collector had given opportunity in writing, and Board considered revision grounds.",
      "type": "procedural",
      "date": "1956-05-03",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "The respondents appealed in Special Appeal No. 48 of 1954. The appeal court treated it as under s.56(2), held authorities act administratively but bound by natural justice to give hearing, relying on Special Appeal No. 291 of 1955 (Ghanshyamdas Gupta v. Board of High School), set aside Board order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Allahabad High Court granted certificate for appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Board of Revenue when dealing with a proceeding under s. 56(2) of the Indian Stamp Act acts administratively or quasi-judicially, and is bound to give a hearing to the respondents according to principles of natural justice.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court went wrong in holding that the Board acting merely administratively under s.56(2) was bound to give a hearing under principles of natural justice. Ss.40 and 56 leave the matter to the opinion of the authority, no procedure for show cause or hearing required. Authorities act administratively, not judicially or quasi-judicially.",
      "supporting_facts": [
        "f15",
        "f16"
      ],
      "legal_basis": "Indian Stamp Act ss. 40, 56; impugns view in Special Appeal No. 291 of 1955"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "When the Board is acting under s. 56(2) of the Act it is acting quasi-judicially and entitled to hearing.",
      "supporting_facts": [
        "f9",
        "f10",
        "f13"
      ],
      "legal_basis": "Indian Stamp Act s.56(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Analyzed scheme of ss.31,40,41,56(2): Collector refers doubt on duty to Chief Controlling Revenue authority (Board). Nature of duty: construe instrument, apply Act, may impose heavy duty/penalty. Pure question of law, affects rights, cumulative indicia show Board acts judicially/quasi-judicially.",
      "addresses_issue": "i1",
      "key_observation": "Board has to act judicially under s.56(2) and give hearing per natural justice."
    },
    {
      "id": "cr2",
      "text": "Act silent on hearing, but inferred from nature of rights affected, objective criterion, phraseology. Decision may saddle with large pecuniary liability. S.57 allows Board to refer to High Court (judicial hearing by 3 judges), implies s.56(2) also judicial.",
      "addresses_issue": "i1",
      "key_observation": "Totality of circumstances requires Board to act quasi-judicially."
    },
    {
      "id": "cr3",
      "text": "Distinguished from C.A. 132 of 1959 (Ghanshyamdas case): there committee acted judicially under regulations; here similar under Stamp Act.",
      "addresses_issue": "i1",
      "key_observation": "Board acts as quasi-judicial tribunal under s.56(2)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Board of Revenue acts as a quasi-judicial body under s. 56(2) of the Indian Stamp Act and must give a hearing to the executant of the instrument on principles of natural justice.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ghanshyamdas Gupta v. The Board of High School and Intermediate Education, U. P.",
      "citation": "Special Appeal No. 291 of 1955 (Allahabad HC); C. A. 132 of 1959 (SC)",
      "treatment": "followed",
      "relevance": "Similar question: authority acts judicially from scheme/nature; SC held committee acts judicially, not upheld HC administrative view."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Stamp Act, No. II of 1899",
      "sections": [
        "s. 31",
        "s. 33",
        "s. 38",
        "s. 40",
        "s. 41",
        "s. 42",
        "s. 56(2)",
        "s. 57"
      ],
      "relevance": "Scheme for impounding, determining duty/penalty, Collector reference on doubt to Board; Board decides quasi-judicially, may refer to HC."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the order of the Allahabad High Court setting aside the Board of Revenue's order, though on a different ground, holding that the Board acts quasi-judicially under s.56(2) and must provide a hearing; appeal dismissed.",
    "relief_granted": "Order of Board of Revenue set aside for lack of hearing; matter to proceed with hearing.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the Chief Controlling Revenue-authority has to decide the matter judicially and would thus be a quasi-judicial tribunal.",
      "speaker": "court",
      "significance": "Core holding on nature of Board's function under s.56(2)."
    },
    {
      "text": "the Board has to act judicially when proceeding under s.56(2) and must therefore on principles of natural justice give a hearing to the other party.",
      "speaker": "court",
      "significance": "Directly resolves the main issue on hearing requirement."
    },
    {
      "text": "We therefore uphold the order of the high Court, though on a different ground.",
      "speaker": "court",
      "significance": "Final disposition of the appeal."
    }
  ],
  "_case_id": "1962_108",
  "_label": 0,
  "_text_length": 14311,
  "_extracted_at": "2026-02-10T19:57:57.951564"
}