{
  "metadata": {
    "case_name": "Chimandas Bagomal Sindhi v. Jogeshwar s/o Parmanand Bhishikar",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 201/60",
    "date_of_judgment": "1962-11-08"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Jogeshwar s/o Parmanand Bhishikar (respondent) owns a house known as the Bhishikar Bhawan in Nagpur. Block No. 2A had been let out by him to a firm known as the Dayalbagh Stores for carrying on business.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Since the tenant was in arrears as to rent, the respondent obtained from the Rent Control Authorities permission to terminate the said tenancy.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The tenant intimated to the respondent by telegram on July 24, 1955, that it had vacated the said premises on that day.",
      "type": "material",
      "date": "1955-07-24",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Prior to the receipt of this telegram, the appellant Chimandas Bagomal Sindhi had made an application to the Addl. Dy. Commissioner, Nagpur, on July 15, 1955, that the premises occupied by the said tenant were likely to fall vacant, and prayed that the same should be allotted to him as he was a displaced person within the meaning of the Order.",
      "type": "procedural",
      "date": "1955-07-15",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "The Addl. D. C. passed an order of provisional allotment in favour of the appellant on the same day and since then, the appellant has been in possession of the said premises.",
      "type": "procedural",
      "date": "1955-07-15",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The respondent then came to know about the said provisional allotment and gave intimation to the Addl. D. C. that he needed the premises for his own purposes, and so, he moved for the cancellation of the said provisional allotment order.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "On July 23, 1956, the Addl. D. C. purporting to exercise his powers under clause 23(1) of the Order confirmed the provisional allotment in favour of the appellant.",
      "type": "procedural",
      "date": "1956-07-23",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The respondent then moved the Nagpur High Court by a writ petition No. 307 of 1955 for cancellation of the said order. On April 10, 1956, Mr. Justice Bhutt set aside the order of allotment and remanded the case for disposal in accordance with law.",
      "type": "procedural",
      "date": "1956-04-10",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "On remand, the Addl. Dy. Commissioner confirmed the earlier order. He held that the respondent did not need the premises for his own occupation and he thought that there was no going back on the earlier provisional order of allotment in favour of the appellant.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "This second order was challenged by the respondent by another writ petition filed in the Nagpur High Court No. 391 of 1956.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Meanwhile, the appellant had filed a Letters Patent Appeal No. 95 of 1956 against the decision of Bhutt, J., on the earlier writ petition filed by the respondent.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "By consent, the said Letters Patent Appeal and the subsequent writ petition filed by the respondent were heard together by a Division Bench of the High Court. The Division Bench has set aside the order of allotment passed in favour of the appellant and allowed the subsequent writ petition filed by the respondent.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "After remand, the respondent brought it to the notice of the Addl. D. C. that the appellant owned As./4/- share in the Hind Vastra Bhandar and that he had, therefore a place where he could carry on his business. This allegation was repeated by the respondent in his second writ petition.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "From the affidavit filed by the appellant it appears that the appellant had a share in the Hind Vastra Bhandar and Krishna Watch Co both of which Partnerships carried on their business at Nagpur, but on April 8, 1957 the said partnerships had been dissolved.",
      "type": "admitted",
      "date": "1957-04-08",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "The High Court has held that reading the definition of the words displaced person prescribed by clause 2(2) together with the relevant clause of the Order under which the impugned allotment had been made in favour of the appellant it must be held that the appellant was not a displaced person and as such, he was not entitled to the said allotment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Construction of clauses 23, 24 and 24-A in The Central Provinces and Berar Letting of Houses and Rent Control Order, 1949, particularly whether a displaced person who has other accommodation of his own (like a share in a partnership business premises) qualifies for allotment under these clauses.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Addl. Dy. Commissioner properly dealt with the matter on remand from Justice Bhutt, or took an unduly narrow view confined only to respondent's need.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellant is a displaced person within the meaning of clause 2(2). The business mentioned by the respondent had been dissolved on April 8, 1957, supported by deed of dissolution, so after that date there was no place of business to which the appellant could lay any claim.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Clause 2(2) of the Order"
    },
    {
      "id": "pa2",
      "text": "Provisional allotment order dated July 15, 1955 should be judged in light of facts as they stood on that day; subsequent dissolution should not affect it, and protraction of proceedings does not entitle consideration of subsequent events.",
      "supporting_facts": [
        "f4",
        "f5",
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant had a place of business of his own as 4 annas sharer in Hind Vastra Bhandar, so not entitled to allotment; ceased to be displaced person within clause 23(1) etc.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Clauses 2(2), 23(1) read together"
    },
    {
      "id": "ra2",
      "text": "Needed the premises for his own purposes.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Proviso to clause 23(1)"
    },
    {
      "id": "ra3",
      "text": "Under cl. 2(2) the appellant was not a displaced person on July 15, 1955 as he had been carrying on business in several places in India since 1945.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Clause 2(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Definition of displaced person in clause 2(2) must be read unless repugnant to subject or context; clauses 23(1), 24, 24A do not imply persons must have no accommodation; they confer power on D.C. to allot if expedient, considering sufficiency/suitability of existing accommodation; not a preliminary disqualification.",
      "addresses_issue": "i1",
      "key_observation": "The words of the relevant provisions are not ambiguous; no terms of limitation qualifying the specified persons."
    },
    {
      "id": "cr2",
      "text": "High Court erred in holding appellant disqualified merely for having other accommodation via partnership share.",
      "addresses_issue": "i1",
      "key_observation": "Persons specified would normally not be entitled if they have suitable and sufficient accommodation, but that is for D.C. to consider on merits."
    },
    {
      "id": "cr3",
      "text": "Addl. D.C. on remand took unduly narrow view, confining enquiry to respondent's need and not properly appreciating scope re appellant's existing business place; vitiated the order.",
      "addresses_issue": "i2",
      "key_observation": "Scope of enquiry post-remand broader; incidental mention of appellant's share but added it does not preclude new shop."
    },
    {
      "id": "cr4",
      "text": "Matter remanded for fresh consideration on merits in light of position as on July 15, 1955; subsequent partnership dissolution not to be considered; respondent may raise if appellant was displaced person on that date.",
      "addresses_issue": "i2",
      "key_observation": "Provisional order validity judged by facts on application date."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Clauses 23(1), 24, 24A do not exclude displaced persons with existing accommodation; D.C. to consider on merits if suitable/sufficient.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Addl. D.C. did not deal with matter in accordance with law on remand; matter remitted afresh to Addl. Dy. Commissioner, Nagpur, for disposal in light of facts as on July 15, 1955.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Central Provinces and Berar Letting of Houses and Rent Control Order, 1949",
      "sections": [
        "Clause 2(2)",
        "Clause 13",
        "Clause 22",
        "Clause 23",
        "Clause 24",
        "Clause 24-A"
      ],
      "relevance": "Governs definition of displaced person, landlord ejectment, intimation of vacancies, allotment powers to D.C., landlord's right to plead own need, provisional allotments on likely vacancy."
    },
    {
      "name": "Central Provinces and Berar Act No. XI of 1946",
      "sections": [
        "Section 2"
      ],
      "relevance": "Empowered Government to issue the Order."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Appeal allowed; order passed by the High Court on the writ petition set aside; matter remanded to the Addl. Dy. Commissioner, Nagpur, with direction to deal with the dispute between the parties afresh in accordance with law, considering position as on July 15, 1955.",
    "relief_granted": "Remand for fresh consideration on merits.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Clause 23(1) refers to the persons in the specified categories, and empowers the D.C. to make an order of allotment in their favour. There are no terms of limitation qualifying the said persons\"",
      "speaker": "court",
      "significance": "Core holding on interpretation of allotment clauses not requiring no prior accommodation."
    },
    {
      "text": "\"We are satisfied that the question about the propriety and validity of the said provisional order must be judged in the light of the facts as they obtained on that day.\"",
      "speaker": "court",
      "significance": "Directs remand based on date of provisional allotment."
    }
  ],
  "_case_id": "1962_86",
  "_label": 1,
  "_text_length": 18785,
  "_extracted_at": "2026-02-10T19:57:56.911436"
}