{
  "metadata": {
    "case_name": "Harikisan Kishorilal Agarwal v. State of Maharashtra",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha CJ"
    ],
    "case_number": "Cr. A. No. 189 of 1961",
    "date_of_judgment": "1962-01-31"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Order of Detention under s.3(1)(a)(ii) of the Preventive Detention Act, 1950 made by District Magistrate of Nagpur on April 10, 1961, directing detention of Shri Harikisan Kishorilal Agarwal in District Prison, Thana, as Class II Prisoner.",
      "type": "material",
      "date": "1961-04-10",
      "source": "district_magistrate"
    },
    {
      "id": "f2",
      "text": "Grounds of detention served on appellant on April 10, 1961 in English, substance: since release from previous detention in October 1960, instigating persons at Nagpur to defy lawful orders on processions/assemblies, using provocative words/slogans in meetings/processions leading to violence/mischief/disturbance prejudicial to public order; particulars in five typed pages.",
      "type": "material",
      "date": "1961-04-10",
      "source": "district_magistrate"
    },
    {
      "id": "f3",
      "text": "Appellant wrote letter to District Magistrate on April 19, 1961 stating unable to understand English order and grounds, requested Hindi version to understand charges and take steps for release.",
      "type": "procedural",
      "date": "1961-04-19",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "District Magistrate replied on April 23, 1961 refusing Hindi translation as not legally necessary; stated order/grounds in official language English, fully explained by Police Officer in presence of DSP Nagpur City.",
      "type": "procedural",
      "date": "1961-04-23",
      "source": "district_magistrate"
    },
    {
      "id": "f5",
      "text": "Appellant filed application under Art. 226 Constitution read with s.491 CrPC in Bombay High Court Nagpur Bench for writ of Habeas Corpus against State of Maharashtra and District Magistrate Nagpur; dismissed by Division Bench on July 10-11, 1961.",
      "type": "procedural",
      "date": "1961-07-10",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Supreme Court admitted appeal by special leave; heard on January 8-9, 1962; directed appellant's release forthwith, reasons to follow.",
      "type": "procedural",
      "date": "1962-01-08",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "High Court found appellant studied up to 7th Hindi Standard (equivalent to 3rd English Standard); held English service sufficient as official language, oral explanation by police deemed enough for representation.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Affidavit of District Magistrate: appellant educated, can understand English; grounds supplied in court language, explained by Police Inspector W.B. Bobde.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Affidavit of Police Inspector W.B. Bobde: translated order and grounds orally in Hindi and explained to appellant in presence of DSP Nagpur City.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Previous detention of appellant ended in October 1960.",
      "type": "background",
      "date": "1960-10",
      "source": "grounds_of_detention"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether service of detention order and grounds in English, with oral translation/explanation by police officer, complies with Art. 22(5) Constitution for a detenue not conversant with English, enabling effective representation.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether communication of grounds means imparting sufficient knowledge in a language/script the detenue understands, if literate.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Communication of grounds in English not equivalent to proper service for person not conversant with English; oral translation by police officer insufficient compliance with Art. 22(5); cannot verify accuracy of translation of lengthy document; denied full opportunity for effective representation.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f7"
      ],
      "legal_basis": "Art. 22(5) Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "English is official language of Maharashtra; communication in official language sufficient; oral translation/explanation by police inspector while serving complies; appellant educated and knows English.",
      "supporting_facts": [
        "f4",
        "f8",
        "f9"
      ],
      "legal_basis": "Art. 22(5) Constitution"
    },
    {
      "id": "ra2",
      "text": "High Court held service in English sufficient; oral explanation deemed enough for representation.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Provisions of Art. 22(5) not fully complied with; to person not conversant with English, service in English plus oral translation by police does not fulfil requirements; must impart sufficient knowledge of all grounds (several, based on numerous speeches) for effective representation.",
      "addresses_issue": "i1",
      "key_observation": "Communication must mean bringing home effective knowledge of facts/charges; oral translation of lengthy grounds inadequate."
    },
    {
      "id": "cr2",
      "text": "Grounds must be made available as soon as may be in language detenue understands and script he can read if literate; not sufficient to physically deliver means of knowledge.",
      "addresses_issue": "i2",
      "key_observation": "Safeguards under Art. 22(4)(5) require this for preventive detention."
    },
    {
      "id": "cr3",
      "text": "High Court erred in holding English service always sufficient merely as official language; depends on detenue's language proficiency.",
      "addresses_issue": "i1",
      "key_observation": "Assumed appellant did not know enough English."
    },
    {
      "id": "cr4",
      "text": "Cited State of Bombay v. Atma Ram Sridhar Vidyasagar explaining Art. 22(5) requirements.",
      "addresses_issue": "i1",
      "key_observation": "Earliest opportunity for representation requires knowledge of grounds as charges."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "For compliance with Art. 22(5), grounds of detention must be communicated in a language the detenue understands (and script he can read if literate), beyond mere English service/oral translation if not conversant.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "In this case, appellant deprived of opportunity to make effective representation; detention order invalid for non-compliance.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Bombay v. Atma Ram Sridhar Vidyasagar",
      "citation": null,
      "treatment": "followed",
      "relevance": "Explains Art. 22(5) requires grounds made available soonest for effective representation against detention."
    }
  ],
  "statutes_cited": [
    {
      "name": "Preventive Detention Act, 1950",
      "sections": [
        "3(1)(a)(ii)"
      ],
      "relevance": "Authority for detention order."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "22(5)",
        "22(4)",
        "22",
        "226"
      ],
      "relevance": "Safeguards for detention; right to grounds in understandable form for representation; basis for High Court petition."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "491"
      ],
      "relevance": "Read with Art. 226 for habeas corpus application."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; appellant directed to be released forthwith on January 8-9, 1962 as Art. 22(5) not complied with by failing to provide grounds in Hindi despite request and lack of English proficiency.",
    "relief_granted": "Release from detention forthwith.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Communication, in this context, must, therefore, mean imparting to the detenue sufficient knowledge of all the grounds on which the Order of Detention is based.\"",
      "speaker": "court",
      "significance": "Defines constitutional requirement under Art. 22(5)."
    },
    {
      "text": "\"To a person, who is not conversant with the English language, service of the Order and the grounds of detention in English, with their oral translation or explanation by the police officer serving them does not fulfil the requirements of the law.\"",
      "speaker": "court",
      "significance": "Core holding on insufficiency of oral translation."
    },
    {
      "text": "\"the detenue must be given the grounds in a language which he can understand and in a script which he can read, if he is a literate person.\"",
      "speaker": "court",
      "significance": "Establishes right to written grounds in understandable language."
    }
  ],
  "_case_id": "1962_239",
  "_label": 1,
  "_text_length": 13809,
  "_extracted_at": "2026-02-10T20:00:18.601218"
}