{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Bombay v. E. D. Sheppard",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "S. K. Das",
      "J. L. Kapur",
      "A. K. Sarkar",
      "Raghubar Dayal"
    ],
    "case_number": "Civil Appeal No. 527 of 1961",
    "date_of_judgment": "1962-12-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Killick Nixon Company was a partnership firm carrying on business on a fairly large scale in India, owning various mills and managing agencies.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The firm employed officer-assistants mostly Europeans on contracts for three years, renewable if satisfactory, with expectation to become partners.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Assessee E. D. Sheppard joined the firm in 1930; terms same as specimen contract with W. J. Heygate; Clause 10 allowed termination with one calendar month's notice without reasons.",
      "type": "material",
      "date": "1930",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Assessee's contract renewed from time to time; last renewal on November 1, 1947 to October 31, 1950, salary Rs. 1,200 per month plus 21% commission on net profits; expected Rs. 50,000 per annum.",
      "type": "material",
      "date": "1947-11-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In last quarter of 1947, firm decided to reorganize business; floated Killick Industries Ltd. (public) and Killick Nixon and Company (private) to take over business.",
      "type": "material",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Notice dated December 29, 1947 (affidavit mentions December 27, 1947) terminated assessee's employment as from January 31, 1948 due to changes.",
      "type": "material",
      "date": "1947-12-29",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Assessee was 38 years old; 16 officers including assessee on contract terms, mostly Europeans, contracts expiring on different dates.",
      "type": "background",
      "date": "1948-01-31",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Assessee entered employment of Killick Industries Ltd. on February 1, 1948 on new terms: increased salary, no commission, financially similar position.",
      "type": "material",
      "date": "1948-02-01",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Firm transferred assets to new companies, received shares; shares of Killick Industries Ltd. (face Rs.100, market Rs.130) allotted free to covenanted staff; assessee received 1,700 shares value Rs. 2,21,000.",
      "type": "material",
      "date": "1948",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Assessee claimed shares as compensation for loss of employment due to premature termination.",
      "type": "disputed",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f11",
      "text": "Income-tax Officer taxed Rs. 2,21,000 as consideration for past services under s.7.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Letter dated October 1, 1952 by D.R.C. Hartley on behalf of firm: shares allotted as compensation for loss of employment.",
      "type": "material",
      "date": "1952-10-01",
      "source": "assessee"
    },
    {
      "id": "f13",
      "text": "Appellate Assistant Commissioner confirmed ITO's order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Before Tribunal, affidavit dated February 22, 1954 by five of six partners (sixth died): confirmed shares as compensation for loss of employment, not reward for past services; all assistants accepted as such, no claims made.",
      "type": "material",
      "date": "1954-02-22",
      "source": "assessee"
    },
    {
      "id": "f15",
      "text": "Tribunal: Accountant member held no loss as immediate new employment, partly for future prospects, terminable on notice, not solely compensation; Judicial member and President held solely compensation for loss of employment, accepted assessee's evidence.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Tribunal referred question under s.66: Whether Rs. 2,21,000 value of shares is income assessable under s.7?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Bombay High Court (Shah and Desai JJ.): Accepted Tribunal's findings; payment solely compensation per Expl.2 s.7; not profit in lieu of salary; capital receipt, not taxable.",
      "type": "procedural",
      "date": "1959-07-06",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "High Court certificate under s.66A granted appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances, the sum of Rs. 2,21,000/-, being the value of shares received by the assessee free of payment, is income assessable under section 7 of the Income-tax Act, 1922?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether the payment is 'solely as compensation for loss of employment' within Explanation 2 to s.7(1), excluding it from 'profit in lieu of salary', or remuneration for past services taxable as salary.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "'Compensation' in Expl.2 means legally payable/compellable monetary equivalent of damage suffered; assessee suffered no injury as contract terminable on 1 month's notice; no loss of earnings under contract, must mitigate; exceeds unexpired contract value.",
      "supporting_facts": [
        "f3",
        "f4",
        "f6",
        "f8"
      ],
      "legal_basis": "Explanation 2 to s.7(1) Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "Expl.2 creates artificial definition: any payment from employer/former employer (save provident fund) is profit in lieu of salary unless solely compensation for loss of employment; no further inquiry into capital/revenue or relation to employment.",
      "supporting_facts": [
        "f9",
        "f11"
      ],
      "legal_basis": "Explanation 2 to s.7(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Shares given as compensation for loss of employment per firm letter and partners' affidavit; accepted by all assistants; not reward for past services; immediate new employment immaterial.",
      "supporting_facts": [
        "f10",
        "f12",
        "f14",
        "f15"
      ],
      "legal_basis": "Explanation 2 to s.7(1)"
    },
    {
      "id": "ra2",
      "text": "Compensation includes loss of prospects rooted in employment; intention of parties key; not limited to legal liability; payment unrelated to employer-employee relation if for future prospects not salary.",
      "supporting_facts": [
        "f4",
        "f9"
      ],
      "legal_basis": "Explanation 2 to s.7(1)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Tribunal accepted assessee's evidence (affidavit, letter) that payment solely compensation for loss of employment, not camouflaged; High Court could not question findings on reference under s.66.",
      "addresses_issue": "i1",
      "key_observation": "Evidence supports claim of compensation solely for loss of employment."
    },
    {
      "id": "cr2",
      "text": "'Compensation for loss of employment' not limited to legally compellable amount; includes voluntary payments/solatium; look to payer's intention and recipient's viewpoint; cites Romer LJ in Henry v. Foster, Chibbett, Shaw Wallace, Guff, Vazir Sultan.",
      "addresses_issue": "i2",
      "key_observation": "No legal liability required; emphasis on deprivation act."
    },
    {
      "id": "cr3",
      "text": "Expl.2 does not deem every employer payment as salary; e.g. Mahesh Pattani: personal gift from former ruler not taxable; if solely compensation, excluded even if related to employment.",
      "addresses_issue": "i2",
      "key_observation": "Payment unrelated to employment relation not salary; here solely for loss."
    },
    {
      "id": "cr4",
      "text": "Dissent (Raghubar Dayal J): Compensation requires legal entitlement to profits deprived; terminable on notice, no claim possible; payment for past services/appreciation, deemed salary; parties' intention immaterial.",
      "addresses_issue": "i2",
      "key_observation": "True nature: not compensation absent legal loss."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Payment solely as compensation for loss of employment per Expl.2 s.7(1); not profit in lieu of salary; capital receipt, not taxable under s.7.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Compensation not confined to legally compellable damages; voluntary solatium qualifies if solely for loss of employment/office.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Henry v. Arthur Foster",
      "citation": "1931 6 Tax Cas. 605",
      "treatment": "followed",
      "relevance": "Compensation for loss of office: payment for deprivation of profits entitled to, even without legal liability."
    },
    {
      "case_name": "Chibbett v. Joseph Robinson Sons",
      "citation": "1924 9 Tax Cas. 48",
      "treatment": "followed",
      "relevance": "Look to recipient's viewpoint on payment purpose; not payer's liability; capital if solatium for loss."
    },
    {
      "case_name": "Commissioner of Income-tax v. Shaw, Wallace and Company",
      "citation": "1932 L.R. 59 I.A. 206",
      "treatment": "followed",
      "relevance": "Compensation for agency termination: capital, not income; no legal liability needed."
    },
    {
      "case_name": "W. A. Guff v. Commissioner of Income-tax",
      "citation": "1957 31 I.T.R. 826",
      "treatment": "followed",
      "relevance": "Compensation/solatium for employment loss on department closure: capital, even if no legal liability."
    },
    {
      "case_name": "Commissioner of Income-tax, Hyderabad v. Vazir Sultan and Sons",
      "citation": "1959 Supp. 2 S.C.R. 375",
      "treatment": "followed",
      "relevance": "Agency termination compensation: capital irrespective of legal enforceability; nature in assessee's hands."
    },
    {
      "case_name": "Mahesh Anantrai Pattani v. Commissioner of Income-tax",
      "citation": "1961 2 S.C.R. 742",
      "treatment": "followed",
      "relevance": "Personal gift from former employer: not salary under Expl.2; capital, unrelated to services/office."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 7(1)",
        "Explanation 2 to Section 7(1)",
        "Section 66",
        "Section 66A"
      ],
      "relevance": "S.7 taxes salaries including profits in lieu; Expl.2 deems employer payments as such unless solely compensation for loss of employment; reference provisions."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court (majority: S.K. Das J for himself, Kapur J, Sarkar J) dismissed the appeal, upholding Bombay High Court; held Rs. 2,21,000 not taxable under s.7 as solely compensation for loss of employment per Expl.2; Raghubar Dayal J dissented, would allow appeal as profit in lieu of salary.",
    "relief_granted": "Appeal dismissed",
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "\"Compensation for loss of office or employment is a well-known term it means a payment to the holder of an office as compensation for being deprived of profits to which as between himself and his employer he would, but for an act of deprivation by his employer... have been entitled.\"",
      "speaker": "court",
      "significance": "Defines compensation broadly, no legal liability required (Romer LJ)"
    },
    {
      "text": "\"A payment due to or received by an assessee from an employer or former employer... is to the extent to which it does not consist of contributions by the assessee... a profit received in lieu of salary... unless the payment is made solely as compensation for loss of employment and not by way of remuneration for past services.\"",
      "speaker": "court",
      "significance": "Quotes Expl.2 s.7(1) central to decision"
    },
    {
      "text": "\"If the object of the payment is unrelated to the relation between the employer and the employee, it will not fall within the expression profit received in lieu of salary in Explanation 2.\"",
      "speaker": "court",
      "significance": "High Court view adopted by majority on scope of Expl.2"
    }
  ],
  "_case_id": "1962_233",
  "_label": 0,
  "_text_length": 65313,
  "_extracted_at": "2026-02-10T20:00:19.741668"
}