{
  "metadata": {
    "case_name": "Birla Cotton Spinning and Weaving Mills Limited v. Its Workmen",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO, J."
    ],
    "case_number": "Civil Appeal No. 104 of 1956",
    "date_of_judgment": "1962-05-02"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeal by special leave from the Award dated December 29, 1958 of the Industrial Tribunal, Delhi in I.D. No. 36 of 1957 published in the Delhi Gazette dated 5th March, 1959.",
      "type": "procedural",
      "date": "1958-12-29",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Industrial dispute between Birla Cotton Spinning and Weaving Mills Limited (appellant) and its workmen concerning two issues: (i) whether wages of mistries and line jobbers require increase and standardisation; (ii) whether workmen doing work of fancy jobbers should be designated and paid as such.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Earlier reference I.D. No. 52 of 1957 between same parties decided by tribunal, award set aside by Supreme Court in A.I.R. 1961 S.C. 1179 and remanded; matter ended in compromise.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Workmen's claim: Wages of mistries and line jobbers low despite representations; seek increase, standardisation, incremental pay scales.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Workmen doing fancy jobbers' work wrongly designated recently as assistant fancy jobbers; seek designation as fancy jobbers with increased standardised pay.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Appellant contended: Dulat award 1951 still in force, reference incompetent; no comparison with Swatantra Bharat Mills and Delhi Cloth Mills; no incremental scales in textile industry; correct designation of assistant fancy jobbers; no application of Bombay standardisation scheme due to differences between Bombay and Delhi.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Dulat award 1951 ordered parties to work out scheme based on Bombay award No.1; parties agreed to scheme on September 29, 1951; agreement terminated November 1956; present reference made March 3, 1956.",
      "type": "background",
      "date": "1951-09-29",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Tribunal rejected incompetence of reference; held wages comparable despite differences; rejected incremental scales; held assistant fancy jobbers are fancy jobbers; applied Bombay scheme to mistries, line jobbers, fancy jobbers; protected higher existing wages; directed joint committee for anomalies.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Tribunal refused appellant's evidence on Bombay scheme and witnesses from Bombay/Kanpur on January 6, 1958.",
      "type": "procedural",
      "date": "1958-01-06",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Evidence from Manoharlal (WW 19, Swatantra Bharat Mills): Followed Bombay scheme voluntarily for workers, not mistries/jobbers; some categories paid more.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Evidence from B.L. Saxena (Delhi Cloth Mills): Line jobbers/mistries wages sometimes higher/at par, not brought under Bombay scheme; no fixed grade.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Bombay scheme has three categories for fancy work: head fancy jobber, fancy jobber, assistant fancy jobber.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the reference was competent given Dulat award of 1951.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether workmen designated as assistant fancy jobbers should be designated as fancy jobbers.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Bombay standardisation scheme should be applied to appellant's mistries, line jobbers, fancy jobbers without evidence/modification.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Validity of tribunal's direction for joint committee to investigate anomalies.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Validity of direction protecting existing higher wages without lowering them under standardisation scheme.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Reference incompetent as Dulat award 1951 still in force; agreed scheme of 1951 part of award.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No comparison with Swatantra Bharat Mills/Delhi Cloth Mills; incremental scales not provided in textile industry.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Assistant fancy jobbers correctly designated; Bombay scheme inapplicable due to differences between Bombay/Delhi.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Tribunal unfairly refused evidence on Bombay scheme.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Joint committee leaves dispute unresolved; protecting higher wages against standardisation principle.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Wages low, need increase/standardisation/incremental scales for mistries/line jobbers; wrongly designated as assistant fancy jobbers.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Dulat award does not bar reference; earlier Supreme Court judgment rejected similar contention; 1951 agreement not settlement under s.2(p) Industrial Disputes Act.",
      "addresses_issue": "i1",
      "key_observation": "Reference competent."
    },
    {
      "id": "cr2",
      "text": "Tribunal correctly held recent designation as assistant fancy jobbers a device to depress status; should be designated fancy jobbers.",
      "addresses_issue": "i2",
      "key_observation": "Agree with tribunal."
    },
    {
      "id": "cr3",
      "text": "Tribunal wrongly applied Bombay scheme following set-aside earlier award without evidence; refused appellant's witnesses; other Delhi mills not under scheme; need comparison of work categories.",
      "addresses_issue": "i3",
      "key_observation": "Remand for reconsideration with evidence."
    },
    {
      "id": "cr4",
      "text": "Joint committee direction leaves dispute for parties; tribunal must decide itself.",
      "addresses_issue": "i4",
      "key_observation": "Set aside direction."
    },
    {
      "id": "cr5",
      "text": "Protecting existing higher wages protects posts not individuals, against standardisation; if protect individuals, as personal pay with conditions: no further raises, absorb in increments, no claim on vacancy.",
      "addresses_issue": "i5",
      "key_observation": "Set aside direction; tribunal to decide on remand."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Reference competent.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Assistant fancy jobbers to be designated fancy jobbers.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Bombay scheme application requires fresh consideration with evidence, possible modification.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "No joint committee; tribunal to decide anomalies.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h5",
      "text": "No protection of higher wages as directed; possible individual protection as personal pay with conditions.",
      "resolves_issue": "i5",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "The Management of Birla Cotton Spinning and Weaving Mills Ltd. v. Its workmen",
      "citation": "A.I.R. 1961 S.C. 1179",
      "treatment": "followed",
      "relevance": "Set aside earlier tribunal award in I.D. 52/1957; competence of reference; remand directions; joint committee invalid; standardisation principles."
    },
    {
      "case_name": "Daru v. Ahmedabad Spinning and Manufacturing Company Limited",
      "citation": "1955 1 L.L.J. 355",
      "treatment": "referred",
      "relevance": "Principles of standardisation scheme: equal wages for same work; higher wages reducible to scheme level."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 2(p)",
        "s. 19(2)"
      ],
      "relevance": "1951 agreement not a settlement; does not bar reference."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal allowed; tribunal award set aside in part regarding Bombay scheme application, joint committee, wage protection; case remanded to tribunal for rehearing on wages increase/standardisation for mistries, line-jobbers, fancy jobbers with liberty to lead evidence.",
    "relief_granted": "Remand to Industrial Tribunal, Delhi for reconsideration per judgment.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The whole purpose of a standardisation scheme is to standardise wages and where they are low to raise them to the standardised level. Similarly where the wages are high they have to be reduced.\"",
      "speaker": "court",
      "significance": "Core principle of standardisation schemes."
    },
    {
      "text": "\"It would not be against the basic principle of standardisation... to protect the wages of individual workmen who might be getting more than the wages fixed in the standardisation scheme at the time when such a scheme is brought into force.\"",
      "speaker": "court",
      "significance": "Allows discretionary individual protection with conditions."
    }
  ],
  "_case_id": "1962_299",
  "_label": 1,
  "_text_length": 27326,
  "_extracted_at": "2026-02-10T20:00:59.460795"
}