{
  "metadata": {
    "case_name": "Collector of Customs, Calcutta v. Respondent No. 1",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 383 of 1961",
    "date_of_judgment": "1962-04-30"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent had imported 2,000 drums of mineral oil.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant, the Collector of Customs, Calcutta, confiscated 50 drums by order dated September 20, 1950.",
      "type": "material",
      "date": "1950-09-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellant imposed a personal penalty of Rs. 61,000 on the respondent under the Sea Customs Act, No. 8 of 1878.",
      "type": "material",
      "date": "1950-09-20",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The respondent appealed to the Central Board of Revenue under s. 188 of the Act, and this appeal was dismissed in April 1952.",
      "type": "procedural",
      "date": "1952-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The respondent filed a petition under Art. 226 of the Constitution in the Calcutta High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Before a learned Single Judge, question raised as to jurisdiction of High Court in view of Election Commission India v. Saka Venkata Subba Rao.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Matter referred to larger bench and considered by Full Bench of Calcutta High Court.",
      "type": "procedural",
      "date": "1959-07-21",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Full Bench held no jurisdiction to issue writ against Central Board of Revenue (outside jurisdiction), but jurisdiction exists against Collector of Customs as operative order is his, since appeal merely dismissed.",
      "type": "procedural",
      "date": "1959-07-21",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Full Bench directed petition to be placed before Single Judge for disposal on merits.",
      "type": "procedural",
      "date": "1959-07-21",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Certificate granted by Calcutta High Court for appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court would have jurisdiction to issue a writ against the Collector of Customs Calcutta in spite of the fact that his order was taken in appeal to the Central Board of Revenue against which the High Court could not issue a writ and the appeal had been dismissed.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order of the original authority merges in the order of the appellate authority even where the appellate authority merely dismisses the appeal without modification.",
      "supporting_facts": [
        "f4",
        "f8"
      ],
      "legal_basis": "Principle of merger; precedents like A. Thangal Kunju Mudaliar v. M. Venkitachalam Potti; CIT v. Amritlal Bhogilal; Madan Gopal Rungta v. Secretary to Government of Orissa"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "High Court has jurisdiction over original authority within its territory even if appellate authority outside jurisdiction merely dismisses appeal.",
      "supporting_facts": [
        "f2",
        "f4",
        "f8"
      ],
      "legal_basis": "Rajasthan High Court in Barkatali v. Custodian General; State of Uttar Pradesh v. Mohammed Nooh"
    },
    {
      "id": "ra2",
      "text": "Distinction where appellate authority merely confirms without modification.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Earlier Rajasthan view before reconsideration"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "When an appeal is made, appellate authority can reverse, modify, or confirm by dismissing appeal; in all cases, operative order is appellate order.",
      "addresses_issue": "i1",
      "key_observation": "Appellate order of confirmation is as efficacious as reversal or modification."
    },
    {
      "id": "cr2",
      "text": "Issuing writ to original authority would interfere with appellate order, which High Court lacks jurisdiction over.",
      "addresses_issue": "i1",
      "key_observation": "Principle that appellate order is operative after appeal disposed of."
    },
    {
      "id": "cr3",
      "text": "Approves PEPSU, Nagpur, Allahabad High Courts; disapproves Rajasthan initial view post-Thangal Kunju.",
      "addresses_issue": "i1",
      "key_observation": "Merger applies even on mere dismissal."
    },
    {
      "id": "cr4",
      "text": "Distinguishes State of UP v. Mohammed Nooh as special case on pre-Constitution dismissal.",
      "addresses_issue": "i1",
      "key_observation": "Mohammed Nooh stands on its own facts; merger principle repelled there for specific reasons."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Once order of original authority carried in appeal to appellate authority beyond High Court's jurisdiction, High Court cannot issue writ to original authority after appeal disposed of, even if merely confirmed.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Election Commission India v. Saka Venkata Subba Rao",
      "citation": "1953 S.C.R. 1144",
      "treatment": "followed",
      "relevance": "Basis for no jurisdiction over Central Board of Revenue outside territory"
    },
    {
      "case_name": "Barkatali v. Custodian General of Evacuee Property",
      "citation": "A.I.R. 1954 Raj. 214",
      "treatment": "distinguished",
      "relevance": "Held jurisdiction over original authority; later overruled by Rajasthan itself post-Thangal Kunju"
    },
    {
      "case_name": "Joginder Singh Waryam Singh v. Director, Rural Rehabilitation, Pepsu Patiala",
      "citation": "A.I.R. 1955 Pepsu 91",
      "treatment": "followed",
      "relevance": "No writ to original if appellate outside jurisdiction even on dismissal"
    },
    {
      "case_name": "Burhanpur National Textile Workers Union v. Labour Appellate Tribunal of India at Bombay",
      "citation": "A.I.R. 1955 Nag. 148",
      "treatment": "followed",
      "relevance": "Merger on appeal dismissal"
    },
    {
      "case_name": "Azmat Ullah v. Custodian, Evacuee Property",
      "citation": "A.I.R. 1955 All. 435",
      "treatment": "followed",
      "relevance": "Merger doctrine applies"
    },
    {
      "case_name": "A. Thangal Kunju Mudaliar v. M. Venkitachalam Potti",
      "citation": "1955 2 S.C.R. 1196",
      "treatment": "followed",
      "relevance": "Approved PEPSU, Nagpur, Allahabad views on merger"
    },
    {
      "case_name": "Commissioner of Income-tax v. Messrs. Amritlal Bhogilal and Company",
      "citation": "1959 S.C.R. 713",
      "treatment": "followed",
      "relevance": "Appellate decision operative even on confirmation; original merges"
    },
    {
      "case_name": "Madan Gopal Rungta v. Secretary to the Government of Orissa",
      "citation": "1962 Supp. 3 S.C.R. 966",
      "treatment": "followed",
      "relevance": "Appellate order effective; distinguished Mohammed Nooh"
    },
    {
      "case_name": "State of Uttar Pradesh v. Mohammed Nooh",
      "citation": "1958 S.C.R. 595",
      "treatment": "distinguished",
      "relevance": "Special facts of pre-Constitution dismissal; merger not applicable there"
    }
  ],
  "statutes_cited": [
    {
      "name": "Sea Customs Act, 1878",
      "sections": [
        "s. 188"
      ],
      "relevance": "Appeal to Central Board of Revenue"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Writ petition jurisdiction"
    },
    {
      "name": "Mineral Concession Rules, 1949",
      "sections": [
        "r. 60"
      ],
      "relevance": "Effective order in Madan Gopal case"
    },
    {
      "name": "Mines and Minerals (Regulation and Development) Act, 1948",
      "sections": [
        "No. 53 of 1948"
      ],
      "relevance": "Context for Mineral Concession Rules"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court held that the Calcutta High Court lacks jurisdiction to issue a writ against the Collector of Customs once the appeal was dismissed by the Central Board of Revenue, which is beyond its territorial jurisdiction, due to the merger of the original order in the appellate order.",
    "relief_granted": "Appeal allowed; High Court's jurisdiction decision overturned",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In law, the appellate order of confirmation is quite as efficacious as an operative order as an appellate order of reversal or modification.\"",
      "speaker": "court",
      "significance": "Core reasoning on merger doctrine applying to confirmation"
    },
    {
      "text": "\"There can be no doubt that, if an appeal is provided against an order passed by a tribunal, the decision of the appellate authority is the operative decision in law.\"",
      "speaker": "court",
      "significance": "Quote from CIT v. Amritlal adopted to affirm merger principle"
    },
    {
      "text": "\"Mohammad Nooh's case was a special case, which stands on its own facts.\"",
      "speaker": "court",
      "significance": "Distinguishes key respondent precedent"
    }
  ],
  "_case_id": "1962_30",
  "_label": 1,
  "_text_length": 15614,
  "_extracted_at": "2026-02-10T19:56:33.457610"
}