{
  "metadata": {
    "case_name": "Gajendra Narain Singh v. Johri Mal Prahlad Rai",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 268 of 1960",
    "date_of_judgment": "1962-11-13"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plaintiffs Ms. Johri Mal Prahlad Rai commenced action against Ms. Tirhut Umbrella Works, a firm at Laheriasarai, Bihar, in City Civil Court, Bombay, for Rs. 20,320/- with costs and interest.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Summons served upon Gajendra Narain Singh at Road 8, R Block, Patna, Bihar, as a partner of the defendant firm.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On April 22, 1953, Mr. D. B. Tilak, advocate engaged by Singh, filed Vakalatnama signed by Singh authorising him to act, appear and plead in the suit.",
      "type": "procedural",
      "date": "1953-04-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Chamber summons for directions for trial as commercial cause served on Singh.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On September 9, 1953, Mr. Tilak wrote to plaintiffs' attorneys requesting adjournment to file written statement; by consent, chamber summons adjourned for a fortnight.",
      "type": "procedural",
      "date": "1953-09-09",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On September 24, 1953, Mr. Tilak informed court that Singh claimed not to be a partner and orally prayed for withdrawal of appearance; court declined oral request, directed appropriate proceedings if advised, transferred suit to commercial causes list and gave directions.",
      "type": "procedural",
      "date": "1953-09-24",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On November 27, 1953, Mr. Tilak appeared, submitted Singh not a partner, prayed withdrawal of appearance filed without protest and adjournment; both rejected, Tilak withdrew with leave, suit heard ex parte.",
      "type": "procedural",
      "date": "1953-11-27",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "City Civil Court recorded evidence of plaintiffs' witness, admitted correspondence, decreed suit as prayed; decree forwarded to District Judge, Patna, with certificate of non-satisfaction.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Plaintiffs applied for leave to execute decree against Singh under O. 21, r. 50(2) CPC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Singh contested: not a partner, not liable for firm debts, not served as partner, appeared individually, informed court not a partner.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "District Judge, Patna, by order dated May 12, 1955, held execution could not be against Singh under O. 21 r. 50(1)(b) or (c) as partnership undecided by City Civil Court, and on evidence Singh not a partner; rejected execution.",
      "type": "procedural",
      "date": "1955-05-12",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Patna High Court in appeal reversed District Judge, held plaintiffs entitled as of right to execute under O. 21 r. 50(1)(b) against Singh; directed execution to proceed; granted certificate under Art. 133(1)(a).",
      "type": "procedural",
      "date": "1958-09-05",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Singh admitted served with summons; High Court concluded served as partner, supported by evidence and presumption under O. 30 r. 5.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Singh did not produce original summons before District Judge.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the decree against the firm is executable against Singh under O. 21 r. 50(1)(b) CPC without leave under sub-r. (2), given he was served as partner, appeared without protest under O. 30 r. 6, and later sought withdrawal.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Singh was served as a partner and his appearance deemed on behalf of the firm.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Singh was not a partner of the defendant firm, not liable to satisfy its debts, not served with summons as partner, appeared in individual capacity, informed court he was not a partner.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "O. 21 r. 50(2) CPC"
    },
    {
      "id": "pa2",
      "text": "Question of partnership left undecided by City Civil Court, so execution not under O. 21 r. 50(1)(b) or (c).",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "O. 21 r. 50(1)(b), (c) CPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Plaintiffs entitled as of right to execute decree under O. 21 r. 50(1)(b) against Singh.",
      "supporting_facts": [
        "f2",
        "f3",
        "f6",
        "f7",
        "f12",
        "f13"
      ],
      "legal_basis": "O. 30 rr. 3,5,6,8; O. 21 r. 50(1)(b) CPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Summons served on Singh as partner; presumption under O. 30 r. 5 deems service as partner in default of notice; Singh admitted service; did not appear under protest per r. 8 but filed appearance via Vakalatnama and sought adjournment, deemed on behalf of firm under r. 6.",
      "addresses_issue": "i2",
      "key_observation": "Appearance filed without protest deemed on behalf of firm; withdrawal not permitted, so continued as firm appearance."
    },
    {
      "id": "cr2",
      "text": "Under O. 21 r. 50(1)(b), decree executable against person who appeared in own name under O. 30 r. 6; plaintiffs' application under r. 50(2) was mistaken but right under (1)(b) not lost; could abandon and execute under (1)(b).",
      "addresses_issue": "i1",
      "key_observation": "Singh falls under cl. (b) as appeared under r. 6 after service as partner."
    },
    {
      "id": "cr3",
      "text": "Not concerned with propriety of rejecting withdrawal; that challengeable in suit, not execution.",
      "addresses_issue": "i1",
      "key_observation": "Record establishes appearance under O. 30 r. 6, rejection of withdrawal, ex parte decree against firm executable against Singh."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Singh deemed served as partner under O. 30 r. 5; appearance without protest under r. 6 on behalf of firm; decree executable against him under O. 21 r. 50(1)(b) without leave under (2).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court right in directing execution against Singh.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order 30 r. 3",
        "Order 30 r. 5",
        "Order 30 r. 6",
        "Order 30 r. 8",
        "Order 21 r. 50(1)(b)",
        "Order 21 r. 50(1)(c)",
        "Order 21 r. 50(2)",
        "Order 21 r. 50(3)"
      ],
      "relevance": "Governs suits against firms, service of summons, appearance, execution of decrees against firms and partners."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(a)"
      ],
      "relevance": "Certificate granted for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upheld Patna High Court order directing execution of the City Civil Court decree against Singh under O. 21 r. 50(1)(b) CPC.",
    "relief_granted": "Execution of decree against Singh permitted.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"in default of such notice, the person served shall be deemed to be served as a partner.\"",
      "speaker": "court",
      "significance": "Invokes presumption under O. 30 r. 5 deeming Singh served as partner."
    },
    {
      "text": "\"The appearance so filed must be deemed to be on behalf of the firm.\"",
      "speaker": "court",
      "significance": "Determines Singh's appearance without protest as for the firm under O. 30 r. 6."
    },
    {
      "text": "\"Singh being a person who had after being served as a partner appeared under rule 6, the decree... was executable against him.\"",
      "speaker": "court",
      "significance": "Core holding on executability under O. 21 r. 50(1)(b)."
    }
  ],
  "_case_id": "1962_228",
  "_label": 0,
  "_text_length": 12618,
  "_extracted_at": "2026-02-10T20:00:09.774417"
}