{
  "metadata": {
    "case_name": "Appellant (Lessee of Pipraghat Ferry) v. Respondents (State of Uttar Pradesh)",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "C. A. No. 435 of 1958",
    "date_of_judgment": "1962-02-08"
  },
  "facts": [
    {
      "id": "f1",
      "text": "There is a ferry at village Pipraghat, district Ballia for crossing the river and the right to collect tolls is put to public auction annually. The highest bidder gets the right and pays rent or licence fee in monthly installments.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant was the highest bidder for the year 1954 and the licence fee payable by him was Rs. 31,751/-",
      "type": "material",
      "date": "1954-01-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Practice right upto 1954 was to allow the lessee to collect a toll of Rs. 5-1-0 from every stage carriage bus. Till March 9, 1954 only privately owned stage carriage buses used to ply on the route.",
      "type": "admitted",
      "date": "1954-03-09",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Thereafter the route has been taken over by the Roadways Department of the State of Uttar Pradesh.",
      "type": "material",
      "date": "1954-03-09",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "From March 9 to March 16, 1954, the appellant realised tolls at Rs. 5-1-0 from the State-owned stage carriage buses.",
      "type": "material",
      "date": "1954-03-09 to 1954-03-16",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant was informed by a letter by the first respondent that he should allow the Roadways buses to use the ferry on credit till March 31, 1954 and submit bill thereafter. Further orders on April 1, 1954.",
      "type": "procedural",
      "date": "1954-03-16",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Appellant allowed Roadways buses to cross and submitted bill on March 31, 1954 to Roadways Department, but bill was not paid.",
      "type": "material",
      "date": "1954-03-31",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "On April 1, 1954, appellant received communications: no toll leviable on Roadways vehicles; pay monthly installment without deduction.",
      "type": "material",
      "date": "1954-04-01",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Appellant moved Allahabad High Court under Art. 226 for writ directing respondents to refrain from precluding toll collection from Roadways buses, to allow abatement, interim stay on recovering installments; also general prayer for other relief.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Before petition decided, appellant's licence expired; at hearing confined to relief of mandamus for rebate on account of exemption.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Single Judge held appellant entitled to abatement under third paragraph of s.15 of the Act; directed writ for abatement before claiming arrears.",
      "type": "procedural",
      "date": "1956-09-20",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Respondents appealed under Letters Patent (Special Appeal No. 243 of 1955); Division Bench reversed: no abatement unless declaration under s.15 after grant of licence; G.O. dated Dec 11, 1951 prior to licence; abatement under general law only in suit, not Art.226.",
      "type": "procedural",
      "date": "1956-09-20",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appeal to Supreme Court by certificate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "G.O. No. 1946/17-51 dated December 11, 1951: Roadways motor vehicles exempt under notification No. 252/IX-209/10 dated March 16, 1925.",
      "type": "background",
      "date": "1951-12-11",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Notification dated March 16, 1925: Exempt all persons, animals, vehicles crossing on public or District Board service.",
      "type": "background",
      "date": "1925-03-16",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant lessee was bound to allow State carriage buses belonging to the Government of Uttar Pradesh to cross the river by the ferry without collecting any toll or was entitled to claim abatement of rent from the Government under the proviso to s.15 of the Northern India Ferries Act 1878.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Roadways buses fall under exemption for vehicles 'employed or transmitted on the public service' under the 1925 notification issued under s.15.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Entitled to collect tolls from Roadways buses or abatement of rent under s.15 due to exemption; petition under Art.226 for mandamus to allow tolls/abatement.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5",
        "f7",
        "f8"
      ],
      "legal_basis": "Art. 226 Constitution; s.15 Northern India Ferries Act 1878"
    },
    {
      "id": "pa2",
      "text": "Roadways buses carry passengers for commercial undertaking, do not come within 1925 exemption for public service.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Notification dated March 16, 1925"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No toll leviable on Roadways vehicles; appellant not entitled to abatement as G.O. 1951 prior to licence grant; abatement under general law only in suit, not Art.226.",
      "supporting_facts": [
        "f6",
        "f8",
        "f14"
      ],
      "legal_basis": "s.15 Northern India Ferries Act 1878; G.O. dated Dec 11, 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "For abatement under s.15 proviso, valid exemption declaration required; G.O. 1951 merely interprets 1925 notification as exempting Roadways buses under 'public service'.",
      "addresses_issue": "i1",
      "key_observation": "1925 notification exempts vehicles on public or District Board service."
    },
    {
      "id": "cr2",
      "text": "Roadways buses not on 'public service': commercial profit-making activity like private operators, not sovereign/governmental function; mere public utility/benefit insufficient if profit motive and carryable by private individuals.",
      "addresses_issue": "i2",
      "key_observation": "UP Roadways is profit-making by excluding competition."
    },
    {
      "id": "cr3",
      "text": "No exemption, thus no abatement; appellant confined to abatement at HC hearing due to misunderstanding, but original petition unamended with general prayer allows alternative relief.",
      "addresses_issue": "i1",
      "key_observation": "Petition contains prayer for other relief."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Roadways buses not entitled to exemption under 1925 notification as not on public service; lessee entitled to tolls.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Writ of mandamus issues directing payment of full tolls for Roadways buses crossings from March 16, 1954 to licence expiry.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Northern India Ferries Act, 1878",
      "sections": [
        "s. 15",
        "s. 8"
      ],
      "relevance": "Toll levy, exemption declaration by State Govt, abatement of rent if declaration after lease."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Writ of mandamus against respondents."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgments of Division Bench and Single Judge of Allahabad High Court set aside; writ of mandamus directed to respondents to pay appellant full tolls for every crossing of Roadways buses over Pipraghat ferry from March 16, 1954, to date of licence expiry.",
    "relief_granted": "Payment of tolls @ Rs. 5-1-0 per bus crossing from March 16, 1954 to end of licence period.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Could it be said that plying motor buses by way of commercial activity is running it on a public service?\"",
      "speaker": "court",
      "significance": "Central to holding that Roadways buses not exempt."
    },
    {
      "text": "\"By reason of the fact that a commercial undertaking is owned and run by the State it does not ipso facto become a public service.\"",
      "speaker": "court",
      "significance": "Key observation distinguishing govt commercial activity from public service."
    },
    {
      "text": "\"It is not disputed before us that the Roadways department of the Government of U. P. is running a profit making and a profitable activity by excluding every kind of competition.\"",
      "speaker": "court",
      "significance": "Basis for denying exemption."
    }
  ],
  "_case_id": "1962_13",
  "_label": 1,
  "_text_length": 13224,
  "_extracted_at": "2026-02-10T19:56:34.238054"
}