{
  "metadata": {
    "case_name": "Appellants v. Respondent",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Criminal Appeal No. 79 of 1960",
    "date_of_judgment": "1962-05-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The three appellants carry on the trade of auctioning vegetables in a private house in the subzimandi quarter.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Vegetables are brought in carts which are parked on the public road outside the building where the auctioning takes place, causing some amount of inconvenience to people who pass by the public road.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "There was some dispute between these appellants and the Municipal Board.",
      "type": "background",
      "date": null,
      "source": "appellants"
    },
    {
      "id": "f4",
      "text": "An order under s. 133 of the Code of Criminal Procedure was passed against the appellants.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Allahabad High Court dismissed the application for revision of the order under s. 133 CrPC on August 18, 1959, in Criminal Revision No. 947 of 1959.",
      "type": "procedural",
      "date": "1959-08-18",
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether action can be taken under clause (1) of s. 133 CrPC against the appellants for unlawful obstruction or nuisance on the public road caused by carts parked outside their private house during vegetable auctioning.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the conduct of the auctioning trade is injurious to the health or physical comfort of the community under clause (2) of s. 133 CrPC, justifying prohibition of the trade.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There was a dispute with the Municipal Board which was behind the move to get the order under s. 133 passed.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court's opinion that business causing obstruction to passersby can be prohibited even if carried on in private property is put too widely.",
      "addresses_issue": "i1",
      "key_observation": "Proposition stated too widely."
    },
    {
      "id": "cr2",
      "text": "Section 133 CrPC empowers Magistrates to remove public nuisances; clause (1) applies to unlawful obstruction or nuisance from public ways or places.",
      "addresses_issue": "i1",
      "key_observation": "Appellants cannot be considered persons causing the obstruction by carts on road."
    },
    {
      "id": "cr3",
      "text": "Obstruction, if any, caused by persons bringing carts, not by appellants conducting auction inside private house.",
      "addresses_issue": "i1",
      "key_observation": "Action possible against cart owners, not appellants."
    },
    {
      "id": "cr4",
      "text": "Under clause (2), noise from auctioning is a necessary concomitant of buying and selling large quantities and not injurious to health or physical comfort.",
      "addresses_issue": "i2",
      "key_observation": "Some discomfort from trades in city localities must be borne for community good."
    },
    {
      "id": "cr5",
      "text": "Slight discomfort to passersby or neighbours from noise cannot justify action under s. 133 CrPC.",
      "addresses_issue": "i2",
      "key_observation": "Legislature did not intend stoppage of such necessary trades."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellants cannot be considered to have caused unlawful obstruction under clause (1) of s. 133 CrPC.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Conduct of auctioning vegetables causing some noise is not injurious to health or physical comfort under clause (2) of s. 133 CrPC.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "The orders under s. 133 CrPC are not justified.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 133 (clauses 1 and 2)"
      ],
      "relevance": "Empowers Magistrate to remove public nuisances like unlawful obstruction or trade injurious to health or physical comfort; held inapplicable here."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal by special leave is allowed; the High Court's order dismissing revision is set aside as the orders under s. 133 CrPC are not justified.",
    "relief_granted": "Quashing of orders under s. 133 CrPC",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "when it is clear that the business of auctioning vegetables cannot be carried on without causing obstruction to the passers by, the conduct of the business can be prohibited, even though it if carried on in a private [house]. It seems to us that this proposition has been put too widely.",
      "speaker": "court",
      "significance": "Rejects High Court's broad view on prohibiting private business causing public inconvenience."
    },
    {
      "text": "the slight discomfort that may be caused to some people passing by the road or living in the neighbourhood cannot ordinarily be considered to be such as to justify action under s. 133 of the Code of Criminal Procedure.",
      "speaker": "court",
      "significance": "Core holding limiting scope of s. 133 to serious nuisances, not minor discomforts from lawful trades."
    }
  ],
  "_case_id": "1962_48",
  "_label": 1,
  "_text_length": 5518,
  "_extracted_at": "2026-02-10T19:57:06.913214"
}