{
  "metadata": {
    "case_name": "Associated Stone Industries Kotah Ltd. v. Union of India",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Associated Stone Industries Kotah Ltd. incorporated in 1945 under Indian Companies Act, 1913 as applied to Kotah State, registered office at Ramganjmandi, District of Kotah.",
      "type": "background",
      "date": "1945",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Maharajah of Kotah granted lease to appellant for limestone mines in two tahsils for 15 years from October 1, 1944 to September 30, 1959. Clause 18 provided royalty at Re. 1 per 100 sq. ft. (subject to minimum Rs. 1,50,000 per year) in consideration of concessions and privileges, in lieu of income-tax, super-tax and excess profits tax, with increase if selling rate exceeds Rs. 10 per 100 sq. ft.",
      "type": "material",
      "date": "1945-05-02",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant claims grant expressed will of Sovereign Ruler, exempting from income-tax, super-tax, excess profits tax under existing or future enactments.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Kotah State integrated into United State of Rajasthan, became Part B State of Rajasthan on January 26, 1950.",
      "type": "background",
      "date": "1950-01-26",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Finance Act, 1950 extended Indian Income-tax Act, 1922 to Part B State of Rajasthan.",
      "type": "procedural",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Commissioner of Income-tax for Rajasthan and Income-tax Officer at Kotah appointed by Government of India.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Income-tax Officer served notice under section 22(2) of Income-tax Act for assessment year 1950-51; appellant objected and moved High Court of Rajasthan under Article 226, obtained writ on December 14, 1951 restraining Union from action under Income-tax Act for period prior to April 1, 1950.",
      "type": "procedural",
      "date": "1950-1951",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Income-tax Officer demanded return for 1951-52; appellant submitted under protest.",
      "type": "procedural",
      "date": "1951-1952",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Income-tax Officer demanded return for 1952-53; appellant moved High Court under Article 226, obtained ad interim injunction.",
      "type": "procedural",
      "date": "1952-1953",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant withdrew writ petition and instituted suit on December 15, 1953 in Court of District Judge, Kotah against Union of India (defendant No.1) and State of Rajasthan, praying declaration that Union not entitled to recover income-tax etc. during continuance of grant, and that application of Income-tax Act violates Article 295.",
      "type": "procedural",
      "date": "1953-12-15",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "District Judge framed 11 issues, gave findings on most, referred issue No.11 (reliefs) to High Court under section 113 CPC, opining Income-tax Act invalid for plaintiff by virtue of grant.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court doubted competence of reference but withdrew suit under Article 228 as substantial constitutional question arose; formulated question on whether Article 295 and clause 18 fetter legislative power under Article 245; answered against appellant; rejected arguments on section 3 Government Grants Act 1895 and Article 31; returned suit to District Judge.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "High Court granted certificate under Article 132; present appeal confined to constitutional questions.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether by virtue of the grant dated May 2, 1945, particularly clause 18, the Indian Income-tax Act, 1922 is invalid so far as the appellant is concerned during continuance of the grant.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether in view of Article 295 and clause 18 of the grant, legislative power of Union under Article 245 is fettered so that Union cannot pass law taking away exemption in clause 18.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Grant of May 2, 1945, particularly clause 18 granting exemption from income-tax etc., was law and continued in force in Kotah despite Finance Act, 1950.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "By reason of Article 295, Union Legislature could not make law derogating from rights, liabilities and obligations under clause (b) of Article 295(1).",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Article 295"
    },
    {
      "id": "pa3",
      "text": "Argument based on section 3 of Government Grants Act, 1895.",
      "supporting_facts": [],
      "legal_basis": "Section 3, Government Grants Act XV of 1895"
    },
    {
      "id": "pa4",
      "text": "Argument based on Article 31 of the Constitution.",
      "supporting_facts": [],
      "legal_basis": "Article 31"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Both points urged by appellant dealt with in detail in Maharaja Shree Umaid Mills Ltd. v. Union of India; grant dated May 2, 1945 was not law and did not continue as such in Kotah.",
      "addresses_issue": "i1",
      "key_observation": "Grant not law"
    },
    {
      "id": "cr2",
      "text": "Article 295(1)(b) did not invalidate Finance Act, 1950 extending Income-tax Act, 1922 to Rajasthan including Kotah.",
      "addresses_issue": "i2",
      "key_observation": "Article 295 does not fetter legislative power under Article 245"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Grant dated May 2, 1945 was not law and did not continue as such in Kotah in spite of Finance Act, 1950.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Article 295(1)(b) did not invalidate Finance Act, 1950 which extended Indian Income-tax Act, 1922 to territories of State of Rajasthan including Kotah.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Maharaja Shree Umaid Mills Ltd. v. Union of India",
      "citation": null,
      "treatment": "followed",
      "relevance": "Reasons given therein applied to hold grant not law and Article 295(1)(b) does not invalidate Finance Act, 1950"
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 132",
        "Article 226",
        "Article 295",
        "Article 245",
        "Article 228",
        "Article 31"
      ],
      "relevance": "Basis for appeal certificate, writs, substantial question withdrawal, legislative power fetter claim"
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 22(2)"
      ],
      "relevance": "Extended to Part B States; notices served; claimed invalid for appellant"
    },
    {
      "name": "Finance Act, 1950",
      "sections": [],
      "relevance": "Extended Income-tax Act to Part B State of Rajasthan"
    },
    {
      "name": "Government Grants Act, XV of 1895",
      "sections": [
        "Section 3"
      ],
      "relevance": "Argument rejected by High Court"
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 113",
        "Order XLVI Rule 2"
      ],
      "relevance": "Reference by District Judge; procedure not followed"
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [],
      "relevance": "Incorporation of appellant"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal confined to constitutional questions dismissed; held grant not law and Article 295(1)(b) does not invalidate extension of Income-tax Act via Finance Act, 1950; other issues for High Court on appeal from District Judge.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In consideration of the company concessions and privileges granted by the grantor and in lieu of income-tax super-tax and excess profit tax the grantee company tenants to pay to the grantor royalty on the stone excavated at the rate of rupee on per 100 sq. ft. subject to the minimum amount of Rs. 1,50,000 per financial year\"",
      "speaker": "court",
      "significance": "Text of clause 18 central to exemption claim"
    },
    {
      "text": "\"the grant dated May 2, 1945, was not law and did not continue as such in Kotah\"",
      "speaker": "court",
      "significance": "Core holding on status of grant"
    }
  ],
  "_case_id": "1962_276",
  "_label": 0,
  "_text_length": 9298,
  "_extracted_at": "2026-02-10T20:00:16.193113"
}