{
  "metadata": {
    "case_name": "Assessee v. Commissioner of Income-tax",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": "Civil Appeals Nos. 10 to 12 of 1962",
    "date_of_judgment": "1962-08-31"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In certain assessment proceedings under the Indian Income-tax Act, 1922, the assessee was charged with interest under sub-sec. 8 of s. 18A.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The assessee company had not been assessed before, so sub-sec. 3 of s. 18A applied, requiring it to make its own estimate of advance tax payable and pay accordingly.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The assessee neither submitted any estimate nor paid any tax in advance.",
      "type": "admitted",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f4",
      "text": "There are three orders charging interest under s.18A(8), one for each of three assessment years.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Assessee's contention rejected by Appellate Commissioner but accepted by Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondent Commissioner obtained reference to Punjab High Court on the question of construction of s.18A sub-secs 6,8,9.",
      "type": "procedural",
      "date": "1960-02-05",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "High Court answered the question against the assessee.",
      "type": "procedural",
      "date": "1960-02-05",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Payment of advance tax under s.18A to be made on June 15, September 15, December 15, and March 15 in each financial year.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on a true construction of sub-Sections 6, 8 and 9 of Section 18A of the Indian Income-tax Act, the interest referred to in sub-Section 8 is chargeable for failure on the part of an assessee to submit an estimate of his income and pay tax, as required by the terms of sub-Section 3 of that Section.",
      "framed_by": "high_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Since no tax was paid at all, it is not possible to calculate interest in the manner laid down in sub-sec. 6, as there is no 'first day of January in the financial year in which the tax was paid' from which calculation commences, and no shortfall between 80% of assessed tax and amount paid.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Literal construction of sub-secs. 6 and 8 of s.18A; rule from Cape Brandy Syndicate v. Inland Revenue Commission"
    },
    {
      "id": "pa2",
      "text": "Sub-sec. 8 has no operation in a case where no tax paid, so assessee cannot be charged interest.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Taxing statutes to be construed strictly: 'In a taxing Act one has to look merely at what is clearly said. There is no room for any intendment.'"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Interest under sub-sec. 8 is chargeable even for failure to submit estimate and pay tax under sub-sec. 3.",
      "supporting_facts": [
        "f2",
        "f3",
        "f6"
      ],
      "legal_basis": "Sub-secs. 6 and 8 are machinery provisions for calculating interest liability clearly imposed by sub-sec. 8; construe to make machinery workable (utres valeat potius quam pereat)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sub-sec. 8 clearly imposes liability for interest where no payment of tax made in accordance with s.18A; sub-sec. 6 lays down machinery for its calculation.",
      "addresses_issue": "i1",
      "key_observation": "Provisions dealing with machinery for assessment to be construed to make charge effective, not strictly as charging provisions."
    },
    {
      "id": "cr2",
      "text": "Read sub-sec. 6 as applying 'from the 1st day of January in the financial year in which the tax ought to have been paid'; shortfall is entire 80% where nothing paid.",
      "addresses_issue": "i1",
      "key_observation": "This makes provision workable without defeating intent of sub-sec. 8; those who underpay and those who don't pay at all put in same position."
    },
    {
      "id": "cr3",
      "text": "Sub-sec. 9 for penalty does not affect construction of sub-secs. 6 and 8; interest is not penalty.",
      "addresses_issue": "i1",
      "key_observation": "Penalty under s.28 via sub-sec.9 is additional and for different reasons."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Interest under s.18A(8) is chargeable for failure to submit estimate and pay advance tax under s.18A(3), calculated per machinery in s.18A(6) adapted for non-payment cases.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Cape Brandy Syndicate v. Inland Revenue Commission",
      "citation": "1921 1 K.B. 64, 71",
      "treatment": "followed",
      "relevance": "Rule of strict construction for taxing provisions: look merely at what is clearly said."
    },
    {
      "case_name": "A. V. Fernandez v. The State of Kerala",
      "citation": "1957 S.C.R. 837, 847",
      "treatment": "followed",
      "relevance": "No tax if not covered within four corners of taxing statute; no inference or analogy."
    },
    {
      "case_name": "Commissioner of Income-tax v. Mahaliram Ramjidas",
      "citation": "A.I.R. 1940 P.C. 124,126-127",
      "treatment": "followed",
      "relevance": "Machinery provisions in taxing statutes to be construed to make workable (utres valeat potius quam pereat)."
    },
    {
      "case_name": "India United Mills Ltd. v. Commissioner of Excess Profits Tax",
      "citation": "1955 1 S.C.R. 810, 816",
      "treatment": "followed",
      "relevance": "Machinery sections to effectuate charging sections."
    },
    {
      "case_name": "Whitney v. Commissioners of Inland Revenue",
      "citation": "1925 10 T.C. 88, 110",
      "treatment": "referred",
      "relevance": "Once liability fixed, statute designed to be workable; interpretation to secure that object."
    },
    {
      "case_name": "Allen v. Trehearne",
      "citation": "1938 22 T.C. 15",
      "treatment": "followed",
      "relevance": "Rules for assessment and collection to be interpreted largely to effectuate liability."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "18A(1)",
        "18A(2)",
        "18A(3)",
        "18A(6)",
        "18A(8)",
        "18A(9)",
        "18",
        "28"
      ],
      "relevance": "Advance payment of tax; liability and calculation of interest for underpayment or non-payment; penalty provisions."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals are dismissed and the decision of the High Court answering the question in favour of the Revenue is upheld.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In a taxing Act one has to look merely at what is clearly said. There is no room for any intendment. There is no equity about a tax.\"",
      "speaker": "court",
      "significance": "Cites strict construction rule but distinguishes as not applying to machinery provisions."
    },
    {
      "text": "Sub-section 8 intended to and did in the clearest term impose a charge for interest... this provision only lays down the machinery for assessing the amount of interest.",
      "speaker": "court",
      "significance": "Key to holding: separates charging provision from machinery."
    },
    {
      "text": "We, therefore, think that we should read sub-sec. 6... in a manner which makes it workable and thereby prevent the clear intention of sub-sec. 8 being defeated.",
      "speaker": "court",
      "significance": "Explains purposive construction for machinery to effectuate liability."
    }
  ],
  "_case_id": "1962_302",
  "_label": 0,
  "_text_length": 16214,
  "_extracted_at": "2026-02-10T20:00:55.549360"
}