{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. M.R. Vidyasagar",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "SHAH, J."
    ],
    "case_number": "Civil Appeal Nos. 545 and 546 of 1960",
    "date_of_judgment": "1962-01-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Ramaswami Iyer-father of the respondent- was assessed to income-tax in the status of a Hindu Undivided Family.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Ramaswami Iyer died in 1949 and the respondent M.R. Vidyasagar became the manager of the family.",
      "type": "background",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The family was a partner through its manager in a firm styled The Madura Knitting Company, and the share in the profits of the partnership which was registered under the Indian Income-tax Act was the principal source of its assessable income.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Under s. 18A of the Indian Income-tax Act, the Hindu undivided family was liable to pay advance tax for each of the assessment years 1946-47, 1947-48 and 1948-49.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Income-tax Officer, Madura, issued notices under s. 18A(1) of the Indian Income-tax Act for payment of advance tax on the basis of the preceding years income.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Ramaswami Iyer-who was at the material time the manager-availed himself of the option to submit a revised estimate and estimated the income for each of the assessment years 1946-47 and 1948-49 at Rs. 45,000/- .",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The assessments of these two years were completed respectively on November 28, 1950 and February 29, 1951, and the income received from the Madura Knitting Company was included in the assessments under s. 23(5).",
      "type": "procedural",
      "date": "1950-11-28",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Income Tax Officer assessed the total income of the Hindu undivided family for the year 1946-47 at Rs. 1,01,335/- and for the year 1948-49 at Rs. 3,10,697/-.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "As the total income assessed far exceeded the estimate of Rs. 45,000/-, submitted by the manager of the assessee family, the Income Tax Officer in making the assessment ordered the respondent to pay Rs. 6,999/12/- and Rs. 36,687/- respectively for the assessment years 1946-47 and 1948-49 as interest.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In appeals against the orders of assessment by the Madura Knitting Company, by order dated March 12, 1954 the Income-tax Appellate Tribunal reduced the income of the firm, and on that basis reduced the share of the family in the income of the firm for the year 1946-47 to Rs. 83,335/- and for the year 1948-49 to Rs. 2,83,868/-.",
      "type": "procedural",
      "date": "1954-03-12",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The Income-tax Officer, Madura, in giving effect to the orders passed by the Appellate Tribunal under the 3rd proviso to s. 18A(6) reduced the interest to Rs. 4,358/- for the year 1946-47 and to Rs. 32,714/10/- for the year 1948-49, and called upon the respondent to pay the arrears of tax inclusive of interest so adjusted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The respondent then called upon the Income Tax Officer not to levy interest under s. 18A(6) submitting that the levy was illegal and unjustified, and in the alternative requested that the interest be waived under the powers vested under the 5th proviso to s. 18A(6) which was added by s. 13 of the Indian Income-tax Amendment Act 25 of 1953.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The Income-tax Officer declined to accede to the request and the respondents application to the Inspecting Assistant Commissioner for cancelling the levy of interest was also rejected.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The respondent then moved two petitions Nos. 743 and 748 under Art. 226 of the Constitution in the High Court of Judicature at Madras for writs cancelling the orders imposing liability for payment of interest.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "A Division Bench of the Madras High Court held that the provision imposing liability to pay interest under sub-s. (6) of s. 18A was not opposed to law and could be enforced against the legal representative of the deceased manager, who was a partner of the assessee firm.",
      "type": "procedural",
      "date": "1954-08-13",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "The High Court was of the view that as the Income-tax Officer and the Inspecting Assistant Commissioner had failed to consider whether in the circumstances of the case, the reduction or waiver of the interest was justified, it ordered that the Income-tax Officer to decide whether the petitioner had made out a case for the exercise of the discretion vested in the Income-tax Officer to waive or reduce the interest under the powers conferred on him by the 5th proviso of cl. (6) of s. 18A.",
      "type": "procedural",
      "date": "1954-08-13",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Against that order with certificates of fitness these appeals are preferred by the Commissioner of Income Tax.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "The order of the Appellate Tribunal was passed on March 12, 1954, i.e. after the date on which Act 25 of 1953 came into operation.",
      "type": "procedural",
      "date": "1954-03-12",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the benefit of the fifth proviso to s. 18A(6) could be claimed in respect of the assessments of the income of the respondents family which were completed by the Income-tax Officer before April 1, 1952.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether in an assessment subject to an appeal which is pending, or which may be lawfully filed, the power to reduce or waive the interest under the fifth proviso to s. 18A(6) can be exercised even if the regular assessment was completed before April 1, 1952.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The power conferred by the fifth proviso may undoubtedly be exercised in those cases where assessment is completed on or after April 1, 1952, but where the assessment was completed and liability to pay interest had crystallized under sub-s. 6 as it originally stood, the Income-tax Officer has no power under the amended sub-section to reduce or waive the interest ordered to be paid by the assessee even if the proceedings in assessment are pending in appeal before the Appellate Assistant Commissioner or the Appellate Tribunal.",
      "supporting_facts": [
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": "s. 18A(6) as originally enacted"
    },
    {
      "id": "pa2",
      "text": "The interest under s. 18A(6) is payable upto the date of the regular assessment and if in the contingencies prescribed by s. 18A(6), as originally enacted liability to pay interest crystallized, the Income-tax Officer could not, in exercise of the power invested by the amending Act reopen the order, because the legislature had given to the amending statute only a partial retroactive operation.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Indian Income-tax Amendment Act, 1953 (25 of 1953)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The levy of penal interest was opposed to law and was prima facie, unjustified on the facts and circumstances of the case.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "s. 18A(6)"
    },
    {
      "id": "ra2",
      "text": "The levy of interest under s. 18A(6) was penal in character and could not be imposed upon the legal representative of the deceased manager who was not in any manner responsible for the original return filed by the firm of which the manager was a partner.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "s. 18A(6)"
    },
    {
      "id": "ra3",
      "text": "The levy was not warranted by the provisions of the Indian Income-tax Act inasmuch as in respect of the assessment years in question the respondent was not the assessee, that the delay in completing the assessment was not attributable either to the then manager of the family, Ramaswami Iyer or to himself and therefore, no liability for payment of interest could be imposed.",
      "supporting_facts": [
        "f2",
        "f7"
      ],
      "legal_basis": "Indian Income-tax Act"
    },
    {
      "id": "ra4",
      "text": "In any event refusal to cancel the levy of interest was arbitrary and not based on any judicial exercise of discretion vested in the Income-tax Officer.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "5th proviso to s. 18A(6)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 18A which imposes liability upon the tax payer to make advance payment of tax was incorporated into the Indian Income-tax Act by Act 11 of 1944. That section enables the Income-tax Officer... [detailed explanation of sub-ss. (1), (2), (6)].",
      "addresses_issue": "i1",
      "key_observation": "As originally enacted the liability to pay interest... was absolute. The Income-tax Officer had no discretion... But by s. 13 of the Indian Income-tax Amendment Act, 1953 (25 of 1953), an additional proviso was enacted to sub-s. (6)... This proviso was given retrospective effect as from April 1, 1952."
    },
    {
      "id": "cr2",
      "text": "Thereafter in exercise of powers conferred by s. 59 the Central Board of Revenue added Rule 48... The effect of the incorporation of the 5th proviso in s. 18A(6) and of Rule 48 was manifestly to authorise the Income Tax Officer in exercise of his discretion to relieve against the rigour of the inflexible rule originally enacted.",
      "addresses_issue": "i1",
      "key_observation": "The only question... is whether the benefit of the fifth proviso to s. 18A(6) could be claimed in respect of the assessments... completed... before April 1, 1952."
    },
    {
      "id": "cr3",
      "text": "There is, in our judgment, inherent evidence in the rule indicating that such a power can be exercised even if the regular assessment is completed by the Income-tax Officer before April 1, 1952. The power vested in the Income-tax Officer... is exercisable in such cases or such circumstances as may be prescribed by the Rules.",
      "addresses_issue": "i2",
      "key_observation": "By Rule 48... where the assessment is completed more than one year after the submission of the return the delay in assessment not being attributable to the assessee-the power... may be exercised. There is nothing in the Rule which indicates that the power... may be exercised only before the regular assessment is completed."
    },
    {
      "id": "cr4",
      "text": "The argument that liability to pay interest crystallizes when the Income-tax Officer incorporates the direction for payment of interest... has no force. The order for payment of interest was liable to be modified if the assessment of income was varied by the Appellate Assistant Commissioner, or by the Tribunal.",
      "addresses_issue": "i2",
      "key_observation": "If therefore the quantum of liability was capable of being altered even after the date of the regular assessment, the assumption that the power to give relief... should be restricted to cases which are decided... only after April 1, 1952, is not warranted."
    },
    {
      "id": "cr5",
      "text": "In our judgment, the jurisdiction under the fifth proviso may be exercised by the Income-tax Officer in all cases which are pending on April 1, 1952, before the Income-tax Officer or any superior authority having... power to modify the assessment of income, or are commenced after that date.",
      "addresses_issue": "i2",
      "key_observation": "In the present case, the original assessments... were modified in view of the orders passed by the Appellate Tribunal... The Income-tax Officer being bound to adjust liability to pay interest under cl. (6) of s. 18A we see no reason why in adjusting that liability he may not exercise the powers with which he has been invested since April, 1952."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Income-tax officer had the power in the case of the assessments in question to exercise the authority conferred by the fifth proviso to s. 18A(6) and he having failed to exercise the discretion, a writ requiring him to consider whether a case is made out for the exercise of his discretion was properly issued.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The jurisdiction under the fifth proviso may be exercised by the Income-tax Officer in all cases which are pending on April 1, 1952, before the Income-tax Officer or any superior authority having under the Income-tax Act power to modify the assessment of income, or are commenced after that date.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s. 18A(1)",
        "s. 18A(2)",
        "s. 18A(6)",
        "s. 23(5)",
        "s. 59"
      ],
      "relevance": "Imposes liability for advance tax payment, interest on shortfall, and discretion to waive/reduce interest"
    },
    {
      "name": "Indian Income-tax Amendment Act, 1953 (Act 25 of 1953)",
      "sections": [
        "s. 13"
      ],
      "relevance": "Added 5th proviso to s. 18A(6) with retrospective effect from April 1, 1952, allowing reduction/waiver of interest"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Basis for writ petitions filed by respondent"
    },
    {
      "name": "Income-tax Rules",
      "sections": [
        "Rule 48"
      ],
      "relevance": "Prescribes cases and circumstances for Income-tax Officer to reduce or waive interest under s. 18A(6)"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Madras High Court's order directing the Income-tax Officer to consider whether to exercise discretion under the 5th proviso to s. 18A(6) to reduce or waive the interest, as the assessments were subject to modification post-April 1, 1952, following the Appellate Tribunal's order.",
    "relief_granted": "Writ directing ITO to consider waiver/reduction of interest upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "In our judgment, the jurisdiction under the fifth proviso may be exercised by the Income-tax Officer in all cases which are pending on April 1, 1952, before the Income-tax Officer or any superior authority having under the Income-tax Act power to modify the assessment of income, or are commenced after that date.",
      "speaker": "court",
      "significance": "Core holding on applicability of the proviso to pending proceedings"
    },
    {
      "text": "The High Court was right in holding that the Income-tax officer had the power in the case of the assessments in question to exercise the authority conferred by the fifth proviso to s. 18A(6) and he having failed to exercise the discretion, a writ requiring him to consider whether a case is made out for the exercise of his discretion was properly issued.",
      "speaker": "court",
      "significance": "Affirmation of High Court order and dismissal of appeals"
    }
  ],
  "_case_id": "1962_102",
  "_label": 0,
  "_text_length": 16128,
  "_extracted_at": "2026-02-10T19:58:01.119884"
}