{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Mysore v. Mysore Sugar Co. Ltd.",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 435 of 1961",
    "date_of_judgment": "1962-05-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is a limited liability Company called the Mysore Sugar Co. Ltd., in which a very large percentage of shares is owned by the Government of Mysore.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The assessee Company purchases sugarcane from the sugarcane growers, known locally as Oppigddars, and crushes them in its factory to prepare sugar.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "As a part of its business operations, it enters into agreement with the sugarcane growers called the Oppige, by which they agree to sell sugarcane exclusively to the assessee Company at current market rates and to have the advances adjusted towards the price of sugarcane, agreeing to pay interest in the meantime. For this purpose, an account of each Oppigeddar is opened by the assessee Company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "A crop of sugarcane takes about 18 months to mature, and these agreements take place at the harvest season each year, in preparation for the next crop.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In the year 1948-49 due to drought, the assessee Company could not work its sugar mills and the Oppigedars could not grow or deliver the sugarcane. The advances made in 1948-49 thus remained unrecovered, because they could only be recovered by the supply of sugarcane to the assessee Company.",
      "type": "material",
      "date": "1948-1949",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Mysore Government realising the hardship appointed a Committee to investigate the matter and to make a report and recommendations. This report was made by the Committee on July 27, 1950.",
      "type": "procedural",
      "date": "1950-07-27",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Committee recommended that the assessee Company should ex gratia forego some of its dues, and in the year of account ending June 30, 1952, the Company waived its rights in respect of Rs. 2,87,422.",
      "type": "material",
      "date": "1952-06-30",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Company claimed this as a deduction under ss. 10(2)(xi) and 10(2)(xv) of the Indian Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The Income-tax Officer declined to make the deduction, because, in his opinion this was neither a trade debt nor even a bad debt but an ex gratia payment almost like a gift.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "An appeal to the Appellate Assistant Commissioner also failed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Before the Income-tax Appellate Tribunal, Madras Bench, these two arguments were again raised, but were rejected, the Tribunal holding that the payments were not with an eye to any commercial profit and could not thus be said to have been made out of commercial expediency, so as to attract s. 10(2)(xv) of the Act. The Tribunal also held that these were not bad debts, because they were advances, pure and simple, not arising out of sales and did not contribute to the profits of the business.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "From the order of reference, it appears that the Appellate Tribunal was also of the opinion that these advances were made to ensure a steady supply of quality sugarcane, and that the loss, if any, must be taken to represent a capital loss and not a trading loss.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The Appellate Tribunal referred the question for the opinion of the High Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "High Court of Mysore dated September 7, 1959, answered the question in favour of the respondent: Whether there are materials for the tribunal to hold that the sum of Rs. 2,87,422 aforesaid represents a loss of capital.",
      "type": "procedural",
      "date": "1959-09-07",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Appeal by the Commissioner of Income-tax, Mysore, on a certificate granted under s. 66A of the Indian Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there are materials for the tribunal to hold that the sum of Rs. 2,87,422 represents a loss of capital.",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Whether the amount waived is deductible under s. 10(1), s. 10(2)(xi) or s. 10(2)(xv) of the Indian Income-tax Act, or whether it represents a capital loss.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "This was neither a trade debt nor even a bad debt but an ex gratia payment almost like a gift.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "ss. 10(2)(xi) and 10(2)(xv)"
    },
    {
      "id": "pa2",
      "text": "The payments were not with an eye to any commercial profit and could not thus be said to have been made out of commercial expediency, so as to attract s. 10(2)(xv) of the Act.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "s. 10(2)(xv)"
    },
    {
      "id": "pa3",
      "text": "These were not bad debts, because they were advances, pure and simple, not arising out of sales and did not contribute to the profits of the business.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "s. 10(2)(xi)"
    },
    {
      "id": "pa4",
      "text": "The loss represents a capital loss and not a trading loss.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The expenditure was not in the nature of a capital expenditure, and was deductible as a revenue expenditure.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "s. 10(1); Badridas Daga v. Commissioner of Income-tax"
    },
    {
      "id": "ra2",
      "text": "Claimed deduction under ss. 10(2)(xi) and 10(2)(xv).",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "ss. 10(2)(xi), 10(2)(xv)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The central point to decide is whether the money which was given up, represented a loss of capital, or must be treated as a revenue expenditure.",
      "addresses_issue": "i2",
      "key_observation": "Profits or gains must be calculated after deducting outgoings reasonably attributable as business expenditure but so as not to deduct any portion of an expenditure of a capital nature."
    },
    {
      "id": "cr2",
      "text": "To find out whether an expenditure is on the capital account or on revenue, one must consider the expenditure in relation to the business. Questions to consider: for what was the money laid out? Was it to acquire an asset of an enduring nature for the benefit of the business, or was it an outgoing in the doing of the business?",
      "addresses_issue": "i2",
      "key_observation": "If money be lost in the first circumstance, it is a loss of capital, but if lost in the second circumstance, it is a revenue loss."
    },
    {
      "id": "cr3",
      "text": "Cited English cases to distinguish between expenditure by way of investment (capital) and expenditure in the course of business (revenue/current expenditure).",
      "addresses_issue": "i2",
      "key_observation": "The amount was an advance against price of one crop... represented the current expenditure towards the purchase of sugarcane."
    },
    {
      "id": "cr4",
      "text": "The resulting loss to the assessee Company was just as much a loss on the revenue side as would have been, if it had paid for the ready crop which was not delivered.",
      "addresses_issue": "i1",
      "key_observation": "There was hardly any element of investment which contemplates more than payment of advance price."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The sum of Rs. 2,87,422 does not represent a loss of capital but a revenue loss deductible in computing the profits.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Advances were made as advance payment of price for sugarcane, representing current expenditure in the course of business, not capital investment.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Badridas Daga v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "High Court relied on it to hold amount deductible under s. 10(1)"
    },
    {
      "case_name": "Commissioner of Income-tax v. Chitnavis",
      "citation": "1932 L.R. 59 I.A. 290",
      "treatment": "followed",
      "relevance": "s. 10(2) does not deal exhaustively with deductions; accepted by this Court"
    },
    {
      "case_name": "English Crown Spelter Co. Ltd v. Baker",
      "citation": "1908 5 T.C. 327",
      "treatment": "referred",
      "relevance": "Advances as investment of capital, not ordinary trade advance against goods"
    },
    {
      "case_name": "Charles Marsden Sons Ltd v. The Commissioners of Inland Revenue",
      "citation": "1919 12 T.C. 217",
      "treatment": "referred",
      "relevance": "Advance to secure supplies held capital expenditure, not advance payment for goods"
    },
    {
      "case_name": "Reids Brewery Co. Ltd v. Male",
      "citation": "1891 3 T.C. 279",
      "treatment": "referred",
      "relevance": "Advances in course of business (as bankers/money lenders to customers) deductible as revenue, not capital investment"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "s. 66A",
        "s. 10(1)",
        "s. 10(2)(xi)",
        "s. 10(2)(xv)"
      ],
      "relevance": "Tax on profits and gains of business after certain allowances; bad debts under (2)(xi); business expenditure not capital under (2)(xv); central issue of deductibility"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's judgment, holding that the waiver of Rs. 2,87,422 was a revenue loss deductible in computing business profits, not a capital loss.",
    "relief_granted": "Deduction allowed to assessee",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The central point to decide is whether the money which was given up, represented a loss of capital, or must be treated as a revenue expenditure.",
      "speaker": "court",
      "significance": "Frames the core issue"
    },
    {
      "text": "If money be lost in the first circumstance, it is a loss of capital, but if lost in the second circumstance, it is a revenue loss.",
      "speaker": "court",
      "significance": "Key test for capital vs revenue distinction"
    },
    {
      "text": "The resulting loss to the assessee Company was just as much a loss on the revenue side as would have been, if it had paid for the ready crop which was not delivered.",
      "speaker": "court",
      "significance": "Concludes in favor of revenue loss"
    }
  ],
  "_case_id": "1962_137",
  "_label": 0,
  "_text_length": 13548,
  "_extracted_at": "2026-02-10T19:58:32.620931"
}