{
  "metadata": {
    "case_name": "Chairman, Municipal Committee, Howrah v. Respondent Company",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Criminal Appeal No. 240 of 1959",
    "date_of_judgment": "1962-03-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent company carrying on manufacture of bobbins, card pine, shuttles etc. at premises No. 1 Swarnamoyee Road, Howrah, and storing wood and timber there.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Charge against respondent: using premises without license under s. 386 of Calcutta Municipal Act III of 1923 as extended to Howrah Municipality, guilty under s. 488.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Premises licensed as warehouse under West Bengal Fire Services Act, 1950.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Respondent running factory with workshops fitted with electric power in premises for manufacture.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Magistrate convicted respondent under s. 488, sentenced to fine of Rs. 250, holding s. 38 of Fire Services Act took away power for warehouse but s. 386 remained for factory/other uses.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Additional Sessions Judge modified: s. 38 partially repeals s. 386(3) on fees, license under s. 386(1) still required but no fees if licensed as warehouse, reduced fine to Rs. 10.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "High Court in revision: no power to levy fees under s. 386 if premises licensed as warehouse under Fire Services Act, even if part used as workshop; dismissed revision.",
      "type": "procedural",
      "date": "1959-07-15",
      "source": "high_court"
    },
    {
      "id": "f8",
      "text": "Calcutta Municipal Act extended to Howrah Municipality by Gazette Notification No. 260M dated 18th January 1932 under ss. 540, 541; s. 386 modified by substituting 'Commissioners' for 'Corporation of Calcutta'.",
      "type": "background",
      "date": "1932-01-18",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Calcutta Municipal Act 1951 (WB Act 33 of 1951) repealed 1923 Act, but provisions as extended to Howrah continue under s. 614 until new extension.",
      "type": "background",
      "date": "1951",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether s. 38 of West Bengal Fire Services Act, 1950 repeals s. 386 of Calcutta Municipal Act, 1923 as modified and extended to Howrah Municipality.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Howrah Municipality governed by Calcutta Municipal Act as extended falls under s. 38 of Fire Services Act which references s. 386 for Calcutta Corporation and s. 370 Bengal Municipal Act for others.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "s. 38 of West Bengal Fire Services Act could not affect operation of s. 386 of Calcutta Municipal Act as extended to Howrah; Howrah neither under Calcutta Corporation nor Bengal Municipal Act s. 370.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "s. 38 West Bengal Fire Services Act; ss. 540, 541, 542 Calcutta Municipal Act 1923; Gazette Notification 18.1.1932"
    },
    {
      "id": "pa2",
      "text": "s. 386 as applied to Howrah modified ('Commissioners' substituted for 'Corporation'), so not repealed by s. 38 which targets original s. 386.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "s. 386 Calcutta Municipal Act as modified"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Premises licensed as warehouse under Fire Services Act, so s. 38 repeals requirement for license or fees under s. 386 Calcutta Municipal Act.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "s. 38 West Bengal Fire Services Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s. 38 deems repealed s. 386 Calcutta Municipal Act (for Corporation of Calcutta) and s. 370 Bengal Municipal Act (for other municipalities) insofar as levying fees for premises licensed as warehouse under Fire Services Act.",
      "addresses_issue": "i1",
      "key_observation": "Howrah Municipality governed by modified s. 386 (word 'Commissioners' substituted), which is not the s. 386 targeted by s. 38."
    },
    {
      "id": "cr2",
      "text": "Extension under ss. 540, 541 created amended s. 386 for Howrah, distinct from original; s. 38 does not affect modified version.",
      "addresses_issue": "i2",
      "key_observation": "Incorporated provisions not affected by later amendments to original Act unless expressly applicable."
    },
    {
      "id": "cr3",
      "text": "Similar to Secretary of State v. Hindusthan Insurance: amendments to referenced Act do not automatically apply to incorporated provisions in subsequent Act.",
      "addresses_issue": "i2",
      "key_observation": "Possible for subsequent Act to function without addition."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s. 38 of West Bengal Fire Services Act does not repeal s. 386 of Calcutta Municipal Act as modified and applicable to Howrah Municipality.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Howrah Municipality's modified s. 386 remains operative; license and fees under it required despite Fire Services Act license.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Secretary of State for India v. Hindusthan Co-operative Insurance Society",
      "citation": "1931 L.R. 58 I.A. 259",
      "treatment": "followed",
      "relevance": "Amendments to original Act (Land Acquisition Act) do not apply to its provisions incorporated into subsequent Act (Calcutta Improvement Act)."
    },
    {
      "case_name": "Ex parte St. Sepulchres",
      "citation": "1869 33 L.J. Ch. 372, 376",
      "treatment": "referred",
      "relevance": "Quoted with approval: no addition to incorporated provisions from later amendments to original Act if subsequent Act can function without."
    }
  ],
  "statutes_cited": [
    {
      "name": "Calcutta Municipal Act, 1923 (Act III of 1923)",
      "sections": [
        "s. 386",
        "s. 488",
        "s. 540",
        "s. 541",
        "s. 542"
      ],
      "relevance": "s. 386 requires license for user as factory/warehouse; extended/modified to Howrah; basis of conviction."
    },
    {
      "name": "West Bengal Fire Services Act, 1950 (Act 18 of 1950)",
      "sections": [
        "s. 38"
      ],
      "relevance": "Deems repealed fee-levy provisions of s. 386 Calcutta Act (Calcutta) and s. 370 Bengal Act (others) for licensed warehouses; held inapplicable to modified Howrah s. 386."
    },
    {
      "name": "Bengal Municipal Act, 1932",
      "sections": [
        "s. 370"
      ],
      "relevance": "Repealed for Howrah upon extension of Calcutta Act; referenced in s. 38 Fire Services Act."
    },
    {
      "name": "Calcutta Municipal Act, 1951 (West Bengal Act 33 of 1951)",
      "sections": [
        "s. 589",
        "s. 590",
        "s. 591",
        "s. 614"
      ],
      "relevance": "Repealed 1923 Act but continued extended provisions for Howrah."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal by special leave allowed; contention of appellant upheld that s. 38 Fire Services Act does not repeal modified s. 386 applicable to Howrah; High Court order set aside implicitly restoring lower court position on license requirement.",
    "relief_granted": "Appellant's right to require license and levy fees under s. 386 affirmed for Howrah premises.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"s. 38 of the West Bengal Fire Services Act does not repeal s. 386 as modified and as applicable to the Municipality of Howrah.\"",
      "speaker": "court",
      "significance": "Core holding reversing High Court."
    },
    {
      "text": "\"It seems to be no less logical to hold that where certain provisions from an existing Act have been incorporated into a subsequent Act, no addition to the former Act... can be deemed to be incorporated in it.\"",
      "speaker": "court",
      "significance": "Explains why amendments do not apply to modified/incorporated provisions."
    }
  ],
  "_case_id": "1962_191",
  "_label": 1,
  "_text_length": 12409,
  "_extracted_at": "2026-02-10T19:59:21.014229"
}