{
  "metadata": {
    "case_name": "M/s. Gandhara Transport Co. Ltd. v. Regional Transport Authority & Ors.",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 200 of 1962",
    "date_of_judgment": "1962-10-31"
  },
  "facts": [
    {
      "id": "f1",
      "text": "By order dated October 23, 1956, the Regional Transport Authority, Patiala, granted a permit to one Manohar Singh for plying a stage carriage on the Bhatinda Khera Via Bajekhanna Jaitu-Kot-Kapura route which was about 55 miles long. This route covered 35 miles of the Bhatinda-Kot-Kapura-Faridkot route for which the appellants, M/s. Gandhara Transport Co. Ltd., held permits for plying their vehicles.",
      "type": "material",
      "date": "1956-10-23",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In appeal against the order passed by the Regional Transport Authority, the appellate authority cancelled the permit in favour of Manohar Singh.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The order of the Appellate Authority was set aside by the Minister in-charge of the Transport Department, Punjab State, in revision, and it was directed that a fresh temporary permit be granted to Manohar Singh for plying vehicles on the route for which he had been given a permit.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellants preferred a petition under Art. 226 of the Constitution before the High Court of Punjab (Civil Writ No. 315 of 1960), challenging the validity of the order passed by the Minister.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Before the writ petition could be heard, the period of the temporary permit expired and Manohar Singh applied to the Regional Transport Authority for renewal of the permit.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Regional Transport Authority issued on April 16, 1958, a notice inviting objections regarding the further renewal of the permit for a period of three years on regular basis in favour of Manohar Singh on the Bhatinda-Khera via Bajekhanna-Jaitu-Kot-Kapura.",
      "type": "procedural",
      "date": "1958-04-16",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The appellants and others filed objections to the renewal of the permit for three years on regular basis.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Regional Transport Authority posted the objections for hearing on July 30, 1958.",
      "type": "procedural",
      "date": "1958-07-30",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The appellants applied to the High Court of Punjab for an interim order directing the Regional Transport Authority to stay pronouncement of the order on the application submitted by Manohar Singh till the disposal of their petition in the High Court. By order dated July 29, 1958, the High Court rejected the application observing that it was open to the appellants to move the Regional Transport Authority to postpone announcement of its order.",
      "type": "procedural",
      "date": "1958-07-29",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The Regional Transport Authority declined to postpone announcement of its orders and on August 1, 1958, directed that a regular permit for three years be granted to Manohar Singh for the route notified.",
      "type": "material",
      "date": "1958-08-01",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On August 7, 1958, the writ petition of the appellants was heard by the High Court and it was dismissed. The High Court observed that the issue of a temporary permit in favour of Manohar Singh alone was challenged and the period having expired, no relief possible; remedy against fresh permit lies before Transport Authorities under Motor Vehicles Act.",
      "type": "procedural",
      "date": "1958-08-07",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The appellants appealed against the order of the Regional Transport Authority. The Provincial Transport Controller, Punjab, by his order dated May 29, 1959, quashed the order of the Regional Transport Authority, because Manohar Singh had merely applied for renewal of his temporary permit, no application for regular permit, procedure did not conform to law, and directed fresh allotment if necessary after formalities.",
      "type": "procedural",
      "date": "1959-05-29",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The order of the Transport Controller was set aside by the Secretary, Transport Department, State of Punjab, in exercise of revisional authority under s. 64A of the Motor Vehicles Act as amended by Punjab Act 28 of 1948.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The appellants moved the High Court of Punjab by a petition under Art. 226 for quashing the order of the Secretary, Transport Department. The High Court rejected this application, holding every argument was advanced before RTA and considered, proper forum is transport authorities.",
      "type": "procedural",
      "date": "1960-03-15",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "It was the practice in Punjab to issue all permits for stage carriages as temporary permits under s.62, and no regular permits under s.57.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The permit granted to Manohar Singh pursuant to Minister's order was a temporary permit. Manohar Singh applied not for regular permit under s.57 but for renewal of temporary permit.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Regional Transport Authority could grant a regular permit by treating an application for renewal of a temporary permit as one for a regular permit without inviting fresh applications under s.57 and following the procedure under ss.47 and 57 of the Motor Vehicles Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there is provision in the Motor Vehicles Act for renewal of a temporary permit into a regular permit.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order passed by the Secretary was illegal because it ignored the effect of the temporary permit which was the basis on which the permanent permit was granted to Manohar Singh.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "Motor Vehicles Act"
    },
    {
      "id": "pa2",
      "text": "The Secretary failed to notice that the Regional Transport Authority had not invited applications from the public for granting permit for the route and had merely notified the application for renewal of the permit of the third respondent.",
      "supporting_facts": [
        "f6",
        "f10"
      ],
      "legal_basis": "ss.47, 57 Motor Vehicles Act"
    },
    {
      "id": "pa3",
      "text": "The Act contains no provision for renewal of a temporary permit into a regular permit.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "s.58 Motor Vehicles Act (renewal only for regular permits)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Even the period of the regular permit granted to Manohar Singh has expired and irregularities cannot now be rectified; any declaration would be academic.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Every possible argument was advanced before the Regional Transport Authority and considered by that authority, and for adjudicating on the merits of the claims for and against the grant of the permit the authorities under the Motor Vehicles Act were the proper authorities.",
      "supporting_facts": [
        "f7",
        "f8",
        "f14"
      ],
      "legal_basis": "Motor Vehicles Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 62 empowers grant of temporary permits without s.57 procedure for specific temporary needs; no renewal of temporary permits contemplated, only regular under s.58.",
      "addresses_issue": "i2",
      "key_observation": "The Act does not contemplate renewal of temporary permits; only regular permits may be renewed under s.58."
    },
    {
      "id": "cr2",
      "text": "RTA invited objections to 'renewal' for three years on regular basis without indicating it was from temporary permit holder; should have invited fresh applications under s.57 as no existing regular permits.",
      "addresses_issue": "i1",
      "key_observation": "Misleading notice prevented other applicants; failed to consider matters under s.47."
    },
    {
      "id": "cr3",
      "text": "Proceedings vitiated by grave errors of procedure: entertained non-maintainable application for renewal of temporary permit, misleading objections notice, failed to apply mind to s.47 matters.",
      "addresses_issue": "i1",
      "key_observation": "RTA committed error at threshold; different considerations for temporary vs regular permits."
    },
    {
      "id": "cr4",
      "text": "Necessary to declare true legal position to avoid repetition of mistakes in fresh applications; not academic as would give undue benefit to Manohar Singh under s.58(2) proviso.",
      "addresses_issue": "i1",
      "key_observation": "Manohar Singh not entitled to preference as holder of invalid regular permit."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The order of the Regional Transport Authority granting a permit in favour of Manohar Singh was unlawful due to vitiated procedure.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act, 1939",
      "sections": [
        "47",
        "57",
        "58",
        "62",
        "64A"
      ],
      "relevance": "Governs grant, renewal, temporary permits, considerations for stage carriage permits, revisional powers; procedure under s.57 mandatory for regular permits, not followed."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "226"
      ],
      "relevance": "Basis for writ petitions challenging transport authority orders."
    },
    {
      "name": "Punjab Act 28 of 1948",
      "sections": [],
      "relevance": "Amends Motor Vehicles Act for Punjab."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court set aside the order of the Punjab High Court dated March 15, 1960, and declared that the order of the Regional Transport Authority dated August 1, 1958, granting a regular permit to Manohar Singh was unlawful for procedural irregularities.",
    "relief_granted": "Declaration that RTA's grant of permit unlawful; to guide future proceedings.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Act, however, does not contemplate renewal of temporary permits only regular permits may be renewed under s. 58 of the Act.",
      "speaker": "court",
      "significance": "Core holding on no renewal of temporary permits."
    },
    {
      "text": "Its proceedings were, therefore, in our judgment, vitiated on account of grave errors of procedure.",
      "speaker": "court",
      "significance": "Reason for quashing RTA order."
    },
    {
      "text": "The mere fact that respondent No. 4 Manohar Singh held a temporary permit is not the only ground on which the permanent permit has to be granted to him.",
      "speaker": "high_court",
      "significance": "High Court's observation distinguished by SC."
    }
  ],
  "_case_id": "1962_308",
  "_label": 1,
  "_text_length": 14242,
  "_extracted_at": "2026-02-10T20:01:00.501750"
}