{
  "metadata": {
    "case_name": "Nand Kumar, Brij Kishore alias Kalua, Lakhan and Murari v. State",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Criminal Appeal No. 181 of 1961",
    "date_of_judgment": "1962-05-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On June 4, 1960, eight boys - Munna son of Manohar Lal, Ram Prakash son of Ram Baboo, Laxmi son of Vidhya Ram, Pooran son of Gulab Chand, Kedar son of Ram Kumar, Mohan son of Banke Lal, Suresh son of Chandra Shekhar, and Jagdish son of Mitthan Lal, all of Dholpur City - went to the temple of Mangal Bharti for a picnic.",
      "type": "background",
      "date": "1960-06-04",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "None of the eight boys returned home on June 4, 1960.",
      "type": "material",
      "date": "1960-06-04",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "On the morning of June 6, 1960, all eight boys were found dead near a well in Gundarai forest. Each body bore numerous injuries which caused the deaths. Seven bodies were naked, Munna's had clothes. Hands tied behind with ribbons of trousers, mouths gagged. Watches, rings, buttons, and currency notes missing.",
      "type": "material",
      "date": "1960-06-06",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Four appellants - Nand Kumar, Brij Kishore alias Kalua, Lakhan, Murari - along with Jagdish convicted by Additional Sessions Judge under s.302, s.377, s.395 IPC. Death sentences under s.302. High Court confirmed convictions under s.302 and s.395; confirmed death for Nand Kumar, Kalua, Lakhan; reduced Murari's to life imprisonment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Prosecution case: Appellants and Jagdish joined boys at Mangal Bharti temple on June 4, 1960. Took boys one by one into lane behind temple, robbed belongings by force. Took boys to Gundarai forest instead of Dholpur. Agreed to murder them. Waited near pillar till 9:30 pm. Jagdish and Murari kept watch (Jagdish armed with gun). Nand Kumar, Kalua, Lakhan killed boys one by one using Murari's knife.",
      "type": "material",
      "date": "1960-06-04",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "After murders, booty distributed: Nand Kumar - Agfa camera and wrist watch of Munna; Lakhan - wrist watch and ring of Ram Prakash; Kalua - wrist watch and ring of Laxmi (S.K. Gupta); Murari - four buttons and cash; Jagdish - buttons and cash.",
      "type": "material",
      "date": "1960-06-04",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Puran (also at Mangal Bharti) informed relatives he saw boys with Nand Kumar, Kalua, Jagdish, Murari. Enquiries at their houses - all absent.",
      "type": "background",
      "date": "1960-06-04",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "June 5, 1960, 6 a.m.: Shiv Narain (Munna's brother) lodged FIR at Kotwali police Dholpur about disappearance, suspecting Panna dacoits gang.",
      "type": "procedural",
      "date": "1960-06-05",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "June 5, 1960, 10 p.m.: Circle Inspector Bhanwar Singh contacted appellants. All five made statements about keeping articles from boys.",
      "type": "procedural",
      "date": "1960-06-05",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "June 6, 1960, 4 a.m.: Circle Inspector with DSP, Nand Kumar, others went to Gundarai. Nand Kumar pointed cycles, dead bodies, knife Ex-18 from bush near body. At his house, produced camera, wrist watch, blood-stained clothes.",
      "type": "material",
      "date": "1960-06-06",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Murari produced gold ring (R.P. Gupta), wrist watch (R.P. Gupta), blood-stained clothes, four buttons, currency notes.",
      "type": "material",
      "date": "1960-06-06",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Kalua produced wrist watch, ring (S.K. Gupta), blood-stained clothes.",
      "type": "material",
      "date": "1960-06-06",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Confessions recorded by SDM: Nand Kumar June 14, Kalua June 15, Murari June 16, Lakhan statement June 15, 1960.",
      "type": "procedural",
      "date": "1960-06-14",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Accused pleaded not guilty, denied confessions and recoveries.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Jail register entry for Nand Kumar on June 14: argued altered from 10.25 to 1.25.",
      "type": "disputed",
      "date": "1960-06-14",
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Delay in sending for confessions (from June 6). Circle Inspector Paras Singh visited judicial lock-up June 13. Accused in solitary cells.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Knife Ex-18 identified by PW 14 Ram Singh as Murari's, long knife with special button.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Blood on recovered clothes was human blood.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the confessions of Nand Kumar, Kalua, and Murari were voluntary and admissible in evidence.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether there was sufficient corroboration of the retracted confessions to establish the truth of the accused's participation in the crime.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Nand Kumar made any confessional statement before the Magistrate (specific plea regarding jail register and timing).",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether Lakhan could be convicted under s.302 IPC without his own confession, based on circumstances and co-accused confessions.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Confessions not voluntary: delay of a week in sending to Magistrate; Circle Inspector Paras Singh visited lock-up on June 13; accused kept in solitary cells.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No sufficient corroboration to establish truth of retracted confessions.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Nand Kumar made no confessional statement; record Ex-62 fabricated; jail register altered from 10.25 to 1.25, so not present during recording.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Denied recoveries of articles.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellants joined picnic, robbed boys, conspired to murder, killed them in Gundarai forest using Murari's knife, distributed booty. Recoveries and confessions corroborate.",
      "supporting_facts": [
        "f5",
        "f6",
        "f10",
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": "s.302, s.377, s.395 IPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Jail register not altered; Magistrate's testimony reliable; Nand Kumar present and confessed.",
      "addresses_issue": "i3",
      "key_observation": "No evidence of alteration; even if mistake, corrected to 1.25."
    },
    {
      "id": "cr2",
      "text": "Confessions voluntary: no gain from delay; Paras Singh visit unrelated (prosecution offered to examine, defence objected); solitary cells for safety, not inducement.",
      "addresses_issue": "i1",
      "key_observation": "Confessions rightly admitted."
    },
    {
      "id": "cr3",
      "text": "Retracted confessions need corroboration in material particulars by independent evidence. Here, presence at picnic, recoveries of specific booty and blood-stained clothes by accused themselves, discovery of bodies and knife under s.27 Evidence Act provide overwhelming corroboration for Nand Kumar, Kalua, Murari.",
      "addresses_issue": "i2",
      "key_observation": "Parts integrally connected; prudent to believe participation."
    },
    {
      "id": "cr4",
      "text": "For Lakhan: presence at picnic, recovery of booty (ring and watch of Ram Prakash), blood-stained clothes produced by him; plus co-accused confessions. Sufficient for common intention under s.302.",
      "addresses_issue": "i4",
      "key_observation": "Circumstances almost sufficient alone."
    },
    {
      "id": "cr5",
      "text": "Motive unnecessary as evidence overwhelming; convictions under s.395 also justified.",
      "addresses_issue": "i1",
      "key_observation": "Death sentences only possible for three; no interference with life for Murari."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Confessions of Nand Kumar, Kalua, Murari voluntary and admissible; sufficiently corroborated by independent evidence.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Nand Kumar made confessional statement; record genuine.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Retracted confessions corroborated in material particulars (presence, recoveries, discoveries); participation proved.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Lakhan guilty under s.302 by circumstances and co-accused statements.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "Convictions under s.302 and s.395 IPC confirmed.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "377",
        "395"
      ],
      "relevance": "Convictions for murder, unnatural offences, dacoity confirmed."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "27"
      ],
      "relevance": "Statements leading to discovery of facts (bodies, knife, articles) admissible."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed. Convictions and sentences under s.302 (death for Nand Kumar, Kalua, Lakhan; life for Murari) and s.395 IPC confirmed. No interference with High Court's leniency to Murari.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Courts ordinarily consider it unsafe to convict any accused person on the basis of his retracted confession except where the truth of such confession is established by corroboration in material particular by independent evidence.",
      "speaker": "court",
      "significance": "States test for retracted confessions."
    },
    {
      "text": "More than this is not needed, less than this is ordinarily insufficient.",
      "speaker": "court",
      "significance": "Defines sufficiency of corroboration."
    },
    {
      "text": "The fact remains proved by overwhelming evidence that these four did actually commit the murder of the eight innocent boys.",
      "speaker": "court",
      "significance": "Affirms guilt despite motive speculation."
    }
  ],
  "_case_id": "1962_50",
  "_label": 0,
  "_text_length": 23030,
  "_extracted_at": "2026-02-10T19:57:19.555865"
}