{
  "metadata": {
    "case_name": "Appellants v. Respondents Nos. 1 to 16",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J"
    ],
    "case_number": "Civil Appeal No. 204 of 1960",
    "date_of_judgment": "1962-11-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On February 2, 1924, the appellants 1 & 2, their father late Matooki Mandal and their uncle late Lila Mandal executed a deed purporting to convey a property of the extent of 12.6 acres in favour of respondents 1 & 2 for a consideration of Rs. 2,800/- and put them in possession of the same.",
      "type": "material",
      "date": "1924-02-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Executants executed a registered Sudbharna bond, dated 1-3-1923, in favour of Deonath Bhagat and Raghunath Bhagat (respondents 1 & 2) and received the entire consideration money thereunder. The total area mortgaged was 13.17 acres for Rs. 1,600/-.",
      "type": "background",
      "date": "1923-03-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1950 the appellants instituted title suit No. 73 of 1950 in the Court of the Munsif, 1st Court, Bhagalpur, Bihar for redemption on the ground that the said document was a mortgage by conditional sale.",
      "type": "procedural",
      "date": "1950",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Contestant defendants i.e., respondents 1 & 2 pleaded that the said document was not a mortgage but an out and out sale and therefore the suit for redemption was not maintainable.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The Munsif accepted the contention of the appellants and decreed the suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "On appeal the Subordinate Judge, Bhagalpur, accepted the contention of the appellants and decreed the suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On second appeal the Patna High Court held that the document was a sale and on that finding the appeal was allowed and the suit was dismissed with costs throughout. Judgment and decree dated March 31, 1958 in Appeal from Appellate Decree No. 582 of 1954.",
      "type": "procedural",
      "date": "1958-03-31",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The appellants preferred the present appeal by special leave against the decree and judgment of the High Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Out of the consideration money of Rs. 2,800/-, Rs. 1,600/- due under the bond dated 1-3-1923 was paid up in full; dues of Sumeri Kapri amounting to Rs. 500/- paid; balance of Rs. 700/- used for other expenses.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The sum of Rs. 2,800/- represents the real value of the land sold to the respondents.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the suit document is a mortgage by conditional sale or a sale with a condition of repurchase.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The consideration of the document went mainly in the discharge of a registered sudbharna bond dated March 1, 1923, given in favour of the respondents 1 & 2. It indicates that relationship of creditor and debtor was continued under the document.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "There are no words of conveyance in the document. There are no words of re-conveyance after the stipulated date.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "There is a term that if there was a defect in the title and the vendees were dispossessed the executants would be liable to refund the consideration with interest with a charge on the property conveyed by the document. The term creating a charge on the property transferred indicates that the executants continued to be the owners of the land despite the document.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "The executants took upon themselves the liability of the entire rent for 1331 fasli though the document was executed in the Magh of 1331 fasli. The fact that the executants continued to be liable to pay for a period after the execution of the sale deed indicates that the document was not an out and out sale but one in which the appellants continued to have an interest in the land.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "In the execution portion of the document it is described as tamashuk sarti kebala and the said expression means mortgage conditional sale.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The said document was not a mortgage but an out and out sale and therefore the suit for redemption was not maintainable.",
      "supporting_facts": [
        "f1",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "There is a clear legal distinction between the two concepts - a mortgage by conditional sale and a sale with a condition of repurchase. The former is a mortgage, the relationship of debtor and creditor subsists and the right to redeem remains with the debtor. The latter is an out and out sale whereby the owner transfers all his rights in the property to the purchaser reserving a personal right of re-purchase. The question to which category a document belongs presents a real difficulty which can only be solved by ascertaining the intent of the parties on a consideration of the contents of a document and other relevant circumstances.",
      "addresses_issue": "i1",
      "key_observation": "Decided cases have laid down many tests to ascertain the intentions of the parties but they are only illustrative and not exhaustive."
    },
    {
      "id": "cr2",
      "text": "It is not accurate to say that the suit document was executed only to discharge the mortgage bond dated March 1, 1923. The document itself narrates that the executants were badly in need of money not only for repaying the debt under the said bond but also for repaying the debts of one Sumeri Kapri and for meeting the expenses in connection with cultivation, purchase of bullocks and household.",
      "addresses_issue": "i1",
      "key_observation": "It is therefore not a document executed in renewal of an earlier mortgage bond but was brought into existence to meet the pressing demands on the appellants."
    },
    {
      "id": "cr3",
      "text": "The document says in express terms that the property was sold and vended, which are certainly words of conveyance, and that after the prescribed period and after the amount was paid the appellants would take back the vended property from the respondents which are again words of reconveying.",
      "addresses_issue": "i1",
      "key_observation": "Though the words of conveyance and reconveyance are not expressed in phraseology found in documents prepared by trained draftsmen, they are expressed in words usually adopted by village document writers."
    },
    {
      "id": "cr4",
      "text": "The taking over of the liability to pay the rent by the executants for a short period subsequent to the execution of the document may be due to the fact that the rent had become due before the execution of the document or for some other circumstance which is not clear from the document. This is at best a neutral circumstance.",
      "addresses_issue": "i1",
      "key_observation": "Neutral circumstance."
    },
    {
      "id": "cr5",
      "text": "The fact that in case of any defect in title the vendees were dispossessed, the consideration amount with interest was charged on the property is nothing more than an indication of the intention to keep alive the mortgagees rights under the earlier document. The said clause only makes explicit what the respondents would be entitled to in law.",
      "addresses_issue": "i1",
      "key_observation": "Refutes retention of ownership."
    },
    {
      "id": "cr6",
      "text": "The translation of the words tamashuk sarti kebala as mortgage by conditional sale does not appear to be correct. If those words were literally translated, they would mean a bond by way of conditional sale. If that was the meaning the said expression would be consistent both with a mortgage by conditional sale as well as a sale with a right of repurchase.",
      "addresses_issue": "i1",
      "key_observation": "Neutral circumstance."
    },
    {
      "id": "cr7",
      "text": "The executants describe the transaction as a sale and respondents as vendees. The amount paid is described as consideration for the sale. Usual covenant of title is given and there is a provision of re-conveyance in case of payment of the prescribed amount within the time agreed upon.",
      "addresses_issue": "i1",
      "key_observation": "These recitals would be found in a document which purports to be an ostensible sale and they do not in themselves are decisive but there is one factor which dispels any doubt."
    },
    {
      "id": "cr8",
      "text": "The total area of the land mortgaged in the year 1923 was 13.17 acres for Rs. 1,600/-. Only one year thereafter out of the said extent 12.6 acres was transferred by the document in question for a sum of Rs. 2,800/-. It is improbable that a mortgagee would advance an additional amount and take a mortgage of a smaller extent in discharge of an earlier mortgage whereunder a larger extent of land was given as security.",
      "addresses_issue": "i1",
      "key_observation": "Unless there are extraordinary reasons for this conduct, this would be a clinching circumstance in favour of holding that a document was a sale."
    },
    {
      "id": "cr9",
      "text": "It is not disputed that the sum of Rs. 2,800/- represents the real value of the land sold to the respondents and it is highly improbable to say the least that a person would advance the amount equivalent to the value of the land mortgaged without keeping a reasonable margin for realizing his amount.",
      "addresses_issue": "i1",
      "key_observation": "A mortgagee in lending monies would insist upon a reasonable margin in the value of the property."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "On a consideration of the cumulative effect of the terms of the document in the context of the surrounding circumstances we hold that the document in question is not a mortgage but a sale with the condition of repurchase.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pandit Chunnu Jha v. Sheikh Ebadat Ali",
      "citation": "1955 1 S.C.R. 174",
      "treatment": "distinguished",
      "relevance": "Decision turned upon crucial circumstance of executants borrowing money post-sale to continue mutation proceedings, absent here; smaller extent sold for higher amount distinguishes this case."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The conclusion arrived at by the High Court that the document is a sale with condition of repurchase, not a mortgage, is correct.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "There is a clear legal distinction, between the two concepts-a mortgage by conditional sale and, a sale with a condition of repurchase. The former is a mortgage, the relationship of debtor and creditor subsists and the right to redeem remains with the debtor. The latter is an out and out sale whereby the owner transfers all his rights in the property to the purchaser reserving a personal right of re-purchase.",
      "speaker": "court",
      "significance": "Defines the core legal distinction at issue."
    },
    {
      "text": "It is improbable that a mortgagee would advance an additional amount and take a mortgage of a smaller extent in discharge of an earlier mortgage whereunder a larger extent of land was given as security.",
      "speaker": "court",
      "key_observation": "Clinching circumstance favoring sale interpretation."
    }
  ],
  "_case_id": "1962_226",
  "_label": 0,
  "_text_length": 15586,
  "_extracted_at": "2026-02-10T19:59:20.975668"
}