{
  "metadata": {
    "case_name": "Income Tax Officer v. Partners of Mafatlal Gagalbhai Sons",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "AYYANGAR, J."
    ],
    "case_number": "C. As. Nos. 502 to 505 of 1960",
    "date_of_judgment": "1962-02-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent in these four appeals are each of the four partners in a firm constituted under the name of Mafatlal Gagalbhai Sons and which was composed of Navinchandra Mafatlal, Arvind N. Mafatlal, Yoginder N.Mafatlal and Homant Mafatlal with shares of 5/16, 3/16, 3/16, and 5/16 respectively in that firm.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The firm was registered under the Indian Income Tax Act.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "There was a private limited company named Mafatlal Apte and Kantilal Limited registered under the Phaltan State Companies Act. 10 Shares in this private company stood in the name of Navin Chandra, 10 in the name of Arvind and 20 in the name of Hamant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "For the account year of the company ending September 30, 1945 the company disclosed a net profit of Rs. 1,09,165/-. The company, however, did not declare any dividend out of those profits but paid income-tax and super-tax thereon.",
      "type": "material",
      "date": "1945-09-30",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After the merger of the Phaltan State in the Indian Union and the extension of the provisions of the Indian Income Tax Act thereto, the Income Tax Officer who had jurisdiction over the assessment of the company, issued notice to it under s. 34 of the Indian Income Tax Act and acting under the provisions of s. 23A thereof directed that the undistributed assessable income of the company which amounted to Rs. 68,228/- should be deemed to have been distributed as dividend among the shareholders as on the date of the General Body Meeting of the company i.e., on March 11 1946.",
      "type": "procedural",
      "date": "1946-03-11",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Before the date of this order the assessment of the firm of Mafatlal Gagalbhai Sons and the individual assessment of its four partners had been completed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In order to bring to tax the undistributed dividend deemed to be declared under s. 23A among the shareholders of the company notices were issued to the four partners under s. 31 of the Income Tax Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In response to the notice the partners appeared and it was stated in their behalf that the 40 shares held by three of the partners in the company were in fact the property of the Registered firm and were held by them benami for the firm.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "This contention was accepted by the Income Tax Officer who thereupon treated the dividend attributable to the 40 shares as the dividend income of the firm and proceeded to apportion the said income among the four partners in the proportion of the shares which each of them held in the firm and added this to the income already assessed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In recomputing the total income of each of these four assessees he included only the net dividend to be received by each but as against this addition he allowed a deduction of the tax paid by the company attributable to such dividend.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "There was no appeal against these assessment orders which became final.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Subsequently this mistake was discovered and thereupon the Income-Tax officer issued notices to the four partners on April 13, 1954 pointing out the error in including in the income the net dividend without being grossed up, while at the same time allowing credit for the tax deemed to have been paid thereon. He averred that this was a mistake apparent from the records and stated that he intended to rectify the same under S. 35 of the Income Tax Act.",
      "type": "procedural",
      "date": "1954-04-13",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The four assessees objected to the rectification, but almost entirely of the grounds on which the objection was based related to the legality of the original assessment and the assessees desired that if any rectification was to be made it must be in relation to those items and not in regard to that for which notice had been served.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "The Income Tax Officer by his order dated October 12, 1955 rectified the assessment by grossing up the newly added dividend income by the addition of the tax deemed to have been paid by the company thereon and retained the original relief granted under s. 18(5) of the Act.",
      "type": "procedural",
      "date": "1955-10-12",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "After unsuccessfully appealing to the higher authorities for relief against this rectification the assessees filed writ petitions invoking the jurisdiction of the High Court under Arts. 226 and 227 of the Constitution for prohibiting the authorities from taking proceedings for the enforcement of the orders dated October 12, 1955.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The learned Judges allowed the petitions.",
      "type": "procedural",
      "date": "1957-01-14",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Navinchandra died subsequent to the decision of the High Court and his legal representatives have been brought on record in Civil Appeal No. 502 of 1959.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "One of the four partners Yoginder Mafatlal had no shares standing in his name and by the order of assessment under s. 34 he had been saddled with a liability to the extent of his 3/16th share in the firm, though this has been partially offset by the credit given to him, obviously wrongly, of relief under s. 18(5) of the tax deemed to have been paid by the company on that income.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the distribution to the individual partners could be deemed to be dividend-income within s. 16(2) of the Income Tax Act, given that the firm was treated as the shareholder.",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Whether the Income Tax Officer had jurisdiction under s. 35 to rectify the assessment by grossing up the dividend while retaining s. 18(5) relief, or whether this perpetuated an initial error in treating the firm as owner of all shares.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Income Tax Officer had jurisdiction under s. 35 to rectify the error of including net dividend without grossing up, while allowing credit for tax paid.",
      "supporting_facts": [
        "f10",
        "f12",
        "f14"
      ],
      "legal_basis": "Section 35 of the Income Tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Income Tax Officer had jurisdiction under s. 35 to rectify errors but not to effect merely readjustments so as to avoid illogicalities in an error which is still permitted to continue.",
      "supporting_facts": [
        "f9",
        "f10",
        "f14"
      ],
      "legal_basis": "Section 35 of the Income Tax Act"
    },
    {
      "id": "ra2",
      "text": "Objections to rectification related to the legality of the original assessment.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "This Court has held in Messrs. Howrah Trading Co., Ltd. v. The Commissioner of Income-Tax Calcutta that it is only the registered shareholder who is entitled to the benefit of the credit for tax paid by the company under s. 18(5) as well as the corresponding grossing up under s. 16(2).",
      "addresses_issue": "i2",
      "key_observation": "Only registered shareholders (three partners) entitled to ss. 16(2) and 18(5); error in treating firm as owner of all 40 shares."
    },
    {
      "id": "cr2",
      "text": "An error had therefore been committed by the Income Tax Officer in treating the registered firm as the owner of the shares in respect of the entire number of 40 shares. It was not this initial and fundamental error that was sought to be rectified by the proceedings under s. 35, but the removal of an anomaly in that error which continued to be affirmed in other words the object of the proceedings under s. 35 was to carry out to its logical conclusion the error which had been committed in the order of assessment dated October 12, 1955 passed after invoking the provisions of s. 34.",
      "addresses_issue": "i2",
      "key_observation": "Rectification perpetuated the initial error rather than correcting it."
    },
    {
      "id": "cr3",
      "text": "It is not possible to correct the initial error in these proceedings because the notice under s. 35 which is the foundation of the jurisdiction of the officer to effect the rectification, sought in reality not the correction of the error but the perpetuation of it though in an altered and less objectionable form from the point of view of Revenue.",
      "addresses_issue": "i2",
      "key_observation": "Notice u/s 35 did not seek true correction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Only the registered shareholder is entitled to the benefit of the credit for tax paid by the company under s. 18(5) as well as the corresponding grossing up under s. 16(2).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Proceedings under s. 35 cannot rectify by perpetuating an initial error in treating the firm as shareholder for all shares.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Messrs. Howrah Trading Co., Ltd. v. The Commissioner of Income-Tax Calcutta",
      "citation": "1959 Supp. 2 S.C.R. 448",
      "treatment": "followed",
      "relevance": "Only registered shareholder entitled to s. 18(5) credit and s. 16(2) grossing up."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income Tax Act",
      "sections": [
        "34",
        "23A",
        "31",
        "35",
        "16(2)",
        "18(5)"
      ],
      "relevance": "Applied to deem dividend, assess partners, rectify assessments; s.35 limited to true errors, not perpetuating mistakes."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "133(1)(c)",
        "226",
        "227"
      ],
      "relevance": "Basis for certificates and writ jurisdiction."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals are dismissed on the ground that the rectification under s.35 perpetuated the initial error of treating the firm as owner of shares registered in three partners' names, rather than correcting it, as only registered shareholders are entitled to s.16(2) and s.18(5) benefits.",
    "relief_granted": "High Court writ petitions upheld; prohibition on enforcement of rectification orders.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "it is only the registered shareholder who is entitled to the benefit of the credit for tax paid by the company under s. 18(5) as well as the corresponding grossing up under s. 16(2).",
      "speaker": "court",
      "significance": "Core legal principle applied to identify initial error."
    },
    {
      "text": "the object of the proceedings under s. 35 was to carry out to its logical conclusion the error which had been committed in the order of assessment.",
      "speaker": "court",
      "significance": "Explains why rectification invalid."
    }
  ],
  "_case_id": "1962_286",
  "_label": 0,
  "_text_length": 8581,
  "_extracted_at": "2026-02-10T20:01:25.594354"
}