{
  "metadata": {
    "case_name": "Vijay Pratap Singh v. Dukh Haran Singh",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeals Nos. 253 and 254 of 1961",
    "date_of_judgment": "1962-01-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Maharaja Sir Man Singh, holder of the Ajodhya Raj, a Taluqdar in lists I, II and V of the Oudh states set I of 1869, died in 1870 and the Raj devolved upon his daughter's son Maharaja Pratap Narain Singh.",
      "type": "background",
      "date": "1870",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Maharaja Pratap Narain Singh died on November 9, 1906, leaving him surviving two widows Suraj Kumari and Jagdamba Devi and no lineal descendant.",
      "type": "material",
      "date": "1906-11-09",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "A will alleged to be executed by Maharaja Pratap Narain Singh on July 20, 1891, was set up but claimed void and ineffective because procured by undue influence, coercion and fraud, and created a line of succession contrary to law.",
      "type": "disputed",
      "date": "1891-07-20",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "On death of Maharaja Pratap Narain Singh, the Raj devolved upon Maharani Suraj Kumari the senior widow.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Maharani Suraj Kumari died in 1927.",
      "type": "material",
      "date": "1927",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "On Suraj Kumari's death, Raj devolved upon Maharani Jagdamba Devi.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Maharani Jagdamba Devi died on June 18, 1928 (or 1938 as per alternative reference), upon which estate devolved upon Ganga Dutt Misir, grandfather of the plaintiff.",
      "type": "material",
      "date": "1928-06-18",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Ganga Dutt Misir died in 1942 and the estate devolved upon his son Ramjiwan Misir and grandson Vijay Pratap Singh (plaintiff) as coparceners in a Hindu joint family.",
      "type": "material",
      "date": "1942",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Even if the will was valid, its terms along with Maharaja Pratap Narain Singh's other acts and declarations took the estate out of purview of Act I of 1869, resulting in Maharani Jagdamba Devi enjoying life estate, vesting entire property in Ganga Dutt on her death, then to plaintiff and Ramjiwan as joint ancestral property.",
      "type": "alternative",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Defendant No.1 Dukh Haran Singh claimed to be adopted as son by Jagdamba Devi on February 12, 1909, but claim alleged false, fictitious and untrue.",
      "type": "disputed",
      "date": "1909-02-12",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Raj in wrongful possession of first defendant Dukh Haran Singh.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Plaintiff's father Ramjiwan Misir detained and confined by first defendant, unable to join petition.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Vijay Pratap Singh, minor by next friend Pandit Brij Mohan Misir, filed petition in Subordinate Judge, Faizabad for leave to sue in forma pauperis for declaration of title to Ajodhya Raj, accretions, possession and mesne profits for three years prior.",
      "type": "procedural",
      "date": "1950-07",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Petition rejected by Subordinate Judge as disclosing no cause of action.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Ramjiwan Misir, father of plaintiff impleaded as second defendant, applied to be transposed as petitioner; initially supported will and adoption but later by application dated April 21, 1951, claimed previous statement procured by coercion and untrue.",
      "type": "procedural",
      "date": "1951-04-21",
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Subordinate Judge directed Ramjiwan to pay court fee within 10 days, default dismissal; not paid, re-applied July 23, 1951 to transpose.",
      "type": "procedural",
      "date": "1951-07-23",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Subordinate Judge rejected Ramjiwan's petition as no useful purpose when plaintiff's rejected under O.33 r.5(d) CPC; observed no showing how estate governed by Hindu Law, no loss of impartible character, and even if so, not partible while father alive.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Plaintiff and Ramjiwan filed revisions to Allahabad High Court: Civil Revision Nos. 881 and 882 of 1952; rejected May 2, 1955.",
      "type": "procedural",
      "date": "1955-05-02",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "High Court held on plaintiff's revision: on Ganga Dutt's death 1942, estate devolved on Ramjiwan alone per impartibility; nothing showing Ganga nearest male reversioner under Hindu Law.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "High Court on Ramjiwan's: application personal, no provision to transpose; O1 r10 not applicable to pauper applications.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "Special leave granted by Supreme Court in March 1957; appeals heard after delay.",
      "type": "procedural",
      "date": "1957-03",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the petition for leave to sue in forma pauperis discloses a cause of action under O.33 r.5(d) CPC.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether a party can be transposed from defendant to petitioner in a pauper suit application under O.1 r.10 CPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Will of 1891 void due to undue influence, coercion, fraud; succession contrary to law; estate devolved on widows then Ganga Dutt then coparceners Ramjiwan and plaintiff.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Hindu Law; Act I of 1869"
    },
    {
      "id": "pa2",
      "text": "Alternatively, even if will valid, terms and acts of Maharaja Pratap took estate out of Act I of 1869; Jagdamba life estate; then to Ganga Dutt as reversioner under Hindu Law.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "s.15 Act I of 1869 (pre-1910 amendment)"
    },
    {
      "id": "pa3",
      "text": "Adoption claim by Dukh Haran false.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Petition discloses no cause of action.",
      "supporting_facts": [],
      "legal_basis": "O.33 r.5(d) CPC"
    },
    {
      "id": "ra2",
      "text": "Claim barred by limitation.",
      "supporting_facts": [],
      "legal_basis": "Limitation Act"
    },
    {
      "id": "ra3",
      "text": "Taluqdari character not destroyed due to retrospective s.15 Act I 1869 as amended by U.P. Act III 1910.",
      "supporting_facts": [],
      "legal_basis": "s.15 Act I 1869 as amended; Oudh Chief Court cases"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under O.33 r.5(d) CPC, court checks only if allegations in petition, accepted as true, show cause of action; no trial of merits, no consideration of defences or complicated law questions.",
      "addresses_issue": "i1",
      "key_observation": "Petition sets up alternative case prima facie disclosing cause of action; e.g., assertion Ganga nearest reversioner under Hindu Law."
    },
    {
      "id": "cr2",
      "text": "High Court erred in holding no cause as estate devolved per impartibility on Ramjiwan alone; alternative plea that estate non-taluqdari via s.15 Act I 1869 sufficient; no enquiry into amended s.15 effect.",
      "addresses_issue": "i1",
      "key_observation": "Complicated questions like retrospective effect of s.15 for trial, not pauper stage."
    },
    {
      "id": "cr3",
      "text": "Pauper application not personal relief; suit commences on presentation; O.1 r.10 CPC applies for transposition if pauper.",
      "addresses_issue": "i2",
      "key_observation": "Ramjiwan can seek transposition; investigate his pauper status."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Petition discloses cause of action; no rejection under O.33 r.5(d) CPC without merits trial.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "O.1 r.10 CPC applies to pauper applications; transposition possible.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kaur Nageshar Sahai v. Shiam Bahadur",
      "citation": null,
      "treatment": "referred",
      "relevance": "Cited by respondent on s.15 retrospective effect; court expresses no opinion."
    },
    {
      "case_name": "Mohammad Ali Khan v. Nisar Ali Khan",
      "citation": null,
      "treatment": "referred",
      "relevance": "Cited by respondent on s.15 retrospective effect; court expresses no opinion."
    }
  ],
  "statutes_cited": [
    {
      "name": "Oudh Estates Act I of 1869",
      "sections": [
        "s.15 (pre and post 1910 amendment)",
        "s.22"
      ],
      "relevance": "Governs taluqdari estate devolution; s.15 on transfers/bequests taking estate out of Act; partial retrospective via U.P. Act III 1910."
    },
    {
      "name": "U.P. Act III of 1910",
      "sections": [
        "s.8",
        "s.21"
      ],
      "relevance": "Amends s.15 of 1869 Act with partial retrospective operation."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order 33 (rr.2-7)",
        "Order 1 r.10",
        "Order 33 r.5"
      ],
      "relevance": "Procedure for pauper suits; rejection grounds; transposition of parties."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeals by special leave, set aside Allahabad High Court orders dated May 2, 1955 rejecting revisions, holding petitions disclose cause of action and transposition permissible; directed expeditious trial.",
    "relief_granted": "High Court orders set aside; pauper petitions to proceed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The court has merely to satisfy itself that the allegations made in the petition, if accepted as true, would entitle the petitioner to the relief he claims.",
      "speaker": "court",
      "significance": "Defines scope of enquiry under O.33 r.5(d) CPC for pauper suits."
    },
    {
      "text": "In ascertaining whether the petition shows a cause of action the court does not enter upon a trial of the issues affecting the merits of the claim made by the petitioner.",
      "speaker": "court",
      "significance": "Limits court's jurisdiction at pauper stage to prima facie allegations."
    },
    {
      "text": "An application to sue in forma pauperis, is but a method prescribed by the Code for institution of a suit by a pauper without payment of fee prescribed by the Court Fees Act.",
      "speaker": "court",
      "significance": "Clarifies nature of pauper application; O.1 r.10 applicable."
    }
  ],
  "_case_id": "1962_97",
  "_label": 1,
  "_text_length": 18784,
  "_extracted_at": "2026-02-10T19:57:56.943302"
}