{
  "metadata": {
    "case_name": "Tata Iron and Steel Company Ltd. v. Abdul Gani",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Civil Appeal No. 286 of 1960",
    "date_of_judgment": "1962-11-09"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Subject-matter is a plot of land measuring 1267 sq. ft. in the Sakchi New Planning area in the town of Jamshedpur.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On June 23, 1937, Abdul Gani applied for settlement of this plot to the Land Officer of Tata Iron and Steel Company Ltd.",
      "type": "material",
      "date": "1937-06-23",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Application allowed; land let out to Abdul Gani as tenant from month to month at rent of Re. 1 per month.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Suit brought in 1949 for ejectment after determination of tenancy by notice to quit; also prayer for arrears of rent at Re. 1 per month.",
      "type": "procedural",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Defence by Abdul Gani: He was agriculturist tenant under Chotanagpur Tenancy Act, not monthly tenant; monthly rent not paid; lease for agricultural and horticultural purposes at annual rent, acquired valid occupancy right, not liable to ejectment.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Present appellant added as defendant by order dated May 25, 1953; filed written statement contending Abdul Gani acquired occupancy right under Chotanagpur Tenancy Act, purpose of settlement would not create monthly tenancy, plaintiff not entitled to khas possession.",
      "type": "procedural",
      "date": "1953-05-25",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Trial Court (Additional Munsif, Jamshedpur): Accepted defence that tenancy agricultural, Abdul Gani acquired occupancy raiyat right, holding governed by Chotanagpur Tenancy Act, suit not triable by civil court; dismissed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appeal to Subordinate Judge, Singhbhum: Affirmed findings of Trial Court that holding agricultural, governed by Chotanagpur Tenancy Act; affirmed judgment and decree.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Patna High Court in Second Appeal No. 1330 of 1954, judgment dated March 26, 1958: Lease not for agricultural and horticultural purposes, no question of occupancy right; allowed appeal, set aside judgments below, decreed plaintiff's suit.",
      "type": "procedural",
      "date": "1958-03-26",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeal to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Abdul Gani's application for lease: 'I beg to apply for a plot of land measuring 1267 sq. ft. in Sakchi New Planning for Garden Purpose... agree to hold the land on monthly tenancy... abide by terms and conditions of the Company and the house building rules... pay security deposit... submit plan of my proposed house for approval... abide by rules of Jamshedpur Notified Area Committee.'",
      "type": "material",
      "date": "1937-06-23",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Land actually used: Part for growing guava trees and flowers, pacca room erected on portion.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the lease was for agricultural or horticultural purposes such that Abdul Gani became a raiyat under Section 6 of the Chotanagpur Tenancy Act with occupancy rights.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in holding lease not for agricultural or horticultural purposes; application mentions 'garden purpose', sufficient to make Abdul Gani a raiyat under s.6 Chotanagpur Tenancy Act; planting orchard comes within cultivation as per Calcutta and Patna High Court decisions.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Chotanagpur Tenancy Act, Sections 4, 6"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Lease not for agricultural or horticultural purposes; full application shows monthly tenancy and agreement to abide by house building rules, inconsistent with cultivation.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Cannot look only at 'garden purpose'; must consider full application: monthly tenancy and abide by house building rules inconsistent with lease for cultivation/orchard; difficult to conceive monthly tenancy for cultivation or house building rules for orchard.",
      "addresses_issue": "i1",
      "key_observation": "Terms of application sufficient to show lease not for agricultural or horticultural purpose; unnecessary to investigate actual use, but evidence shows part used for trees/flowers and pacca room built."
    },
    {
      "id": "cr2",
      "text": "Section 4 classes tenants; Abdul Gani only possible as raiyat under class 2; s.6 defines raiyat as holding land for cultivating by self/family/servants/partners.",
      "addresses_issue": "i1",
      "key_observation": "Purpose of planting orchard within cultivation per High Court decisions, but facts here do not show such purpose."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Lease not for agricultural or horticultural purpose; no occupancy right acquired by Abdul Gani under Chotanagpur Tenancy Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Decisions of Calcutta and Patna High Courts",
      "citation": null,
      "treatment": "followed",
      "relevance": "Purpose of planting an orchard comes within the purpose of cultivation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Chotanagpur Tenancy Act",
      "sections": [
        "Section 4",
        "Section 6"
      ],
      "relevance": "Defines classes of tenants (s.4); defines raiyat as person holding land for cultivation (s.6); determines if Abdul Gani was raiyat with occupancy rights."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court agreed with Patna High Court that the lease was not for agricultural or horticultural purposes, no occupancy right acquired; dismissed the appeal and upheld the decree for plaintiff's ejectment suit.",
    "relief_granted": "Ejectment and arrears of rent decreed in favor of plaintiff (Tata Iron and Steel Company Ltd.).",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Raiyat is defined in s. 6 of this Act to mean primarily a person who has acquired a right to hold land for the purpose of cultivating it by himself or by members of his family or by hired servants.- or with the aid of partners\"",
      "speaker": "court",
      "significance": "Core definition determining if Abdul Gani qualified as raiyat."
    },
    {
      "text": "\"The terms of the application for lease are, in our opinion, sufficient to show that the lease was not for an agricultural or horticultural purpose.\"",
      "speaker": "court",
      "significance": "Key holding rejecting agricultural purpose based on lease terms."
    },
    {
      "text": "\"It is difficult to conceive of a lease for cultivation being taken on a monthly tenancy. It is even more difficult to understand why Abdul Gani would agree to abide by the house building rules if the purpose was only to grow an orchard.\"",
      "speaker": "court",
      "significance": "Reasoning why 'garden purpose' insufficient given other terms."
    }
  ],
  "_case_id": "1962_229",
  "_label": 0,
  "_text_length": 7191,
  "_extracted_at": "2026-02-10T20:00:13.550749"
}