{
  "metadata": {
    "case_name": "Ramchandra Chaudhary & Ors. v. State",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Criminal Appeals Nos. 176 to 178 of 1961",
    "date_of_judgment": "1962-04-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Learned Additional Sessions Judge, Monghyr convicted Ramchandra Chaudhary (appellant in Cr. App. No. 177 of 1961) under s. 302 IPC; convicted Baleshwar Rai alias Nepali Master (appellant in this appeal) and Jogendra Chaudhary (appellant in Cr. App. No. 178 of 1961) under s. 302 read with s. 34 IPC; sentenced each to death.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appeals dismissed by Patna High Court; death sentences confirmed.",
      "type": "procedural",
      "date": "1961-08-10",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "On March 17, 1959 at about 8.00 p.m., chaukidars of village Fateha assembled in crime centre: Anandi Paswan (deceased), Misri Paswan PW2, Baleshwar Paswan PW3, Narain Paswan; Anandi and Misri lying on chouki with weapons (bhala, muretha, pharsa); others lying on ground.",
      "type": "background",
      "date": "1959-03-17",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Crime centre in dalan of Tilak Chaudhary PW6; Srilal Chaudhary PW7 (brother of Tilak) lying on khatia north-east; in adjacent room PW11 Nathuni Chaudhary alias Durga Das and PW12 Ramchander Jha.",
      "type": "background",
      "date": "1959-03-17",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "A little before 9.00 p.m., someone called out 'Darogaji'; deceased Anandi Paswan and Misri Paswan got up; moonlit night; saw Ramchandra Chaudhary, Jogendra Chaudhary and Nepali Master standing closeby.",
      "type": "material",
      "date": "1959-03-17",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Jogendra Chaudhary and Nepali Master caught deceased Anandi; Ramchandra Chaudhary caught Misri Paswan; Ramchandra and Jogendra had guns slung across shoulders; took them to east road running north-south, proceeded southward; no cry due to threat of shooting.",
      "type": "material",
      "date": "1959-03-17",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Reached place west of Peare Sao's house and east of Rampratap Tanti PW5's house; deceased called for Rampratap's help, freed himself, ran westward; Ramchandra let go Misri and fired at deceased; Misri ran into Peare Sao's house, heard second gun shot.",
      "type": "material",
      "date": "1959-03-17",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Misri detected by Mst. Ajo PW8 (wife of Peare Sao), forced to leave; concealed behind door; after moon set, went to Fakir Paswan PW4's house east of Peare Sao's, narrated incident mentioning Ramchandra and Jogendra.",
      "type": "material",
      "date": "1959-03-17",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Early morning March 18, 1959, Misri went to scene, found Anandi dead in ditch by road, face downwards, two gun shot wounds on back; contacted Narain and Baleshwar Paswan, left them with body, went to PS with Ramdeo (son of deceased), lodged FIR.",
      "type": "material",
      "date": "1959-03-18",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Junior Sub-Inspector commenced investigation, submitted charge-sheet against three appellants on March 15, 1959.",
      "type": "procedural",
      "date": "1959-03-15",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Motive: Appellants veteran criminals; chaukidars reported movements; deceased helped Dalsingsarai police arrest Motia Mushar (ploughman of Ramchandra) in dacoity case.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "All appellants denied participation; defence: false case concocted by police.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Main evidence: PW2 Misri Paswan named Ramchandra and Jogendra in FIR; Nepali initially unknown; Ramchandra and Jogendra identified by Misri plus five others (Narain Paswan, Rampratap Tanti PW5, Srilal Chaudhary PW7, Nathuni Chaudhary PW11, Ramchander Jha PW12).",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Nepali Master identified by PW7 Srilal Chaudhary and PW9 Dukhi Mahto at test identification parade.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Ext.6: Anonymous letter to Senior SI Kashi Nath PW22 admitting motive ('rascal Anandia Choukidar spoiled the life of that poor Mushar... spied against us'); Ext.3 dated June 9, 1959 in handwriting of Nepali Master; handwriting expert opined Ext.3 tallies with Ext.6.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "At incident, Ramchandra said 'his servant Motia was taken away forcibly'; Jogendra sarcastically asked deceased 'Where is your military today?'",
      "type": "material",
      "date": "1959-03-17",
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether common intention to commit murder under s.302/34 IPC established against all three appellants, particularly Jogendra Chaudhary and Nepali Master.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether identification of Nepali Master reliable, given identification by two witnesses and test ID held long after arrest.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Ext.6 admissible under s.21 Evidence Act and not barred by s.162 CrPC.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Common intention to commit murder not established for Jogendra Chaudhary.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Nepali Master identified only by one witness at test ID (others did not turn up); not legally permissible to base conviction on single identification.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Srilal Chaudhary PW7 is 75 years old with weak eyesight; evidence unreliable.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Test identification held long after arrest; evidence of identifiers not believable.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Ext.6 hit by s.162 CrPC as received by Sub-Inspector during investigation.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "s.162 CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Eyewitness evidence of PW2 Misri Paswan and five others reliable; accepted by Sessions Judge and High Court.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Common intention inferred from coming together armed with guns, motive (grievance against Anandi for reporting and arrest of Motia), statements at scene.",
      "supporting_facts": [
        "f5",
        "f6",
        "f11",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Nepali identified by two witnesses PW7 and PW9; single truthful witness sufficient.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Ext.6 in handwriting of Nepali (per expert); admissible under s.21 Evidence Act as admission; not hit by s.162 CrPC.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "s.21 Evidence Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Eyewitness evidence naming and identifying appellants accepted by Sessions Judge (who saw witnesses) and High Court; cannot be reappraised in special leave appeals.",
      "addresses_issue": "i1",
      "key_observation": "Evidence true and adequate."
    },
    {
      "id": "cr2",
      "text": "Common intention inferred: all three came together; two with guns; motive established (Anandi reported movements, helped arrest Motia); statements at scene confirm revenge intent shared by all.",
      "addresses_issue": "i1",
      "key_observation": "No doubt on common intention for murder."
    },
    {
      "id": "cr3",
      "text": "Even single truthful witness sufficient for conviction; here Nepali identified by two (PW7, PW9); PW7's age/eyesight assessed and believed by lower courts.",
      "addresses_issue": "i2",
      "key_observation": "Cannot reassess credibility."
    },
    {
      "id": "cr4",
      "text": "Test ID delay considered but rejected due to Ext.6 corroboration; Ext.6 admitted portion shows motive, in Nepali's handwriting per expert.",
      "addresses_issue": "i2",
      "key_observation": "Ext.6 corroborates identification."
    },
    {
      "id": "cr5",
      "text": "s.162 CrPC bars statements made to police in course of investigation; Ext.6 is communication de hors enquiry, not ascribable to investigating officer's enquiry.",
      "addresses_issue": "i3",
      "key_observation": "Document not hit by s.162 CrPC."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Eyewitness evidence reliable; cannot reappraise in special leave appeals.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Common intention to commit murder under s.302/34 IPC established against all three appellants.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Identification of Nepali Master reliable, corroborated by Ext.6.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Ext.6 admissible under s.21 Evidence Act; not barred by s.162 CrPC.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "34"
      ],
      "relevance": "Conviction for murder and common intention."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "21"
      ],
      "relevance": "Admission in Ext.6 admissible."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "162"
      ],
      "relevance": "Does not bar Ext.6 as not statement in course of investigation."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upholds convictions under s.302 and s.302/34 IPC and death sentences confirmed by Patna High Court; dismisses appeals by special leave.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The rascal Anandia Choukidar spoiled the life of that poor Mushar by instigating the S.I. of Police of Dalsingsarai and subsequently he also spied against us for nothing.\"",
      "speaker": "court",
      "significance": "Admission of motive in Ext.6, in Nepali's handwriting, corroborates prosecution case."
    },
    {
      "text": "Ramchandra said 'his servant Motia was taken away forcibly' and Jogendra asked 'Where is your military today?'",
      "speaker": "court",
      "significance": "Confirms common intention for revenge murder."
    },
    {
      "text": "Section 162 is aimed at statements recorded by a police officer while investigating into an offence... A communication like Ext. 6 will not fall within the ambit of such statements.",
      "speaker": "court",
      "significance": "Clarifies scope of s.162 CrPC; holds Ext.6 admissible."
    }
  ],
  "_case_id": "1962_38",
  "_label": 0,
  "_text_length": 11198,
  "_extracted_at": "2026-02-10T19:57:12.765551"
}