{
  "metadata": {
    "case_name": "Pyarelal Bhargava v. State",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Criminal Appeal No. 2 of 1962",
    "date_of_judgment": "1962-10-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On November 24, 1945, one Ram Kumar Ram obtained permission, Ex. PB, from the Government of the former Alwar State to supply electricity at Rajgarh, Khertal and Kherli.",
      "type": "background",
      "date": "1945-11-24",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Ram Kumar Ram entered into partnership with 4 others with an understanding that the licence would be transferred to a company that would be floated by the said partnership.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "After the company was formed, it put in an application to the Government through its managing agents for the issue of a licence in its favour. Ex. P. W. 15/B is that application.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "On the advice given by the Government Advocate, the Government required Ram Kumar Ram to file a declaration attested by a Magistrate with regard to the transfer of his rights and the licence to the company. On April 8, 1948, Ram Kumar Ram filed a declaration to that effect.",
      "type": "background",
      "date": "1948-04-08",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Ram Kumar Ram was a friend of the appellant Pyarelal Bhargava, who was a Superintendent in the Chief Engineers Office, Alwar.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "At the instance of Ram Kumar Ram, Pyarelal Bhargava got the file Ex. PA 1 from the Secretariat through Bishan Swarup, a clerk, before December 16, 1948, took the file to his house sometime between December 15 and 16, 1948, made it available to Ram Kumar Ram for removing the affidavit filed by him on April 9, 1948, and the application, Ex. P. W. 15/B from the file and substituting in their place another letter Ex. PC and another application Ex. PB.",
      "type": "material",
      "date": "1948-12-15",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "After replacing the said documents, Ram Kumar Ram made an application to the Chief Engineer on December 24, 1948, that the licence should be issued in the name of the company.",
      "type": "material",
      "date": "1948-12-24",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "After the discovery of the tampering of the said documents, Pyarelal and Ram Kumar were prosecuted before the Sub-Divisional Magistrate, Alwar--the former for an offence under s. 379 and s. 465, read with s. 109, of the Indian Penal Code, and the latter for an offence under ss. 465 and 379, read with s. 109 of the Indian Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Sub-Divisional Magistrate convicted both the accused under the said sections and sentenced them on both counts.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "On appeal the Sessions judge set aside the Conviction under s. 465, but maintained the conviction and sentence of Pyarelal Bhargava under s. 379, and Ram Kumar Ram under s. 379, read with s. 109, of the Indian Penal Code. Ram Kumar Ram was sentenced to pay a fine of Rs. 500/- and Pyarelal Bhargava to pay a fine of Rs. 200/-.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Against these convictions both the accused filed revisions to the High Court and the High Court set aside the conviction and sentence of Ram Kumar Ram but confirmed those of Pyarelal Bhargava.",
      "type": "procedural",
      "date": "1953-04-25",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Certain documents in the Chief Engineers Office were tampered with and certain papers were substituted.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The appellant was the Superintendent in the Chief Engineers Office.",
      "type": "background",
      "date": null,
      "source": "admitted"
    },
    {
      "id": "f14",
      "text": "On April 11, 1949, Shri P. N. Singhal, Officiating Chief Secretary to the Matsya Government, was making a departmental inquiry in respect of the missing documents. The appellant, among others, was questioned about the said documents.",
      "type": "procedural",
      "date": "1949-04-11",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The appellant first made a statement, Ex. PL, in which he stated that he neither asked Bishan Swarup to bring file No. 127, nor did he recollect any cause for calling for that file on or about that date.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f16",
      "text": "As Shri Singhal was not able to find out the culprit, he expressed his opinion that if the whole truth did not come out, he would hand over the inquiry to the police.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Thereafter, the appellant made a statement, Ex. P.L. 1, wherein, in clear terms, he admitted that about the middle of December 1948 Ram Kumar Ram took file No. 127- W./48 regarding issue of licence to the Bharat Electrical and Industrial Corporation Ltd., Alwar, from his residence to show it to his lawyers, and that he took the file more than once for that purpose. He also added that this was a voluntary statement.",
      "type": "material",
      "date": "1948-12",
      "source": "appellant"
    },
    {
      "id": "f18",
      "text": "The appellant got the file between December 15 and 16, 1948, to his house, made it available to Ram Kumar Ram and on December 16, 1948, returned it to the office.",
      "type": "admitted",
      "date": "1948-12-15",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "The High Court relied upon the confession made by the accused before Shri P. N. Singhal, which was retracted by the appellant.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "Corroboration found in the evidence of Bishan Swaroop, P.W-7, and the entry in the Dak Book, Ex. PA. 4.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "The file was in the Secretariat of the Department concerned, which was in charge of the Chief Engineer.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court has wrongly relied upon the confession made by the accused before Shri P. N. Singhal, Officiating Chief Secretary, as that confession was not made voluntarily and, therefore, irrelevant under s. 24 of the Evidence Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the said confession having been retracted by the appellant, the High Court should not have relied upon it as it was not corroborated in material particulars.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether on the facts found the offence of theft has been made out within the meaning of s. 379 of the Indian Penal Code.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court has wrongly relied upon the confession made by the accused before Shri P. N. Singhal, Officiating Chief Secretary to the Matsya Government at that time, as that confession was not made voluntarily and, therefore, irrelevant under s. 24 of the Evidence Act.",
      "supporting_facts": [
        "f16",
        "f17"
      ],
      "legal_basis": "s. 24 Evidence Act"
    },
    {
      "id": "pa2",
      "text": "The said confession having been retracted by the appellant, the High Court should not have relied upon it as it was not corroborated in material particulars.",
      "supporting_facts": [
        "f19"
      ],
      "legal_basis": "Rule of prudence regarding retracted confessions"
    },
    {
      "id": "pa3",
      "text": "On the facts found no case of theft has been made out within the meaning of s. 379 of the Indian Penal Code.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": "s. 379, s. 378 IPC; arguments: appellant in possession; no dishonest intent as returned next day; no taking out of possession; no wrongful gain/loss"
    },
    {
      "id": "pa4",
      "text": "The Chief Secretary gave the threat that, if the appellant did not disclose the truth he would place the matter in the hands of the police and that the threat induced the appellant to make the disclosure in the hope that he would be excused by the authority concerned.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "s. 24 Evidence Act"
    },
    {
      "id": "pa5",
      "text": "The Superintendent was in possession of the file and therefore he could not have taken the file from himself; there was no intention to take it dishonestly as he had taken it only for the purpose of showing the documents to Ram Kumar Ram and returned it the next day to the office and therefore he had not taken the said file out of the possession of any person; he did not intend to take it dishonestly, as he did not receive any wrongful gain or cause any wrongful loss to any other person.",
      "supporting_facts": [
        "f18",
        "f21"
      ],
      "legal_basis": "s. 378 IPC"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The three lower courts concurrently held that in the circumstances of the case the statement did not appear to be a threat within the meaning of s. 24 of the Evidence Act, but that was only a general statement which any person who lost his property and was not able to find out the culprit would make. In exercising the powers under Art. 136 of the Constitution we are not prepared to differ from the concurrent finding given by the three courts.",
      "addresses_issue": "i1",
      "key_observation": "Statement does not appear to be a threat under s.24 Evidence Act."
    },
    {
      "id": "cr2",
      "text": "A retracted confession may form the legal basis of a conviction if the court is satisfied that it was true and was voluntarily made. But it has been held that a court shall not base a conviction on such a confession without corroboration. The High Court having regard to the said principles looked for corroboration and found it in the evidence of Bishan Swaroop, P.W-7, and the entry in the Dak Book, Ex. PA. 4, and accepted the confession in view of the said pieces of corroboration. The finding is one of fact and there is no permissible ground for disturbing it in this appeal.",
      "addresses_issue": "i2",
      "key_observation": "Retracted confession corroborated sufficiently."
    },
    {
      "id": "cr3",
      "text": "The file was in the Secretariat of the Department concerned, which was in charge of the Chief Engineer. The appellant was only one of the officers working in that department and it cannot, therefore, be said that he was in legal possession of the file. To commit theft one need not take movable property permanently out of the possession of another with the intention not to return it to him. It would satisfy the definition if he took any movable property out of the possession of another person though he intended to return it later on. Wrongful loss is loss by unlawful means of property to which the person losing it is legally entitled. The appellant unauthorisedly took the file from the office and handed it over to Ram Kumar Ram. He had, therefore, unlawfully taken the file from the department, and for a short time he deprived the Engineering Department of the possession of the said file. The loss need not be caused by a permanent deprivation of property but may be caused even by temporary dispossession.",
      "addresses_issue": "i3",
      "key_observation": "Temporary dispossession constitutes theft under s.378 IPC; illustrations b and l support this."
    },
    {
      "id": "cr4",
      "text": "Interpretation of s.24 Evidence Act: A confession would be irrelevant if it appears to the court to have been caused by inducement, threat or promise proceeding from a person in authority sufficient to give the accused grounds for reasonable belief of advantage or avoiding evil.",
      "addresses_issue": "i1",
      "key_observation": "'Appears' imports lesser degree of probability than proof; prima facie opinion based on evidence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Confession was voluntary and relevant under s.24 Evidence Act; concurrent finding of lower courts not to be interfered with under Art.136.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Retracted confession can be basis of conviction if court satisfied of truth and voluntariness, with corroboration as rule of prudence; here sufficiently corroborated.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Facts constitute theft under s.379 IPC (s.378 defines): dishonest intention to take movable property out of possession of another without consent by moving it; temporary dispossession causes wrongful loss.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 379",
        "s. 465",
        "s. 109",
        "s. 378",
        "s. 23",
        "s. 24"
      ],
      "relevance": "Conviction under s.379 (theft defined in s.378); abetment under s.109; forgery s.465 set aside; dishonest/wrongful gain/loss in ss.23-24."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "s. 24",
        "s. 3"
      ],
      "relevance": "Confession irrelevant if caused by inducement/threat/promise from person in authority; 'appears' standard explained with reference to proof in s.3."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 136"
      ],
      "relevance": "Supreme Court not to interfere with concurrent findings of fact."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Rajasthan High Court judgment confirming conviction under s.379 IPC and fine of Rs.200/- is dismissed. Courts rightly held appellant committed theft.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "To commit theft one need not take movable property permanently out of the possession of another with the intention not to return it to him. It would satisfy the definition if he took any movable property out of the possession of another person though he intended to return it later on.",
      "speaker": "court",
      "significance": "Clarifies temporary dispossession suffices for theft under s.378 IPC."
    },
    {
      "text": "The loss need not be caused by a permanent deprivation of property but may be caused even by temporary dispossession, though the person taking it intended to restore it sooner or later.",
      "speaker": "court",
      "significance": "Defines wrongful loss entailing dishonest intent."
    },
    {
      "id": "kq3",
      "text": "A retracted confession may form the legal basis of a conviction if the court is satisfied that it was true and was voluntarily made But it has been held that a court shall not base a conviction on such a confession without corroboration. It is not a rule of law, but is only rule of prudence.",
      "speaker": "court",
      "significance": "Rule for retracted confessions."
    }
  ],
  "_case_id": "1962_409",
  "_label": 0,
  "_text_length": 17272,
  "_extracted_at": "2026-02-10T20:02:37.402996"
}