{
  "metadata": {
    "case_name": "Commissioner of Income Tax Kerala v. West Coast Chemicals and Industries Ltd.",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": "Civil Appeal No. 286 of 1961",
    "date_of_judgment": "1962-03-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, West Coast Chemicals and Industries Ltd. (assessee Company), was incorporated in 1937 primarily to acquire and work a match factory at Medical belonging to A. V. Thomas.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Memorandum of Association empowered the Company to manufacture and deal in acids, alkalis and other chemicals.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Assessee Company carried on match manufacturing till account year ending April 30, 1941.",
      "type": "background",
      "date": "1941-04-30",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Thereafter, due to war conditions, profits lessened; Company began manufacturing plywood chests for tea, paints and lemon grass oil, permitted by cl. 3 of Memorandum.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On May 9, 1943, assessee entered agreement with Rao Sahib Natesa Iyer to sell lands, buildings, plant and machinery of match factory for Rs. 5,75,000, excluding manufactured goods, chemicals, raw materials; Rs. 57,500 paid upfront, balance in 60 days.",
      "type": "material",
      "date": "1943-05-09",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Purchaser defaulted in payment.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On August 9, 1943, fresh agreement for Rs. 7,35,000, including chemicals and paper for manufacture.",
      "type": "material",
      "date": "1943-08-09",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In confidential report to shareholders on August 1, 1944, Directors stated price showed capital appreciation of six times cost price; sale of chemicals resulted in substantial profit.",
      "type": "material",
      "date": "1944-08-01",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Assessment for account year ending April 30, 1944, completed by Deputy Commissioner at Rs. 36,498-6-4.",
      "type": "procedural",
      "date": "1944-04-30",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Deputy Commissioner issued notice under s. 25 Travancore Income-tax Act to Company Liquidator for escaped profits from sale of chemicals and paper; assessed Rs. 2 lakhs profit.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Liquidator contended match manufacturing stopped, business wound up, only capital appreciation, not business profit.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Deputy Commissioner relied on Memorandum allowing chemicals manufacture/sale and Directors' report; held liable on Rs. 2 lakhs.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Commissioner on appeal reduced assessable profits to Rs. 1,15,259; Liquidator admitted this profit figure.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Appeal to Income-tax Appellate Tribunal at Trivandrum; assessee contended stock-in-trade sold not in ordinary trading but realisation sale after winding up.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Tribunal found business not completely ceased as Company manufactured on behalf of purchaser; sale had characteristics of trading sale, not realisation.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "At assessee request, Tribunal referred two questions to Kerala High Court: (1) whether sale of raw materials with business is revenue sale and Rs. 1,15,259 rightly taxed; (2) whether decision separating sale of machinery/premises from chemicals legally warranted or single transaction.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Prior to chemicals sale to purchaser, only two minor sales: July 24, 1943 to educational institution Rs. 50; October 30, 1943 to stranger Rs. 7-12-0.",
      "type": "material",
      "date": "1943-07-24",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Kerala High Court (judgment Jan 27, 1960 in T.R. Case No. 14/1955) held no business done by sale, realisation sale not liable to tax.",
      "type": "procedural",
      "date": "1960-01-27",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Company sold as going concern; worked by assessee on behalf of buyer till payment.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the transaction of sale of raw materials (chemicals and paper) along with the business, including machinery, plant and premises, is a revenue sale, and whether Rs. 1,15,259 has been rightly charged to income-tax.",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Whether the decision that the sale of match machinery and premises was distinct from the sale of chemicals is legally warranted, and whether there was legally a single transaction of the entire match factory inclusive of raw materials.",
      "framed_by": "lower_court"
    },
    {
      "id": "i3",
      "text": "Whether there can be said to be a sale in the carrying on of the business in respect of the chemicals and other raw materials.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Memorandum of Association empowered manufacturing/selling chemicals; past sales of chemicals; first sale excluded chemicals/raw materials for lower price, second included for higher; identifiable profit Rs. 1,15,259; thus trading profit.",
      "supporting_facts": [
        "f2",
        "f5",
        "f7",
        "f13",
        "f17"
      ],
      "legal_basis": "Memorandum of Association; Californian Copper Syndicate v. Harris"
    },
    {
      "id": "pa2",
      "text": "Business not completely ceased; manufacturing on behalf of purchaser; sale characteristics of trading sale.",
      "supporting_facts": [
        "f15",
        "f19"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Match manufacturing stopped, business wound up; sale of stock-in-trade was realisation sale after winding up, not in course of ordinary trading; capital appreciation only.",
      "supporting_facts": [
        "f3",
        "f4",
        "f11"
      ],
      "legal_basis": "Tebrau Johore Rubber Syndicate Ltd. v. Farmer"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Mere realisation of assets is not trading; completion of outstanding contracts post-dissolution/liquidation may be trading; distinction between sales part of trading vs. realisation not act of trading.",
      "addresses_issue": "i3",
      "key_observation": "Cases divided into trading activities or mere realisation."
    },
    {
      "id": "cr2",
      "text": "Analysed Californian Copper (trading as per objects) vs. Tebrau Johore (winding up sale, capital appreciation).",
      "addresses_issue": "i3",
      "key_observation": "In former, sold as part of trading; latter, winding up."
    },
    {
      "id": "cr3",
      "text": "Doughty v. Commissioner: No trading/profit from book-keeping; slump sale of entire assets not separate stock valuation.",
      "addresses_issue": "i3",
      "key_observation": "Sale of entire business as slump transaction is winding up."
    },
    {
      "id": "cr4",
      "text": "Newman (Australia): Sale of entire pastoral property as going concern to end business; capital not trading profit. Anson (NZ): Sheep stock sale as trading profit; doubted by Privy Council.",
      "addresses_issue": "i3",
      "key_observation": "Distinction: trading sale of whole stock vs. winding up."
    },
    {
      "id": "cr5",
      "text": "J.R. OKane: Sales post-retirement circular still trading till stocks exhausted. Old Bushmills: Similar, on Commissioners' finding.",
      "addresses_issue": "i3",
      "key_observation": "Depends on whether trading carried on."
    },
    {
      "id": "cr6",
      "text": "Here, match business wound up; sold as going concern but worked on buyer's behalf; no identifiable price for chemicals except by comparing two offers; minor prior sales not evidence of trading in chemicals; MoA clause unused.",
      "addresses_issue": "i1",
      "key_observation": "Winding up sale to realise capital assets, not trading."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sale of chemicals and raw materials was a winding up sale with view to realising capital assets, not sale in course of business operations; profit not liable to tax.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "True answer is that given by High Court.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Californian Copper Syndicate v. Harris",
      "citation": "1904 5 T.C. 159",
      "treatment": "followed",
      "relevance": "Profit from sale/exchange assessable if part of trading per company objects."
    },
    {
      "case_name": "Tebrau Johore Rubber Syndicate Ltd. v. Farmer",
      "citation": "1910 5 T.C. 658",
      "treatment": "followed",
      "relevance": "Sale of acquired properties on winding up is capital appreciation, not profit."
    },
    {
      "case_name": "Doughty v. Commissioner of Taxes",
      "citation": "1927 A.C. 32",
      "treatment": "referred",
      "relevance": "Slump sale of entire assets not trading profit; mere book entry not profit."
    },
    {
      "case_name": "Commissioner of Taxation W.A. v. Newman",
      "citation": "1921 29 C.L.R. 484",
      "treatment": "followed",
      "relevance": "Sale of entire pastoral property to end business is capital, not trading profit."
    },
    {
      "case_name": "Anson v. Commissioner of Taxes",
      "citation": "1922 N.Z.L.R. 330",
      "treatment": "doubted",
      "relevance": "Entire sheep stock sale as trading profit; doubted by Privy Council."
    },
    {
      "case_name": "J.R. OKane Co. v. Commissioners of Inland Revenue",
      "citation": "1922 12 T.C. 303",
      "treatment": "referred",
      "relevance": "Sales post-retirement still trading till stocks exhausted."
    },
    {
      "case_name": "Commissioner of Inland Revenue v. Old Bushmills Distillery Co. Ltd. in Liquidation",
      "citation": "1926 12 T.C. 1148",
      "treatment": "referred",
      "relevance": "Decided on Commissioners' finding of ongoing trading."
    },
    {
      "case_name": "J. and M. Craig Kilmarnock Ltd. v. Cowperthwaite",
      "citation": "1914 13 T.C. 627",
      "treatment": "referred",
      "relevance": "No profit where slump price not apportioned to stock."
    }
  ],
  "statutes_cited": [
    {
      "name": "Travancore Income-tax Act",
      "sections": [
        "s. 25"
      ],
      "relevance": "Notice issued for escaped assessment of profits."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Kerala High Court's decision that the profit of Rs. 1,15,259 from the sale of chemicals and raw materials was a realisation sale on winding up, not a trading profit liable to income-tax.",
    "relief_granted": "Appeal dismissed; no tax on the profit.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Mere realisation of assets is not trading but the completion of outstanding contracts after the dissolution of a firm, the commencement of liquidation of a company, or the winding up of the affairs of a trader, has been held to be trading.\"",
      "speaker": "court",
      "significance": "Key distinction applied to determine nature of sale."
    },
    {
      "text": "\"In our judgment, this was a winding up sale with a view to realising the capital assets of the assessee Company and not a sale in the course of business operations, which alone would have attracted tax, if profit resulted.\"",
      "speaker": "court",
      "significance": "Core holding on why profit not taxable."
    },
    {
      "text": "\"the true answer would be the one given by the High Court in the judgment under appeal.\"",
      "speaker": "court",
      "significance": "Affirmation of High Court decision."
    }
  ],
  "_case_id": "1962_383",
  "_label": 0,
  "_text_length": 20649,
  "_extracted_at": "2026-02-10T20:01:57.917359"
}