{
  "metadata": {
    "case_name": "Gujarat University & State of Gujarat v. Shri Krishna Raghunath Mudholkar",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha C.J.",
      "Imam J.",
      "Wanchoo J.",
      "Shah J.",
      "Ayyangar J.",
      "Subba Rao J."
    ],
    "case_number": "Civil Appeals Nos. 234 and 262 of 1962",
    "date_of_judgment": "1962-09-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Shrikant son of Shri Krishna Madholkar appeared for the Secondary School Certificate examination held by the State of Bombay in March, 1960, and was declared successful. He took instruction in the various subjects prescribed for the examination through the medium of Marathi which is his mother-tongue and answered the questions at the examination also in the medium of Marathi.",
      "type": "background",
      "date": "1960-03",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Shrikant joined the St. Xaviers College affiliated to the University of Gujarat, in the First Year Arts class and was admitted in the section in which instructions were imparted through the medium of English.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "After successfully completing the First Year Arts course in March, 1961, Shrikant applied for admission to the classes preparing for the Intermediate Arts examination of the University through the medium of English.",
      "type": "material",
      "date": "1961-03",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The Principal of the College informed Shrikant that in view of the provisions of the Gujarat University Act, 1949, and the Statutes 207, 208 and 209 framed by the Senate of the University, as amended in 1961 he could not without the sanction of the University permit him to attend classes in which instructions were imparted through the medium of English.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Shri Krishna, father of Shrikant moved the Vice-Chancellor of the University for sanction to permit Shrikant to attend the English medium classes in the St. Xaviers College. The Registrar of the University declined to grant the request, but by another letter Shrikant was allowed to keep English as a medium of examination but not for instruction.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "A petition was filed by Shri Krishna Madholkar on behalf of himself and his minor son Shrikant in the High Court of Gujarat for a writ requiring the University to treat ss. 4(27), 18(xiv) and 38A of the Gujarat University Act, 1949, and Statutes 207, 208 and 209 as void and inoperative.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The High Court of Gujarat by order dated January 24, 1962, issued the writs prayed for.",
      "type": "procedural",
      "date": "1962-01-24",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "St. Xaviers College was affiliated to the University of Bombay under Bombay Act 4 of 1928. By s.5(3) of the Gujarat University Act, 1949, all educational institutions admitted to the privileges of the University of Bombay and situate within the University area of Gujarat were deemed to be admitted to the privileges of the University of Gujarat.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In 1954, the Gujarat University framed Statutes 207, 208 and 209 dealing with the media of instruction.",
      "type": "background",
      "date": "1954",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "After the constitution of a separate State of Gujarat, Act 4 of 1961 was enacted amending the proviso to s.4(27) and enacting s.38A.",
      "type": "background",
      "date": "1961",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The Senate of the University thereafter amended Statutes 207 and 209.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The Registrar issued a Circular on June 22, 1961, directing that only students who had done Secondary education through English and continued in First Year Arts 1960-61 through English could use English for one year in Intermediate Arts 1961-62.",
      "type": "procedural",
      "date": "1961-06-22",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Shrikant had not appeared at the S.S.C. Examination in the medium of English and could not be permitted to continue English medium.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether under the Gujarat University Act, 1949, it is open to the University to prescribe Gujarati or Hindi or both as an exclusive medium or media of instruction and examination in the affiliated colleges",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "whether legislation authorising the University to impose such media would infringe Entry 66 of List I, Seventh Schedule to the Constitution",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Statutes 207 and 209 in so far as they seek to lay down and impose Gujarati and or Hindi in Devanagri script as media of instruction and examination in institutions other than those maintained by the University are unauthorised and therefore null and void",
      "supporting_facts": [
        "f9",
        "f11"
      ],
      "legal_basis": "Gujarat University Act, 1949 s.4(27)"
    },
    {
      "id": "pa2",
      "text": "The proviso to cl.27 of s.4 constitutes an encroachment on the field of Entry 66 of List I of the Seventh Schedule to the Constitution",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Constitution Seventh Schedule Entry 66 List I"
    },
    {
      "id": "pa3",
      "text": "The provisions authorising the imposition of exclusive media infringe Articles 29(1) and 30(1) of the Constitution",
      "supporting_facts": [],
      "legal_basis": "Articles 29(1), 30(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Authority to impose Gujarati or Hindi as exclusive medium is conferred under diverse clauses of s.4, and by s.18(xiv) the Senate to frame Statutes",
      "supporting_facts": [
        "f9",
        "f11"
      ],
      "legal_basis": "Gujarat University Act s.4(1),(2),(7),(8),(10),(14),(27),(28); s.18(1)(xiv)"
    },
    {
      "id": "ra2",
      "text": "The University being a Corporation invested with control over higher education such power must be deemed necessarily implied",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "State Legislature competent under Entry 11 List II to prescribe medium of instruction",
      "supporting_facts": [],
      "legal_basis": "Constitution Seventh Schedule Entry 11 List II"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Power conferred by cl.1 of s.4 does not relate primarily to the medium of instruction but to the syllabi in diverse branches of learning and courses of study. Does not authorize exclusive medium.",
      "addresses_issue": "i1",
      "key_observation": "The clause confers authority to direct instruction in branches of learning but not to prescribe exclusive medium."
    },
    {
      "id": "cr2",
      "text": "Clauses 2,7,8,10,14,15 have no direct bearing on prescribing exclusive medium.",
      "addresses_issue": "i1",
      "key_observation": "Power to designate courses or guide teaching does not include power to compel exclusive medium absent express provision."
    },
    {
      "id": "cr3",
      "text": "Cl.27: to promote the development of the study of Gujarati and Hindi... and the use of Gujarati or Hindi... as a medium of instruction. Use of 'promote' and 'a medium' indicates not exclusive.",
      "addresses_issue": "i1",
      "key_observation": "Gujarati or Hindi to be one of several media, in addition to English."
    },
    {
      "id": "cr4",
      "text": "No power under Act as amended to impose exclusive medium. Senate powers within University's powers.",
      "addresses_issue": "i1",
      "key_observation": "Statutes 207,209 imposing exclusive Gujarati/Hindi invalid."
    },
    {
      "id": "cr5",
      "text": "State power under Entry 11 List II subject to Entries 63-66 List I. Medium of instruction in higher education falls under Entry 66 if it affects coordination and standards.",
      "addresses_issue": "i2",
      "key_observation": "State can prescribe medium as incident to education, but Union overrides if impairs standards."
    },
    {
      "id": "cr6",
      "text": "Amendment to proviso s.4(27) and s.38A valid as they continue English, do not impose new exclusive regional medium.",
      "addresses_issue": "i2",
      "key_observation": "No encroachment on Entry 66."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under Gujarat University Act, no power to prescribe Gujarati or Hindi as exclusive medium of instruction and examination in affiliated colleges",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "State Legislature competent to prescribe medium but legislation imposing exclusive regional medium likely invalid if lowers standards under Entry 66 List I",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    },
    {
      "id": "h3",
      "text": "Proviso to s.4(27) as amended and s.38A valid",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hingir-Rampur Coal Company v. State of Orissa",
      "citation": "1961 2 S.C.R. 537",
      "treatment": "followed",
      "relevance": "Expression 'subject to' in List II restricts state power to extent of List I entries"
    },
    {
      "case_name": "State of Bombay v. F.N. Balsara",
      "citation": "1951 S.C.R. 682",
      "treatment": "followed",
      "relevance": "Pith and substance doctrine for legislative competence"
    },
    {
      "case_name": "A.S. Krishna v. State of Madras",
      "citation": "1957 S.C.R. 399",
      "treatment": "followed",
      "relevance": "Incidental trenching does not invalidate if pith and substance within competence"
    },
    {
      "case_name": "Prafulla Kumar v. Bank of Commerce, Khulna",
      "citation": "A.I.R. 1947 P.C. 60",
      "treatment": "followed",
      "relevance": "Pith and substance determines true nature of enactment"
    },
    {
      "case_name": "Union Colliery Company of British Columbia, Ltd. v. Bryden",
      "citation": "1899 A.C. 580",
      "treatment": "referred",
      "relevance": "Pith and substance applies even to direct impact on exclusive federal subject"
    },
    {
      "case_name": "Bank of Toronto v. Lambe",
      "citation": "1882 12 A.C. 575",
      "treatment": "distinguished",
      "relevance": "Anticipatory encroachment argument rejected"
    },
    {
      "case_name": "Attorney-General for Alberta v. Attorney-General for Canada",
      "citation": "1939 A.C. 117",
      "treatment": "followed",
      "relevance": "Colourable legislation determined by pith and substance"
    },
    {
      "case_name": "Calcutta Gas Company v. State of West Bengal",
      "citation": "1962 SUPP. 3 S.C.R. 1",
      "treatment": "followed",
      "relevance": "Harmonious construction of entries; widest amplitude to language"
    }
  ],
  "statutes_cited": [
    {
      "name": "Gujarat University Act, 1949",
      "sections": [
        "s.3",
        "s.4(1)",
        "s.4(2)",
        "s.4(7)",
        "s.4(8)",
        "s.4(10)",
        "s.4(14)",
        "s.4(27)",
        "s.4(28)",
        "s.5(3)",
        "s.11(4)(a)",
        "s.15",
        "s.18(1)(xiv)",
        "s.20",
        "s.22",
        "s.38A"
      ],
      "relevance": "Powers of University, Senate etc. to prescribe medium; no power for exclusive Gujarati/Hindi; s.38A penalties valid"
    },
    {
      "name": "Gujarat University (Amendment) Act, 1961 (Act 4 of 1961)",
      "sections": [
        "Proviso to s.4(27)"
      ],
      "relevance": "Extends English medium; valid"
    },
    {
      "name": "Bombay University Act, 1928 (Act 4 of 1928)",
      "sections": [],
      "relevance": "Prior affiliation of St. Xavier's College"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.226",
        "Art.254(1)",
        "Art.29(1)",
        "Art.30(1)",
        "Art.343",
        "Seventh Schedule Entry 11 List II",
        "Entry 17 List II (1935 Act)",
        "Entry 66 List I",
        "Entries 63-66 List I",
        "Entry 25 List III"
      ],
      "relevance": "Legislative competence; state power subject to union on standards; no opinion on Arts 29/30 due to lack of pleadings"
    },
    {
      "name": "University Commission Act",
      "sections": [],
      "relevance": "Example of Parliament's role in coordination"
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court confirmed High Court's declaration that Statutes 207 and 209 are invalid insofar as they impose Gujarati or Hindi as exclusive media of instruction; set aside declaration of invalidity of proviso to s.4(27) and s.38A; no opinion on Arts.29(1) and 30(1); appellants to pay costs.",
    "relief_granted": "Writs upheld against statutes and circulars; University and State directed to forbear from enforcing exclusive medium",
    "costs": "Appellants will pay the costs of the respondents in the two appeals. One hearing fee."
  },
  "key_quotes": [
    {
      "text": "From the use of the expression promote read in the context of the indefinite article a it is abundantly clear that power to impose Gujarati or Hindi as the medium of instruction and examination to the exclusion of other media was not entrusted to the University.",
      "speaker": "court",
      "significance": "Core holding on interpretation of s.4(27)"
    },
    {
      "text": "Power to legislate in respect of medium of instruction, in so far it has a direct bearing and impact upon the legislative head of co-ordination and determination of standards in institutions of higher education or research and scientific and technical institutions, must also be deemed by item 66 List I to be vested in the Union.",
      "speaker": "court",
      "significance": "Defines interplay between Entries 11 List II and 66 List I"
    },
    {
      "text": "To separate them [education and medium] is to destroy the concept. It is inconceivable that any reasonable body of constitution makers would entrust the subject of medium of instruction to Parliament and education dehors medium to a State.",
      "speaker": "court",
      "significance": "Dissent by Subba Rao J. on scope of entries"
    }
  ],
  "_case_id": "1962_422",
  "_label": 0,
  "_text_length": 108324,
  "_extracted_at": "2026-02-10T20:02:38.823372"
}