{
  "metadata": {
    "case_name": "Surajmull Nagarmull v. State of West Bengal",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 403 of 1959",
    "date_of_judgment": "1962-04-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Messrs. Surajmull Nagarmull were tenants of three warehouses and vacant land appurtenant thereto popularly known as the Shamnagar Jute Godown belonging to Sri Hanuman Seva Trust.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The warehouses were used for storage of jute belonging to the appellants.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "By an order dated August 17, 1943 issued under Rule 75A of the Defence of India Rules, 1939, the warehouses were requisitioned and possession thereof was taken on September 21, 1943.",
      "type": "material",
      "date": "1943-08-17",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "As the amount of compensation payable to the owner of the warehouses could not be fixed by agreement an Arbitrator was appointed under s. 19(1)(b) of the Defence of India Act, 1939.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Before the Arbitrator, Sri Hanuman Seva Trust claimed compensation as owners of the warehouses.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant claimed compensation for loss of earnings, damage to business and cost of removal of 18,000 maunds of jute and some iron implements, which the appellants claimed had to be removed in consequence of the order of requisition. The appellants estimated the compensation at Rs. one lakh.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The Arbitrator by his order dated December 13, 1947 observed that the appellants had failed to prove any actual loss of business in consequence of the requisition, and rejected the claim of the appellants.",
      "type": "material",
      "date": "1947-12-13",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Against the order passed by the Arbitrator an appeal was preferred to the High Court of Judicature at Calcutta. The appellants valued the claim at Rs. 1,50,000/- in the appeal.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "At the hearing of the appeal, the State of West Bengal contended that the appeal was not maintainable in view of the provisions of s. 19(1)(f) and (g) and s. 19(3)(c) of the Defence of India Act and the 2nd proviso to r. 19 framed under the Defence of India Act.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The High Court upheld the contention raised by the State of West Bengal and dismissed the appeal by judgment and order dated June 27, 1955.",
      "type": "procedural",
      "date": "1955-06-27",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "With special leave the appellants have appealed to this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether an appeal lies to the High Court against an award of the Arbitrator under s.19 of the Defence of India Act, 1939 where no compensation is awarded to the claimant (i.e., where the amount of compensation awarded does not exceed Rs. 5,000/- as per the 2nd proviso to Rule 19).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "By cl. (f) of s. 19(1) the Legislature provided a right of appeal against all awards and has imposed a restriction only in those cases where some amount is awarded but the amount so awarded is less than Rs. 5,000/-. The restriction limiting the right of appeal must be strictly construed. Where no compensation at all is awarded the bar contained in cl. (f) of s. 19(1) and the second proviso to Rule 19 would not apply.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "s. 19(1)(f) Defence of India Act, 1939; 2nd proviso to Rule 19"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The appeal was not maintainable in view of the provisions of s. 19(1)(f) and (g) and s. 19(3)(c) of the Defence of India Act and the 2nd proviso to r. 19 framed under the Defence of India Act.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "s. 19(1)(f), (g); s. 19(3)(c) Defence of India Act, 1939; 2nd proviso to Rule 19"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Arbitrator appointed under s.19 of the Defence of India Act is not a court or a tribunal subject to the Appellate jurisdiction of the High Court. By the Defence of India Act a right to appeal against the award of the Arbitrator is conferred, but that right is restricted in the manner prescribed by the rules.",
      "addresses_issue": "i1",
      "key_observation": "An appeal is a creature of statute. The Arbitrator not being a court subordinate to the High Court, an appeal would lie only if it is expressly so provided."
    },
    {
      "id": "cr2",
      "text": "It is provided by the second proviso to Rule 19 that no appeal shall lie against an award where the amount of compensation does not exceed Rs. 5,000/-. The claim of the appellant was rejected by the Arbitrator and they were not awarded any compensation.",
      "addresses_issue": "i1",
      "key_observation": "If the Arbitrator rejects the claim and refuses to award anything the case would fall within the 2nd proviso to Rule 19 as being one where the amount of compensation awarded does not exceed Rs. 5,000/-."
    },
    {
      "id": "cr3",
      "text": "The rule does not contemplate that the bar to the maintainability of the appeal will be effective only if some amount is awarded but the compensation so awarded is less than Rs. 5,000/-. The right to appeal does not depend upon the claim made by the claimant; it depends solely upon the amount of compensation awarded by the Arbitrator.",
      "addresses_issue": "i1",
      "key_observation": "However unusual the rule may appear to be, it would not be open to the Court to extend the right to appeal and to enable a claimant whose claim has been rejected completely to appeal to the High Court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No appeal lies to the High Court against an award of the Arbitrator where the amount of compensation awarded does not exceed Rs. 5,000/-, which includes cases where no compensation is awarded at all.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Defence of India Act, 1939",
      "sections": [
        "s. 19(1)(b)",
        "s. 19(1)(f)",
        "s. 19(1)(g)",
        "s. 19(3)(c)"
      ],
      "relevance": "Governs payment of compensation for requisition, appointment of Arbitrator, right to appeal against award with restrictions."
    },
    {
      "name": "Defence of India Rules, 1939",
      "sections": [
        "Rule 75A",
        "Rule 19 (2nd proviso)"
      ],
      "relevance": "Rule 75A for requisition; Rule 19 restricts appeals where compensation awarded does not exceed Rs. 5,000 in lump or Rs. 250 per mensem."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "s. 299(2)"
      ],
      "relevance": "Referenced in s.19(1) cl.1 for nature of action taken."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave, holding that the High Court was right in not entertaining the appeal against the Arbitrator's award as no compensation was awarded, which falls within the bar of the 2nd proviso to Rule 19.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "An appeal is a creature of statute. The Arbitrator not being a court subordinate to the High Court, an appeal would lie only if it is expressly so provided.",
      "speaker": "court",
      "significance": "Explains the basis for restricting the right of appeal."
    },
    {
      "text": "The right to appeal does not depend upon the claim made by the claimant either before the acquiring authority or the Arbitrator or before the High Court it depends solely upon the amount of compensation awarded by the Arbitrator.",
      "speaker": "court",
      "significance": "Core reasoning on applicability of the monetary threshold including zero award."
    },
    {
      "text": "In that view of the case, the High Court was right in not entertaining the appeal.",
      "speaker": "court",
      "significance": "Concludes upholding the High Court's decision."
    }
  ],
  "_case_id": "1962_371",
  "_label": 0,
  "_text_length": 6623,
  "_extracted_at": "2026-02-10T20:01:46.713466"
}