{
  "metadata": {
    "case_name": "Appellants v. State",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Criminal Appeal No. 153 of 1960",
    "date_of_judgment": "1962-02-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On March 26, 1959, at about 10-15 p.m. one Rajbahadur Rai alias Chhote Rai, was alleged to have been assaulted by the appellants at a place where Chhote Rai was sitting, at the pan shop of one Raghunath Prasad.",
      "type": "material",
      "date": "1959-03-26",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellants are said to have arrived there in a private car and a tandem, and after assaulting Chhote Rai, to have gone away in these two vehicles.",
      "type": "material",
      "date": "1959-03-26",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "After investigation, the appellants were prosecuted under ss. 307/34 and 148 of the Indian Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Before the order of discharge was made, the Magistrate heard the evidence of nine witnesses including Chhote Rai and Raghunath, who had given the first information report. The witnesses also included two other alleged eye-witnesses, Bhushan Singh (P.W. 2), and Sheonandan Yadev (P.W. 6).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Magistrate, after recording the evidence and holding a spot inspection and hearing the parties, discharged the appellants as he was of opinion - in his own words - 'in view of the aforesaid discrepant, unreliable and incredible and highly interested prosecution evidence, no Court can consider it worthwhile prima facie even for a trial. In a case of this nature, it is the legal obligation of a Magistrate to discharge the accused persons, as discussed above.'",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Magistrate reached this conclusion on a fairly long appraisal of the evidence in the case, discussing it from the angle of credibility of witnesses, their antecedents, the probabilities of the case, the nature of the alleged weapon, the medical evidence and so on.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The High Court of Patna, by judgment and order dated July 28, 1960, in Criminal Revision No. 1243 of 1959, set aside the Magistrate's discharge order and directed the Magistrate to commit the appellants to the Court of Session to stand their trial under ss. 307/34 and 148 IPC.",
      "type": "procedural",
      "date": "1960-07-28",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court was justified in setting aside the order of the Magistrate, which was passed in the proper exercise of the jurisdiction conferred by s. 207A(6) of the Code of Criminal Procedure.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The course followed by the Magistrate in determining whether there was credible evidence or not was the right course.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Ramgopal Ganpatrai Ruia v. The State of Bombay; s. 207A(6) CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Magistrate went beyond the powers conferred upon him of enquiring into the case with a view to committing it to the Court of Session.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "s. 207A CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 207A(6) CrPC gives the Magistrate the option not to commit an accused but to discharge him, if he is of opinion, for reasons to be recorded, that the evidence discloses no grounds for committing the accused person, unless it appears to him that the person should be tried before himself or some other Magistrate.",
      "addresses_issue": "i1",
      "key_observation": "The Magistrate thought that the power conferred upon him by this sub-section enabled him to examine the evidence thoroughly, and if it did not satisfy him, to discharge the accused."
    },
    {
      "id": "cr2",
      "text": "The words of s. 207A(6) and s. 209 CrPC are not the same, and s. 207A requires a stronger case for discharging an accused than s. 209. Neither invests the Magistrate with jurisdiction to decide the case as if the sessions trial was before him.",
      "addresses_issue": "i1",
      "key_observation": "If there is a prima facie case triable by the Court of Session, the Magistrate must commit the accused to the Court of Session to stand his trial."
    },
    {
      "id": "cr3",
      "text": "On a reading of the reasons recorded by the Magistrate, he did not stop to find out that there was evidence which, if believed, would establish, at least, a prima facie case but went on further to disbelieve that evidence by an elaborate and painstaking process of examination.",
      "addresses_issue": "i1",
      "key_observation": "The Magistrate tried the whole case from one end to the other and established his point in a fairly elaborate order, disbelieving the injured person, other eye-witnesses, contrasting oral testimony with medical evidence and his own conclusions from site inspection."
    },
    {
      "id": "cr4",
      "text": "Whatever the jurisdiction conferred by sub-s. (6) of s. 207A, it does not entitle a Magistrate to try the case on his own, and forestall the decision of the Court of Session.",
      "addresses_issue": "i1",
      "key_observation": "The order of discharge passed by the Magistrate was in excess of his jurisdiction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The section can only mean that if there is a prima facie case triable by the Court of Session, the Magistrate must commit the accused to the Court of Session to stand his trial.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ramgopal Ganpatrai Ruia v. The State of Bombay",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Interpreted s. 209 CrPC, which deals with proceedings instituted otherwise than on a police report; words and force differ from s. 207A CrPC"
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "s. 207A",
        "s. 207A(4)",
        "s. 207A(5)",
        "s. 207A(6)",
        "s. 173",
        "s. 209"
      ],
      "relevance": "Procedure for Magistrate's enquiry preparatory to commitment to Sessions Court on police report; power to discharge if no grounds for commitment"
    },
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "s. 307/34",
        "s. 148"
      ],
      "relevance": "Sections under which appellants were prosecuted for assault"
    },
    {
      "name": "Code of Criminal Procedure Amendment Act, 1955 (26 of 1955)",
      "sections": [],
      "relevance": "Introduced s. 207A CrPC"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upheld the Patna High Court's order setting aside the Magistrate's discharge, and agreed that the Magistrate exceeded jurisdiction under s. 207A(6) CrPC by trying the case instead of assessing prima facie case for commitment.",
    "relief_granted": "None to appellants; directed expeditious trial in Sessions Court",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'in view of the aforesaid discrepant, unreliable and incredible and highly interested prosecution evidence, no Court can consider it worthwhile prima facie even for a trial.'",
      "speaker": "magistrate",
      "significance": "Magistrate's reasoning for discharge, held to exceed jurisdiction"
    },
    {
      "text": "the section can only mean that if there is a prima facia case triable by the Court of Session, the Magistrate must commit the accused to the Court of session to stand his trial.",
      "speaker": "court",
      "significance": "Core holding on scope of s. 207A(6) CrPC"
    },
    {
      "text": "whatever the jurisdiction conferred by sub-s. (6) of s. 207A, it does not entitle a Magistrate to try the case on his own, and forestall the decision of the Court of Session",
      "speaker": "court",
      "significance": "Limits Magistrate's power at commitment stage"
    }
  ],
  "_case_id": "1962_109",
  "_label": 0,
  "_text_length": 9718,
  "_extracted_at": "2026-02-10T19:57:49.441825"
}