{
  "metadata": {
    "case_name": "Former Ruler of Bhagat (Appellant) v. Respondents",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Civil Appeal No. 382 of 1960",
    "date_of_judgment": "1962-05-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was the former ruler of the State of Bhagat, one of the Simla Hill states.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "State of Bhagat and several other Simla Hill States were merged in Himachal Pradesh on July 1, 1947. As a consequence of the merger the ruler surrendered his sovereignty to the new State.",
      "type": "background",
      "date": "1947-07-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Khasra Nos. 70, 80, 81, 167, 263/170, 171, 172, 173 and 269/177 measuring in all 15 bighas and 19 biswas, among other property, were declared to be the private property of the appellant.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "These fields are the appellant's Khudkhast lands, recorded as much in the revenue papers ever since the year 1936.",
      "type": "admitted",
      "date": "1936",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Defendants (respondents) were granted licence to cultivate these lands on behalf of the appellant with the obligation that the entire produce from the lands should be handed over by them to the appellant at the end of every year.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Consideration for the arrangement was a remission in rent and land revenue which the appellant had granted to the respondents with respect to certain other lands which were leased out by him to the respondents.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Bulk of these other lands were declared to be the State property as a result of the merger and presumably the respondents have now to pay full assessment or rent with respect to them.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Respondents failed to hand over the annual produce from the fields in suit to the appellant.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Appellant leased out the lands at Rs. 500/- per annum to Chuku Koli for a period of one year from October, 1950.",
      "type": "material",
      "date": "1950-10",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Respondents obstructed Chuku Koli in taking possession of the land and despite repeated demands by the appellant, kept him out of possession.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Appellant instituted a suit for possession and mesne profits from Rabi 1950 to Kharif 1953 at Rs. 500 per annum and future profits in July, 1954.",
      "type": "procedural",
      "date": "1954-07",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Respondents contended that they were the occupancy tenants of these lands for the last two or three generations, that they were cultivating these lands jointly and severally.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Suit was not cognizable by a civil court.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Respondents had filed a suit against the appellant in the court of the Assistant Collector, First Grade, Solon for a declaration to the effect that they are in possession of the lands as occupancy tenants and that, therefore, the appellant's suit should be stayed.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Trial court decreed the suit of the appellant as against all the respondents including the claim for mesne profits.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Respondents preferred an appeal before the District Judge, Mahau. He dismissed the appeal and confirmed the decree of the trial court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Respondents preferred second appeal to the Court of Judicial Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Judicial Commissioner allowed the appeal holding that the respondents were occupancy tenants of the lands and that consequently the provisions of s. 77(3) read with the first proviso thereto barred the jurisdiction of the civil court. Set aside the decree and directed that the plaint be returned for presentation to proper court.",
      "type": "procedural",
      "date": "1957-10-31",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Court of the Judicial Commissioner was in error in interfering with a finding of fact of the District Judge.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Court of the Judicial Commissioner was wrong in holding that the suit was not triable by a civil court but is triable by a revenue court under s. 77 of the Punjab Tenancy Act, 1887.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "For a suit to be barred under s. 77(3) of the Act from the cognizance of a civil court two conditions have to be satisfied: (1) the suit should relate to one of the matters described in sub-s. (3) and (2) the existence of the relationship of landlord and tenant should be admitted by the parties. If these two conditions are not satisfied then the suit is not barred.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "Section 77(3) Punjab Tenancy Act; Sham Singh v. Amarjit Singh; Baru v. Nader; Daya Ram v. Jagir Singh; Magiti Sasamal v. Pandab Bissoi"
    },
    {
      "id": "pa2",
      "text": "Judicial Commissioner had no jurisdiction to reverse the finding of fact of the District Judge on whether respondents are tenants.",
      "supporting_facts": [
        "f16",
        "f18",
        "f4"
      ],
      "legal_basis": "Finding of fact based on revenue records from 1936 showing khudkhast lands; s. 44 of the Act giving presumptive value to entries"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The suit in question would fall under entry (e) in the second group of s.77(3): suits by a landlord to eject a tenant.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "Section 77(3), entry (e) Punjab Tenancy Act"
    },
    {
      "id": "ra2",
      "text": "Their suit before the revenue court was one under entry (d): Suits by a tenant to establish a claim to a right of occupancy, or by landlord to prove that a tenant has no such a right.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Section 77(3), entry (d) Punjab Tenancy Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 77(3) bars suits from civil court cognizance only where there is no dispute that a person cultivating land or in possession is a tenant; the legislature barred only those suits where relationship of landlord and tenant is admitted.",
      "addresses_issue": "i2",
      "key_observation": "Every item in s.77(3) relates to disputes between tenants and landlord; no entry for suit where status as tenant is not admitted by landlord."
    },
    {
      "id": "cr2",
      "text": "Judicial Commissioner erred in reversing District Judge's finding of fact, which was based on entries in record of rights from 1936 showing lands as khudkhast of appellant and in his possession; s.44 gives presumptive value to revenue entries; later entries prevail over prior conflicting ones.",
      "addresses_issue": "i1",
      "key_observation": "District Judge's finding correct; respondents not tenants."
    },
    {
      "id": "cr3",
      "text": "Observations in Magiti Sasamal v. Pandab Bissoi apply: provision postulates relationship of landlord and tenant; dispute about status not covered.",
      "addresses_issue": "i2",
      "key_observation": "Civil court has jurisdiction where tenancy not admitted."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Suit not barred by s.77(3) Punjab Tenancy Act as relationship of landlord and tenant not admitted by appellant.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Judicial Commissioner erred in interfering with District Judge's finding of fact that lands are khudkhast of appellant and respondents not tenants.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sham Singh v. Amarjit Singh",
      "citation": "1930 I.L.R 12 Lah. III",
      "treatment": "followed",
      "relevance": "Bar under s.77(3) applies only where landlord-tenant relationship admitted"
    },
    {
      "case_name": "Baru v. Nader",
      "citation": "1942 I.L.R.24 Lah. 191 F.B.",
      "treatment": "followed",
      "relevance": "Affirmed that civil court has jurisdiction where tenancy status disputed"
    },
    {
      "case_name": "Daya Ram v. Jagir Singh",
      "citation": "A.I.R 1956 Him. Pra. 61",
      "treatment": "followed",
      "relevance": "Where landlord-tenant relationship not admitted, civil court has jurisdiction; suit for ejectment not under s.77(3)"
    },
    {
      "case_name": "Magiti Sasamal v. Pandab Bissoi",
      "citation": "1962 3 S.C.R. 673",
      "treatment": "followed",
      "relevance": "Dispute about existence of landlord-tenant relationship not within exclusive jurisdiction of revenue court"
    }
  ],
  "statutes_cited": [
    {
      "name": "Punjab Tenancy Act, 1887",
      "sections": [
        "77(3)",
        "44"
      ],
      "relevance": "S.77(3) bars civil court jurisdiction only for specified suits where landlord-tenant relationship admitted; s.44 gives presumptive value to revenue entries"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by special leave, holding that Judicial Commissioner erred in reversing District Judge's findings and in holding civil court lacked jurisdiction under s.77(3) Punjab Tenancy Act, as tenancy not admitted; restored decree of trial court and District Judge.",
    "relief_granted": "Decree for possession and mesne profits in favor of appellant",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is obvious that the bar under clause (4) is applicable to those cases only in which the relationship of landlord and tenant is admitted\"",
      "speaker": "court",
      "significance": "Explains scope of s.77(3) bar from Lahore High Court precedent"
    },
    {
      "text": "\"the relationship of landlord and tenant as between the parties to the suit is not admitted by the appellant.\"",
      "speaker": "court",
      "significance": "Applies precedent to facts, upholding civil court jurisdiction"
    },
    {
      "text": "\"where there is such a conflict, it is the later entry which must prevail.\"",
      "speaker": "court",
      "significance": "Interprets s.44 presumption for revenue records"
    }
  ],
  "_case_id": "1962_46",
  "_label": 1,
  "_text_length": 12660,
  "_extracted_at": "2026-02-10T19:57:17.557430"
}