{
  "metadata": {
    "case_name": "G. Gilda Textile Agency v. State of Andhra Pradesh",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeals Nos. 397 and 398 of 1961",
    "date_of_judgment": "1962-04-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is Messrs. G. Gilda Textile Agency, Vijayawada, an agent of several non-resident principals, on whose behalf it booked orders and dealt with the indents.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Agreements between non-resident principals and appellant contained in letters marked Exs. A-3, A-3a and A-3b; appellant appointed as indenting agent in Andhra Pradesh for cloth merchants residing and carrying on business outside Andhra Pradesh.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant required to book orders and forward them to principals, receiving commission on sale of goods despatched to Andhra Pradesh; in some cases commission on orders booked by appellant, in others on all sales in territory.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant did business in three categories: first, took delivery of goods, found buyers and delivered to buyers; held within Madras General Sales Tax Act, appellant liable, no question.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Second category: merely booked orders, forwarded to Bombay, principals sent goods with railway receipts through bank to purchasers in Andhra Pradesh; appellant's connection not sufficient to constitute it a 'dealer', omitted from turnover, no dispute.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Third category: goods sold by outside dealers to buyers in State; appellant booked orders, received railway receipts from outside principal, handed them to buyers, sometimes collected and transmitted amounts to principal.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Matter relates to levy of sales tax on appellant's turnover for years 1954-55 and 1955-56.",
      "type": "material",
      "date": "1954-55, 1955-56",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant did not produce any correspondence with non-resident principals or covering letters sent with railway receipts.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Tribunal held railway receipts must have been endorsed by sellers in favour of appellant or in blank, deemed appellant a dealer under s.14-A, liable to tax.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court judgment and order dated September 19, 1958, in Tax Revision Cases Nos. 62 and 63 of 1956.",
      "type": "procedural",
      "date": "1958-09-19",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Period covered by Sales Tax Validation Act, 1956, no question under Constitution.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "High Court finding: non-resident principals carrying on business of selling in Andhra Pradesh as they took out railway receipts in their own names, manifesting intention to remain owners and retain control; sales completed in Andhra Pradesh.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant comes within s. 14-A of the Madras General Sales Tax Act, 1939, as agent of non-resident and liable to tax as a dealer in respect of the third category of transactions.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Non-resident principals were not carrying on the business of selling in Andhra Pradesh; appellant not liable under s.14-A as first condition not fulfilled.",
      "supporting_facts": [
        "f6",
        "f11"
      ],
      "legal_basis": "Mahadayal Premchandra v. Commercial Tax Officer, Calcutta; s.14-A Madras General Sales Tax Act"
    },
    {
      "id": "pa2",
      "text": "Sub-section (2) of s.14-A connected to opening part; tax leviable on turnover relating to business of non-resident carried on by non-resident in taxable territory.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.14-A(2) Madras General Sales Tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant, after securing orders, received railway receipts from sellers, handed to buyers, collected consideration and transmitted to sellers; sales took place in State either on behalf of appellant or principals.",
      "supporting_facts": [
        "f6",
        "f12"
      ],
      "legal_basis": "s.14-A Madras General Sales Tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court finding that non-resident principals carrying on business of selling in Andhra Pradesh stands; if principals took railway receipts in own names, sales completed in Andhra Pradesh.",
      "addresses_issue": "i1",
      "key_observation": "Non-resident principals doing business of selling in Andhra Pradesh."
    },
    {
      "id": "cr2",
      "text": "Appellant admitted agent through whom business carried on; liable under s.14-A fictionally as dealer.",
      "addresses_issue": "i1",
      "key_observation": "Agent assessed in respect of business of non-resident irrespective of turnover minimum."
    },
    {
      "id": "cr3",
      "text": "Mahadayal Premchandra distinguished on its own facts; no finding there applicable here.",
      "addresses_issue": "i1",
      "key_observation": "Findings on facts of one case cannot apply to another."
    },
    {
      "id": "cr4",
      "text": "Once finding that non-resident principal carried on business of selling in Andhra Pradesh and appellant agent, rest follows.",
      "addresses_issue": "i1",
      "key_observation": "High Court right in upholding levy."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant comes within four corners of s.14-A in relation to third category transactions; liable to tax as agent of non-resident deemed dealer.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mahadayal Premchandra v. Commercial Tax Officer, Calcutta",
      "citation": "1959 S.C.R. 551",
      "treatment": "distinguished",
      "relevance": "Agent liability under similar section in Bengal Finance Sales Tax Act; turned on facts where principal not selling in taxable territory."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras General Sales Tax Act, 1939",
      "sections": [
        "s. 12-B",
        "s. 14-A",
        "s. 3(3)"
      ],
      "relevance": "Basis for revisions, deems agent of non-resident as dealer liable to tax on business of non-resident in State."
    },
    {
      "name": "Sales Tax Validation Act, 1956",
      "sections": [],
      "relevance": "Covers the period involved, no constitutional question."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals by special leave dismissed; High Court order upheld; levy of sales tax on appellant under s.14-A for third category transactions confirmed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The section makes the agent liable fictionally as a dealer in the circumstances laid down in the section, viz., that he is acting on behalf of a non-resident person doing business of buying or selling goods in the State.",
      "speaker": "court",
      "significance": "Explains operation of s.14-A deeming provision."
    },
    {
      "text": "No finding on the facts of one case can be applied to the facts of another.",
      "speaker": "court",
      "significance": "Distinguishes Mahadayal on factual basis."
    },
    {
      "text": "The High Court, in our opinion, was, therefore, right in upholding the levy of the tax from the appellant.",
      "speaker": "court",
      "significance": "Concludes in favour of tax liability."
    }
  ],
  "_case_id": "1962_253",
  "_label": 0,
  "_text_length": 9508,
  "_extracted_at": "2026-02-10T20:00:12.113690"
}