{
  "metadata": {
    "case_name": "M/s. Serajuddin & Co. v. Workmen",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDREGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 355 of 1961",
    "date_of_judgment": "1962-03-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On 14th March 1960, Government of West Bengal referred six items of dispute between four employers including appellant M/s. Serajuddin & Co. and their employees to Fourth Industrial Tribunal, West Bengal.",
      "type": "procedural",
      "date": "1960-03-14",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Items of dispute concerned claims for grade and scale, Dearness Allowance, House rent, leave and holidays, Provident Fund and Gratuity, and condition of service.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Workmen of three other concerns filed affidavits stating disputes settled, leaving only dispute between appellant and its workmen.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant raised preliminary objection that under s.2(a) appropriate Government is Central Government, not State Government of West Bengal; reference invalid.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Tribunal overruled objection and set case for hearing on merits vide order No. 28 dated January 17, 1961.",
      "type": "procedural",
      "date": "1961-01-17",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellant's office at Calcutta (16, Bentinck Street) manages work of mines and sale of mine products; mining operations in State of Orissa under lease for chromite and manganese.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Calcutta office exercises general control over mining operations and looks after sale of minerals; staff at head office can be transferred to Orissa office.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant employs staff at mine site for direct supervisory control.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the industrial dispute between appellant and its head office employees at Calcutta is an industrial dispute concerning a mine under s.2(a)(i) of Industrial Disputes Act, 1947, making Central Government the appropriate Government, or whether State Government of West Bengal could validly refer it.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Head Office at Calcutta is integral part of the mine; industrial dispute concerning a mine under s.2(a)(i); appropriate Government is Central Government.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "s.2(a)(i), s.2(j), s.2(k) of Industrial Disputes Act; definition of industry wide enough to include head office"
    },
    {
      "id": "pa2",
      "text": "Mining lease under Mines and Minerals (Regulation and Development) Act, 1948 includes disposing of minerals; sales from head office integrally connected with mining.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "s. d of Mines and Minerals (Regulation and Development) Act, 1948"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Dispute not concerning a mine; head office not a mine; reference by State Government valid.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "s.2(a)(i) of Industrial Disputes Act; definitions in Mines Act, 1952"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Words 'industrial dispute concerning a mine' in s.2(a)(i) to be construed using dictionary meaning or Mines Act definition of 'mine', not broad definition of 'industry' in s.2(j).",
      "addresses_issue": "i1",
      "key_observation": "'Mine' excludes office; head office employees not engaged in mining operations or incidental work."
    },
    {
      "id": "cr2",
      "text": "Mines Act s.2(j) defines mine as excavation for minerals; s.2(k) separately defines office of mine; s.2(h) persons employed in mine limited to those in mining operations or connected work.",
      "addresses_issue": "i1",
      "key_observation": "Head office work (sales) begins after mining operations over; not incidental or connected."
    },
    {
      "id": "cr3",
      "text": "Mining lease rights to dispose minerals do not expand 'mine' under s.2(a)(i).",
      "addresses_issue": "i1",
      "key_observation": "No bearing on construction of s.2(a)(i)."
    },
    {
      "id": "cr4",
      "text": "Central Government interest limited to disputes re mines as per Mines Act; head office outside; general rule State Government under s.2(a)(ii).",
      "addresses_issue": "i1",
      "key_observation": "Scheme of Mines Act excludes mine offices."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Industrial dispute at head office not concerning a mine; State Government of West Bengal appropriate Government; reference valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s.2(a)(i)",
        "s.2(a)(ii)",
        "s.2(j)",
        "s.2(k)"
      ],
      "relevance": "Defines appropriate Government; 'industry', 'industrial dispute', 'workman'; dispute not concerning mine"
    },
    {
      "name": "Mines Act, 1952",
      "sections": [
        "s.2(h)",
        "s.2(j)",
        "s.2(k)"
      ],
      "relevance": "Defines 'mine' excluding office; persons employed in mine; used to interpret 'mine' in ID Act"
    },
    {
      "name": "Mines and Minerals (Regulation and Development) Act, 1948",
      "sections": [
        "s. d"
      ],
      "relevance": "Defines mining lease including disposal; held not to expand 'mine' under ID Act s.2(a)(i)"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; Tribunal's order upheld; State Government's reference valid as dispute not concerning a mine.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the words 'in relation to a mine' must be construed without reference to the broad definition of industry prescribed by section 2(j).",
      "speaker": "court",
      "significance": "Key to rejecting petitioner's broad interpretation"
    },
    {
      "text": "The Head Office is not a mine and so, an industrial dispute raised by the employees engaged in the Head Office is not an industrial dispute concerning a mine.",
      "speaker": "court",
      "significance": "Core holding on issue"
    }
  ],
  "_case_id": "1962_24",
  "_label": 0,
  "_text_length": 14195,
  "_extracted_at": "2026-02-10T19:56:33.891034"
}