{
  "metadata": {
    "case_name": "Shabir Hussein Bholu v. State",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Criminal Appeal No. 92 of 1961",
    "date_of_judgment": "1962-09-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was a witness for the prosecution at the trial of Rafique Ahmed before the Additional Sessions Judge, Greater Bombay, for offences of murder and abetment of murder, along with two other persons.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "When examined as a witness before the committing magistrate, appellant deposed that in his presence Rafique Ahmed had stabbed the deceased Chand while he was running away.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "When examined at the trial before the Court of Sessions three months later, appellant stated that while standing on the threshold of his house he saw Rafique Ahmed and his two associates coming from the direction of the Muhammadan burial ground; one had a dagger, others sticks; he did not see anything more because his children were frightened, he closed the door and remained inside; disclaimed knowledge of what happened subsequently; in cross-examination stated it was not true that he actually saw Rafique Ahmed stabbing the deceased.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In charge to jury, Additional Sessions Judge brought out that appellant made two widely divergent statements regarding a certain part of the incident.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Jury returned verdict of not guilty under s.302 IPC against Rafique Ahmed but guilty under s.304 first part; found other two accused guilty under s.304 first part read with s.109 IPC.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "After trial, Additional Sessions Judge concluded proceedings should be taken against appellant for intentionally giving false evidence; recorded separate order directing Registrar, Sessions Court for Greater Bombay to take necessary steps for prosecution of witness Shabir Hussein Bholu for offence of perjury in view of his deposition before Committing Magistrate and deposition in Sessions Court, both on oath but at variance.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Notice issued against appellant to show cause why he should not be prosecuted under s.193 IPC for making contradictory statements regarding the same incident.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellant appeared before Additional Sessions Judge; counsel submitted contradictory statements ascribable to appellant being illiterate and mind in state of confusion; contentions rejected; notice made absolute; complaint filed under his signature before Chief Presidency Magistrate, Bombay, setting out contradictory statements.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "At trial before Chief Presidency Magistrate, objection raised that provisions of s.479A CrPC not complied with by Additional Sessions Judge; consequently Magistrate could not take cognizance; objection upheld; appellant discharged.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "State preferred revision before Bombay High Court in Cr. Revision Application No.91 of 1961 (converted from Cr.A. No.1131 of 1960); High Court granted revision, set aside discharge, remanded case for trial by Chief Presidency Magistrate; observed that though s.479A not complied with, Magistrate could take action under ss.476-479 CrPC.",
      "type": "procedural",
      "date": "1961-01-18",
      "source": "high_court"
    },
    {
      "id": "f11",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Chief Presidency Magistrate, Bombay, could take cognizance of a complaint against the appellant for an offence under s.193 Indian Penal Code, because the Additional Sessions Judge, Bombay, who filed that complaint had failed to follow the procedure laid down in s.479A of the Code of Criminal Procedure.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Provisions of s.479A CrPC override ss.476-479 in respect of giving false evidence or fabricating false evidence by a person who gives evidence during the course of judicial proceedings; s.479A enacted for enabling courts to deal with specified offences more expeditiously and effectively; non obstante clause and sub-s.6 of s.479A exclude ss.476-479 for offences in s.479A(1); where case falls squarely within s.479A(1), ss.476-479 inapplicable.",
      "supporting_facts": [
        "f6",
        "f8",
        "f9"
      ],
      "legal_basis": "s.479A CrPC; Parshotam Lal v. Madan Lal; Amolak v. State"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "s.479A provides alternative procedure for flagrant/serious cases of perjury; ss.476-479 still available for less serious cases; Parliament did not amend s.195(1)(b)(c) CrPC; s.479A additional power, not implied repeal of s.476; sub-s.6 s.479A does not exclude perjury from ss.476-479.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "s.479A, s.476-479, s.195 CrPC; Durga Prasad Khosla v. State of UP; Lal Behari v. State; Badullah v. State; State of Bombay v. Premdas"
    },
    {
      "id": "ra2",
      "text": "s.479A inapplicable because trial by jury, no opportunity to record finding in judgment; complaint based on contradictory statements before committing magistrate and sessions court, which are separate proceedings.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f11"
      ],
      "legal_basis": "s.479A CrPC; Badullah v. State"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.479A non obstante clause and sub-s.6 make it mandatory to follow s.479A(1) for complaints against intentionally giving false evidence or fabricating false evidence in any stage of judicial proceeding; ss.476-479 excluded; no distinction between flagrant/serious and other cases; court must form opinion at time of judgment/final order, record finding with reasons, give opportunity to witness.",
      "addresses_issue": "i1",
      "key_observation": "Court which disposes proceeding alone can complain; cannot later resort to s.476 if s.479A not followed."
    },
    {
      "id": "cr2",
      "text": "Disagrees with respondent's cited cases; approves Parshotam Lal and Amolak; s.476 general, but for specified perjury offences, s.479A exclusive.",
      "addresses_issue": "i1",
      "key_observation": "Jurisdiction to complain arises from false evidence in proceeding disposed by it; conditions/procedure in s.479A not optional."
    },
    {
      "id": "cr3",
      "text": "In jury trial, judge records judgment accepting/rejecting verdict, opportunity to record s.479A finding.",
      "addresses_issue": "i1",
      "key_observation": "Rejects jury trial exception."
    },
    {
      "id": "cr4",
      "text": "Committal proceedings part of same judicial proceeding as sessions trial; evidence before committing magistrate is stage of proceeding before sessions judge; contradictory statements between committal and trial stages fall under s.479A; sessions judge alone to act even if unable to determine which statement false.",
      "addresses_issue": "i1",
      "key_observation": "Distinguishes Badullah (separate proceedings); committal not independent."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Chief Presidency Magistrate right in discharging appellant as s.479A procedure not followed; High Court erred in setting aside discharge and directing trial on basis of complaint under ss.476-479.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Committal proceedings are part of same judicial proceeding culminating in sessions decision; s.479A applies to false evidence at any stage including committal.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Durga Prasad Khosla v. State of U.P.",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Held s.479A additional power for flagrant cases, s.476 still available; court disagrees."
    },
    {
      "case_name": "Lal Behari v. State",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Same view as Durga Prasad; court disagrees."
    },
    {
      "case_name": "Jaibir Singh v. Malkhan Singh",
      "citation": null,
      "treatment": "followed",
      "relevance": "s.479A complete code for offences within its ambit."
    },
    {
      "case_name": "Badullah v. State",
      "citation": "A.I.R. 1961 All. 397",
      "treatment": "distinguished",
      "relevance": "Contradictory statements in separate proceedings not under s.479A; inapplicable as committal part of same proceeding."
    },
    {
      "case_name": "State of Bombay v. Premdas Sukritdas Chadhewal Koshti",
      "citation": "A.I.R. 1960 Bom. 483",
      "treatment": "distinguished",
      "relevance": "s.479A not exhaustive, applies only to certain cases; s.476 for others; court disagrees."
    },
    {
      "case_name": "Parshotam Lal v. Madan Lal",
      "citation": "A.I.R. 1959 Punjab 145",
      "treatment": "followed",
      "relevance": "s.479A overrides ss.476-479 for false evidence in judicial proceedings."
    },
    {
      "case_name": "Amolak v. State",
      "citation": "A.I.R. 1961 Raj. 220",
      "treatment": "followed",
      "relevance": "ss.476-479 inapplicable where case within s.479A(1)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s.193",
        "s.194",
        "s.195",
        "s.199",
        "s.200",
        "s.205",
        "s.206",
        "s.207",
        "s.208",
        "s.209",
        "s.210",
        "s.211",
        "s.228",
        "s.463",
        "s.471",
        "s.475",
        "s.476",
        "s.302",
        "s.304",
        "s.109"
      ],
      "relevance": "Offences of giving false evidence, fabrication, forgery; s.193 for perjury complaint."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s.195(1)(b)(c)",
        "s.476",
        "s.477",
        "s.478",
        "s.479",
        "s.479A",
        "s.307",
        "s.89 of Act 26 of 1955"
      ],
      "relevance": "Chapter XXXV for offences affecting administration of justice; s.479A mandatory procedure for perjury in judicial proceedings, excludes ss.476-479; applies to any stage including committal."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; order of Chief Presidency Magistrate discharging appellant restored; High Court order setting aside discharge and remanding for trial set aside.",
    "relief_granted": "Appellant discharged; no trial on complaint.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Notwithstanding anything contained in ss.476 to 479, inclusive...\"",
      "speaker": "court",
      "significance": "Non obstante clause making s.479A mandatory and exclusive."
    },
    {
      "text": "\"No proceedings shall be taken under ss.476 to 479... if in respect of such a person proceedings may be taken under s.479A.\"",
      "speaker": "court",
      "significance": "Sub-s.6 s.479A excludes alternative procedures."
    },
    {
      "text": " \"The committal proceedings are a stage of the judicial proceedings before the Sessions judge.\"",
      "speaker": "court",
      "significance": "Holds committal part of same proceeding, s.479A applies."
    }
  ],
  "_case_id": "1962_389",
  "_label": 1,
  "_text_length": 23501,
  "_extracted_at": "2026-02-10T20:02:34.738645"
}