{
  "metadata": {
    "case_name": "Appellant v. Respondent No. 1 and Sureties (Respondents Nos. 2 and 3)",
    "case_year": 1959,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 345 of 1959",
    "date_of_judgment": "1962-09-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Surety bond executed on 29th September 1935 by respondents Nos. 2 and 3 in favour of the court.",
      "type": "background",
      "date": "1935-09-29",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Clause 5 of surety bond provides that sureties covenant that if order of High Court in C.M.A. No. 362/1929 reversed or varied by Privy Council, and respondent No. 1 becomes liable to pay restitution to appellant, sureties would pay the sum payable by respondent No. 1.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Privy Council decision remitted matter to trial court for ascertaining amount due to appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "During pendency of appeals in Madras High Court against trial court decision on remanded proceedings, compromise decree passed between appellant and respondent No. 1.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Compromise decree introduced complicated provisions for satisfaction of appellant's claim, including possession of properties and adjustment of rival claims; granted time to respondent No. 1; included settlement of extraneous claim by respondent No. 1 for damages due to creation of occupancy rights by appellant.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Madras High Court rejected appellant's claim against sureties on basis that appellant was defaulter.",
      "type": "procedural",
      "date": "1950-01-12",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Supreme Court held appellant was not a defaulter (in Civil Appeals Nos. 343 and 344 of 1959).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Point regarding discharge of sureties by compromise not raised by respondents Nos. 2 and 3 in trial court but urged in High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Nature and extent of liability undertaken by sureties (respondents Nos. 2 and 3) in surety bond executed in favour of the court.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Section 135 of the Indian Contract Act or equitable principles underlying it apply to surety bonds executed in favour of the court.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether compromise decree between appellant and respondent No. 1 discharges liability of sureties under the bond.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellant entitled to proceed against sureties as result of Privy Council decision and remanded proceedings led to compromise decree which attracts Clause 5 of surety bond.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Section 135 of Indian Contract Act inapplicable to surety bond executed in favour of court; remedy against surety not affected by amicable settlement between appellant and respondent No. 1.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Section 135, Indian Contract Act"
    },
    {
      "id": "pa3",
      "text": "Respondents Nos. 2 and 3 should not be allowed to raise discharge point first time in High Court appeal.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Surety bond to be strictly construed; liability only if amount claimed results directly from reversal or variation by Privy Council; compromise decree during pending disputes acts as discharge of sureties.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Compromise discharges sureties based on equitable principles underlying Section 135 of Indian Contract Act.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 135, Indian Contract Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court rejected claim assuming appellant was defaulter, but Supreme Court holds contrary; thus examines surety liability.",
      "addresses_issue": "i1",
      "key_observation": "Appellant not defaulter but still must prove entitlement against sureties."
    },
    {
      "id": "cr2",
      "text": "Section 135 not applicable in terms to court bonds as no creditor-principal debtor-surety relationship under Section 126; bond given to court.",
      "addresses_issue": "i2",
      "key_observation": "Provisions of s.135 cannot apply to a surety who has executed a bond in favour of the court."
    },
    {
      "id": "cr3",
      "text": "Equitable principles underlying s.135 apply to court bonds, e.g., extension of time to debtor discharges surety.",
      "addresses_issue": "i2",
      "key_observation": "Equitable principle applies as much to surety bond to which s.126 applies as to court bond."
    },
    {
      "id": "cr4",
      "text": "Discharge by compromise depends on bond terms: if contemplated amicable settlement, no discharge; if expected court decision invitum, compromise discharges.",
      "addresses_issue": "i3",
      "key_observation": "Question always one of construing the surety bond."
    },
    {
      "id": "cr5",
      "text": "Bond terms not contemplating compromise; compromise introduced new complications, possession adjustments, time grant, extraneous damages claim outside Privy Council proceedings.",
      "addresses_issue": "i3",
      "key_observation": "Impossible to hold it was within contemplation of sureties that parties would amicably settle in this manner."
    },
    {
      "id": "cr6",
      "text": "High Court entitled to consider discharge point raised in appeal as pure question of law; appellant's consent claim is afterthought.",
      "addresses_issue": "i3",
      "key_observation": "No substance in argument that point should not have been allowed in High Court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Provisions of Section 135 Indian Contract Act do not apply in terms to surety bonds executed in favour of court.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Equitable principles underlying Section 135 apply to such bonds.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Compromise decree discharges sureties as bond did not contemplate amicable settlement with new elements, time grant, and extraneous matters.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Appellant not entitled to remedy against sureties despite not being defaulter.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "The Official Liquidators, The Travancore National Quilon Bank Ltd. v. The Official Assignee of Madras",
      "citation": "I.L.R. 1944 Mad. 708",
      "treatment": "followed",
      "relevance": "Compromise discharges surety if not within contemplation of bond."
    },
    {
      "case_name": "Parvatibai v. Vinayak Balvant",
      "citation": "I.L.R. 1938 Bom. 794",
      "treatment": "followed",
      "relevance": "Compromise discharges surety if not within contemplation of bond."
    },
    {
      "case_name": "Mahomedalli Ibrahimji v. Laxmibai",
      "citation": "1929 I.L.R. LIV Bom. 118",
      "treatment": "followed",
      "relevance": "Compromise discharges surety if not within contemplation of bond."
    },
    {
      "case_name": "Narsingh Mahton v. Nirpat Singh",
      "citation": "1932 I.L.R. XI Patna 590",
      "treatment": "followed",
      "relevance": "Compromise discharges surety if not within contemplation of bond."
    },
    {
      "case_name": "Muhammad Yusaf v. Ram Gobinda Ojha",
      "citation": "1927 I.L.R. LV Cal. 91",
      "treatment": "followed",
      "relevance": "Compromise discharges surety if not within contemplation of bond."
    },
    {
      "case_name": "Haji Ahmed v. Maruti Ramji",
      "citation": "1930 I.L.R. LV Bom 97",
      "treatment": "distinguished",
      "relevance": "No discharge if compromise within contemplation of parties."
    },
    {
      "case_name": "Appunni Nair v. Isack Mackadan",
      "citation": "1919 I.L.R. 43 Mad. 272",
      "treatment": "distinguished",
      "relevance": "No discharge if compromise within contemplation of parties."
    },
    {
      "case_name": "Kanailal Mookerjee v. Kali Mohan Chatterjee",
      "citation": "A.I.R. 1957 Cal 645",
      "treatment": "distinguished",
      "relevance": "No discharge if compromise within contemplation of parties."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Contract Act",
      "sections": [
        "Section 126",
        "Section 135"
      ],
      "relevance": "Defines contract of guarantee; provides discharge of surety on composition with principal debtor; principles apply equitably to court bonds."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court holds that though appellant was not a defaulter, the compromise decree between appellant and respondent No. 1 discharged the sureties (respondents Nos. 2 and 3) under the bond, as it was not within contemplation of the bond, granted time, and included extraneous matters; appellant's claim against sureties rejected.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "there cannot be any doubt that in terms, the provisions of s. 135 cannot apply to a court bond.",
      "speaker": "court",
      "significance": "Clarifies statutory inapplicability to court surety bonds."
    },
    {
      "text": "the equitable principles underlying the provisions of s. 135 apply to such a bond.",
      "speaker": "court",
      "significance": "Extends equitable discharge rules to court bonds."
    },
    {
      "text": "it is impossible to hold that it was within the contemplation of the sureties when they executed the bond that the parties would amicably settle their dispute in the manner they have done.",
      "speaker": "court",
      "significance": "Key to holding compromise discharges sureties."
    }
  ],
  "_case_id": "1962_266",
  "_label": 0,
  "_text_length": 12533,
  "_extracted_at": "2026-02-10T20:00:22.490672"
}