{
  "metadata": {
    "case_name": "Appellant (Tenant) v. Respondents (Landlords)",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The building situate at No. 41 Purani Mandi, Ajmer, consists of a large number of rooms, and the respondents are its owners.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On October 13, 1935, the said building was taken on lease by the appellants father for a period of one year on a rent of Rs. 50/- per month.",
      "type": "background",
      "date": "1935-10-13",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On July 10, 1950, the respondents gave a lease of the said building in favour of the appellant for a period of one year on a rent of Rs. 65/- per month.",
      "type": "background",
      "date": "1950-07-10",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On August 8, 1952, a fresh lease was executed in favour of the appellant on an enhanced rent of Rs. 70/- per month. Under the said lease the tenancy was to commence from August 1, 1952.",
      "type": "material",
      "date": "1952-08-08",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The lease deed dated August 8, 1952 provided that the house had been taken on rent for one year and if the rent falls into arrears then the second party shall be jointly and severally entitled to eject the first party before the expiry of the term of tenancy and realise the rent due.",
      "type": "material",
      "date": "1952-08-08",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On June 27, 1954, the respondents issued a notice to the appellant, through their Advocates, calling upon him to vacate the premises by midnight of July 31, 1954/August 1, 1954. In that notice it was alleged that the appellant was in arrears of rent and that he had also sublet the property.",
      "type": "procedural",
      "date": "1954-06-27",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "In the reply notice the appellant promised to pay the arrears of rent as early as possible, but stated that he had all along been subletting portions of the premises to others, except the portion under his occupation.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The appellant did not comply with the terms of the notice.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On August 2, 1954, the respondents filed Civil Suit No. 762 of 1954 in the Court of the Subordinate Judge, First Class, Ajmer, against the appellant for eviction, for recovery of arrears of rent and for other reliefs. The plaint was later on amended.",
      "type": "procedural",
      "date": "1954-08-02",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The appellant contested the suit on various grounds and particularly on the ground that it was not maintainable. In the written-statement the fact that the premises were sublet to tenants was not denied.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "The learned Subordinate Judge decreed the suit, holding that the notice was valid and that the appellant was liable to be evicted under s. 13(1)(b) of the Delhi and Ajmer Rent Control Act, 1952 (XXXVIII of 1952), hereinafter called the Act, as he had sublet portions of the premises without the consent in writing of the landlord.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "On appeal the Senior Civil Judge, Ajmer, allowed the appeal. He held that the notice issued to the appellant was short by 24 hours and that he had no right to sublet the premises without the written consent of the landlord, though there were sub-tenants in the premises when the appellant took the lease.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "On second appeal, the High Court allowed the appeal and restored the decree of the trial court. The High Court held that the notice complied with the provisions of s. 106 of the Transfer of Property Act, 1882, and that, in any event, as the tenancy expired by mere efflux of time, no notice was necessary.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The suit was filed for eviction, and the ground for eviction was two-fold, viz., the rent was not paid and that the appellant had sublet the premises. In the plaint it was not stated that the tenancy was a monthly tenancy; on the other hand, the respondents alleged in the plaint that the appellant was their tenant under the lease deed dated August 8, 1952, and they filed, along with the plaint the said lease deed.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "The appellant admitted the facts regarding the lease deed dated August 8, 1952.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Admittedly after the lease deed of 1952 the appellant has sublet some of the rooms of the building to others without obtaining the written consent of the landlord. The fact that there were sub-tenants in the said portions could not conceivably be of any help to the appellant, because the new sub-tenants were not holding under the earlier sub-tenants, but were inducted by the appellant, after the earlier sub-tenancies were terminated.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a second appeal lay to the High Court against the decree and judgment of the Civil Judge.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "If no second appeal lay, whether the High Court's power of interference with that judgment was confined only to s. 35 of the Act and whether under that section it had jurisdiction to set aside the judgment on merits, whether of law or of fact.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the High Court wrongly held that the notice complied with the provisions of s. 106 of the Transfer of Property Act, 1882.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the High Court made out a totally new case in holding that the tenancy had expired by efflux of time.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Scope of the High Court's jurisdiction under s. 35(1) of the Delhi and Ajmer Rent Control Act, 1952.",
      "framed_by": "court"
    },
    {
      "id": "i6",
      "text": "Construction of s. 13(1) of the Delhi and Ajmer Rent Control Act, 1952, particularly whether statutory notice under s. 106 TPA is required and whether subletting without consent applies to new sub-tenants inducted after earlier ones.",
      "framed_by": "court"
    },
    {
      "id": "i7",
      "text": "Whether the term of the lease dated August 8, 1952 was for one year and expired by efflux of time, dispensing with notice.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No second appeal lay to the High Court against the decree and judgment of the Civil Judge.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "If no second appeal lay against the decree and judgment of the Civil Judge, the High Court's power of interference with that judgment was confined only to s. 35 of the Act and that under that section it had no jurisdiction to set aside the judgment on merits, whether of law or of fact.",
      "supporting_facts": [],
      "legal_basis": "s. 35 of the Delhi and Ajmer Rent Control Act, 1952; Hari Shankar v. Rao Girdhari Lal Chowdhury 1962 Supp. 1 S.C.R. 933"
    },
    {
      "id": "pa3",
      "text": "The High Court wrongly held that the notice complied with the provisions of s. 106 of the Transfer of Property Act, 1882.",
      "supporting_facts": [
        "f6",
        "f12"
      ],
      "legal_basis": "s. 106 of the Transfer of Property Act, 1882"
    },
    {
      "id": "pa4",
      "text": "The High Court made out a totally new case in holding that the tenancy had expired by efflux of time, as this point was not raised either in the plaint or in the lower courts, and it is a mixed question of fact and law.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "The provisions of s. 13(1) of the Act are an additional protection to a tenant and do not enable the landlord to dispense with a statutory notice before filing a suit for eviction; the notice given did not comply with s. 106 TPA.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s. 13(1) of the Delhi and Ajmer Rent Control Act, 1952; s. 106 of the Transfer of Property Act, 1882"
    },
    {
      "id": "pa6",
      "text": "s. 13(1)(b)(i) of the Act applies only to a case of sub-tenancy created for the first time after the lease was taken and does not cover a case where there was already a sub-tenant and a new subtenant was inducted when the previous sub-tenant vacated it.",
      "supporting_facts": [
        "f7",
        "f16"
      ],
      "legal_basis": "s. 13(1)(b) of the Delhi and Ajmer Rent Control Act, 1952"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The appellant was in arrears of rent and had sublet the property.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The appellant was their tenant under the lease deed dated August 8, 1952.",
      "supporting_facts": [
        "f4",
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is not necessary to express opinion on whether second appeal lay, as even if not, the High Court had ample jurisdiction to interfere under s. 35(1) of the Act.",
      "addresses_issue": "i1",
      "key_observation": "The High Court may, at any time, call for the record of any case under this Act for the purpose of satisfying itself that a decision made therein is according to law and may pass such order in relation thereto as it thinks fit."
    },
    {
      "id": "cr2",
      "text": "Jurisdiction under s. 35 of the Act is wider than under s. 115 CPC, though not equivalent to appeal; refers to overall decision being according to law, miscarriage of justice due to mistake of law.",
      "addresses_issue": "i2",
      "key_observation": "Reliance on Hari Shankar v. Rao Girdhari Lal Chowdhury and Bell Co. Ltd. v. Waman Hemraj."
    },
    {
      "id": "cr3",
      "text": "The term of the tenancy had expired by efflux of time and therefore no question of statutory notice would arise.",
      "addresses_issue": "i3",
      "key_observation": "Lease was for one year from August 1, 1952, as per deed; not monthly tenancy."
    },
    {
      "id": "cr4",
      "text": "Point of expiry by efflux not new; plaint referred to lease deed of fixed term, filed with plaint, admitted by appellant; depends on construction of lease deed.",
      "addresses_issue": "i4",
      "key_observation": "High Court justified in considering it."
    },
    {
      "id": "cr5",
      "text": "s. 13(1) does not require notice if tenancy expired; appellant sublet after 1952 lease without written consent.",
      "addresses_issue": "i6",
      "key_observation": "New sub-tenants inducted by appellant after earlier ones terminated, not holding under prior sub-tenants."
    },
    {
      "id": "cr6",
      "text": "Civil Judge refused eviction on wrong basis that appellant was monthly tenant, ignoring lease term; decree not according to law; High Court right to set aside under s.35.",
      "addresses_issue": "i5",
      "key_observation": "High Court acted within jurisdiction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court had jurisdiction under s. 35(1) of the Act to interfere as the decree of Civil Judge was not according to law.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Lease dated August 8, 1952 was for one year commencing August 1, 1952, expired by efflux of time; no statutory notice under s.106 TPA required.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Appellant sub-let part of premises without landlord's consent in writing after commencement of Act, liable to eviction under s.13(1)(b).",
      "resolves_issue": "i6",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hari Shankar v. Rao Girdhari Lal Chowdhury",
      "citation": "1962 Supp. 1 S.C.R. 933",
      "treatment": "followed",
      "relevance": "Scope of High Court's jurisdiction under s.35 of the Act is wider than s.115 CPC, covers miscarriage of justice due to mistake of law."
    },
    {
      "case_name": "Bell Co. Ltd. v. Waman Hemraj",
      "citation": "1938 40 Bom. L.R. 125",
      "treatment": "followed",
      "relevance": "Quoted with concurrence on scope of revisional jurisdiction; not to interfere merely if High Court would arrive at different conclusion."
    }
  ],
  "statutes_cited": [
    {
      "name": "Delhi and Ajmer Rent Control Act, 1952 (XXXVIII of 1952)",
      "sections": [
        "s. 13(1)(b)",
        "s. 35(1)"
      ],
      "relevance": "Grounds for eviction on subletting without consent; High Court revisional jurisdiction to ensure decision according to law."
    },
    {
      "name": "Transfer of Property Act, 1882 (IV of 1882)",
      "sections": [
        "s. 106"
      ],
      "relevance": "Notice requirements for termination of tenancy; not required if tenancy expires by efflux of time."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The Supreme Court upholds the High Court's judgment restoring the trial court's decree for eviction, holding that the tenancy expired by efflux of time, no notice was required, and the appellant sublet without consent, justifying eviction under s.13(1)(b) of the Act. High Court acted within jurisdiction under s.35.",
    "relief_granted": "Eviction decreed in favour of respondents.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The phrase according to law refers to the decision as a whole, and is not to be equated to errors of law or of fact simpliciter. It refers to the overall decision, which must be according to law which it would not be, if there is a miscarriage of justice due to a mistake of law.\"",
      "speaker": "court",
      "significance": "Defines scope of s.35 jurisdiction from Hari Shankar case."
    },
    {
      "text": "Section 13(1)(b)(i) clearly says that if a tenant, without obtaining the consent of the landlord in writing has, after the commencement of this Act, sub-let... he is liable to be evicted.",
      "speaker": "court",
      "significance": "Interprets subletting provision as applicable to post-Act inductions."
    },
    {
      "id": "kq3",
      "text": "\"As the term fixed under the deed had expired, the appellant was not entitled to any statutory notice under s. 106 of the Transfer of Property Act, 1882.\"",
      "speaker": "court",
      "significance": "Key holding on notice not required for fixed-term expiry."
    }
  ],
  "_case_id": "1962_92",
  "_label": 0,
  "_text_length": 12880,
  "_extracted_at": "2026-02-10T19:58:05.851282"
}