{
  "metadata": {
    "case_name": "M. Golodetz Company v. Respondents",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 493 of 1960",
    "date_of_judgment": "1962-12-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are a firm carrying on business as importers in the name and style of M. Golodetz Company at 120, Wall Street, New York, USA.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondents are a firm carrying on business as exporters of manganese ore with principal office at Bentinck Street, Calcutta.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "By contract in writing dated July 5, 1955, respondents agreed to sell and appellants agreed to buy 25,000 tons of manganese ore on terms and conditions set out therein.",
      "type": "material",
      "date": "1955-07-05",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Contract contained arbitration clause: Any dispute arising out of the contract is to be settled by arbitration in New York according to the rules of the American Arbitration Association.",
      "type": "material",
      "date": "1955-07-05",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Between September 1956 and August 1957, respondents supplied 5478 tons of manganese ore.",
      "type": "material",
      "date": "1956-09 to 1957-08",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Disputes arose about liability of respondents to ship the balance of goods not delivered.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellants referred disputes to arbitration of American Arbitration Association on or about January 15, 1958, claiming compensation for respondents' default in shipping balance.",
      "type": "procedural",
      "date": "1958-01-15",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On February 2, 1958, respondents commenced suit No. 194 of 1958 on original side of Calcutta High Court claiming: decree that contract dated July 5, 1955 be adjudged void and delivered up and cancelled; perpetual injunction restraining appellants from enforcing contract; declaration that contract stands discharged and parties have no rights/obligations thereunder.",
      "type": "procedural",
      "date": "1958-02-02",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Respondents' case in suit: appellants accepted ore shipped till August 1957 in full satisfaction; contract discharged. Alternatively: appellants repudiated or committed breaches, contract discharged/void/voidable and avoided. Further alternative: contract impossible of performance, frustrated/discharged.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Appellants petitioned Calcutta High Court for stay of suit under s.34 Arbitration Act, 1940 and injunction restraining respondents from proceeding with suit.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Ray J. held s.34 applies to foreign arbitration; remedy for aggrieved party is to contest in foreign tribunal; no sufficient reason for not staying action; refused stay.",
      "type": "procedural",
      "date": "1958",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appeal from Ray J.'s order under Letters Patent; High Court reversed, vacated stay order. Reasons: all evidence in India; forex restrictions make it impossible for respondents to produce evidence in New York; foreign tribunal not safe/convenient; conceded entire matter governed by Indian laws (Arbitration Act, Contract Act).",
      "type": "procedural",
      "date": "1959-04-29",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appeal to Supreme Court by special leave against High Court order dated April 29, 1959.",
      "type": "procedural",
      "date": "1959-04-29",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Appellants averred petition bona fide, filed at earliest; ready/willing for arbitration; no sufficient reason not to refer.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Respondents contended: entire evidence/witnesses in India, none in New York; proper law Indian law/Contracts Act; difficult questions of law; arbitration foreign, award foreign, arbitrators not controlled by Indian courts.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "Appellants did not challenge that all evidence in India, none in New York.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Severe forex restrictions make it impossible for respondents to take witnesses to New York; arbitration would be ex parte.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Ray J. held contract governed by American law; in appeal, appellants' counsel (Mr. S. Choudhry) propounded that, but Advocate-General conceded governed by Indian law.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there are sufficient reasons under s.34 of Arbitration Act, 1940 to refuse stay of suit despite arbitration agreement for foreign arbitration in New York.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether s.34 Arbitration Act applies to agreement for foreign arbitration tribunal.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Law applicable to the contract.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Petition bona fide, filed at earliest opportunity; ready and willing to do all necessary for arbitration; no sufficient reason why matters should not be referred to arbitration.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "s.34 Arbitration Act, 1940"
    },
    {
      "id": "pa2",
      "text": "Would be injustice to allow respondents to pick and choose clauses; if suit not stayed, petitioners greatly prejudiced.",
      "supporting_facts": [
        "f10",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Deny evidence cannot be given before arbitrators; no denial of justice; not necessary/impossible for respondents to send witnesses to New York.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "High Court improperly interfered with trial judge's discretion.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "No concession by Advocate-General that Indian law governs.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Entire evidence and witnesses in India, none in New York.",
      "supporting_facts": [
        "f15",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Proper law of contract is Indian law; Indian Contract Act governs rights/obligations.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Indian Contract Act"
    },
    {
      "id": "ra3",
      "text": "Suit raises difficult questions of law; should not submit to lay-men arbitrators.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Foreign arbitration in New York; award foreign; arbitrators not subject to Indian court control; s.34 not availed.",
      "supporting_facts": [
        "f4",
        "f15"
      ],
      "legal_basis": "Arbitration Act, 1940"
    },
    {
      "id": "ra5",
      "text": "Forex restrictions; impossible to produce evidence in New York; ex parte proceedings; injustice.",
      "supporting_facts": [
        "f12",
        "f17"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Assume s.34 applies even to foreign arbitration; court normally stays action in breach of arbitration agreement unless sufficient reasons; rule applies to foreign/domestic.",
      "addresses_issue": "i2",
      "key_observation": "Court insists on abiding by bargain unless sufficient reason contrary; promotes sanctity of contracts."
    },
    {
      "id": "cr2",
      "text": "Court not obliged to grant stay merely because of agreement for foreign arbitration; discretion based on all circumstances; whether sufficient reasons is question of fact.",
      "addresses_issue": "i1",
      "key_observation": "Peculiar circumstances here."
    },
    {
      "id": "cr3",
      "text": "Respondents' affidavit that all evidence in India unchallenged; forex restrictions make impossible to take witnesses to New York; ex parte; injustice to respondents.",
      "addresses_issue": "i1",
      "key_observation": "Balance of inconvenience favours no stay."
    },
    {
      "id": "cr4",
      "text": "Ray J. failed to consider relevant affidavits/evidence location; did not apply mind; High Court competent to interfere.",
      "addresses_issue": "i1",
      "key_observation": "High Court right in reversing."
    },
    {
      "id": "cr5",
      "text": "No opinion on applicable law; for trial court to decide.",
      "addresses_issue": "i3",
      "key_observation": "Parties must accept Indian Contract Act for rights/obligations."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S.34 Arbitration Act empowers stay even for foreign arbitration, but court may refuse if sufficient reasons shown.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Sufficient reasons exist here to refuse stay: all evidence in India, unchallenged; forex restrictions prevent respondents producing evidence; foreign arbitration not convenient/safe.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "High Court correctly interfered as Ray J. failed to consider material circumstances.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Arbitration Act, 1940",
      "sections": [
        "s. 34"
      ],
      "relevance": "Power to stay proceedings in breach of arbitration agreement, applicable even to foreign arbitration unless sufficient reasons to refuse."
    },
    {
      "name": "Indian Contract Act",
      "sections": [],
      "relevance": "Governs rights and obligations under the contract."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 133"
      ],
      "relevance": "Mentioned in context of petition for certificate."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding Calcutta High Court's refusal to stay the suit under s.34 Arbitration Act. Found sufficient reasons due to location of evidence in India, forex restrictions making foreign arbitration impracticable for respondents, leading to potential injustice. Matter to proceed to trial in India.",
    "relief_granted": "None; suit to proceed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the statement made in the affidavit of the respondent had remained practically unchallenged, that all the evidence in the case relating to the disputes was in India and that was a strong ground for not exercising the discretion in favour of the appellants.\"",
      "speaker": "court",
      "significance": "Key reason for refusing stay."
    },
    {
      "text": "\"having regard to the severe restrictions imposed in the matter of providing foreign exchange to individual citizens it would be impossible for the respondents to take their witnesses to New York\"",
      "speaker": "court",
      "significance": "Explains practical impossibility leading to ex parte proceedings."
    },
    {
      "text": "\"The Court is therefore not obliged to grant stay merely because the parties have even under a commercial contract agreed to submit their dispute in a matter to an arbitration tribunal in a foreign country.\"",
      "speaker": "court",
      "significance": "Clarifies discretion under s.34 for foreign arbitration."
    }
  ],
  "_case_id": "1962_173",
  "_label": 0,
  "_text_length": 15975,
  "_extracted_at": "2026-02-10T19:59:32.493581"
}