{
  "metadata": {
    "case_name": "Unnamed Appellant (Head Constable) v. State",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Criminal Appeal No. 144 of 1961",
    "date_of_judgment": "1962-11-09"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In February 1954, the appellant was employed as a Head Constable at the Kalkeri Outpost attached to the Hippussagi Police Station.",
      "type": "background",
      "date": "1954-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On February 23, 1954, the appellant went to Budhihal Road on receipt of information about the smuggling of Ganja from the then Hyderabad State to Kalkeri and at about 2 or 3 p.m. actually caught one Nabi Sab Kembhavi with a bundle containing 15 packets of Ganja.",
      "type": "material",
      "date": "1954-02-23",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "These 15 packets of Ganja were seized and for this seizure the appellant prepared a Panchnama in which however he incorrectly showed the seizure of 9 packets of Ganja only.",
      "type": "material",
      "date": "1954-02-23",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "On February 24, 1954, it is alleged, the appellant had a new Panchnama prepared in which it was falsely recited that a person who was coming towards the village of Budhihal ran away on seeing the Panchas and the Havaldar, after throwing away a bundle and this bundle was found to contain 9 packets of Ganja weighing one tola each. The date in the Panchnama was mentioned as February 23, 1954. A report to the same effect was also prepared.",
      "type": "material",
      "date": "1954-02-24",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "The prosecution case is that no such thing happened on February 24, 1954, or February 23, 1954 but that this Panchnama and the report were falsely prepared by the appellant with the dishonest intention of saving Nabi Sab Kembhavi who had actually been caught with Ganja from legal punishment.",
      "type": "disputed",
      "date": "1954-02-23",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "The appellant pleaded not guilty and contended that the Panchnama and the report which are challenged by the prosecution as a false Panchnama were correctly prepared by him on February 23, 1954, and mention the true state of affairs.",
      "type": "disputed",
      "date": "1954-02-23",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Appellant raised defence that Rule 542 of the Bombay Police Manual barred his prosecution as prior permission of the District Superintendent of Police had not been taken.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Appellant raised defence that in any case as the prosecution was commenced long after six months had elapsed after the alleged commission of the offence it was barred by s.161(1) of the Bombay Police Act.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The appellant was tried by the Additional Sessions Judge, Bijapur, on a charge under s. 218 of the Indian Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The appellant was convicted by the Trial Court under s. 218 of the Indian Penal Code and sentenced to rigorous imprisonment for a period of one year.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Against that order, he appealed to the High Court of Mysore in Criminal Appeal No. 362 of 1959.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The High Court agreed with the Trial Court that an offence under s. 218 of the Indian Penal Code had been made out. The defence under Rule 542 of the Bombay Police Manual was rejected on the ground that this Rule had no statutory force.",
      "type": "procedural",
      "date": "1961-03-08",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "As regards the plea of limitation under s. 161(1) of the Bombay Police Act, 1951, the High Court was of the opinion that on February 24, 1954, the appellant had duty to perform in regard to the crime detected on the 23rd and hence it was not possible to hold that the preparation of a false panchnama and a false report were acts done under colour or in excess of any such duty or authority as aforesaid as found in s. 161(1) of the Bombay Police Act. Accordingly, the High Court dismissed the appeal.",
      "type": "procedural",
      "date": "1961-03-08",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Against that decision the present appeal has been preferred by special leave granted by this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The prosecution was admittedly instituted much more than six months after the date of the act complained of.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant's prosecution was barred by the special rule of limitation in s. 161(1) of the Bombay Police Act, 1951.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the preparation of a false Panchnama and a false report was an act done under colour or in excess of any such duty or authority as aforesaid.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether s. 161(1) of the Bombay Police Act is limited to offences against the Act and has no application to offences under the Indian Penal Code.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Panchnama and the report were correctly prepared on February 23, 1954, and mention the true state of affairs.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Rule 542 of the Bombay Police Manual barred his prosecution as prior permission of the District Superintendent of Police had not been taken.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Rule 542 of the Bombay Police Manual"
    },
    {
      "id": "pa3",
      "text": "The prosecution was barred by s.161(1) of the Bombay Police Act as instituted more than six months after the offence.",
      "supporting_facts": [
        "f8",
        "f15"
      ],
      "legal_basis": "s.161(1) Bombay Police Act, 1951"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "On February 24, 1954, the appellant had duty to perform in regard to the crime detected on the 23rd and hence it was not possible to hold that the preparation of a false panchnama and a false report were acts done under colour or in excess of any such duty or authority.",
      "supporting_facts": [
        "f4",
        "f12",
        "f13"
      ],
      "legal_basis": "s.161(1) Bombay Police Act, 1951"
    },
    {
      "id": "ra2",
      "text": "s. 161(1) of the Bombay Police Act is limited to offences against the Act and has no application to offences under the Indian Penal Code.",
      "supporting_facts": [],
      "legal_basis": "s.161(1) Bombay Police Act, 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Preparation of a correct Panchnama and a true report as regards the seizure of Ganja was the duty of the appellant as per s.64 Bombay Police Act and authorisation under Bombay Prohibition Act.",
      "addresses_issue": "i1",
      "key_observation": "It is not disputed that the preparation of a correct Panchnama and a true report as regards the seizure the Ganja was, the duty of the police officer."
    },
    {
      "id": "cr2",
      "text": "When the preparation of a correct Panchnama and a true report is the duty, preparing instead a false one is done under colour of that duty, using the duty as a cloak for corrupt action.",
      "addresses_issue": "i2",
      "key_observation": "The words under colour of duty have been used in s. 161(1) to include acts done under the cloak of duty, even though not by virtue of the duty."
    },
    {
      "id": "cr3",
      "text": "Lexicon definitions support 'under colour of office/duty' meaning act unjustly done by pretence of office, as a shadow or veil.",
      "addresses_issue": "i2",
      "key_observation": "Cites Wharton's Law Lexicon and Stroud's Judicial Dictionary."
    },
    {
      "id": "cr4",
      "text": "The fact that false report was prepared on 24th after seizure on 23rd does not affect; still under colour of duty to prepare correct documents.",
      "addresses_issue": "i2",
      "key_observation": "Whether the false report was prepared on the 23rd or the 24th the fact still remains that he prepared this under colour of his duty."
    },
    {
      "id": "cr5",
      "text": "Follows precedents: Madhav Ganpat Prasad v. Maihidkhan and Narayan Hari v. Yeswant Raoji holding acts in deliberate disregard of duty still under colour.",
      "addresses_issue": "i2",
      "key_observation": "Even though the act was done in deliberate disregard of his proper duty and authority the act was one done under colour or in excess of a duty."
    },
    {
      "id": "cr6",
      "text": "Distinguishes Parbat Gopal Walekar v. Dinkar Shinde: Rash driving not related to duty, but gross violation does not cease to be under colour.",
      "addresses_issue": "i2",
      "key_observation": "The view that if the alleged act is found to have been done in gross violation of the duty then it ceased to be an act done under colour, is not correct."
    },
    {
      "id": "cr7",
      "text": "s.161(1) applies to any offence, not limited to Police Act, as 'offence' defined in Bombay General Clauses Act includes IPC offences; contrast s.150 language.",
      "addresses_issue": "i3",
      "key_observation": "Offence has been defined in the Bombay General Clauses Act to mean any act or omission made punishable by any law for the time being in force."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The acts by which the offence under s. 218 IPC was alleged to have been committed were done under colour of a duty laid upon him by the Bombay Police Act.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "s.161(1) Bombay Police Act protects police officers from prosecution after 6 months for alleged offences done under colour or in excess of duty, including IPC offences.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "The prosecution against the appellant should have been dismissed in accordance with s.161(1) of the Bombay Police Act.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Madhav Ganpat Prasad v. Maihidkhan",
      "citation": "I.L.R. 41 Bom. 737",
      "treatment": "followed",
      "relevance": "Assumed seizure case fell within limitation provision under colour of duty."
    },
    {
      "case_name": "Narayan Hari v. Yeswant Raoji",
      "citation": "A.I.R. 1928 Bom 352",
      "treatment": "followed",
      "relevance": "Full Bench held deliberately incorrect statement recording under colour or in excess of duty despite deliberate disregard."
    },
    {
      "case_name": "Parbat Gopal Walekar v. Dinkar Shinde",
      "citation": "1960 63 Bom. L.R. 189",
      "treatment": "distinguished",
      "relevance": "Rash driving not under colour of duty as unrelated; court disagrees gross violation removes colour protection."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Police Act, 1951",
      "sections": [
        "s.161(1)",
        "s.64",
        "s.150"
      ],
      "relevance": "s.161(1) bars prosecution after 6 months for acts under colour or excess of duty; s.64 imposes duty to report seizures; s.150 contrasts language limiting to Act offences."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "s.218"
      ],
      "relevance": "Charge of framing incorrect record with intent to save from punishment."
    },
    {
      "name": "Bombay District Police Act, 1890",
      "sections": [
        "s.80 sub-s.(3)"
      ],
      "relevance": "Similar provision to s.161(1) Bombay Police Act 1951, interpreted in precedents."
    },
    {
      "name": "Bombay General Clauses Act",
      "sections": [],
      "relevance": "Defines 'offence' broadly to include any punishable act under any law."
    },
    {
      "name": "Bombay Prohibition Act",
      "sections": [],
      "relevance": "Authorised seizure of Ganja."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court allowed the appeal by special leave, holding that the prosecution was barred by s.161(1) of the Bombay Police Act, 1951, as the acts were done under colour of duty and instituted after six months. The conviction and sentence by trial court and High Court order dismissing appeal set aside.",
    "relief_granted": "Prosecution dismissed; appeal allowed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The only question for decision in this appeal is whether the appellants prosecution was barred by the special rule of limitation in s. 161(1) of the Bombay Police Act, 1951.",
      "speaker": "court",
      "significance": "Frames the sole issue."
    },
    {
      "text": "When he [the police-officer] prepares a false Panchnama or a false report he is clearly using the existence of his legal duty as a cloak for his corrupt action or to use the words in Strouds Dictionary as a veil to his falsehood.",
      "speaker": "court",
      "significance": "Core interpretation of 'under colour of duty'."
    },
    {
      "text": "It must accordingly be held that the prosecution against the appellant should have been dismissed in accordance with the provisions of s. 161(1) of the Bombay Police Act.",
      "speaker": "court",
      "significance": "Final holding allowing appeal."
    }
  ],
  "_case_id": "1962_311",
  "_label": 1,
  "_text_length": 15503,
  "_extracted_at": "2026-02-10T20:01:06.601693"
}