{
  "metadata": {
    "case_name": "Superintendent of Police, Tripura v. Gopal Chander Dutta Choudhury",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 581 of 1961",
    "date_of_judgment": "1962-09-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Gopal Chander Dutta Choudhury (respondent) was appointed a constable in the Police Force of Tripura by the Superintendent of Police, Agartala by order dated April 18, 1954. The employment was temporary and was liable to be terminated with one month's notice.",
      "type": "background",
      "date": "1954-04-18",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On December 6, 1957, the Superintendent of Police, acting under r. 5 of the Central Services (Temporary Service) Rules, 1949, informed the respondent that his services will be terminated with effect from 6-1-58 A.M.",
      "type": "material",
      "date": "1957-12-06",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The respondent presented an appeal to the Chief Commissioner against the order of termination.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "By letter dated April 11, 1958 the respondent was informed that as he was an Ex-convict for theft, nothing can be done for him.",
      "type": "material",
      "date": "1958-04-11",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In reply to another application addressed to the Chief Commissioner the respondent was informed by letter dated May 26, 1958, that he was already informed in connection with his previous appeal that as he was an Ex-convict in a case of theft he cannot be reemployed by the Administration.",
      "type": "material",
      "date": "1958-05-26",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The respondent then filed in the Court of the Judicial Commissioner, Tripura, a petition for a writ under Art. 226 of the Constitution praying for a writ declaring that the order of the Superintendent of Police terminating his service was illegal and for a writ of mandamus or a writ of certiorari directing the Chief Commissioner not to enforce the said order and for an order reinstating him in the Police Force of the Tripura Administration with retrospective effect. (Civil Misc. Writ Petition No. 4 of 1959)",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Tripura Administration submitted in rejoinder that the respondent being a temporary employee of the Police Force, his services were lawfully terminated under r. 5 of the Central Civil Services (Temporary Service) Rules, 1949.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The Judicial Commissioner of Tripura held that the respondent was a temporary employee, but the order terminating the respondent's employment was invalid for it infringed the constitutional guarantee of protection of public servants under Art. 311 which applied to temporary as well as permanent public servants.",
      "type": "procedural",
      "date": "1960-01-15",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appeal to Supreme Court with a certificate granted by the Judicial Commissioner of Tripura under Art. 132 of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the termination of employment of the respondent by the Superintendent of Police by order dated December 6, 1957, was in violation of Art. 311(2) of the Constitution, i.e., whether it was a termination simpliciter pursuant to contractual terms or a dismissal/removal for misconduct attracting Art. 311 protection.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The respondent being a temporary employee of the Police Force, his services were lawfully terminated under r. 5 of the Central Civil Services (Temporary Service) Rules, 1949.",
      "supporting_facts": [
        "f1",
        "f2",
        "f7"
      ],
      "legal_basis": "r. 5 of the Central Civil Services (Temporary Service) Rules, 1949"
    },
    {
      "id": "pa2",
      "text": "Termination of service of a temporary public servant pursuant to the terms of a contract does not entitle him to protection under Art. 311(2); it is not per se dismissal or removal.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Parshotam Lal Dhingra v. Union of India; Satish Chander Anand v. Union of India; Art. 311(2)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The order terminating his service was illegal as it was in fact a punishment for previous misconduct (being ex-convict), debarring future employment, camouflaged as termination simpliciter; indicated by Chief Commissioner's letters.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Art. 311; Art. 226"
    },
    {
      "id": "ra2",
      "text": "Court should investigate like under s.33 Industrial Disputes Act whether termination was mala fide or punitive, going behind the form to substance.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "Chartered Bank Bombay v. Chartered Bank Employees Union; Management of Chandramalai Estate v. Its Workmen; s.33 Industrial Disputes Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Termination of employment of a temporary public servant pursuant to contractual terms (one month's notice under r.5) does not attract Art. 311(2) protection, as it is not dismissal or removal; no enquiry or show cause needed.",
      "addresses_issue": "i1",
      "key_observation": "When employment of a temporary public servant is terminated pursuant to the terms of a contract, he is not entitled to the protection of Art. 311(2)."
    },
    {
      "id": "cr2",
      "text": "The order dated Dec 6, 1957 merely terminates service, not preceded by enquiry; Chief Commissioner's letters refer to non-reemployment due to ex-convict status but do not show termination was for misconduct; no evidence of camouflage.",
      "addresses_issue": "i1",
      "key_observation": "It cannot be assumed that an order ex facie one of termination of employment of a temporary employee was intended to be one of dismissal. The onus to prove that such was the intention must lie upon the employee."
    },
    {
      "id": "cr3",
      "text": "Principles under s.33 Industrial Disputes Act for industrial tribunals (investigating mala fides, victimization) have no relevance to determining if public servant's termination violates Art. 311; Court's enquiry limited to constitutional compliance.",
      "addresses_issue": "i1",
      "key_observation": "There is no similarity between the enquiry made under s.33 of the Industrial Disputes Act and an enquiry made by the Court where the order of dismissal of a public servant is impugned."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Termination of service brought about by the exercise of a contractual right is not per se dismissal or removal; applies tests: (1) right to post? (2) visited with evil consequences? Neither satisfied here.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "State may terminate temporary employment for misconduct etc., attracting Art. 311, but form not conclusive; here, order is simpliciter termination.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Parshotam Lal Dhingra v. The Union of India",
      "citation": "1958 S.C.R. 828",
      "treatment": "followed",
      "relevance": "Termination pursuant to contract not dismissal; tests for punishment: right to post or evil consequences."
    },
    {
      "case_name": "Satish Chander Anand v. The Union of India",
      "citation": "1953 S.C.R. 655",
      "treatment": "followed",
      "relevance": "Termination of service by exercise of contractual right is not per se dismissal or removal."
    },
    {
      "case_name": "The Chartered Bank, Bombay v. The Chartered Bank Employees Union",
      "citation": "1960 3 S.C.R. 441",
      "treatment": "distinguished",
      "relevance": "Tribunal under s.33 ID Act goes behind form to substance for industrial peace; not applicable to Art. 311."
    },
    {
      "case_name": "The Management of Chandramalai Estate, Ernakulam v. Its Workmen",
      "citation": "1960 3 S.C.R. 451",
      "treatment": "distinguished",
      "relevance": "Similar to Chartered Bank; ID Act principles not relevant to public servant terminations under Art. 311."
    },
    {
      "case_name": "The Punjab National Bank Ltd. v. Its Workmen",
      "citation": "1960 1 S.C.R. 806",
      "treatment": "followed",
      "relevance": "Substantial difference between s.33 ID Act consequences and Art. 311; limited prima facie enquiry under s.33."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 132",
        "Article 226",
        "Article 311",
        "Article 309"
      ],
      "relevance": "Certificate under Art.132; writ under Art.226; protection against dismissal/removal without opportunity under Art.311(2); rules under Art.309."
    },
    {
      "name": "Central Civil Services (Temporary Service) Rules, 1949",
      "sections": [
        "Rule 5"
      ],
      "relevance": "Permits termination of temporary service with notice; exercised here."
    },
    {
      "name": "Fundamental Rules",
      "sections": [
        "Rule 52"
      ],
      "relevance": "Termination did not carry penal consequences of loss of pay or allowances."
    },
    {
      "name": "Industrial Disputes Act",
      "sections": [
        "Section 33",
        "Section 31"
      ],
      "relevance": "Tribunal enquiry under s.33 differs from Art.311; non-compliance avoids penalty under s.31."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed and the writ petition filed by the respondent is dismissed. The Supreme Court holds that the termination order was a simpliciter termination of temporary employment under r.5 of CCS(TS)R 1949, not violative of Art.311(2).",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is well settled that when employment of a temporary public servant, is terminated pursuant to the terms of a contract, he is not entitled to the protection of Art. 311(2).",
      "speaker": "court",
      "significance": "Core holding on temporary employees' lack of Art.311 protection for contractual termination."
    },
    {
      "text": "The form in which the order is couched is not always decisive... the court has to apply the two tests mentioned above, namely, (1) whether the servant had a right to the post or the rank or (2) whether he has been visited with evil consequences...",
      "speaker": "court",
      "significance": "Tests to determine if termination is punitive dismissal attracting Art.311."
    },
    {
      "text": "It cannot be assumed that an order ex facie one of termination of employment of a temporary employee was intended to be one of dismissal. The onus to prove that such was the intention of the authority terminating the employment must lie upon the employee concerned.",
      "speaker": "court",
      "significance": "Burden of proof on employee to show punitive intent."
    }
  ],
  "_case_id": "1962_216",
  "_label": 1,
  "_text_length": 15061,
  "_extracted_at": "2026-02-10T19:59:20.621170"
}