{
  "metadata": {
    "case_name": "51st Dai-ul-Mutlaq v. State of Bombay",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Sinha C.J.",
      "Sarkar J.",
      "Das Gupta J.",
      "Mudholkar J.",
      "Ayyangar J."
    ],
    "case_number": "Petition No. 128 of 1958",
    "date_of_judgment": "1962-01-09"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dawoodi Bohra Community consists of Muslims of the Shia sect, believing in one God, Mohammed as Prophet, Ali as Wasi succeeding by Nas-e-Jali, succeeded by line of Imams.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Shia sect divided into Ismailis and Isna Asharia; Dawoodi Bohras belong to Ismailis; 21st Imam Type went into seclusion; 20th Imam directed Hujjat to appoint Dai-ul-Mutlaq, Mazoon, Mukasir to carry on Dawat.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Petitioner is 51st Dai-ul-Mutlaq, head of Dawoodi Bohra Community, vicegerent of Imam on Earth, with civil powers as trustee and ecclesiastical powers as religious leader, including power of excommunication exercised according to usage and tenets.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Excommunication effected only at Jamat meeting after warning, opportunity to mend, public statement of grounds; results in exclusion from religious rights in places under trusteeship of Dai.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Bombay Prevention of Excommunication Act, 1949 (Bombay Act XLII of 1949) came into force on November 1, 1949; prohibits excommunication, declares it invalid, penalizes acts in furtherance.",
      "type": "material",
      "date": "1949-11-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Tayebhai Moosaji Koicha instituted suit No. 1262 of 1949 in Bombay High Court for declaration that excommunications by petitioner (1934 and 1948) void; Shah J. held Act constitutional on Feb 21, 1952.",
      "type": "procedural",
      "date": "1952-02-21",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appeal upheld by Chagla CJ and Bhagwati J. on Aug 26, 1952; Supreme Court appeal (Civil Appeal No. 99 of 1954) dismissed on Nov 27, 1957 as abated due to plaintiff's death.",
      "type": "procedural",
      "date": "1957-11-27",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Petition under Art. 32 filed on Aug 18, 1958 challenging Act as violating Arts 25,26; letter dated July 18, 1958 to State requesting desist from enforcement.",
      "type": "procedural",
      "date": "1958-08-18",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "State affidavit by V.N. Kalghatgi denies cause of action, right to excommunicate as essential religious practice, asserts Act valid for social reform.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Kurbanhussein Sanchawala applied to intervene in April 1961, claiming controversy over validity of Dai from 47th onwards, fears excommunication absent Act.",
      "type": "procedural",
      "date": "1961-04",
      "source": "intervener"
    },
    {
      "id": "f11",
      "text": "Privy Council in Hasan Ali v. Mansoor Ali (1947) upheld petitioner's position as 51st Dai, power to excommunicate subject to conditions (not absolute), effect exclusion from religious rights in community properties.",
      "type": "admitted",
      "date": "1947-12-01",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Act defines community to include Dawoodi Bohras; excommunication as expulsion depriving legally enforceable rights including worship, burial, property.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Bombay Prevention of Excommunication Act, 1949 violates Articles 25 and 26 of the Constitution by interfering with the right of excommunication claimed as integral to religion of Dawoodi Bohra community.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Act is protected under Article 25(2)(b) as law providing for social welfare and reform.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether excommunication is a matter of religion under Article 26(b) or a secular activity regulable by State.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Dawoodi Bohra community is religious denomination under Art. 26; right to excommunicate is integral part of religion, essential for maintaining discipline, unity, purity; Act violates Arts 25,26.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4",
        "f11"
      ],
      "legal_basis": "Articles 25, 26; Shirur Mutt case"
    },
    {
      "id": "pa2",
      "text": "Excommunication power exercised according to tenets, not arbitrary; denial compels community to accept dissidents with full rights to properties dedicated to religious use.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Art. 26(b)"
    },
    {
      "id": "pa3",
      "text": "Religious denomination determines essential parts of religion; courts cannot interfere.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Shirur Mutt"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Excommunication not matter of religion but deprives civil rights; not essential religious practice; Act is social reform in public interest, within Art. 25(2)(b).",
      "supporting_facts": [
        "f5",
        "f9"
      ],
      "legal_basis": "Articles 25(2)(a),(b), 26; Shirur Mutt"
    },
    {
      "id": "ra2",
      "text": "Right to manage affairs under Art. 26(b) subject to public order, morality, health, and Art. 25(2)(b); excommunication secular activity associated with religion.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Art. 25(2)(b)"
    },
    {
      "id": "ra3",
      "text": "No evidence excommunication essential to religion; rights to worship/burial civil nature, justiciable.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Hasan Ali v. Mansoor Ali (PC)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sinha CJ (dissent): Excommunication not purely religious but involves civil rights; justiciable; Act social reform protecting individual liberty, within Art. 25(2)(b); upholds Act.",
      "addresses_issue": "i1",
      "key_observation": "Effect of excommunication excludes from civil rights like burial, property; legislature competent to ban as social welfare."
    },
    {
      "id": "cr2",
      "text": "Das Gupta J (majority): Excommunication on religious grounds (heresy, apostasy) part of managing affairs in matters of religion under Art. 26(b); Act invalidates even such, violates Art. 26(b).",
      "addresses_issue": "i1",
      "key_observation": "Not saved by Art. 25(2)(b) as barring on religious grounds not social reform; civil rights impact irrelevant absent constitutional limit."
    },
    {
      "id": "cr3",
      "text": "Art. 26(b) subject to public order etc. and Art. 25(2), but Act not regulating secular activity nor social reform for religious-ground excommunications.",
      "addresses_issue": "i2",
      "key_observation": "Excommunication preserves religious solidarity, integral where based on religious lapses."
    },
    {
      "id": "cr4",
      "text": "Ayyangar J concurs: Dai's power admitted per PC; excommunication excludes from religious properties; Act interferes with denomination's management in religion.",
      "addresses_issue": "i1",
      "key_observation": "Admitted tenets place Dai as vice-regent with disciplinary powers."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Bombay Prevention of Excommunication Act, 1949 void as violates Art. 26(b); not saved by Art. 25(2)(b).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Excommunication on religious grounds is matter of religion; management thereof protected under Art. 26(b).",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner, Hindu Religious Endowments, Madras v. Sri Lakshmindra Thirtha Swamiar of Sri Shirur Mutt",
      "citation": null,
      "treatment": "followed",
      "relevance": "Defines matters of religion, essential practices determined by denomination; protects acts in pursuance of religion."
    },
    {
      "case_name": "Hasan Ali v. Mansoor Ali",
      "citation": null,
      "treatment": "followed",
      "relevance": "Upholds Dai's power to excommunicate subject to conditions; effect exclusion from religious rights in community properties."
    },
    {
      "case_name": "Sri Venkataramana Devaru v. State of Mysore",
      "citation": null,
      "treatment": "followed",
      "relevance": "Art. 26(b) subject to Art. 25(2)(b); denominational temples within public character."
    },
    {
      "case_name": "Durgah Committee, Ajmer v. Syed Hussain Ali",
      "citation": null,
      "treatment": "followed",
      "relevance": "Practices must be essential/integral part of religion for Art. 26 protection."
    },
    {
      "case_name": "Advocate General v. Muhammad Husen Huseni",
      "citation": null,
      "treatment": "referred",
      "relevance": "Historical context of Khoja community."
    },
    {
      "case_name": "Advocate General of Bombay v. Yusufalli Ebrahim",
      "citation": null,
      "treatment": "referred",
      "relevance": "Position of Dai-ul-Mutlaq in Dawoodi Bohras."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 25",
        "Article 26",
        "Article 32",
        "Article 13",
        "Article 17"
      ],
      "relevance": "Guarantees freedom of religion, management of religious affairs; Act held violative of 26(b), not saved by 25(2)(b); petition under 32."
    },
    {
      "name": "Bombay Prevention of Excommunication Act, 1949 (Bombay Act XLII of 1949)",
      "sections": [
        "Section 2",
        "Section 3",
        "Section 4"
      ],
      "relevance": "Declares excommunication invalid, penalizes; held unconstitutional."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "List III Entries 1,2"
      ],
      "relevance": "Legislative competence for social reform."
    },
    {
      "name": "Caste Disabilities Removal Act, 1850",
      "sections": null,
      "relevance": "Historical precursor prohibiting deprivation of property on religious exclusion."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Petition allowed; Bombay Prevention of Excommunication Act, 1949 declared void as violating Article 26(b) of Constitution; writ of mandamus issued restraining State from enforcing Act; petitioner awarded costs.",
    "relief_granted": "Declaration Act void; writ restraining enforcement against petitioner and community.",
    "costs": "Petitioner gets costs from respondent."
  },
  "key_quotes": [
    {
      "text": "\"Excommunication necessarily involve exclusion from the exercise of religious rights in places under the trusteeship of the head of the community.\"",
      "speaker": "court",
      "significance": "Defines effect of valid excommunication per Privy Council, central to case."
    },
    {
      "text": "\"The exercise of this power of excommunication on religious grounds forms part of the management by the community, through its religious head, of its own affairs in matters of religion.\"",
      "speaker": "court",
      "significance": "Majority holding on Art. 26(b) violation."
    },
    {
      "text": "\"Barring of excommunication on religious grounds pure and simple, cannot however be considered to promote social welfare and reform.\"",
      "speaker": "court",
      "significance": "Rejects Art. 25(2)(b) saving."
    },
    {
      "text": "\"A religion may not only lay down a code of ethical rules... but it protects also acts done in pursuance of a religion.\"",
      "speaker": "court",
      "significance": "From Shirur Mutt, basis for protecting religious practices."
    }
  ],
  "_case_id": "1962_177",
  "_label": 1,
  "_text_length": 103054,
  "_extracted_at": "2026-02-10T19:59:30.496611"
}