{
  "metadata": {
    "case_name": "Afco Private Ltd. v. Commissioner of Income Tax",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Afco Private Ltd., a private limited company, earned total income of Rs. 49,843 for year ending March 31, 1955, as computed by Income-tax Appellate Tribunal.",
      "type": "material",
      "date": "1955-03-31",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Company declared dividend of Rs. 11,712 on July 13, 1955, and additional dividend of Rs. 5,612 before close of assessment year 1955-56, distributing in aggregate more than 60% of total income reduced by income-tax and super-tax.",
      "type": "material",
      "date": "1955-07-13",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Company claimed rebate at one anna in the rupee on amount computed per Schedule I, Part I, item B read with section 2 of Finance Act 15 of 1955.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Income-tax Officer and Appellate Assistant Commissioner rejected claim, viewing company as one to which section 23A of Income-tax Act could be made applicable.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Income-tax Appellate Tribunal, Bombay, reversed order of income-tax authorities.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Tribunal opined that expression 'cannot be made applicable' in item B of Part I of Schedule I of Finance Act 15 of 1955 must be read in conjunction with section 23A, and rebate cannot be denied if conditions in section 23A(1) fulfilled.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Question referred by Tribunal to High Court of Judicature at Bombay: Whether assessee company, having distributed dividends over 60% of total income less taxes, entitled to rebate of 1 anna per rupee on undistributed balance per clause (i) of proviso to item B of Part I of First Schedule to Finance Act 1955.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court answered question in affirmative.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a private company which has distributed dividends exceeding 60% of total income less taxes is entitled to rebate under proviso to item B, Part I, Schedule I of Finance Act 1955, despite being a company to which section 23A of Income-tax Act could potentially be made applicable.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Interpretation of phrase 'company to which the provisions of section 23A of the Income-tax Act cannot be made applicable' in the Finance Act 1955.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Expression 'cannot be made applicable' refers to state of affairs where, having regard to circumstances, no order under section 23A can be made, such as when dividends exceed 60% or due to losses/smallness of profits.",
      "supporting_facts": [
        "f2",
        "f5",
        "f6",
        "f8"
      ],
      "legal_basis": "Section 23A(1) Income-tax Act; Finance Act 1955 Schedule I Part I item B"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Expression describes class of companies against which section 23A order can never be made in any circumstances; private companies are eligible for section 23A orders if dividend conditions not met, hence rebate not admissible.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 23A(1) and (9) Income-tax Act; Explanation 1(b) thereto; Finance Act 1955"
    },
    {
      "id": "ra2",
      "text": "Legislative history of Finance Acts 1956 and 1957 restricts rebate to public companies.",
      "supporting_facts": [],
      "legal_basis": "Finance Acts 1956 and 1957, Part II Schedule I item D"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Phrase 'cannot be made applicable' means applicability of section 23A depends on ITO order, not statutory exclusion; rebate available if no order justified due to adequate dividends or other conditions like losses/small profits.",
      "addresses_issue": "i2",
      "key_observation": "Legislature used 'cannot be made applicable' indicating factual non-applicability via ITO satisfaction, not class exclusion."
    },
    {
      "id": "cr2",
      "text": "Section 23A(9) excludes public/substantial interest companies; private companies per Companies Act 1913 not substantially interested, but order requires ITO satisfaction on dividend inadequacy.",
      "addresses_issue": "i1",
      "key_observation": "Rebate inducement for companies clearing dividends to avoid section 23A rigour."
    },
    {
      "id": "cr3",
      "text": "Prior Finance Acts conditioned rebate on no section 23A order made, causing delays; 1955 Act simplified by focusing on potential non-applicability to avoid pre-assessment decisions.",
      "addresses_issue": "i2",
      "key_observation": "Not intended to deprive private companies as class of rebate."
    },
    {
      "id": "cr4",
      "text": "Finance Acts 1956/1957 phraseology for super-tax rebates differs, explicitly limiting to public companies; 1955 Act for income-tax rebates uses different wording, supporting broader interpretation.",
      "addresses_issue": "i2",
      "key_observation": "Legislative history opposes department's view."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Assessee private company entitled to rebate claimed, as dividends exceeded 60%, rendering section 23A inapplicable in circumstances.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court correctly interpreted 'cannot be made applicable' as factual non-justifiability of section 23A order.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "Section 23A(1)",
        "Section 23A(9)",
        "Section 18(3D)"
      ],
      "relevance": "Governs super-tax on undistributed profits of certain companies; rebate under Finance Act conditioned on non-applicability."
    },
    {
      "name": "Finance Act 15 of 1955",
      "sections": [
        "Schedule I Part I item B proviso clause (i)",
        "Section 2"
      ],
      "relevance": "Prescribes rebate of one anna per rupee for companies distributing adequate dividends where section 23A cannot be made applicable."
    },
    {
      "name": "Indian Companies Act, 1913 (VII of 1913)",
      "sections": [
        "Definition of private company"
      ],
      "relevance": "Private companies not deemed substantially interested in public for section 23A purposes."
    },
    {
      "name": "Finance Act 1956",
      "sections": [
        "Part II Schedule I item D"
      ],
      "relevance": "Rebate for super-tax limited to public companies not exceeding income threshold."
    },
    {
      "name": "Finance Act 1957",
      "sections": [
        "Part II Schedule I"
      ],
      "relevance": "Rebate for companies under section 23A(9) not exceeding income threshold."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court upheld High Court and Tribunal, holding assessee Afco Private Ltd. entitled to rebate of one anna per rupee on undistributed balance as per Finance Act 1955, since dividends exceeded 60% threshold making section 23A inapplicable.",
    "relief_granted": "Rebate allowed as claimed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'cannot be made applicable' ... clearly means that the applicability of section 23A depends upon an order to be made by the Income-tax Officer, and not upon any exclusion by the provisions of the Act.",
      "speaker": "court",
      "significance": "Core interpretation allowing rebate based on factual non-applicability."
    },
    {
      "text": "The legislature has not enacted that the benefit of rebate is admissible only to companies against which the order under sub-section (1) of section 23A can never be made.",
      "speaker": "court",
      "significance": "Rejects class-based exclusion of private companies."
    }
  ],
  "_case_id": "1962_159",
  "_label": 0,
  "_text_length": 15020,
  "_extracted_at": "2026-02-10T19:58:32.919902"
}