{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Bombay City I v. Bai Shirinbai K. Kooka",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das",
      "Kapur",
      "Gajendragadkar",
      "Subba Rao",
      "Wanchoo",
      "Ayyangar",
      "Sarkar"
    ],
    "case_number": "Civil Appeal No. 133 of 1958",
    "date_of_judgment": "1962-02-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a Parsi lady who held by way of investment a large number of shares of different companies. These shares were purchased before the end of 1939-40 and after at a cost-price which was much less than their market value on April 1, 1945.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Her dividend income was assessed to income-tax for several years prior to April 1, 1945.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In the assessment year 1946-47, the relevant accounting year being financial year 1945-46, the Income-tax Officer found that the assessee had converted her shares into her stock-in-trade and carried on a trading activity, viz. a business in shares.",
      "type": "material",
      "date": "1945-04-01",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Her income for the assessment year 1946-47 was computed on the basis of the profits which she made by the sale of her shares as a trading activity, the profits being calculated on the difference between the ruling market price at the beginning of the account year and the sale proceeds.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "For the assessment year 1947-48, the relevant accounting year being the financial year 1946-47, the sale proceeds of the shares which the assessee had sold amounted to Rs. 5,49,487.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Income-tax Officer calculated the profits as: Sale proceeds Rs. 5,49,487 minus Cost calculated on the basis of the market price of the shares at the beginning of the account year Rs. 4,50,822 = Rs. 98,655 less Forward business loss Rs. 25,344 = Net profit Rs. 73,321.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The assessee appealed to the Appellate Assistant Commissioner who enhanced the income of the assessee by a sum of Rs. 2,91,307 including a capital gain of Rs. 37,590. The AAC proceeded on the footing that the profit was the difference between the original cost price of the shares and the sale proceeds. He held that some shares sold were stock-in-trade, others investment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "On appeal to the Income-tax Appellate Tribunal, the principal point was how the profits on sale of shares should be calculated. Judicial Member accepted AAC view (original cost). Accountant Member agreed with ITO (market value on conversion). President agreed with Accountant Member.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Tribunal referred to Bombay High Court the question: Whether the assessee's profit on the sale of shares is the difference between the sale price and the cost price, or the difference between the sale price and the market price prevailing on 1-4-1945? Tribunal held date of conversion to stock-in-trade was question of fact.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Bombay High Court (Chagla CJ and Tendolkar J) by judgment dated March 6, 1956 answered in favour of assessee: assessable profit is difference between sale price and market price on April 1, 1945.",
      "type": "procedural",
      "date": "1956-03-06",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant moved HC for certificate under s.66A(2) Income-tax Act, unsuccessful, then applied for special leave to SC granted September 17, 1956.",
      "type": "procedural",
      "date": "1956-09-17",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Heard by Bench of three, directed to seven Judges bench as whether Sir Kikabhai Premchand v. CIT required reconsideration.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the assessee's profit on the sale of shares (converted from investment to stock-in-trade) is the difference between the sale price and the original cost price, or the difference between the sale price and the market price prevailing on 1-4-1945 (date of conversion to stock-in-trade)?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether the decision in Sir Kikabhai Premchand v. Commissioner of Income-tax requires reconsideration or applies to distinguish the present case?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Distinction drawn by High Court between Kikabhai case and present case is not warranted on principle; ratio of Kikabhai applies here also.",
      "supporting_facts": [
        "f3",
        "f9"
      ],
      "legal_basis": "Sir Kikabhai Premchand v. CIT (1954 SCR 219)"
    },
    {
      "id": "pa2",
      "text": "High Court held by legal fiction that assessee realised potential profits on 1-4-1945 which she had not actually done; no warrant for fictional sale on 1-4-1945 as man cannot sell to himself.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Sir Kikabhai Premchand v. CIT"
    },
    {
      "id": "pa3",
      "text": "Original cost price must be taken to compute profits, not market value on conversion.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Profits should be computed on commercial principles: difference between sale price and market value on 1-4-1945 when shares converted into stock-in-trade; original cost is historical and irrelevant to business.",
      "supporting_facts": [
        "f1",
        "f3",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Kikabhai case distinguishable: there was no actual sale or profit, only potential/fictional; here actual trading sale with real profits.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Sir Kikabhai Premchand v. CIT (distinguished)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Vital difference between Kikabhai (withdrawal of stock-in-trade, no sale, no actual profit, cannot tax potential) and present case (actual sale in trading activity resulting in real profits; question is how to compute those actual profits).",
      "addresses_issue": "i1",
      "key_observation": "Ratio of Kikabhai need not extend; distinction correct."
    },
    {
      "id": "cr2",
      "text": "On commercial principles, cost to business is market value on 1-4-1945 when converted to stock-in-trade; no fictional sale, but real measure of trading profit: market value at entry to business minus actual sale proceeds.",
      "addresses_issue": "i1",
      "key_observation": "Accords with reality, not fiction."
    },
    {
      "id": "cr3",
      "text": "Reference to Sharkey v. Wernher (persuasive): market value proper for withdrawal/transfer of stock; fairer measure of assessable profit.",
      "addresses_issue": "i2",
      "key_observation": "Distinction from Kikabhai facts; no need to overrule Kikabhai."
    },
    {
      "id": "cr4",
      "text": "Sarkar J (dissent): Kikabhai applies directly; cannot use market value on conversion as that assumes fictional purchase from self; original cost price correct; Sharkey not compelling to overrule Kikabhai.",
      "addresses_issue": "i1",
      "key_observation": "Cannot separate owner from business for fictional trading."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Assessee's assessable profit on sale of shares is difference between sale price and market price prevailing on April 1, 1945.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Distinction from Kikabhai case valid; no need to reconsider Kikabhai ratio as facts differ (no actual sale there).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sir Kikabhai Premchand v. Commissioner of Income-tax, Central, Bombay I",
      "citation": "1954 S.C.R. 219",
      "treatment": "distinguished",
      "relevance": "Withdrawal of stock-in-trade at cost price, no tax on potential profits from fictional sale; distinguished as no actual sale here."
    },
    {
      "case_name": "Sharkey v. Wernher",
      "citation": "1955 36 T.C. 275",
      "treatment": "referred",
      "relevance": "Market value for transfer/withdrawal of stock-in-trade from taxable business gives fairer measure of trading profit; persuasive authority."
    },
    {
      "case_name": "Watson Bros. v. Hornby",
      "citation": "1942 24 T.C. 506",
      "treatment": "referred",
      "relevance": "Market value for notional sale between departments of same business."
    },
    {
      "case_name": "Briton Ferry Steel Co. Ltd. v. Barry",
      "citation": "23 T.C. 414",
      "treatment": "referred",
      "relevance": "Principle inconsistent with using market value in some transfers."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 66(1)",
        "s. 66A(2)"
      ],
      "relevance": "Reference to High Court and certificate for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by the Commissioner of Income-tax is dismissed with costs, upholding the Bombay High Court's answer that the assessee's assessable profit on the sale of shares is the difference between the sale price and the market price prevailing on April 1, 1945.",
    "relief_granted": "None to appellant; confirmation of High Court in favour of assessee.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "To arrive at real profits one must consider the accounts of the business on commercial principles and construe profits in their normal and natural sense, a sense which no commercial man will misunderstand.",
      "speaker": "court",
      "significance": "Basis for using market value as cost to business on commercial principles."
    },
    {
      "text": "The only fair measure of assessing trading profits in such circumstances is to take the market value at one end and the actual sale proceeds at the other, the difference between the two being the profit or loss as the case may be.",
      "speaker": "court",
      "significance": "Core holding on computation of actual trading profits."
    },
    {
      "text": "It is unreal and artificial to separate the business from its owner and treat them as if they were separate entities trading with each other and then by means of a fictional sale introduce a fictional profit which in truth and in fact is non-existent.",
      "speaker": "court",
      "significance": "Ratio from Kikabhai case, applied to argue against fiction."
    }
  ],
  "_case_id": "1962_183",
  "_label": 0,
  "_text_length": 48940,
  "_extracted_at": "2026-02-10T19:59:31.533407"
}