{
  "metadata": {
    "case_name": "Appellants (firms exporting tobacco) v. State of Andhra Pradesh",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Venkatarama Aiyar, J."
    ],
    "case_number": "Civil Appeals Nos. 290-291 of 1961",
    "date_of_judgment": "1962-04-06"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are firms doing business in the export of tobacco. Usual course: enter into contracts with customers abroad for sale of tobacco, purchase requisite quantities locally, export to foreign purchasers.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Prior to October 1, 1953, area formed part of State of Madras. On that date, State of Andhra constituted, area fell within Andhra.",
      "type": "background",
      "date": "1953-10-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Madras General Sales Tax Act, IX of 1939 in force. Section 5 provides exemptions. Section 6 confers power on State Government to exempt tax on specified goods or persons.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Government of Madras issued Notification No. 144 on March 31, 1953, exempting sales of unmanufactured tobacco from sales tax.",
      "type": "procedural",
      "date": "1953-03-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Andhra Legislature enacted Act XIV of 1955 (Amendment Act) amending Section 5 of Madras Act by adding item viii: 'raw tobacco except country variety thereof whether cured or uncured, shall be liable to tax under Section 3, Sub-section (1) only at the point of the first purchase effected in the State of Andhra by a dealer who is not exempt from taxation under Section 3, Sub-section (3) but at the rate of seven and half pies for every rupee on his turnover.' Explanation: country variety means variety other than Virginia and other similar varieties.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Result: exemption limited to country (Nattu) tobacco; Virginia tobacco sales liable to tax.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Andhra Government issued Notification No. 711 on November 4, 1955, cancelling earlier Notification No. 144 dated March 31, 1953.",
      "type": "procedural",
      "date": "1955-11-04",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Additional Commercial Tax Officer, Guntur, issued notices to appellants to produce account books for assessing sales tax on tobacco business.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellants filed writ petitions Nos. 1172 of 1956 and 56 of 1957 under Art. 226 in Andhra Pradesh High Court challenging constitutionality of Amendment Act: discriminatory under Art. 14 (taxing Virginia tobacco, exempting others); contravention of Art. 286(1)(b) as tax on sales in course of export. Prayed for mandamus directing forbearance from assessment.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "High Court dismissed petitions on September 25, 1957, holding Act does not infringe constitutional provisions; granted certificates under Art. 133.",
      "type": "procedural",
      "date": "1957-09-25",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Two types of tobacco: Virginia and Nattu (country), differing in taste, flavour, texture, nomenclature, process of growing/curing/grading, market facilities, price, uses, class of customers.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Purchases by appellants assumed for executing specific orders from foreign customers.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Is the impugned Act repugnant to Art. 14 for the reason that it singles out Virginia tobacco for taxation?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Is the impugned legislation in contravention of Art. 286(1)(b) as imposing a tax on sales in the course of export?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Taxation laws must satisfy Art. 14. Imposing tax on sales of Virginia tobacco and not on other kinds is discriminatory on face, obnoxious to Art. 14.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Art. 14; Moopil Nair v. State of Kerala"
    },
    {
      "id": "pa2",
      "text": "Differences between Virginia and country tobacco not sufficient; must have reasonable relation to object of legislation (levy of sales tax). Differences not germane to sales tax.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Budhan Choudhry v. State of Bihar; Shri Ram Krishna Dalmia v. Shri Justice S.R. Tendolkar"
    },
    {
      "id": "pa3",
      "text": "Amendment Act imposes tax on sales in course of export, hit by Art. 286(1)(b). Agreement with foreign buyer, local purchase, export form integrated transaction.",
      "supporting_facts": [
        "f1",
        "f12"
      ],
      "legal_basis": "Art. 286(1)(b); State of Travancore-Cochin v. Bombay Co. Ltd."
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Taxation laws must pass Art. 14 test, but State has wide discretion in selecting objects to tax. Valid if classification reasonable. No requirement to tax everything.",
      "addresses_issue": "i1",
      "key_observation": "A State does not have to tax everything in order to tax something. It is allowed to pick and choose... if it does so reasonably."
    },
    {
      "id": "cr2",
      "text": "Real distinction between Virginia and Nattu tobacco: differing in taste, flavour, texture, nomenclature, growing/curing/grading, markets, price, uses, customers. Virginia class by itself.",
      "addresses_issue": "i1",
      "key_observation": "Virginia tobacco has features which distinguish it from country tobacco, and can be treated as a class in itself."
    },
    {
      "id": "cr3",
      "text": "Burden on challenger to show no valid classification, heavier for taxing statutes. Legislature greatest freedom in classification for taxation.",
      "addresses_issue": "i1",
      "key_observation": "The burden is on the one attacking the legislative arrangement to negative every conceivable basis which might support it."
    },
    {
      "id": "cr4",
      "text": "If State can pick one commodity for tax, can pick one category. Analogous to taxing anthracite but not bituminous coal.",
      "addresses_issue": "i1",
      "key_observation": "The differences between them are a just basis for their different classification and the differences are great and important."
    },
    {
      "id": "cr5",
      "text": "Amendment Act taxes purchases preceding export, not sale occasioning export. Purchases preparatory to export, not in course of export.",
      "addresses_issue": "i2",
      "key_observation": "A purchase for the purpose of export... is only an act preparatory to export and cannot... be regarded as an act done in the course of the export."
    },
    {
      "id": "cr6",
      "text": "Only sale under which export is made protected by Art. 286(1)(b), not precedent sales though for export.",
      "addresses_issue": "i2",
      "key_observation": "Art. 286(1)(b) could be invoked only in respect of the sale which occasions the export, and not of any sales precedent to it."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Impugned Act not repugnant to Art. 14; valid classification treating Virginia tobacco as separate class.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Impugned legislation does not contravene Art. 286(1)(b); tax on purchases preceding export sale.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Moopil Nair v. State of Kerala",
      "citation": "1961 2 S.C.R. 77",
      "treatment": "followed",
      "relevance": "Taxation laws must pass Art. 14 test."
    },
    {
      "case_name": "Budhan Choudhry v. State of Bihar",
      "citation": "1955 1 S.C.R. 1045",
      "treatment": "referred",
      "relevance": "Classification must have reasonable relation to object."
    },
    {
      "case_name": "Shri Ram Krishna Dalmia v. Shri Justice S.R. Tendolkar",
      "citation": "1959 S.C.R. 279",
      "treatment": "referred",
      "relevance": "Classification must have reasonable relation to object."
    },
    {
      "case_name": "Madden v. Kentucky",
      "citation": "1940 309 US 83",
      "treatment": "referred",
      "relevance": "Legislatures possess greatest freedom in classification for taxation."
    },
    {
      "case_name": "C. Heisler v. Thomas Colliery Company",
      "citation": "260 US 245",
      "treatment": "followed",
      "relevance": "Tax on anthracite coal but not bituminous valid; differences justify classification."
    },
    {
      "case_name": "State of Travancore-Cochin v. Bombay Co. Ltd.",
      "citation": "1952 S.C.R. 1112",
      "treatment": "distinguished",
      "relevance": "Sale occasioning export in course of export; integrated activities explained."
    },
    {
      "case_name": "State of Travancore-Cochin v. Shanmuga Vilas Cashew Nut Factory",
      "citation": "1954 S.C.R. 53",
      "treatment": "followed",
      "relevance": "Purchases preceding export not in course of export."
    },
    {
      "case_name": "State of Madras v. Guruviah Naidu Co. Ltd.",
      "citation": "A.I.R. 1956 S.C. 158",
      "treatment": "followed",
      "relevance": "Local purchases for export orders not hit by Art. 286(1)(b)."
    },
    {
      "case_name": "State of Mysore v. Mysore Spinning & Manufacturing Co.",
      "citation": "A.I.R. 1958 S.C. 1002",
      "treatment": "followed",
      "relevance": "Only sale occasioning export protected, not precedent sales."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 14",
        "Art. 226",
        "Art. 133",
        "Art. 286(1)(b)"
      ],
      "relevance": "Art. 14: equality, classification for tax; Art. 226: writs; Art. 286(1)(b): no tax on sales in course of export."
    },
    {
      "name": "Madras General Sales Tax Act, 1939",
      "sections": [
        "Section 3",
        "Section 5",
        "Section 6"
      ],
      "relevance": "Amended by Andhra Act XIV of 1955 to tax Virginia tobacco at first purchase."
    },
    {
      "name": "Andhra Act XIV of 1955",
      "sections": [
        "Amends Section 5, adds item viii"
      ],
      "relevance": "Imposes tax on raw tobacco except country variety (Virginia taxable)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals, upholding the validity of Andhra Act XIV of 1955. Held not violative of Art. 14 due to valid classification between Virginia and country tobacco, and not contravening Art. 286(1)(b) as tax on pre-export purchases.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A State does not have to tax everything in order to tax something. It is allowed to pick and choose districts, objects, persons, methods and even rates for taxation if it does so reasonably.\"",
      "speaker": "court",
      "significance": "Explains wide latitude in tax classification under Art. 14."
    },
    {
      "text": "\"Virginia tobacco has features which distinguish it from country tobacco, and can be treated as a class in itself.\"",
      "speaker": "court",
      "significance": "Justifies classification upholding Act against Art. 14 challenge."
    },
    {
      "text": "\"Art. 286(1)(b) could be invoked only in respect of the sale which occasions the export, and not of any sales precedent to it.\"",
      "speaker": "court",
      "significance": "Clarifies scope of protection under Art. 286(1)(b)."
    }
  ],
  "_case_id": "1962_28",
  "_label": 0,
  "_text_length": 17573,
  "_extracted_at": "2026-02-10T19:56:38.396193"
}