{
  "metadata": {
    "case_name": "Orient Weaving Mills Private Ltd. & Anr. v. Union of India & Ors.",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "SINHA, C. J."
    ],
    "case_number": "Petition No. 110 of 1961",
    "date_of_judgment": "1962-02-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The first petitioner is the Orient Weaving Mills Private Ltd. (the Company), incorporated under the Indian Companies Act, 1913 with head office at Nayabazar, Cuttack. It runs a weaving mill at Nayabazar with 160 looms, nearly 300 employees, producing about 45 lakh yards of cloth annually. Paid-up capital Rs. 7,10,600 divided into 7,100 shares of Rs. 100 each. 8 directors including a representative of Government of Orissa.",
      "type": "background",
      "date": "1955-10-01",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Company commenced production on October 1, 1955, sustaining losses due to adverse circumstances in Orissa and heavy taxation. Paid excise duty: Rs. 2,16,670 (1958-59), Rs. 1,82,529 (1959-60), Rs. 2,15,500 (1960-61).",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Respondent No. 5 is Board of Directors, Madhunagar Powerloom Weavers Cooperative Society Ltd. (the Society), installed 100 looms in same premises, 100 workmen employed. Authorised capital Rs. 2,40,000 in shares of Rs. 100 each. Profit earning concern per petitioners.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Society granted exemption from excise duty vide Notification No. 74/59 dated July 31, 1959 and No. 70/60 dated April 10, 1960 (GSR), under r.8 Central Excise Rules, 1944.",
      "type": "material",
      "date": "1959-07-31",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Notifications exempt cotton fabrics produced by cooperative society of owners of cotton powerlooms registered by March 31, 1961, subject to conditions: each member exempt from duty for 3 prior years, total looms <=4 times members, certificate from State Govt. that member owns/operated <=4 looms, exemption period specified.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Company's cost of production higher by 12.5% in 1958 and 10% in 1959 compared to Society due to excise duty, disadvantage in competitive market. Abandoned fine cloth production due to heavier tax.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Petitioners moved High Court of Orissa under Art. 226 challenging constitutionality, relief refused on ground of no jurisdiction over Union Government.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Society not owner of powerlooms; each weaver owns no more than 4 looms. Society run on cooperative basis for benefit of weavers who share profits after paying for services. Society purchases cloth at cost plus margin for weaver, sells without profit except handling charges, savings shared with weavers.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Exemption to promote self-employment, cottage/small scale industries, small producers. Valid classification between big establishments and small powerloom weavers in mofussil who are ignorant, illiterate, poor.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Exemption available to individual weavers with no more than 5 looms; forming cooperative should not count against them.",
      "type": "material",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the power of exemption conferred upon the Union Government under r.8 of Central Excise Rules, 1944 violates Arts. 14 and 19(1)(f)(g) of the Constitution on the ground that it is uncontrolled and unguided.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether, assuming the power is constitutional, the exemption granted by the notifications is in excess of the power granted by r.8.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Rule 8 vests Government with unguided power to wholly or partially exempt goods, discriminatory against petitioners.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Arts. 14, 19(1)(f)(g); excessive delegation"
    },
    {
      "id": "pa2",
      "text": "Society similarly situated to Company in production, distribution, marketing; weavers same as shareholders. Exemption to Society violates fundamental rights.",
      "supporting_facts": [
        "f1",
        "f3",
        "f4"
      ],
      "legal_basis": "Arts. 14, 19(1)(f)(g)"
    },
    {
      "id": "pa3",
      "text": "Notifications exempt persons not goods; tax on goods, exemption should be on varieties of cotton fabrics not persons.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Central Excises and Salt Act, 1944 s.3"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Provisions and notifications do not infringe Constitution. Exemption pursuant to policy to confer self-employment benefits, encourage cottage/small scale industries.",
      "supporting_facts": [
        "f8",
        "f9",
        "f10"
      ],
      "legal_basis": "Art. 43; r.8 Central Excise Rules"
    },
    {
      "id": "ra2",
      "text": "Valid classification: big producers vs small powerloom weavers (each <=4 looms) in cooperative; not a mill like Company.",
      "supporting_facts": [
        "f1",
        "f3",
        "f8"
      ],
      "legal_basis": "Arts. 14, 19(1)(f)(g)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 8 part of statute via s.37(2)(xvii); legislature can choose to tax or not different classes. Flexibility in taxation needed; recognizes principle in Sea Customs Act s.23 applied via s.12.",
      "addresses_issue": "i1",
      "key_observation": "No excessive delegation; State judges incidence of taxation."
    },
    {
      "id": "cr2",
      "text": "Exemption protects petty producers (no more than 4 looms) from competition by big producers; valid classification per Art.43 promoting cottage industries on cooperative basis.",
      "addresses_issue": "i1",
      "key_observation": "Small weavers ignorant, poor vs big establishments."
    },
    {
      "id": "cr3",
      "text": "Tax on production of goods payable by producers; exemption refers to goods produced by specified cooperative societies, within power under r.8; conditions fulfilled.",
      "addresses_issue": "i2",
      "key_observation": "Exempts goods, not persons personally."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rule 8 constitutional; no uncontrolled/unguided power violating Arts. 14, 19(1)(f)(g).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Notifications validly issued under r.8; exemption within power, based on valid classification.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Central Excises and Salt Act, 1944",
      "sections": [
        "s.2(d)",
        "s.3",
        "s.12",
        "s.37(2)(xvii)",
        "s.38",
        "First Schedule Item 19"
      ],
      "relevance": "Levy of excise duty on cotton fabrics; rule-making for exemptions; notifications incorporated as part of Act."
    },
    {
      "name": "Central Excise Rules, 1944",
      "sections": [
        "r.8"
      ],
      "relevance": "Power to exempt excisable goods wholly/partly by notification."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.14",
        "Art.19(1)(f)(g)",
        "Art.32",
        "Art.43",
        "Art.226"
      ],
      "relevance": "Equality, right to trade; enforcement of rights; directive for cottage industries."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [],
      "relevance": "Incorporation of petitioner Company."
    },
    {
      "name": "Sea Customs Act, 1878",
      "sections": [
        "s.23"
      ],
      "relevance": "Principle of flexibility in taxation applied to excise."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The petition challenging constitutionality of r.8 Central Excise Rules, 1944 and notifications exempting cotton fabrics produced by specified cooperative societies held without merit. Rule 8 valid; notifications within power and based on valid classification. Petition dismissed.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the exemption granted by the impugned notifications is meant primarily for the protection of petty producers of cotton fabrics not owning more than four power looms, from unreasonable competition by big producers, like the petitioner Company.\"",
      "speaker": "court",
      "significance": "Explains valid classification justifying exemption."
    },
    {
      "text": "\"It is always open to the State to tax certain classes of goods and not to tax others.\"",
      "speaker": "court",
      "significance": "Upholds legislative discretion in taxation."
    },
    {
      "text": "\"in particular, the State shall endeavor to promote cottage industries on an individual or cooperative basis in rural areas.\"",
      "speaker": "court",
      "significance": "Cites Art.43 as policy basis for exemption."
    }
  ],
  "_case_id": "1962_285",
  "_label": 0,
  "_text_length": 22870,
  "_extracted_at": "2026-02-10T20:01:05.892535"
}