{
  "metadata": {
    "case_name": "State of Madhya Pradesh v. Respondents",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "SINHA, C.J."
    ],
    "case_number": "Civil Appeals Nos. 229, 281 to 283/1961",
    "date_of_judgment": "1962-05-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "In Civil Appeal No. 229 of 1961, the respondent obtained, by virtue of registered documents, the grant of 24 villages in Balaghat and Mandla Districts, for propagating lac, the lease to expire on July 31, 1955.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In Civil Appeal No. 281 of 1961, by virtue of two unregistered agreements, the respondent obtained the right to collect tendu leaves in 37 villages upto July 31, 1963.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In Civil Appeal No. 282 of 1961, the respondent obtained similar rights from the proprietor by virtue of registered agreements, extending up to the end of the year 1962.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In Civil Appeal No. 283 of 1961, the respondent obtained the right to collect fruits and flower of Mahua trees from the proprietor, extending down to the year 1969, by virtue of three registered leases.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On the coming into effect of the Madhya Pradesh Abolition of Proprietary Rights (Estates, Mahals, Alienated Lands) Act, 1950 (Madhya Pradesh Act of 1951) and the issue of the necessary notifications under s. 3 of the Act, the appellant, the State of Madhya Pradesh, took possession of all the villages comprised in the respective estates of the proprietors, who were the grantors of the several interests indicated above in favour of the respondents.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The State refused to recognise the rights claimed by the respondents by virtue of the transactions aforesaid in their favour.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In each case, the High Court relying upon the decision of this Court in Chhotabhai Jethabai Patel and Co. v. State of Madhya Pradesh granted the relief claimed by the respondents, and held that the several interests claimed by the respondents had not been affected by the coming into force of the Act.",
      "type": "procedural",
      "date": "1958-02-20",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Facts of each case are not disputed, and nothing turns on the difference in facts.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respective grants made by the outgoing proprietors in favour of the respondents convey any rights to them which could be enforced against the appellant, the State of Madhya Pradesh, after the coming into effect of the Madhya Pradesh Abolition of Proprietary Rights (Estates, Mahals, Alienated Lands) Act, 1950 (Madhya Pradesh Act of 1951).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "As a result of the coming into operation of the Act all these interests which were the subject matter of dispute in all these cases had been extinguished, in view of the provisions of s. 4(1)(a) of the Act.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Sections 3 and 4(1)(a) of the Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Respondents' rights were not in the nature of mere licences, but were in the nature of profits a prendre, which were saved to them in view of the provisions of s. 6 of the Act; certain aspects of the controversy had not been brought to the notice of the Court on the previous occasion.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Section 6 of the Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The High Court was in error in granting relief to respondents in view of later decisions of this Court in Shrimati Shantabai v. State of Bombay and Mahadeo v. State of Bombay, which re-examined the earlier decision in Chhotabhai Jethabai Patel and Co. v. State of Madhya Pradesh.",
      "addresses_issue": "i1",
      "key_observation": "Earlier Chhotabhai decision held grants were licences not encumbrances under s.3(1), but later cases clarified that such grants either require registration as interests in land vesting in State under ss.3 and 4, or are personal contracts not binding on State."
    },
    {
      "id": "cr2",
      "text": "Under s.3 of the Act, from the date of notification, all proprietary rights in an estate vesting in a proprietor or person having interest through proprietor vest in State free from encumbrances; s.4(1)(a) provides that all rights, title and interest in such area including trees, forest etc. cease and vest in State free of encumbrances.",
      "addresses_issue": "i1",
      "key_observation": "Whatever rights the proprietor or person claiming through him had in trees, scrub jungle, forest etc. ceased on vesting."
    },
    {
      "id": "cr3",
      "text": "S.6(1) provides that transfer of any right liable to vest in State made after 16th March 1950 is void as from vesting date; it does not save pre-1950 transfers from vesting under ss.3 and 4(1)(a), though saved transfers may entitle claimant to compensation.",
      "addresses_issue": "i1",
      "key_observation": "S.4(1)(a) is not subject to s.6(1) in manner contended; s.6 refers to voidness of post-cutoff transfers."
    },
    {
      "id": "cr4",
      "text": "Scheme of Act acquires all proprietary interests except tiller's; what is saved to proprietor or claimant through him is in s.5 clauses (a) to (h); respondents' interests do not fall under s.5.",
      "addresses_issue": "i1",
      "key_observation": "Grants had no legal effect against State except if recognised."
    },
    {
      "id": "cr5",
      "text": "No need to distinguish bare licence, licence coupled with grant or profit a prendre, as whatever nature, grants had no legal effect against State.",
      "addresses_issue": "i1",
      "key_observation": "Fine distinctions irrelevant post-vesting."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rights, title and interest vesting in proprietor or person through him in area including trees, forest etc. cease and vest in State free of encumbrances under s.4(1)(a); respondents' grants not enforceable against State.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chhotabhai Jethabai Patel and Co. v. State of Madhya Pradesh",
      "citation": "1953 S.C.R. 476",
      "treatment": "referred | distinguished",
      "relevance": "Earliest decision; held grants were licences not encumbrances under s.3(1); relied on by High Court but re-examined in later cases."
    },
    {
      "case_name": "Shrimati Shantabai v. State of Bombay",
      "citation": "1959 S.C.R. 265",
      "treatment": "followed",
      "relevance": "Re-examined similar grants; held unregistered grants ineffective as proprietary interests or profits a prendre; personal contracts not binding on State."
    },
    {
      "case_name": "Mahadeo v. State of Bombay",
      "citation": "1959 Supp. 2 S.C.R. 339",
      "treatment": "followed",
      "relevance": "Held agreements for tendu leaves etc. required registration as interests in land vesting in State under ss.3 and 4; or not binding on State."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madhya Pradesh Abolition of Proprietary Rights (Estates, Mahals, Alienated Lands) Act, 1950",
      "sections": [
        "3",
        "4(1)(a)",
        "5",
        "6(1)",
        "8"
      ],
      "relevance": "Vesting of proprietary rights in State free of encumbrances; extinguishment of rights in land, trees, forests; savings and compensation provisions; applied to extinguish respondents' claimed rights."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; High Court judgments and orders set aside; held that respondents' interests ceased and vested in State under s.4(1)(a) and are not enforceable against State.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "all rights, title and interest vesting in the proprietor or any person having interest in such proprietary right through the proprietor in such area including land (cultivable or barren), grass land, scrubjungle, forest, trees shall cease and be vested in the State for the purposes of the State free of all encumbrances.",
      "speaker": "court",
      "significance": "Verbatim from s.4(1)(a); crux of extinguishment of rights."
    },
    {
      "text": "whatever may have been the nature of the grant by the outgoing proprietors in favour of the respondents, those grants had no legal effect as against the State, except in so far as the State may have recognised them.",
      "speaker": "court",
      "significance": "Concludes that distinctions like licence or profit a prendre irrelevant post-vesting."
    }
  ],
  "_case_id": "1962_49",
  "_label": 1,
  "_text_length": 13095,
  "_extracted_at": "2026-02-10T19:57:10.328745"
}