{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Bombay City I v. Jubilee Mills Ltd., Bombay",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Assessee company Jubilee Mills Ltd. is a limited liability company with paid up capital of Rs. 15,25,000 consisting of 1 lakh ordinary shares of Rs. 10 each (Rs. 10,00,000), 5,000 cumulative preference shares of Rs. 25 paid up (Rs. 1,25,000), 4,000 second preference shares of Rs. 100 each fully paid up (Rs. 4,00,000). Second preference shares do not entitle holders to vote. Voting shares: 1,05,000.",
      "type": "background",
      "date": "1947-06-30",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Assessment year 1948-49, previous year ended June 30, 1947. Company assessed on total income of Rs. 7,47,639. Tax calculated at Rs. 4,20,548. Required to distribute 60% if section 23A applicable. Declared dividends Rs. 24,750.",
      "type": "material",
      "date": "1948-49",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Income-tax Officer applied section 23A with approval of Inspecting Assistant Commissioner, deemed dividend Rs. 3,97,788.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Assessee managed by firm Mangaldas Mehta & Co. consisting of 14 partners, 7 of whom are directors of assessee company. Directors/partners hold 35,469 ordinary shares and 880 first preference shares. Other 7 partners hold 41,659 ordinary and 370 first preference shares.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Girdhardas Co. Ltd. holds 75 shares, to which section 23A applicable.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Members of managing agency hold on behalf of minor children or families: 9,899 ordinary shares and 937 first preference shares (Category C).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Company incurred heavy losses, reconstructed capital in 1930 reducing ordinary shares from Rs. 100 to Rs. 10, preference from Rs. 100 to Rs. 25 after High Court approval. Debit balance Rs. 12,75,000 written off.",
      "type": "background",
      "date": "1930",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Income-tax Officer granted rebate of one anna under proviso (a) to paragraph B of Part I of Second Schedule of Finance Act, 1948, applicable to companies to which section 23A not applicable.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "High Court judgment dated March 13, 1958, on reference from Income-tax Appellate Tribunal.",
      "type": "procedural",
      "date": "1958-03-13",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Managing agents hold 77,128 out of 1,00,000 ordinary shares (77.128%), plus 1,250 first preference out of 5,000, plus 75 by Girdhardas Co. Ltd., total 78,453. 75% of 1,05,000 voting shares is 78,750.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Category C shares (6,000 ordinary) held by managing agency members as guardians for minors, voting power in their hands.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts and in the circumstances of the case, the Income tax Officer was competent to pass an order under section 23A of the Act after having allowed a rebate of one anna per rupee in the assessment under proviso (a) to paragraph B of part I of the Second Schedule of the Finance Act, 1948?",
      "framed_by": "high_court"
    },
    {
      "id": "i2",
      "text": "If the answer to question No. 1 is in the affirmative whether, on the facts and in the circumstances of the case, the assessee company is a company in which the public are substantially interested for the purposes of section 23A of the Act?",
      "framed_by": "high_court"
    },
    {
      "id": "i3",
      "text": "Whether the loss of Rs. 12,75,000 incurred by the company, prior to its reconstruction in 1930, could be taken into consideration for purposes of the applicability of section 23A of the Act?",
      "framed_by": "high_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Grant of rebate earlier does not estop Income-tax Officer from applying section 23A.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 23A Income-tax Act"
    },
    {
      "id": "pa2",
      "text": "Company not one in which public substantially interested as shares carrying more than 75% voting power held by managing agents group or under their control.",
      "supporting_facts": [
        "f1",
        "f4",
        "f5",
        "f6",
        "f10",
        "f11"
      ],
      "legal_basis": "Explanation to section 23A; Commissioner of Income-tax v. Bjordal (Privy Council)"
    },
    {
      "id": "pa3",
      "text": "Group of managing agents controls company, holds over 75% voting shares.",
      "supporting_facts": [
        "f4",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Income-tax Officer estopped from applying section 23A after granting rebate implying section 23A not applicable.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Proviso (a) to paragraph B of Part I Second Schedule Finance Act 1948"
    },
    {
      "id": "ra2",
      "text": "Directors hold only shares in Category A, less than 75% voting power; public substantially interested.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Raghuvanshi Mills Ltd. v. Commissioner of Income tax (Bombay HC)"
    },
    {
      "id": "ra3",
      "text": "Past losses of Rs. 12,75,000 should be considered, making larger dividend unreasonable.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Section 23A Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Income-tax Officer competent to apply section 23A after granting rebate; no estoppel.",
      "addresses_issue": "i1",
      "key_observation": "High Court answered affirmatively, assessee concedes."
    },
    {
      "id": "cr2",
      "text": "Company not one in which public substantially interested. Test: whether individual or group controls affairs to exclusion of others by voting power. Directors qua directors part of public unless part of controlling group.",
      "addresses_issue": "i2",
      "key_observation": "Managing agents (14 partners) hold 77,128/100,000 ordinary shares (>75%), plus preference, Girdhardas shares, Category C shares under their control as guardians."
    },
    {
      "id": "cr3",
      "text": "Managing agents as group have common interest, act in concert; control company.",
      "addresses_issue": "i2",
      "key_observation": "No need to prove actual concerted action; circumstances show they must act together."
    },
    {
      "id": "cr4",
      "text": "Unconditional and beneficial holding means voting power free, not controlled by another or nominee.",
      "addresses_issue": "i2",
      "key_observation": "Approved Privy Council in Bjordal; distinguished Bombay HC in Raghuvanshi."
    },
    {
      "id": "cr5",
      "text": "Third question not answered as unnecessary.",
      "addresses_issue": "i3",
      "key_observation": "Depends on first, not answered by High Court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Income-tax Officer competent to apply section 23A after rebate.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Assessee company not one in which public substantially interested; section 23A applicable.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax v. Bjordal",
      "citation": null,
      "treatment": "followed",
      "relevance": "Test for 'public': group controlling voting power not public; directors qua directors part of public."
    },
    {
      "case_name": "Raghuvanshi Mills Ltd. v. Commissioner of Income tax",
      "citation": "1961 41 I.T.R. 613 (SC)",
      "treatment": "reversed",
      "relevance": "Bombay HC held directors' shares alone considered; SC reversed, applied broader group test."
    },
    {
      "case_name": "Shree Changdeo Sugar Mills Ltd. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Unconditional and beneficial holding means shares held for own benefit without control of another."
    },
    {
      "case_name": "Thomas Fattorini (Lancashire) Ltd. v. Inland Revenue Commissioners",
      "citation": null,
      "treatment": "referred",
      "relevance": "Refused supplemental statement under section 66(4)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "23A"
      ],
      "relevance": "Power to deem undistributed profits as dividends if less than 60% distributed, unless public substantially interested (Explanation: public holds not less than 25% voting power unconditionally and beneficially)."
    },
    {
      "name": "Finance Act, 1948",
      "sections": [
        "Proviso (a) to paragraph B of Part I of the Second Schedule"
      ],
      "relevance": "Rebate of one anna to companies to which section 23A not applicable."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed. High Court's answer to second question set aside; answered in negative (company not one in which public substantially interested). Section 23A applicable.",
    "relief_granted": "Order under section 23A upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"a company shall be deemed to be a company in which the public are substantially interested if shares of the company... carrying not less than twenty five per cent. of the voting power have been allotted unconditionally to, or acquired unconditionally by, and are at the end of the previous year beneficially held by the public\".",
      "speaker": "court",
      "significance": "Defines 'public substantially interested' under Explanation to section 23A."
    },
    {
      "text": "\"what one has to find out is whether there is an individual who, or a group acting in concert which, controls or control the affairs of the company to the exclusion of others by reason of his or their voting power.\"",
      "speaker": "court",
      "significance": "Key test for determining if public substantially interested."
    },
    {
      "text": "\"The controlling interest, of course, is effective only if the group owns 51% of the total shares. But the company will still be a company in which the public can be said to be substantially interested because to cease to be so the shareholding of the group must be more than 75.\"",
      "speaker": "court",
      "significance": "Clarifies threshold for section 23A applicability."
    }
  ],
  "_case_id": "1962_376",
  "_label": 1,
  "_text_length": 23125,
  "_extracted_at": "2026-02-10T20:02:03.614289"
}