{
  "metadata": {
    "case_name": "Bhopal Sugar Industries Ltd. v. Sales Tax Officer",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 578 of 1962",
    "date_of_judgment": "1962-12-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Company carries on the business of manufacturing sugar, and maintains for the purpose of that business a fleet of motor trucks and other motor vehicles.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Company is registered under the Act as a retail dealer of motor spirit and lubricants.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "During the period April 1, 1957, and March 31, 1958, the Company consumed a part of its stock-in-trade of motor spirits and lubricants for its own vehicles.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Sales Tax Officer, Bhopal Region, by order dated May 1, 1960, assessed the Company to pay tax in respect of motor spirits and lubricants consumed for its vehicles.",
      "type": "procedural",
      "date": "1960-05-01",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The Company filed a petition in the High Court of Madhya Pradesh at Jabalpur under Art. 226 of the Constitution: Misc. Petition No. 223 of 1960, seeking writ of certiorari quashing the STO order dated May 1, 1960, and notice of demand, and writ of prohibition or mandamus restraining recovery.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "High Court judgment and order dated January 25, 1961, dismissing the petition.",
      "type": "procedural",
      "date": "1961-01-25",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "High Court called for copy of Company's agreement with Caltex India Ltd., under which supply of motor-spirits and lubricants was obtained.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court held that Company was not full owner of petrol supplied by Caltex India Ltd., but agent; consumption was sale by agent to principal as consumer.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Sales Tax Officer submitted that consumption amounted to sale, because there was transfer of property from one establishment of the retail dealer to another.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Appeal to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether appropriation by a retail dealer of stock-in-trade owned by him for his own use constitutes sale within the meaning of the Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether power of the State to levy tax on sale or purchase of goods other than newspapers could be exercised only under Entry 54 of List II, and attempted levy on self-consumption is illegal and infringes Art. 19(1)(f) and (g).",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether High Court erred in proceeding to decide on ground of agency not set up by Sales Tax Officer, instead of constitutional questions, and bypassing statutory machinery.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sales Tax Officer had power to levy tax on sale only i.e. on transfer of property for a price; no sale of motor oil and lubricants consumed by Company for own vehicles as no transfer of property to anyone and no price paid or promised; consumption not taxable.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Charging section 3 read with definition under s. 2(k) of the Act of retail sale which does not include consumption by a retail dealer of his own goods."
    },
    {
      "id": "pa2",
      "text": "Power of State to levy tax on sale or purchase of goods other than newspapers only under Entry 54 List II 7th Schedule; levy illegal, without authority, infringes Art. 19(1)(f) and (g).",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Entry 54 List II, Constitution of India; Art. 19(1)(f) and (g)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Consumption of motor spirits and lubricants by the Company amounted to sale, because there was transfer of property from one establishment of the retail dealer to another.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court erred in proceeding to decide petition on ground of agency not set up in affidavit of Sales Tax Officer; Company claimed relief assuming ownership; should have left to statutory machinery for ascertaining nature of transaction.",
      "addresses_issue": "i3",
      "key_observation": "High Court assumed jurisdiction to decide dispute which had to be decided by resort to machinery under the Act after ascertainment of true nature in light of agreement."
    },
    {
      "id": "cr2",
      "text": "Challenge on infringement of fundamental rights fails; State has power to levy sales tax on motor spirits; nothing in s.2(k) or s.3 indicates legislation beyond competence.",
      "addresses_issue": "i2",
      "key_observation": "Levy of tax lawfully imposed under competent statute does not infringe Art. 19(1)(f) and (g); whether transaction taxable for taxing authority to determine."
    },
    {
      "id": "cr3",
      "text": "High Court normally does not entertain petitions against taxing orders when statutory remedies available; jurisdiction under Art.226 for constitutional questions, not to ascertain nature of disputed transaction.",
      "addresses_issue": "i3",
      "key_observation": "Company invoked on fact and constitutionality; HC investigated assumption instead of constitutional questions."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court order cannot be upheld as it decided on ground not raised.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Constitutional challenge to levy fails; sales tax on motor spirits within State competence; question of ownership and taxability to be determined under Act.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Madras v. Gannon Dunkerley & Co. (Madras) Ltd.",
      "citation": "1959 S.C.R. 379",
      "treatment": "referred",
      "relevance": "Power of State to levy sales tax traditionally understood."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madhya Bharat Sales of Motor Spirit Taxation Act, 20 of 1953",
      "sections": [
        "Section 2(k)",
        "Section 3"
      ],
      "relevance": "Definition of retail sale; charging section; whether self-consumption taxable."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 19(1)(f)",
        "Article 19(1)(g)",
        "Entry 54 List II 7th Schedule"
      ],
      "relevance": "Writ jurisdiction; fundamental rights; legislative competence for sales tax."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed. High Court erred in its approach but constitutional challenge fails. Company at liberty to contend in statutory appeal that it owned goods and self-consumption not sale; STO not bound by HC's view on agreement.",
    "relief_granted": "None; liberty to pursue statutory remedies.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The High Court was in error in proceeding to decide the petition on a ground which was not set up in the affidavit of the Sales Tax Officer.\"",
      "speaker": "court",
      "significance": "Core reason for criticizing HC's approach."
    },
    {
      "text": "\"Levy of a tax lawfully imposed under a statute within the competence of the Legislature cannot be deemed to infringe the fundamental rights guaranteed by Art. 19(1)(f) and (g).\"",
      "speaker": "court",
      "significance": "Rejects constitutional challenge."
    },
    {
      "text": "\"The petrol remained the property of Caltex India Limited, and the petitioner sold it as an agent of the supplying Company.\"",
      "speaker": "lower_court",
      "significance": "HC's erroneous basis for dismissal, not adopted by SC."
    }
  ],
  "_case_id": "1962_91",
  "_label": 0,
  "_text_length": 11086,
  "_extracted_at": "2026-02-10T19:57:53.230831"
}