{
  "metadata": {
    "case_name": "Assessee Company v. Deputy Commissioner of Agricultural Income-tax and Sales Tax",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Kapur, J."
    ],
    "case_number": "Civil Appeal No. 628 of 1961",
    "date_of_judgment": "1962-11-30"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Assessment period is 1952-53 and the turnover was of a sum of Rs.3,77,644/- on which a tax of Rs. 5900/11/- was levied.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The assessment was made on March 30, 1955, under r. 33 of the Act on the ground that the sales of tea had escaped assessment.",
      "type": "procedural",
      "date": "1955-03-30",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appeal against that order was unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Sales tax Appellate Tribunal by its order dated August 12, 1957, held that the ban under Art. 286(1)(a) of the Constitution on sales which are outside the State applied, in regard to the sales of full lots and therefore remanded the case to the Sales tax Officer.",
      "type": "procedural",
      "date": "1957-08-12",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Revision to the High Court of Kerala which by judgment and order dated February 24, 1960, in Tax Revision Case No. 22 of 1957 held that the decision of the Appellate Tribunal in regard to the applicability of Art. 286(1)(a) was erroneous and therefore the sales were subject to sales tax under the Act.",
      "type": "procedural",
      "date": "1960-02-24",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Teas were stored in the godowns at Willingdon Island which was in the State of Travancore Cochin.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Samples of those teas etc., were taken to Fort Cochin which at the relevant time was in the State of Madras.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Teas were sold by public auction in lots at Fort Cochin by the samples, some were purchased in their entirety (full lots) and others in parts.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "After the consideration money was paid at Fort Cochin delivery orders were given to the buyers addressed to the godown keepers at Willingdon Island and actual delivery of tea was taken there.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "These teas were then sent out from Willingdon Island in Travancore Cochin for consumption either in other parts of India or were exported out of India.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "It has been found and it has not been disputed that the title to the goods in the present case passed at Fort Cochin.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The purchase money was paid at Fort Cochin and the purchaser obtained from the auctioneer delivery orders directing the godown keepers at Willingdon Island to deliver the goods and only the actual physical delivery of the goods took place at Willingdon Island.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Outcherloney Valley Estates Ltd. applied for intervention as the State of Kerala has, on similar facts, levied sales tax on certain transactions that the High Court of Kerala has upheld relying on the judgment under appeal.",
      "type": "background",
      "date": null,
      "source": "interveners"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sales of tea can be held to have taken place at Willingdon Island i.e. within the territory of Travancore Cochin State and were liable to the imposition of sales tax under the Travancore-Cochin General Sales Tax Act, or they were outside sales and therefore not subject to sales tax in the State of Travancore-Cochin.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "These sales were effected at Fort Cochin which was outside the territory of Travancore Cochin and therefore were not liable to tax because of the ban imposed by Art. 286(1)(a) of the Constitution.",
      "supporting_facts": [
        "f7",
        "f8",
        "f11"
      ],
      "legal_basis": "Art. 286(1)(a) of the Constitution; Sale of Goods Act s. 64 (sale by auction complete on fall of hammer); s. 2(14) (specific goods)"
    },
    {
      "id": "pa2",
      "text": "In regard to full lots, title passed as soon as the hammer fell at Fort Cochin as they were specific goods.",
      "supporting_facts": [
        "f8",
        "f11"
      ],
      "legal_basis": "Sale of Goods Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The words in Art. 286(1)(a) 'outside the State' do not mean transfer of ownership according to the Sale of Goods Act but it was lex situs which determines the taxability of the transaction and the correct position is that the ownership in the goods is transferred according to the law of the place where the goods are situate. Therefore the sale was in the State of Travancore Cochin.",
      "supporting_facts": [
        "f6",
        "f9",
        "f12"
      ],
      "legal_basis": "Art. 286(1)(a); Explanation does not provide to the contrary"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under the Sale of Goods Act in an auction sale the title in goods passes and the sale is complete as soon as the hammer falls. For specific goods, title passes to the buyer on fall of hammer at Fort Cochin.",
      "addresses_issue": "i1",
      "key_observation": "Goods were specific goods i.e. goods which were auctioned in full lots."
    },
    {
      "id": "cr2",
      "text": "The majority decision in Indian Copper Corporation Ltd. v. State of Bihar holds that where the property in the goods passed within a State as a direct result of the sale, the sale transaction is not outside the State for the purpose of Art. 286(1)(a) unless the Explanation operates. Here property passed at Fort Cochin in State of Madras.",
      "addresses_issue": "i1",
      "key_observation": "On the facts, property passed at Fort Cochin and this view has not been challenged."
    },
    {
      "id": "cr3",
      "text": "The fiction created by the Explanation to Art. 286(1)(a) is inapplicable because there was no delivery as a direct result of sale for the purpose of consumption in any particular State.",
      "addresses_issue": "i1",
      "key_observation": "The rival States claiming to tax are not the States of delivery for consumption and those where title passes."
    },
    {
      "id": "cr4",
      "text": "Same considerations apply to goods exported out of India from Willingdon Island; title passed at Fort Cochin.",
      "addresses_issue": "i1",
      "key_observation": "Goods delivered for consumption in parts of India other than Travancore Cochin."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The sale was an outside sale and cannot be said to be an inside sale qua Travancore Cochin because the title passed at Fort Cochin which is in the State of Madras.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Indian Copper Corporation Ltd. v. State of Bihar",
      "citation": "1961 2 S.C.R. 276",
      "treatment": "followed",
      "relevance": "Held that passing of property determines whether sale is inside or outside the State for Art. 286(1)(a); State where property passes has power to tax unless Explanation operates."
    }
  ],
  "statutes_cited": [
    {
      "name": "Travancore-Cochin General Sales Tax Act and Rules",
      "sections": [
        "r. 33"
      ],
      "relevance": "Assessment made under r. 33 as sales escaped assessment; determines taxability of sales within State."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 286(1)(a)",
        "Explanation to Art. 286(1)(a)"
      ],
      "relevance": "Prohibits State tax on sales outside the State; Explanation deems sale in State of delivery for consumption notwithstanding property passing elsewhere."
    },
    {
      "name": "Sale of Goods Act",
      "sections": [
        "s. 64",
        "s. 2(14)"
      ],
      "relevance": "Auction sale complete on fall of hammer; title passes for specific goods; distinguishes specific and unascertained goods."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed and the judgment and order of the High Court of Kerala set aside. The sales of tea are outside sales not taxable under the Travancore-Cochin General Sales Tax Act as title passed in Madras.",
    "relief_granted": "Appeal allowed; High Court judgment set aside",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The conclusion reached therefore is that where the property in the goods passed within a State as a direct result of the sale, the sale transaction is not outside the State for the purpose of Art. 286(1)(a) unless the Explanation operates.\"",
      "speaker": "court",
      "significance": "Key holding from Indian Copper Corp. applied to determine situs of sale."
    },
    {
      "text": "\"In the present case therefore the sale was an outside sale and cannot be said to be an inside sale qua Travancore Cochin because the title passed at Fort Cochin which is in the State of Madras.\"",
      "speaker": "court",
      "significance": "Direct resolution of taxability issue in favor of assessee."
    }
  ],
  "_case_id": "1962_81",
  "_label": 1,
  "_text_length": 11152,
  "_extracted_at": "2026-02-10T19:57:08.646612"
}