{
  "metadata": {
    "case_name": "Mst. Kharbuja Kuer v. Jangbahadur Rai & Ors.",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Civil Appeal No. 522 of 1959",
    "date_of_judgment": "1962-04-09"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Genealogy: Ramlal Rai had sons Jamuna Rai (deceased), Jangbahadur Rai (D1), Rameshwar Rai (deceased, husband of plaintiff Mst. Kharbuja Kuer), and Kasida Kuer (deceased). Rameshwar's brothers: Jugeshar Rai (D2), Rambirchh Rai (D3), Mahessar Rai (D4).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Rameshwar Rai and Jangbahadur Rai (D1) effected a partition of family property in or about 1924. Rameshwar in exclusive possession of his share thereafter.",
      "type": "material",
      "date": "1924",
      "source": "plaintiff"
    },
    {
      "id": "f3",
      "text": "Rameshwar Rai died in 1930. Plaintiff (widow) and mother-in-law continued in possession.",
      "type": "material",
      "date": "1930",
      "source": "plaintiff"
    },
    {
      "id": "f4",
      "text": "Mother-in-law died in 1938.",
      "type": "background",
      "date": "1938",
      "source": "plaintiff"
    },
    {
      "id": "f5",
      "text": "D1 asked plaintiff and mother-in-law to execute power of attorney. They, being pardanashin ladies, executed document on August 24, 1935, believing it to be power of attorney.",
      "type": "material",
      "date": "1935-08-24",
      "source": "plaintiff"
    },
    {
      "id": "f6",
      "text": "Document was maintenance deed with false recitals of no separation and joint family property. Not read out to them; scribe and attesting witnesses partisans of D1. Always in D1's custody.",
      "type": "disputed",
      "date": "1935-08-24",
      "source": "plaintiff"
    },
    {
      "id": "f7",
      "text": "Plaintiff and mother-in-law continued getting income from property as before execution till mother-in-law's death.",
      "type": "material",
      "date": null,
      "source": "plaintiff"
    },
    {
      "id": "f8",
      "text": "Fraud discovered in 1355 fasli when D1 interfered with possession, claimed only maintenance right, and plaintiff got document read.",
      "type": "material",
      "date": "1355 fasli",
      "source": "plaintiff"
    },
    {
      "id": "f9",
      "text": "Plaintiff filed suit in Munsif, Muzaffarpur, for declaration of title and that maintenance deed fraudulent and not binding.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Defendants denied fraud; alleged deed read and explained, Babu Ramnath Singh (plaintiff's brother) present and signed on her behalf.",
      "type": "disputed",
      "date": "1935-08-24",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Issues framed: No.3 - Separation between Rameshwar and D1 in Asardh 1334 Fs. (1927)? No.4 - Document dated 24-8-1935 valid and read over? No.5 - Entitled to reliefs? Burden on plaintiff for separation, on defendant for document knowledge.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Munsif found separation, pardanashin ladies ignorant with confidence in D1, document not read/understood; decreed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Subordinate Judge confirmed findings and decree on appeal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Patna HC (Imam J.) reversed on second appeal: Burden wrongly placed; plaintiff failed to prove fraud; dismissed suit. Dated December 2, 1957, in S.A. No. 791 of 1963.",
      "type": "procedural",
      "date": "1957-12-02",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Plaintiff and mother-in-law pardanashin, illiterate (one old, one middle-aged), full confidence in D1.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Babu Ramnath Singh not proved brother; document in D1 custody; no examination of key witnesses by D1.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Is the allegation of separation between Rameshwar Rai and defendant No. 1 in the month of Asardh 1334 Fs. correct?",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Is the document dated 24-8-1935 legal and valid? Was the same read over to the plaintiff and executed with full knowledge of contents?",
      "framed_by": "lower_court"
    },
    {
      "id": "i3",
      "text": "Are the plaintiffs entitled to the reliefs claimed?",
      "framed_by": "lower_court"
    },
    {
      "id": "i4",
      "text": "Who bears the burden of proof regarding execution of document by pardanashin lady?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court wrong on burden of proof; Munsif and Sub Judge correctly placed burden on defendant and gave findings on entire evidence; findings of fact binding under s.100 CPC.",
      "supporting_facts": [
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": "S. 100 Code of Civil Procedure; law on pardanashin ladies"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Finding on separation halting, illegal, not based on evidence; initial burden on defendant discharged by evidence and circumstances.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Presumption of jointness under Hindu law"
    },
    {
      "id": "ra2",
      "text": "Question of separation irrelevant; both parties agreed not necessary.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court has no jurisdiction in second appeal on erroneous finding of fact unless vitiated by law error.",
      "addresses_issue": "i4",
      "key_observation": "Concurrent findings of Munsif and Sub Judge binding."
    },
    {
      "id": "cr2",
      "text": "Pardanashin ladies get special protection; burden on person seeking to sustain document to prove it was executed after clear understanding (physical and mental act), not only by explanation but by circumstances.",
      "addresses_issue": "i2",
      "key_observation": "Rule distinct from fraud/duress; Privy Council principles."
    },
    {
      "id": "cr3",
      "text": "Lower courts approached correctly, concurrent finding defendant failed to discharge burden; even apart, facts support plaintiff ignorant of contents.",
      "addresses_issue": "i4",
      "key_observation": "High Court wrongly shifted burden to plaintiff."
    },
    {
      "id": "cr4",
      "text": "Separation finding based on oral, documentary, circumstantial evidence; relevant to probability of executing document admitting jointness.",
      "addresses_issue": "i1",
      "key_observation": "Binding on High Court; rebuts jointness presumption."
    },
    {
      "id": "cr5",
      "text": "Facts supporting finding: pardanashin/illiterate, confidence in D1, disputed witnesses, custody with D1, continued possession, no key witnesses examined.",
      "addresses_issue": "i2",
      "key_observation": "No ground to interfere in second appeal."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Burden of proof rests on person seeking to sustain transaction with pardanashin lady to establish execution after understanding nature.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Concurrent findings of fact by lower courts not interferable by High Court in second appeal.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Document not binding; plaintiff entitled to declaration of title.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Farid-Un-Nisa v. Mukhtar Ahmad",
      "citation": "1925 L.R. 52 I.A. 342",
      "treatment": "followed",
      "relevance": "Origin and principle of protection for pardanashin ladies; burden to show free and intelligent act from circumstances."
    },
    {
      "case_name": "Geresh Chunder Lahoree v. Mst. Bhuggobutty Debia",
      "citation": "1870 13 M.I.A. 419",
      "treatment": "followed",
      "relevance": "Court to ascertain pardanashin woman was free agent and informed."
    },
    {
      "case_name": "Kali Baksh v. Ram Gopal",
      "citation": "1913 41 I.A. 23",
      "treatment": "followed",
      "relevance": "Burden on those founding on deed to show affirmatively explained and understood."
    },
    {
      "case_name": "Jagadish Chandra v. Debnath",
      "citation": "A.I.R. 1940 P.C. 134",
      "treatment": "followed",
      "relevance": "Reiterated burden discharge by circumstances, not only explanation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "S. 100"
      ],
      "relevance": "High Court no jurisdiction to interfere with concurrent findings of fact in second appeal."
    },
    {
      "name": "Hindu Law",
      "sections": [],
      "relevance": "Presumption of joint family rebutted by evidence of partition."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; Patna High Court judgment set aside; decree of Munsif and Subordinate Judge restored declaring maintenance deed fraudulent and not binding, confirming plaintiff's title.",
    "relief_granted": "Declaration of title to suit property; maintenance deed declared fraudulent and not binding.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The burden of proof shall always rest upon the person who seeks to sustain a transaction entered into with a pardanashin lady to establish that the said document was executed by her after clearly understanding the nature of the transaction.",
      "speaker": "court",
      "significance": "Core holding on burden of proof for pardanashin ladies."
    },
    {
      "text": "In India pardanashin ladies have been given a special protection in view of the social conditions of the time, they are presumed to have an imperfect knowledge of the world.",
      "speaker": "court",
      "significance": "Explains rationale for special rule."
    },
    {
      "text": "It demands that the burden of proof shall in such a case rest, not with those who attack, but with those who found upon the deed.",
      "speaker": "court",
      "significance": "Quotes Privy Council on shifting burden."
    }
  ],
  "_case_id": "1962_195",
  "_label": 1,
  "_text_length": 21113,
  "_extracted_at": "2026-02-10T19:59:23.369703"
}