{
  "metadata": {
    "case_name": "Daudi Bohra Plaintiffs v. Hakimia Coronation Society & Ors.",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Civil Appeals Nos. 406 and 407 of 1960",
    "date_of_judgment": "1962-08-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "School started at Burhanpur by certain members of the Daudi Bohra Community in 1902, named Madrasai Faize Hakimia, object to impart religious and secular education to boys of the Daudi Bohra Community. Funds collected from community members for maintenance.",
      "type": "background",
      "date": "1902",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "English classes added to the school in 1908.",
      "type": "background",
      "date": "1908",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "School raised to status of High School in 1911 under name Madrasai Hakimia and Coronation High School.",
      "type": "background",
      "date": "1911",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On May 24, 1909, Abdul Hussain-Abdullali Faizullabhai Muchhala of Surat made waqf of certain properties in Bombay for benefit of school at Burhanpur. Appointed 12 gentlemen as trustees, mentioned as already appointed trustees of the school.",
      "type": "material",
      "date": "1909-05-24",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On September 15, 1909, six Daudi Bohras of Burhanpur, describing themselves as managers of the school, executed deed creating waqf and trust of their detailed properties. Named 80 persons including themselves as trustees. All movable and immovable properties connected with school to vest in trustees. Trustees entitled to govern, manage, administer school, frame rules/regulations for benefit/efficient running, appoint new trustees per such rules.",
      "type": "material",
      "date": "1909-09-15",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Trustees managed school and properties including waqf properties without trouble till March 1917. Converted some original trust properties into new ones with additional donations from community.",
      "type": "background",
      "date": "1909-1917",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Feud in Daudi Bohra Community in 1917 over whether Mullaji Taher Saifuddin Saheb was Dai-ul-Mutlaq.",
      "type": "background",
      "date": "1917",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In March 1917, four out of 18 trustees appointed by September 15, 1909 deed joined three other Daudi Bohras of Burhanpur to form Madrasai Hakimia Coronation Society under Act XXI of 1860. Main purpose to run Hakimia Coronation High and Primary Schools. Governing body of 12 named persons to manage. Properties acquired for or given to school vested in governing body.",
      "type": "material",
      "date": "1917-03",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Defendants 2 to 11 are members of governing body of the Society. From assuming management, administered properties of which waqf made by six gentlemen via September 15, 1909 deed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Suit under s.92 CPC filed by 4 Daudi Bohra Muslims, members of community interested in trust properties in Schedule to plaint. Main contention: Defendant 1 (Hakimia Society) and defendants 2-11 not validly appointed trustees. Prayers: declaration they are not valid trustees, removal from management, accounts, appoint proper persons per 1909 deed, frame scheme if necessary. Grounds: not appointed per 1909 deed terms; entrustment to Society invalid; breaches like admitting non-Daudi Bohra students.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Trustees of Muchhala waqf impleaded as defendants 12-17. No relief asked against them.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Defences of defendants 1-11: Validly appointed per rules under 1909 deed; properties vested in them, continued after Society registration; denied breaches, admission of non-Bohras not breach.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Issues framed including Issue 9: Are defendants 2-11 duly appointed trustees under trust deed dated 15-9-1909? Issue 6: Use of trust properties for litigation in 1925 CS No.32/1925? Misappropriation? Litigation for school benefit? Issue 11c: Admission of non-Daudi Bohra students inconsistent with trust object?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Trial Court: Issue 9 affirmative for 2-11 (except Muchhala properties); power under para 6 of 1909 deed to appoint new, register society, frame rules as in MoA; vesting valid. Issue 6: Used funds for 1925 litigation not for school benefit, but no misappropriation as believed in school's interest. Issue 11c negative. Refused declaration/removal of 1-11; removed 12-17, ordered deposit amounts; 2-11 deposit Rs.15,596-5-8 or removed and scheme framed. Appointed Commissioner for accounts.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Plaintiffs appealed to Nagpur High Court (now MP). Defendants 12-17 appealed against reliefs. Defendants 1,2,4,5,9,10 cross-objections on misapplication finding.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "High Court dismissed appeals and cross-objections, affirmed Trial Court.",
      "type": "procedural",
      "date": "1956-10-30",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Two appeals to Supreme Court by special leave: CA 406/60 by defendants 12,14-17; CA 407/60 by plaintiffs.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether defendants 2 to 11 were duly appointed trustees under the trust deed dated 15-9-1909?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether defendants 1 to 11 committed breaches of trust, including use of trust funds for 1925 litigation (CS No.32/1925) and admission of non-Daudi Bohra students?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether relief could be granted against defendants 12 to 17 when no relief prayed for against them?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Defendants 1-11 not validly appointed trustees under 1909 deed; no power to vest properties in Society/governing body; persons forming Society had no right to do so.",
      "supporting_facts": [
        "f5",
        "f8",
        "f10"
      ],
      "legal_basis": "Trust deed dated 15-9-1909"
    },
    {
      "id": "pa2",
      "text": "Breaches of trust: admitting non-Bohra students; using trust funds for litigation not benefiting school.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Original trustees had no power to divest themselves or vest in new body even if majority acted.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Indian Trusts Act ss.46,47 (principles); general trust law against delegation/renunciation"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Validly appointed under rules framed per 1909 deed; properties vested and continued post-Society registration.",
      "supporting_facts": [
        "f5",
        "f8",
        "f12"
      ],
      "legal_basis": "Trust deed dated 15-9-1909, para 6; Societies Registration Act XXI of 1860"
    },
    {
      "id": "ra2",
      "text": "No breach: admission of non-Bohras not inconsistent; 1925 litigation expenditure not misappropriation.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Trust deed covers only properties of six settlors (cls.7-12); other school properties not trust properties under deed; no claim as trustees for those.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Trust deed dated 15-9-1909"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No relief sought against defendants 12-17; plaint targets only 1-11; courts below erred in granting decree against them.",
      "addresses_issue": "i3",
      "key_observation": "Plaint read as whole shows relief only against 1-11; para 10 specifies liability of 1-11."
    },
    {
      "id": "cr2",
      "text": "Trustees cannot abdicate, delegate all functions/powers, divest properties to new body unless permitted by deed, beneficiary consent, or court; 1909 deed cl.5 allows framing rules, appointing new trustees (adding, not substituting), but not full substitution/vesting in Society.",
      "addresses_issue": "i1",
      "key_observation": "Act of handing over to Society illegal/void; defendants 1-11 not trustees, but trustees de son tort."
    },
    {
      "id": "cr3",
      "text": "Respondents' new argument that deed covers only settlors' properties not their case below; written statement admits all plaint Schedule M properties covered, claims trusteeship over all per deed.",
      "addresses_issue": "i1",
      "key_observation": "Cannot change case now; all properties covered."
    },
    {
      "id": "cr4",
      "text": "Unnecessary to revisit breach findings as removal/accounts due anyway; Rs.15k+ paid; non-Bohra students' interests safeguarded.",
      "addresses_issue": "i2",
      "key_observation": "Plaintiffs entitled to reliefs even if no breaches."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Defendants 1-11 not validly appointed trustees of Burhanpur trust properties; removal from management; liable to render full accounts.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No decree against defendants 12-17 as no relief prayed.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Trial Court to appoint new trustees after hearing recommendations/objections from plaintiffs/community; no scheme needed now.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Trusts Act",
      "sections": [
        "Section 46",
        "Section 47"
      ],
      "relevance": "Embody principles against trustee renunciation/delegation of office/duties; not directly applicable to charitable trust but principles apply universally."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 92"
      ],
      "relevance": "Suit filed under this for trust administration, removal of trustees, scheme."
    },
    {
      "name": "Societies Registration Act",
      "sections": [],
      "relevance": "Society registered under Act XXI of 1860."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Both appeals allowed: CA 406/60 (defendants 12,14-17) allowed as no relief against them; CA 407/60 (plaintiffs) allowed - declaration defendants 1-11 not valid trustees, removal from management, accounts (credit for Rs.15,596-5-8 paid); Trial Court to appoint new trustees after hearings; no scheme; costs to plaintiffs from 1-11 in all courts.",
    "relief_granted": "Declaration, removal of defendants 1-11, accounts, appointment of new trustees.",
    "costs": "Plaintiffs get costs in Supreme Court, Trial Court, High Court from defendants 1-11."
  },
  "key_quotes": [
    {
      "text": "\"A trustee who has accepted the trust cannot afterwards renounce it except (a) with the permission of a principal Civil Court... or (c) by virtue of a special power in the instrument of trust.\"",
      "speaker": "court",
      "significance": "Cites s.46 Indian Trusts Act principle against renunciation."
    },
    {
      "text": "\"A trustee cannot delegate his office or any of his duties either to a co-trustee or to a stranger, unless (a) the instrument of trust so provides...\"",
      "speaker": "court",
      "significance": "Cites s.47 principle against full delegation/abdication."
    },
    {
      "text": "\"The act of the trustees... in handing over the management of the school to the Hakimia Society... was illegal and void in law.\"",
      "speaker": "court",
      "significance": "Core holding on invalidity of vesting in Society."
    }
  ],
  "_case_id": "1962_420",
  "_label": 1,
  "_text_length": 32089,
  "_extracted_at": "2026-02-10T20:02:48.154892"
}