{
  "metadata": {
    "case_name": "Gurbaksh Singh v. Nikka Singh and Mula Singh",
    "case_year": 1960,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Civil Appeal No. 128 of 1960",
    "date_of_judgment": "1962-09-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Land measuring 9 kanals and 2 marlas bearing Khasra Nos. 292 and 296 (previously corresponding Khasra Nos. 324 and 328) in mauza Kot Syed Mahmud, District of Amritsar.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Land originally belonged to a number of co-sharers, including Teja Singh and Jhandha Singh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Partition among co-sharers; on April 20, 1929, application filed before Revenue Authorities for mutation signed by all co-sharers including Teja Singh and Jhandha Singh (Ex. D-6), stating one share to Teja Singh and 7 shares to Jhandha Singh in respect of the said Khasra numbers.",
      "type": "material",
      "date": "1929-04-20",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Mutation effected on August 26, 1929 (Mutation No. 960): entire extent of the said Khasra numbers shown against Teja Singh alone.",
      "type": "material",
      "date": "1929-08-26",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Jhandha Singh discovered mistake and applied on August 10, 1934 to Revenue Authorities for correcting the mistake in revenue record.",
      "type": "material",
      "date": "1934-08-10",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Revenue Authorities enquired from August 10, 1934 to October 31, 1935; Mula Singh (brother and heir of Teja Singh, who had died) admitted the mistake; report of subordinate officer tracing history including partition and joint application Ex. D-6.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Revenue Authorities corrected mistake; Mutation No. 1490: 1/8 share to Teja Singh/Mula Singh and 7/8 to Jhandha Singh.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On October 24, 1934 (after Jhandha Singh's application and date Mula Singh had to appear before Revenue Authorities), Mula Singh executed sale deed conveying the said land to Gurbaksh Singh (appellant); appellant obtained security bond from Mula Singh to indemnify against loss; bulk of consideration paid only on October 22, 1937.",
      "type": "material",
      "date": "1934-10-24",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Jhandha Singh sold his 7/8 share (along with others) to Gopal Singh, from whom Nikka Singh (first respondent) purchased by sale deed dated October 27, 1936.",
      "type": "material",
      "date": "1936-10-27",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant filed suit under s. 117 of Punjab Land Revenue Act, 1887 in revenue court for declaration of exclusive title to the two Khasra numbers; defendants: Nikka Singh (first respondent) and Mula Singh (second respondent).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Suit transferred to Subordinate Judge, Amritsar; on February 14, 1949, Subordinate Judge decreed appellant's suit, holding mutation 1490 not properly made as based on Mula Singh's admission after sale to appellant and no facts proved.",
      "type": "procedural",
      "date": "1949-02-14",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "District Judge dismissed first respondent's appeal, finding appellant bona fide purchaser in good faith, but no definite finding on title.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Punjab High Court in Second Appeal No. 493 of 1950 (judgment November 4, 1955) set aside Subordinate Judge's decree, dismissed suit: correction of mutation 960 with consent of both parties, presumption of correctness of later mutation, appellant cognizant Mula Singh had only 1/8 share.",
      "type": "procedural",
      "date": "1955-11-04",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appellant and Mula Singh from same village Kot Syed Mahmud.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether High Court had jurisdiction under ss. 100 and 101 CPC to set aside concurrent findings of lower courts on facts.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether presumption under s. 37 Punjab Land Revenue Act attaches to mutation entry No. 1490, made on admission of Mula Singh after transfer to appellant.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether appellant was bona fide purchaser in good faith protected under s. 41 Transfer of Property Act.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether mutation entry No. 1490 was made in accordance with facts proved or admitted under s. 37(a) Punjab Land Revenue Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court has no jurisdiction under ss. 100 and 101 CPC to set aside concurrent findings arrived at by the two lower courts.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "ss. 100 and 101 Code of Civil Procedure; Privy Council 1931 ruling followed by courts"
    },
    {
      "id": "pa2",
      "text": "Under s. 37 Punjab Land Revenue Act, no presumption in favour of entry No. 1490 as made on admission of Mula Singh after he transferred interest to appellant, so admission could not constitute legal basis.",
      "supporting_facts": [
        "f8",
        "f7"
      ],
      "legal_basis": "s. 37 Punjab Land Revenue Act, 1887"
    },
    {
      "id": "pa3",
      "text": "Appellant was bona fide purchaser in good faith.",
      "supporting_facts": [
        "f8",
        "f12"
      ],
      "legal_basis": "s. 41 Transfer of Property Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Correction of earlier mutation No. 960 made with consent of both parties; presumption attached to correctness of later mutation; appellant fully cognizant that Mula Singh had only 1/8 share.",
      "supporting_facts": [
        "f6",
        "f7",
        "f13"
      ],
      "legal_basis": "s. 37 Punjab Land Revenue Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "District Judge gave no finding on title, only on bona fide purchase; such finding not based on evidence or s.41 TPA principles, so High Court could give finding on title.",
      "addresses_issue": "i1",
      "key_observation": "Question of title left open."
    },
    {
      "id": "cr2",
      "text": "Appellant not protected by s.41 TPA: facts show knowledge of defect in Mula Singh's title (same village, sale on date of revenue appearance, delayed payment, security bond).",
      "addresses_issue": "i3",
      "key_observation": "Transferee onus not discharged; acted with knowledge."
    },
    {
      "id": "cr3",
      "text": "Mutation 1490 made in accordance with s.37(a): based on proved facts (Mula Singh evidence, subordinate officer report with Ex.D-6 annexures tracing partition); not merely admission post-transfer.",
      "addresses_issue": "i2",
      "key_observation": "Presumption under ss.37 and 44 attaches; appellant adduced no rebuttal evidence."
    },
    {
      "id": "cr4",
      "text": "Ex.D-6 recital confirms partition shares; High Court right in holding presumption in favour of entry, unrebutted.",
      "addresses_issue": "i4",
      "key_observation": "Later entry lawfully substituted."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court within jurisdiction to decide title as no prior finding by District Judge.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Appellant not bona fide purchaser under s.41 TPA due to knowledge of defective title.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Mutation entry No. 1490 correct and presumed true under ss.37 and 44 Punjab Land Revenue Act as based on proved facts.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Appellant has no exclusive title to the land.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Privy Council ruling (1931)",
      "citation": null,
      "treatment": "followed",
      "relevance": "High Court no jurisdiction in second appeal on erroneous findings of fact however gross."
    }
  ],
  "statutes_cited": [
    {
      "name": "Punjab Land Revenue Act, 1887",
      "sections": [
        "s. 117",
        "s. 37",
        "s. 44",
        "s. 35"
      ],
      "relevance": "Suit for title declaration; conditions for varying entries and presumption of correctness."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "s. 41"
      ],
      "relevance": "Protection for ostensible owner transfers if transferee bona fide."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "ss. 100",
        "101"
      ],
      "relevance": "High Court jurisdiction in second appeal."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 136"
      ],
      "relevance": "Appeal by special leave."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding Punjab High Court's judgment setting aside the decree for the appellant and dismissing the suit for declaration of exclusive title, as the revenue mutation correction was proper with presumption of correctness, and appellant not bona fide purchaser.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The general rule is that a person cannot confer a better title than he has. This section is an exception to that rule.\"",
      "speaker": "court",
      "significance": "Explains s.41 TPA as exception requiring onus on transferee."
    },
    {
      "text": "\"These facts show that the appellant had knowledge of the defect in the title of Mula Singh. It is, therefore, not possible to hold that he had purchased it in good faith.\"",
      "speaker": "court",
      "significance": "Rejects bona fide purchaser claim based on suspicious circumstances."
    },
    {
      "text": "\"If the entry No. 1490 substituting entry No. 960 had been made in strict compliance with S. 37 of the Punjab Land Revenue Act, it cannot be disputed that there would be a presumption that the new entry was lawfully substituted for the old.\"",
      "speaker": "court",
      "significance": "Affirms presumption under revenue law for corrected entry."
    }
  ],
  "_case_id": "1962_215",
  "_label": 0,
  "_text_length": 13332,
  "_extracted_at": "2026-02-10T19:59:24.056734"
}