{
  "metadata": {
    "case_name": "Sewa Singh v. State",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Criminal Appeal No. 60 of 1962",
    "date_of_judgment": "1962-04-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant convicted by Sessions Judge, Patiala, of offence under s.302 IPC for murder of Gurdev Singh and sentenced to death.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Punjab High Court dismissed appellant's appeal (Criminal Appeal No. 890 of 1961) and confirmed death sentence in Murder Reference No. 74 of 1961 on October 25, 1961.",
      "type": "procedural",
      "date": "1961-10-25",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Present appeal by special leave granted by Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Prosecution case: At about 2.30 p.m. on November 18, 1960, Gurdev Singh passing tea-stall of Charan Singh near courts at Barnala on motorcycle; appellant Sewa Singh in shop with double barrel gun stood up and fired shot hitting right side of chest; Gurdev Singh died instantaneously; appellant and Gogar Singh ran away.",
      "type": "material",
      "date": "1960-11-18",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Accused pleaded not guilty; disputed that he was the culprit; not disputed that Gurdev Singh died of gunshot injury at time and place alleged.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Occurrence witnessed by Charan Singh (owner, turned hostile, denied knowledge of who fired), Mukhtiar Singh (student), Bakhtawar Singh (having tea in shop); latter two knew appellant from before and testified seeing him fire double barrel gun.",
      "type": "material",
      "date": "1960-11-18",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Evidence of Mukhtiar Singh and Bakhtawar Singh believed by Trial Judge and High Court.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Doctor's evidence: Wound roundish 1-1/2 x 1-1/4 communicating with right chest cavity; plugged with cork wadding and cardboard disc of 12 bore cartridge; right fourth and fifth ribs blown off under wound; right lung punctured over 2-1/2 x 2 area; woollen coat bloodstained with corresponding rent blackened charred; shirt bloodstained with corresponding rent blackened. Opinion: Distance 3-4 feet. Deposition from Committing Court used in Sessions under s.509 CrPC; opinion not challenged.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether features of gunshot injury indicate shot fired from close contact (few inches) contradicting eyewitnesses' version of distance, requiring re-appreciation of eyewitness evidence.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court did not consider injury characteristics; features (roundish wound, wadding plugged, ribs and lung blown off, clothes blackened/charred) show gun held in close contact or within 2-3 inches per Zora Singh case and doctor's evidence; eyewitnesses claimed different distance, so did not witness occurrence.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Zora Singh v. State of Punjab (Criminal Appeal No. 81 of 1957, 10.5.1957)"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Wound size (1-1/2 x 1-1/4) indicates shot from about a yard, per forensic texts (Sir Sidney Smith, Major Sir Gerald Burrard, Lyons, Taylor); not contact shot.",
      "addresses_issue": "i1",
      "key_observation": "Far from supporting contact shot, wound size indicates yard distance."
    },
    {
      "id": "cr2",
      "text": "Blackening/char on clothes not indicative of few inches; possible up to yard or yard and half per Taylor; no blackening/burning on skin.",
      "addresses_issue": "i1",
      "key_observation": "Burning marks on clothes consistent with yard distance."
    },
    {
      "id": "cr3",
      "text": "Wad lodged in wound consistent with near discharge up to yard per Glaister and Sir Sidney Smith.",
      "addresses_issue": "i1",
      "key_observation": "Wad entry not limited to few inches."
    },
    {
      "id": "cr4",
      "text": "Blowing off of ribs/lung indicates gas entry (close range) but inconsistent with wound size measurement; prefer wound size over this description; accept doctor's unchallenged opinion of 3-4 feet.",
      "addresses_issue": "i1",
      "key_observation": "Overall features support 3-4 feet distance."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Injury features do not indicate close-range shot; eyewitness evidence reliable; no reason to interfere with High Court's assessment.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Zora Singh v. State of Punjab",
      "citation": "Criminal Appeal No. 81 of 1957 (Judgment 10.5.1957)",
      "treatment": "referred",
      "relevance": "Cited by appellant for close-range shot inference from injury features"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 302"
      ],
      "relevance": "Offence of murder for which appellant convicted"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "Section 509"
      ],
      "relevance": "Doctor's deposition from Committing Court treated as evidence in Sessions Court"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; conviction under s.302 IPC and death sentence confirmed; no interference with High Court's assessment of evidence.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "we have come to the conclusion that the doctors opinion as given in his examination-in-chief, which was not challenged in cross- examination before the Committing Magistrate, that the shot may have been fired about three to four feet away should be accepted as correct.",
      "speaker": "court",
      "significance": "Court accepts doctor's distance opinion after analysis"
    },
    {
      "text": "There is thus some apparent inconsistency between what is indicated by the size of the wound and what the doctor has described as the blowing off of the ribs and a part of the right lung.",
      "speaker": "court",
      "significance": "Resolves apparent conflict in injury evidence"
    }
  ],
  "_case_id": "1962_432",
  "_label": 0,
  "_text_length": 10911,
  "_extracted_at": "2026-02-10T20:02:26.269654"
}