{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Bombay v. Shoorji Vallabhdas and Co.",
    "case_year": 1958,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee firm consisted of three partners, Shoorji Vallabhdas and his two sons, Pratapsinh and Vikramsinh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The assessee firm was the managing agents of several shipping companies including the Malabar Steamship Co. Ltd., and the New Dholera Steamships Ltd.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Agreement with Malabar Steamship Co. Ltd. on September 16, 1938, modified on December 7, 1943; with New Dholera Steamships Ltd. on June 8, 1946. Entitled to 10 per cent. of the freight charged as commission.",
      "type": "background",
      "date": "1938-09-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Between April 1, 1947, and December 31, 1947, commission at 10 per cent. of freight: Rs. 1,71,885 from Malabar Steamship Co. Ltd. and Rs. 2,56,815 from New Dholera Steamships Ltd. Credited in books of assessee firm to itself with corresponding debit to shipping companies.",
      "type": "material",
      "date": "1947-04-01 to 1947-12-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In 1947, the assessee firm floated two private limited companies: Shoorji Vallabhdas Ltd. and Pratapsingh Ltd.",
      "type": "background",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On November 20, 1947, assessee firm expressed desire to resign from managing agency and have the two private limited companies appointed on same terms.",
      "type": "material",
      "date": "1947-11-20",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Two shareholders of Malabar Steamship Co. Ltd. objected on November 27, 1947, suggesting commission be 10 per cent. of profits or 2 1/2 per cent. of freight.",
      "type": "material",
      "date": "1947-11-27",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Board of Malabar Steamship Co. Ltd. invited assessee firm to offer reduction to 2 1/2 per cent. of freight for current and future years.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Assessee firm offered: whilst insisting on full right, voluntarily agree to reduction to 2 1/2 per cent. of total freight for current and future years as mutually agreed.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Similar procedure followed for New Dholera Steamships Ltd.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On December 30, 1947, extraordinary general meetings held; two private limited companies appointed managing agents from January 1, 1948. Offer accepted.",
      "type": "material",
      "date": "1947-12-30",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "At annual general meetings in December 1948, commission reduced from 10 per cent. to 2 1/2 per cent. of freight.",
      "type": "material",
      "date": "1948-12",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Assessee firm gave up 75 per cent. of earnings: Rs. 1,36,903 (Malabar) and Rs. 2,00,625 (New Dholera).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Assessment year 1948-49, previous year ending March 31, 1948.",
      "type": "procedural",
      "date": "1948-04-01 to 1948-03-31",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Income-tax Officer and Appellate Assistant Commissioner: larger commission accrued during previous year, assessable; amount given up not expenditure u/s 10(2)(xv).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Appellate Tribunal: Accountant Member for rejection; Judicial Member and President for assessee - agreement to reduce during account year, larger income neither accrued nor received.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Two questions referred to High Court at instance of Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Bombay High Court judgment dated October 1, 1958: first question negative, declined second. Certified fit for appeal u/s 66A(2).",
      "type": "procedural",
      "date": "1958-10-01",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the two sums of Rs. 1,36,903 and Rs. 2,00,625 are income of the previous year ended March 31, 1948?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If yes to i1, whether they represent an item of expenditure permissible under section 10(2)(xv) of the Indian Income-tax Act, 1922?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Income had already accrued to the assessee firm in the year of account, and was thus assessable.",
      "supporting_facts": [
        "f4",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Arrangement amounted to a voluntary gift by the assessee firm to the shipping companies.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Books kept on mercantile basis showed commission as each amount of freight entered.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Managed companies dealt with accounts only in December 1948, after previous year; subsequent events do not alter position.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Events during account year sufficient to show income neither accrued nor received so as to become assessable.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8",
        "f9",
        "f11"
      ],
      "legal_basis": "Commissioner of Income-tax v. Chamanlal Mangaldas Co."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Facts almost identical to Commissioner of Income-tax v. Chamanlal Mangaldas Co.; principle applies: right to commission ceased under original agreement during previous year.",
      "addresses_issue": "i1",
      "key_observation": "Larger sum only hypothetical income if old agreement continued."
    },
    {
      "id": "cr2",
      "text": "Income tax on income; if no income results, no tax, despite book entry of hypothetical income.",
      "addresses_issue": "i1",
      "key_observation": "Substance over form: accrual or receipt based on actual income."
    },
    {
      "id": "cr3",
      "text": "Where income received and later given up but remains income of recipient, tax payable; but here income did not result at all.",
      "addresses_issue": "i1",
      "key_observation": "No accrual or receipt of larger income."
    },
    {
      "id": "cr4",
      "text": "Agreements within previous year replaced earlier ones, altered rate; income consisted of lesser amounts.",
      "addresses_issue": "i1",
      "key_observation": "Book entry not income unless actually resulted."
    },
    {
      "id": "cr5",
      "text": "Not a gift; reduction part of agreement to secure long-term managing agency for floated companies.",
      "addresses_issue": "i1",
      "key_observation": "High Court right."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Larger income neither accrued nor was received by assessee firm.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax v. Chamanlal Mangaldas Co.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Bombay High Court decision approved by Supreme Court; identical facts, income neither accrued nor received due to agreement during previous year reducing commission."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "66A(2)",
        "10(2)(xv)"
      ],
      "relevance": "Certificate for appeal; permissibility of expenditure if income accrued."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Bombay High Court: answered first question in negative; larger commission neither accrued nor received in previous year 1948-49.",
    "relief_granted": "Assessment reduced by deleting extra commission.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Income tax is a levy on income... if income does not result at all, there cannot be a tax, even though in book-keeping, an entry is made about a hypothetical income which does not materialize.",
      "speaker": "court",
      "significance": "Core principle distinguishing accrual/receipt from hypothetical book entries."
    },
    {
      "text": "A mere book-keeping entry cannot be income, unless income has actually resulted.",
      "speaker": "court",
      "significance": "Rejects reliance on mercantile accounting entries alone."
    }
  ],
  "_case_id": "1962_18",
  "_label": 0,
  "_text_length": 9886,
  "_extracted_at": "2026-02-10T19:56:36.129567"
}