{
  "metadata": {
    "case_name": "Pratap Singh & Bachan Singh v. Gurbaksh Singh",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das",
      "Raghubar Dayal"
    ],
    "case_number": "Criminal Appeals Nos. 128 and 129 of 1959",
    "date_of_judgment": "1962-01-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Gurbaksh Singh respondent was a Forester in the Punjab Forest Department.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Pratap Singh appellant in Criminal Appeal No. 128 of 1959 was at the relevant time Chief Conservator of Forests Punjab.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Bachan Singh appellant in Criminal Appeal No. 129 of 1959 was Divisional Forest Officer Amritsar.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In the year 1950 the respondent supplied three lacs cubic feet of timber to the various ordnance Depots under orders of the then Chief Conservator of Forests.",
      "type": "material",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In 1954 the then Chief Conservator of Forests sent a letter to the respondent alleging that there had been a short supply in the timber which was sent to the Ordnance Depot at Chhoke and that there had been a loss of Rs. 11,366 to the Government.",
      "type": "material",
      "date": "1954",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "By an order conveyed in a letter dated July 16, 1956 the State Government directed the Chief Conservator of Forests to recover ten per cent. of the loss i.e. Rs. 1,136 and odd annas from the respondent Gurbaksh Singh.",
      "type": "material",
      "date": "1956-07-16",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The letter further stated that the recovery sought to be made from the salary of the respondent was in accordance with the rules contained in the Punjab Civil Services Punishment and Appeal Rules 1952 and that an opportunity had already been given to the Forester to submit an explanation and the order for recovery was made after considering his explanation.",
      "type": "procedural",
      "date": "1956-07-16",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Gurbaksh Singh then instituted a suit in the Court of the Senior Subordinate Judge Amritsar for a declaration that the order of recovery made against him was void and without effect.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The suit was followed by a petition under Art. 226 of the Constitution which was dismissed by the Punjab High Court on May 20 1957.",
      "type": "procedural",
      "date": "1957-05-20",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Circular letter dated January 25 1953 issued by the Chief Secretary to the Punjab Government stating that Government servants should seek redress from departmental and Governmental authorities for grievances arising out of employment or conditions of service before going to courts even if legally admissible otherwise contrary to official propriety and subversive of good discipline justifying disciplinary action.",
      "type": "background",
      "date": "1953-01-25",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "When the summons in the suit was served on the State Government the Under Secretary to the said Government in the Forest and Animal Husbandry Departments sent a memorandum to the Chief Conservator of Forests drawing attention to the circular letter of January 25 1953 and stating that respondent had not exhausted departmental remedies and was liable to disciplinary action and asking what action proposed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On receipt of this memorandum appellant Pratap Singh sent a copy thereof to the Conservator of Forests South Circle and directed that the respondent should be proceeded with in accordance with the instructions aforesaid and a copy of the proceedings recorded and orders passed forwarded to him.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On receipt of the said orders the Conservator of Forests South Circle passed an office order appointing Bachan Singh to hold an enquiry against the respondent for having contravened the instructions contained in the circular letter.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Bachan Singh drew up a charge-sheet against the respondent asking him to submit an explanation in writing within 15 days stating that the respondent had gone to a court of law before exhausting all his departmental remedies and this was contrary to official propriety and subversive of good discipline.",
      "type": "procedural",
      "date": "1957-08-30",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On September 14 1957 the respondent made an application to the High Court that the two appellants had committed contempt of court punishable under s. 3 of the Contempt of Courts Act 1952 alleging that the charge-sheet interfered with his legal rights to seek redress in court and exerted pressure to restrain him from pressing his suit obstructing judicial process in the pending suit.",
      "type": "procedural",
      "date": "1957-09-14",
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "Two petitions filed on September 14 1957 giving rise to Cr. Nos. 20 and 27 of 1957 one regarding writ petition another regarding suit.",
      "type": "procedural",
      "date": "1957-09-14",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Punjab High Court on November 5 1958 found appellants guilty under s. 3 Contempt of Courts Act 1952 directed them to abandon the departmental proceedings against respondent and warned them against complying with the circular instructions.",
      "type": "procedural",
      "date": "1958-11-05",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Appeals to Supreme Court on certificates granted by Punjab High Court under Art. 134(1)(c).",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the departmental proceedings initiated against the respondent for approaching court without exhausting departmental remedies constituted contempt of court by interfering with the course of justice in the pending suit in the Court of Senior Subordinate Judge Amritsar.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the contempt petition specified the correct proceeding (suit vs writ petition).",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the circular letter imposed an absolute ban or merely required exhaustion of remedies and thus did not interfere with course of justice.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether appellant Pratap Singh took action beyond endorsing the memorandum sufficient for contempt.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The contempt petition dated September 14 1957 referred to interference with the writ petition dismissed on May 20 1957 while charge-sheet was on August 30 1957; High Court convicted for interference with suit instead constituting different offence.",
      "supporting_facts": [
        "f9",
        "f14",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Circular letter did not impose absolute ban but required exhaustion of departmental remedies first; action was for propriety and discipline not interference with course of justice in pending suit.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Appellant Pratap Singh took no action beyond endorsing the Under Secretary's memorandum.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellants framed and served charge-sheet and held enquiry tantamount to interfering with legal rights to seek court redress exerting pressure to restrain pressing the suit obstructing judicial process in pending suit subordinate to High Court.",
      "supporting_facts": [
        "f12",
        "f13",
        "f14",
        "f15"
      ],
      "legal_basis": "Section 3 Contempt of Courts Act 1952"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Two petitions filed on Sep 14 1957 one for writ one for suit clearly alleging interference with suit; first point overruled.",
      "addresses_issue": "i2",
      "key_observation": "High Court had both petitions before it."
    },
    {
      "id": "cr2",
      "text": "Circular contained executive instructions not rule of service; question is propriety of action during pending litigation; proceeding put pressure on respondent to withdraw suit or face disciplinary action having tendency to interfere with course of justice constituting contempt.",
      "addresses_issue": "i1",
      "key_observation": "Any conduct tending to interfere with or prejudice parties litigant during litigation is contempt."
    },
    {
      "id": "cr3",
      "text": "Pratap Singh not merely endorsed but directed subordinate to proceed against respondent.",
      "addresses_issue": "i4",
      "key_observation": "Directed institution of proceedings."
    },
    {
      "id": "cr4",
      "text": "Dissent by Dayal J: Charge-sheet for misconduct indiscipline in not exhausting remedies not referring to merits or threatening consequences for continuing suit; no pressure to withdraw; departmental action does not per se constitute contempt; appellants acted in good faith per duty.",
      "addresses_issue": "i1",
      "key_observation": "No real prejudice or substantial interference with due course of justice."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Departmental proceedings against government servant for approaching court without exhausting remedies during pendency of suit has tendency to coerce withdrawal constituting contempt of court even if per executive instructions.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Appeals dismissed upholding High Court finding of guilt under s.3 Contempt of Courts Act 1952.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Circumstance of complying with circular relevant to sentence not defence.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Thomas",
      "citation": "1930 2 Ch. D. 368",
      "treatment": "distinguished",
      "relevance": "In instant case departmental enquiry did not constitute parallel enquiry interfering with litigation."
    },
    {
      "case_name": "Saibal Kumar Gupta v. B. K. Sen",
      "citation": "1961 3 SCR 460",
      "treatment": "applied",
      "relevance": "Departmental enquiry not parallel to pending court matter not interfering with course of justice."
    },
    {
      "case_name": "Shankar Lal Sharma v. M. S Bisht",
      "citation": null,
      "treatment": "followed",
      "relevance": "Threat or action to induce forego civil court assistance is contempt."
    },
    {
      "case_name": "S. S. Roy v. State of Orissa",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Magistrate misconceiving powers not contempt without wilful culpability; unlike executives pressuring during suit."
    },
    {
      "case_name": "Webster v. Bakewell Rural District Council",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Landlord exercising legal rights honestly not contempt."
    },
    {
      "case_name": "Hrishikesh Sanyal v. A. Bagchi",
      "citation": null,
      "treatment": "referred",
      "relevance": "Recourse to other judicial proceedings during pendency not contempt."
    },
    {
      "case_name": "Radhey Lal v. Niranjan Nath",
      "citation": null,
      "treatment": "referred",
      "relevance": "Recourse to law even causing loss not contempt."
    },
    {
      "case_name": "Baldeo Sahai v. Shiva Datt",
      "citation": null,
      "treatment": "referred",
      "relevance": "Notice demanding damages or face suit not contempt."
    },
    {
      "case_name": "Kamta Prasad v. Ram Agyan",
      "citation": null,
      "treatment": "referred",
      "relevance": "Settlement offer suggesting withdraw litigation and threaten legal proceedings not contempt."
    },
    {
      "case_name": "Cheriyan Joseph v. Dr. James",
      "citation": null,
      "treatment": "followed",
      "relevance": "Threat to excommunicate for persisting in suit exercising legal rights not contempt."
    },
    {
      "case_name": "Perea v. The King",
      "citation": null,
      "treatment": "referred",
      "relevance": "Good faith action in duty without obstructing justice not contempt."
    },
    {
      "case_name": "Rizwan-ul-Hasan v. The State of Uttar Pradesh",
      "citation": null,
      "treatment": "referred",
      "relevance": "Contempt jurisdiction not invoked unless real prejudice substantial interference."
    },
    {
      "case_name": "Bradima Prakash Sharma v. The State of Uttar Pradesh",
      "citation": null,
      "treatment": "referred",
      "relevance": "Contempt protects public confidence in administration of justice."
    },
    {
      "case_name": "In re the South Shields Thames Street Clearance Order",
      "citation": "1931 1",
      "treatment": "referred",
      "relevance": "Publications deterring appeals not contempt extending jurisdiction."
    },
    {
      "case_name": "In re The William Thomas Shipping Co. H. Dillon Sons. Ltd. v. The Company, In re Sir Robert Thomas",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Injurious misrepresentations against party may cause compromise but not here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Contempt of Courts Act, 1952",
      "sections": [
        "Section 3"
      ],
      "relevance": "Offence of contempt for interfering with course of justice; appellants found guilty."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 134(1)(c)",
        "Article 226"
      ],
      "relevance": "Certificate for appeal; writ petition dismissed."
    },
    {
      "name": "Punjab Civil Services (Punishment and Appeal) Rules, 1952",
      "sections": [],
      "relevance": "Recovery from salary per rules after explanation considered."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "Section 144"
      ],
      "relevance": "Distinguished case of magistrate order."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 497"
      ],
      "relevance": "Referred in Saibal Kumar Gupta case."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Majority (K. Das J.) dismissed the appeals upholding Punjab High Court judgment convicting appellants of contempt under s.3 Contempt of Courts Act 1952 for initiating departmental proceedings against respondent during pendency of his suit; directed to abandon proceedings and warned against complying with circular; Dayal J. dissented allowing appeals.",
    "relief_granted": "Upheld High Court direction to abandon departmental proceedings and warning.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"What after all is contempt of court? To speak generally contempt of court may be said to be constituted by any conduct that tends to bring the authority and administration of the law into disrespect or disregard or to interfere with or prejudice parties litigant or their witnesses during the litigation.\"",
      "speaker": "court",
      "significance": "Defines contempt focusing on interference during litigation."
    },
    {
      "text": "\"From the practical point of view the institution of the proceedings at a time when the suit was pending could only be to put pressure on the respondent to withdraw his suit or face the consequences of disciplinary action. This in our opinion undoubtedly amounted to contempt of court.\"",
      "speaker": "court",
      "significance": "Key reasoning for finding tendency to interfere."
    },
    {
      "text": "\"The jurisdiction in contempt is not to be invoked unless there is real prejudice which can be regarded as a substantial interference with the due course of justice.\"",
      "speaker": "court",
      "significance": "Dissent emphasizing no real prejudice in departmental action."
    }
  ],
  "_case_id": "1962_99",
  "_label": 0,
  "_text_length": 45462,
  "_extracted_at": "2026-02-10T19:58:07.069360"
}