{
  "metadata": {
    "case_name": "Sub-Divisional Officer, Sirsa & Naib Tehsildar v. Gurbachan Singh",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das, J.",
      "Subba Rao, J.",
      "Raghubar Dayal, J."
    ],
    "case_number": "Criminal Appeal No. 187 of 1959",
    "date_of_judgment": "1962-02-08"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Budh Singh, a displaced person, was allotted land in village Jagmalera, Tehsil Sirsa, District Hissar, which was forcibly occupied by respondent Gurbachan Singh, who was not a legitimate allottee.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On May 9, 1958, first appellant (Sub-Divisional Officer, Sirsa) made an order that Budh Singh and other allottees would be given possession of allotted land on May 20, 1958.",
      "type": "material",
      "date": "1958-05-09",
      "source": "appellants"
    },
    {
      "id": "f3",
      "text": "On May 16, 1958, Gurbachan Singh and others filed petitions under Art. 226 challenging the dispossession, Chief Justice issued stay of delivery of possession till May 19, 1958.",
      "type": "procedural",
      "date": "1958-05-16",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Notice of stay order dated May 16, 1958, was communicated to appellants on May 19, 1958.",
      "type": "admitted",
      "date": "1958-05-19",
      "source": "appellants"
    },
    {
      "id": "f5",
      "text": "On May 19, 1958, Division Bench extended stay order till May 23, 1958; official notice not received by appellants till May 21, 1958.",
      "type": "material",
      "date": "1958-05-19",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On May 20, 1958, at 6:30 a.m., Bir Singh and Avtar Singh informed second appellant (Naib Tehsildar) by telephone via advocate that stay extended till May 23.",
      "type": "disputed",
      "date": "1958-05-20",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "On May 20, 1958, at 7:40 a.m., written application by Didar Singh (another case) stating High Court stayed possession till May 23 presented to second appellant, supported by affidavit at 8:15 a.m.",
      "type": "admitted",
      "date": "1958-05-20",
      "source": "appellants"
    },
    {
      "id": "f8",
      "text": "Second appellant consulted first appellant; first appellant endorsed application to Tehsildar at 10 a.m., but second appellant had already left for village.",
      "type": "admitted",
      "date": "1958-05-20",
      "source": "appellants"
    },
    {
      "id": "f9",
      "text": "In village Jagmalera, appellants shown application with endorsement and wording of stay order; second appellant proceeded with dispossession of Gurbachan Singh and handed possession to Budh Singh.",
      "type": "disputed",
      "date": "1958-05-20",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Appellants denied knowledge of extension specifically in Gurbachan Singh's case, only in Didar Singh's; doubted due to enmity between parties.",
      "type": "disputed",
      "date": "1958-05-20",
      "source": "appellants"
    },
    {
      "id": "f11",
      "text": "Respondent alleged no actual dispossession due to standing cotton crop and crowd; second appellant reported delivery of possession.",
      "type": "disputed",
      "date": "1958-05-20",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "On May 27, 1958, respondent applied to Punjab High Court for contempt action against appellants.",
      "type": "procedural",
      "date": "1958-05-27",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Punjab High Court (Falshaw J.) on August 18, 1958, found appellants guilty of contempt, administered warning, directed Rs. 50 costs each to respondent.",
      "type": "procedural",
      "date": "1958-08-18",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether appellants had knowledge of the High Court's stay order extension till May 23, 1958, in respondent's case through interested parties and advocate, sufficient for willful disobedience constituting contempt of prohibitory order without official communication.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether actual dispossession occurred, given standing crop and crowd, to found contempt.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether official communication or service is essential for contempt of prohibitory orders, or knowledge aliunde suffices.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in finding appellants informed of extension in respondent's specific case; knew only of Didar Singh's case; no positive evidence of knowledge.",
      "supporting_facts": [
        "f7",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Absence of official communication; unsafe to act on interested parties' info due to enmity; required official service for willful disobedience.",
      "supporting_facts": [
        "f5",
        "f10"
      ],
      "legal_basis": "Oswald on Contempt; cases like In re Holt, Dwijendra Krishan Datta"
    },
    {
      "id": "pa3",
      "text": "No actual dispossession; respondent admitted crop and crowd prevented it; fictitious report only.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Offered apology if held wrong; contempt proceedings extraordinary, not for trifling acts.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "M. Shareef v. Hon'ble Judges of High Court of Nagpur"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellants informed on May 20 morning by Bir Singh, Avtar Singh, Didar Singh's application/affidavit, Ganga Bishan advocate that stay extended in all Jagmalera cases till May 23; yet dispossessed respondent.",
      "supporting_facts": [
        "f6",
        "f7",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "On affidavits, reasonable inference appellants informed of extension in all cases, not just Didar Singh's; Ganga Bishan stated it related to all Jagmalera cases; no counter-affidavit denying specifically.",
      "addresses_issue": "i1",
      "key_observation": "Argument that knowledge only in one case not urged in High Court; affidavits show knowledge in all cases."
    },
    {
      "id": "cr2",
      "text": "For prohibitory orders, no need for official service if notice aliunde (e.g., by advocate); appellants as officers bound to obey known valid order; no real justification to doubt authenticity despite enmity.",
      "addresses_issue": "i3",
      "key_observation": "Duty to uphold law; did not proceed in Didar Singh's case."
    },
    {
      "id": "cr3",
      "text": "Willful disobedience even if honest belief no official comm required action; distinguished mandatory orders.",
      "addresses_issue": "i1",
      "key_observation": "Oswald: notice aliunde suffices for prohibitory orders."
    },
    {
      "id": "cr4",
      "text": "Actual possession delivered per appellant No.2's affidavit; contempt despite no commitment to jail.",
      "addresses_issue": "i2",
      "key_observation": "Took prohibited action."
    },
    {
      "id": "cr5",
      "text": "Dissent (Dayal J.): No conviction if honest belief no order without official comm; no willful disobedience if existence doubted; respondent's petition paras 21-22 show no actual dispossession alleged.",
      "addresses_issue": "i1",
      "key_observation": "Petition imprecise; affidavits insufficient proof of specific knowledge; best evidence (applications) absent."
    },
    {
      "id": "cr6",
      "text": "Dissent: Knowledge via interested parties/advocate not unimpeachable; public officers not to take at face value amid enmity; no clean hands by respondent.",
      "addresses_issue": "i3",
      "key_observation": "Telegram cases involved court officers; proof beyond doubt needed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Knowledge of prohibitory stay order aliunde (via advocate/application) suffices for contempt without official service; appellants had such knowledge in all cases, committed willful disobedience.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No interference with High Court's warning and costs; honest belief relevant to sentence, not defense.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "N. Baksi v. O. K. Ghosh",
      "citation": null,
      "treatment": "followed",
      "relevance": "Distinction: prohibitory orders need no service if notice aliunde."
    },
    {
      "case_name": "M. Shareef v. Hon'ble Judges of High Court of Nagpur",
      "citation": "1955 1 S.C.R. 757",
      "treatment": "followed",
      "relevance": "Cannot justify and apologize in contempt."
    },
    {
      "case_name": "In re Holt an Infant, ex-parte Lingley",
      "citation": "1879 11 Ch. D. 168",
      "treatment": "distinguished",
      "relevance": "Mandatory orders require service."
    },
    {
      "case_name": "In re Tuck, March v. Loosemore",
      "citation": "1906 1 Ch. 692",
      "treatment": "distinguished",
      "relevance": "Payment orders require service."
    },
    {
      "case_name": "Dwijendra Krishan Datta v. Surendra Nath Nag Choudhury",
      "citation": "A.I.R. 1927 Calcutta 548",
      "treatment": "distinguished",
      "relevance": "Mandatory orders."
    },
    {
      "case_name": "Gordon v. Gordon",
      "citation": "1946 1 All E.R. 246",
      "treatment": "distinguished",
      "relevance": "Service required for certain orders."
    },
    {
      "case_name": "In re Bryant",
      "citation": "L.R. 1876 4 Ch. D. 98",
      "treatment": "referred",
      "relevance": "Telegram from solicitor suffices as notice."
    },
    {
      "case_name": "Ex parte Langley, Ex parte Smith, In re Bishop",
      "citation": "L.R. 1879 13 Ch. D. 110",
      "treatment": "referred",
      "relevance": "Telegram not always sufficient without belief; doubt benefits contemner."
    },
    {
      "case_name": "Kimpton v. Eve",
      "citation": "1813 2 V. & B. 349",
      "treatment": "followed",
      "relevance": "Positive oath of no belief suffices."
    },
    {
      "case_name": "The Seraglio",
      "citation": "L.R. 1885 10 P.D. 120",
      "treatment": "referred",
      "relevance": "Notice by court officer via telegram binds."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Writ petitions filed challenging dispossession."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed by majority (Das and Subba Rao JJ.); appellants guilty of contempt for willful disobedience of High Court's prohibitory stay order despite knowledge aliunde; no interference with High Court's warning and Rs. 50 costs each. Dayal J. dissented, finding no contempt.",
    "relief_granted": "None to appellants; High Court order upheld.",
    "costs": "High Court directed appellants to pay Rs. 50 each as costs of respondent; no change."
  },
  "key_quotes": [
    {
      "text": "\"In order to justify committal for breach of a prohibitive order it is not necessary that the order should have been served upon the party against whom it has been granted, if it be proved that he had notice of the order aliunde.\"",
      "speaker": "court",
      "significance": "Core rule applied: knowledge suffices for prohibitory orders."
    },
    {
      "text": "\"The appellants were officers whose duty it was to uphold the law and if they knew that a valid order had been made by the High Court staying delivery of possession, they disobeyed that order at their peril.\"",
      "speaker": "court",
      "significance": "Duty of public officers emphasized."
    },
    {
      "text": "\"No conviction for committing contempt of Court can be based on the finding... that the appellants delivered possession believing that they were not bound to hold their hands in the absence of the official communication.\"",
      "speaker": "Raghubar Dayal, J.",
      "significance": "Dissent: honest belief negates willfulness."
    }
  ],
  "_case_id": "1962_243",
  "_label": 0,
  "_text_length": 52156,
  "_extracted_at": "2026-02-10T20:00:26.027730"
}