{
  "metadata": {
    "case_name": "Petitioner Company v. State of Bihar",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "AYYANGAR J."
    ],
    "case_number": "Writ Petition No. 19 of 1961",
    "date_of_judgment": "1962-03-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The property is a plot of land within the municipal limits of Hazaribagh in Bihar together with certain buildings and structures thereon. The property originally belonged to the Ramgarh Raj.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On January 16, 1948 the Raja of Ramgarh granted a lease of this property in favour of his younger brother Basant Narain for a term of 99 years.",
      "type": "material",
      "date": "1948-01-16",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On April 7, 1949 the Raja settled his reversionary interest in the property for the benefit of a Trust under a registered deed of settlement.",
      "type": "material",
      "date": "1949-04-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The estate of Ramgarh was notified under s. 3(1) of the Bihar Land Reforms Act (Bihar I of 1950) for being taken over by the Government of Bihar and in consequence the estate statutorily vested in the State on and from November 3, 1951.",
      "type": "material",
      "date": "1951-11-03",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "There is a dispute as to the manner in which this property was being enjoyed by the then proprietors.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The State contends that the buildings on the property which were the subject of the lease dated January 16, 1948 were being used by the Raj primarily as an office or kutcheri for the collection of rent, a fact which however was disputed.",
      "type": "disputed",
      "date": null,
      "source": "respondent | court"
    },
    {
      "id": "f7",
      "text": "On November 27, 1955 a notice was issued to Basant Narain to show cause why the lease executed in his favour on January 16, 1948 should not be set aside under the power conferred upon the Collector by s. 4(h).",
      "type": "procedural",
      "date": "1955-11-27",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Basant Narain submitted his objections and stated that the leased properties were not covered by s. 4(b).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Before the enquiry was completed, Basant Narain surrendered his leasehold interest to the assignee of the reversion, viz., the Trust, by a registered deed dated January 1, 1957.",
      "type": "material",
      "date": "1957-01-01",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On June 1, 1959 the Trust which thus became entitled to the entire interest in the property in its turn leased the property to one Bansidhar.",
      "type": "material",
      "date": "1959-06-01",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On July 3, 1959 Bansidhar assigned his leasehold interest in the property to the petitioner company.",
      "type": "material",
      "date": "1959-07-03",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On November 13, 1959 the Collector passed an order cancelling the lease.",
      "type": "procedural",
      "date": "1959-11-13",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The petitioner who laid claim to a title to the property under the assignment in its favour dated July 3, 1959, applied to the Collector to set aside his order both on the merits and also on the ground that the order of November 13, 1959 had been passed to its prejudice without giving it an opportunity to make its objections even though by that date it had obtained title to the property and therefore a locus standi to be heard.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "The State of Bihar set aside the order of the Collector and directed a re-enquiry.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "On August 9, 1960 the petitioner filed a petition before the Collector on August 9, 1960 setting out its case in the re-enquiry.",
      "type": "procedural",
      "date": "1960-08-09",
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "During the progress of this last enquiry that the petitioner moved this Court by the present petition.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "When the petitioner applied to this Court for a stay of proceedings before the Collector, this Court passed an order permitting the enquiry to continue though it stayed the passing of any order by the State Government.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the petition under Art. 32 involves any question of the infringement of any fundamental right under Arts.19(1)(f) and 31(1).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the property satisfies the conditions on which s. 4(h) of the Bihar Land Reforms Act is attracted, specifically whether the land is raiyati land and whether the buildings were used as kutcheri.",
      "framed_by": "court | petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The land on which the buildings stand is raiyati land and therefore could not be taken possession of by the State under the Bihar Land Reforms Act.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "Bihar Land Reforms Act"
    },
    {
      "id": "pa2",
      "text": "The buildings standing thereon were previously used for the residential purpose of the Raja and his family and not as a kutcheri.",
      "supporting_facts": [
        "f1",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The Collector passed order without giving petitioner opportunity to be heard despite having title.",
      "supporting_facts": [
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The lease dated January 16, 1948 was made with the object of defeating provisions of the Act, causing loss to State or obtaining higher compensation, and buildings were used primarily as office or kutcheri for collection of rent.",
      "supporting_facts": [
        "f2",
        "f4",
        "f6"
      ],
      "legal_basis": "Bihar Land Reforms Act s.4(h)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "This petition under Art. 32 is entirely devoid of merits and deserves to be dismissed as misconceived as it does not involve any question of the infringement of any fundamental right.",
      "addresses_issue": "i1",
      "key_observation": "The petition is substantially for writ of prohibition directing Collector not to proceed with enquiry under s.4(h) and writ of certiorari to quash proceedings."
    },
    {
      "id": "cr2",
      "text": "The constitutional validity of s.4(h) is not challenged and the case turns on whether the property satisfies the conditions on which the section is attracted.",
      "addresses_issue": "i2",
      "key_observation": "The enquiry has been proceeding before the Collector in regard to these two points."
    },
    {
      "id": "cr3",
      "text": "Before a party can complain of an infringement of his fundamental right to hold property he must establish that he has title to that property and if his title itself is in dispute and is the subject of adjudication in proceedings legally constituted, he cannot obviously put forward any claim based on his title until as a result of that enquiry he is able to establish his title.",
      "addresses_issue": "i1",
      "key_observation": "The question whether petitioner has any right to the property which it claims depends wholly on questions of fact which are plainly within the jurisdiction of the authorities constituted under the Bihar Land Reforms Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Petition under Art. 32 is misconceived and does not involve infringement of fundamental rights as title is in dispute and must be established in statutory proceedings first.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 19(1)(f)",
        "Article 31(1)"
      ],
      "relevance": "Petition under Art.32 for enforcement of fundamental rights under Arts.19(1)(f) and 31(1); court holds no infringement as title disputed."
    },
    {
      "name": "Bihar Land Reforms Act (Bihar I of 1950)",
      "sections": [
        "Section 3(1)",
        "Section 4(h)",
        "Section 4(b)"
      ],
      "relevance": "Estate vested in State under s.3(1); Collector empowered under s.4(h) to annul transfers including leases after Jan 1, 1946 if made to defeat Act; enquiry ongoing on applicability."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court dismissed the writ petition under Art.32 as misconceived, holding that no fundamental right is infringed since the petitioner's title to the property is disputed and under enquiry by the Collector under the Bihar Land Reforms Act. The petitioner must establish title in those proceedings first.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We consider that this petition under Art. 32 of the Constitution is entirely devoid of merits and deserves to be dismissed as misconceived as it does not involve any question of the infringement of any fundamental right.",
      "speaker": "court",
      "significance": "Core holding dismissing the petition."
    },
    {
      "text": "Before a party can complain of an infringement of his fundamental right to hold property he must establish that he has title to that property and if his title itself is in dispute and is the subject of adjudication in proceedings legally constituted, he cannot obviously put forward any claim based on his title until as a result of that enquiry he is able to establish his title.",
      "speaker": "court",
      "significance": "Explains why Art.32 petition premature."
    }
  ],
  "_case_id": "1962_119",
  "_label": 0,
  "_text_length": 7462,
  "_extracted_at": "2026-02-10T19:57:48.300232"
}