{
  "metadata": {
    "case_name": "Tehl Singh and Arjan Singh v. Narain Singh and others",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeals Nos. 223 and 224 of 1961",
    "date_of_judgment": "1963-02-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Hamam Singh was the last male holder of the estate in village Umri Ana, tehsil Zira, District Ferozepore, Punjab. Harnam Singh, grandson of Kahan Singh, died leaving two daughters Mst. Tejo and Mst. Gejo, who inherited equally.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Mst. Tejo died without issue, and entire estate entered in name of Mst. Gejo by revenue authorities.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Mst. Gejo died in 1942 without issue.",
      "type": "material",
      "date": "1942",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "By order dated September 6, 1945, Assistant Collector directed estate be entered in names of Narain Singh s/o Dasaundha Singh and Bakshish Singh, Ajaib Singh, Mukhtar Singh sons of Ramji Singh (plaintiffs, descendants of Ghuda Singh).",
      "type": "procedural",
      "date": "1945-09-06",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "In appeal, Collector of Ferozepore set aside Assistant Collector's order and directed estate entered in names of Tehl Singh and Arjan Singh sons of Mangal Singh (defendants, descendants of Wazir Singh). Commissioner confirmed Collector's order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Plaintiffs (Ghuda Singh descendants) instituted Suit No. 9/1947 in Subordinate Judge, Zira for possession of Harnam Singh's estate barring small area of 8 Kanals 11 Marlas Khasra No. 325 in their possession.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Defendants instituted Suit No. 13/1947 for possession of Khasra No. 325 against plaintiffs.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Ghuda Singh was adopted by maternal uncle Bhan Singh some time before 1856.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Genealogy: Sahib Singh -> Hamir Singh, Wazir Singh, Attar Singh; Hamir Singh -> Chuhar Singh, Ghuda Singh (adopted out), Kahan Singh; etc., leading to plaintiffs from Ghuda Singh line and defendants from Wazir Singh line.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Subordinate Judge held Ghuda Singh ceased to be member of natural family per district custom, plaintiffs could not inherit; relied on 1914 Riwaj-i-am of Ferozepore.",
      "type": "procedural",
      "date": "1956-04-25",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "District Court, Ferozepore affirmed: adopted son has right to inherit collaterally only in adoptive family, not natural.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Punjab High Court in second appeal set aside District Court decree: no evidence of formal adoption, presumed customary appointment of heir; adopted son and descendants not excluded from collaterals in natural family.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Mutation extract Ext. D-5: On Hamir Singh's death, estate initially entered for three sons including Ghuda Singh, but Patwari report May 28, 1884 led to removal of Ghuda Singh's name as he admitted no concern; entered for brothers Kahan Singh and Chuhar Singh.",
      "type": "disputed",
      "date": "1884-05-28",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "On Chuhar Singh's death, property entered for daughter Bishno; on her Karewa remarriage, entered for Rura Singh and Bhola Singh (Kahan Singh sons); Ghuda Singh as Lambardar identified and admitted they were entitled (Ext. D-1).",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "What is the customary law applicable to Jats residing in tehsil Zira, District Ferozepore regarding rights of a son adopted in another family and his descendants to inherit collaterally in the natural family?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "In District Ferozepore, every adoption in Hindu family is formal; per Riwaj-i-am 1914 (Q76-77), adopted son excluded from inheriting in natural family; Ghuda Singh completely severed ties.",
      "supporting_facts": [
        "f8",
        "f10",
        "f11",
        "f13",
        "f14"
      ],
      "legal_basis": "Riwaj-i-am of Ferozepore District 1914; special custom supersedes general custom"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Family governed by Zamindara Riwaj-i-am (general custom); adopted son per custom does not completely sever connections with natural family; descendants not excluded from inheritance to collaterals in natural family.",
      "supporting_facts": [
        "f8",
        "f9",
        "f12"
      ],
      "legal_basis": "Rattigan's Digest of Customary Law for Punjab, Art. 48-52"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under Punjab Laws Act s.5, party asserting custom must prove it; general custom per Rattigan: appointed heir does not lose right to succeed to property in natural family as against collaterals, but not in presence of natural brothers.",
      "addresses_issue": "i1",
      "key_observation": "Customary adoption is personal, not dissolving natural family ties like formal Hindu adoption."
    },
    {
      "id": "cr2",
      "text": "Riwaj-i-am Q76-77 concerns inheritance from natural/adoptive father, not collaterals; no inconsistency with Rattigan on collateral succession in natural family.",
      "addresses_issue": "i1",
      "key_observation": "Prima facie Riwaj-i-am prevails on conflict, but no conflict here on collaterals."
    },
    {
      "id": "cr3",
      "text": "Instances (Ext. D-5, D-1) consistent with general custom: Ghuda excluded from father's estate due to brothers present; Bishno case on remarriage, not proving exclusion from collaterals.",
      "addresses_issue": "i1",
      "key_observation": "No clear instances rebutting general custom; single instances insufficient."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Plaintiffs as descendants of Ghuda Singh entitled to inherit estate of Harnam Singh per general custom; adoption did not exclude them from collateral succession in natural family.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Daya Ram v. Sohel Singh",
      "citation": null,
      "treatment": "followed",
      "relevance": "Burden on party asserting custom to prove it; no presumption in favor of custom over personal law."
    },
    {
      "case_name": "Abdul Hussein Khan v. Bibi Sona Dero",
      "citation": "1917 L.R. 45 I.A. 10",
      "treatment": "followed",
      "relevance": "Affirmed burden to prove custom under Punjab Laws Act s.5."
    },
    {
      "case_name": "Vaishno Ditti v. Rameshri",
      "citation": "1928 L.R. 55 I.A. 107",
      "treatment": "referred",
      "relevance": "Legislature recognizes customs departing from personal law must be proved."
    },
    {
      "case_name": "Mela Singh v. Gurdas",
      "citation": "1922 I.L.R. 3 Lah. 362 F.B.",
      "treatment": "followed",
      "relevance": "Customary adoption creates personal relationship, no dissolution of natural family ties."
    },
    {
      "case_name": "Jagat Singh v. Ishar Singh",
      "citation": "1930 I.L.R. 11 Lah. 615",
      "treatment": "followed",
      "relevance": "Exclusion in presence of natural brothers applies only to father's estate, not collaterals."
    },
    {
      "case_name": "Kanshi Ram v. Situ",
      "citation": "1934 16 Lah. 214",
      "treatment": "followed",
      "relevance": "Supports general custom on appointed heir's rights."
    },
    {
      "case_name": "Rahmat v. Ziledar",
      "citation": "1945 I.L.R. 26 Lah. 540",
      "treatment": "followed",
      "relevance": "Appointed heir does not lose right to natural father's property against collaterals."
    },
    {
      "case_name": "Jai Kapur v. Sher Singh",
      "citation": "1960 3 S.C.R. 975",
      "treatment": "followed",
      "relevance": "Riwaj-i-am presumed correct, prevails over general custom on inconsistency; weaker for females."
    },
    {
      "case_name": "Mt. Subhani v. Nawab",
      "citation": "A.I.R. 1941 P.C. 21",
      "treatment": "referred",
      "relevance": "Riwaj-i-am presumption weak where affecting females' rights."
    }
  ],
  "statutes_cited": [
    {
      "name": "Punjab Laws Act, 1872",
      "sections": [
        "Section 5"
      ],
      "relevance": "Rule of decision: custom if proved and not contrary to justice; else personal law."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals preferred by defendants (Tehl Singh and Arjan Singh), upholding Punjab High Court decree in favor of plaintiffs (Narain Singh et al.) for possession of Harnam Singh's estate per general customary law.",
    "relief_granted": "Plaintiffs entitled to possession as per High Court decree.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"An heir appointed in the manner above described ordinarily does not thereby lose his right to succeed to property in his natural family, as against collaterals, but does not succeed in the presence of his natural brothers.\"",
      "speaker": "court",
      "significance": "Core of Rattigan's Digest Art. 48, general custom applied."
    },
    {
      "text": "\"the tie of kinship with the natural family is not dissolved and the fiction of blood relationship with the members of the new family has no application to the appointed heir.\"",
      "speaker": "court",
      "significance": "Explains nature of customary adoption from Mela Singh v. Gurdas."
    },
    {
      "text": "\"It lies upon the person asserting that he is ruled in regard to a particular matter by custom, to prove that he is so governed, and not by personal law.\"",
      "speaker": "court",
      "significance": "Burden of proof under Punjab Laws Act s.5 from Daya Ram."
    }
  ],
  "_case_id": "1963_219",
  "_label": 0,
  "_text_length": 24440,
  "_extracted_at": "2026-02-10T19:50:19.703170"
}