{
  "metadata": {
    "case_name": "Prosecution v. Manager of Oil Mill",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar J."
    ],
    "case_number": "Criminal Appeal No. 193 of 1961",
    "date_of_judgment": "1963-12-06"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is the Manager of an oil mill.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The mill had a spur gear wheel.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "A workman of the mill while greasing the spur gear wheel which was then in motion had one of his hands caught in it. Eventually that hand had to be amputated.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "The spur gear wheel had a cover which had bolts for fixing it to the base but at the time of the accident the cover was not there, having apparently been removed earlier. There is no evidence to show when it was last in position.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "A guard had been put over the spur gear wheel and it was a proper guard.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The guard was not there at the time of the accident.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The workman said that the guard had been removed by the respondent for repairs.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "The case of the respondent was that the workman had himself removed the guard.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The learned trial Judge was unable to accept either version and acquitted the respondent observing that he could not be held liable if the cover was removed by someone without his consent or knowledge.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The Gujarat High Court in Criminal Appeal No. 367 of 1960 by judgment dated February 9 and 10, 1961, acquitted the respondent.",
      "type": "procedural",
      "date": "1961-02-09",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "There is no dispute that the spur gear wheel was a dangerous machine within the meaning of s. 21(1)(iv)(c).",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the respondent is liable under s. 92 of the Factories Act, 1948 for contravention of s. 21(1)(iv)(c) when the guard was not in position while the machine was in motion, though it was not proved who removed it.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the obligation under s. 21(1)(iv)(c) requires only providing the safeguard or also keeping it in position while the machine is in motion.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether mere removal by someone without knowledge, consent or connivance of the manager provides a defence, or must he prove due diligence.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The obligation under s. 21(1)(iv)(c) is absolute and requires that safeguards shall be kept in position while the parts of machinery are in motion or in use.",
      "supporting_facts": [
        "f4",
        "f6",
        "f11"
      ],
      "legal_basis": "Factories Act, 1948 s. 21(1)(iv)(c), s. 92"
    },
    {
      "id": "pa2",
      "text": "The respondent failed to discharge the onus to show what he had done to ensure the guard was kept in position.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Factories Act, 1948"
    },
    {
      "id": "pa3",
      "text": "Even under s. 101, the manager must prove due diligence to enforce the Act.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Factories Act, 1948 s. 101"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The workman had himself removed the guard.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "In a criminal case, accused not bound to offer explanation; if not established, does not justify conviction.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "No proof that respondent committed default; someone else removed it without his knowledge, consent or connivance; not reasonably foreseeable.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": "Factories Act, 1948 s. 21(1)(iv)(c)"
    },
    {
      "id": "ra4",
      "text": "Statute does not require occupier/manager to always be on lookout for offenders who remove safeguard.",
      "supporting_facts": [],
      "legal_basis": "Factories Act, 1948"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "There is no dispute that the spur gear wheel was dangerous within s. 21(1)(iv)(c), creating obligation to securely fence it and keep the fence in position while in motion.",
      "addresses_issue": "i1",
      "key_observation": "The fact that respondent had provided the guard confirms it was dangerous."
    },
    {
      "id": "cr2",
      "text": "S. 21(1)(iv)(c) requires not only fencing but that safeguards shall be kept in position while machine in motion; here fencing was not there when machine working - admitted fact.",
      "addresses_issue": "i2",
      "key_observation": "Words 'shall be securely fenced' and 'kept in position' impose ongoing duty."
    },
    {
      "id": "cr3",
      "text": "Mere fact that someone else removed safeguard without knowledge/consent/connivance does not always provide defence; duty to keep guard in position when working; onus on respondent to establish no liability.",
      "addresses_issue": "i3",
      "key_observation": "Respondent gave no evidence of steps taken to carry out duty."
    },
    {
      "id": "cr4",
      "text": "Even if guard breaks down for reason not attributable to manager, may not be liable, but statute does not require impossibility; no evidence here.",
      "addresses_issue": "i3",
      "key_observation": "Respondent completely failed to discharge onus."
    },
    {
      "id": "cr5",
      "text": "S. 101 requires proof of due diligence even if actual offender identified; equally required when cannot prove who removed it.",
      "addresses_issue": "i3",
      "key_observation": "Otherwise intention to protect workmen defeated."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Manager liable under s. 92 for contravening s. 21(1)(iv)(c) where guard not kept in position while machine in motion; onus on him to prove discharge of duty.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Obligation under s. 21(1)(iv)(c) includes keeping safeguard in position during operation.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Removal by unknown person without knowledge etc. does not exempt unless due diligence proved.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Factories Act, 1948",
      "sections": [
        "s. 21(1)(iv)(c)",
        "s. 92",
        "s. 101"
      ],
      "relevance": "Imposes duty on manager to securely fence dangerous parts and keep safeguards in position while in motion; punishable offence for contravention; defence requires proof of due diligence."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, judgments of courts below set aside, respondent convicted under s. 92 for contravening s. 21(1)(iv)(c) of Factories Act, 1948, fined Rs. 200.",
    "relief_granted": "Conviction and fine of Rs. 200 imposed on respondent.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"unless they are in such position or of such construction as to be safe to every person employed in the factory as they would be if they were securely fenced... shall be securely fenced by safeguards of substantial construction which shall be kept in position while the parts of machinery they are fencing are in motion or in use.\"",
      "speaker": "court",
      "significance": "Exact text of s. 21(1)(iv)(c) imposing ongoing duty."
    },
    {
      "text": "\"the fencing shall be kept in position while the machine is working. That is the default that has happened here.\"",
      "speaker": "court",
      "significance": "Identifies the specific default committed."
    },
    {
      "text": "\"when the statute says that it will be his duty to keep the guard in position when the machine is working and when it appears that he has not done so, it will be for him to establish that notwithstanding this he was not liable.\"",
      "speaker": "court",
      "significance": "Shifts onus to manager after breach shown."
    },
    {
      "text": "\"he has further to prove that he had used due diligence to enforce the execution of the Act which can only mean... that he exercised due diligence to see that the fence... had not been removed.\"",
      "speaker": "court",
      "significance": "Interprets s. 101 defence requirements."
    }
  ],
  "_case_id": "1963_286",
  "_label": 1,
  "_text_length": 11048,
  "_extracted_at": "2026-02-10T19:51:07.501106"
}