{
  "metadata": {
    "case_name": "Appellant Company v. Workmen",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA J."
    ],
    "case_number": "Civil Appeals Nos. 238 and 818 of 1962",
    "date_of_judgment": "1963-08-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant company engaged in manufacture of aluminium from basic material with factory at J. K. Nagar near Asansol in West Bengal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Dispute arose between appellant and some workmen on question of bonus for year 1957-58, referred to Fifth Industrial Tribunal, West Bengal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "First reference: Case No. VIII-77 of 1959, award dated October 21, 1960, awarding bonus equivalent to three months basic wages inclusive of half month's basic wages already paid voluntarily by company.",
      "type": "procedural",
      "date": "1960-10-21",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Second reference made May 2, 1959: Case No. VIII-93 of 1959, dispute on bonus for 1957-58 among other matters, award dated May 17, 1961.",
      "type": "procedural",
      "date": "1959-05-02",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "In second reference, parties filed joint petitions agreeing to abide by decision in first reference on bonus issue, requesting similar award.",
      "type": "admitted",
      "date": null,
      "source": "petitioner | respondent"
    },
    {
      "id": "f6",
      "text": "Tribunal in second reference ordered same bonus as first reference: three months basic wages for 1957-58.",
      "type": "procedural",
      "date": "1961-05-17",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Tribunal applied Full Bench Formula, calculated available surplus as Rs. 4.63 lacs.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "After three months bonus, company left with Rs. 3.91 lacs available surplus inclusive of income-tax refund on bonus (expenditure Rs. 0.72 lacs).",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Tribunal allowed Rs. 0.43 lacs as return on reserves used as working capital.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Tribunal rejected rehabilitation charge claim altogether.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Company examined Manager, put in statements showing available surplus as nil; rehabilitation figures varied: Rs. 6,27,234 in I & II, Rs. 5,84,534 in III & IV, Rs. 10,25,021 in V & VI.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Assets revalued in 1956 by Committee including Manager; portion of report exhibited; no evidence on multiplier/divisor basis.",
      "type": "disputed",
      "date": "1956",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Reserves used as working capital varied: Rs. 111,74,162 in I,III,V; Rs. 199,56,718 in II,IV,VI due to depreciation reserves Rs. 86 lacs vs Rs. 173,82,556.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Manager stated total wage bill including officers Rs. 90,000; workmen basic wage bill excluding officers Rs. 50,000.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Company voluntarily paid half month's basic wages as bonus.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Tribunal was justified in rejecting claim for rehabilitation charge due to lack of proper evidence.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Tribunal correctly allowed Rs. 0.43 lacs as prior charge for return on reserves used as working capital.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether bonus calculation should use total wage bill of Rs. 90,000 including officers or only workmen's Rs. 50,000.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No justification for rejecting rehabilitation charge claim; challenged Tribunal's view.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "Series of decisions placing burden on employer to prove rehabilitation charge by proper evidence"
    },
    {
      "id": "pa2",
      "text": "Challenged allowance of only Rs. 0.43 lacs for return on reserves used as working capital; claimed higher figures.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Bonus should be based on one month's basic wages of Rs. 90,000 (total including officers) not Rs. 50,000.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Balance-sheet shows current assets minus current liabilities as working capital; reserves used therein.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Croppers Higher Book-Keeping (p.301), Pickles on Accountancy (p.1325)"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Burden on employer to prove rehabilitation charge by proper evidence; company's varying figures, no explanation of multiplier/divisor, no examination of other committee members or basis; justified rejection.",
      "addresses_issue": "i1",
      "key_observation": "Mere statements insufficient without oath testimony testable by cross-examination."
    },
    {
      "id": "cr2",
      "text": "Varying figures for reserves used as working capital show unserious approach; balance-sheet figures need evidence; not total working capital but portion from reserves; no competent witness; Tribunal's Rs. 0.43 lacs allowance erroneous in company's favour.",
      "addresses_issue": "i2",
      "key_observation": "Tendency to show entire reserves as used for working capital is wrong."
    },
    {
      "id": "cr3",
      "text": "Tribunal concerned only with workmen's bonus, not officers; use Rs. 50,000 workmen wage bill; no error.",
      "addresses_issue": "i3",
      "key_observation": "Industrial Tribunal concerned only with workmen's claim."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Tribunal justified in rejecting rehabilitation charge for lack of evidence; does not preclude future proof.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No interference with available surplus of Rs. 4.63 lacs; allowance of Rs. 0.43 lacs on reserves erroneous but in company's favour.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Bonus calculated on workmen's Rs. 50,000 wage bill correct.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Full Bench Formula applied correctly; three months bonus upheld.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Associated Cement Companies Ltd. v. Its Workmen",
      "citation": "1959 S.C.R. 925",
      "treatment": "followed",
      "relevance": "Approved Full Bench Formula for profit bonus calculation"
    },
    {
      "case_name": "Petlad Turkey Dye Works v. Dyes and Chemical Workers Union",
      "citation": "1960 2 S.C.R. 906",
      "treatment": "followed",
      "relevance": "Balance-sheet figures need proper evidence"
    },
    {
      "case_name": "Khandesh Spg. and Weaving Mills Case",
      "citation": "1960 2 S.C.R. 841",
      "treatment": "followed",
      "relevance": "Balance-sheet figures need proper evidence"
    },
    {
      "case_name": "Bengal Kagabkal Mazdoor Union v. The Titagarh Paper Mills Co. Ltd.",
      "citation": "1964 S.C.R. 38",
      "treatment": "followed",
      "relevance": "Balance-sheet figures need proper evidence; recently emphasised"
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals by special leave against Tribunal awards granting three months basic wages bonus for 1957-58 dismissed; Tribunal's calculations and award upheld, company's claims on rehabilitation and reserves rejected for lack of evidence.",
    "relief_granted": "Workmen entitled to three months basic wages as bonus (inclusive of voluntary half month payment).",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "by a series of decisions of this Court it is now well settled that the burden to prove any prior charge under the head rehabilitation lies on the employer",
      "speaker": "court",
      "significance": "Establishes legal burden for rehabilitation claims"
    },
    {
      "text": "the mere submission of a statement prepared in the Company's office showing a certain divisor cannot meet the requirements of law unless and until the basis of this calculation is explained by testimony on oath",
      "speaker": "court",
      "significance": "Explains evidentiary requirement for claims"
    },
    {
      "text": "the way the Company has approached the calculations of reserves used as working capital makes one think that those responsible for these calculations did not treat the matter seriously at all",
      "speaker": "court",
      "significance": "Court's strong condemnation of company's approach"
    },
    {
      "text": "The Industrial Tribunal is not concerned with what is paid by the Company to its officers. It is concerned only with the workmen's claim of bonus.",
      "speaker": "court",
      "significance": "Clarifies scope of Tribunal's consideration for bonus"
    }
  ],
  "_case_id": "1963_250",
  "_label": 0,
  "_text_length": 11809,
  "_extracted_at": "2026-02-10T19:50:22.117473"
}