{
  "metadata": {
    "case_name": "Khardah Co. Ltd. v. Its Workmen",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 705 of 1962",
    "date_of_judgment": "1963-05-02"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Samiran Jadav was a weaver employed by Khardah Co. Ltd., confirmed in service with effect from April 12, 1954.",
      "type": "background",
      "date": "1954-04-12",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On September 19, 1960, Jadav went on a week's leave and returned on September 26, 1960. He was asked to work on a twill producing machine, though normally assigned to plain machine.",
      "type": "material",
      "date": "1960-09-19",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Jadav, unaccustomed to twill machine, requested usual plain machine work but was refused. On September 27, 1960, he met with an accident and was granted medical leave till October 1, 1960.",
      "type": "material",
      "date": "1960-09-27",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "On October 3, 1960, Jadav resumed duty, again requested plain machine but refused. He said he would work second shift from 1 P.M.",
      "type": "material",
      "date": "1960-10-03",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "On October 3, 1960, employee Mahboob, who was ailing, asked for further leave which was refused; he fell unconscious while going to operate his machine. As a result, 700 weavers stopped work; weaving section could not resume till 1 P.M.",
      "type": "material",
      "date": "1960-10-03",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Management declared lock-out on October 5, 1960, which continued until October 29, 1960.",
      "type": "material",
      "date": "1960-10-05",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On October 3, 1960, management served charge-sheet on Jadav alleging wilful disobedience of lawful order, acting subversive of discipline by moving in weaving department and inciting workers to strike. Charged under Rule 14(c)(i) and (viii) of Standing Orders.",
      "type": "procedural",
      "date": "1960-10-03",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Jadav gave explanation within 24 hours. Enquiry held by Manager; Jadav appeared initially but later did not participate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "After enquiry, Manager dismissed Jadav on November 21, 1960, finding him guilty.",
      "type": "material",
      "date": "1960-11-21",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Dispute referred to 4th Industrial Tribunal, West Bengal: Whether dismissal justified and relief to workman? Tribunal held dismissal unjustified, directed reinstatement to old post within a month of award publication; period from dismissal to reinstatement as leave without pay, counted towards service.",
      "type": "procedural",
      "date": "1961-09-19",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant's version: Jadav worked on both plain and twill looms; on Oct 3 refused Overseer Jha's order; incited workers. Mahboob absent on Oct 3, no question of him working.",
      "type": "disputed",
      "date": "1960-10-03",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Tribunal found management suppressed Mahboob's presence on Oct 3; no findings recorded by Manager post-enquiry; Jadav not used to twill loom, request justified; charge grave and unjust, showing vindictiveness.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Minutes of Emergency Works Committee on Oct 3, 1960 at 3 P.M. confirm Mahboob reported, asked for leave extension, refused; produced fitness certificate Sept 22; case referred to Medical Officer.",
      "type": "material",
      "date": "1960-10-03",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Jadav was Organising Secretary of the Union.",
      "type": "background",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the dismissal of Samiran Jadav was justified, and if the domestic enquiry was fair and proper.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Industrial Tribunal could interfere with management's dismissal after domestic enquiry.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Proper domestic enquiry held; charges proved; Tribunal should not interfere unless bad faith, victimisation, unfair practice, basic error, natural justice violation, or perverse finding.",
      "supporting_facts": [
        "f7",
        "f8",
        "f9",
        "f11"
      ],
      "legal_basis": "Indian Iron Steel Company Ltd. v. Their Workmen"
    },
    {
      "id": "pa2",
      "text": "No need for enquiry officer to record formal findings as Manager competent to dismiss.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Mahboob absent on Oct 3; strike instigated by Jadav.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Dismissal mala fide, victimisation for trade union activities as Jadav was Organising Secretary supporting union demands strongly.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Enquiry conducted unfairly by Manager; Jadav could not participate later.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Domestic enquiry defective as Manager recorded no findings post-enquiry, making it impossible to assess if conclusions perverse or basic error; enquiry must be fair, observe natural justice, evidence recorded in presence of workman.",
      "addresses_issue": "i1",
      "key_observation": "Failure to record findings constitutes serious infirmity."
    },
    {
      "id": "cr2",
      "text": "Tribunal right not to attach importance to unfair enquiry; considered merits de novo, found dismissal not in good faith, actuated by victimisation; finding not perverse.",
      "addresses_issue": "i2",
      "key_observation": "If enquiry unfair, Tribunal decides on merits without regard to management's view."
    },
    {
      "id": "cr3",
      "text": "Mahboob present on Oct 3 per Works Committee minutes; management's plea untrue, changes complexion of charge against Jadav.",
      "addresses_issue": "i1",
      "key_observation": "Suppression of fact shows lack of good faith."
    },
    {
      "id": "cr4",
      "text": "Tribunal allowing union record post-arguments to confirm Jadav's position proper, as authenticated record.",
      "addresses_issue": "i2",
      "key_observation": "No serious grievance."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Domestic enquiries must record findings and brief reasons by enquiry officer; evidence normally in presence of workman; principles of natural justice scrupulously observed.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Tribunal's conclusion of unfair enquiry and victimisation upheld; dismissal unjustified.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Indian Iron Steel Company Ltd. v. Their Workmen",
      "citation": "1958 1 LLJ 260",
      "treatment": "followed",
      "relevance": "Tests for Tribunal interference with domestic enquiry findings: bad faith, victimisation, basic error, natural justice violation, perverse finding."
    },
    {
      "case_name": "State of Mysore v. S.S. Makapur",
      "citation": "1963 2 SCR 943",
      "treatment": "referred",
      "relevance": "Ex parte evidence recording in public servant enquiries, but apply cautiously to industrial domestic enquiries."
    },
    {
      "case_name": "Kesoram Cotton Mills Ltd. v. Gangadhar",
      "citation": "1964 Vol. 2 SCR 809",
      "treatment": "followed",
      "relevance": "Desirable to examine witnesses in presence of industrial employee in domestic enquiries."
    },
    {
      "case_name": "Union Territory of Tripura v. Gopal Chandra Dutta Choudhuri",
      "citation": "R. 266",
      "treatment": "distinguished",
      "relevance": "Motive irrelevant in public servant enquiries, unlike industrial where victimisation possible."
    }
  ],
  "statutes_cited": [
    {
      "name": "Company's Standing Orders",
      "sections": [
        "Rule 14(c)(i)",
        "Rule 14(c)(viii)"
      ],
      "relevance": "Misconduct alleged: wilful disobedience, subversive of discipline."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; Tribunal's award upheld directing reinstatement of Jadav to old post, treating dismissal period as leave without pay counted towards service.",
    "relief_granted": "Reinstatement of Samiran Jadav.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the failure of the Manager to record any findings after holding the enquiry constitutes a serious infirmity in the enquiry itself.",
      "speaker": "court",
      "significance": "Core reason for holding enquiry defective."
    },
    {
      "text": "in industrial enquiries, it is desirable that all witnesses on whose testimony the management relies in support of its charge against the workman should be examined in his presence.",
      "speaker": "court",
      "significance": "Emphasises natural justice in domestic enquiries."
    },
    {
      "text": "the Tribunal has come to the conclusion that the dismissal of jadav was not effected in good faith and has been actuated by a desire to victimise him for his trade union activities. That is a conclusion of fact which cannot be said to be perverse.",
      "speaker": "court",
      "significance": "Upholds Tribunal's finding on victimisation."
    }
  ],
  "_case_id": "1963_247",
  "_label": 0,
  "_text_length": 22383,
  "_extracted_at": "2026-02-10T19:50:28.249706"
}