{
  "metadata": {
    "case_name": "General Manager, B.E.S.T. Undertaking, Bombay v. Widow of P. Nanu Raman",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao J.",
      "Mudholkar J.",
      "Dayal J."
    ],
    "case_number": "Civil Appeal No. 133 of 1961",
    "date_of_judgment": "1963-05-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Bombay Municipal Corporation runs public utility transport service managed by Bombay Electricity Supply and Transport Committee under name Bombay Electric Supply and Transport Undertaking. Employs staff including bus drivers.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Rule 19 of Standing Rules of B.E.S.T. Undertaking permits specified number of traffic outdoor staff in uniform to travel standing in a bus without payment of fares.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "P. Nanu Raman, bus driver employed by Corporation, finished work at about 7.45 p.m. on July 20, 1957 at Jogeshwari bus depot. Boarded another bus to residence at Santa Cruz. Bus collided with stationary lorry on Ghodbunder Road near Erla Bridge, Andheri. Thrown out, injured, died on July 26, 1957 in hospital.",
      "type": "material",
      "date": "1957-07-20",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Widow filed application before Commissioner for Workmen's Compensation, Bombay claiming Rs. 3,500/- compensation for death arising out of and in course of employment. General Manager of B.E.S.T. Undertaking respondent, contended accident did not arise out of and in course of employment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Commissioner dismissed application. On appeal, Bombay High Court held accident arose out of and in course of employment, decreed Rs. 3,500/- with costs.",
      "type": "procedural",
      "date": "1959-07-29",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Various Standing Rules: Drivers must arrive punctually, late by >1 hour marked absent, miss car >3 times/month reverted to extra list. Supplied uniform. Permitted free travel standing in uniform under Rule 19. Can be transferred between depots.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "D.W.1, Traffic Inspector, stated instructions given to drivers and conductors to travel in other buses.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the accident causing death of bus driver Nanu Raman arose out of and in the course of his employment under s.3(1) of Workmen's Compensation Act, 1923, when it occurred while travelling home on another bus after finishing duty, using free travel concession under Rule 19.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Words 'arising out of and in the course of his employment' construed strictly per English precedents; accident during transit home after leaving work precincts outside scope unless contractual obligation to use that vehicle; deceased had no such obligation, position same as public member.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "s.3(1) Workmen's Compensation Act, 1923; English cases like St. Helens Colliery Co. Ltd. v. Hewitson"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Interpretation too narrow; requires intimate relationship between employment and accident; deceased had right under contract to travel by bus, duty in wider sense as incident of service.",
      "supporting_facts": [
        "f2",
        "f3",
        "f6"
      ],
      "legal_basis": "s.3(1) Workmen's Compensation Act, 1923"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Reviewed English precedents: strict duty test evolved to wider meaning including implied obligation from circumstances; notional extension of premises doctrine applies; for bus service over large area like Bombay, entire fleet is 'premises'; Rule 19 facility essential for punctuality/efficiency given long distances, implies obligation/duty to use buses as condition of service.",
      "addresses_issue": "i1",
      "key_observation": "Right to travel free in uniform as driver is condition of service for punctuality; accident in course of employment."
    },
    {
      "id": "cr2",
      "text": "Dissent (Dayal J.): Rule 19 mere concession/privilege, not contractual term or condition of service; limited to 2-4 staff per bus, no seat even on payment, available anytime in uniform not just to/from duty; no necessity or compulsion, off duty after leaving depot bus; no notional extension to public bus.",
      "addresses_issue": "i1",
      "key_observation": "Deceased boarded as passenger, under no control or duty to employer."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Accident arose out of and in course of employment; employer liable for compensation.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Cremins v. Guest, Keen Nettlefolds, Ltd.",
      "citation": "1908 1 K.B. 469",
      "treatment": "followed",
      "relevance": "Implied term in contract for free travel to/from work; accident on platform in course of employment."
    },
    {
      "case_name": "St. Helens Colliery Company Ltd. v. Hewitson",
      "citation": "1924 A.C. 59",
      "treatment": "distinguished",
      "relevance": "No obligation to use train, accident not in course; stricter view of duty."
    },
    {
      "case_name": "Weaver v. Tredegar Iron and Coal Co. Ltd.",
      "citation": "1940 3 All. E.R. 157",
      "treatment": "followed",
      "relevance": "Wider duty test; employment includes incidental travel; notional extension."
    },
    {
      "case_name": "Alderman v. Great Western Railway Co.",
      "citation": "1937 A.C. 454",
      "treatment": "distinguished",
      "relevance": "Employee like public member going to sign-on, not in course."
    },
    {
      "case_name": "Dunn v. A.G. Lockwood Co.",
      "citation": "1947 1 All. E.R. 446",
      "treatment": "followed",
      "relevance": "Implied obligation to proceed expeditiously after train arrival."
    },
    {
      "case_name": "Saurashtra Salt Manufacturing Co. v. Bai Valu Raja",
      "citation": "A.I.R. 1958 S.C. 881",
      "treatment": "followed",
      "relevance": "Notional extension of premises doctrine; facts-specific."
    }
  ],
  "statutes_cited": [
    {
      "name": "Workmen's Compensation Act, 1923",
      "sections": [
        "Section 3(1)"
      ],
      "relevance": "Employer liable if injury by accident arising out of and in course of employment."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave against Bombay High Court order awarding compensation dismissed by majority (Subba Rao and Mudholkar JJ.); Dayal J. dissented, would allow appeal with costs. No question on quantum of Rs. 3,500/- raised.",
    "relief_granted": "Compensation of Rs. 3,500/- upheld in favour of widow.",
    "costs": "Dismissed without costs."
  },
  "key_quotes": [
    {
      "text": "\"the right to travel in the bus in order to discharge his duties punctually and efficiently is a condition of his service.\"",
      "speaker": "court",
      "significance": "Majority holding on implied obligation from service rules."
    },
    {
      "text": "\"It is well settled that when a workman is on a public transport he is there as any other member of the public and is not there in the course of his employment unless the very nature of his employment makes it necessary for him to be there.\"",
      "speaker": "court",
      "significance": "From Saurashtra case, applied in dissent."
    },
    {
      "text": "\"the entire fleet of buses forming the service would be the Premises.\"",
      "speaker": "court",
      "significance": "Adapts notional extension doctrine to bus service."
    }
  ],
  "_case_id": "1963_165",
  "_label": 0,
  "_text_length": 55680,
  "_extracted_at": "2026-02-10T19:49:30.886937"
}