{
  "metadata": {
    "case_name": "Assessee v. Commissioner of Income-tax",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is a trader carrying on two businesses, namely manihari general merchandise and bidis. He had also certain income from property but with this income we are not concerned in these appeals.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For each of the assessment years concerned (1945-46 and 1947-48), the assessee had submitted a return but as his accounts were not found complete and reliable, the Income-tax officer had assessed the gross profits of the businesses on the basis of certain percentages of the total sales which had also to be fixed by estimates.",
      "type": "procedural",
      "date": "1945-46 and 1947-48",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "No question arises in these appeals as to the correctness of these assessments.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Subsequently, while dealing with the assessment for the year 1948-49, the Income-tax Officer noticed various credit entries in the assessee's books of account which had all escaped his attention at the time of the assessment for the years 1945-46 and 1947-48.",
      "type": "material",
      "date": "1948-49",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Credit entries for 1945-46: i Gold Khata Rs. 41,300; ii Ghar Khata Rs. 33,000; iii Mohammad Islam Khata Rs. 10,000; iv Muslim Bi Khata Rs. 11,000; Total Rs. 95,300.",
      "type": "material",
      "date": "1945-46",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Credit entries for 1947-48: i Ghar Khata credit under sale of ornaments Rs. 19,575; ii Yakub Manihar account Loan from Yakub Manihar Rs. 20,000; Total Rs. 39,575.",
      "type": "material",
      "date": "1947-48",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Income-tax Officer thereupon, with the sanction of the Commissioner of Income-tax, re-opened the assessments in respect of these years and after giving the assessee full opportunity to explain the nature of these entries made fresh assessments under section 34.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In the fresh assessments he added to the previously estimated incomes the said sum of Rs. 95,300 in respect of the year 1945-46 and the said sum of Rs. 39,575 in respect of the year 1947-48, as he was unable to accept the explanation offered by the assessee in support of his contention that the credit entries did not represent income.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The assessee appealed against these fresh assessments to the Appellate Assistant Commissioner but the appeals were unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "He then appealed to the Income-tax Tribunal. The Tribunal found the assessee's explanation with regard to the said entries for the amounts of Rs. 33,000 and Rs. 10,000 under the heads Ghar Khata and Muhammad Islam Khata respectively, acceptable and ordered their deletion from the assessment for the year 1945-46, but otherwise maintained the orders of the Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Thereafter, under the orders of the High Court under section 66(2) of the Act made at the instance of the assessee, the Tribunal framed six questions in each of the assessment cases and referred them to the High Court of Madhya Pradesh for its decision.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The questions framed were identical in the two cases excepting as to one minor matter in question No. 6 which made no difference and the references in the two cases were heard together.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "These questions were answered by the High Court against the assessee and hence, the present appeals by the assessee.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Of these six questions it is unnecessary to deal with the first three, for two of these had been abandoned in the High Court and High Court's answer to the third was not challenged in this court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the burden of proving the source of the cash credits is on the assessee? (Question No.4)",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "If so, then whether in the absence of satisfactory proof as to the source of credits the inference of the Tribunal that these credits are the assessee's income from some undisclosed sources is an inference of fact or an inference of law? (Question No.5)",
      "framed_by": "tribunal"
    },
    {
      "id": "i3",
      "text": "Whether having regard to the fact that the Income-tax Officer has assessed the income on a percentage basis, he was justified in treating the said sums (specific amounts) as profits from an undisclosed source? (Question No.6)",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The burden of proving the source of the cash credits is not on the assessee.",
      "supporting_facts": [
        "f5",
        "f6",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The inference that credits are assessee's income from undisclosed sources is an inference of law, not fact.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Section 66 of the Income-tax Act, 1922"
    },
    {
      "id": "pa3",
      "text": "Income-tax Officer not justified in treating credit sums as profits from undisclosed source because income assessed on percentage basis, leading to double taxation.",
      "supporting_facts": [
        "f2",
        "f5",
        "f6",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Burden of proving source of cash credits is on assessee; in absence, treat as taxable income.",
      "supporting_facts": [
        "f5",
        "f6",
        "f8"
      ],
      "legal_basis": "A. Govindarajulu Mudaliar v. Commissioner of Income-tax"
    },
    {
      "id": "ra2",
      "text": "Inference that credits are income from undisclosed sources justified even if business income estimated on percentage basis; no double taxation as treated as separate undisclosed income.",
      "supporting_facts": [
        "f2",
        "f5",
        "f6",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The answer to question No.4 must be in the affirmative: burden of proving the source of a sum of money found to have been received by the assessee is on him. If he disputes liability for tax, it is for him to show either that the receipt was not income or that if it was, it was exempt from taxation under the provisions of the Act. In the absence of such proof, the Income-tax Officer is entitled to treat it as taxable income.",
      "addresses_issue": "i1",
      "key_observation": "Well established principle."
    },
    {
      "id": "cr2",
      "text": "Question No.5 is not a proper question for reference under section 66 as it does not arise out of the Tribunal's decision. If inference is of fact, Tribunal final; if of law, it was justified, supported by precedent.",
      "addresses_issue": "i2",
      "key_observation": "High Court correctly said it was one of fact."
    },
    {
      "id": "cr3",
      "text": "Answer to question No.6 is affirmative: taxing authorities not precluded from treating credit entries as income from undisclosed sources merely because business income computed on percentage basis. No double taxation as these are treated as from separate undisclosed sources, not the disclosed business.",
      "addresses_issue": "i3",
      "key_observation": "Assessee could have challenged finding on evidence but did not pursue."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Burden of proving source of cash credits is on the assessee.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Inference that credits are income from undisclosed sources is one of fact (or if law, justified).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Income-tax Officer justified in treating credit sums as profits from undisclosed sources despite percentage-based assessment of disclosed business income.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "A. Govindarajulu Mudaliar v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Supports that onus of proving source is on assessee and ITO can treat unexplained receipts as taxable income; also supports inference as lawful."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "Section 66",
        "Section 34",
        "Section 66(2)"
      ],
      "relevance": "Reopening assessments; reference of questions to High Court; questions must be of law arising from Tribunal's findings."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals against the High Court's answers to the referred questions are dismissed. The High Court's views on questions 4, 5, and 6 upheld, confirming additions of credit entries (except those deleted by Tribunal) as income from undisclosed sources.",
    "relief_granted": null,
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "It is well established that the onus of proving the source of a sum of money found to have been received by the assessee is on him.",
      "speaker": "court",
      "significance": "Core holding on burden of proof for cash credits."
    },
    {
      "text": "We do not see why it cannot be so held [that credit entry can be undisclosed income despite estimate-based assessment of disclosed business].",
      "speaker": "court",
      "significance": "Rejects double taxation argument for question 6."
    },
    {
      "text": "These appeals fail and are dismissed with costs.",
      "speaker": "court",
      "significance": "Final disposition."
    }
  ],
  "_case_id": "1963_21",
  "_label": 0,
  "_text_length": 11318,
  "_extracted_at": "2026-02-10T19:47:43.386989"
}