{
  "metadata": {
    "case_name": "Appellant Company v. Respondent No. 1 and Others",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar J."
    ],
    "case_number": "Civil Appeal No. 179 of 1963",
    "date_of_judgment": "1963-05-08"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Regional Transport Authority, Coimbatore invited applications for grant of six permits for stage carriage buses for Erode Town service, including two on new route No. 5.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant, respondents 1 and 2 and some others applied for all six permits including two on route No. 5.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Regional Transport Authority at meeting on March 16, 1961 granted four permits to four existing operators and on route No. 5 granted one permit each to respondents 1 and 2.",
      "type": "material",
      "date": "1961-03-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant preferred appeal to State Transport Appellate Tribunal, Madras.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "State Transport Appellate Tribunal held appellant should be preferred to respondent No. 1, set aside RTA order granting permit to respondent No. 1, did not interfere with permit to respondent No. 2.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Respondent No. 1 filed writ petition before Madras High Court; single judge set aside Tribunal order insofar as appellant concerned.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Ground: Tribunal did not state why appellant should be preferred to respondent No. 1.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant filed Writ Appeal No. 207 of 1962 under cl. 15 Letters Patent; dismissed in limine on October 23, 1962.",
      "type": "procedural",
      "date": "1962-10-23",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant came to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant has experience running buses on certain routes in State but no recent experience in town service; regarded as new entrant for town service.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Regional Transport Authority considered lack of town experience against appellant.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Tribunal relied on Government Order No. 2265 dated August 9, 1958 and observations in Raman & Raman Ltd. v. State of Madras to prefer new entrants even on town routes.",
      "type": "material",
      "date": "1958-08-09",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Regional Transport Authority preferred existing operators due to considerable traffic in towns, narrow roads; had in mind Transport Commissioner circular dated October 14, 1960 treating town service routes as separate category excluding from short routes.",
      "type": "material",
      "date": "1960-10-14",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Tribunal properly determined why the appellant should be preferred to respondent No. 1 by evaluating rival claims, or failed to address the material issue.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether new entrants should be preferred over existing operators on town routes.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Learned single judge ought to have remanded matter to Tribunal after setting aside its order and could not confirm Regional Transport Authority order without going into merits of rival claims.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Tribunal failed to consider superior merit of respondent No. 1 including experience as against appellant as new entrant; took as rule of law that new entrants should invariably be preferred without evaluating rival claims paramount public interest.",
      "supporting_facts": [
        "f5",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Tribunal did not address specifically why appellant preferred to respondent No. 1; set out appellant's qualifications but did not consider whether respondent No. 1 possessed similar; no proper determination of why one operator preferred over another.",
      "addresses_issue": "i1",
      "key_observation": "Agrees with High Court that Tribunal failed to perform duty to evaluate rival claims."
    },
    {
      "id": "cr2",
      "text": "No pronouncement on whether new entrants ought to be preferred on town routes as Tribunal did not address the question.",
      "addresses_issue": "i2",
      "key_observation": "One reason of Regional Transport Authority may not be correct but not deciding."
    },
    {
      "id": "cr3",
      "text": "High Court single judge order implies appeal should be reheard by Tribunal in light of observations, sufficient to remove appellant's grievance.",
      "addresses_issue": "i1",
      "key_observation": "Order not very clearly worded but effectively remands."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Tribunal must evaluate rival claims of operators to determine preference; failure to do so is error.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Raman & Raman Ltd. v. State of Madras",
      "citation": "1953 Supp. 2 S.C.R. 227, 244",
      "treatment": "referred",
      "relevance": "Tribunal relied on observations to conclude new entrants ought to be preferred even on town routes."
    }
  ],
  "statutes_cited": [
    {
      "name": "Government Order No. 2265",
      "sections": [],
      "relevance": "Dated August 9, 1958; Tribunal and Regional Transport Authority referred to it regarding categorization of routes and preference for new entrants."
    },
    {
      "name": "Transport Commissioner Circular",
      "sections": [],
      "relevance": "Dated October 14, 1960; interprets Government Order placing routes in categories and treating town service routes separately."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court agreed with High Court that Tribunal failed to properly evaluate rival claims of appellant and respondent No. 1; upheld High Court order, interpreting it as directing rehearing by Tribunal in light of observations.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the paramount question, to be considered was the interest of the public, and, in considering the question, it had a duty to evaluate the rival claims of the two operators.",
      "speaker": "court",
      "significance": "High Court observation adopted by Supreme Court on Tribunal's duty."
    },
    {
      "text": "there has been no proper determination of the only question which requires to be determined and that is why one operator should be preferred to another.",
      "speaker": "court",
      "significance": "Core finding on Tribunal's error."
    }
  ],
  "_case_id": "1963_69",
  "_label": 0,
  "_text_length": 6854,
  "_extracted_at": "2026-02-10T19:48:22.082595"
}