{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Bombay v. James Anderson",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "SHAH, J."
    ],
    "case_number": "Civil Appeal No. 128 of 1963",
    "date_of_judgment": "1963-12-02"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Henry Gannon, registered holder of 2674 shares of Gannon Dunkerley Company (private limited company, registered office in Bombay), died on May 13, 1945, having made a will disposing of his estate in UK and British India.",
      "type": "background",
      "date": "1945-05-13",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "National Bank of India Ltd. obtained probate of Gannon's will in UK and appointed respondent James Anderson as attorney to administer estate in British India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Anderson obtained Letters of Administration durante absentia to Gannon's estate in British India on August 14, 1946.",
      "type": "procedural",
      "date": "1946-08-14",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "450 shares specifically bequeathed to legatees; share certificates with transfer forms delivered to legatees during administration. Question does not arise regarding these shares.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Agreement dated August 14, 1946 between executor, Company and Morarka to sell remaining 2224 shares to Morarka at Rs. 140 per share; share certificates with transfer deeds handed to Morarka on October 12, 1946 against payment.",
      "type": "material",
      "date": "1946-08-14",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Morarka failed to present transfer deeds and share certificates for registration; Gannon's name remained on register of shareholders for 2224 shares at all material times.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Income-tax Officer, Bombay, made order under s. 23A of Income-tax Act, 1922 on March 26, 1953 for assessment years 1946-47 and 1947-48 deeming undistributed income distributed as dividends on May 26, 1947 and December 22, 1947; net dividends Rs. 61,051 and Rs. 3,73,099.",
      "type": "procedural",
      "date": "1953-03-26",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "ITO issued notice under s. 34(1)(b) to James Anderson, Administrator, on March 28, 1953 for year ending March 31, 1949, believing income escaped assessment.",
      "type": "procedural",
      "date": "1953-03-28",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Anderson submitted return but did not include deemed dividends; ITO included them in assessment, processed under s. 18(5), levied tax.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Anderson's appeals to Appellate Assistant Commissioner and Income-tax Appellate Tribunal unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Tribunal referred questions to Bombay High Court under s. 66(1): (1) Whether assessment on Anderson valid? (2) Whether deemed dividends assessable in his hands?",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Bombay High Court answered first question in negative, declined second; judgment dated September 21, 1961 in Income-Tax Reference No. 32 of 1959.",
      "type": "procedural",
      "date": "1961-09-21",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Commissioner of Income-tax appealed to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Estate vested in Anderson by s. 211 Indian Succession Act, but he did not get name entered in Company's register.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in the facts and circumstances the assessment made on Mr. James Anderson, Administrator to the estate in India of Mr. Henry Gannon deceased is valid in law?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether in the facts and circumstances the dividends of Rs. 61,051 and Rs. 3,73,099 deemed to have been distributed on 26th May 1947 and 22nd December 1947 respectively under s. 23A were assessable in the hands of the applicant?",
      "framed_by": "tribunal"
    },
    {
      "id": "i3",
      "text": "Whether the Act contains machinery for assessing dividends deemed distributed under s. 23A in respect of shares held by a shareholder when before the date of the General Meeting the registered shareholder has died and representatives not substituted in register?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Principle that 'shareholder' in s. 23A means registered shareholder applies only when alive and beneficial ownership transferred inter vivos, not where legal representative invested with rights by grant of representation without registration.",
      "supporting_facts": [
        "f6",
        "f14"
      ],
      "legal_basis": "CIT v. Shakuntala; Howrah Trading Co. v. CIT"
    },
    {
      "id": "pa2",
      "text": "Legal representative can enforce rights or incur liability depending on nature; s. 24B extends legal personality of deceased to end of account year.",
      "supporting_facts": [
        "f1",
        "f7"
      ],
      "legal_basis": "s. 24B Income-tax Act; Amarchand Shroff case observations"
    },
    {
      "id": "pa3",
      "text": "For fictional income under s. 23A, legal personality extends to end of year in which fictional income deemed received.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "s. 23A; s. 24B; Amarchand Shroff"
    },
    {
      "id": "pa4",
      "text": "Legal representatives represent estate in taxation; Act taxes all assessable income, cannot escape.",
      "supporting_facts": [],
      "legal_basis": "s. 2(2), s. 3 Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Legal representative not shareholder unless registered; no machinery to assess deemed dividends post-death without substitution.",
      "supporting_facts": [
        "f6",
        "f14"
      ],
      "legal_basis": "s. 23A; Companies Act s. 35"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Shareholder in s. 23A means registered shareholder; liable only if registered. Legal rep does not automatically become shareholder; cannot vote, be director without registration.",
      "addresses_issue": "i3",
      "key_observation": "Legal rep has limited rights/obligations; not full shareholder."
    },
    {
      "id": "cr2",
      "text": "s. 23A creates fiction of distribution but requires assessment order to charge tax; no special machinery for legal rep when death before fiction date and no registration.",
      "addresses_issue": "i1",
      "key_observation": "s. 24B limited to account year of death."
    },
    {
      "id": "cr3",
      "text": "s. 24B extends personality to end of account year of death (1945-46 for Gannon); deemed dividends in 1948-49 not assessable thereunder.",
      "addresses_issue": "i2",
      "key_observation": "Gannon died May 1945; fiction dates 1947."
    },
    {
      "id": "cr4",
      "text": "Amarchand Shroff limits s. 24B to income in year of death; no extension for fictional income differently.",
      "addresses_issue": "i1",
      "key_observation": "Cannot import different interpretations for actual vs fictional income."
    },
    {
      "id": "cr5",
      "text": "No general provision to assess estate income post-account year; courts cannot supply machinery.",
      "addresses_issue": "i1",
      "key_observation": "Charge under s. 3 subject to Act provisions."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Assessment on legal representative invalid as no machinery under Act to assess deemed dividends under s. 23A where registered shareholder died before fiction date and rep not registered.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "s. 24B does not permit assessment of deemed dividends in years after account year of death.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Bombay City II v. Shakuntala",
      "citation": "43 I.T.R. 352",
      "treatment": "followed",
      "relevance": "Shareholder in s. 23A means registered shareholder."
    },
    {
      "case_name": "Howrah Trading Company Ltd. v. Commissioner of Income-tax, Central Calcutta",
      "citation": "36 I.T.R. 215",
      "treatment": "followed",
      "relevance": "'Shareholder' means registered in company's books."
    },
    {
      "case_name": "Commissioner of Income-tax Bombay v. Ellis C. Reid",
      "citation": "I.L.R. 5 Bom. 312; 5 I.T.C 100",
      "treatment": "referred",
      "relevance": "No assessment on estate without provisions; assessee means living person."
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay City v. Amarchand Shroff",
      "citation": "48 I.T.R. 59",
      "treatment": "followed",
      "relevance": "s. 24B extends personality to end of account year of death; no tax on later receipts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "s. 23A",
        "s. 34(1)(b)",
        "s. 18(5)",
        "s. 66(1)",
        "s. 24B",
        "s. 2(2)",
        "s. 3"
      ],
      "relevance": "Deemed distribution of dividends; assessment machinery; liability of legal rep limited."
    },
    {
      "name": "Indian Succession Act",
      "sections": [
        "s. 211"
      ],
      "relevance": "Vesting of estate in administrator."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [
        "s. 35"
      ],
      "relevance": "Transfer by legal rep valid as if member; implies no automatic shareholder status."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court agreed with Bombay High Court that the assessment on James Anderson as administrator was invalid in law, though for somewhat different reasons, as there is no machinery in the Income-tax Act to assess deemed dividends under s. 23A in the hands of the legal representative of a deceased registered shareholder who died before the deemed distribution date and whose name was not substituted in the register.",
    "relief_granted": "Assessment set aside",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the expression shareholder in s. 23A of the Indian Income-tax Act, 1922, means a shareholder registered in the books of the company, and such shareholder alone is liable to be taxed",
      "speaker": "court",
      "significance": "Defines 'shareholder' strictly as registered holder."
    },
    {
      "text": "Section 24B does not warrant the application of two different interpretations in the matter of extension of the legal personality of the deceased according as the income is actual or fictional.",
      "speaker": "court",
      "significance": "Limits s. 24B uniformly; no special rule for deemed income."
    },
    {
      "text": "if the Legislature has failed to set up the procedure to assess such income, the Courts cannot supply it.",
      "speaker": "court",
      "significance": "No judicial creation of assessment machinery."
    }
  ],
  "_case_id": "1963_97",
  "_label": 0,
  "_text_length": 19544,
  "_extracted_at": "2026-02-10T19:48:29.781190"
}