{
  "metadata": {
    "case_name": "Jang Singh v. Brij Lal and Bhola Singh",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": "Civil Appeal No. 687 of 1962",
    "date_of_judgment": "1963-02-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Jang Singh filed a suit for pre-emption of the sale of certain lands against Brij Lal the first respondent the vendor, and Bhola Singh the second respondent the vendee in the Court of Sub-judge 1st Class, Sirsa.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On October 25, 1957, a compromise decree was passed in favour of Jang Singh and he was directed to deposit Rs. 5951 less Rs. 1000 already deposited by him (i.e., Rs. 4951) by May 1, 1958. The decree also ordered that on his failing to make the deposit punctually his suit would stand dismissed with costs.",
      "type": "procedural",
      "date": "1957-10-25",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On January 6, 1958, Jang Singh made an application to the Sub judge, Sirsa, for making the deposit of the balance of the amount of the decree. The Clerk of the Court prepared a challan in duplicate mentioning Rs. 4950 instead of Rs. 4951 and handed it over with the application. Jang Singh deposited Rs. 4950 the same day and received a copy of the challan as acknowledgement from the Bank.",
      "type": "procedural",
      "date": "1958-01-06",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Jang Singh is an illiterate person.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In May, 1958, Jang Singh applied for and received an order for possession of the land. It was reported by the Naib Nazir that the entire amount was deposited in Court.",
      "type": "procedural",
      "date": "1958-05",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On May 25, 1958, Bhola Singh applied to the Court for payment to him of the amount lying in deposit and it was reported by the Naib Nazir that Jang Singh had not deposited the correct amount and the deposit was short by one rupee.",
      "type": "procedural",
      "date": "1958-05-25",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Bhola Singh applied to the Court for dismissal of Jang Singh's suit, and for recall of all the orders made in Jang Singh's favour. The Sub Judge, Sirsa, accepted Bhola Singh's application observing that in pre-emption cases a Court had no power to extend the time fixed by the decree for payment of the price and the preemptor by his failure to deposit the correct amount had incurred the dismissal of the suit under the decree. He ordered reversal of earlier orders and restoration of possession to the opposite party.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Jang Singh appealed against that order to the District Judge. The District Judge recorded evidence of the Execution Clerk, Revenue Accountant, Treasury officer, Jang Singh and Bhola Singh. He held that Jang Singh had approached the Court intending to make the deposit as ordered, but the Court and its clerk made a mistake by ordering deposit of Rs. 4950, so responsibility was shared by the Court. He set aside the Sub Judge's order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Bhola Singh appealed to the Punjab High Court. The single judge held that the decree was not complied with, time could not be extended, and the finding of short deposit due to act of Court was unsupported by evidence. He set aside the District Judge's decision and restored the Sub Judge's order dated December 1, 1961.",
      "type": "procedural",
      "date": "1961-12-01",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The challan was prepared under the Court's direction by the Execution Clerk. Duplicate challan and the one presented to the Bank show Rs. 4950. The Execution Clerk deposed to the usual procedure: report by ahmed about amount, then court order, then challan.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "A search was made for the application on which the order directing deposit of Rs. 4950 was passed but it remained untraced.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Jang Singh complied with the pre-emption decree despite depositing Rs. 4950 instead of Rs. 4951 due to error in court-prepared challan.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the court can relieve the pre-emptor from dismissal of suit for short deposit caused by mistake of the court and its officers.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Jang Singh approached the Court with an application to deposit as directed, but Court clerk prepared challan for Rs. 4950 instead of 4951; Jang Singh relied on Court direction as illiterate person; responsibility shared by Court.",
      "supporting_facts": [
        "f3",
        "f4",
        "f10"
      ],
      "legal_basis": "Actus curiae neminem gravabit (act of court shall prejudice no one)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Jang Singh did not deposit full decretal amount of Rs. 4951 within time; in pre-emption cases court has no power to extend time fixed by decree; suit must be dismissed as per decree.",
      "supporting_facts": [
        "f2",
        "f6",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Court and its officers contributed to the error by preparing challan for Rs. 4950; litigant relied on Court information; litigant must be vigilant but where Court assists and errs, responsibility is shared.",
      "addresses_issue": "i1",
      "key_observation": "If the Court in supplying the information makes a mistake the responsibility of the litigant, though it does not altogether cease, is at least shared by the Court."
    },
    {
      "id": "cr2",
      "text": "No higher principle than actus curiae neminem gravabit; Court must restore litigant harmed by its mistake to original position; not a case of extending time but rectifying Court error nunc pro tunc.",
      "addresses_issue": "i2",
      "key_observation": "There is no higher principle for the guidance of the Court than the one that act of Courts should harm a litigant."
    },
    {
      "id": "cr3",
      "text": "High Court single judge erred in reversing District Judge's finding on evidence that short deposit due to Court act; case reverts to position on January 6, 1958, with direction to deposit Re. 1.",
      "addresses_issue": "i1",
      "key_observation": "District Judge was right in reversing Sub Judge; but decree not sufficiently complied with, so order deposit of Re. 1."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Litigant not prejudiced by act of Court; revert parties to position on January 6, 1958, when Court error occurred; direct deposit of additional Re. 1, failing which suit may be dismissed.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment of High Court set aside; parties relegated to position on January 6, 1958; appellant directed to deposit Re. 1 within one month from receipt of record in Sub-judge Sirsa Court, failing which suit may be dismissed.",
    "relief_granted": "Opportunity to deposit additional Re. 1 and proceed with pre-emption decree",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "There is no higher principle for the guidance of the Court than the one that act of Courts should harm a litigant and it is the bounden duty of Courts to see that if a person is harmed by a mistake of the Court he should be restored...",
      "speaker": "court",
      "significance": "Core principle applied: actus curiae neminem gravabit"
    },
    {
      "text": "Actus curiae neminem gravabit.",
      "speaker": "court",
      "significance": "Latin maxim embodying rule that court error shall not harm litigant"
    }
  ],
  "_case_id": "1963_151",
  "_label": 1,
  "_text_length": 10387,
  "_extracted_at": "2026-02-10T19:49:37.781888"
}