{
  "metadata": {
    "case_name": "Appellants v. Respondent Partnership Firm",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "S.K. Das J.",
      "Hidayatullah J.",
      "Sarkar J."
    ],
    "case_number": "Civil Appeal No. 75 of 1962",
    "date_of_judgment": "1963-04-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent partnership firm in possession as tenant of shop No. 582/638 at Mulji Jetha Market, Bombay.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "Agreement dated June 23, 1955: Defendant No. 1 (appellant No. 1) appointed respondent as commission agent for sale of appellants' cloth in the shop, for four years expiring June 30, 1959.",
      "type": "material",
      "date": "1955-06-23",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Pursuant to agreement, appellants, family members, servants, agents allowed by respondent to visit shop only for looking after commission agency business.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "On expiry of agreement June 30, 1959, appellants had no further right to enter shop.",
      "type": "material",
      "date": "1959-06-30",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Respondent alleged commission due under agreement; appellants visiting shop daily, preventing respondent's access to stock-in-trade, books, furniture etc.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Plaint negatives landlord-tenant relationship; appellants mere licensees during agreement, trespassers after expiry.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Appellants' defence: Respondent sublet shop to appellants at Rs. 500/month; sham agreement June 30, 1952 to avoid penal provisions of Act without landlord consent; 1955 agreement not operative; true relation landlord (respondent) and tenant (appellants).",
      "type": "disputed",
      "date": "1952-06-30",
      "source": "appellants"
    },
    {
      "id": "f8",
      "text": "Respondent instituted suit in Bombay City Civil Court for declaration of lawful possession, injunction against appellants entering/remaining in shop, and commission payable.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "City Civil Court framed preliminary issue on jurisdiction; held no jurisdiction, relying on Babulal Bhuramal v. Nandram Shivram, ordered plaint returned for presentation to Court of Small Causes.",
      "type": "procedural",
      "date": "1959-10-19",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Bombay High Court in Appeal No. 152 of 1959 reversed City Civil Court, held City Civil Court has jurisdiction, relying on Jaswantlal v. Western Company India and Govindram Salamatrai.",
      "type": "procedural",
      "date": "1959-10-19",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Supreme Court granted special leave; appeal heard.",
      "type": "procedural",
      "date": "1963-04-22",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on proper interpretation of s. 28 of Bombay Rents, Hotel and Lodging House Rates Control Act, 1947, Court of Small Causes Bombay had exclusive jurisdiction to deal with the suit.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Suit relates to possession of premises as between landlord and tenant; Court of Small Causes alone has jurisdiction under s.28; defendant's plea determines jurisdiction even if plaintiff denies landlord-tenant relation.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "s.28 Bombay Rents Act; Babulal Bhuramal v. Nandram Shivram"
    },
    {
      "id": "pa2",
      "text": "All claims/questions under Act to be tried exclusively by Small Causes Court regardless raised by plaintiff or defendant.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s.28 Bombay Rents Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Jurisdiction determined by plaint averments denying landlord-tenant; suit between licensor-licensee, not landlord-tenant; no claim/question under Act in plaint.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "General principle of jurisdiction based on plaint; Govindram Salamatrai v. Dharampal"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Jurisdiction at inception depends on plaint averments, not defence; general principle from Ananti v. Chhannu; s.28 confers exclusive jurisdiction for suits between landlord-tenant relating to rent/possession, applications under Act, claims/questions out of Act, but only if relation admitted or basis in plaint.",
      "addresses_issue": "i1",
      "key_observation": "Defendant cannot oust jurisdiction by plea if plaint denies landlord-tenant."
    },
    {
      "id": "cr2",
      "text": "s.28 does not depart from general principle; exclusive jurisdiction dependent on existing/previous landlord-tenant relation; questions of title (owner vs trespasser/licensee) not under Act.",
      "addresses_issue": "i1",
      "key_observation": "Plaintiff not forced to Small Causes if averments exclude Act provisions."
    },
    {
      "id": "cr3",
      "text": "Babulal Bhuramal correctly interpreted in Jaswantlal: suit covered by s.28 if framed as landlord-tenant with relief under Act.",
      "addresses_issue": "i1",
      "key_observation": "Here, plaint frames as licensee-trespasser."
    },
    {
      "id": "cr4",
      "text": "Sarkar J.: Suit not for rent/possession between L-T; defence traverse (not licensees) does not raise claim/question under Act; question of sub-tenancy is contractual, not arising out of Act.",
      "addresses_issue": "i1",
      "key_observation": "No need to decide tenant rights under Act as suit based solely on licence expiry."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "City Civil Court has jurisdiction to entertain and try the suit; s.28 does not oust it based on defence plea.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Babulal Bhuramal v. Nandram Shivram",
      "citation": "1959 S.C.R. 367",
      "treatment": "followed",
      "relevance": "City Civil Court relied on it for no jurisdiction; SC held correctly interpreted as jurisdiction by plaint frame, not defence denial."
    },
    {
      "case_name": "Govindram Salamatrai v. Dharampal",
      "citation": "1951 53 Bom. L.R. 886",
      "treatment": "followed",
      "relevance": "Jurisdiction by plaint; licensee suit not under s.28; question of tenant/licensee collateral to Act."
    },
    {
      "case_name": "Ebraham Saleji v. Abdulla Ali Raza",
      "citation": "1950 52 Bom. L.R. 897",
      "treatment": "distinguished",
      "relevance": "s.28 includes claims from plaint or written statement; overruled by Govindram."
    },
    {
      "case_name": "Jaswantlal v. Western Company, India",
      "citation": "1959 61 Bom. L.R. 1087",
      "treatment": "followed",
      "relevance": "Correctly explained Babulal; jurisdiction by plaint substance."
    },
    {
      "case_name": "Ananti v. Chhannu",
      "citation": "1929 I.L.R. 52 All. 501",
      "treatment": "followed",
      "relevance": "General principle: jurisdiction by plaintiff's chosen forum and plaint facts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Rents, Hotel and Lodging House Rates Control Act, 1947",
      "sections": [
        "Section 28",
        "Section 29",
        "Section 29-A",
        "Section 51"
      ],
      "relevance": "s.28 exclusive jurisdiction of Small Causes for L-T suits re rent/possession, applications, claims/questions under Act; s.29 appeals; s.29A saves title suits; s.51 includes Presidency Small Causes proceedings for licensees."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; High Court judgment upheld; City Civil Court has jurisdiction to try the suit; appellants to bear costs.",
    "relief_granted": "None to appellants; suit to proceed in City Civil Court.",
    "costs": "Appeal dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "The plaintiff chooses his forum and files his suit. If he establishes the correctness of his facts he will get his relief from the forum chosen.",
      "speaker": "court",
      "significance": "Explains general jurisdiction principle from Ananti."
    },
    {
      "text": "If, therefore, the plaintiff in his plaint does not admit a relation which would attract any of the provisions of the Act on which the exclusive jurisdiction given under s. 28 depends, we do not think that the defendant by his plea can force the plaintiff to go to a forum where on his averments he cannot go.",
      "speaker": "court",
      "significance": "Core holding on jurisdiction determined by plaint."
    },
    {
      "text": "A suit which is not between the landlord and tenant and in which judging by the plaint no claim or question arises out of the Rent Act or any of its provisions does not become a suit covered by the provisions of s. 28 of the Act as soon as the defendant raises a contention that he is a tenant.",
      "speaker": "court",
      "significance": "High Court view approved by SC."
    }
  ],
  "_case_id": "1963_113",
  "_label": 0,
  "_text_length": 36302,
  "_extracted_at": "2026-02-10T19:49:00.856033"
}