{
  "metadata": {
    "case_name": "Union of India & Anr. v. Ladu Lal Jain",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal J."
    ],
    "case_number": "Civil Appeal No. 717 of 1961",
    "date_of_judgment": "1963-05-07"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Suit instituted by plaintiff-respondent (Ms. Ladu Lal Jain) against Union of India (defendant No. 1) and Northern Frontier Railway represented by General Manager (defendant No. 2, headquarters at Pandu) for recovery of Rs. 8,250/- on account of non-delivery of goods.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Consignment consisted of 134 bags of rice booked from Kalyanganj station (West Bengal) of defendant No. 2 for carriage to Kanki station (Bihar) of the same defendant on April 13, 1958.",
      "type": "material",
      "date": "1958-04-13",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Goods consigned were not delivered to the plaintiff.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Notice served under s. 77 of the Indian Railways Act on defendant railway and notice under s. 80 of the Code on defendants.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Alleged in plaint that cause of action arose at Pandu within jurisdiction of Gauhati Court, where notice under s. 80 served, and defendant railway had principal place of business at Pandu.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Defendants filed joint written statement contending Gauhati Court had no territorial jurisdiction as neither railway station within its jurisdiction, consignment never travelled in Assam, cause of action did not arise in Assam.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Service of notice at place within jurisdiction does not vest territorial jurisdiction; Union of India has no principal place of business at Pandu, headquarters at New Delhi; Pandu office is branch controlled from New Delhi.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Trial Court (Additional Subordinate Judge, Gauhati) held it had jurisdiction relying on P.C. Biswas v. Union of India.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Assam High Court rejected revision application under s. 115 CPC on same basis, order dated April 10, 1961 in Civil Revision No. 10 of 1961.",
      "type": "procedural",
      "date": "1961-04-10",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Gauhati Court has territorial jurisdiction under s. 20 CPC to try the suit, given headquarters of Northern Frontier Railway at Pandu within its jurisdiction, and whether running of railways by Union of India amounts to 'carrying on business'.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Gauhati Court has no territorial jurisdiction as railway stations not within jurisdiction, consignment did not travel in Assam, cause of action did not arise there; service of notice does not confer jurisdiction; Union has no principal place at Pandu, HQ at Delhi; running railways not 'carrying on business' absent profit motive.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "s. 20 CPC; P.C. Biswas v. Union of India (relied on by lower courts but contested); Director of Rationing v. Corporation of Calcutta"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s. 20 CPC determines jurisdiction; corporation deemed to carry on business at principal office; Government can carry on business per Art. 298 and Art. 19(6) Constitution; running railways is business by nature, regardless of who runs it or profit motive.",
      "addresses_issue": "i1",
      "key_observation": "It is the nature of the activity which defines its character as business."
    },
    {
      "id": "cr2",
      "text": "Profit not essential for business; presume railways run on profit basis; precedents like Hospital Mazdoor Sabha confirm character of activity determines if business/industry, not who conducts it or for profit.",
      "addresses_issue": "i1",
      "key_observation": "Running of railways is such an activity which comes within the expression business."
    },
    {
      "id": "cr3",
      "text": "Director of Rationing case not applicable as it concerned sovereign functions, not business.",
      "addresses_issue": "i1",
      "key_observation": "No foundation that railways not business."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Union of India carries on the business of running railways and can be sued in Court within whose jurisdiction headquarters of one of the railways run by Union is situated, such as Subordinate Judge of Gauhati.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "P.C. Biswas v. Union of India",
      "citation": null,
      "treatment": "followed",
      "relevance": "Principal place from which railway administrator carries on is principal place of business for s. 20 CPC (relied by lower courts)"
    },
    {
      "case_name": "State of Bombay v. Hospital Mazdoor Sabha",
      "citation": "1961 2 S.C.R. 866",
      "treatment": "followed",
      "relevance": "Character of activity (running hospital) determines if industry/business, not who conducts or profit motive"
    },
    {
      "case_name": "Corporation of the City of Nagpur v. Its Employees",
      "citation": "1960 2 S.C.R. 942",
      "treatment": "followed",
      "relevance": "Activity that is industry if by private is industry if by corporation/municipality; monetary considerations not essential"
    },
    {
      "case_name": "Satya Narain v. District Engineer, P.W.D.",
      "citation": "A.I.R. 1962 S.C. 1161",
      "treatment": "followed",
      "relevance": "Commercial activity with profit motive not public service; does not hold non-profit govt activity not business"
    },
    {
      "case_name": "Director of Rationing & Distribution v. Corporation of Calcutta",
      "citation": "1961 I.C.A. 158",
      "treatment": "distinguished",
      "relevance": "Concerned sovereign duty of food distribution, not business; no help to appellants"
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "s. 20",
        "s. 80",
        "s. 115"
      ],
      "relevance": "Determines territorial jurisdiction; notice requirement; revision"
    },
    {
      "name": "Indian Railways Act",
      "sections": [
        "s. 77"
      ],
      "relevance": "Notice for suit against railway"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 298",
        "Art. 19(6)"
      ],
      "relevance": "State executive power extends to carrying on business/trade; State can carry on business excluding citizens"
    },
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 2(j)"
      ],
      "relevance": "Definition of industry includes business/undertaking; applied analogously"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; order of Assam High Court rejecting revision upheld; Gauhati Subordinate Judge has jurisdiction under s. 20 CPC as Union carries on business of running railways at Pandu headquarters.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is the nature of the activity which defines its character. Running of railways is such an activity which comes within the expression business.\"",
      "speaker": "court",
      "significance": "Core holding on why railways running is 'business' under s. 20 CPC"
    },
    {
      "text": "\"In our opinion, the answer to this question must be in the negative. It is the character of the activity which decides the question... who conducts the activity and whether it is conducted for profit or not do not make a material difference.\"",
      "speaker": "court",
      "significance": "From Hospital Mazdoor Sabha reasoning applied to railways"
    },
    {
      "text": "\"We hold that the Union of India carries on the business of running railways and can be sued in the Court of the Subordinate Judge of Gauhati...\"",
      "speaker": "court",
      "significance": "Final determination resolving jurisdiction issue"
    }
  ],
  "_case_id": "1963_123",
  "_label": 0,
  "_text_length": 14610,
  "_extracted_at": "2026-02-10T19:49:01.036412"
}