{
  "metadata": {
    "case_name": "State of Punjab v. Okara Grain Buyers Syndicate Ltd. and others",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Ayyangar J."
    ],
    "case_number": "Civil Appeals Nos. 439 to 451 of 1961",
    "date_of_judgment": "1963-11-15"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents in each of these 13 appeals are displaced creditors who filed petitions under Section 13 of the Displaced Persons (Debts Adjustment) Act, 1951 before Subordinate Judge, Amritsar (CA 439/61) and Subordinate Judge, Hissar (other appeals).",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "State of Punjab raised preliminary objection to maintainability of applications under s.13 against the State. Tribunal at Amritsar overruled on May 7, 1953; Hissar on May 25, 1953.",
      "type": "procedural",
      "date": "1953-05-07",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "State filed revisions to Punjab High Court, Civil Revisions Nos. 229 to 241 of 1953. Single Judge referred to Division Bench, which referred to Full Bench. Full Bench unanimously held applications maintainable, overruling two earlier contrary decisions. Chief Justice dismissed revisions giving effect to Full Bench view.",
      "type": "procedural",
      "date": "1958-08-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "State applied for special leave to Supreme Court, granted, leading to these appeals.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Illustrative facts in CA 439/61: Respondents M/s Okara Grain Buyers Syndicate Ltd. carried business in Okara (Montgomery, undivided Punjab, now Pakistan). Govt of undivided Punjab instructed supply of 210 bags imported maize to M/s Anil Starch Products Ltd., Ahmedabad in August 1947. Goods dispatched and delivered. Post-partition, business transferred to Amritsar, registered in Punjab. Bill submitted July 1948 for Rs. 3059/9/-. Informed payment made to Director-General of Food Supplies, East Punjab, but no payment by State. Claim under s.13 with interest at 6% from 15.8.1947.",
      "type": "material",
      "date": "1947-08-15",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Dispute exists on facts, genuineness and quantum of claims, not yet investigated as only preliminary objection decided.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondents are displaced persons; State is not a displaced person.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Under Indian Independence (Rights, Property, Liabilities) Order, 1947 para 8(3), claims if true enforceable by suit against State of Punjab.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether an application under s.13 of the Displaced Persons (Debts Adjustment) Act, 1951 is maintainable against the State of Punjab.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the sum claimed is a debt within the definition in s.2(6)(c) due from a 'person' who actually and voluntarily resides or carries on business or personally works for gain.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "State is not within scope of enactment, not named expressly or by necessary implication, hence not bound by Act or subject to Tribunals. What claimed is not a debt within definition; State not a 'person' to whom residence/business attributes apply.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Rule of construction: Crown/State not bound by statute unless express words or necessary intendment; s.2(6)(c), s.13 Displaced Persons (Debts Adjustment) Act, 1951"
    },
    {
      "id": "pa2",
      "text": "Language and provisions (positive and omissions) exclude State. Legislative confirmation: Re-enactment of similar phraseology from Displaced Persons (Institution of Suits) Act, 1948 after Nagi Bros. v. Dominion of India holding State not 'person'. Hardship marginal.",
      "supporting_facts": [],
      "legal_basis": "Displaced Persons (Institution of Suits) Act, 1948 s.4; Ms Nagi Bros. v. Dominion of India; Director of Rationing v. Corporation of Calcutta"
    },
    {
      "id": "pa3",
      "text": "Person excludes State as cannot reside voluntarily, carry business or work for gain. Bombay HC in Advani v. Union of India held s.13 not applicable to Union.",
      "supporting_facts": [],
      "legal_basis": "Advani v. Union of India I.L.R. 1955 Bom. 970"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No explicit exemption of State; Act supplements Indian Independence Order 1947, provides adjectival relief to substantive rights against State; otherwise most claimants remediless, repugnant to basic idea of Order.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Displaced Persons (Debts Adjustment) Act, 1951; Indian Independence (Rights, Property, Liabilities) Order, 1947 para 8"
    },
    {
      "id": "ra2",
      "text": "Act for public good, binds Crown/State; 'person' includes artificial entities like companies (except banks excluded), so includes State as juristic entity.",
      "supporting_facts": [],
      "legal_basis": "s.2(10), s.2(7) Displaced Persons (Debts Adjustment) Act, 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule of construction applies: State not bound unless expressly named or by necessary implication manifest from terms that legislature intended it bound, e.g., if beneficent purpose wholly frustrated otherwise.",
      "addresses_issue": "i1",
      "key_observation": "Rule from Province of Bombay v. Municipal Corp; Director of Rationing case; not altered post-Constitution."
    },
    {
      "id": "cr2",
      "text": "Language of s.13 and s.2(6)(c) raises difficulties for including State (no residence/business), but must examine entire Act, purpose, scheme.",
      "addresses_issue": "i2",
      "key_observation": "Debt from State to displaced debtor is 'attachable asset in India' under Explanation to s.32 for paying capacity; must be included in s.5 schedule."
    },
    {
      "id": "cr3",
      "text": "s.32 scaling down depends on paying capacity including State debts; integrated scheme of creditor/debtor relief (ss.5,10,11,32); excludes State debts would frustrate scheme, allow debtor keep State dues free of creditors.",
      "addresses_issue": "i1",
      "key_observation": "s.47 reinforces; s.3 overriding effect prevents govt attachment post-adjustment."
    },
    {
      "id": "cr4",
      "text": "Beneficent purpose for displaced persons relief wholly frustrated unless State bound; s.13 claims against non-displaced (like State) necessary for s.32 adjudication.",
      "addresses_issue": "i1",
      "key_observation": "Test from Lord du Parcq satisfied."
    },
    {
      "id": "cr5",
      "text": "No legislative confirmation from 1948 Act: Different scope, not in pari materia; no ambiguity in 1951 Act.",
      "addresses_issue": "i1",
      "key_observation": "Nagi Bros. on procedural suits, not substantive adjustment."
    },
    {
      "id": "cr6",
      "text": "Hardship not determinative but many claims (e.g., contracts in Lahore) without forum under CPC s.20 absent Act.",
      "addresses_issue": "i1",
      "key_observation": "Construction independent of hardship quantum."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Application under s.13 maintainable against State by necessary implication; debt due by State within Act for scheme/purpose.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Director of Rationing and Distribution v. Corporation of Calcutta",
      "citation": "1961 1 S.C.R. 158",
      "treatment": "followed",
      "relevance": "Affirms rule: State not bound unless express or necessary implication; post-Constitution applies."
    },
    {
      "case_name": "Province of Bombay v. Municipal Corporation of the City of Bombay",
      "citation": "1946 L.R. 73 I.A. 271",
      "treatment": "followed",
      "relevance": "Formulates test for binding Crown/State: express, necessary implication, or purpose frustrated otherwise."
    },
    {
      "case_name": "Advani v. Union of India",
      "citation": "I.L.R. 1955 Bom. 970",
      "treatment": "considered",
      "relevance": "Held s.13 not apply to Union based on language; SC sees force but scheme overrides."
    },
    {
      "case_name": "Ms Nagi Bros. v. Dominion of India",
      "citation": "I.L.R. 4 Punjab 358",
      "treatment": "distinguished",
      "relevance": "1948 Act s.4 not permit suits vs govt; different scope from 1951 Act."
    },
    {
      "case_name": "State of Bihar v. Rani Sonabati Kumari",
      "citation": "1961 1 S.C.R. 728",
      "treatment": "referred",
      "relevance": "'Person' in CPC O.XXXIX r.2(3) includes State."
    },
    {
      "case_name": "State of West Bengal v. Union of India",
      "citation": "1964 1 S.C.R. 371",
      "treatment": "followed",
      "relevance": "Interpret whole statute for intention to bind State."
    },
    {
      "case_name": "Roberts v. Ahern",
      "citation": "1 C.L.R. 406",
      "treatment": "referred",
      "relevance": "Crown refers to Executive Govt."
    }
  ],
  "statutes_cited": [
    {
      "name": "Displaced Persons (Debts Adjustment) Act, 1951 (Central Act LXX of 1951)",
      "sections": [
        "s.13",
        "s.2(6)(c)",
        "s.2(10)",
        "s.2(8)",
        "s.2(9)",
        "s.2(12)",
        "s.5",
        "s.11",
        "s.32",
        "s.47",
        "s.3",
        "s.10",
        "s.4"
      ],
      "relevance": "Core enactment; s.13 claims maintainable vs State by implication for scheme of debt adjustment, paying capacity including State debts as assets."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 300"
      ],
      "relevance": "Govt suable; supplements Independence Order for claims vs State."
    },
    {
      "name": "Indian Independence (Rights, Property, Liabilities) Order, 1947",
      "sections": [
        "para 8(3)"
      ],
      "relevance": "Post-partition, Punjab contracts vest in East Punjab State; substantive rights enforceable vs State."
    },
    {
      "name": "Displaced Persons (Institution of Suits) Act, 1948",
      "sections": [
        "s.4"
      ],
      "relevance": "Temporary; forum for suits by displaced vs non-displaced in India; distinguished from 1951 Act."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "s.20",
        "s.60",
        "s.82"
      ],
      "relevance": "Ordinary forum; State suits where cause arises; debts attachable; s.20 Explanation II corps business situs."
    },
    {
      "name": "Displaced Persons (Claims) Act, 1950",
      "sections": [
        "XLIV of 1950"
      ],
      "relevance": "Compensation for verified claims; s.32 links to debt satisfaction from compensation/property."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "s.176"
      ],
      "relevance": "Pre-partition, Province suable as Province."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed appeals by special leave, upholding Punjab High Court Full Bench that applications under s.13 of Displaced Persons (Debts Adjustment) Act, 1951 are maintainable against State of Punjab by necessary implication from Act's scheme and purpose.",
    "relief_granted": "Preliminary objection rejected; claims proceed to merits before Tribunal.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the Crown is not bound by a statute unless it is so provided in express terms or by necessary implication.",
      "speaker": "court",
      "significance": "Restates core rule of construction affirmed from precedents."
    },
    {
      "text": "If it can be affirmed that... its beneficent purpose must be wholly frustrated unless the Crown were bound, then it may be inferred that the Crown has agreed to be bound.",
      "speaker": "court",
      "significance": "Test applied; s.32 scheme frustrated without State bound."
    },
    {
      "text": "a debt due by the Government or by the State is within the Act by necessary implication, because the same is necessary for working out the relief to which a displaced debtor... is entitled.",
      "speaker": "court",
      "significance": "Holding on why State included despite language."
    }
  ],
  "_case_id": "1963_141",
  "_label": 0,
  "_text_length": 75813,
  "_extracted_at": "2026-02-10T19:49:06.274455"
}