{
  "metadata": {
    "case_name": "State of Rajasthan v. Ram Saran",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Ayyangar J."
    ],
    "case_number": "Civil Appeal No. 453 of 1962",
    "date_of_judgment": "1963-04-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, Ram Saran, was appointed a Constable in 1947 in the Ajmer district police force.",
      "type": "background",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Two years after appointment as Constable, respondent was promoted to the rank of Head Constable and was confirmed in that post.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On June 29, 1956, respondent was appointed to officiate as a Sub-Inspector.",
      "type": "background",
      "date": "1956-06-29",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "States Reorganisation Act, 1956 (XXXVII of 1956) enacted, operative from November 1, 1956 (appointed date); Ajmer merged in Rajasthan; respondent absorbed in Police Service of Rajasthan State.",
      "type": "material",
      "date": "1956-11-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Formal order dated November 1, 1956 appointing respondent as officiating Sub-Inspector in Rajasthan State police force.",
      "type": "material",
      "date": "1956-11-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On April 6, 1957, Deputy Inspector General of Police, Ajmer Range ordered reversion of respondent to substantive post of Head Constable in District Police Force.",
      "type": "material",
      "date": "1957-04-06",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondent dissatisfied as there were officiating Sub-Inspectors junior to him who continued in posts; treated as supersession.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Respondent made representations to authorities; efforts failed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On July 22, 1959, respondent filed petition under Art. 226 for quashing reversion order dated April 6, 1957, and direction to restore to rank of officiating Sub-Inspector according to seniority. State, IG Police, DIG Police impleaded.",
      "type": "procedural",
      "date": "1959-07-22",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Rajasthan High Court judgment and order dated November 18, 1960 in D.B. Civil Writ No. 264 of 1959 allowed petition on ground of violation of s.115 of States Reorganisation Act.",
      "type": "procedural",
      "date": "1960-11-18",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appeal filed by State of Rajasthan pursuant to certificate under Art. 133(1)(c).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Standing Order 46 issued by Inspector General of Police, Ajmer dated October 20, 1949, para 4(b): 'An officer who has secured officiating promotion on the basis of his place on the approved list should normally be considered for promotion earlier provided that he maintains an appropriate standard. If he fails to do so he may be reverted or his confirmation postponed. He should not, however, be denied his claim to confirmation merely because although he has maintained his standard someone else promoted later is considered to have done even better.'",
      "type": "background",
      "date": "1949-10-20",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Central Government letter dated March 27, 1957 from Deputy Secretary, Ministry of Home Affairs to Chief Secretary, Rajasthan: Under 'Pay' - 'ii. officiating Pay: When an officer had officiated continuously on a particular scale of pay or would have officiated on that scale but for his officiating appointment to a post on a higher scale or proceeding on leave or deputation for a minimum period of three years immediately before November 1, 1956, the pay on which he had so officiated should be protected as if it were pay and scale drawn in a substantive capacity.'",
      "type": "background",
      "date": "1957-03-27",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Seniority for promotions and reversions computed on regional basis (separate list for Ajmer), not state-wide, leading to supersession by juniors from other regions.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order of reversion dated April 6, 1957 violated provisions of s.115 of States Reorganisation Act, particularly proviso to sub-s.(7), as alteration of conditions of service to disadvantage without Central Government approval.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Standing Order 46 constituted a condition of service protected under s.115(7) of the Act, prohibiting reversion except in strict order of seniority.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Central Government direction under s.117 protected right to continue in officiating post.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether maintenance of regional seniority lists for promotions/reversions violated Art.14 of Constitution.",
      "framed_by": "respondent"
    },
    {
      "id": "i5",
      "text": "Whether Standing Orders had statutory basis under Police Act 1861 ss.12 or 2.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Reversion not by way of punishment under Art.311; no legal right to continue in officiating post; s.116(2) permits competent authority to pass orders affecting continuance in post.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "States Reorganisation Act s.116(2); Parshotam Lal Dhingra v. Union of India"
    },
    {
      "id": "pa2",
      "text": "Standing Order 46 not a condition of service; issued by IG Police without statutory authority; Police Act s.12 relates to organisation, not conditions of service; s.2 empowers State Government, not IG.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Police Act 1861 ss.12, 2"
    },
    {
      "id": "pa3",
      "text": "Central Government letter protects only officiating pay, not right to post; respondent did not qualify as less than 3 years officiation.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "States Reorganisation Act s.117"
    },
    {
      "id": "pa4",
      "text": "Regional seniority justified by administrative considerations; no violation of Art.14 as plea vague, no facts/evidence.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Art.14 Constitution; Police Act s.2"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Reversion altered conditions of service to disadvantage without Central Government sanction under s.115(7); right to retain officiating post is condition of service.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "States Reorganisation Act s.115(7)"
    },
    {
      "id": "ra2",
      "text": "Central Government direction under s.117 rendered right to retain officiating post a condition of service.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "States Reorganisation Act s.117"
    },
    {
      "id": "ra3",
      "text": "Standing Orders part of conditions of service; reversion violated order of seniority in Standing Order 46.",
      "supporting_facts": [
        "f12",
        "f7"
      ],
      "legal_basis": "Police Act 1861 ss.12,2; States Reorganisation Act s.115(7)"
    },
    {
      "id": "ra4",
      "text": "Regional seniority lists violated Art.14 equality.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Art.14 Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Standing Order 46 deals with confirmation, not reversion order; even if so, no statutory basis; issued by IG without authority under Police Act s.12 (organisation) or s.2 (State Government power); no delegation.",
      "addresses_issue": "i2",
      "key_observation": "Standing Orders merely administrative instructions, not conditions of service enforceable in court."
    },
    {
      "id": "cr2",
      "text": "No condition of service that officiating Sub-Inspector cannot be reverted to substantive post; per Parshotam Lal Dhingra, no legal right to continue in officiating post, terminable at any time.",
      "addresses_issue": "i1",
      "key_observation": "Proviso to s.115(7) does not protect against reversion as it is not a condition of service."
    },
    {
      "id": "cr3",
      "text": "Central Government letter protects only pay for 3-year officiators; respondent had less than 3 years; does not protect post continuance; s.116(2) saves State powers.",
      "addresses_issue": "i3",
      "key_observation": "Direction limited to pay protection."
    },
    {
      "id": "cr4",
      "text": "Art.14 plea too vague; no pleadings/facts/evidence; cannot decide; liberty to file fresh petition.",
      "addresses_issue": "i4",
      "key_observation": "Pleadings insufficient for determination."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Standing Order 46 not a condition of service; reversion not violation of s.115 States Reorganisation Act as no right to continue in officiating post.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court erred in allowing writ petition.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Parshotam Lal Dhingra v. Union of India",
      "citation": "1958 S.C.R. 828",
      "treatment": "followed",
      "relevance": "No legal right to continue in officiating post; reversion not reduction in rank unless punitive."
    },
    {
      "case_name": "State of Bombay v. P.A. Abraham",
      "citation": "Civil Appeal 59 of 1961 (decided December 12, 1961)",
      "treatment": "referred",
      "relevance": "Supports no legal right to officiating post."
    }
  ],
  "statutes_cited": [
    {
      "name": "States Reorganisation Act, 1956",
      "sections": [
        "115",
        "116",
        "117"
      ],
      "relevance": "Absorption of services; protection of conditions to disadvantage only with Central approval; permits post continuance orders; Central directions binding."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "133(1)(c)",
        "226",
        "311",
        "14"
      ],
      "relevance": "Certificate for appeal; writ jurisdiction; no punitive reduction; equality."
    },
    {
      "name": "Police Act, 1861",
      "sections": [
        "12",
        "2"
      ],
      "relevance": "IG powers on organisation, not conditions; State Government determines conditions for subordinate ranks."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "243"
      ],
      "relevance": "Conditions determined by Acts relating to police forces."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court judgment set aside; writ petition dismissed without prejudice to respondent's right to file fresh petition on Art.14 grounds regarding regional seniority.",
    "relief_granted": "None; liberty to file fresh petition.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'The petitioner before us was appointed to a higher post on an officiating basis. He had no right to continue in that post and under the general law the implied term of such appointment was that it was terminable at any time on reasonable notice by Government'",
      "speaker": "court",
      "significance": "From Parshotam Lal Dhingra; crux that no legal right to officiating post."
    },
    {
      "text": "Nothing in this section shall be deemed to prevent a competent authority, after the appointed day, from passing in relation to any such person any order affecting his continuance in such post or office.",
      "speaker": "court",
      "significance": "s.116(2) States Reorganisation Act; saves State power to revert."
    },
    {
      "id": "kq3",
      "text": "'the conditions of service applicable immediately before the appointed day to the case of any person referred to in sub-section (1) or sub-section (2) shall not be varied to his disadvantage except with the previous approval of the Central Government.'",
      "speaker": "court",
      "significance": "Proviso s.115(7); court holds reversion not such variation."
    }
  ],
  "_case_id": "1963_55",
  "_label": 1,
  "_text_length": 23864,
  "_extracted_at": "2026-02-10T19:47:43.313447"
}