{
  "metadata": {
    "case_name": "Appellant (Vendor) v. Respondents (Purchasers)",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "SINHA C.J."
    ],
    "case_number": "Civil Appeal No. 559 of 1962",
    "date_of_judgment": "1963-03-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "House property situate in Tughlak Road, New Delhi, belonging to the appellant and built on a lease-hold plot granted by the Government in the year 1935 to her predecessor-in-title.",
      "type": "background",
      "date": "1935",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Plaintiffs entered into a contract of sale in respect of the disputed property for the sum of Rs. 1,10,000/-. The deed of agreement is dated September 4, 1956.",
      "type": "material",
      "date": "1956-09-04",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Agreement provided that the vendor shall obtain the permission of the Chief Commissioner to the transaction of sale within two months of the agreement, and if the said permission was not forthcoming within that time, it was open to the purchasers to extend the date or to treat the agreement as cancelled.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "As the necessary permission was not forthcoming within the stipulated time, the purchasers extended the time by another month.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant had made an application to the proper authorities for the necessary permission, but withdrew her application to the Chief Commissioner by her letter dated April 12, 1957.",
      "type": "material",
      "date": "1957-04-12",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Plaintiffs called upon the defendant several times to fulfil her part of the agreement but she failed to do so. Plaintiffs had always been ready and willing to perform their part of the contract and it was the defendant who had backed out of it.",
      "type": "disputed",
      "date": null,
      "source": "plaintiffs"
    },
    {
      "id": "f7",
      "text": "Suit for specific performance of the contract for sale or in the alternative for damages amounting to Rs. 51,100/- filed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Trial Court dismissed the suit for specific performance and decreed Rs. 11,550/- by way of damages with proportionate costs against the defendant. Found plaintiffs ready and willing, defendant backed out, but agreement inchoate due to no prior sanction.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "High Court on appeal held agreement was a completed contract subject to sanction, trial court erred, decreed specific performance. Recorded damages of Rs. 5,775/- if main relief fails.",
      "type": "procedural",
      "date": "1961-03-21",
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Is the contract contingent or impossible of performance and is uncertain and vague and is therefore void? (Issue No. 8)",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The contract is not enforceable being of a contingent nature and the contingency not having been fulfilled.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "This was not a fit case in which specific performance of contract should be enforced by the Court.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Agreement was a completed contract for sale subject to sanction of Chief Commissioner before sale could be concluded. Vendor to blame for withdrawing application.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5",
        "f6"
      ],
      "legal_basis": "Motilal v. Nanhelal (1930 L.R. 57 I.A. 333)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "There is no substance in the contention that the contract is not enforceable being contingent. Parties bound themselves by the terms. Vendor to make application for permission, she made but withdrew. Plaintiffs ready and willing, defendant wilfully refused. Time not essence.",
      "addresses_issue": "i1",
      "key_observation": "Agreement completed between parties; condition for vendor to obtain sanction does not render it incomplete."
    },
    {
      "id": "cr2",
      "text": "High Court correct in decreeing specific performance. Direct defendant to make necessary application within one month, convey within one month of sanction. If refused, damages as per High Court.",
      "addresses_issue": "i1",
      "key_observation": "Court to enforce terms and enjoin defendant to apply; Chief Commissioner to decide on sanction."
    },
    {
      "id": "cr3",
      "text": "Will not allow new pleas like not fit case for specific performance raised first time in Supreme Court.",
      "addresses_issue": null,
      "key_observation": "Plea not raised in High Court, no facts pleaded."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Contract is enforceable; decree specific performance directing vendor to apply to Chief Commissioner within one month from today and convey property within one month of receipt of sanction. If sanction refused, plaintiffs entitled to damages as decreed by High Court.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Motilal v. Nanhelal",
      "citation": "1930 L.R. 57 I.A. 333",
      "treatment": "followed",
      "relevance": "Agreement is completed contract even with condition for sanction; condition does not render contract incomplete."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed. Supreme Court upholds High Court's decree for specific performance with additional directions: defendant to apply to Chief Commissioner within one month and convey property within one month of sanction; if refused, damages of Rs. 5,775/- as per High Court.",
    "relief_granted": "Specific performance with directions to apply for and obtain sanction; alternative damages if sanction refused.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "In our opinion, there is no substance in this contention. So far as the parties to the contract are concerned, they had agreed to bind themselves by the terms of the document executed between them.",
      "speaker": "court",
      "significance": "Rejects argument that contract contingent and unenforceable."
    },
    {
      "text": "The Court has got to enforce the terms of the contract and to enjoin upon the defendant appellant to make the necessary application to the Chief Commissioner.",
      "speaker": "court",
      "significance": "Directs specific enforcement including re-application for permission."
    }
  ],
  "_case_id": "1963_242",
  "_label": 0,
  "_text_length": 7585,
  "_extracted_at": "2026-02-10T19:50:16.562633"
}