{
  "metadata": {
    "case_name": "Union of India v. Ram Charan",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal J."
    ],
    "case_number": "Civil Appeal No. 1115 of 1962",
    "date_of_judgment": "1963-04-30"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Ram Charan obtained a decree for money against the Union of India on January 6, 1955.",
      "type": "background",
      "date": "1955-01-06",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Union of India presented an appeal on April 6, 1955, in the High Court.",
      "type": "procedural",
      "date": "1955-04-06",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Ram Charan, the sole respondent, filed a cross-objection on July 31, 1955.",
      "type": "procedural",
      "date": "1955-07-31",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "On February 6, 1956 the High Court passed an order in connection with the surety bond. Ram Charan was represented at the proceedings.",
      "type": "procedural",
      "date": "1956-02-06",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Ram Charan died on July 21, 1957.",
      "type": "material",
      "date": "1957-07-21",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On March 18, 1958 an application was presented to the High Court on behalf of the appellant under O. XXII, r. 4, read with s. 151, Code of Civil Procedure, stating that Ram Charan died on July 21, 1957, that the Divisional Engineer, Telegraphs, Ambala Cantonment, learnt of his death on February 3, 1958, and that the deceased had left as his legal representatives, an adopted son and a widow.",
      "type": "procedural",
      "date": "1958-03-18",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The affidavit filed in support of the March 18, 1958 application did not convey any further information and it was solemnly affirmed by the deponent (Divisional Engineer, Telegraphs, Ambala Cantonment) that the averments were true to his belief.",
      "type": "procedural",
      "date": "1958-03-18",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "On May 13, 1958, the widow of Ram Charan applied that she alone was the legal representative of Ram Charan under a will and that the alleged adopted son was not the legal representative.",
      "type": "disputed",
      "date": "1958-05-13",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The appellant's application for bringing on record the legal representatives of the deceased Ram Charan came up for hearing on May 14, 1958. The Court ordered the application to be heard at the time of the hearing of the appeal as there was a difference of opinion in the Court as to whether limitation under O. XXII of the Code started from the date of death or from the date of knowledge of death.",
      "type": "procedural",
      "date": "1958-05-14",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Subsequently, on an application on behalf of the legal representatives, it was ordered that the question of abatement be decided first and thereafter the printing of the record be taken on hand.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The application for substitution came up for decision on February 16, 1960. It was dismissed, the Court holding that the Union of India had failed to show that it was prevented from any sufficient cause from continuing the appeal.",
      "type": "procedural",
      "date": "1960-02-16",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "On February 26, 1960, the appeal itself was dismissed as having abated.",
      "type": "procedural",
      "date": "1960-02-26",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "On May 14, 1960, an application for leave to appeal to the Supreme Court was presented to the High Court and rejected on May 17, 1960.",
      "type": "procedural",
      "date": "1960-05-14",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Special leave to appeal was granted by the Supreme Court from the judgments and orders dated February 16 and 26, 1960, of the Punjab High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant showed sufficient cause under Order XXII Rule 9 CPC for not making an application to bring the legal representatives of the deceased respondent on record within time, such that the abatement of the appeal could be set aside.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether mere ignorance of the death of the respondent constitutes sufficient cause for the delay in applying for substitution of legal representatives.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether limitation for application under Order XXII Rule 4 starts from date of death or date of knowledge of death.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Mere ignorance of death of the respondent was sufficient cause for the appellants inability to apply for the impleading of the legal representatives within time, unless it be that the appellant was guilty of some negligence or some act or omission which led to the delay in his making the application.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "Order XXII Rule 9 CPC; sufficient cause to be liberally construed"
    },
    {
      "id": "pa2",
      "text": "Once the respondent is served in the first appeal, no duty is cast on the appellant to make regular enquiries about the state of health of the respondent.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The expression sufficient cause should be liberally construed in order to advance the cause of justice.",
      "supporting_facts": [],
      "legal_basis": "Code of Civil Procedure"
    },
    {
      "id": "pa4",
      "text": "The Court itself has inherent power to add legal representatives to do full justice to the party.",
      "supporting_facts": [],
      "legal_basis": "Section 151 CPC"
    },
    {
      "id": "pa5",
      "text": "The High Court misapplied the decision of the Full Bench of its Court to the facts of the present case.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Firm Dittu Ram Eyedan v. Om Press Co. Ltd."
    },
    {
      "id": "pa6",
      "text": "Limitation for such an application starts not from the date of death of the respondent but from the date of the appellants knowledge of the death of the respondent.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Order XXII CPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The widow alone was the legal representative of Ram Charan under a will and the alleged adopted son was not the legal representative.",
      "supporting_facts": [
        "f5",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rejected preliminary objection that special leave cannot be granted since no application for certificate against Feb 26 order; the leave application effectively covered both orders.",
      "addresses_issue": null,
      "key_observation": "The application for leave to appeal stated facts referring to both proceedings."
    },
    {
      "id": "cr2",
      "text": "High Court erred in stating application was under r.9 also and in reasons for delay, but that does not affect the merits.",
      "addresses_issue": "i1",
      "key_observation": "Appellant failed to establish sufficient cause."
    },
    {
      "id": "cr3",
      "text": "Mere ignorance of death is not sufficient cause under r.9; appellant must allege and prove reasons for not knowing earlier, especially when challenged.",
      "addresses_issue": "i2",
      "key_observation": "The law imposes obligation on appellant to show absence of negligence."
    },
    {
      "id": "cr4",
      "text": "No duty to make regular enquiries, but mere belated knowledge does not suffice; must scrutinize evidence of default.",
      "addresses_issue": "i2",
      "key_observation": "Court not over-strict but must not readily accept allegations."
    },
    {
      "id": "cr5",
      "text": "Limitation under Art.171 Limitation Act starts from date of death, not knowledge; 3 months period plus s.5 provisions sufficient.",
      "addresses_issue": "i3",
      "key_observation": "Legislature expected plaintiff to learn within time."
    },
    {
      "id": "cr6",
      "text": "Appellant adopted wrong attitude: application not under r.9, no reasons beyond bare statement, affidavit on belief not knowledge, argued wrong limitation start date showing lack of knowledge of law.",
      "addresses_issue": "i1",
      "key_observation": "Damaging conduct by appellant."
    },
    {
      "id": "cr7",
      "text": "No inherent power under s.151 to substitute after abatement not set aside for lack of sufficient cause.",
      "addresses_issue": "i1",
      "key_observation": "Fourth contention has no force."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Mere ignorance of the death of the opposite party is not sufficient cause under Order XXII r.9 CPC; the applicant must prove reasons for the ignorance and absence of negligence.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The appellant failed to establish sufficient cause for not applying within time to bring legal representatives on record or to set aside abatement.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Limitation for substitution application under Order XXII r.4 starts from date of death, not date of knowledge.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Firm Dittu Ram Eyedan v. Om Press Co. Ltd.",
      "citation": "1960 11. L. R. Punj 935 (Full Bench)",
      "treatment": "followed",
      "relevance": "Ignorance of death not sufficient cause for setting aside abatement without showing absence of want of care."
    },
    {
      "case_name": "State of Punjab v. Nathu Ram",
      "citation": "1962 2 S. C. R. 636",
      "treatment": "referred",
      "relevance": "Effect of abatement on suit of surviving plaintiffs or against surviving defendants."
    },
    {
      "case_name": "Jhanda Singh v. Gurmukh Singh",
      "citation": "C. A. No. 344 of 1956 decided on April 10, 1962",
      "treatment": "referred",
      "relevance": "Effect of abatement on suit of surviving plaintiffs or against surviving defendants."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order XXII Rule 4",
        "Order XXII Rule 9",
        "Order XXII Rule 11",
        "Section 151"
      ],
      "relevance": "Governs substitution of legal representatives upon death, abatement of suit/appeal, and setting aside abatement upon showing sufficient cause."
    },
    {
      "name": "Limitation Act",
      "sections": [
        "Article 171",
        "Article 176",
        "Section 5"
      ],
      "relevance": "Prescribes 3 months limitation for substitution from date of death; 2 months plus s.5 for setting aside abatement."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the Punjab High Court's orders dismissing the application for substitution of legal representatives and dismissing the appeal as abated, finding no sufficient cause shown by the Union of India.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Mere ignorance of the death of the opposite party is not sufficient. He had to state reasons which, according to him, led to his not knowing of the death of the defendant within reasonable time and to establish those reasons to the satisfaction of the Court.",
      "speaker": "court",
      "significance": "Defines the standard for 'sufficient cause' under Order XXII r.9 CPC."
    },
    {
      "text": "The bare statement of the applicant that he came to know of the death of the other party more than three months after the death will not ordinarily be sufficient for the Courts holding that the applicant had sufficient cause.",
      "speaker": "court",
      "significance": "Rejects mere belated knowledge as grounds to set aside abatement."
    },
    {
      "text": "The appellant had adopted a very wrong attitude from the very beginning... The stand taken by it was that limitation for such an application starts not from the date of death... but from the date of the appellants knowledge.",
      "speaker": "court",
      "significance": "Highlights appellant's erroneous legal position contributing to failure."
    }
  ],
  "_case_id": "1963_259",
  "_label": 0,
  "_text_length": 21416,
  "_extracted_at": "2026-02-10T19:51:08.596870"
}