{
  "metadata": {
    "case_name": "University of Mysore & Anr. v. C.D. Govinda Rao",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeals Nos. 417 and 418 of 1963",
    "date_of_judgment": "1963-08-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent C.D. Govinda Rao filed writ petition in Mysore High Court under Art. 226 praying for writ of quo warranto against Anniah Gowda holding post of Research Reader in English in Central College, Bangalore, and writ of mandamus directing University of Mysore to appoint him to that post.",
      "type": "procedural",
      "date": "1960-10-15",
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "University of Mysore published advertisement on 31st July 1959 for posts including Professor and Reader in English under U.G.C. Scheme.",
      "type": "background",
      "date": "1959-07-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Prescribed qualifications: (1) First or High Second Class Masters Degree of Indian University or equivalent of foreign University; (2) Research Degree of Doctorate standard or published work of high standard; (3) Ordinarily ten years (not less than five) experience teaching post-graduate classes and guiding research for Professors, at least five years teaching degree classes and independent research for Readers; Knowledge of Kannada desirable.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Board of Appointments constituted under s.26(2) Mysore University Act, 1956: Vice-Chancellor, Prof. P.E. Dastoor (Delhi Univ.), Prof. L.D. Murphy (Madras); consulted Prof. C.D. Narasimhiah.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Four applications received for Professor and Reader in English; interviewed on June 8, 1960. None fit for Professor (grade 800-1250); Anniah Gowda unanimously recommended for Reader (grade 500-25-800).",
      "type": "procedural",
      "date": "1960-06-08",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Board's report approved by Chancellor on October 3, 1960; Anniah Gowda assumed charge on October 31, 1960.",
      "type": "procedural",
      "date": "1960-10-03",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Mysore High Court held appointment of Anniah Gowda invalid, quashed Board's resolution and Chancellor's appointment; refused mandamus to respondent as his entitlement not automatic.",
      "type": "procedural",
      "date": "1962-03-07",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court certificate for appeal refused; special leave granted by Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Anniah Gowda secured 50.2% in Masters Degree (Indian University); also holds M.A. from University of Durham.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "High Court found Anniah Gowda did not satisfy first qualification (high Second Class Masters); no definite finding against him on second or third qualifications.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Respondent claimed appointment illegal in face of prescribed qualifications (advertisement).",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Appellants disputed validity of respondent's claim; led evidence via affidavits.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Statutory rules/ordinances under Mysore University Act approved by Chancellor on January 22, 1960; no evidence when they came into force.",
      "type": "background",
      "date": "1960-01-22",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Affidavit by Thimmaraju produced statement from service register showing >5 years teaching experience; later clarified as from individual and gazetted registers.",
      "type": "disputed",
      "date": "1961-06-01",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Anniah Gowda's affidavit detailed teaching assignments exceeding 5 years.",
      "type": "material",
      "date": "1961-07-22",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appointment of Anniah Gowda as Research Reader was invalid for not satisfying the prescribed qualifications, particularly the first qualification of a First or High Second Class Masters Degree or equivalent.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether writ of quo warranto was appropriate to challenge the appointment on the basis of inconsistency with advertised qualifications.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether statutory rules and ordinances under Mysore University Act were contravened in the appointment.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Anniah Gowda properly appointed; satisfied all qualifications including first (M.A. Durham equivalent to high Second Class Indian Masters) and had published works for second, >5 years teaching experience for third.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6",
        "f9",
        "f15"
      ],
      "legal_basis": "Mysore University Act, 1956 s.26(2); U.G.C. Scheme"
    },
    {
      "id": "pa2",
      "text": "High Court erred in not deferring to expert Board's unanimous recommendation on academic qualifications.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "No contravention of statutory rules/ordinances raised properly before High Court.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Mysore University Act, 1956 s.42(5)"
    },
    {
      "id": "pa4",
      "text": "Material on teaching experience not intended to mislead; inaccuracy in affidavit explained.",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appointment illegal as Anniah Gowda did not have high Second Class Masters (50.2% borderline); did not satisfy qualifications.",
      "supporting_facts": [
        "f3",
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Appointment contravened statutory rules/ordinances framed under Mysore University Act.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Mysore University Act, 1956; Ordinances approved 1960-01-22"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court erred: first qualification has two parts; M.A. Durham held by Anniah Gowda equivalent to high Second Class Indian Masters; Board of experts satisfied he met it. Courts hesitate to differ on academic matters.",
      "addresses_issue": "i1",
      "key_observation": "Board likely took foreign degree as equivalent; also satisfies second via published works."
    },
    {
      "id": "cr2",
      "text": "No proper raising of statutory rules/ordinances before High Court; attack confined to advertised qualifications.",
      "addresses_issue": "i3",
      "key_observation": "New ground not open in appeal."
    },
    {
      "id": "cr3",
      "text": "Quo warranto requires public office held by usurper without legal authority; proceeded on assumption inconsistency with ad suffices, but High Court should check statutory contravention with regard to experts.",
      "addresses_issue": "i2",
      "key_observation": "Courts slow to interfere with University expert Boards absent mala fides."
    },
    {
      "id": "cr4",
      "text": "High Court criticism of Board unwarranted; they carefully considered, rejected all for Professor, selected Anniah Gowda for Reader.",
      "addresses_issue": "i1",
      "key_observation": "Not executive fiat or quasi-judicial."
    },
    {
      "id": "cr5",
      "text": "Harsh criticism of University on teaching experience material unjustified; facts established by affidavit and registers, minor inaccuracy in source statement.",
      "addresses_issue": "i1",
      "key_observation": "Teaching experience >5 years proven."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Anniah Gowda satisfied first qualification via equivalent foreign M.A.; appointment valid.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court writ of quo warranto quashing appointment set aside.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Halsbury's Laws of England",
      "citation": "3rd ed., vol. 11, p. 145",
      "treatment": "referred",
      "relevance": "Explains nature of quo warranto: for public office usurpers, to check executive appointments against law."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for writ petition in High Court."
    },
    {
      "name": "Mysore University Act, 1956 (No. 23 of 1956)",
      "sections": [
        "s.26(2)",
        "s.26(1)(e)",
        "s.42(5)"
      ],
      "relevance": "Board constitution; rules/ordinances come into force on gazette publication or Chancellor direction."
    },
    {
      "name": "University Grants Commission Act, 1956",
      "sections": [
        "s.26(1)(e)"
      ],
      "relevance": "Regulations for appointments under U.G.C. grant."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; judgment and order of Mysore High Court dated March 7, 1962 set aside; appointment of Anniah Gowda upheld.",
    "relief_granted": "Quashing of High Court writ restored status quo ante.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Boards of Appointments are nominated by the Universities and when recommendations made by them and the appointments following on them, are challenged before courts, normally the courts should be slow to interfere with the opinions expressed by the experts.\"",
      "speaker": "court",
      "significance": "Principle of judicial deference to academic experts."
    },
    {
      "text": "\"the procedure of quo warranto gives the judiciary a weapon to control the Executive from making appointments to public office against law\"",
      "speaker": "court",
      "significance": "Defines scope of quo warranto."
    },
    {
      "text": "\"It is plain that Masters Degree of the Durham University which appellant No. 2 has obtained, can be and must have been taken by the Board to be equivalent to a high Second Class Masters Degree of an Indian University\"",
      "speaker": "court",
      "significance": "Key finding reversing High Court on qualification."
    }
  ],
  "_case_id": "1963_301",
  "_label": 1,
  "_text_length": 28207,
  "_extracted_at": "2026-02-10T19:51:01.512309"
}