{
  "metadata": {
    "case_name": "Mohan Singh v. Bhanwarlal",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 530 of 1963",
    "date_of_judgment": "1963-10-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Eight candidates including appellant Mohan Singh and first respondent Bhanwarlal filed nomination papers for election to Madhya Pradesh Legislative Assembly from Sitamau constituency.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Nomination of Hussain Khan rejected by Returning Officer at initial scrutiny.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Himmat Singh withdrew candidature before date of polling.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Polling took place on February 24, 1962.",
      "type": "material",
      "date": "1962-02-24",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On counting votes, Mohan Singh secured largest number of votes and declared elected.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Bhanwarlal applied under s.80 r/w ss.100 and 101 of Representation of the People Act 1951 to Election Commission for declaring Mohan Singh's election void, disqualify him for corrupt practices, and declare Bhanwarlal elected.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Two surviving grounds in petition: Mohan Singh published two leaflets (annexures D and E) containing false statements of fact re personal character/conduct of Bhanwarlal, believed false, calculated to prejudice prospects.",
      "type": "disputed",
      "date": "shortly before polling",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Petition referred for trial by Election Commission to Election Tribunal, Ratlam under s.86.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Mohan Singh denied publishing leaflets in written statement, claimed factual fair criticism of public activities, not calculated to prejudice.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Mohan Singh applied to Tribunal to dismiss petition in limine for non-compliance s.82, non-joinder of Himmat Singh against whom corrupt practice alleged re withdrawal.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Tribunal rejected dismissal application, held Mohan Singh and agents committed corrupt practice u/s 123(4) by publishing leaflets D and E containing false statements known/believed false, prejudicing Bhanwarlal.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Tribunal relied primarily on testimony of Rameshchandra (compositor, Maheshwari Printing Press, Mandsaur) and corroborative circumstances.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court of Madhya Pradesh in appeal (First Appeal No.34/1962, judgment Feb 14, 1963) agreed with Tribunal: Mohan Singh instrumental in printing leaflets D and E, distributed by him and agents Satyanarayan and Kailash in certain villages.",
      "type": "admitted",
      "date": "1963-02-14",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Para 11(b) of petition: On Jan 20, 1962, Mohan Singh offered at Nahargarh to help Himmat Singh procure job in Dalauda Sugar Factory or elsewhere to withdraw candidature; as consequence, Himmat withdrew.",
      "type": "disputed",
      "date": "1962-01-20",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Appeal to Supreme Court with special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Bhanwarlal denied collecting/ misappropriating Rs.28,000 from agriculturists re opium licences; amounts collected by District Congress Committee with receipts.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "No attempt at trial to prove truth of imputations in leaflets.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Mohan Singh's written statement did not plead imputations true or believed true.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether election petition liable to be dismissed in limine for non-compliance with s.82 RP Act due to non-joinder of Himmat Singh.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether Mohan Singh published leaflets annexures D and E.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether publication of leaflets constitutes corrupt practice u/s 123(4) RP Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Mohan Singh published leaflets D and E containing false statements re personal character/conduct of Bhanwarlal, believed false, calculated to prejudice election prospects.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s.123(4) RP Act 1951"
    },
    {
      "id": "pa2",
      "text": "Mohan Singh offered illegal gratification to Himmat Singh to withdraw candidature.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "s.123(1) RP Act 1951"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Did not publish leaflets; leaflets contained factual fair criticism of public activities, not calculated to prejudice.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Petition not maintainable for non-joinder of Himmat Singh u/s 82 as allegation in para 11(b) imputes corrupt practice against him.",
      "supporting_facts": [
        "f10",
        "f14"
      ],
      "legal_basis": "s.82 RP Act 1951"
    },
    {
      "id": "ra3",
      "text": "Approach to evidence as in criminal trial; corrupt practice not proved beyond reasonable doubt.",
      "supporting_facts": [
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Para 11(b) does not allege corrupt practice against Himmat Singh; mere offer to help secure employment not 'gratification' u/s 123(1)(B); no need to implead Himmat Singh u/s 82.",
      "addresses_issue": "i1",
      "key_observation": "Gratification means something valuable calculated to satisfy desire; mere offer to help get job not gratification."
    },
    {
      "id": "cr2",
      "text": "Concurrent findings of Tribunal and High Court on publication by Mohan Singh and agents, based on Rameshchandra's testimony and circumstances, accepted; no interference with concurrent findings of fact.",
      "addresses_issue": "i2",
      "key_observation": "Evidence clear beyond reasonable doubt; onus discharged."
    },
    {
      "id": "cr3",
      "text": "Leaflets D and E contain false statements (Bhanwarlal collected Rs.28,000 from agriculturists re opium licences, defrauded/misappropriated); re personal conduct; published with knowledge false/not believed true; reasonably calculated to prejudice prospects.",
      "addresses_issue": "i3",
      "key_observation": "Innuendo clear from reading both leaflets together; common knowledge re opium licences; no proof of truth."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Election petition maintainable; no non-compliance s.82.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Mohan Singh published leaflets D and E.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Publication constitutes corrupt practice u/s 123(4) RP Act.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "s.80",
        "s.100",
        "s.101",
        "s.82",
        "s.86",
        "s.123(4)",
        "s.123(1)",
        "s.79",
        "s.81",
        "s.85",
        "s.90(3)",
        "s.78"
      ],
      "relevance": "Governing election petitions, corrupt practices (bribery, false statements), parties to be joined, dismissal for non-compliance."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding High Court and Tribunal findings that Mohan Singh committed corrupt practice u/s 123(4) by publishing false defamatory leaflets against Bhanwarlal, rendering his election void.",
    "relief_granted": "Election of Mohan Singh declared void (as per lower courts).",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the corrupt practice must be established beyond reasonable doubt by evidence which is clear and unambiguous.\"",
      "speaker": "court",
      "significance": "Standard of proof for corrupt practices in election petitions."
    },
    {
      "text": "\"Gratification in its ordinary connotation means satisfaction... a mere offer to help in securing employment... would not amount to such gratification.\"",
      "speaker": "court",
      "significance": "Interpretation of 'gratification' u/s 123(1)(B); rejects non-joinder ground."
    },
    {
      "text": "\"The test in cases under s.123(4) is whether the imputation beside being false in fact, is published with the object of lowering the candidate in the estimation of the electorate.\"",
      "speaker": "court",
      "significance": "Criteria for corrupt practice u/s 123(4)."
    }
  ],
  "_case_id": "1963_265",
  "_label": 0,
  "_text_length": 23445,
  "_extracted_at": "2026-02-10T19:51:07.208094"
}