{
  "metadata": {
    "case_name": "Deoki Nandan & Ors. v. Kanpur Development Board & Ors.",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo J."
    ],
    "case_number": "Civil Appeals Nos. 166 and 167 of 1962",
    "date_of_judgment": "1963-04-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Deoki Nandan, appellant in appeal No. 167, is the lessee of two plots in Anwarganj, Bans Mandi, Kanpur, and his lease is for a period of 99 years from 1943. On these plots there exists a mill known as Om Cotton Ginning and Oil Mill. Besides the mill there are pacca godowns also on the plots and two-thirds of the area is under buildings while one-third is open land paved with bricks. No part of the land is waste or arable.",
      "type": "background",
      "date": "1943",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In February 1932 the Government of U. P. sanctioned by notification a scheme known as Pechbagh Dalelpurwa Scheme No. XX of the Improvement Trust Kanpur.",
      "type": "background",
      "date": "1932-02",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Improvement Trust Kanpur has now been replaced by the Development Board Kanpur by the Kanpur Urban Area Development Act, No. VI of 1945, which repealed the U. P. Town Improvement Act, No. III of 1920, insofar as it applied to Kanpur.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Scheme No. XX was not fully carried out.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In 1955 a scheme known as subsidized industrial housing scheme was sponsored by Housing Department of the U. P. Government. This scheme was to be put in force in four phases. For the fourth phase the Government of India had sanctioned over rupees two crores and it was decided to build 6973 tenements of which 1368 were to be in an Ahata on the Hamirpur road. The lands in dispute are in this locality.",
      "type": "background",
      "date": "1955",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The decision in this connection was taken by the Government of U. P. in May 1955.",
      "type": "procedural",
      "date": "1955-05",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On January 6, 1956, a notification was issued under s. 4 of the Land Acquisition Act, No. I of 1894 by the Governor of U. P. to the effect that the two plots in dispute were required for the construction of tenements in the fourth phase of the subsidized industrial housing scheme sponsored by the Government of U. P. as well as for general improvement and street scheme No. XX of the Board.",
      "type": "procedural",
      "date": "1956-01-06",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "This was followed by a notification under s. 6 of the Land Acquisition Act on January 31, 1956. That notification further said that the case being one of urgency the Governor was pleased under sub-ss. (1) and (1-A) of s. 17 of the Land Acquisition Act to direct that the Collector of Kanpur, though no award under s. 11, has been made, might on the expiration of the notice mentioned in s. 9(1) take possession of lands, buildings and structures forming part of the land mentioned in the schedule for public purposes.",
      "type": "procedural",
      "date": "1956-01-31",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Then followed a notice under s. 9 by the Collector on February 10, 1956, which said that possession would be taken over 15 days after the issue of the notice i.e. on February 25, 1956.",
      "type": "procedural",
      "date": "1956-02-10",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On receipt of this notice, Deoki Nandan appellant filed his objections before the Collector on February 21, 1956.",
      "type": "procedural",
      "date": "1956-02-21",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Two days later, on February 23, 1956, he filed the writ petition in the High Court out of which the present appeal has arisen.",
      "type": "procedural",
      "date": "1956-02-23",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The writ petition was dismissed by the learned Single judge who heard it. On the first question he held that this was not a case to which the Kanpur Act applied. On the second question, he held that s. 17(4) applied and therefore it was not necessary to take proceedings to comply with s. 5-A before issuing a notification under s. 6.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Then followed an appeal which was heard by a Division Bench of the High Court. The appeal court upheld the view taken by the learned Single Judge and dismissed the appeal. However, the appeal court granted a certificate as prayed for.",
      "type": "procedural",
      "date": "1957-10-25",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "It is not in dispute that no action was taken under s. 5-A and no report was made as required therein.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "It is not in dispute that no such procedure was gone through in the present case insofar as scheme No. XX is concerned.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "It is not in dispute before us that the land in the present case was required for planned development.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "As the acquisition was for the purposes of scheme No. XX of the Board, action had to be taken in accordance with s. 114 of the Kanpur Act and the schedule thereto and as no action had been so taken, the proceedings for acquisition were bad.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "It was not open to the Governor to issue the notification under s. 6 of the Land Acquisition Act without first taking action under s. 5-A thereof.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "As the acquisition was for scheme No. XX of the Board, action should have been taken under the Kanpur Act and as this was not done the entire proceedings are bad including the issue of the notifications under s. 4 and s. 6.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f7",
        "f8",
        "f15"
      ],
      "legal_basis": "Kanpur Urban Area Development Act, 1945: ss. 71(1), 108, 109, 114, Ch. VII"
    },
    {
      "id": "pa2",
      "text": "S. 17(4) could not apply in the present case and no notification under s. 6 could be issued unless s. 5-A had been complied with.",
      "supporting_facts": [
        "f7",
        "f8",
        "f14"
      ],
      "legal_basis": "Land Acquisition Act, 1894: ss. 5A, 6, 17(1), 17(1A), 17(4)"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The contention that the Kanpur Act has not been complied with and therefore the proceedings for acquisition of land are bad has no force and must be rejected. Where the acquisition is by the Government under the Land Acquisition Act, for public purpose though that purpose may be the purpose of the Board, the Kanpur Act has no application at all, and the Government proceeds to acquire under the provisions of the Land Acquisition Act alone.",
      "addresses_issue": "i1",
      "key_observation": "S. 114 applies only when the Board acquires land itself under s. 71, not when Government acquires for the Board's purpose."
    },
    {
      "id": "cr2",
      "text": "It was not open to the State Government to direct under s. 17(4) that s. 5A shall not apply to land other than waste or arable acquired under s. 17(1A) for planned development, as s. 17(4) applies only to waste or arable land under s. 17(1). Sub-s. 1A does not amend s. 17(1) or s. 17(4), and they operate independently.",
      "addresses_issue": "i2",
      "key_observation": "The right to file objections under s. 5-A is a substantial right and cannot be taken away by side-wind; s. 17(1A) merely accelerates possession but does not dispense with s. 5A inquiry."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Acquisition by Government under Land Acquisition Act for Board's scheme does not require compliance with Kanpur Act modifications under s. 114.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Notification under s. 6 issued without s. 5A compliance is invalid as s. 17(4) does not apply to non-waste/arable land under s. 17(1A); part of s. 4 notification directing non-application of s. 5A is beyond powers.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Land Acquisition Act, 1894",
      "sections": [
        "4",
        "5A",
        "6",
        "9",
        "11",
        "16",
        "17(1)",
        "17(1A)",
        "17(4)"
      ],
      "relevance": "Governs acquisition procedure; s. 5A inquiry mandatory unless dispensed under s. 17(4) for applicable lands; s. 17(1A) added by U.P. Amendment allows urgency possession for planned development but does not trigger s. 17(4)."
    },
    {
      "name": "Kanpur Urban Area Development Act, 1945 (No. VI of 1945)",
      "sections": [
        "71(1)",
        "108",
        "109",
        "114",
        "Ch. VII"
      ],
      "relevance": "Modifies Land Acquisition Act for Board's own acquisitions under s. 71; does not apply to Government acquisitions for Board's purposes."
    },
    {
      "name": "U. P. Town Improvement Act, 1920 (No. III of 1920)",
      "sections": [],
      "relevance": "Repealed insofar as applied to Kanpur by Kanpur Act."
    },
    {
      "name": "Land Acquisition (U.P. Amendment) Act, 1954 (No. XXII of 1954)",
      "sections": [
        "17(1A)"
      ],
      "relevance": "Inserts s. 17(1A) to allow urgency possession for non-waste/arable land in planned development, but does not extend s. 17(4) to such lands."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeals allowed; notification under s. 6 and the part of s. 4 notification directing that s. 5A shall not apply under s. 17(4) set aside as invalid. Rest of s. 4 notification stands. Government at liberty to proceed after s. 5A inquiry and fresh s. 6 notification. Appellants' prior objections treated as under s. 5A.",
    "relief_granted": "Quashing of s. 6 notification and relevant part of s. 4; opportunity under s. 5A.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The right to file objections under s. 5-A is a substantial right when a persons property is being threatened with acquisition and we cannot accept that that right can be taken away as if by a side-wind because sub-s. (1-A) mentions sub-s. (1).",
      "speaker": "court",
      "significance": "Core reasoning for invalidating bypass of s. 5A inquiry."
    },
    {
      "text": "Where the acquisition is, as in the present case, by the Government under the Land Acquisition Act, for public purpose though that purpose may be the purpose of the Board, the Kanpur Act has no application at all.",
      "speaker": "court",
      "significance": "Rejects application of Kanpur Act modifications."
    }
  ],
  "_case_id": "1963_197",
  "_label": 1,
  "_text_length": 26497,
  "_extracted_at": "2026-02-10T19:49:39.167947"
}