{
  "metadata": {
    "case_name": "Kirpal Singh v. State",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Criminal Appeal No. 54 of 1963",
    "date_of_judgment": "1963-05-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Kirpal Singh and his father-in-law Rakkha Singh were refugees from West Pakistan. A block of agricultural land allotted by Government to Rakkha Singh and appellant was partitioned but no boundary marks were erected.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "In December 1960, dispute between Rakkha Singh and appellant and his brothers about harvesting of sugarcane planted in the land. Settled on intervention of Sardar Ajit Singh; Rakkha Singh agreed to give 700 maunds of sugarcane to appellant and brothers.",
      "type": "material",
      "date": "1960-12",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "On March 22, 1961, appellant and brothers went to house of Rakkha Singh and complained that only 400 maunds of sugarcane given out of 700 promised. Quarrel between Karam Singh (eldest son of Rakkha Singh) and appellant; Karam called them dishonest. Rakkha intervened, nothing untoward happened.",
      "type": "material",
      "date": "1961-03-22",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "On March 26, 1961 at about 6 p.m., Rakkha Singh, sons Karam Singh and Manjit Singh, and neighbour Sardar Anokh Singh sitting in thatched hut at Village Shanti Nagar. Appellant armed with gun, brothers Arjun Singh and Sarwan Singh with lathis arrived. Appellant shouted to Karam Singh to come out.",
      "type": "material",
      "date": "1961-03-26",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Karam Singh emerged; appellant said since Karam did not settle sugarcane dispute, he would settle his account, and fired gun causing chest injuries resulting in instantaneous death.",
      "type": "material",
      "date": "1961-03-26",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "On hearing gun fire, Rakkha Singh, Manjit Singh and Anokh Singh came out. Manjit tried to catch appellant and brothers but failed. Rakkha went to Puranpur police station, lodged FIR at 7:45 a.m. on March 27, 1961.",
      "type": "procedural",
      "date": "1961-03-27",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Sessions Judge, Pillibhit tried appellant and brothers for causing death of Karam Singh with gunshot. Acquitted Arjun and Sarwan Singh, convicted appellant Kirpal Singh and sentenced to death subject to High Court confirmation.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Allahabad High Court confirmed conviction and sentence on September 13, 1962 in Criminal Appeal No. 877 of 1962 and Referred No. 79 of 1962.",
      "type": "procedural",
      "date": "1962-09-13",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "At trial, Manjit Singh and Anokh Singh did not support prosecution: said incident at 8-9 p.m., heard gunfire from houses, learned from someone that Karam fired upon by masked Sardar.",
      "type": "disputed",
      "date": "1961-03-26",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Their prior statements to sub-inspector denied in cross-examination.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Rakkha Singh supported prosecution: dispute, March 22 quarrel, March 26 at 6 p.m. appellant and brothers came, appellant called Karam out, shouted about sugarcane, fired killing him. In cross: could not see faces from hut, recognized by gait and voice while running away.",
      "type": "admitted",
      "date": "1961-03-26",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Sessions Judge accepted Rakkha Singh's testimony inculpating appellant, convicted him, acquitted brothers.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Distance Shanti Nagar to Puranpur PS: 15 miles as crow flies, longer by road. Rakkha secured jeep from Sampurna Nagar Union, brought sub-inspector back.",
      "type": "procedural",
      "date": "1961-03-26",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Two police outposts near village (2 and 5 miles), but officers had no authority to record FIR.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Postmortem: 8 ozs. half-digested food in stomach, indicating death 2 hours after last meal. Rakkha: Karam took tea and pakodas at 4 p.m.",
      "type": "material",
      "date": "1961-03-26",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Committing Magistrate erred in committing accused to Sessions without recording evidence of all witnesses to actual commission of offence.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether identification of appellant by Rakkha Singh solely by voice and gait (without seeing face) is reliable, given intimacy and recent frequent meetings.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether delay in lodging FIR (6 p.m. March 26 to 7:45 a.m. March 27) casts doubt on prosecution story.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether hostile testimony of Manjit Singh and Anokh Singh, and reliance on single witness Rakkha Singh justifies acquittal.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether condition of stomach contents supports defence version of 8-9 p.m. incident.",
      "framed_by": "court"
    },
    {
      "id": "i5",
      "text": "Duty of committing Magistrate under s. 207A CrPC to record evidence of witnesses to actual commission of offence, especially in serious cases like murder.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Identification by voice risky in criminal trial, especially when not seeing face.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Gross delay in FIR justifies doubt on truth of story.",
      "supporting_facts": [
        "f6",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Manjit and Anokh hostile, support 9 p.m. masked assailant; stomach condition consistent with their version.",
      "supporting_facts": [
        "f9",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Sole witness unreliable; courts below erred in appreciating evidence.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Rakkha Singh intimately knew appellant, recent quarrels, heard voice referring to dispute; identification by voice/gait reliable in daylight.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "FIR delay explained by distance, transport, lack of authority at outposts.",
      "supporting_facts": [
        "f6",
        "f13",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Manjit and Anokh shielding appellant; prior statements inconsistent.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Stomach contents consistent with 4 p.m. meal.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Normally no review of evidence unless illegality, irregularity, or miscarriage of justice. Here, appreciation of evidence by lower courts; no question of law.",
      "addresses_issue": "i1",
      "key_observation": "Conclusion based on evidence appreciation."
    },
    {
      "id": "cr2",
      "text": "Voice identification risky generally, but appellant intimately known to Rakkha; frequent meetings fortnight before; heard calling and referring to dispute; saw gait while running.",
      "addresses_issue": "i1",
      "key_observation": "Not improbable; lower courts saw witness, accepted credibility."
    },
    {
      "id": "cr3",
      "text": "Manjit and Anokh shielding; investigation statements inconsistent.",
      "addresses_issue": "i3",
      "key_observation": "Single witness reliable in circumstances."
    },
    {
      "id": "cr4",
      "text": "FIR delay not gross: distance 15 miles crow fly, longer road; jeep secured; outposts no authority.",
      "addresses_issue": "i2",
      "key_observation": "No fault in not contacting outposts."
    },
    {
      "id": "cr5",
      "text": "Stomach: half-digested food explained by 4 p.m. tea/pakodas.",
      "addresses_issue": "i4",
      "key_observation": "Consistent with 6 p.m. incident."
    },
    {
      "id": "cr6",
      "text": "Daylight, intimate knowledge, heard dispute reference: sufficient.",
      "addresses_issue": "i1",
      "key_observation": "No ground to discard testimony."
    },
    {
      "id": "cr7",
      "text": "Committing Magistrate erred: must record witnesses to actual offence under s.207A(4) CrPC, especially serious offences; judicial discretion considering justice, accused interest.",
      "addresses_issue": "i5",
      "key_observation": "Normally examine principal witnesses; prosecutor expected to produce."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Identification by voice and gait reliable where witness intimately knows accused, recent interactions, daylight, heard specific references.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "FIR delay not fatal given explanations.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Conviction on single credible witness upheld.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Death sentence appropriate.",
      "resolves_issue": null,
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "Magistrate duty under s.207A CrPC: examine witnesses to offence; not guided solely by prosecutor.",
      "resolves_issue": "i5",
      "in_favor_of": null
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sriram v. State of Bombay",
      "citation": "(1961) 2 S.C.R. 890",
      "treatment": "referred",
      "relevance": "Nothing supports view that Magistrate guided solely by prosecutor in examining witnesses."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 207A(4)",
        "s. 173"
      ],
      "relevance": "Magistrate must take evidence of witnesses to actual commission of offence; discretion judicial, normally examine in serious cases like murder."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; conviction of appellant Kirpal Singh for murder under offence charged confirmed; death sentence confirmed as appropriate.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It cannot be said that identification of the assailant by Rakkha Singh, from what he heard and observed was so improbable that we would be justified in disagreeing with the opinion of the Court which saw the witness\".",
      "speaker": "court",
      "significance": "Upholds credibility of sole witness's identification."
    },
    {
      "text": "\"The committing Magistrate in this case erred in committing the accused to the Court of Session without recording the evidence of all the witnesses to the actual commission of the offence\".",
      "speaker": "court",
      "significance": "Criticizes procedural lapse under CrPC."
    },
    {
      "text": "\"Examination of witnesses to the actual commission of the offence should in inquiries, for committal on charges for such serious offences, be the normal rule.\"",
      "speaker": "court",
      "significance": "Lays down duty of Magistrate in serious cases."
    }
  ],
  "_case_id": "1963_248",
  "_label": 0,
  "_text_length": 15250,
  "_extracted_at": "2026-02-10T19:50:25.306992"
}