{
  "metadata": {
    "case_name": "Appellants v. Respondent",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 376 of 1961",
    "date_of_judgment": "1963-03-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Survey No.440-B situated in Rakatla village originally belonged to one Boya Krishnappa and it measured 166 acres.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellants alleged that 40 acres out of the said land had been purchased by their father, Chinna Venkataramanappa from Boya Krishnappa about 35 years before the date of the suit (O.S. No. 72 of 1953, filed in 1951 before Subordinate Judge, Anantapur).",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "After the sale, appellants' father obtained possession and continued in possession during his lifetime. On his death, appellants' mother acting as guardian remained in possession and management until 1947.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Appellants' family had been paying the assessment for the land all the time and had been in its possession in an open and peaceful manner until 1947.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Respondent obtained a mortgage decree in O.S. No. 94/1940 against Boya Krishnappa in respect of the entire Survey No.440-B. In pursuance, brought the property to sale; purchased it himself in about 1943.",
      "type": "admitted",
      "date": "1943",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "In 1947, respondent unlawfully entered upon the land in suit and dispossessed the appellants.",
      "type": "material",
      "date": "1947",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Respondent denied purchase by appellants' father; claimed appellants cultivated as tenants of Boya Krishnappa; mortgage of July 31, 1929 binding on them.",
      "type": "disputed",
      "date": "1929-07-31",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Trial court (Subordinate Judge) found in favour of appellants on title and possession within 12 years; relied on Ext. A-8 (Changes Register showing pattadars: Krishnappa and Venkataramanappa, later sons via guardian); cist receipts (A-2 to A-5, A-9 to A-35); rejected respondent's tenant plea and fabrication claim.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Diglot exhibit B-1 (1927) did not show appellants' father's name, but trial court held information may not have reached revenue officers.",
      "type": "background",
      "date": "1927",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Rent notes (A-6, A-7, A-36, A-37) disbelieved by trial court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "In execution of mortgage decree, appellants stood sureties for crops at Krishnappa's instance; trial court held not related to suit land crops.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "District Judge (first appeal) confirmed trial court's findings on title and possession within 12 years.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Lands including 440-B were banjar (uncultivable), low value 20-25 years ago; mortgage for 166 acres only Rs.650.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "High Court (Sanjeeva Rao Nayudu J., Second Appeal No. 545 of 1955, judgment March 5, 1959) reversed: held Ext. A-8 not proved/genuine; cist receipts not genuine; surety conduct destructive; lease deeds disbelieved; dismissed suit.",
      "type": "procedural",
      "date": "1959-03-05",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Respondent's counsel conceded Ext. A-8 (certified copy of public document) need not be proved by witness; no objection earlier.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court in second appeal under s.100 CPC contravened limits by interfering with concurrent findings of fact of courts below on appellants' title and possession.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Scope of High Court's jurisdiction in second appeal: can it interfere on sufficiency/adequacy of evidence for findings of fact?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court interfered with concurrent findings of fact on title and possession, contravening s.100 CPC; no jurisdiction in second appeal on erroneous findings of fact.",
      "supporting_facts": [
        "f8",
        "f12",
        "f14"
      ],
      "legal_basis": "Section 100 CPC; Art.133(3) Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No sale deed or patta produced; revenue docs (A-8, cist receipts) not genuine/proved; appellants were tenants; surety for crops shows not owners; lease deeds disbelieved.",
      "supporting_facts": [
        "f7",
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Concurrent findings by trial and first appellate courts on title/possession by transfer or adverse possession, based on documentary evidence (A-8, cist receipts), oral evidence, probabilities; possession admitted, open/continuous/adverse till 1947 (within 12 years).",
      "addresses_issue": "i1",
      "key_observation": "No sale deed needed as land <Rs.100 value; tenant plea rejected."
    },
    {
      "id": "cr2",
      "text": "High Court erred: Ext.A-8 certified public document, admissible without proof, no objection; wrongly assessed genuineness/weight (matter for courts of fact); sufficiency/adequacy of evidence not for second appeal.",
      "addresses_issue": "i2",
      "key_observation": "Admissibility is law, but weight/sufficiency is fact; High Court must not treat second appeal as first."
    },
    {
      "id": "cr3",
      "text": "s.100 limits: no interference with facts even if evidence insufficient per High Court; introduces unpredictability/gambling if contravened.",
      "addresses_issue": "i2",
      "key_observation": "Justice per law, not equity alone."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court has no jurisdiction in second appeal under s.100 CPC to interfere with findings of fact, even on gross error or insufficiency of evidence; only on substantial question of law.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Sufficiency/adequacy of evidence is question of fact, not law for second appeal.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mussummat Durga Choudhrain v. Jawahir Singh Choudhri",
      "citation": "1890 L.R. 17 I.A. 122",
      "treatment": "followed",
      "relevance": "No jurisdiction in second appeal (s.584 old CPC equiv. s.100) on erroneous finding of fact, however gross; no power to enlarge grounds."
    },
    {
      "case_name": "Deity Pattabhiramaswamiv. S. Hanymayya",
      "citation": "AIR 1959 S.C. 57",
      "treatment": "followed",
      "relevance": "High Courts dispose second appeals as first, assuming unpossessed jurisdiction; introduces gambling/confusion."
    },
    {
      "case_name": "R. Ramachandra Ayyar v. Ramalingam Chettiar",
      "citation": "1963 3 S.C.R. 604",
      "treatment": "followed",
      "relevance": "Reiterates limits of s.100; bear in mind Privy Council caution; no interference with facts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(3)"
      ],
      "relevance": "No appeal to Supreme Court from judgment/decree/final order of one Judge of High Court except by special leave."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 100"
      ],
      "relevance": "Limits second appeal to substantial question of law; no interference with findings of fact or sufficiency of evidence."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal by special leave, set aside High Court judgment and decree dated March 5, 1959, restored decree of trial court as confirmed by District Judge, with costs throughout.",
    "relief_granted": "Declaration of title, possession, mesne profits to appellants; suit decreed.",
    "costs": "Costs throughout."
  },
  "key_quotes": [
    {
      "text": "\"there is no jurisdiction to entertain a second appeal on the ground of erroneous finding of fact, however gross or inexcusable the error may seem to be\"",
      "speaker": "court",
      "significance": "Privy Council warning reiterated; core limit of s.100 CPC."
    },
    {
      "text": "\"some learned judges of the High Courts are disposing of second appeals as if they were first appeals. This introduces... a gambling element in litigation\"",
      "speaker": "court",
      "significance": "Critique of High Court overreach; justifies Supreme Court intervention."
    },
    {
      "text": "\"the sufficiency or adequacy of evidence to support a finding of fact is a matter for decision of the court of facts and cannot be agitated in a second appeal\"",
      "speaker": "court",
      "significance": "Clarifies distinction between law (admissibility) and fact (weight/sufficiency)."
    }
  ],
  "_case_id": "1963_153",
  "_label": 1,
  "_text_length": 19800,
  "_extracted_at": "2026-02-10T19:49:45.771185"
}