{
  "metadata": {
    "case_name": "Ahmad Hafiz Khan v. Mohd. Hasan Khan",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": "Civil Appeal No. 293 of 1961",
    "date_of_judgment": "1963-03-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Mohd. Yusaf obtained a money decree for Rs. 1277/7/- against the appellant, Ahmad Hafiz Khan, on January 14, 1950.",
      "type": "background",
      "date": "1950-01-14",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In execution of the decree Mohd. Yusaf attached two annas and 5-7/45 pies share of the appellant in Mouza Tumhari, Tahsil Sakti, District Bilaspur, alongwith sir and khudkasht lands appurtenant thereto. The attachment was made on September 28, 1950.",
      "type": "procedural",
      "date": "1950-09-28",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On March 31, 1951, before the sale took place, the Madhya Pradesh Abolition of Proprietary Rights (Estates, Mahals, Alienated Lands) Act, 1950 (M. P. Act No. 1 of 1951) was made applicable to that area. In view of the provisions of the Abolition Act the proprietary rights in the village vested in the State.",
      "type": "material",
      "date": "1951-03-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On October 1, 1951, the fields under attachment were put to sale and were purchased by the respondent, Mohd. Hasan Khan.",
      "type": "procedural",
      "date": "1951-10-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellant filed an application setting forth objections under Order 21 Rule 90 of the Code of Civil Procedure but the application was dismissed and the sale was confirmed on February 1, 1952.",
      "type": "procedural",
      "date": "1952-02-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The judgment-debtor appealed against the order dismissing the application and on May 1, 1952, the Additional District Judge, Bilaspur, set-aside the sale, and possession of the property was restored to the appellant.",
      "type": "procedural",
      "date": "1952-05-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On further appeal by the auction purchaser the order of the Additional District Judge was reversed and the auction purchaser was put in possession of the property on April 16, 1955.",
      "type": "procedural",
      "date": "1955-04-16",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Both the appellant and the auction purchaser applied to the executing court. The appellant raised further objection while the auction purchaser asked for mesne profits under s. 144 of the Code of Civil Procedure. The objection of the appellant was dismissed by the Civil Judge and his successive appeals to the District Judge and the High Court also failed. The judgment of the High Court passed on December 24, 1959.",
      "type": "procedural",
      "date": "1959-12-24",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the cultivating rights in the sir lands could be the subject matter of sale in execution of the decree in view of s. 43 of the Abolition Act.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The contention of the appellant is that the cultivating rights in the sir lands could not be the subject matter of sale in execution of the decree in view of s. 43 of the Abolition Act.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Section 43 of the Madhya Pradesh Abolition of Proprietary Rights (Estates, Mahals, Alienated Lands) Act, 1950"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The High Court did not accept the argument relying upon Govind Prasad v. Pawan Kumar where it was held that attachment of proprietary share including sir and khudkasht lands made before Abolition Act continued on home-farm after.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Govind Prasad v. Pawan Kumar, 1955 N. L. J. 678"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under the Central Provinces Tenancy Act, 1920, s. 49, a proprietor losing right to occupy sir land becomes occupancy tenant except in certain cases. Effect of Abolition Act similar: proprietor retains possession of home-farm (sir and khudkasht) under s. 42, becomes malik makbuza under s. 38.",
      "addresses_issue": "i1",
      "key_observation": "Section 43 bars attachment or sale in execution of pre-vesting decree of sir lands unless debt secured by mortgage or charge on cultivating rights."
    },
    {
      "id": "cr2",
      "text": "Attachment before, sale after Abolition Act; no mortgage or charge on cultivating rights; decree was only money decree, attachment does not create charge making it secured debt.",
      "addresses_issue": "i1",
      "key_observation": "Sale without jurisdiction and illegal."
    },
    {
      "id": "cr3",
      "text": "Govind Prasad v. Pawan Kumar distinguished: did not consider s. 43 or whether sale could take place post-Abolition Act.",
      "addresses_issue": "i1",
      "key_observation": "Words of s. 43 clear: cultivating rights protected against sale absent mortgage or charge."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The sale was without jurisdiction and thus illegal; must be declared to be without jurisdiction and ordered to be set aside in respect of the sir lands appurtenant to the original proprietary share.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Govind Prasad v. Pawan Kumar",
      "citation": "1955 N. L. J. 678",
      "treatment": "distinguished",
      "relevance": "Held attachment pre-Abolition Act continues on home-farm, but did not consider if sale of cultivating rights possible post-Abolition Act or s. 43."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madhya Pradesh Abolition of Proprietary Rights (Estates, Mahals, Alienated Lands) Act, 1950 (M. P. Act No. 1 of 1951)",
      "sections": [
        "Section 2(g)",
        "Section 38",
        "Section 42",
        "Section 43"
      ],
      "relevance": "Vesting of proprietary rights in State; retention of home-farm possession; protection of sir lands from attachment/sale in execution of pre-vesting debts unless mortgaged/charged."
    },
    {
      "name": "Central Provinces Tenancy Act, 1920",
      "sections": [
        "Section 49"
      ],
      "relevance": "Proprietor losing sir land occupancy right becomes occupancy tenant except specified cases."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Order 21 Rule 90",
        "Section 144"
      ],
      "relevance": "Objections to sale; mesne profits."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, judgment of High Court set aside, sale in respect of sir lands appurtenant to original proprietary share declared without jurisdiction and set aside.",
    "relief_granted": "Sale set aside in respect of sir lands; possession implicitly restored to appellant.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Any land which immediately before the date of vesting, was held in absolute occupancy or occupancy right or recorded as Sir-land, shall not be liable to attachment or sale in execution of a decree or order for the recovery of any debt incurred before the date of vesting except where such debt was validly secured by mortgage of or a charge on the absolute occupancy or occupancy land or the cultivating right in the sir-land.",
      "speaker": "court",
      "significance": "Verbatim text of s. 43 of Abolition Act, central to holding."
    },
    {
      "text": "The sale was, therefore, without jurisdiction, and thus illegal.",
      "speaker": "court",
      "significance": "Core finding on invalidity of sale."
    }
  ],
  "_case_id": "1963_42",
  "_label": 1,
  "_text_length": 7966,
  "_extracted_at": "2026-02-10T19:47:30.908267"
}