{
  "metadata": {
    "case_name": "Ajendra Nath v. State",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal J."
    ],
    "case_number": "Criminal Appeal No. 226 of 1960",
    "date_of_judgment": "1963-04-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Five bales containing woollen shawls and mufflers despatched from Kanpur by the British India Corporation Ltd., Kanpur Woollen Mills Branch, Kanpur, and another bale despatched from Haimanpur to Kanpur were loaded at Itarsi railway station on September 18, 1957, in Wagon No. C.R. 325.",
      "type": "background",
      "date": "1957-09-18",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "The lock of the wagon was found broken open at Pandhurna Railway Station at about 1.00 a.m. on September 20, 1957. On checking at Nagpur the aforesaid bales were found missing.",
      "type": "material",
      "date": "1957-09-20",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "One of the bales despatched from Kanpur was found lying the next morning near the railway line between railway stations Jaulkheda and Multai.",
      "type": "material",
      "date": "1957-09-21",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "On September 23, 1957, the house of one Gopi Nath, at Multai, was searched and certain articles, including some torn labels were recovered from that house.",
      "type": "procedural",
      "date": "1957-09-23",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "The same day, the police found the appellant and a few other persons coming out of Gopi Nath's house at Betul, whose front door was locked.",
      "type": "material",
      "date": "1957-09-23",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Subsequently, these persons were taken to the police station, where the appellant made a statement showing readiness to point out the stolen property.",
      "type": "procedural",
      "date": "1957-09-23",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "At his instance, the police recovered from different places of that house, woollen shawls, mufflers, bed-sheets and certain house-breaking implements. These recoveries were made on September 23 and 24.",
      "type": "material",
      "date": "1957-09-23",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Out of 95 shawls and 63 mufflers in four bales from Kanpur Woollen Mills, 80 shawls and 43 mufflers recovered. Out of 10 pairs of bed-sheets stolen, 8 pairs recovered.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Presence of silk and paper labels of Kanpur Woollen Mills on most of the shawls and mufflers recovered and certain manuscript writings on the labels of the bed sheets by P.W. 24 Krishnamurthi.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Appellant attempted to sell a few mufflers a day before the recoveries were made. He was seen arriving at the house, during the night, in a car with some persons and then removing property which looked like bales from the car to the house.",
      "type": "material",
      "date": "1957-09-22",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "As a result of investigation, six persons were put on trial in the Magistrate's Court. Ajendra Nath charged under ss. 120-B, 379 and 414 I.P.C.; others under various sections.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Magistrate acquitted Birendra Nath and convicted others under s. 120-B r/w 379 I.P.C., except Gopinath under 120-B r/w 414; Ajendra Nath also under 414 I.P.C.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Additional Sessions Judge, Hoshangabad, acquitted all convicted persons, holding property not proved stolen and conspiracy not proved.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "State appealed against acquittal of Gopinath and Ajendra Nath. High Court dismissed appeal against Gopinath and against Ajendra Nath for conspiracy, but allowed appeal against Ajendra Nath under s. 414 I.P.C., dated July 28, 1960.",
      "type": "procedural",
      "date": "1960-07-28",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Ajendra Nath did not question the recovery of articles from Gopi Nath's house at his instance, did not claim them as his own, but stated not stolen property.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the recovered articles were proved to be stolen property.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether an offence under s. 414 I.P.C. is made out against the appellant even if others acquitted.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Recovered articles not proved to be stolen property; Kunzru (P.W.10) did not identify all recovered shawls/mufflers as manufactured by Kanpur Woollen Mills; expert not examined.",
      "supporting_facts": [
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Invoices and gate passes not proved as persons who wrote them not examined; violet shawls not in invoices.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Bed-sheets identity doubtful; markings possibly made by police during investigation.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "High Court could not record finding on stolen property when State did not appeal against other accused on that ground.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Even if stolen, no offence u/s 414 as others acquitted and not known whom appellant assisted in concealing.",
      "supporting_facts": [
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": "Section 414 I.P.C."
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Large quantity recovered matching despatched articles, labels present, recovered soon after theft; proves stolen property.",
      "supporting_facts": [
        "f2",
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Appellant assisted in concealment: property hidden in different places, seen coming out of house, knew locations, attempted sale.",
      "supporting_facts": [
        "f5",
        "f7",
        "f10"
      ],
      "legal_basis": "Section 414 I.P.C."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Kunzru's evidence insufficient alone, but labels (silk/paper) on shawls/mufflers prove manufacture by Kanpur Woollen Mills; no suggestion of deception.",
      "addresses_issue": "i1",
      "key_observation": "Finding that shawls and mufflers were manufacture of Kanpur Woollen Mills is correct."
    },
    {
      "id": "cr2",
      "text": "Invoices and gate passes genuine; produced by salesman Kunzru; no challenge to genuineness; violet shawls minor issue, appellant not claiming ownership.",
      "addresses_issue": "i1",
      "key_observation": "No force in contention; finding not defective."
    },
    {
      "id": "cr3",
      "text": "Bed-sheets: P.W.16 and 24 identify via labels with unique markings; no basis to doubt or suspect police fabrication.",
      "addresses_issue": "i1",
      "key_observation": "No good reason to consider High Court's finding wrong."
    },
    {
      "id": "cr4",
      "text": "State could challenge Sessions Judge's finding on stolen property in appeal against appellant; better evidence against him.",
      "addresses_issue": "i1",
      "key_observation": "High Court can record its own finding."
    },
    {
      "id": "cr5",
      "text": "S.414 does not require conviction of thief; only need prove stolen property and voluntary assistance in concealment.",
      "addresses_issue": "i2",
      "key_observation": "Circumstances show deliberate concealment in different places; appellant involved."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Recovered property proved to be stolen property.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Appellant committed offence under s.414 I.P.C. by assisting in concealment of stolen property.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "414",
        "120-B",
        "379"
      ],
      "relevance": "Offence of assisting in concealment of stolen property under s.414; conspiracy and theft under others."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave against High Court order convicting appellant under s.414 I.P.C. dismissed; High Court's findings upheld that recovered property was stolen and appellant assisted in its concealment.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Section 414 I.P.C. makes it an offence for a person to assist voluntarily in ... concealing ... property which he knows or has reason to believe to be stolen property. It is not necessary ... that another person must be traced out and convicted of ... theft.",
      "speaker": "court",
      "significance": "Clarifies requirements for conviction under s.414 IPC independent of thief's conviction."
    },
    {
      "text": "We therefore consider that the finding that these shawls and mufflers were the manufacture of Kanpur Woollen Mills is correct.",
      "speaker": "court",
      "significance": "Upholds identification based on labels despite identification gaps."
    }
  ],
  "_case_id": "1963_200",
  "_label": 0,
  "_text_length": 12873,
  "_extracted_at": "2026-02-10T19:49:34.725226"
}