{
  "metadata": {
    "case_name": "Major S.S. Khanna v. Brig. F.J. Dillon",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "A.K. Sarkar",
      "J.C. Shah",
      "M. Hidayatullah"
    ],
    "case_number": "Civil Appeal No. 320 of 1963",
    "date_of_judgment": "1963-08-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Brig. F.J. Dillon and Major S.S. Khanna carried on business in partnership as Construction Engineers.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Parties agreed to dissolve the partnership with effect from February 15, 1956. By deed of dissolution, Dillon to take over all assets and properties as absolute owner, pay all debts, discharge liabilities, and keep Khanna indemnified.",
      "type": "material",
      "date": "1956-02-15",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Khanna commenced action against Dillon in Court of Subordinate Judge, 1st Class, Delhi for dissolution of partnership and rendition of accounts.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On January 12, 1957, parties arrived at compromise incorporated into decree confirming dissolution subject to winding up scheme: outstanding realized from debtors and sale proceeds of assets into joint banking account in names of Dillon and Khanna; first applied to liabilities of dissolved firm; balance to belong to Dillon.",
      "type": "material",
      "date": "1957-01-12",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Some outstandings of dissolved partnership collected by Dillon and deposited in joint account of Dillon and Khanna.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Dillon filed suit in Court of Subordinate Judge at Delhi for Rs. 54,250 with future interest, alleging advances of Rs. 46,000 in three sums between May 1957 and November 1957 at request of Khanna as short-term loans which Khanna promised but failed to repay.",
      "type": "procedural",
      "date": "1957-05 to 1957-11",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Khanna pleaded no loans borrowed from Dillon; amounts advanced, even per Dillon, out of joint funds belonging to partners; suit not maintainable.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Trial Court raised issues; third issue 'Whether this suit is not maintainable and the plaintiff is not entitled to institute this suit, as alleged in paras Nos. 15, 16, 17, 18 of the written statement' tried as preliminary issue at request of Khanna.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Subordinate Judge held suit by partner against another of dissolved firm in winding up, for advances from partnership assets, not maintainable.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Punjab High Court at Delhi in Civil Revision Nos. 525 and 526-D of 1960 set aside order, directed suit be heard and disposed of according to law.",
      "type": "procedural",
      "date": "1962-10-26",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Khanna preferred appeal to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order of the Subordinate Judge on preliminary issue of maintainability amounts to a 'case which has been decided' within s.115 CPC.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether High Court jurisdiction under s.115 CPC excluded because decree in suit subject to appeal to High Court.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether order falls within clauses (a), (b) or (c) of s.115 CPC.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether trial court acted illegally or with material irregularity in deciding maintainability without trial on evidence.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Order did not amount to a case which has been decided within s.115 CPC.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "s.115 CPC"
    },
    {
      "id": "pa2",
      "text": "Decree in suit subject to appeal to High Court, so power under s.115 excluded.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": "s.115 CPC"
    },
    {
      "id": "pa3",
      "text": "Order did not fall within clauses (a), (b) or (c) of s.115 CPC.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "s.115 CPC"
    },
    {
      "id": "pa4",
      "text": "Suit by partner against partner for advances from joint funds/partnership assets not maintainable.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Advances were short-term loans at request of Khanna from joint account, repayable by Khanna; suit maintainable for recovery of loans.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Expression 'case' in s.115 CPC includes interlocutory orders determining rights/obligations; not restricted to final disposal of suit.",
      "addresses_issue": "i1",
      "key_observation": "'Case' is comprehensive, includes part of proceeding; High Court power supervisory/visitorial."
    },
    {
      "id": "cr2",
      "text": "Revisional jurisdiction exercisable even if appeal lies from final decree; 'in which no appeal lies thereto' means no direct/indirect appeal to High Court from the decision itself.",
      "addresses_issue": "i2",
      "key_observation": "Not limited to cases where no appeal from final order."
    },
    {
      "id": "cr3",
      "text": "Order attracted cl.(c) s.115: trial court acted illegally/with material irregularity by deciding maintainability without evidence on disputed facts.",
      "addresses_issue": "i3",
      "key_observation": "Issues of fact (ownership of funds, request for loan) needed trial; O.14 r.2 not for mixed issues."
    },
    {
      "id": "cr4",
      "text": "Under compromise, joint account for winding up; Dillon to recover assets (including under power of attorney for Khanna); balance to Dillon after liabilities; borrowing from account is loan by Dillon to Khanna.",
      "addresses_issue": "i4",
      "key_observation": "Suit not for distribution but recovery of loans."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court has revisional jurisdiction under s.115 CPC over interlocutory orders on jurisdictional issues even if appeal lies from final decree.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Trial court erred in holding suit not maintainable without trial on evidence; acted with material irregularity.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Balakrishna Udayar v. Vasudeva Aiyar",
      "citation": null,
      "treatment": "referred",
      "relevance": "'Case' includes proceeding for determination of claim/right, not restricted to suits."
    },
    {
      "case_name": "Buddhulal v. Mewa Ram",
      "citation": "I.L.R. 43 All. 564 F.B.",
      "treatment": "distinguished",
      "relevance": "Majority view in Allahabad HC that jurisdiction only where suit (not part) decided; fallacy noted."
    },
    {
      "case_name": "Purohit Swarupnarain v. Gopinath",
      "citation": "I.L.R. 1953 Raj. 483 F.B.",
      "treatment": "distinguished",
      "relevance": "Held s.115 excluded if appeal from final decree; incorrect interpretation."
    },
    {
      "case_name": "Pyarchand v. Dungar Singh",
      "citation": "I.L.R. 1953 Raj. 608",
      "treatment": "distinguished",
      "relevance": "Similar to Purohit; revision excluded if ground appealable later."
    },
    {
      "case_name": "Ryots of Garabandho v. Zamindar of Parlakimedi",
      "citation": "L.R. 70 I.A. 129",
      "treatment": "referred",
      "relevance": "Historical context of supervisory jurisdiction."
    },
    {
      "case_name": "Rex v. Nat Bell Liquors Ltd.",
      "citation": "1922 2 A.C. 128, 156",
      "treatment": "followed",
      "relevance": "Certiorari supervisory, not review; on jurisdiction."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "s.115",
        "O.14 r.2",
        "s.105",
        "s.104"
      ],
      "relevance": "Revisional jurisdiction of High Court; trial of preliminary issues; appeals from orders."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against High Court's revisional order setting aside trial court's preliminary finding of non-maintainability dismissed; High Court directed to hear suit on merits.",
    "relief_granted": "High Court order upheld; suit to proceed.",
    "costs": "Dismissed with costs; one hearing fee for this appeal and C.A. 321 of 1963."
  },
  "key_quotes": [
    {
      "text": "The expression 'case' is a word of comprehensive import it includes civil proceedings other than suits, and is not restricted by anything contained in the section to the entirety of the proceeding in a civil court.",
      "speaker": "court",
      "significance": "Core holding on scope of 'case' under s.115 CPC."
    },
    {
      "text": "A Court has jurisdiction to decide wrongly as well as rightly.",
      "speaker": "court",
      "significance": "Limits s.115 to jurisdictional errors, not merits."
    },
    {
      "text": "The power which this Section confers is clearly of the nature of a proceeding on a writ of Certiorari.",
      "speaker": "court",
      "significance": "Analogizes s.115 to certiorari for supervisory role."
    }
  ],
  "_case_id": "1963_71",
  "_label": 0,
  "_text_length": 38596,
  "_extracted_at": "2026-02-10T19:48:24.872387"
}