{
  "metadata": {
    "case_name": "Krishnachandra and Ors. v. State",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Criminal Appeal No. 47 of 1961",
    "date_of_judgment": "1963-01-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Three appellants with five others tried for offences under s. 4 of the United State of Gwalior, Indore and Malwa Madhya Bharat Gambling Act, Samvat 2006 (Madhya Bharat Act No. 51 of 1949 Samvat 2036). Krishnachandra, the first appellant, also tried under s. 3 of the Act.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "All original accused except one convicted under s. 4 and sentenced to one month's simple imprisonment. Krishnachandra convicted in addition under s. 3 and sentenced to one month's simple imprisonment, sentences to run concurrently.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "All accused appealed unsuccessfully to the Court of Session.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Three appellants filed petition for revision in Madhya Pradesh High Court Gwalior Bench (Criminal Revision No. 91/59). High Court issued notice under s. 439 CrPC to show cause why sentences should not be enhanced.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "High Court by order dated December 14, 1960, dismissed revision petition and imposed additional fine of Rs. 200 on each convict for which originally convicted.",
      "type": "procedural",
      "date": "1960-12-14",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellants asked for certificate to appeal to Supreme Court, refused by High Court. Obtained special leave from Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On search being made, instruments of gaming found in the house and presumption under s. 6 drawn against persons present there.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether s. 6 of the Gambling Act is ultra vires the Constitution, against principles of natural justice and fundamentals of criminal jurisprudence.",
      "framed_by": "appellants"
    },
    {
      "id": "i2",
      "text": "Whether s. 8 of the Act is ultra vires the Constitution.",
      "framed_by": "appellants"
    },
    {
      "id": "i3",
      "text": "Whether impugned sections violate Articles 19 and 21 of the Constitution by unreasonably impairing right of assembly and right to hold and enjoy property, reversing burden of proof based on officer's suspicion.",
      "framed_by": "appellants"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sections 6 and 8 are ultra vires Constitution, against natural justice and criminal jurisprudence. Proof depends on suspicion of officer and discovery of innocent articles like playing cards and dice. Burden of proof reversed onto accused.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Articles 19, 21, 13 of Constitution"
    },
    {
      "id": "pa2",
      "text": "Impugned sections unreasonably impair right of assembly and right to hold and enjoy property under Article 19. Breach of Article 21 as curtailment of liberty not according to procedure established by law.",
      "supporting_facts": [],
      "legal_basis": "Articles 19(3), (4), (5); 21"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Gambling is an evil requiring eradication for public order, morality. Definitions of gaming, gaming house, instruments of gaming are wide but reasonable and subserve purpose.",
      "addresses_issue": "i1",
      "key_observation": "No unreasonableness in definitions."
    },
    {
      "id": "cr2",
      "text": "Section 5 provides safeguards: entry/search only on credible information, inquiry, by superior officers satisfied of good grounds. Seizure of instruments requires court satisfaction of reasonable suspicion.",
      "addresses_issue": "i1",
      "key_observation": "Safeguards: credible info, seizure bearing out info, court proof of reasonable grounds."
    },
    {
      "id": "cr3",
      "text": "Section 6 shifts burden only after court satisfied of reasonable grounds for suspicion. Presumption for presence in gaming house during gaming.",
      "addresses_issue": "i1",
      "key_observation": "Suspicion must be demonstrated as reasonably based; not arbitrary."
    },
    {
      "id": "cr4",
      "text": "Given difficulty in detecting gambling, special procedure with safeguards is in public interest and constitutional. Act pre-Constitution, void only under Article 13 if unreasonable restriction.",
      "addresses_issue": "i3",
      "key_observation": "Restrictions reasonable under Article 19(3),(4),(5)."
    },
    {
      "id": "cr5",
      "text": "Article 21 argument subsumed; if constitutional, procedure established by law.",
      "addresses_issue": "i3",
      "key_observation": "No separate breach of Article 21."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Impugned provisions of ss. 6 and 8 are constitutional.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No unreasonable restrictions under Article 19; sufficient safeguards prevent arbitrariness.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "United State of Gwalior, Indore and Malwa Madhya Bharat Gambling Act, Samvat 2006 (Madhya Bharat Act No. 51 of 1949 Samvat 2036)",
      "sections": [
        "2",
        "3",
        "4",
        "5",
        "6",
        "8",
        "12"
      ],
      "relevance": "Defines offences of keeping/using gaming house (s.3), gaming therein (s.4); powers of entry/search (s.5); presumptions/evidence rules (ss.6,8) upheld as constitutional"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "439"
      ],
      "relevance": "High Court notice to enhance sentence"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "13",
        "19",
        "21"
      ],
      "relevance": "Impugned sections not void under Art.13; reasonable restrictions under Art.19(3),(4),(5); procedure under Art.21"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed. High Court order upheld, including convictions under ss.3/4, sentences of imprisonment and fines. Impugned ss.6 and 8 held constitutional.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the seizure of such instrument or thing shall be evidence, until the contrary is made to appear that such house... is used as a gaming house and that the persons found therein were then present for the purpose of gaming\"",
      "speaker": "court",
      "significance": "Quotes s.6, central to constitutional challenge"
    },
    {
      "text": "\"Once the house is shown to the satisfaction of the Court to be a gaming house the law leaves any one found in it during any gaming, to explain his presence on pain of being presumed to be there for gaming.\"",
      "speaker": "court",
      "significance": "Explains operation of presumption under s.6"
    },
    {
      "text": "\"We are satisfied that the impugned provisions are constitutional.\"",
      "speaker": "court",
      "significance": "Final holding on constitutionality"
    }
  ],
  "_case_id": "1963_13",
  "_label": 0,
  "_text_length": 14118,
  "_extracted_at": "2026-02-10T19:47:34.578464"
}