{
  "metadata": {
    "case_name": "Petitioner v. State of Uttar Pradesh and Municipal Board, Bareilly",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO J."
    ],
    "case_number": "Petition No. 12 of 1962",
    "date_of_judgment": "1963-09-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Bareilly is an old City in the State of Uttar Pradesh. In the middle of the 19th century it consisted of small houses situated in congested localities with narrow lanes.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "At some distance away from the said City area there existed even then a cantonment area. Between the City area and the Cantonment area there was a tract of uneven and undeveloped land.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Municipal Board of Bareilly acquired a part of the said land and, together with some nazul land, developed it at a considerable cost. The newly developed area came to be known as the Civil Lines.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "The Municipal Board has provided special amenities for the residents of that area. The said facts and the particulars of the amenities provided are given in the counter-affidavit filed on behalf of the Municipal Board and a map of the Bareilly City and the Cantonment area is also annexed thereto.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "A glance at the map discloses that the City of Bareilly is divided into three separate blocks: the old City, the Cantonment and the Civil Lines. The Civil Lines area is situated between the old City and the Cantonment.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In the Civil Lines area, which the Municipal Board acquired and developed, the said Board imposed house tax from January 31, 1870.",
      "type": "procedural",
      "date": "1870-01-31",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "In the year 1916 the Act was passed in order to consolidate and amend the laws relating to municipalities in the State of Uttar Pradesh. The Act came into force on July 1, 1916.",
      "type": "background",
      "date": "1916-07-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "After the Act came into force, the old tax was abolished and a new house tax was imposed by the Municipal Board of Bareilly in the Civil Lines area with effect from January 1, 1918.",
      "type": "procedural",
      "date": "1918-01-01",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "A latrine tax was also imposed with effect from May 25, 1918, but it was replaced by scavenging tax with effect from April 1, 1939.",
      "type": "procedural",
      "date": "1918-05-25",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The petitioner, a resident of the Civil Lines area, who owns a house bearing door No. 43 therein, filed this writ petition in this Court for a declaration that s. 128(1) of the Act, insofar as it authorizes the Municipal Board to impose a tax in any part of the municipal area, is void and for the issue of a writ of mandamus against the Municipal Board, Bareilly, directing it not to realize the said house tax and scavenging tax from him.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "To the said petition, the State of Uttar Pradesh and the Municipal Board, Bareilly, are made respondents 1 and 2 respectively.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "No general rules were made or special orders issued by the State Government in the matter of imposition of a tax in any part of a municipality.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The Civil Lines area has been treated as a separate unit in the matter of development from the year 1870. The Municipal Board acquired the land in that area, laid out roads, carved out good sized building plots, and provided special amenities for the residents by way of broad roads, open and bigger plots for construction of houses parks and gardens, special lighting arrangements, foot-path with cement benches, water booths with waterman for giving water to the public and special sanitary arrangements whereas the old city area of Bareilly consisted of small plots of land with small houses thereon situated in congested localities with narrow lanes.",
      "type": "background",
      "date": "1870",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "In the case of scavenging tax, there appears to be different methods adopted in the two areas. In the Civil Lines area nightsoil and rubbish are collected by the Municipal Board from each bungalow, while in the City area they are collected from one common place in each ward. The former certainly involves higher expenditure than the latter.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "For about 90 years the Civil Lines area has been treated as a separate geographical unit for the purpose of taxation, having regard to historical reasons and the extra amenities provided for the residents of that locality and the heavy expenditure incurred by the Municipal Board in doing so.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "On April 5, 1917, the Municipal Board passed the following special resolutions: Draft proposals under Section 128(1)(i) for revising the Government Notification No. 135 dated 13-1-1870 levying tax on the buildings and lands in the Civil Lines Station of the Bareilly Municipality. Resolution: Resolved that Draft Proposals be notified.",
      "type": "procedural",
      "date": "1917-04-05",
      "source": "respondent"
    },
    {
      "id": "f17",
      "text": "The relevant notification imposing the tax reads: It is hereby notified under sub-section (2) of Section 135 read with section 136 of the United Provinces Municipalities Act, 1916 (11 of 1916) that the Municipal Board of Bareilly, in exercise of the powers conferred by section 128(1)(xii) of the said Act, has imposed the following scavenging tax in the Bareilly Municipality published with notification No. 3298/XI-18 H, dated the 20th September 1933, in supersession of notification No. 628/XI-18H, dated the 24th January, 1923, with effect from 1st April 1939. Description of the tax. A tax for the removal of nightsoil and rubbish at the rate mentioned below to be realized from the occupier or the owner of the buildings (bungalows) situated within the Civil Lines ward of the municipality.",
      "type": "procedural",
      "date": "1939-04-01",
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "In the counter-affidavit it is stated that nightsoil and rubbish are collected by the Municipal Board from the bungalows in the Civil Lines.",
      "type": "background",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Section 128(1) of the Act, insofar as it authorizes the Municipal Board to impose the taxes mentioned therein in any part of the municipality, offends Art. 14 of the Constitution and, therefore, is void.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Even if the section does not violate the said article, the notification issued by the Municipal Board imposing the said two taxes, namely, house tax and scavenging tax, confining them only to the Civil Lines area was void inasmuch as the taxes could not be justified on the basis of the doctrine of classification.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "The said taxes were imposed in violation of the statutory provisions of the Act and, therefore, the said imposition on him in respect of his building infringes his fundamental right under Art. 19(1)(f) of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Section 131(1)(b) of the Act also violates Art. 14 of the Constitution inasmuch as it confers an arbitrary power on the Municipal Board to impose taxes of any amount on any person or class of persons without laying down any clear policy for classification.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether the Municipal Board had power to impose scavenging tax under cl. (xii) of s. 128(1) of the Act.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The power conferred on the Municipal Board to impose a tax on any part of the municipality is a naked and arbitrary power, that the Act does not disclose any policy or give any guidance for making a valid classification and that, therefore, the section, to the said extent, violates the provisions of Art. 14 of the Constitution.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Art. 14 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "The notification issued by the Municipal Board imposing the said two taxes confining them only to the Civil Lines area was void inasmuch as the taxes could not be justified on the basis of the doctrine of classification.",
      "supporting_facts": [
        "f6",
        "f8",
        "f9"
      ],
      "legal_basis": "Art. 14 of the Constitution; doctrine of classification"
    },
    {
      "id": "pa3",
      "text": "The said taxes were imposed in violation of the statutory provisions of the Act.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "Sections 131 to 136 of the Act; Art. 19(1)(f) of the Constitution"
    },
    {
      "id": "pa4",
      "text": "Section 131(1)(b) of the Act confers an arbitrary power on the Municipal Board to impose taxes of any amount on any person or class of persons without laying down any clear policy for classification.",
      "supporting_facts": [],
      "legal_basis": "Art. 14 of the Constitution; s.131(1)(b) of the Act"
    },
    {
      "id": "pa5",
      "text": "The Municipal Board violated the provisions of s. 131(1) of the Act inasmuch as, (i) it did not give all the necessary details in the proposals made under s. 131(1) of the Act, and (ii) the Government did not make the rules after the Act came into force in accordance with the procedure prescribed under s. 131 and the succeeding sections of the Act.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "s.131(1) of the Act"
    },
    {
      "id": "pa6",
      "text": "The Municipal Board had no power to impose a scavenging tax under cl. (xii) of s. 128(1) of the Act and, therefore, the imposition of the tax is illegal.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "s.128(1)(xii) of the Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Controverts the said arguments of the petitioner.",
      "supporting_facts": [
        "f3",
        "f4",
        "f13",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Cl. (xii) mentioned in the notification is a mistake for cl. (xi).",
      "supporting_facts": [
        "f17",
        "f18"
      ],
      "legal_basis": "s.128(1)(xi) of the Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "A fair reading of ss.7,8 and 128 makes it clear that the amounts collected by the Municipal Board by way of taxes are mainly intended to enable the Board to discharge its duties in the municipal area or a part of the municipal area. Sections 7 and 8 enumerate the obligatory duties and discretionary functions of a municipality. These duties and functions need not necessarily be discharged or performed in the entire area of the municipality at once. A municipality can impose a tax in a part of a city, if that part, because of its peculiar situation or otherwise, has to be provided with special amenities throwing a heavy financial burden on the municipality.",
      "addresses_issue": "i1",
      "key_observation": "The Act lays down a policy by necessary implication for guidance of the Municipal Board."
    },
    {
      "id": "cr2",
      "text": "The policy so disclosed does not infringe Art.14. Equality clause does not forbid geographical classification, provided the difference between the geographical units has a reasonable relation to the object sought to be achieved. The impugned section in permitting in the matter of taxation geographical classification which has reasonable relation to the object of the statute, namely, for providing special amenities for a particular unit the peculiar circumstances whereof demand them, does not in any way impinge upon the equality clause.",
      "addresses_issue": "i1",
      "key_observation": "Geographical classification upheld for taxation."
    },
    {
      "id": "cr3",
      "text": "It is clear from the affidavit filed on behalf of the Municipal Board and the map annexed thereto that the area covered by the Civil Lines has been treated as a separate unit in the matter of development from the year 1870. The differences between the old city and the Civil Lines area are so pronounced in the matter of amenities that there is a reasonable relation between the taxes imposed and the geographical classification made for the purpose of taxation.",
      "addresses_issue": "i2",
      "key_observation": "Notification does not infringe Art.14."
    },
    {
      "id": "cr4",
      "text": "Section 131 does not confer any power on the Board to impose a tax. Section 128 confers such a power. Section 131 provides a machinery for imposing the said taxes. The rate of tax to be levied and the persons or the class of persons liable to pay the same have a reasonable relation to the subjects taxable under the Act. The said rate to be imposed and the persons or the class of persons liable to pay the same are ascertained by a quasi-judicial procedure after giving opportunity to the parties affected, subject to revision by the State Government.",
      "addresses_issue": "i4",
      "key_observation": "s.131 read with s.128 does not confer arbitrary power."
    },
    {
      "id": "cr5",
      "text": "There is a presumption when a statutory authority makes an order, that it has followed the prescribed procedure. The said presumption is not in any way weakened by the long acquiescence in the imposition by the residents of the Civil Lines. Ex facie the resolution of April 5, 1917 shows that there were draft proposals which must have contained all the details required by the section.",
      "addresses_issue": "i3",
      "key_observation": "No violation of procedure established."
    },
    {
      "id": "cr6",
      "text": "There must be some distinction between scavenging tax and a tax for cleaning of latrines and privies. Presumably cl. (xi) is more comprehensive than cl. (xii). The combined function is covered by cl. (xi) of s. 128 of the Act. The mention of cl. (xii) in the notification appears to be a mistake for cl. (xi) and that does not affect the power of the Municipal Board to impose the tax.",
      "addresses_issue": "i5",
      "key_observation": "Power exists under cl. (xi)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 128(1) of the Act, insofar as it authorizes the Municipal Board to impose taxes in any part of the municipality, does not violate Art.14 as the Act lays down a policy by necessary implication relatable to providing special amenities.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The notification imposing house tax and scavenging tax only in Civil Lines area does not infringe Art.14 due to reasonable geographical classification based on amenities and historical treatment.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Taxes not imposed in violation of statutory procedure; presumption of compliance holds.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Section 131(1)(b), read with s.128, does not confer arbitrary power violating Art.14; provides machinery with quasi-judicial procedure.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "Municipal Board has power to impose scavenging tax under s.128(1)(xi); clerical error in notification does not invalidate.",
      "resolves_issue": "i5",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ram Krishna Dalmia v. Shri Justice S. Tendolkar",
      "citation": "1959 S.C.R. 279",
      "treatment": "followed",
      "relevance": "Law on classification under Art.14; classes of statutes leaving discretion to government."
    },
    {
      "case_name": "State of West Bengal v. Anwar Ali Sarkar",
      "citation": "1952 S.C.R. 284",
      "treatment": "followed",
      "relevance": "Strike down law delegating arbitrary power."
    },
    {
      "case_name": "Dwarka Prasad Laxmi Narain v. The State of Uttar Pradesh",
      "citation": "1954 S.C.R. 803",
      "treatment": "followed",
      "relevance": "Strike down law delegating arbitrary power."
    },
    {
      "case_name": "Dhirendra Krishna Mandal v. The Superintendent and Remembrancer of Legal Affairs",
      "citation": "1955 1 S.C.R. 224",
      "treatment": "followed",
      "relevance": "Strike down law delegating arbitrary power."
    },
    {
      "case_name": "Kathi Raning Rawat v. The State of Saurashtra",
      "citation": "1952 S.C.R. 435",
      "treatment": "followed",
      "relevance": "Uphold law laying down policy for discretion; policy from preamble and circumstances."
    },
    {
      "case_name": "P. Balakotiah v. Union of India",
      "citation": "1958 S.C.R. 1052",
      "treatment": "followed",
      "relevance": "Policy from Act read as a whole."
    },
    {
      "case_name": "M/s. Pannalal Binjraj v. Union of India",
      "citation": "1957 S.C.R. 233",
      "treatment": "followed",
      "relevance": "Policy from preamble."
    },
    {
      "case_name": "Khandige Sham Bhat v. Agricultural Income-tax Officer, Kasaragod",
      "citation": "1963 3 S.C.R. 809",
      "treatment": "followed",
      "relevance": "Larger discretion in taxation laws; geographical classification; legislative flexibility in taxation."
    },
    {
      "case_name": "Purshottam Govindji v. B. M. Desai",
      "citation": "1955 2 S.C.R. 887",
      "treatment": "referred",
      "relevance": "Taxation law not exception to classification doctrine."
    },
    {
      "case_name": "K. T. Moopil Nair v. State of Kerala",
      "citation": "1961 3 S.C.R. 77",
      "treatment": "referred",
      "relevance": "Taxation law not exception to classification doctrine."
    },
    {
      "case_name": "Bareilly Municipality v. Kundan Lal",
      "citation": "A.I.R. 1959 All. 562",
      "treatment": "followed",
      "relevance": "Power to select part of municipality for levy not arbitrary but controlled by Act's purpose."
    }
  ],
  "statutes_cited": [
    {
      "name": "Uttar Pradesh Municipalities Act, 1916 (U.P. Act No. 11 of 1916)",
      "sections": [
        "s.7",
        "s.8",
        "s.128(1)",
        "s.131(1)(b)",
        "s.131 to s.136",
        "s.128(1)(xi)",
        "s.128(1)(xii)",
        "s.135(2)",
        "s.136"
      ],
      "relevance": "Authorizes imposition of taxes in whole or part of municipality guided by duties and amenities; provides procedure for imposition."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 14",
        "Art. 19(1)(f)",
        "Art. 32"
      ],
      "relevance": "Test for equality and non-arbitrariness; fundamental right to property; enforcement of fundamental rights."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The petition under Art.32 challenging constitutional validity of s.128(1) and s.131(1)(b) of U.P. Municipalities Act, 1916, and imposition of house tax and scavenging tax in Civil Lines area of Bareilly Municipality, is dismissed. Court holds sections valid under Art.14, imposition justified by geographical classification linked to special amenities, procedure followed, and power exists for scavenging tax.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A fair reading of these three provisions makes it clear that the amounts collected by the Municipal Board by way of taxes are mainly intended to enable the Board to discharge its duties in the municipal area or a part of the municipal area, as the case may be.",
      "speaker": "court",
      "significance": "Discovers policy guiding discretion under s.128(1)."
    },
    {
      "text": "The impugned section in permitting in the matter of taxation geographical classification which has reasonable relation to the object of the statute, namely, for providing special amenities for a particular unit the peculiar circumstances whereof demand them, does not in any way impinge upon the equality clause.",
      "speaker": "court",
      "significance": "Upholds geographical classification under Art.14."
    },
    {
      "text": "There is a presumption when a statutory authority makes an order, that it has followed the prescribed procedure.",
      "speaker": "court",
      "significance": "Rejects procedural violation challenge."
    }
  ],
  "_case_id": "1963_79",
  "_label": 0,
  "_text_length": 28551,
  "_extracted_at": "2026-02-10T19:48:34.543380"
}