{
  "metadata": {
    "case_name": "Workmen of Indian General Navigation and Railway Co., Ltd. and Rivers Steam Navigation Co., Ltd. v. Indian General Navigation and Railway Co., Ltd. and Rivers Steam Navigation Co., Ltd.",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Das Gupta, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are the workmen of two Steamer Companies, the Indian General Navigation and Railway Co., Ltd., and the Rivers Steam Navigation Co., Ltd., jointly referred to as Joint Steamer Companies.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Disputes arose between the companies and their workmen on the question of bonus for the years 1949, 1950, 1951 and 1952.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Disputes referred by Government of West Bengal to Industrial Tribunal by two separate orders: one for 1949-1950, other for 1951-1952.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Tribunal disposed of references by one common judgment and rejected workmen’s claim for bonus for all four years.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Order of rejection confirmed by Labour Appellate Tribunal on different grounds.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appeals filed on special leave granted by Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Companies established more than a century ago; for more than half a century before partition, carried on transport business in eastern part of country in cooperation.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Business of transporting goods and passengers carried on in 600 or 700 vessels plying on Ganges and Brahmaputra rivers and tributaries.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Business continued after partition of India; portion of Pakistan intervened between Assam and remainder of India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Main traffic in 1949-1952: (a) traffic within India, (b) traffic within Pakistan, (c) traffic between India and Pakistan.",
      "type": "material",
      "date": "1949-1952",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Headquarters of companies remained at Calcutta.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Major portion of large fleet of vessels remained in common use for traffic originating in Pakistan, East Bengal and Assam; no appreciable part classed as specifically in one country.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Workmen’s claim for bonus based on contention that large profits earned by companies on operations in India, to which workmen contributed.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Companies contended transport business in India and Pakistan is one single, integrated, industrial undertaking; overall result to be considered for bonus.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Companies submitted charts showing no available surplus per Full Bench Formula applied to entire business.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "Workmen’s counsel conceded no case for bonus if Full Bench Formula applied to entire business in India and Pakistan.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "61.4% of total receipts in India, as admitted by companies’ witness; greater part of traffic from one point to another in India.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "Same vessel often carries traffic originating in India to India, also to Pakistan and from Pakistan to Assam.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "No indication in evidence how to allocate total expenditure between purely Indian operations and rest.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "No demarcation between vessels used in purely Indian operations and those for Pakistan or between.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Workmen complained of no access to certain account books.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Full Bench Formula has to be applied on the basis of the overall results of the Companies operations in India and Pakistan or on the results of the operations in India only.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the companies’ operations in Pakistan and India form one integrated industrial activity or two different units.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether it is possible to separate operations for application of Full Bench Formula to Indian operations only, given the evidence.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Large profits earned on operations in India; workmen contributed and entitled to bonus.",
      "supporting_facts": [
        "f13",
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Full Bench Formula to be applied on basis of profits derived in West Bengal or at any rate India excluding Pakistan.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "Full Bench Formula"
    },
    {
      "id": "pa3",
      "text": "Bulk of operations in India (61.4% receipts); greater part traffic within India; proper scrutiny of accounts would show considerable profits from Indian traffic.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Conditions in Pakistan different; unjust to deny bonus due to losses there.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Principles from Govt of India notification Dec 10, 1947 for avoiding double taxation could apply for apportioning profits.",
      "supporting_facts": [
        "f19"
      ],
      "legal_basis": null
    },
    {
      "id": "pa6",
      "text": "No fair hearing as no access to account books.",
      "supporting_facts": [
        "f21"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Transport business in India and Pakistan is one single, integrated, industrial undertaking; overall result of entire business to be considered.",
      "supporting_facts": [
        "f14",
        "f12",
        "f18"
      ],
      "legal_basis": "Full Bench Formula as in Associated Cement Companies Case (1959 S.C.R. 925)"
    },
    {
      "id": "ra2",
      "text": "No available surplus for bonus per charts applying Full Bench Formula to entire operations.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Full Bench Formula"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "If operations carried on as parts of one integrated industrial activity, no justification for deciding bonus on India operations only.",
      "addresses_issue": "i1",
      "key_observation": "Tests for integrality: integrality of functions, interdependence of finance, community of control, etc."
    },
    {
      "id": "cr2",
      "text": "Operations of transport company between places cannot be distinct; same employer same activity at different places may be integrated.",
      "addresses_issue": "i2",
      "key_observation": "Counsel did not seriously contend they form two different units."
    },
    {
      "id": "cr3",
      "text": "Impossible to apply Full Bench Formula to Indian operations only due to lack of evidence: difficulty in allocating receipts, expenditure, capital, rehabilitation.",
      "addresses_issue": "i3",
      "key_observation": "Same vessels used interchangeably; no demarcation."
    },
    {
      "id": "cr4",
      "text": "Tax agreement not suitable basis for Full Bench Formula.",
      "addresses_issue": "i3",
      "key_observation": "Specific to income-tax, not bonus."
    },
    {
      "id": "cr5",
      "text": "Even if accounts inspected, impossible on record to arrive at figures.",
      "addresses_issue": "i3",
      "key_observation": "Emphasize importance of providing access under s.21 Industrial Disputes Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Full Bench Formula to be applied to overall operations in India and Pakistan as one integrated activity; cannot separate on available materials.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Labour Appellate Tribunal rightly rejected workmen’s claim for bonus for 1949-1952.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Associated Cement Companies Case",
      "citation": "1959 S.C.R. 925",
      "treatment": "followed",
      "relevance": "Crystallized Full Bench Formula for ascertaining profit bonus"
    },
    {
      "case_name": "A.C.C. Ltd. v. Their Workmen",
      "citation": "1960 1 L.L.J. 1",
      "treatment": "referred",
      "relevance": "Tests for whether different operations form one integrated industrial activity"
    },
    {
      "case_name": "Pratap Press v. Their Workmen",
      "citation": "1960 1 L.L.J. 497",
      "treatment": "referred",
      "relevance": "Tests for integrated industrial activity"
    },
    {
      "case_name": "The Management of Pakshiraja Studio v. Their Workmen",
      "citation": "1961 3 F.L.R. 369",
      "treatment": "referred",
      "relevance": "Tests for integrated industrial activity"
    },
    {
      "case_name": "Fine Knitting Co., Ltd. v. I.C.",
      "citation": "1962 1 L.L.J. 275",
      "treatment": "referred",
      "relevance": "Tests for integrated industrial activity"
    },
    {
      "case_name": "D.C.M. Chemical Works v. Its Workmen",
      "citation": "1962 1 L.L.J. 388",
      "treatment": "referred",
      "relevance": "Tests for integrated industrial activity"
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act",
      "sections": [
        "s. 21"
      ],
      "relevance": "Protection against disclosure of confidential information; tribunals to allow access to relevant papers"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeals, upholding the Labour Appellate Tribunal's rejection of the workmen’s claim for bonus for 1949-1952, as the operations are one integrated activity and insufficient evidence to apply Full Bench Formula to Indian operations only.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "If all these operations are carried on as parts of one integrated industrial activity there would ordinarily be no justification for deciding the question of bonus on the operations in India only.",
      "speaker": "court",
      "significance": "Core reasoning on integrality for bonus calculation"
    },
    {
      "text": "All we wish to say is that on the materials on the present record we are not in a position to apply the Full Bench Formula to a part only of the total operations of the companies in India and Pakistan.",
      "speaker": "court",
      "significance": "Explains rejection due to evidentiary insufficiency"
    },
    {
      "text": "The provisions of s. 21 of the Industrial Disputes Act afford ample protection against disclosure of information which a party may wish to be treated as confidential.",
      "speaker": "court",
      "significance": "Guidance on disclosure in industrial adjudication"
    }
  ],
  "_case_id": "1963_118",
  "_label": 0,
  "_text_length": 16225,
  "_extracted_at": "2026-02-10T19:48:59.667602"
}