{
  "metadata": {
    "case_name": "Bhatdee Colliery (Appellant) v. Thirteen Workmen (Respondents)",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 24 of 1962",
    "date_of_judgment": "1963-01-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "A dispute was referred by the Central Government under s. 10 of the Industrial Disputes Act with reference to the thirteen workmen in the following terms: Whether the dismissal of the following thirteen workmen of Bhatdee Colliery was justified? If not, to what relief are they entitled and from which date?",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The thirteen workmen had physically obstructed the surface trammers working in the colliery on different dates, namely October 20, October 27, and November 3, 1959. Some of them had also incited the other workmen to join in this act of obstructing the loyal and willing trammers so that they may be prevented from working.",
      "type": "material",
      "date": "1959-10-20",
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "This happened during a strike which was begun on October 20, 1959 by the Colliery Mazdoor Sangh to which the thirteen workmen in question belonged.",
      "type": "background",
      "date": "1959-10-20",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellant served charge-sheets on the thirteen workmen on November 9, 1959 charging that they physically obstructed the surface trammers on duty at No. 1 and 2 Inclines from performing their duties and controlling the movement of the tubs by sitting in-between tramline track and inciting on various dates, thus violating regulation 38(1)(b) of the Coal Mines Regulations.",
      "type": "procedural",
      "date": "1959-11-09",
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "They were asked to explain within 48 hours why disciplinary action should not be taken against them under r. 27(19) and r. 27(20) of the Coal Mines Standing Order.",
      "type": "procedural",
      "date": "1959-11-09",
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "The workmen submitted their explanations and an inquiry was held by the Welfare Officer of the appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Welfare Officer found all the thirteen workmen guilty of the charges framed against them and recommended their dismissal.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f8",
      "text": "As another reference was pending before this very tribunal in November 1959, the appellant made thirteen applications to the tribunal under s. 33(2)(b) of the Act for approval of the action taken.",
      "type": "procedural",
      "date": "1959-11",
      "source": "appellant"
    },
    {
      "id": "f9",
      "text": "The tribunal approved of the action taken.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Thereafter the present reference was made under s.10 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The case put forward by the workmen in the present reference was that there was no proper enquiry as the workmen were not given a chance to defend themselves. It was further submitted that the dismissals were nothing but victimisation pure and simple for trade union activities.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "The tribunal held that the inquiry was proper, though it has not said so in so many words in its award.",
      "type": "procedural",
      "date": "1960-11-23",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The tribunal held that this was a case of victimisation. It therefore set aside the order of dismissal and ordered the reinstatement of the thirteen workmen within one month of its order becoming operative and ordered that they should be treated as on leave without pay during the period of forced unemployment. It did not grant back wages as the workmen had also contributed to their forced unemployment to some extent.",
      "type": "material",
      "date": "1960-11-23",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The strike was unsatisfactory and illegal as per the Regional Labour Commissioner, Central, Dhanbad.",
      "type": "background",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f15",
      "text": "The workmen concerned had put in ten years service or more and their previous record of service was good. They were important office bearers of the union and some of them were also protected workmen.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "There were previous disputes between the appellant and the union of which these workmen were members.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "There was another union in existence in this concern.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "In reports made to the police certain persons were mentioned as having taken part in the misconduct of October 27, 1959 but in the written-statement filed by the appellant two other persons, namely Ratan Gope and Sohan Gope who were not mentioned in the police report, were also mentioned as having taken part in the incident of October 27.",
      "type": "disputed",
      "date": "1959-10-27",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "The charge-sheets which were given to Ratan Gope and Sohan Gope were only about the incident of October 20. The finding of the domestic inquiry also was with respect to the incident of October 20.",
      "type": "admitted",
      "date": "1959-10-20",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the dismissal of the thirteen workmen was justified or amounted to victimisation?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the domestic inquiry was proper?",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether the punishment of dismissal was unconscionable or grossly out of proportion to the nature of the offence so as to infer victimisation?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There was no evidence to justify the conclusion of the tribunal that the dismissals were an act of unfair labour practice or victimisation.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f6",
        "f7",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Where a domestic inquiry is held properly, the tribunal does not sit in appeal on the findings of the domestic tribunal and can only interfere where there is want of good faith or basic error or violation of principles of natural justice, or findings perverse or baseless, or victimisation or unfair labour practice.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "s. 33(2)(b) of the Industrial Disputes Act"
    },
    {
      "id": "pa3",
      "text": "The misconduct was serious: physical obstruction of willing workmen during an illegal strike by sitting between tramlines; dismissal justified.",
      "supporting_facts": [
        "f2",
        "f3",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "No inference of victimisation merely from punishment of dismissal; relations not happy with union but that does not give carte blanche to commit misconduct.",
      "supporting_facts": [
        "f15",
        "f16",
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "Mistake in written statement regarding Ratan Gope and Sohan Gope for Oct 27 incident does not make finding perverse as charges and inquiry were for Oct 20.",
      "supporting_facts": [
        "f18",
        "f19"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "There was no proper enquiry as the workmen were not given a chance to defend themselves.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The dismissals were nothing but victimisation pure and simple for trade union activities.",
      "supporting_facts": [
        "f15",
        "f16"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The tribunal approved the action under s.33(2)(b), so inquiry was proper; tribunal could not have approved if improper.",
      "addresses_issue": "i2",
      "key_observation": "Proceed on assumption that inquiry proper and findings justified."
    },
    {
      "id": "cr2",
      "text": "Tribunal did not find basic error, violation of natural justice, or perverse findings.",
      "addresses_issue": "i2",
      "key_observation": "Tribunal aware it does not sit in appeal over domestic inquiry."
    },
    {
      "id": "cr3",
      "text": "Even assuming guilt, no victimisation: long service, union office etc. do not give immunity; previous disputes and unhappy relations not evidence of victimisation.",
      "addresses_issue": "i1",
      "key_observation": "Office-bearers cannot have carte blanche for misconduct."
    },
    {
      "id": "cr4",
      "text": "Punishment not unconscionable or disproportionate: serious misconduct during illegal strike warranting dismissal.",
      "addresses_issue": "i3",
      "key_observation": "Physical obstruction of willing workers by sitting on tramlines."
    },
    {
      "id": "cr5",
      "text": "Mistake in written statement re Ratan Gope and Sohan Gope not perverse as no charge or finding for Oct 27.",
      "addresses_issue": "i1",
      "key_observation": "Tribunal patently wrong in using this as evidence of victimisation."
    },
    {
      "id": "cr6",
      "text": "Finding of victimisation based merely on conjectures and surmises; no evidence worth the name.",
      "addresses_issue": "i1",
      "key_observation": "Tribunal's award must be set aside."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Where domestic inquiry proper, tribunal interferes only for want of good faith, basic error, natural justice violation, perverse findings, or victimisation/unfair practice.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No victimisation here; punishment of dismissal justified for serious misconduct during illegal strike; no carte blanche for union activists.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Inference of victimisation not from disproportionate punishment alone unless unconscionable.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "National Tobacco Company of India Ltd. v. Fourth Industrial Tribunal",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Cited by tribunal that unconscionable punishment may indicate victimisation; court holds present case not such."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 10",
        "s. 33(2)(b)"
      ],
      "relevance": "Reference of dispute; approval of dismissal during pendency of another reference; tribunal's role in inquiry approval."
    },
    {
      "name": "Coal Mines Regulations",
      "sections": [
        "regulation 38(1)(b)"
      ],
      "relevance": "Violation charged for obstructing trammers."
    },
    {
      "name": "Coal Mines Standing Orders",
      "sections": [
        "r. 27(19)",
        "r. 27(20)"
      ],
      "relevance": "Basis for disciplinary action."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; tribunal's award set aside; dismissal of the thirteen workmen upheld.",
    "relief_granted": "None to workmen; dismissals upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "where a domestic inquiry is held properly the tribunal does not sit in appeal on the findings of the domestic tribunal and it can only interfere with the punishment inflicted as a result of the domestic inquiry where there is want of good faith or basic error or violation of the principles of natural justice, or where the findings are perverse or baseless or the case is one of victimisation or unfair labour practice.",
      "speaker": "court",
      "significance": "Defines limited scope of tribunal's interference with domestic inquiry."
    },
    {
      "text": "the fact that the relations between an employer and the union were not happy and the workmen concerned were office-bearers or active workers of the union would by itself be no evidence to prove victimisation, for if that were so, it would mean that the office-bearers and active workers of a union with which the employer is not on good terms would have a carte blanche to commit any misconduct and get away with it",
      "speaker": "court",
      "significance": "Rejects victimisation claim based on union animosity."
    },
    {
      "text": "punishment of dismissal for the misconduct proved may be so unconscionable or so grossly out of proportion to the nature of the offence that the tribunal may be able to draw an inference of victimisation merely from the punishment inflicted.",
      "speaker": "court",
      "significance": "Acknowledges but distinguishes principle on disproportionate punishment."
    }
  ],
  "_case_id": "1963_5",
  "_label": 1,
  "_text_length": 12209,
  "_extracted_at": "2026-02-10T19:47:03.896656"
}