{
  "metadata": {
    "case_name": "Management of R.S. Madhoram Sons (Agencies) Pvt. Ltd. v. Workmen",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 13 of 1963",
    "date_of_judgment": "1963-11-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "R.S. Madhoram Sons is a firm consisting of members of a joint Hindu family, in existence since April 1, 1946, with head-office at Dehra Dun and branches at Delhi, New Delhi, Mussoorie and Amritsar. It acts as selling representatives of Obeetee Private Ltd., Commonwealth Trust Ltd., United Coffee Supply Co. Ltd., Government contractors, and stockists of Elgin Mills Co. Ltd.",
      "type": "background",
      "date": "1946-04-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "R.S. Madhoram Sons (Agencies) Pvt. Ltd. (appellant company) came into existence on August 29, 1961.",
      "type": "background",
      "date": "1961-08-29",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Firm had 92 employees on muster roll; 57 employed in retail business transferred to company.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Agreement on September 14, 1961, between firm and company: staff transferred with continuity of service guaranteed, terms and conditions unaffected, transferee liable for compensation on continuous service basis.",
      "type": "material",
      "date": "1961-09-14",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Agreement on September 15, 1961: company took over entire retail business of firm, with clauses 2 to 5 detailing terms.",
      "type": "material",
      "date": "1961-09-15",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Notice issued to 57 workmen post-transfer, stating services taken over by company, prior service counted, option to opt out within 3 days.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Workmen via respondent Union objected to transfer, unwilling to forego status as employees of firm despite willing to work.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Conciliation attempts failed; dispute referred to Industrial Tribunal, New Delhi by Delhi Administration (Ref. No. 307 of 1961).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Tribunal award dated January 20, 1962: transfer invalid, s.25FF inapplicable.",
      "type": "procedural",
      "date": "1962-01-20",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Muster roll common for all departments; terms and conditions same for all employees; employees transferable between departments/branches; bonus paid treating all as one unit.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "57 workmen not appointed solely for retail business but happened to be in charge as matter of accident.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether s. 25FF of the Industrial Disputes Act, 1947 applies to the transfer of 57 employees along with the retail business from the firm to the company, making the company successor-in-interest.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Transfer valid under s.25FF; company is successor-in-interest of firm in regard to retail business; conditions of proviso to s.25FF complied with (continuity of service, no less favorable terms, compensation on continuous basis).",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "s. 25FF Industrial Disputes Act, 1947"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "s.25FF inapplicable as ownership or management of the undertaking not transferred to company; no scope for proviso.",
      "supporting_facts": [
        "f7",
        "f10"
      ],
      "legal_basis": "s. 25FF Industrial Disputes Act, 1947"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.25FF applies only if ownership or management of an undertaking transferred; normally entire undertaking, not partial department/branch unless distinct/separate business with separate employees/terms.",
      "addresses_issue": "i1",
      "key_observation": "Retail business not distinct: common muster roll, uniform terms, interchangeable employees, unity of employment."
    },
    {
      "id": "cr2",
      "text": "Matter of substance over form; evaluate all relevant factors, no single conclusive; here transfer does not amount to transfer of undertaking.",
      "addresses_issue": "i1",
      "key_observation": "Appellant not successor-in-interest; s.25FF and proviso inapplicable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Transfer of retail business and 57 employees does not constitute transfer of ownership or management of an undertaking under s.25FF.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Anakapalla Cooperative Agricultural and Industrial Society v. Workmen",
      "citation": null,
      "treatment": "referred",
      "relevance": "Whether transfer attracts s.25FF depends on evaluation of all relevant factors, no one overriding."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s. 25FF"
      ],
      "relevance": "Governs entitlement to notice and compensation on transfer of undertaking treated as retrenchment; proviso excludes if continuity, terms not worsened, compensation guaranteed."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; Tribunal's finding upheld that s.25FF does not apply as no transfer of ownership or management of undertaking occurred.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "in dealing with the problem, what industrial adjudication should consider is the matter of substance and not of form.",
      "speaker": "court",
      "significance": "Emphasizes substantive evaluation over formal transfer."
    },
    {
      "text": "the question as to whether a transfer has been effected so as to attract s. 25FF must ultimately depend upon the evaluation of all the relevant factors and it cannot be answered by treating any one of them as of overriding or conclusive significance.",
      "speaker": "court",
      "significance": "Principle for determining applicability of s.25FF."
    }
  ],
  "_case_id": "1963_278",
  "_label": 0,
  "_text_length": 14782,
  "_extracted_at": "2026-02-10T19:50:54.003625"
}