{
  "metadata": {
    "case_name": "Income-tax Officer v. Rajareddy Mallaram",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 290 of 1963",
    "date_of_judgment": "1963-11-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Baba Gowd, P.V. Rajareddy and Rajareddy Mallaram formed an association of persons called Nizamabad Group Liquor Shops (the Group).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For the Fasli year 1358 i.e. October 1, 1948 to September 30, 1949 the Group carried on business in liquor contracts obtained from the former State of Hyderabad.",
      "type": "material",
      "date": "1948-10-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "With the end of Fasli year 1358 the contracts came to an end. The business was then discontinued, and the Group was dissolved.",
      "type": "material",
      "date": "1949-09-30",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Group did not make a return of its income pursuant to the general notice under s. 22(1) of the Indian Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Income-tax Officer, Nizamabad Circle, issued a notice under s. 34 of the Income-tax Act calling upon Baba Gowd (one of the members of the Group) to file a return of the income of the Group, but Baba Gowd failed to file the return on the due date.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Income-tax Officer then assessed the taxable income of the Group under s. 23(4) at Rs. 51,000, and determined Rs. 8,826-14-0 as the tax payable.",
      "type": "procedural",
      "date": "1953-09-30",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Attempts made by the Income-tax Department to recover the tax from Baba Gowd having proved unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On March 13, 1954, the Income-tax Officer issued a notice of demand addressed to Rajareddy Mallaram (another member of the Group).",
      "type": "procedural",
      "date": "1954-03-13",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Rajareddy Mallaram applied under s. 27 of the Indian Income-tax Act for cancellation of the assessment. The application was rejected by the Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In appeal to the Appellate Assistant Commissioner, the order was set aside and the Income-tax Officer was directed to cancel the order of assessment under s. 23(4) and to make a fresh assessment after giving an opportunity to Rajareddy Mallaram to file a return and to produce the books of account of the dissolved Group.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The Income-tax Appellate Tribunal, Hyderabad Branch modified the order of the Appellate Assistant Commissioner. The Tribunal held that a valid order of assessment under s. 23(4) having already been made there could be no occasion to issue a fresh notice to Rajareddy Mallaram or to make a fresh assessment, but directed that the Appellate Assistant Commissioner consider whether Rajareddy Mallaram had been prevented by sufficient cause from making the return.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "At the instance of Rajareddy Mallaram the following two questions were referred to the High Court of Andhra Pradesh by the Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "High Court answered the first question in the affirmative (order bad in law) and held that the second question did not fall to be determined.",
      "type": "procedural",
      "date": "1960-01-19",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "High Court findings: order of assessment under s. 23(4) on 30-9-1953 bad in law because made on association and not members jointly and severally, and particularly as against member on whom notices u/ss. 34 and 22(4) not served; assessment not binding on petitioner as no notice u/s 22 to him and not assessed severally or jointly; applicant not liable as assessment not in conformity with s. 44.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "On the facts and in the circumstances of the case, was the order of assessment made by the Income-tax Officer under section 23(4) on 30-9-1953 bad in law?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If the answer to the above question is in the negative, was the applicant liable for the amount of tax payable as determined in that order of assessment by reason of the terms of section 44 of the Income-tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Even if the assessment after dissolution of the Group be regarded as valid, it is binding upon only those persons who were served with the notice calling for a return; s. 44 means every person (all persons) at dissolution liable jointly and severally, so all members must be individually served with notice of assessment, and those not served not bound.",
      "supporting_facts": [
        "f3",
        "f5",
        "f8"
      ],
      "legal_basis": "Section 44 of the Income-tax Act"
    },
    {
      "id": "ra2",
      "text": "The original assessment made under s. 23(4) was invalid, because notice of assessment was not served upon the Group in the manner provided by s. 63(2) of the Indian Income-tax Act, Baba Gowd who was served with the notice not being the principal officer who could be served with notice on behalf of the Group.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Sections 23(4), 63(2) of the Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s. 44 declares liability for assessment under Ch. IV in case of discontinuance or dissolution of association; every person who was member at time of discontinuance/dissolution jointly and severally liable to assessment and for tax payable; all provisions of Ch. IV apply.",
      "addresses_issue": "i1",
      "key_observation": "Group discontinued and dissolved; members liable jointly and severally."
    },
    {
      "id": "cr2",
      "text": "Citing Abraham case: s.44 ensures continuity in assessment machinery notwithstanding discontinuance; firm/association deemed to continue for assessment under Ch. IV.",
      "addresses_issue": "i1",
      "key_observation": "Assessment proceedings may be commenced and continued as if discontinuance not taken place."
    },
    {
      "id": "cr3",
      "text": "Association of persons assessed as unit or members separately re shares, but no machinery for assessing association income collectively in members' hands; no partial assessment limited to served member.",
      "addresses_issue": "i1",
      "key_observation": "Association has personality apart from members for assessment; continuity under s.44."
    },
    {
      "id": "cr4",
      "text": "s.44 'tax payable' means tax association would have paid but for dissolution; primary purpose to bring association income to tax post-dissolution; assessment of association income, members jointly severally liable in capacity as members.",
      "addresses_issue": "i1",
      "key_observation": "Procedure as if association continued; notice to appropriate person u/s 63(2) sufficient."
    },
    {
      "id": "cr5",
      "text": "Plea that respondent not served personally not sustainable.",
      "addresses_issue": "i1",
      "key_observation": "Notice to one member sufficient."
    },
    {
      "id": "cr6",
      "text": "Contention re invalid service u/s 63(2) not raised before Tribunal, does not arise out of Tribunal order, not referred; case decided on footing notice properly served and assessment properly made u/s 23(4).",
      "addresses_issue": "i1",
      "key_observation": "New plea not permitted."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Answer to first question in the negative: order of assessment not bad in law.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Applicant liable for the amount of tax payable under the order of assessment by reason of s.44.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "C.A. Abraham, Uppoottil, Kottayam v. The Income-tax Officer, Kottayam and another",
      "citation": "1961 2 S.C.R. 765",
      "treatment": "followed",
      "relevance": "Scheme of s.44 ensures continuity of assessment machinery for discontinued/dissolved firm/association as if discontinuance not occurred; applies to associations; valid assessment prerequisite for penalty post-dissolution."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "22(1)",
        "22(4)",
        "23(4)",
        "27",
        "34",
        "44",
        "63(2)"
      ],
      "relevance": "Governing assessment procedure, notices, cancellation applications, joint/several liability post-dissolution/discontinuance, service on principal officer; Ch. IV applies with continuity fiction."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court answers reversed: assessment order under s.23(4) valid and not bad in law; applicant (Rajareddy Mallaram) liable for tax payable under that order by virtue of s.44.",
    "relief_granted": "Appeal allowed with answers to referred questions in negative to first and affirmative to second.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Where any business... carried on by a association of persons has been discontinued, or where an association of persons is dissolved, every person who was at the time of such discontinuance or dissolution a member of such association shall... be jointly and severally liable to assessment under Chapter IV and for the amount of tax payable\" - s.44.",
      "speaker": "court",
      "significance": "Core provision interpreting joint/several liability post-dissolution."
    },
    {
      "text": "\"In effect, the Legislature has enacted by s.44 that the assessment proceedings may be commenced and continued against a firm of which business is discontinued as if discontinuance has not taken place.\"",
      "speaker": "court",
      "significance": "Explains continuity fiction from Abraham case applied here."
    },
    {
      "text": "\"The applicant was liable for the amount of tax payable under the order of assessment.\"",
      "speaker": "court",
      "significance": "Direct holding on second question."
    }
  ],
  "_case_id": "1963_214",
  "_label": 1,
  "_text_length": 13074,
  "_extracted_at": "2026-02-10T19:50:29.836499"
}