{
  "metadata": {
    "case_name": "Jabar Singh v. Genda Lal",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "P. B. Gajendragadkar J.",
      "A. Sarkar J.",
      "K. N. Wanchoo J.",
      "K. C. Das Gupta J.",
      "N. Rajagopala Ayyangar J."
    ],
    "case_number": "Civil Appeal No. 1042 of 1963",
    "date_of_judgment": "1963-12-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Election to Madhya Pradesh Assembly from Morena Constituency No. 5 took place on 21st February 1962 with appellant Jabar Singh and respondent Genda Lal among seven candidates.",
      "type": "background",
      "date": "1962-02-21",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Scrutiny of recorded votes and counting followed on 27th February 1962; appellant secured 5,671 votes, respondent 5,703 votes.",
      "type": "material",
      "date": "1962-02-27",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant applied for recounting; recount showed appellant secured 5,656 votes and respondent 5,654 votes; appellant declared elected by 2 votes.",
      "type": "material",
      "date": "1962-02-27",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent filed election petition challenging validity of appellant's election on ground of improper reception of votes in favour of appellant and improper rejection of votes in favour of respondent; prayed for restoration of initial results or re-scrutiny and declaration that respondent was duly elected.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Election Tribunal found 10 ballot papers in favour of respondent improperly rejected and 4 improperly accepted in favour of appellant, leading to respondent 5,664 votes and appellant 5,652 votes.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellant urged before Tribunal improper rejection of his votes and improper acceptance of respondent's votes; respondent objected absence of recrimination under s.97 and security.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Tribunal rejected respondent's contention, re-examined ballot papers, found 22 ballot papers cast in favour of respondent wrongly accepted; respondent did not secure majority.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Tribunal declared appellant's election void, refused declaration that respondent duly elected.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Cross-appeals to Madhya Pradesh High Court: No.46 of 1962 by appellant, No.1 of 1963 by respondent; High Court dismissed both relying on Inayatullah Khan and Bhim Sen Gopali, confirmed Tribunal.",
      "type": "procedural",
      "date": "1963-05-03",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant filed appeal by special leave to Supreme Court; respondent's application for leave dismissed as time-barred.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Election Tribunal found discrepancies in total ballot papers in some polling stations.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "In Tribunal, after issues on 49 votes improperly rejected for respondent and 32 improperly accepted for appellant, found 10 rejected and 4 accepted improperly.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Tribunal investigated appellant's claims: 10 votes improperly credited to respondent, 12 votes improperly denied to appellant.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Nature and scope of enquiry contemplated by sections 97, 100 and 101 of the Representation of the People Act, 1951, particularly whether under s.100(1)(d)(iii) Tribunal can examine validity of all votes without recrimination under s.97.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether in election petition claiming declaration under s.101 that petitioner duly elected, Tribunal must scrutinise all votes to determine majority of valid votes without recrimination.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under s.100(1)(d)(iii), Tribunal must examine validity of all votes counted for returned candidate; no application of s.97; can consider improper rejection of returned candidate's votes and improper acceptance for rival.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6"
      ],
      "legal_basis": "Sections 100(1)(d)(iii), 101(a) of RP Act 1951"
    },
    {
      "id": "pa2",
      "text": "To find under s.101(a) that petitioner received majority of valid votes requires recount after eliminating invalid votes; no limitations even without recrimination.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Section 101(a) RP Act 1951; Hari Vishnu Kamath v. Syed Ahmed Ishaque"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Returned candidate can only defend under s.100 with shield; to attack rival's votes requires recrimination under s.97 with notice and security; s.100(1)(d)(iii) limited to petitioner's allegations affecting returned candidate.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": "Sections 97, 100(1)(d)(iii), proviso to s.97 RP Act 1951"
    },
    {
      "id": "ra2",
      "text": "Even if Tribunal view on scope correct, relief not justified by pleadings; issues struck out for lack of recrimination.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": "Pleadings in para 4 special pleas; issue No.16"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under s.100(1)(d)(iii), enquiry limited to whether result insofar as concerns returned candidate materially affected by improper reception/refusal/rejection of votes; only votes improperly in favour of returned candidate or improperly against others; onus on petitioner; presumption of validity of counted votes per r.57(1).",
      "addresses_issue": "i1",
      "key_observation": "Scope limited by s.100(1)(d) requirement; no general scrutiny."
    },
    {
      "id": "cr2",
      "text": "For s.101(a) claim, if no recrimination under s.97, Tribunal assumes counted votes valid except those challenged under s.100; cannot challenge rival's votes without recrimination.",
      "addresses_issue": "i2",
      "key_observation": "Recrimination required for attack on rival's election."
    },
    {
      "id": "cr3",
      "text": "High Court correct in limiting enquiry; overruled broader view in Inayatullah Khan on s.101(a); accords with Bhim Sen.",
      "addresses_issue": "i1",
      "key_observation": "No general recount without specific pleadings and compliance."
    },
    {
      "id": "cr4",
      "text": "Ayyangar J. dissent: s.100(1)(d)(iii) permits returned candidate to prove improper reception for petitioner or rejection of own votes without recrimination to show not materially affected; but findings partly unsupported by pleadings.",
      "addresses_issue": "i1",
      "key_observation": "Even on broader scope, insufficient pleadings."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Enquiry under s.100(1)(d)(iii) confined to determining if returned candidate's election materially affected by specified irregularities; no scrutiny of all votes; recrimination under s.97 required to challenge rival candidate's votes under s.101.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Without recrimination, Tribunal cannot allow returned candidate to dispute validity of votes for petitioner or claim improper rejection of own votes beyond defence.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Inayatullah Khan v. Diwanchand Mahajan",
      "citation": "15 E.L.R. 219",
      "treatment": "distinguished",
      "relevance": "High Court relied on it for scope under ss.100,101; SC held its view on s.101(a) incorrect."
    },
    {
      "case_name": "Bhim Sen Gopali",
      "citation": "22 E.L.R. 288",
      "treatment": "followed",
      "relevance": "Substantially accords with SC conclusion on scope of enquiry."
    },
    {
      "case_name": "Lakshmi Shankar Yadav v. Kunwar Sripal Singh",
      "citation": "22 E.L.R. 47",
      "treatment": "distinguished",
      "relevance": "Allahabad HC view on scope under ss.100,101 incorrect."
    },
    {
      "case_name": "Vashist Narain Sharma v. Dev Chandra",
      "citation": "1955 1 S.C.R. 509",
      "treatment": "referred",
      "relevance": "Burden on petitioner to show material effect under s.100(1)(c)."
    },
    {
      "case_name": "Hari Vishnu Kamath v. Syed Ahmed Ishaque",
      "citation": "1955 1 S.C.R. 1104",
      "treatment": "distinguished",
      "relevance": "'Result of election' means on valid votes; does not enlarge enquiry to all votes."
    },
    {
      "case_name": "Keshav Laxman Borkar v. Dr. Devrao Laxman Anande",
      "citation": "1960 1 S.C.R. 902",
      "treatment": "referred",
      "relevance": "Valid votes per s.36(8) and r.58."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "97",
        "100",
        "101",
        "81",
        "83",
        "84",
        "36",
        "117",
        "118"
      ],
      "relevance": "Govern election petitions, grounds for voiding election, recrimination, declarations of due election."
    },
    {
      "name": "Conduct of Election Rules, 1961",
      "sections": [
        "55",
        "56",
        "57",
        "63",
        "64",
        "39",
        "59"
      ],
      "relevance": "Scrutiny, counting, rejection of ballot papers, recounting; presumption of validity of non-rejected ballots."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed confirming High Court and Tribunal declaration of appellant's election void; no declaration for respondent as his challenge final; parties bear own costs.",
    "relief_granted": "None",
    "costs": "Parties to bear their own costs"
  },
  "key_quotes": [
    {
      "text": "the scope of the enquiry in a case falling under s.100(1)(d)(iii) is to determine whether any votes have been improperly cast in favour of the returned candidate, or any votes have been improperly refused or rejected in regard to any other candidate.",
      "speaker": "court",
      "significance": "Defines limited scope under s.100(1)(d)(iii)"
    },
    {
      "text": "If the returned candidate does not recriminate as required by s.97, then he cannot make any attack against the alternative claim made by the petition.",
      "speaker": "court",
      "significance": "Explains effect of non-recrimination on s.101 claim"
    },
    {
      "text": "the words 'in fact' used in s.101(a) do not add any new element as regards either the scrutiny or the counting.",
      "speaker": "Ayyangar J.",
      "significance": "Dissent on scope of scrutiny under s.101(a)"
    }
  ],
  "_case_id": "1963_95",
  "_label": 0,
  "_text_length": 78140,
  "_extracted_at": "2026-02-10T19:48:31.708601"
}