{
  "metadata": {
    "case_name": "Appellant Company v. Commissioner of Income-tax",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar J."
    ],
    "case_number": "Civil Appeal No. 63 of 1961",
    "date_of_judgment": "1963-12-06"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant, a limited company, is owner of building constructed on Plot No. 7, Church Gate Reclamation, Bombay, fitted up with furniture and fixtures for running as a hotel.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By lease dated August 30, 1949, appellant let out the fully equipped and furnished building to Voyantzis for term of six years certain from December 9, 1946, for running a hotel and ancillary purposes; monthly rent Rs. 5,950 for building and hire Rs. 5,000 for furniture and fixtures.",
      "type": "material",
      "date": "1949-08-30",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For assessment year 1953-54, Income-tax Officer assessed income from building under s. 9 and from furniture/fixtures under s. 12.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Appellate Assistant Commissioner on appeal held rent from building assessable only under s. 12 with allowances in sub-s. 4 where letting furniture/fixtures indispensable to letting building, but not so here, confirmed s. 9 for building.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Income-tax Appellate Tribunal confirmed authorities below; allowances in s. 12(4) only where letting building incidental to letting furniture/fixtures, not here; rejected s. 10 as specific head s. 9 applies, cited United Commercial Bank Ltd. v. CIT.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Tribunal at appellant's request stated case under s. 66(1) to Bombay High Court on question: Whether income from letting building properly computed under s. 9, 10 or 12.",
      "type": "procedural",
      "date": "1959-07-02",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Bombay High Court answered: Income from building under s. 9, from furniture/fixtures under s. 12, no part under s. 10.",
      "type": "procedural",
      "date": "1959-07-02",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellant never carried on hotel business in premises or otherwise.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Lease clauses: Lessee to use premises, furniture/fixtures for running hotel etc.; lessor to provide/maintain furniture etc., paint building, insure; renewal options; fire damage provisions.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether income derived from letting of the building constructed on Plot No. 7 is properly to be computed under section 9, 10 or under section 12 of the Income-tax Act, 1922.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether letting out of fully equipped hotel building amounts to business income under s. 10.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether letting of building and furniture/fixtures is inseparable so as to attract s. 12(4) allowances for building income.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Entire income should be assessed under s. 10 as income of business, as letting out commercial asset (fully equipped hotel) is business; alternatively under s. 12 as residuary source with allowances in sub-ss. 3 and 4.",
      "supporting_facts": [
        "f1",
        "f2",
        "f9"
      ],
      "legal_basis": "s. 10, s. 12 Income-tax Act 1922"
    },
    {
      "id": "pa2",
      "text": "Letting out totality of assets is business of assessee; lease covenants and company objects show carrying on business.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": "Company memorandum cl. 3(b)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Building income under s. 9 as specific section; furniture under s. 12; s. 12(4) inapplicable as primary letting of building, not incidental to furniture.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "s. 9, s. 12 Income-tax Act 1922"
    },
    {
      "id": "ra2",
      "text": "Inseparable letting under s. 12(4) means machinery/plant/furniture by nature inseparable from building or primary letting of furniture with building incidental.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": "s. 12(4)"
    },
    {
      "id": "ra3",
      "text": "Lease renewal and fire clauses treat building and furniture separately.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Heads of income in ss. 6-12 mutually exclusive; income from owned building taxable under s. 9 on annual value irrespective of rent.",
      "addresses_issue": "i1",
      "key_observation": "Cannot tax under s. 12 if s. 9 or s. 10 applies."
    },
    {
      "id": "cr2",
      "text": "Letting not business under s. 10: Appellant never ran hotel; exploitation of property by owner, not business; distinguished cases of prior business operation or working concerns.",
      "addresses_issue": "i2",
      "key_observation": "Letting commercial asset not inherently business; view from businessman's perspective."
    },
    {
      "id": "cr3",
      "text": "S. 12(4) applies to owner's inseparable letting of building with furniture/plant/machinery; takes building income out of s. 9 into residuary s. 12 for allowances under s. 10(2)(iv-vi).",
      "addresses_issue": "i3",
      "key_observation": "S. 12(4) has effect only if building rent treated as residuary income when inseparably let."
    },
    {
      "id": "cr4",
      "text": "Inseparable letting from parties' intention: Intended joint enjoyment for single purpose (hotel); one not let without other; separate rents irrelevant.",
      "addresses_issue": "i3",
      "key_observation": "Lease cl. 1(a),(h) show building/furniture for running hotel together; other clauses do not separate."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Income from letting not business under s. 10.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Letting of building and furniture/fixtures inseparable under s. 12(4); building rent computed under s. 12 with sub-s. 4 allowances; furniture under s. 12 sub-s. 3; not under s. 9.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "United Commercial Bank Ltd. v. Commissioner of Income-tax, West Bengal",
      "citation": "32 I.T.R. 688",
      "treatment": "followed",
      "relevance": "Heads of income mutually exclusive; specific head prevails over residuary."
    },
    {
      "case_name": "East India Housing and Land Development Trust Ltd. v. Commissioner of Income-tax",
      "citation": "42 I.T.R. 49 (1961)",
      "treatment": "followed",
      "relevance": "Income from shops/stalls is property income under s. 9 despite company objects of developing markets."
    },
    {
      "case_name": "Commissioner of Income-tax v. Mangalagiri Sri Umamaheswara Gin and Rice Factory Ltd.",
      "citation": "I.L.R. 50 Mad. 529 (1927)",
      "treatment": "distinguished",
      "relevance": "Letting equipped rice mill (never worked) business; but pre-s.12(4), focused on wear/tear of machinery."
    },
    {
      "case_name": "Commissioner of Income-tax v. Bosotto Brothers Limited, Madras",
      "citation": "8 I.T.R. 41 (1940)",
      "treatment": "distinguished",
      "relevance": "Letting hotel previously run by assessee; bound by Mangalagiri; pre-s.12(4); not letting business undertaking."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "s. 6",
        "s. 9",
        "s. 10",
        "s. 12",
        "s. 66(1)"
      ],
      "relevance": "Heads of income; s.9 for property annual value; s.10 business profits/allowances; s.12 residuary with sub-s.3/4 allowances for hire/inseparable letting."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court judgment set aside; rent from building computed under s.12 with sub-s.4 allowances, furniture/fixtures under s.12 sub-s.3; no part under s.9 or s.10.",
    "relief_granted": "Appellant entitled to s.12(4) allowances on building rent.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Whether a particular letting is business has to be decided in the circumstances of each case... from a businessmans point of view to find out whether the letting was the doing of a business or the exploitation of his property by an owner.",
      "speaker": "court",
      "significance": "Test for business income from letting."
    },
    {
      "text": "Inseparability... arising from the intention of the parties... Was it the intention... that the two should be enjoyed together? ... Would one have been let alone?",
      "speaker": "court",
      "significance": "Defines 'inseparable letting' under s.12(4)."
    },
    {
      "text": "Clause 1(a) [lessee covenant]: To use the demised premises and the said furniture and fixtures for the purpose of running hotel...",
      "speaker": "court",
      "significance": "Evidence of joint intention for hotel use."
    }
  ],
  "_case_id": "1963_94",
  "_label": 1,
  "_text_length": 29860,
  "_extracted_at": "2026-02-10T19:48:18.428902"
}