{
  "metadata": {
    "case_name": "C. Chatterjee v. Chief Commissioner of Pondicherry & Perumal Padayatchi",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Civil Appeal No. 569 of 1961 / Writ Petition No. 347 of 1960",
    "date_of_judgment": "1963-01-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Fourteen persons, including the petitioner, applied for a stage carriage permit before the State Transport Authority, Pondicherry.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The State Transport Authority rejected the petitioner's application and granted the permit to Perumal Padayatchi, considering various factors including that Perumal Padayatchi was a native of Pondicherry.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The petitioner appealed to the Chief Commissioner of Pondicherry acting as the Appellate Authority under the Motor Vehicles Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Appellate Authority (Chief Commissioner) dismissed the appeal on September 9, 1960, observing that even if the petitioner's claims were more or less equal to those of Perumal Padayatchi, the latter was entitled to preference as a native of Pondicherry.",
      "type": "material",
      "date": "1960-09-09",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "The petitioner used to live in Pondicherry but was not a native of Pondicherry.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "At the relevant time, Pondicherry was not within the territory of India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Pondicherry became part of the territory of India since August 1962.",
      "type": "background",
      "date": "1962-08",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The Chief Commissioner was appointed by, paid by, and subject to disciplinary control of the Government of India.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether granting preference for a stage carriage permit on the ground of being a native of Pondicherry (place of birth) violates Article 15 of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the appeal by special leave under Article 136 is maintainable against an order passed by an authority in Pondicherry when it was not within the territory of India.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the writ petition under Article 32 is maintainable against the Chief Commissioner (Appellate Authority), as a quasi-judicial authority under the control of the Government of India per Article 12, even when Pondicherry was outside the territory of India, and now that Pondicherry is part of India.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether 'under the control of the Government of India' in Article 12 qualifies 'authorities' or 'territory', and whether a quasi-judicial authority can be said to be under such control.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Grant of preference to Perumal Padayatchi on the ground of place of birth (native of Pondicherry) while petitioner was merely a resident discriminates against the petitioner, a citizen of India, and is hit by Article 15.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5"
      ],
      "legal_basis": "Article 15 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "Appeal under Article 136 not maintainable per Masthan Sahib case as Pondicherry not in territory of India, but writ under Article 32 maintainable as Appellate Authority is a local or other authority under the control of the Government of India per Article 12.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "Articles 12, 32, 136; N. Masthan Sahib v. Chief Commissioner, Pondicherry"
    },
    {
      "id": "pa3",
      "text": "Now that Pondicherry is part of India since August 1962, this Court can issue writ even if not earlier.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Article 32"
    },
    {
      "id": "pa4",
      "text": "'Under the control of the Government of India' in Article 12 qualifies territory, not authorities; or alternatively, since Chief Commissioner appointed, paid, and disciplinarily controlled by Government of India, it qualifies.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Article 12"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Pondicherry not within territory of India at relevant time, so Constitution (Articles 136, 32) did not apply; no jurisdiction for appeal or writ.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Articles 136, 32; N. Masthan Sahib v. Chief Commissioner, Pondicherry"
    },
    {
      "id": "ra2",
      "text": "Per Masthan Sahib, quasi-judicial authority like Chief Commissioner not 'under the control of the Government of India' within Article 12 merely by appointment, payment, disciplinary control; requires functional control which does not exist for quasi-judicial bodies.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Article 12; N. Masthan Sahib v. Chief Commissioner, Pondicherry"
    },
    {
      "id": "ra3",
      "text": "Pondicherry becoming part of India post-order does not confer retrospective jurisdiction; Constitution not retrospective.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "N. Masthan Sahib v. Chief Commissioner, Pondicherry; Janardan Reddy v. State"
    },
    {
      "id": "ra4",
      "text": "'Under the control of the Government of India' in Article 12 qualifies 'authorities', not 'territory'.",
      "supporting_facts": [],
      "legal_basis": "Article 12"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appeal not maintainable under Article 136 as order passed when Pondicherry not in territory of India.",
      "addresses_issue": "i2",
      "key_observation": "Article 136 applies only to territory of India; concluded by Masthan Sahib."
    },
    {
      "id": "cr2",
      "text": "In Article 12, 'under the control of the Government of India' qualifies 'all local or other authorities', not 'territory'; grammatically and by scheme, two kinds: within territory or under GOI control.",
      "addresses_issue": "i4",
      "key_observation": "Respondents' interpretation correct."
    },
    {
      "id": "cr3",
      "text": "Control under Article 12 means functional control to direct how authority functions; quasi-judicial authority cannot be directed to decide in particular manner, unlike executive/administrative.",
      "addresses_issue": "i3",
      "key_observation": "Appointment, payment, discipline insufficient; follows implication from Masthan Sahib."
    },
    {
      "id": "cr4",
      "text": "Chief Commissioner (quasi-judicial) not under control of GOI per Article 12; not 'State'; no violation of Article 15 enforceable via Article 32.",
      "addresses_issue": "i1",
      "key_observation": "Discrimination by non-State authority not protected."
    },
    {
      "id": "cr5",
      "text": "No retrospective jurisdiction post-Pondicherry integration.",
      "addresses_issue": "i3",
      "key_observation": "Constitution not retrospective."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appeal by special leave under Article 136 not maintainable against order from outside territory of India.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "'Under the control of the Government of India' in Article 12 qualifies authorities; includes those within territory or under functional GOI control.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Quasi-judicial authorities outside territory but administered by GOI not 'under the control of GOI' per Article 12, lacking functional control.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "No writ jurisdiction under Article 32; Appellate Authority not 'State'; Article 15 not violated in enforceable manner.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "N. Masthan Sahib v. Chief Commissioner, Pondicherry",
      "citation": "1962 Supp. 1 S.C.R. 981",
      "treatment": "followed",
      "relevance": "No jurisdiction under Articles 136 or 32 for authorities outside territory; quasi-judicial not amenable even if under administrative control of GOI."
    },
    {
      "case_name": "Janardan Reddy v. the State",
      "citation": "1950 S.C.R. 940",
      "treatment": "followed",
      "relevance": "Constitution not retrospective in operation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 12",
        "Article 15",
        "Article 32",
        "Article 136",
        "Article 142",
        "Article 144"
      ],
      "relevance": "Definition of 'State'; prohibition on discrimination; writ jurisdiction; special leave; enforcement limits; aid to Court."
    },
    {
      "name": "Motor Vehicles Act",
      "sections": [],
      "relevance": "Appellate Authority (Chief Commissioner) under the Act for stage carriage permits."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court dismissed the appeal (no order as to costs) as not maintainable under Article 136, and dismissed the writ petition with costs, holding no jurisdiction under Article 32 as the quasi-judicial Appellate Authority was not 'under the control of the Government of India' per Article 12 when the order was passed outside Indian territory.",
    "relief_granted": "None",
    "costs": "No costs in appeal; costs in writ petition."
  },
  "key_quotes": [
    {
      "text": "'under the control of the Government of India' ... qualifies the word authorities and not the word territory.",
      "speaker": "court",
      "significance": "Core interpretation of Article 12 rejecting petitioner's reading."
    },
    {
      "text": "The control envisaged under Art. 12 is control of the functions of the authorities concerned, and the right of the Government of India by virtue of that control to give directions to the authority to function in a particular manner.",
      "speaker": "court",
      "significance": "Defines 'control' excluding quasi-judicial authorities."
    },
    {
      "text": "We would add that these dismissals would not preclude the petitioners from approaching this Court, if so desired in the event of Pondicherry becoming part of the territory of India.",
      "speaker": "court",
      "significance": "Quoted from Masthan Sahib; Court holds even post-integration no retrospective writ."
    }
  ],
  "_case_id": "1963_7",
  "_label": 0,
  "_text_length": 25899,
  "_extracted_at": "2026-02-10T19:47:02.434541"
}