{
  "metadata": {
    "case_name": "Appellants (sons of Nagayya) v. Respondents (reversioners of Chandrappa)",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA J."
    ],
    "case_number": "Civil Appeal No. 331 of 1961",
    "date_of_judgment": "1963-05-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Three plaintiffs brought suit for partition: two claimed to be reversioners of Boppanna Chandrappa (Chandrappa), third a purchaser of interest of defendants 4, 5 and 7.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Plaintiffs claimed 5/6th share of properties, 6th defendant entitled as reversioner of Chandrappa to remaining 1/6th share.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Properties in actual possession of three sons of Nagayya, impleaded as first three defendants.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Defendants 1-3 denied properties ever belonged to Chandrappa and denied plaintiffs 1-2 and defendants 4,5,6,7 were his reversioners.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Main defence: Nagayya became entitled as Chandrappa's illatom son-in-law; Chandrappa brought Nagayya into family to marry wife's sister's daughter Mangamma, help in cultivation and management, in consideration Nagayya to inherit entire property after Chandrappa's death.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Trial Court (Subordinate Judge, Masulipatnam): All suit properties except small portion belonged to Chandrappa; plaintiffs entitled to 5/6th share, 6th defendant to 1/6th on death of Chandrappa's widow Ramamma; accepted Nagayya entitled as illatom son-in-law, dismissed suit.",
      "type": "procedural",
      "date": "1956-03-29",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "High Court of Andhra Pradesh (Appeal Suit No. 182 of 1950): Custom of illatom son-in-law inheritance cannot extend to marriage not with daughter but other relation; rejected alternative plea of contract between Nagayya and Chandrappa; set aside trial court decree, decreed suit.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appeal to Supreme Court on certificate granted by High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether rights of illatom son-in-law can be claimed where marriage was not with daughter but other relation of property owner.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether alleged contract between Chandrappa and Nagayya, for Nagayya marrying Mangamma and managing property in consideration of inheriting entire property, transferred interest to Nagayya on Chandrappa's death without specific performance.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Even if specific performance not sought or given, contract itself effected transfer of interest in property to Nagayya on Chandrappa's death.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Challa Papi Reddi v. Challa Koti Reddi (1872 7 Mad HCR 25); Bhalla Nahana v. Prabhu Hari (1877 2 ILR Bom 67); Asita Mohon Ghosh Moulik v. Mohan Ghosh Moulik (1916 20 CWN 901); Malraju Lakhmi Venkayyamma v. Ventaka Narasimha Appa Rao (1916 LR 43 IA 138)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Illatom rights not available; no valid contract conferring title without specific performance.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Illatom son-in-law rights not claimable where marriage not with daughter but other relation; no longer disputed.",
      "addresses_issue": "i1",
      "key_observation": "Custom cannot be extended to such case."
    },
    {
      "id": "cr2",
      "text": "Cited cases pre-date Transfer of Property Act 1882; post-TPA and s.53A (enacted 1929), equity of part performance only applies if s.53A requirements satisfied, which not here; no title transferred without registered instrument or specific performance.",
      "addresses_issue": "i2",
      "key_observation": "Equity cannot confer title which statute requires by registered instrument; s.53A does not apply."
    },
    {
      "id": "cr3",
      "text": "Ariff v. Jadunath Majumdar (PC 1931 LR 58 IA 91) clarified equity cannot override statute requiring registration.",
      "addresses_issue": "i2",
      "key_observation": "No unregistered document can confer registrable rights."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Nagayya or his heirs acquired no right in the property.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Challa Papi Reddi v. Challa Koti Reddi",
      "citation": "1872 7 Mad. H.C.R. 25",
      "treatment": "distinguished",
      "relevance": "Pre-TPA case on illatom-like arrangement ratifying sharer rights; not applicable post-TPA."
    },
    {
      "case_name": "Bhalla Nahana v. Prabhu Hari",
      "citation": "1877 2 I.L.R. Bom. 67",
      "treatment": "distinguished",
      "relevance": "Pre-TPA; widow's alienation valid per Hindu law to perform husband's contract; equity bound property."
    },
    {
      "case_name": "Asita Mohon Ghosh Moulik v. Mohan Ghosh Moulik",
      "citation": "1916 20 C.W.N. 901",
      "treatment": "distinguished",
      "relevance": "Adopted son entitled per Hindu law and Ikrarnama; not relevant to inheritance contract without performance."
    },
    {
      "case_name": "Malraju Lakhmi Venkayyamma v. Ventaka Narasimha Appa Rao",
      "citation": "1916 L.R. 43 I.A. 138",
      "treatment": "distinguished",
      "relevance": "Completed contract for possession post-life interest; relied on in later case but limited by statute."
    },
    {
      "case_name": "Ariff v. Jadunath Majumdar",
      "citation": "1931 L.R. 58 I.A. 91 (PC); 1930 I.L.R. 58 Cal. 1235 (HC)",
      "treatment": "followed",
      "relevance": "Equity cannot override registration statute; no rights without registered document."
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act, 1882",
      "sections": [
        "s. 53A"
      ],
      "relevance": "Doctrine of part performance only applicable if requirements satisfied; not here, so no title by equity."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding High Court decree for partition in favour of plaintiffs; held no illatom rights or contract-based title transferred to Nagayya or heirs without specific performance or s.53A compliance.",
    "relief_granted": "High Court decree for suit affirmed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is no longer disputed before us that the rights of an illatom son-in-law cannot be claimed by a person who under a promise from the owner of the property that he would inherit the property marries not the daughter but some other relation of the owner of the property.",
      "speaker": "court",
      "significance": "Concession on illatom issue."
    },
    {
      "text": "There can, in our opinion, be no doubt that after s. 53A was enacted the only case in which the English doctrine of equity of part performance could be applied in India is where the requirements of s.53A are satisfied.",
      "speaker": "court",
      "significance": "Key holding limiting equity post-TPA."
    },
    {
      "text": "Equity cannot confer on Nagayya or his heirs any title in the lands which under the statute could be conferred only by a registered instrument.",
      "speaker": "court",
      "significance": "Conclusion on no title transfer."
    }
  ],
  "_case_id": "1963_229",
  "_label": 0,
  "_text_length": 10268,
  "_extracted_at": "2026-02-10T19:50:23.313621"
}