{
  "metadata": {
    "case_name": "Legal Representatives of Late Rai Bahadur P. Banerjee v. Commissioner of Income Tax",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": "Civil Appeal No. 486 of 1962",
    "date_of_judgment": "1963-03-27"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Banerjee was the owner of several collieries in the Jharia Coal fields in the State of Bihar and was also a contractor for raising coal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Assessment year 1946-47. Banerjee initially assessed on an income of Rs. 1,28,738.",
      "type": "procedural",
      "date": "1946",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Assessment re-opened under s. 34 of the Indian Income-Tax Act and enhanced, but on appeal reduced to a sum a little below the original assessment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On January 22, 1946, Banerjee encashed high denomination notes of the value of Rs. 51,000.",
      "type": "material",
      "date": "1946-01-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In application under the Ordinance demonetizing high denomination notes, Banerjee explained possession as floating capital for colliery proprietor business, contractor under Messrs. Kilburn & Co. in name H.P. Banerjee Son, and under State Rly. Bokaro, Swang, Hazaribagh in name Jharia Dhanbad Coal Mica Mining Co. Paid 30/40 thousand weekly to labour, kept large sum for emergency, not profit.",
      "type": "disputed",
      "date": "1946",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Accounts with Imperial Bank of India, Nath Bank Ltd., Jharia, Central Bank of India Ltd., Bhowanipore Branch, but did not remember exactly from which bank the notes came, as transactions frequent.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Notice under s. 34 not questioned on usual grounds.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "ITO rejected explanation: No central account showing withdrawals from banks and remittances to businesses; none of books contained bank account; discrepancy of nearly Rs. 50,000 in statements filed by assessee.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "ITO treated Rs. 51,000 as profits from undisclosed source and assessed as income.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeals to Appellate Assistant Commissioner and Tribunal upheld ITO order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Assessee demanded case, refused; High Court directed statement on question whether Rs. 51,000 validly taxed as profits from undisclosed business.",
      "type": "procedural",
      "date": "1959-09-24",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Patna High Court answered in favour of Department.",
      "type": "procedural",
      "date": "1959-09-24",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Original assessee Rai Bahadur P. Banerjee dead; son substituted, also died during High Court proceedings; appeal by widow and other legal representatives.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Assessee claimed cash on hand Rs. 1,62,022 initially, corrected to Rs. 1,21,875 before AAC.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "No entries in books re banks; no central account of transfers; no account of personal expenses; unexplained why large sums kept at one place when banks at work sites.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "On same day as encashment, Rs. 45,000 drawn by cheque; next remittance Rs. 16,000 to Bokaro but Rs. 17,000 withdrawn few days before; Rs. 8,000 day later, Rs. 20,000 ten days later; Rs. 45,000 untouched; Rs. 6,000 withdrawn Jan 30 not utilized, making up Rs. 51,000.",
      "type": "material",
      "date": "1946-01",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in the circumstances of the case the amount of Rs. 51,000 being the value of high denomination notes encashed by the assessee, has been validly taxed as profits from some undisclosed business.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Since Department issued notice under s. 34, incumbent on Department to establish amount was income escaped assessment.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s. 34 Income Tax Act"
    },
    {
      "id": "pa2",
      "text": "Even if assessee required to prove source, sufficiently proved by showing large amounts on hand held for convenience in high denomination notes; burden discharged, evidence unrebutted.",
      "supporting_facts": [
        "f5",
        "f6",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Rely on Kanpur Steel Co. Ltd. v. CIT where Allahabad HC explained burden of proof; approved in Lalchand Bhagat Ambica Ram v. CIT.",
      "supporting_facts": [],
      "legal_basis": "Kanpur Steel Co. Ltd. v. CIT (1957) 32 ITR 56; Lalchand Bhagat v. CIT (1959) 37 ITR 288"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Cases involving encashment of high denomination notes numerous; explanation rejected where assessee unable to prove possession of sufficient cash.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "In Manindranath Das v. CIT, if assessee received amount in year of account, must show it does not bear character of income.",
      "supporting_facts": [],
      "legal_basis": "Manindranath Das v. CIT (1955) 27 ITR 522"
    },
    {
      "id": "ra3",
      "text": "Govindaraju Mudaliar v. CIT: If assessee fails to prove source and nature, ITO entitled to infer assessable nature.",
      "supporting_facts": [],
      "legal_basis": "A. Govindaraju Mudaliar v. CIT (1958) 34 ITR 807"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Burden of proof depends on facts; if receipt in accounting year, assessee must first show not income character; if fails, ITO may hold income from disclosed or undisclosed source.",
      "addresses_issue": "i1",
      "key_observation": "Applies to high denom notes cases with difficulty if books accepted and cash balance sufficient."
    },
    {
      "id": "cr2",
      "text": "Analyzes precedents: In cases with proved large cash balance and no inherent improbability, explanation accepted; otherwise, assessee must dispel cloud.",
      "addresses_issue": "i1",
      "key_observation": "Kanpur Steel not placing no burden on assessee; each case on facts."
    },
    {
      "id": "cr3",
      "text": "Correct approach: Assessee must establish source not income if asked; Dept can examine evidence; if unconvincing, reject and infer income.",
      "addresses_issue": "i1",
      "key_observation": "Receipt itself prima facie evidence if unexplained."
    },
    {
      "id": "cr4",
      "text": "In this case, assessee failed to prove cash balance: Books no bank entries, no central account, discrepancies, unexplained large cash at one place.",
      "addresses_issue": "i1",
      "key_observation": "Specific transactions show Rs.51k not from cash balance but other unexplained money."
    },
    {
      "id": "cr5",
      "text": "No special burden on Dept under s.34 once proceedings validly commenced; same rules as ordinary assessment.",
      "addresses_issue": "i1",
      "key_observation": "Additional assessment governed by usual burden rules."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High denomination notes of Rs. 51,000 represent income from some undisclosed source; assessment valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Burden on assessee to prove source of receipt not of income nature; Dept justified in rejecting unconvincing explanation.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kanpur Steel Co. Ltd. v. CIT",
      "citation": "1957 32 ITR 56",
      "treatment": "referred",
      "relevance": "Allahabad HC on burden; summarized but not fully approved as placing no burden on assessee."
    },
    {
      "case_name": "Lalchand Bhagat Ambica Ram v. CIT",
      "citation": "1959 37 ITR 288",
      "treatment": "followed",
      "relevance": "Explanation accepted where books genuine, large cash balance proved, no material to reject part."
    },
    {
      "case_name": "Manindranath Das v. CIT",
      "citation": "1955 27 ITR 522",
      "treatment": "followed",
      "relevance": "Assessee must prove receipt not income; partial rejection upheld."
    },
    {
      "case_name": "A. Govindaraju Mudaliar v. CIT",
      "citation": "1958 34 ITR 807",
      "treatment": "followed",
      "relevance": "Failure to prove source allows inference of assessable income."
    },
    {
      "case_name": "Chunilal Ticamchand Coal Co. Ltd. v. CIT",
      "citation": "1955 27 ITR 602",
      "treatment": "referred",
      "relevance": "Partial acceptance; if reasonable for part, good for whole absent distinguishing material."
    },
    {
      "case_name": "Mehta Parikh & Co. v. CIT",
      "citation": "1956 30 ITR 181",
      "treatment": "followed",
      "relevance": "Cannot reject part on surmise if books accepted."
    },
    {
      "case_name": "Sovachand Baid v. CIT",
      "citation": "1958 34 ITR 650",
      "treatment": "followed",
      "relevance": "Rejection of books reasonable; partial rejection as concession."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-Tax Act",
      "sections": [
        "s. 34"
      ],
      "relevance": "Reopening assessment; no special burden once validly commenced."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the assessee's appeal, upholding the High Court's decision that Rs. 51,000 from encashed high denomination notes was validly assessed as income from undisclosed source, as assessee failed to satisfactorily prove it was not income.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"If there is a receipt of an amount in the accounting year, it is incumbent in the first instance upon the assessee to show that it does not bear the character of income.\"",
      "speaker": "court",
      "significance": "Core principle on burden of proof."
    },
    {
      "text": "\"The Department cannot by merely rejecting unreasonably a good explanation, convert good proof into no proof.\"",
      "speaker": "court",
      "significance": "Limits Dept's power to reject explanations."
    },
    {
      "text": "\"Each case must depend upon its own peculiar facts.\"",
      "speaker": "court",
      "significance": "Approach to high denomination notes cases."
    }
  ],
  "_case_id": "1963_39",
  "_label": 0,
  "_text_length": 24334,
  "_extracted_at": "2026-02-10T19:47:51.105093"
}