{
  "metadata": {
    "case_name": "Dr. Yash Pal Sahi v. State",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Criminal Appeal No. 157 of 1962",
    "date_of_judgment": "1963-11-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Dr. Yash Pal Sahi and his wife Dr. Susheela Sahi are proprietors of a homoeopathic hospital at Jangpura in New Delhi and run a journal called the Homoeopathic Doctor.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On May 15, 1958, Misri Singh wrote to the appellant stating medicines manufactured by him were effective, requested Homoeopathic Doctor magazine from January 15, 1958 to date of letter, a list of medicines printed by appellant, and promised to pay prices by V.P.P.",
      "type": "material",
      "date": "1958-05-15",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "On May 24, 1958, appellant sent a packet containing Exhibits P-1 to P-6 (copies of Homoeopathic Doctor) and Ex. P-7 (list of medicines, Fehrist-i-Mujarabat, purporting to advertise medicines by describing effects and printing prices).",
      "type": "material",
      "date": "1958-05-24",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Misri Singh wrote to appellant under instructions of Mr. Seth, an officer in Delhi Administration; packet received by Misri Singh, opened in presence of Mr. Seth and other witnesses, found to contain Exs. P-1 to P-7.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Prosecution alleged appellant and wife committed offence under s.3 read with s.7 of Drugs and Magic Remedies (Objectionable Advertisement) Act, 1954 by sending the packet; complaint against wife withdrawn, case proceeded against appellant.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "At trial, evidence by Mr. Seth, Misri Singh, and Dr. Anant Parkash (Misri Singh's employer as clerk); appellant questioned by Magistrate and admitted sending Exs. P-1 to P-7.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Magistrate held appellant guilty, sentenced to fine of Rs. 1,000.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appeal to Additional Sessions Judge, New Delhi: confirmed conviction, but reduced fine to Rs. 500; found Exs. P-1 to P-6 not within mischief of Act, but Ex. P-7 within as list advertising medicines with effects and prices.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Revision to Punjab High Court Circuit Bench at Delhi (Criminal Revision No. 281-D of 1961): urged s.14(1)(c) not properly appreciated; dismissed on February 9, 1962.",
      "type": "procedural",
      "date": "1962-02-09",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Misri Singh works as clerk with Dr. Anant Parkash; not a registered medical practitioner.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Ex. P-7 bears printed in indelible ink at top: words for use only of registered medical practitioners.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appellant came to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether appellant guilty under s.3 read with s.7 of Drugs and Magic Remedies (Objectionable Advertisement) Act, 1954, or case falls under exception in s.14(1)(c).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether sending Ex. P-7 (list of medicines) amounts to taking part in publication of advertisement referring to drugs for correction of menstrual disorders or venereal diseases etc. under s.3(c) and (d).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Conviction not justified as case falls under s.14(1)(c): advertisement sent confidentially in prescribed manner; Misri Singh invited sending list; works as clerk with Dr. Anant Parkash, so appellant might bona fide believe him registered medical practitioner; Ex. P-7 complied with R.6 by bearing required legend in indelible ink.",
      "supporting_facts": [
        "f2",
        "f3",
        "f10",
        "f11"
      ],
      "legal_basis": "s.14(1)(c), Rule 6 of Rules under the Act"
    },
    {
      "id": "pa2",
      "text": "Misri Singh tempted appellant to send Ex. P-7; upon seeing legend, should not have opened but returned it.",
      "supporting_facts": [
        "f2",
        "f3",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Ex. P-7 contains medicines falling within s.3(c) and (d); sent to Misri Singh who is not registered medical practitioner; does not comply with s.14(1)(c) or R.6 fully.",
      "supporting_facts": [
        "f3",
        "f4",
        "f10"
      ],
      "legal_basis": "s.3(c)(d), s.14(1)(c), Rule 6"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.2(d) inclusive definition of 'taking any part in publication' includes printing and sending advertisement within India; wide enough to cover sending Ex. P-7.",
      "addresses_issue": "i2",
      "key_observation": "Sending prohibited advertisement within territories of India amounts to publication."
    },
    {
      "id": "cr2",
      "text": "Ex. P-7 falls within s.3(c) and (d) as list advertises drugs for prohibited purposes; single contravention sufficient under s.7.",
      "addresses_issue": "i1",
      "key_observation": "Medicines in Ex. P-7 suggest use for menstrual disorders and venereal diseases."
    },
    {
      "id": "cr3",
      "text": "s.3 subject to Act including exceptions in s.14; s.14(1)(c) applies only if sent confidentially in prescribed manner to registered medical practitioner etc.; Misri Singh not registered practitioner; no evidence appellant knew his status or bona fide believed otherwise; plea raised first time in SC.",
      "addresses_issue": "i1",
      "key_observation": "Prosecution proves recipient not practitioner; onus on accused to show falls under exception."
    },
    {
      "id": "cr4",
      "text": "Compliance with R.6 partial (legend printed) insufficient; must also send to registered practitioner or chemist as per s.14(1)(c) and R.6.",
      "addresses_issue": "i1",
      "key_observation": "One condition complied does not imply others."
    },
    {
      "id": "cr5",
      "text": "Act protects ignorant from duped by advertised medicines; lists must go only to registered practitioners; recipient not required to return unopened.",
      "addresses_issue": "i1",
      "key_observation": "Object of Act precludes argument that recipient should ignore due to legend."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sending Ex. P-7 amounts to publication under s.2(d); violates s.3(c)(d); does not fall under s.14(1)(c) exception.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Offence under s.3 read with s.7 proved; fine of Rs. 500 fair.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Drugs and Magic Remedies (Objectionable Advertisement) Act, 1954",
      "sections": [
        "s.2(d)",
        "s.3(c)",
        "s.3(d)",
        "s.7",
        "s.14(1)(c)"
      ],
      "relevance": "Defines publication, prohibits advertisements for specified diseases, penalties, exceptions for confidential sending to practitioners"
    },
    {
      "name": "Drugs and Magic Remedies (Objectionable Advertisement) Rules",
      "sections": [
        "Rule 6"
      ],
      "relevance": "Prescribes manner of sending under s.14(1)(c): by post, with legend 'For the use only of registered medical practitioners...'"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; conviction under s.3 read with s.7 of the Act upheld as Ex. P-7 sent to non-practitioner Misri Singh does not fall under s.14(1)(c) despite legend; fine of Rs. 500 by Additional Sessions Judge affirmed as fair.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"if sending out the advertisement outside India is brought within the purview of the inclusive definition, it is difficult to resist the conclusion that sending out the same advertisement within the territories of India to which the Act applies would amount to publication.\"",
      "speaker": "court",
      "significance": "Interprets wide scope of 'publication' under s.2(d)"
    },
    {
      "text": "\"The fact that one of the conditions prescribed by R. 6 has been complied with does not lead to the inference that the other conditions prescribed either by s. 14(1)(c) or by R. 6 have also been complied with.\"",
      "speaker": "court",
      "significance": "Rejects partial compliance argument for s.14(1)(c)"
    },
    {
      "text": "\"The whole object of the Act is to save ignorant people from being duped to purchase medicines just because their effect is advertised in eloquent terms.\"",
      "speaker": "court",
      "significance": "Explains purpose of Act, rejects entrapment-like defense"
    }
  ],
  "_case_id": "1963_254",
  "_label": 0,
  "_text_length": 13261,
  "_extracted_at": "2026-02-10T19:50:20.428998"
}