{
  "metadata": {
    "case_name": "Revenue v. Assessee",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, the assessee, entered into financing agreements with one Krishna Ayyar.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "From those agreements an income of Rs. 1,24,004 became due and receivable by him in the accounting year ending January 31, 1946, which was the previous year for the assessment year 1946-47.",
      "type": "material",
      "date": "1946-01-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "These financing agreements were in respect of certain works of construction to be carried out by Krishna Ayyar under contracts with the Government of India in certain places within the Indian State of Mysore as it was then constituted.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The assessee, who ordinarily resided in British India, contended in his assessment for the year 1946-47 that the aforesaid income accrued and arose to him in the Indian State of Mysore but had not been remitted into British India and, accordingly, that it was exempt from income-tax under section 14(2)(c) of the Income-tax Act as it then stood.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "The taxing authorities and the Tribunal held that the income had accrued in British India and was not, therefore, exempt.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "At the request of the assessee the Appellate Tribunal referred the following question to the High Court of Madras under section 66(1) of the Income-tax Act: Whether the aforesaid commission of Rs. 1,24,004 referred to in paragraph 7 supra is income that accrued or arose to the assessee in British India within the meaning of section 4(1)(b)(i) of the Indian Income-tax Act?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The High Court answered the question in the negative holding that the right to receive the income accrued to the assessee in the Mysore State and not in British India.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "The present appeal is against this judgment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the aforesaid commission of Rs. 1,24,004 referred to in paragraph 7 supra is income that accrued or arose to the assessee in British India within the meaning of section 4(1)(b)(i) of the Indian Income-tax Act?",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Whether the whole or any part of the assessee's income of Rs. 1,24,004 referred to in paragraph 7 of the Tribunal's statement of case accrued or arose to the assessee in the State of Mysore (as it was before 1950) and exempt from tax for the assessment year 1946-47 under section 14(2)(c) of the Indian Income-tax Act, 1922?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "If only part of such income accrued or arose to the assessee in the State of Mysore, what is the quantum thereof?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The taxing authorities and the Tribunal held that the income had accrued in British India and was not, therefore, exempt.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The assessee contended that the income accrued and arose to him in the Indian State of Mysore but had not been remitted into British India and was exempt under section 14(2)(c).",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 14(2)(c) of the Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The question as framed is confined to the point whether the income arose in British India. Such a question is clearly idle because under section 4(1)(b)(ii), as already stated, in spite of the income not accruing in British India, the assessee might be liable in respect of it.",
      "addresses_issue": "i1",
      "key_observation": "The referred question was misconceived; real question is whether income arose in Mysore for exemption under s.14(2)(c)."
    },
    {
      "id": "cr2",
      "text": "The High Court undoubtedly held that the income so arose [in Mysore]. But that was not the question which had been referred to it and admittedly it had no power to decide a question not referred to it.",
      "addresses_issue": "i1",
      "key_observation": "High Court answered wrong question."
    },
    {
      "id": "cr3",
      "text": "At the hearing before us the parties realised the difficulty that arose from the misconception of the real question that needed an answer. They, therefore, agreed that an order be passed by us setting aside the judgment of the High Court, framing the following questions and sending them back to the High Court for its decision.",
      "addresses_issue": "i2",
      "key_observation": "Parties agreed to remand with properly framed questions."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Set aside the judgment of the High Court, frame new questions on whether income arose in Mysore under s.14(2)(c), and remit to High Court for decision.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 4(1)(b)(i)",
        "Section 4(1)(b)(ii)",
        "Section 14(2)(c)",
        "Section 66(1)",
        "Section 3"
      ],
      "relevance": "Determines taxability of resident's income accruing outside British India and exemption if not remitted from Indian States; governs reference to High Court."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Supreme Court set aside the High Court judgment, framed proper questions on whether the income of Rs. 1,24,004 accrued in Mysore State entitling exemption under s.14(2)(c), and remitted the case back to High Court of Madras for decision.",
    "relief_granted": "Remand to High Court for determination on merits",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The question as framed is confined to the point whether the income arose in British India. Such a question is clearly idle...",
      "speaker": "court",
      "significance": "Highlights error in framing of referred question."
    },
    {
      "text": "The High Court undoubtedly held that the income so arose. But that was not the question which had been referred to it...",
      "speaker": "court",
      "significance": "Explains High Court's lack of jurisdiction on actual issue."
    }
  ],
  "_case_id": "1963_92",
  "_label": 1,
  "_text_length": 4497,
  "_extracted_at": "2026-02-10T19:48:13.622814"
}