{
  "metadata": {
    "case_name": "Jagdish Chand & Brahm Parkash v. Legal Representatives of Pt. Sham Sunder & Ors.",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Ayyangar J."
    ],
    "case_number": "Civil Appeals Nos. 76, 77 and 78 of 1961",
    "date_of_judgment": "1963-03-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Mohinder Singh owned eight properties in Delhi and created successively 24 mortgages between September 1943 and July 1944 and executed a sale in respect of one item.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Mortgage for Rs. 10,000/- created over plot No. 1, Pusa Road in Block 34 with bungalow and certain other properties in favour of Lajwanti by deed dated October 19, 1943.",
      "type": "material",
      "date": "1943-10-19",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Another mortgage executed in favour of Lajwanti for Rs. 16,000/- under which plot No. 1, Pusa Road was given as security, dated November 7, 1943.",
      "type": "material",
      "date": "1943-11-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Mortgage created in favour of Daulatram Narula inter alia on plot No. 1, Pusa Road to secure Rs. 60,000/-, dated January 21, 1944.",
      "type": "material",
      "date": "1944-01-21",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellant Jagdish Chand lent Rs. 10,000/- to Mohinder Singh and had mortgage executed on plot No. 1, Pusa Road, dated January 23, 1944.",
      "type": "material",
      "date": "1944-01-23",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Daulatram Narula obtained further mortgages over the same property and others: February 25, 1944 for Rs. 9,500/- and March 14, 1944 for Rs. 10,000/-.",
      "type": "material",
      "date": "1944-02-25",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Mohinder Singh created usufructuary mortgage in favour of Pandit Sham Sunder for Rs. 1,25,000/- on July 13, 1944, out of which Rs. 84,000/- reserved for payment to Daulatram Narula representing principal and interest due on his three mortgages.",
      "type": "material",
      "date": "1944-07-13",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On date of registration of Sham Sunder mortgage, Sham Sunder discharged Daulatram's mortgages by paying Rs. 84,000/-.",
      "type": "material",
      "date": "1944-07-13",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Amount due to Lajwanti not paid; she brought suit on June 14, 1945 in Senior Sub-Judge, Delhi for Rs. 11,657/5/4 after credits, impleading subsequent mortgagees including Jagdish Chand, Daulatram and Sham Sunder's legal representatives.",
      "type": "procedural",
      "date": "1945-06-14",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Mukhamal filed suit for Rs. 15,302/- on two mortgages dated February 1, 1944 (Rs. 10,000/-) and May 12, 1944 (Rs. 9,000/-), impleading subsequent mortgagees including Jagdish Chand, Daulatram and Sham Sunder LRs.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Genuineness of mortgages not seriously disputed; contest on respective rights inter se.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Mohinder Singh executed mortgage for Rs. 15,000/- in favour of Brahm Parkash (appellant in CA 76) on May 2, 1944 over plot No. 44 Block 17A and plot No. 19 Block 5.",
      "type": "material",
      "date": "1944-05-02",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Plot No. 14 Block 13 sold by Mohinder Singh to Mukhamal Gokul Chand by deed dated April 28, 1944.",
      "type": "material",
      "date": "1944-04-28",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Trial judge rejected Sham Sunder LRs' claim to subrogation against Jagdish Chand's later mortgage due to absence of specific agreement.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Sham Sunder LRs appealed to Punjab High Court; High Court allowed appeals holding no essential condition for subrogation requires express agreement.",
      "type": "procedural",
      "date": "1955-05-19",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Preliminary decree in Lajwanti suit dated April 28, 1947.",
      "type": "procedural",
      "date": "1947-04-28",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Mukhamal's appeal (RFA 28/1948) filed March 10, 1948 after limitation; application for condonation under s.5 Limitation Act supported by affidavit explaining delay due to Munim going to Pakistan.",
      "type": "procedural",
      "date": "1948-03-10",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "High Court condoned delay in Mukhamal's appeal considering partition disturbances.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "High Court upheld Mukhamal's claim to marshalling directing Lajwanti to proceed first against plot 44, then deficiency against plot 14.",
      "type": "procedural",
      "date": "1955-05-19",
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "East Punjab Act 16 of 1947 excluded period September 19 to November 15, 1947 for limitation computation.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether legal representatives of Sham Sunder entitled to subrogation to rights and priorities of Daulatram under mortgage dated January 21, 1944 against Jagdish Chand's mortgage of January 23, 1944 without written agreement, invoking equitable principle under s.92 TPA via s.6 Punjab Laws Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether presumption of intention to keep prior mortgage alive for subrogation rebutted by conduct or documents in case of Sham Sunder.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Mukhamal Gokul Chand entitled to marshalling under s.56 TPA as purchaser of plot No.14 from properties mortgaged to Lajwanti.",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether direction for marshalling prejudices rights of subsequent mortgagee Brahm Parkash.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether High Court properly condoned delay in filing Mukhamal's appeal under s.5 Limitation Act.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Even accepting no written agreement needed for subrogation, presumption that payer intended to keep charge alive is rebuttable and negatived here by terms of Sham Sunder mortgage (Rs.84,000 held in trust for Daulatram) and endorsements of discharge (as on behalf of mortgagor).",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Gokuldass Gopaldass v. Ram Bux Scochand"
    },
    {
      "id": "pa2",
      "text": "Subrogation claim not raised properly; intention is question of fact requiring pleading and evidence, not raised at trial or High Court.",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Benefit of marshalling under s.56 TPA not available to purchaser who is also a mortgagee over other properties.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Section 56 Transfer of Property Act"
    },
    {
      "id": "pa4",
      "text": "Marshalling prejudices subsequent encumbrancer Brahm Parkash as factual question of property value not considered.",
      "supporting_facts": [
        "f12",
        "f19"
      ],
      "legal_basis": "Section 56 Transfer of Property Act (last portion)"
    },
    {
      "id": "pa5",
      "text": "High Court erred in condoning delay without requiring explanation for each day's delay.",
      "supporting_facts": [
        "f16",
        "f17",
        "f18"
      ],
      "legal_basis": "Section 5 Limitation Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No essential condition for subrogation requires express written agreement; equitable principle applies under s.6 Punjab Laws Act.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Section 92 Transfer of Property Act; Section 6 Punjab Laws Act"
    },
    {
      "id": "ra2",
      "text": "Mukhamal entitled to marshalling as purchaser of one property from multi-property mortgage; irrelevant that he holds mortgage over other properties.",
      "supporting_facts": [
        "f2",
        "f13"
      ],
      "legal_basis": "Section 56 Transfer of Property Act"
    },
    {
      "id": "ra3",
      "text": "No prejudice to subsequent mortgagee pleaded or proved; question of fact requiring evidence on property value, not raised.",
      "supporting_facts": [
        "f12",
        "f19"
      ],
      "legal_basis": "Section 56 Transfer of Property Act"
    },
    {
      "id": "ra4",
      "text": "Sufficient cause for delay in appeal due to partition disturbances and Munim fleeing to Pakistan.",
      "supporting_facts": [
        "f17",
        "f20"
      ],
      "legal_basis": "Section 5 Limitation Act; East Punjab Act 16 of 1947"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appellant Jagdish Chand not permitted to argue rebuttal of intention for subrogation as not pleaded at trial or High Court, nor in statement of case to Supreme Court; only objection was absence of written agreement, rejected by High Court.",
      "addresses_issue": "i1",
      "key_observation": "Intention is question of fact requiring pleading, issue and evidence."
    },
    {
      "id": "cr2",
      "text": "No need to discuss merits of rebuttal contention as not properly raised.",
      "addresses_issue": "i2",
      "key_observation": "Plea assumes intention but fails on legal requirement wrongly asserted."
    },
    {
      "id": "cr3",
      "text": "High Court correctly condoned delay considering unprecedented partition events; no basis to interfere with discretion.",
      "addresses_issue": "i5",
      "key_observation": "Affidavit unchallenged; sufficient cause shown."
    },
    {
      "id": "cr4",
      "text": "s.56 TPA applies to purchaser even if also mortgagee over other properties; irrelevant to rights qua purchaser.",
      "addresses_issue": "i3",
      "key_observation": "Construction contended rejected."
    },
    {
      "id": "cr5",
      "text": "Prejudice under last portion of s.56 is question of fact on property value; not pleaded or evidenced by appellant at any stage.",
      "addresses_issue": "i4",
      "key_observation": "Too late to raise in Supreme Court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No written agreement essential for subrogation under equitable principles; claim established on pleadings.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Rebuttal of presumption requires proper pleading and evidence; not permitted if not raised earlier.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Purchaser entitled to marshalling under s.56 TPA without prejudice unless factually proved.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "No prejudice established where not pleaded.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "Delay condonation upheld.",
      "resolves_issue": "i5",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gokuldass Gopaldass v. Ram Bux Scochand",
      "citation": "1884 L.R. 11 I.A. 126",
      "treatment": "followed",
      "relevance": "Expounds test for subrogation: intention of party paying off charge presumed to act in interest absent contrary evidence."
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act",
      "sections": [
        "Section 92",
        "Section 56"
      ],
      "relevance": "Equitable principle of subrogation underlying s.92; right to marshalling for purchaser of one property from multi-property mortgage, not to prejudice others."
    },
    {
      "name": "Punjab Laws Act",
      "sections": [
        "Section 6"
      ],
      "relevance": "Permits invocation of equitable principle of subrogation though TPA not in terms applicable."
    },
    {
      "name": "Limitation Act",
      "sections": [
        "Section 5"
      ],
      "relevance": "Condonation of delay in filing appeal where sufficient cause shown."
    },
    {
      "name": "East Punjab Act 16 of 1947",
      "sections": [],
      "relevance": "Excluded period Sep 19-Nov 15, 1947 for limitation computation due to partition disturbances."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals 77 and 78 dismissed as subrogation claim properly allowed without new arguments on intention permitted; Appeal 76 dismissed upholding marshalling direction and delay condonation, with costs.",
    "relief_granted": "None to appellants; subrogation and marshalling upheld for respondents.",
    "costs": "Dismissed with costs - one set payable to executors of Pt. Sham Sunder."
  },
  "key_quotes": [
    {
      "text": "\"In India the art of conveyancing has been and is of a very simple character. ... The ordinary rule is that a man having a right to act in either of two ways shall be assumed to have acted according to his interest.\"",
      "speaker": "court",
      "significance": "Test for intention in subrogation from Gokuldass case."
    },
    {
      "text": "\"The question regarding the intention with which a prior encumbrance is discharged ... would be a question of fact and would have to be answered on a conspectus of the entire circumstances of the case.\"",
      "speaker": "court",
      "significance": "Requires pleading and evidence for rebutting presumption."
    },
    {
      "text": "\"The question of prejudice is purely one of facts which has to be pleaded and the necessary facts and circumstances established.\"",
      "speaker": "court",
      "significance": "Prejudice under s.56 TPA not assumable without proof."
    }
  ],
  "_case_id": "1963_193",
  "_label": 0,
  "_text_length": 21245,
  "_extracted_at": "2026-02-10T19:49:57.096341"
}