{
  "metadata": {
    "case_name": "Illury Subbayya Chetty Sons v. State of Andhra Pradesh",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 315 of 1962",
    "date_of_judgment": "1963-01-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a firm of merchants carrying on commission agency and other business at Kurnool, purchases and sells ground-nuts and other goods on behalf of principals for commission.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For the year 1952-53, Sales-tax authorities included in the appellant's taxable turnover an amount of Rs. 3,45,488/12/10 representing groundnut sales and collected the tax on the total turnover from it in September, 1953.",
      "type": "material",
      "date": "1953-09",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The said turnover of Rs. 3,45,488/12/10 represented sales of groundnuts and not purchases and tax was recovered from the appellant on the said amount illegally inasmuch as it is only on purchase of groundnuts that the tax is leviable. As a result, appellant paid Rs. 5,398/4/3 for 1952-53.",
      "type": "disputed",
      "date": "1952-1953",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "For 1953-1954, appellant paid illegal tax of Rs. 1,159/11/9.",
      "type": "material",
      "date": "1953-1954",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Appellant instituted suit in court of Subordinate Judge at Kurnool to recover Rs. 8,349/- from respondent State of Andhra Pradesh, together with interest at 12% per annum.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant itself had included the transaction in question in the return submitted by it in form A and made payments tentatively every month to be adjusted after final assessment.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Final adjustment made in September 1953 and total amount due from appellant recovered.",
      "type": "procedural",
      "date": "1953-09",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Appellant did not prefer appeal to Deputy Commissioner of Commercial Taxes or Sales Tax Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Trial court framed issues: (1) whether suit barred by s.18-A; (2) whether excess collection of sales tax for two years and how much; (3) whether appellant estopped from questioning validity of assessment. Found in favour of appellant on all issues, decreed Rs. 6,558/- with 6% interest from Nov 12, 1955.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Respondent appealed to Andhra Pradesh High Court (A.S. No. 397 of 1957), judgment dated Nov 16, 1960. Full Bench upheld contentions: suit incompetent under s.18-A, alternatively on merits not justified. Allowed appeal, dismissed suit with costs. Appellant's cross-objections dismissed.",
      "type": "procedural",
      "date": "1960-11-16",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant came to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the suit instituted by the appellant seeking to recover illegally recovered sales tax is competent in the light of the scope and effect of section 18-A of the Madras General Sales Tax Act, 1939.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether there had been excess collection of sales tax for the years 1952-54 and if so, how much.",
      "framed_by": "lower_court"
    },
    {
      "id": "i3",
      "text": "Whether the appellant was estopped from questioning the validity of the assessment.",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in concluding suit incompetent; misjudged effect of s.18-A. General presumption that civil court remedy exists unless clearly barred expressly or by necessary implication.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Section 18-A of Madras General Sales Tax Act, 1939"
    },
    {
      "id": "pa2",
      "text": "If assessment made illegally, it is not 'assessment made under this Act'; section does not cover purported assessments. Refer to ss.17(1) and 18 using 'purporting to be done'.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "Sections 17(1), 18, 18-A of the Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Suit incompetent by s.18-A. Transactions were of purchase and not sale. Appellant included in returns, paid voluntarily, no appeal filed.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Section 18-A of the Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Presumption against excluding civil courts unless express or necessary implication. S.18-A expressly prohibits suits to set aside or modify any assessment made under the Act. No express provision for this suit, falls under prohibition.",
      "addresses_issue": "i1",
      "key_observation": "Prohibition express and unambiguous."
    },
    {
      "id": "cr2",
      "text": "Even illegal assessments are 'made under this Act' as they are by assessing officer exercising jurisdiction under Act. Correctness irrelevant; protects activity of assessing officer.",
      "addresses_issue": "i1",
      "key_observation": "Expression 'any assessment made under this Act' wide enough to cover all assessments whether correct or not."
    },
    {
      "id": "cr3",
      "text": "Act provides alternative remedies: appeals (s.11), revision (s.12), Tribunal (s.12A), High Court (s.12B,C,D), SC Art.136. Challenge must be via these, not suit.",
      "addresses_issue": "i1",
      "key_observation": "Scope of s.18-A judged in light of elaborated alternative remedies."
    },
    {
      "id": "cr4",
      "text": "Appellant voluntarily included transactions in returns, treated as taxable under s.5A(2), paid in advance, no dispute raised, no appeal. Position same as if disputed and rejected.",
      "addresses_issue": "i2",
      "key_observation": "Appellant conceded taxable character."
    },
    {
      "id": "cr5",
      "text": "Civil courts excluded where statutory tribunal acts without complying with fundamental provisions or judicial procedure making proceedings void. Not case here; merits challenge barred.",
      "addresses_issue": "i1",
      "key_observation": "Non-compliance must go to root making order void."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S.18-A bars civil suit to set aside or modify any assessment made under the Act, including illegal ones, as alternative remedies provided.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Andhra Pradesh v. Shri Krishna Cocoanut Co.",
      "citation": "(1960) 1 Andhra W.R. 279",
      "treatment": "referred",
      "relevance": "High Court decision in favour of trial court view but urged for reconsideration by Full Bench."
    },
    {
      "case_name": "Secretary of State v. Mask. Coy.",
      "citation": "(1940) 67 I.A. 222",
      "treatment": "followed",
      "relevance": "Exclusion of civil courts not readily inferred; but if excluded, civil courts can examine non-compliance with fundamental provisions or judicial procedure."
    },
    {
      "case_name": "Raleigh Investment Co. Ltd. v. Governor-General in Council",
      "citation": "(1947) 74 I.A. 50",
      "treatment": "followed",
      "relevance": "S.67 Income-tax Act bars suits to set aside assessments; 'made under this Act' describes provenance, not accuracy; use machinery provided."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras General Sales Tax Act, 1939 (Mad. IX of 1939)",
      "sections": [
        "Section 18-A",
        "Section 11",
        "Section 12",
        "Section 12-A",
        "Section 12-B",
        "Section 12-C",
        "Section 12-D",
        "Section 17(1)",
        "Section 18",
        "Section 5A(2)",
        "Section 3(1)",
        "Section 3(3)"
      ],
      "relevance": "S.18-A bars suits to set aside/modify assessments; provides alternative remedies via appeals/revisions; tax on groundnut purchases under s.5A(2) read with s.3."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 136"
      ],
      "relevance": "Appeal to Supreme Court by special leave."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upholds High Court; suit barred under s.18-A as it seeks to set aside/modify assessments made under the Act. Appellant must use alternative remedies provided.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The expression any assessment made under this Act is, in our opinion, wide enough to cover all assessments made by the appropriate authorities under this Act whether the said assessments are correct or not.",
      "speaker": "court",
      "significance": "Core holding on scope of s.18-A covering even illegal assessments."
    },
    {
      "text": "there is a general presumption that there must be a remedy in the ordinary civil courts to a citizen claiming that an amount has been recovered from him illegally and that such a remedy can be held to be barred only on very clear and unmistakable indications to the contrary.",
      "speaker": "court",
      "significance": "Presumption against exclusion of civil jurisdiction."
    },
    {
      "text": "the phrase made under this Act describes the provenance of the assessment it does not relate to its accuracy in point of law.",
      "speaker": "court",
      "significance": "Quoting Privy Council on similar provision in Income-tax Act."
    }
  ],
  "_case_id": "1963_6",
  "_label": 0,
  "_text_length": 19820,
  "_extracted_at": "2026-02-10T19:46:59.778847"
}