{
  "metadata": {
    "case_name": "Appellant v. State of Orissa",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "SARKAR J."
    ],
    "case_number": "Civil Appeals Nos. 41 to 49 of 1962",
    "date_of_judgment": "1963-04-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant entered into a contract with Hindusthan Steel Private Ltd. for the manufacture and supply of bricks at Rourkela in Orissa.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Large quantities of bricks were manufactured and supplied under the contract and the appellant received payment for them.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The respondent State assessed the appellant to sales tax under the Orissa Sales Tax Act, 1947 on these supplies on the basis that they were sales.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "The appellant contended that the contract was only for labour or for work done and material found, and that there was no sale of any goods on which the tax could be levied.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "The appellant moved the High Court of Orissa for a writ of mandamus directing the respondent State not to assess or levy the tax. The application was rejected in limine by the High Court.",
      "type": "procedural",
      "date": "1959-07-23",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The appellant came to this Court in appeal by special leave from the judgment and order dated July 23, 1959, of the Orissa High Court in O.J.C. No. 33 of 1959.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "A clause in the contract stated 'land will be given free' which was intended to make the earth available to the appellant for making the bricks.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The contract provided that the bricks would remain at the appellant's risk till delivery to the Company.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The contract provided that the appellant would not be able to sell the bricks to other parties without the permission of the Company.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In the tender submitted by the appellant and accepted to make the contract, he stated 'we hereby tender for the supply to the Hindusthan Steel Private Ltd. of the materials described in the undermentioned memorandum.' The memorandum described the materials as bricks, and also stated the quantities to be delivered and the rate at which materials are to be supplied.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The contract stated that if bricks are stacked in a specified manner then 75% of the value of the bricks at kiln site will be measured and paid. The balance of 25% will be paid finally when all the bricks have been delivered. Only full bricks as finally delivered will be taken into account.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Before the High Court was moved under Art. 226 for the writ, the appellant had filed appeals against the orders of assessment to the Sales Tax Appellate Tribunal. These appeals failed and the appellant's application for an order on the Tribunal to refer to the High Court the question of law raised was rejected by the High Court.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "This Court had granted leave to appeal from the High Court's order refusing to issue the writ before the appeal to the tribunal had been dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the contract was for a transfer of property in the bricks from the appellant to the Company for a consideration, constituting a sale under the Orissa Sales Tax Act, 1947.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the contract was one for work done and materials found rather than a sale of goods.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the appeal is concluded by the High Court's order refusing reference from the Tribunal.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The bricks were made out of earth belonging to the Company and therefore the bricks had all along been its property and there could be no transfer of property in them to it. This is founded on the clause 'land will be given free'.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The contract nowhere used the word 'sale' in connection with the supply of the bricks.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Even if the earth was transferred to the appellant, this was not a contract for sale of goods but one of work done and materials found.",
      "supporting_facts": [
        "f1",
        "f7"
      ],
      "legal_basis": "P.A. Raju Chettiar v. State of Madras; Clay v. Yates; Robinson v. Graves"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The supplies were sales taxable under the Orissa Sales Tax Act, 1947.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Orissa Sales Tax Act, 1947 (definition of sale as any transfer of property in goods for cash or deferred payment or other valuable consideration)"
    },
    {
      "id": "ra2",
      "text": "Preliminary objection: The appeal is concluded by the order of the High Court rejecting reference from the Tribunal as the appellant had pursued that remedy.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The clause 'land will be given free' meant that the property in the earth to be dug out for making the bricks would be transferred to the appellant. What was supplied was bricks, not earth, which are entirely different.",
      "addresses_issue": "i1",
      "key_observation": "It could not have been intended that the property in the earth would continue in the Company in spite of its conversion into bricks."
    },
    {
      "id": "cr2",
      "text": "Bricks remained at appellant's risk till delivery, implying they were his property. Appellant could not sell without permission, implying ownership. Tender was for supply of materials (bricks). Payment terms show sale.",
      "addresses_issue": "i1",
      "key_observation": "All these provisions plainly show that the contract was for sale of bricks and property passed from appellant to Company."
    },
    {
      "id": "cr3",
      "text": "Distinguishes P.A. Raju Chettiar v. State of Madras as facts different: there silver weight debited/credited, only labour paid; here property in earth transferred.",
      "addresses_issue": "i1",
      "key_observation": "Facts justify view that there was transfer of property in earth to appellant."
    },
    {
      "id": "cr4",
      "text": "Not necessary that word 'sale' be used to constitute a sale; transfer of property for consideration suffices.",
      "addresses_issue": "i1",
      "key_observation": "Under the contract there was a transfer of property in the bricks for consideration."
    },
    {
      "id": "cr5",
      "text": "Essence of contract test: intention that chattel (bricks) be produced and transferred as chattel for consideration. Here essence was delivery of bricks, not manufacture; skill/labour incidental as in tailor/shoemaker cases.",
      "addresses_issue": "i2",
      "key_observation": "Contract for transfer of chattels qua chattels; absurd to say essence was work of manufacture."
    },
    {
      "id": "cr6",
      "text": "Preliminary objection rejected: Leave granted by SC before Tribunal appeal dismissed; appellant could choose writ petition remedy which gives same relief; neither barred by other.",
      "addresses_issue": "i3",
      "key_observation": "Either remedy was open."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The contract was for sale of bricks involving transfer of property for consideration, taxable under Orissa Sales Tax Act, 1947.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The contract was not one for work done and materials found but for sale of goods.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Preliminary objection to appeal dismissed.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "P.A. Raju Chettiar v. State of Madras",
      "citation": "1955 6 S.T.C. 131",
      "treatment": "distinguished",
      "relevance": "Different facts: no transfer of property in silver to workmen as weight debited/credited and only labour paid."
    },
    {
      "case_name": "Clay v. Yates",
      "citation": "1856 1 H. & N. 73",
      "treatment": "referred",
      "relevance": "Illustrates contract for work done and materials found (printing book, printer finds paper)."
    },
    {
      "case_name": "Robinson v. Graves",
      "citation": "1935 1 K.B. 579",
      "treatment": "referred",
      "relevance": "Contract to paint portrait not sale of goods though artist supplies paint/canvas; delivery ancillary to work."
    },
    {
      "case_name": "Grafton v. Armitage",
      "citation": "1845 2 C.B. 313",
      "treatment": "followed",
      "relevance": "Tailor's claim is for price of goods, not work/labour."
    },
    {
      "case_name": "J. Marcel Furriers Ltd. v. Tapper",
      "citation": "1953 1 All. E.R. 15",
      "treatment": "followed",
      "relevance": "Tailor/shoemaker claim for price of goods delivered, not labour."
    }
  ],
  "statutes_cited": [
    {
      "name": "Orissa Sales Tax Act, 1947",
      "sections": [
        "Definition of sale: Any transfer of property in goods for cash or deferred payment or other valuable consideration"
      ],
      "relevance": "Basis for assessing tax on supplies as sales."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for writ petition in High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court held that the contract was for the sale of bricks involving transfer of property for consideration, taxable under the Orissa Sales Tax Act, 1947. The appeal against the High Court's rejection of the writ petition was dismissed. Preliminary objection raised by respondent was overruled.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Now, obviously bricks could not remain at the appellant's risk unless they were his property.\"",
      "speaker": "court",
      "significance": "Indicates ownership of bricks with appellant before delivery."
    },
    {
      "text": "\"All these provisions plainly show that the contract was for sale of bricks.\"",
      "speaker": "court",
      "significance": "Summarizes contract clauses proving it was a sale."
    },
    {
      "text": "\"What was the essence of the contract? Was it the intention of the parties in making the contract that a chattel should be produced and transferred as a chattel for a consideration?\"",
      "speaker": "court",
      "significance": "States the test to distinguish sale of goods from work/materials contract."
    },
    {
      "text": "\"It would be absurd to suggest that the essence of the contract was the work of manufacture and the delivery of the bricks was merely ancillary to the work of manufacture.\"",
      "speaker": "court",
      "significance": "Applies essence test to hold it was sale of bricks."
    }
  ],
  "_case_id": "1963_117",
  "_label": 0,
  "_text_length": 10000,
  "_extracted_at": "2026-02-10T19:49:04.013786"
}