{
  "metadata": {
    "case_name": "Buckingham Carnatic Co. Ltd. v. Venkatiah & Madras Labour Union",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 874 of 1962",
    "date_of_judgment": "1963-08-02"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Buckingham Carnatic Co. Ltd. is a company registered under Indian Companies Act with registered office at Madras and a Textile Mill in Madras City employing 14,000 workmen.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent Venkatiah went on leave for six days from January 10, 1957; taking intervening holidays, leave expired on January 18, 1957.",
      "type": "material",
      "date": "1957-01-10",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Venkatiah did not join duty on January 19, 1957, and remained absent without leave without any communication for extension.",
      "type": "material",
      "date": "1957-01-19",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On March 11, 1957, Venkatiah sent a letter to appellant stating he suffered from fever and dysentery after reaching village near Kanigiri, treated by Civil Assistant Surgeon, Kanigiri; accompanied by certificate stating chronic malaria and dysentery from January 15 to March 7, 1957.",
      "type": "material",
      "date": "1957-03-11",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Venkatiah appeared before Manager; sent to Senior Medical Officer of appellant for examination; Officer unable to confirm illness for nearly two months.",
      "type": "material",
      "date": "1957-03-22",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On March 23, 1957, appellant refused to reinstate Venkatiah as explanation for absence unsatisfactory; treated under Standing Order No. 8(ii).",
      "type": "material",
      "date": "1957-03-23",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Around June 15, 1957, Venkatiah obtained cash sickness benefit from Employees State Insurance Corporation for period covered by medical certificate; Regional Director accepted certificate as alternative evidence; Rs. 82-14-00 paid.",
      "type": "material",
      "date": "1957-06-15",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent Union took up Venkatiah's case; referred for adjudication to Labour Court at Madras as industrial dispute S.P.O. No. A-5411 of 1958.",
      "type": "procedural",
      "date": "1958",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Labour Court rejected appellant's objection on invalidity of reference; held termination justified under Standing Orders but inconsistent with s.73 ESI Act; directed reinstatement within two weeks without back-wages but with continuity of service.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellant filed Writ Petition No. 716 of 1958 in Madras High Court; allowed by Mr. Justice Balkrishna Ayyar who held s.73 inapplicable and award based on sympathy.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Respondents filed Letters Patent Appeal No. 82 of 1959; Division Bench allowed it, restored Labour Court award holding s.73 applicable and refusal to reinstate illegal and unfair.",
      "type": "procedural",
      "date": "1962-01-15",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellant appealed to Supreme Court with certificate under Art. 133(1)(c).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Standing Order No. 8(ii): Absent without leave for eight consecutive working days deemed to have left service without notice; if explanation satisfactory, converted to leave without pay; if due to sickness proved to satisfaction, medical leave.",
      "type": "background",
      "date": "1957",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "True scope and effect of provisions contained in s.73 of the Employees State Insurance Act, 1948.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether termination of service under Standing Order 8(ii) for absence without leave contravenes s.73 of the Act.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether appellant acted fairly in rejecting Venkatiah's medical certificate and explanation.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Case falls squarely within Standing Order 8(ii); absence for eight consecutive days without leave deems termination of contract; explanation unsatisfactory based on company's Medical Officer opinion.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5",
        "f6",
        "f13"
      ],
      "legal_basis": "Standing Order No. 8(ii)"
    },
    {
      "id": "pa2",
      "text": "S.73 prohibits punitive action during period of illness but does not apply to automatic termination under Standing Order 8(ii) which is not a positive act of discharge or punishment.",
      "supporting_facts": [
        "f6",
        "f13"
      ],
      "legal_basis": "Employees' State Insurance Act, 1948 s.73; s.85(d)"
    },
    {
      "id": "pa3",
      "text": "Sickness benefit received after period of alleged illness; s.73(1) inapplicable as no benefit received during illness.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Employees' State Insurance Act, 1948 s.73(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant did not properly discharge obligation of examining explanation reasonably; refusal to accept medical certificate unfair.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Standing Orders"
    },
    {
      "id": "ra2",
      "text": "S.73 applies; prohibits dismissal/discharge during period employee in receipt of sickness benefit; since benefit granted, termination illegal.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Employees' State Insurance Act, 1948 s.73"
    },
    {
      "id": "ra3",
      "text": "Anomalous for ESI Corporation to accept illness for benefits but employer reject for Standing Order; s.73 binds employer.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "Employees' State Insurance Act, 1948 s.73; Regulations under Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Standing Order 8(ii) deems absence for eight consecutive days without leave as termination of contract; explanation opportunity provided, but if unsatisfactory, termination stands; binding as statutory terms.",
      "addresses_issue": "i2",
      "key_observation": "Certified Standing Orders prevail over common law; no need for enquiry as under misconduct clause."
    },
    {
      "id": "cr2",
      "text": "Labour Court correctly found management justified under Standing Orders alone; High Court erred in interfering without mala fides allegation.",
      "addresses_issue": "i3",
      "key_observation": "Propriety of rejecting certificate for management to decide."
    },
    {
      "id": "cr3",
      "text": "S.73(1) prohibits employer from dismissing/discharging/punishing during period employee in receipt of sickness benefit (period of illness); moratorium on punitive actions during illness if benefit received.",
      "addresses_issue": "i1",
      "key_observation": "Prohibition not confined to sickness-related misconduct but all; however, termination here not during illness period."
    },
    {
      "id": "cr4",
      "text": "Termination under SO 8(ii) automatic from absence, not positive act/order of employer; 'discharge' in s.73 implies decision embodied in order.",
      "addresses_issue": "i2",
      "key_observation": "S.73 inapplicable to deemed abandonment."
    },
    {
      "id": "cr5",
      "text": "ESI acceptance of certificate under proviso to Reg.53 not binding on employer; no provision compels employer to accept.",
      "addresses_issue": "i1",
      "key_observation": "No inconsistency required."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S.73 ESI Act prohibits punitive actions (dismissal, discharge etc.) during period of employee's illness for which sickness benefit received, but applies only to positive acts/orders, not automatic termination under Standing Order 8(ii).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Termination under SO 8(ii) valid; does not contravene s.73.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Employees' State Insurance Act, 1948",
      "sections": [
        "s.73",
        "s.85(d)"
      ],
      "relevance": "Prohibits employer from dismissing/discharging/punishing during sickness benefit period; contravention penal; interpreted as not covering automatic termination under Standing Orders."
    },
    {
      "name": "Industrial Employment (Standing Orders) Act (implied)",
      "sections": [
        "Standing Order 8(ii)",
        "Standing Order 13(f)"
      ],
      "relevance": "Deems prolonged absence without leave as termination; binding statutory terms of service."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 133(1)(c)",
        "Art. 226"
      ],
      "relevance": "Certificate for appeal; writ jurisdiction limits."
    },
    {
      "name": "Employees' State Insurance (General) Regulations, 1950",
      "sections": [
        "Reg.53",
        "Reg.54",
        "Reg.55",
        "Reg.57",
        "Reg.58",
        "Reg.63",
        "Reg.64"
      ],
      "relevance": "Certification and claims for sickness benefit; proviso allows alternative evidence."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; order of Division Bench of Madras High Court set aside; order of single Judge restored. Appellant to reinstate Venkatiah on terms of Labour Court award (without back-wages, continuity of service) as assured in court.",
    "relief_granted": "Restoration of single Judge order quashing Labour Court award; reinstatement recommended by appellant.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"No employer shall dismiss, discharge, or reduce or otherwise punish an employee during the period the employee is in receipt of sickness benefit...\"",
      "speaker": "court",
      "significance": "Verbatim s.73(1) ESI Act; core provision interpreted."
    },
    {
      "text": "\"...the plain object of the clause is to put a sort of a moratorium against punitive actions during the pendency of the employees illness.\"",
      "speaker": "court",
      "significance": "Crux of s.73 interpretation."
    },
    {
      "text": "\"...termination of the employees services follows automatically... from a Standing Order... such termination is not the result of any positive act or order on the part of the employer...\"",
      "speaker": "court",
      "significance": "Why s.73 inapplicable to SO 8(ii)."
    }
  ],
  "_case_id": "1963_72",
  "_label": 1,
  "_text_length": 30040,
  "_extracted_at": "2026-02-10T19:48:22.214276"
}