{
  "metadata": {
    "case_name": "Ram Bilas Singh & Ors. v. State",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Criminal Appeal No. 73 of 1961",
    "date_of_judgment": "1963-01-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dispute between Ram Bilas Singh, his sons Ram Naresh Singh and Dinesh Singh (appellants) and Deva Singh (P.W. 2) and his brothers over a Dochara in village Dihara.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "On April 22, 1957, at about 9.00 a.m., Deva Singh, his brother Laldeo Singh (deceased), Dhunmun Singh (P.W. 4) and Dasain Hajam were sitting in the Dochara.",
      "type": "material",
      "date": "1957-04-22",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Appellant No. 1 Ram Bilas Singh arrived in a truck with a mob of 40 to 50 persons including appellants 2 and 3, Ramdeo Singh, Ram Bilas Singh Gumasta of Dihara and others (total 7 named accused).",
      "type": "material",
      "date": "1957-04-22",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Ram Bilas Singh fired gun hitting Laldeo Singh on chest; he fell but got up. Ramdeo Singh (acquitted) fired hitting chest again. Ram Bilas Singh Gumasta (acquitted) fired second shot on abdomen killing Laldeo instantaneously.",
      "type": "material",
      "date": "1957-04-22",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Ram Bilas Singh fired two shots at Deva Singh hitting right thigh. Appellants Ram Naresh Singh and Dinesh Singh assaulted Deva Singh with lathis; he fell down.",
      "type": "material",
      "date": "1957-04-22",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Mob dismantled Dochara by demolishing mud pillars; thatched roof fell. Took away palang, bamboo cot, two quilts, lantern, garansa.",
      "type": "material",
      "date": "1957-04-22",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Villagers including Jagdish Singh, Bhagwat Singh (dead), Ajodhya Singh arrived. Report lodged; police held panchnama/inquest on Laldeo Singh's body.",
      "type": "procedural",
      "date": "1957-04-22",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Search for 7 accused; arrested later, committed to magistrate for trial under ss. 148, 302/149, 426 IPC. Specific charges: Ram Bilas Singh, Ramdeo Singh, Ram Bilas Gumasta under 302; Ram Bilas under 307 for Deva; Ram Naresh and Dinesh under 323 for Dhunmun Singh.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Sessions Court acquitted Ram Bilas Singh and Ramdeo of 302 IPC, all 7 of 302/149 IPC; convicted 3 appellants under 304 Part II r/w 149, 147, 426 IPC; acquitted appellants 2&3 of 323 IPC; acquitted other 4.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Patna High Court (judgment Nov 3, 1960, Cr App 326/1958) altered appellants' conviction from 304 Pt II/149 to 326/149 IPC, maintained 147 and 426 convictions and sentences.",
      "type": "procedural",
      "date": "1960-11-03",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Defence: Appellants in possession of Dochara; Laldeo and Deva threatened to dismantle; appellants marched with 15-20 persons with weapons. Laldeo and Deva flourished farsis/gandasas; their party used lathis/spears injuring 4 on appellants' side. Ram Lakhan Singh (deceased) fired in self-defence hitting Laldeo and Deva; Laldeo died, mob dispersed.",
      "type": "disputed",
      "date": "1957-04-22",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Both courts below rejected defence claim of possession; appellant counsel does not controvert this finding.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "FIR by Deva Singh names only 7 persons, no others.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "High Court found Laldeo killed by shot from Ram Bilas Singh Gumasta (acquitted), based on ballistic evidence disregarded by Sessions Court.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether appellants can be convicted under s. 326 r/w s. 149 IPC after acquittal of 4 out of 7 named accused, and when fatal injury caused by acquitted person, without there being an unlawful assembly of 5 or more.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Effect of acquittal of some named accused on conviction of remaining under s. 149 IPC when prosecution case specifies only those named persons.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Powers of appellate court to reassess evidence against acquitted accused incidentally for determining liability under s. 149.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellants acquitted of s. 302/149 and appellant 1 of 302/307; cannot be convicted under s. 326/149 as only 3 left out of 7 named in charge sheet, not an unlawful assembly.",
      "supporting_facts": [
        "f9",
        "f10",
        "f13"
      ],
      "legal_basis": "s. 149 IPC; Harchanda v. Rex (Allahabad HC)"
    },
    {
      "id": "pa2",
      "text": "Cannot vicariously hold liable for act of acquitted person; no finding of unlawful assembly without setting aside acquittals.",
      "supporting_facts": [
        "f9",
        "f14"
      ],
      "legal_basis": "s. 149 IPC; Topandas v. State of Bombay"
    },
    {
      "id": "pa3",
      "text": "Prosecution case confined to 7 named; acquittal of 4 leaves less than 5; cannot invoke s. 149.",
      "supporting_facts": [
        "f3",
        "f8",
        "f13"
      ],
      "legal_basis": "Bharwad Mepa Dana v. State of Bombay; Kartar Singh v. State of Punjab; Sunder Singh v. State of Punjab; Mohan Singh v. State of Punjab"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Analysed precedents: Where prosecution case limited to named persons (5+), acquittal of some leaving <5 bars s.149 unless evidence shows additional unidentified persons participated.",
      "addresses_issue": "i2",
      "key_observation": "Acquittal of named accused good for all purposes unless incidental consideration allowed under CrPC s.423."
    },
    {
      "id": "cr2",
      "text": "In this case, FIR and prosecution case specify only 7 named; vague witness statements of 40-50 not basis for unlawful assembly beyond named.",
      "addresses_issue": "i1",
      "key_observation": "High Court assumed unlawful assembly without examining evidence properly."
    },
    {
      "id": "cr3",
      "text": "High Court concluded fatal shot by acquitted Ram Bilas Gumasta but did not reassess fully; should have examined if unlawful assembly existed independently.",
      "addresses_issue": "i3",
      "key_observation": "High Court erred by not reaching reasoned conclusion on unlawful assembly composition and prejudice."
    },
    {
      "id": "cr4",
      "text": "Conditions for s.149 post-acquittals: charge/evidence must indicate >5 including unidentified; here no such basis without prejudice.",
      "addresses_issue": "i2",
      "key_observation": "Prosecution evidence confined to 7 named; cannot hold 3 liable under s.149."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Court cannot invoke s.149 IPC to convict less than 5 named accused if prosecution case confined to those named and some acquitted, unless evidence shows additional unidentified participants.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court must fully examine evidence to find unlawful assembly of 5+ independently; cannot assume or rely solely on acquitted members' acts.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Harchanda v. Rex",
      "citation": "I.L.R. 1951 2 All. 62, 73",
      "treatment": "followed",
      "relevance": "Accused not constructively liable for wounds by acquitted persons when prosecution fails to explain."
    },
    {
      "case_name": "Topandas v. State of Bombay",
      "citation": "1955 2 S.C.R. 881",
      "treatment": "followed",
      "relevance": "Cannot convict one of conspiracy if others named acquitted; principle from Plummer."
    },
    {
      "case_name": "Bharwad Mepa Dana v. State of Bombay",
      "citation": "1960 2 S.C.R. 172, 181",
      "treatment": "distinguished",
      "relevance": "Unlawful assembly can include unidentified if evidence supports >5 even after acquittals."
    },
    {
      "case_name": "Kartar Singh v. State of Punjab",
      "citation": "1962 2 S.C.R. 395, 399",
      "treatment": "referred",
      "relevance": "If actual members >5 even if some convicted <5; but if named definite and <5 after acquittal, no."
    },
    {
      "case_name": "Sunder Singh v. State of Punjab",
      "citation": "1962 Supp. 2 S.C.R. 654, 663",
      "treatment": "referred",
      "relevance": "Appellate court can incidentally consider acquitted accused under CrPC s.423."
    },
    {
      "case_name": "Mohan Singh v. State of Punjab",
      "citation": "1962 Supp. 3 S.C.R. 848, 858",
      "treatment": "followed",
      "relevance": "s.149 applicable if evidence shows >5 including unnamed despite charge naming some acquitted."
    },
    {
      "case_name": "Krishna Govind Patil v. State of Maharashtra",
      "citation": "1964 Vol. 1 S.C.R. 678",
      "treatment": "referred",
      "relevance": "Analogous to s.34; cannot make new case with unidentified without evidence basis."
    },
    {
      "case_name": "Dalip Singh v. State of Punjab",
      "citation": "1954 S.C.R. 145",
      "treatment": "referred",
      "relevance": "Supports Kartar Singh on definite named accused."
    },
    {
      "case_name": "R. v. Plummer",
      "citation": "1902 2 K.B. 339",
      "treatment": "followed",
      "relevance": "Acquit all but specified number in riot/conspiracy unless others unnamed."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "304 Part II",
        "149",
        "326",
        "147",
        "426",
        "302",
        "148",
        "307",
        "323"
      ],
      "relevance": "Convictions under 304 Pt II/149 altered to 326/149 by HC; core issue on applicability of s.149 post-acquittals for unlawful assembly offences."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "423"
      ],
      "relevance": "Appellate powers to incidentally consider acquitted accused."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court held High Court erred in altering conviction to s.326/149 without properly finding unlawful assembly of 5+ persons independent of acquitted accused; prosecution case confined to 7 named persons.",
    "relief_granted": "Appeal by special leave allowed; High Court's alteration to s.326 r/w 149 set aside implicitly by finding error.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the acquittal of nine of the accused persons... we may proceed on the footing that the acquittal was good for all purposes and none of those nine persons can be held to have participated in the crime\"",
      "speaker": "court",
      "significance": "Affirms acquittal binding; from Bharwad Mepa Dana."
    },
    {
      "text": "\"If out of the six persons charged under s. 149... two persons are acquitted, the remaining four may not be convicted because the essential requirement of an unlawful assembly might be lacking.\"",
      "speaker": "court",
      "significance": "Principle where charge specific to named <5 after acquittal; from Sunder Singh."
    },
    {
      "text": "\"the Court cannot obviously make out a case for the prosecution which is not disclosed either in the charge or... there must be some foundation in the evidence that persons other than those named have taken part\"",
      "speaker": "court",
      "significance": "Cannot invent unidentified participants without evidence; from Krishna Govind Patil."
    }
  ],
  "_case_id": "1963_16",
  "_label": 1,
  "_text_length": 29505,
  "_extracted_at": "2026-02-10T19:47:52.721801"
}