{
  "metadata": {
    "case_name": "Criminal Appeal No. 131 of 1962",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J.",
      "Das Gupta J."
    ],
    "case_number": "Criminal Appeal No. 131 of 1962",
    "date_of_judgment": "1963-02-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On April 3, 1961 at about 2-30 A.M., a motor vehicle fell into a ditch by the side of a highway near Edlabad, District Jalgaon, and all the occupants of the vehicle were injured. One Mohmad Yusuf who was in that vehicle died of the injuries.",
      "type": "material",
      "date": "1961-04-03",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "The appellant was tried before the judicial Magistrate, First Class, Bhusawal, for offences of rash and negligent driving when he was under the influence of liquor and thereby causing the death of Mohmad Yusuf and injuries to four other occupants of the motor vehicle and also for offences under the Motor Vehicles Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Trial Magistrate held that the evidence was not sufficient to prove that the appellant was driving the motor vehicle at the time of the mishap, and acquitted the appellant of the offences under the Motor Vehicles Act and also under the Indian Penal Code. But he held that the evidence established that the appellant had at the material time consumed illicit liquor and had thereby committed an offence punishable under s. 66(b) of the Bombay Prohibition Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Trial Magistrate convicted the appellant and sentenced him to suffer rigorous imprisonment for three months and to pay a fine of Rs. 500/- and in default of payment of fine, to suffer rigorous imprisonment for two months.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "On appeal to the Court of Session, the order of conviction was set aside, and a retrial was directed, because in the view of the Court there had not been a fair and full trial.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "A revision application filed against the order in the High Court of Bombay was summarily dismissed on June 13, 1962.",
      "type": "procedural",
      "date": "1962-06-13",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The appellant has appealed to this Court with special leave against the order of the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Early in the morning of April 3, 1961 as a result of motor vehicle Temp. No. 170 B. M. B. falling in a ditch near Edlabad several persons including the appellant were injured.",
      "type": "background",
      "date": "1961-04-03",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "At about 6 a.m., the appellant reached the Civil Hospital, Jalgaon. On Dr. Kulkarni, Resident Medical Officer of the Hospital informing him about the death of Mohmad Yusuf, the appellant fainted and he was admitted as an indoor patient in the Hospital.",
      "type": "material",
      "date": "1961-04-03",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "On examination, the appellant was found smelling of alcohol. Dr. Kulkarni thereupon directed one Dr. Rote to collect a specimen of blood from the body of the appellant, and accordingly some venous blood was collected in a phial. The phial was closed in the presence of Dr. Rote and sealed.",
      "type": "material",
      "date": "1961-04-03",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Before treatment could be given to the appellant, he was discharged from the Hospital at the request of some persons who accompanied him. The blood specimen remained in the Hospital.",
      "type": "material",
      "date": "1961-04-03",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Information about the mishap to the motor vehicle was received by the police at Jalgaon at about 8 a.m., on that day and a case was registered against the appellant and four other persons for certain offences under the Indian Penal Code and the Motor Vehicles Act, and on receiving information that all the incumbents of the motor vehicle were at the time of the mishap in a state of intoxication, also under s. 66(b) of the Bombay Prohibition Act XXV of 1949.",
      "type": "procedural",
      "date": "1961-04-03",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "The Officer in charge of the investigation sent the appellant to the Civil Hospital for medical examination. The condition of the appellant was found by Dr. Kulkarni to be normal. A specimen of the appellant's blood was again collected at about 11 a.m., and was sent to the Chemical Analyser, for examination and report.",
      "type": "material",
      "date": "1961-04-03",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "On April 12, 1961, the Sub-Inspector in charge of the investigation came to learn that a specimen of blood of the appellant had been taken by the Hospital authorities early in the morning of April 3,1961. On demand by the police officer the Medical Officer delivered the phial containing the blood specimen together with a certificate from Dr. Rote that a blood specimen of the appellant was collected by him at 6 a.m., on April 3, 1961.",
      "type": "material",
      "date": "1961-04-12",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "The investigating officer affixed an additional seal on the package and forwarded the same with a special messenger to the Chemical Examiner on April 18, 1961.",
      "type": "material",
      "date": "1961-04-18",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "On examination of the contents of the phial it was found that there was concentration of alcohol to the extent of 0.069 per cent w/v ethyl alcohol. This concentration being in excess of the concentration mentioned in s. 66(2) of the Bombay Prohibition Act, a complaint for the offence under the Bombay Prohibition Act was also lodged against the appellant.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f17",
      "text": "At the trial, on behalf of the prosecution among others were examined Dr. Kulkarni, Dr. Rote and the investigating officer. The report of the Chemical Examiner was also tendered in evidence. But the special messenger who carried the sample was not examined nor was any evidence given about the place where and the condition in which the phial containing the blood specimen was kept in the Hospital.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "The appellant in his statement to the Court denied that concentration of alcohol detected by the Chemical Examiner from the specimen taken by Dr. Rote exceeded 0.069 per cent w/v. He admitted that on April 3, 1961 he was in the Civil Hospital in the early morning, that when he was told by Dr. Kulkarni about the death of Mohamad Yusuf he suffered a shock, that thereafter he went home immediately, and during that time his mental condition was not good.",
      "type": "admitted",
      "date": "1961-04-03",
      "source": "petitioner"
    },
    {
      "id": "f19",
      "text": "Appellant stated: 'I fell unconscious. I was semi-conscious. During that time my relations and friends gave me certain liquid as a sort of medicine. I felt like that. Then I was carried to the hospital in the same condition. As I regained my consciousness I told doctor that I want to leave the hospital because my friend was dead in hospital and as I did not feel it proper to live in hospital under such circumstances, so I left the hospital. I do not know who gave me medicine when I fell down on the road, after I had left the hospital.'",
      "type": "disputed",
      "date": "1961-04-03",
      "source": "petitioner"
    },
    {
      "id": "f20",
      "text": "The defence of the appellant therefore was that when he was informed about the death of Mohamad Yusuf he fainted and some medicinal preparation was administered to him by his friends to revive him and thereafter he was carried to the Civil Hospital. He has not admitted that any specimen of blood from his body was collected, but it appears to be his defence that if excessive concentration of alcohol was traced in the blood it was the result of some medicinal preparation administered to him by his friends.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f21",
      "text": "Dr. Rote stated in cross-examination that no methyl spirit was applied before extracting blood.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f22",
      "text": "There is no evidence on the record about the person in whose custody this phial remained till it was handed over to the Sub-Inspector of police on April 13, 1961, when demanded. There is also no evidence about the precautions taken to ensure against tampering with the contents of the phial when it was in the Civil Hospital and later in the custody of the police between April 13, 1961, and April 18, 1961.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Even the special messenger with whom the phial was sent to the Chemical Examiner was not examined and Ext. 43 which was the acknowledgment signed by some person purporting to belong to the establishment of the Chemical Examiner does not bear the official designation of that person.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f24",
      "text": "The report of the Chemical Examiner mentions that a sealed phial was received from the police officer by letter No. C/010 of 1961 dated April 18, 1961, but there is no evidence that the seal was the one which was affixed by Dr. Rote on the phial.",
      "type": "disputed",
      "date": "1961-04-18",
      "source": "court"
    },
    {
      "id": "f25",
      "text": "The report of the chemical examination of the blood specimen collected at 11 a.m. on April 3, 1961, was also not tendered in evidence by the prosecution though the same was demanded.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the blood specimen collected at 6 a.m. on April 3, 1961, not in the course of police investigation under s.129A, can be used to raise the presumption under s.66(2) of the Bombay Prohibition Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Sessions Judge was justified in ordering a retrial instead of directing additional evidence under s.428 CrPC, given the infirmities in proof of the chain of custody and integrity of the blood sample.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether ss.129A and 129B prescribe the exclusive method for proving blood alcohol concentration for the purpose of s.66(2) presumption, or can it be proved otherwise.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Admissibility of the Chemical Examiner's report under s.510 CrPC or s.129B(b), and whether it overrides general evidence rules.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The report of the Chemical Examiner on which alone substantially the case of the prosecution rests is inadmissible in evidence because to raise a presumption under s.66(2), concentration must be proved by report under s.129B in respect of blood collected under s.129A conditions.",
      "supporting_facts": [
        "f10",
        "f13",
        "f16"
      ],
      "legal_basis": "Bombay Prohibition Act ss.66(2), 129A, 129B; Nazir Ahmed v. King Emperor"
    },
    {
      "id": "pa2",
      "text": "Blood sample not collected in manner prescribed by s.129A, so cannot be used for presumption under s.66(2); beyond smell of alcohol, no evidence.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Bombay Prohibition Act s.66(2), s.129A"
    },
    {
      "id": "pa3",
      "text": "Infirmities in chain of custody, no evidence of storage, tampering prevention, seal integrity, etc., so prosecution fails to prove sample integrity.",
      "supporting_facts": [
        "f22",
        "f23",
        "f24"
      ],
      "legal_basis": "General principles of evidence"
    },
    {
      "id": "pa4",
      "text": "Sessions Judge should have acquitted, not ordered retrial, as retrial only in exceptional cases, not to fill prosecution lacunae.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "CrPC principles on retrial; Ramanlal Rathi v. State"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Proof of alcohol concentration can be by any relevant evidence, not exclusively under s.129A; s.129A(8) allows proof otherwise; report admissible under s.129B(b) or s.510 CrPC.",
      "supporting_facts": [
        "f10",
        "f16"
      ],
      "legal_basis": "Bombay Prohibition Act s.129A(8), s.129B(b); CrPC s.510"
    },
    {
      "id": "ra2",
      "text": "Blood collected before investigation started, by doctor for medical reasons, not police compulsion; chain of custody sufficiently proved by seals intact.",
      "supporting_facts": [
        "f10",
        "f14",
        "f15"
      ],
      "legal_basis": "Evidence Act general admissibility"
    },
    {
      "id": "ra3",
      "text": "Retrial or additional evidence needed due to slipshod trial; interests of justice require filling gaps.",
      "supporting_facts": [
        "f17",
        "f22"
      ],
      "legal_basis": "CrPC s.428"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Prosecution must establish specimen examined by Chemical Examiner was from appellant's body and showed excess alcohol; defects in chain of custody (custody, tampering precautions, seal verification, messenger not examined) but formal evidence needed.",
      "addresses_issue": "i2",
      "key_observation": "Trial Magistrate assumed safety without evidence; both sides contributed to slipshod trial."
    },
    {
      "id": "cr2",
      "text": "s.66(2) presumption arises on proof of excess blood alcohol, no specific method prescribed; s.129A for compelling examination during investigation, but s.129A(8) expressly allows proof otherwise; report admissible under s.129B(b) or s.510 CrPC.",
      "addresses_issue": "i1",
      "key_observation": "s.129A not exclusive for proof; Nazir Ahmed distinguished as not analogous."
    },
    {
      "id": "cr3",
      "text": "Retrial not warranted merely for prosecution to rectify omissions; instead, additional evidence under s.428 CrPC in Sessions appeal.",
      "addresses_issue": "i2",
      "key_observation": "Retrial exceptional; here, additional evidence on chain, storage, deterioration needed."
    },
    {
      "id": "cr4",
      "text": "s.129B prevails over s.510 CrPC only to extent of repugnancy under Art.254(2); report of blood not under s.129A still admissible under s.510.",
      "addresses_issue": "i4",
      "key_observation": "Blood collected pre-investigation, duly submitted."
    },
    {
      "id": "cr5",
      "text": "Das Gupta J. (dissent): s.129A prescribes exclusive mode for blood alcohol proof for s.66(2) presumption; detailed procedure indicates only method; s.129A(8) saves proof of consumption, not percentage.",
      "addresses_issue": "i1",
      "key_observation": "Legislature intended safeguards against errors/unfair practices."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Blood alcohol concentration can be proved otherwise than under s.129A for s.66(2) presumption; report admissible under s.129B(b)/s.510 CrPC even if not under s.129A.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No retrial; instead, Sessions Judge to hear appeal, allow prosecution additional evidence under s.428 CrPC on chain of custody, integrity, etc.; accused opportunity to rebut.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    },
    {
      "id": "h3",
      "text": "Chemical Examiner's report not inadmissible under s.162 CrPC as submitted to police.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Bombay v. F. N. Balsara",
      "citation": "1951 S.C.R. 682",
      "treatment": "followed",
      "relevance": "Held cl.(b) s.13 invalid re medicinal/toilet preparations containing alcohol."
    },
    {
      "case_name": "Behram Khurshed Pesikaka v. State of Bombay",
      "citation": "1955 1 S.C.R. 613",
      "treatment": "followed",
      "relevance": "Smell of alcohol alone insufficient; prosecution must prove prohibited alcohol."
    },
    {
      "case_name": "Ramanlal Rathi v. State",
      "citation": "A.I.R. 1951 Cal. 305",
      "treatment": "followed",
      "relevance": "Retrial not to allow prosecution to fill lacunae; only if trial unsatisfactory for specific reasons."
    },
    {
      "case_name": "Nazir Ahmed v. King Emperor",
      "citation": "1936 L.R. 63 I.A. 372",
      "treatment": "distinguished",
      "relevance": "Exclusive procedure for confessions under CrPC ss.164/364; not analogous to s.129A."
    },
    {
      "case_name": "State of Bombay v. Narandas Mangilal Aggarwal",
      "citation": "1962 Supp. 1 S.C.R. 15",
      "treatment": "referred",
      "relevance": "Burden on prosecution to prove substance not within s.24A exemptions."
    },
    {
      "case_name": "Deep Chand v. State of Uttar Pradesh",
      "citation": "1959 Supp. 2 S.C.R. 8",
      "treatment": "followed",
      "relevance": "Art.254(2) state law prevails only to extent of repugnancy."
    },
    {
      "case_name": "Ch. Tikaramji v. State of Uttar Pradesh",
      "citation": "1956 S.C.R. 393",
      "treatment": "followed",
      "relevance": "Art.254(2) limited to repugnancy."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Prohibition Act, 1949",
      "sections": [
        "s.66(1)(b)",
        "s.66(2)",
        "s.66(3)",
        "s.13",
        "s.11",
        "s.24A",
        "s.129A",
        "s.129B",
        "s.2(22)",
        "s.2(24)"
      ],
      "relevance": "Prohibits consumption of intoxicant; presumption if blood alcohol >0.05%; procedure for blood collection/examination; exceptions for medicinal etc."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s.428(1)",
        "s.510",
        "s.162",
        "s.342",
        "s.207A"
      ],
      "relevance": "Additional evidence in appeal; admissibility of Chemical Examiner reports; statements to police."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "s.186"
      ],
      "relevance": "Resistance to blood collection offence."
    },
    {
      "name": "Motor Vehicles Act",
      "sections": [],
      "relevance": "Offences alleged but acquitted."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.254(2)",
        "Art.13(1)"
      ],
      "relevance": "State law prevails over central if assented by President; repugnancy."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Appeal against High Court order upholding Sessions retrial direction modified: Set aside Trial Magistrate conviction; Sessions Judge to hear appeal, permit prosecution additional evidence on blood sample chain/integrity under s.428 CrPC, examine accused u/s.342, allow rebuttal; may summon Chemical Examiner if needed. Appeal dismissed subject to modification.",
    "relief_granted": "Opportunity for additional evidence in Sessions Court instead of retrial; no acquittal.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"An order for re-trial wipes out from the record the earlier proceeding, and exposes the person accused to another trial which affords the prosecutor an opportunity to rectify the infirmities disclosed in the earlier trial, and will not ordinarily be countenanced when it is made merely to enable the prosecutor to lead evidence which he could but has not cared to lead.\"",
      "speaker": "court",
      "significance": "Principle against retrial to fill prosecution gaps."
    },
    {
      "text": "\"Nothing in this section shall preclude the fact that the person accused of an offence has consumed an intoxicant from being proved otherwise than in accordance with the provisions of this section.\" (s.129A(8))",
      "speaker": "court",
      "significance": "Allows alternative proof of consumption, but dissent interprets as excluding blood percentage proof."
    },
    {
      "text": "\"Where power is given to do a certain thing in a certain way the thing must be done in that way to the exclusion of all other methods of performance or not at all.\"",
      "speaker": "court",
      "significance": "Nazir Ahmed rule, applied by dissent to s.129A exclusivity."
    }
  ],
  "_case_id": "1963_29",
  "_label": 0,
  "_text_length": 80093,
  "_extracted_at": "2026-02-10T19:47:56.857944"
}