{
  "metadata": {
    "case_name": "Hazara Singh Gill v. State of Punjab",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": "Transfer Petition No. 9 of 1963",
    "date_of_judgment": "1963-05-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner is a resident of village Rattoke in the Amritsar District.",
      "type": "background",
      "date": null,
      "source": "state"
    },
    {
      "id": "f2",
      "text": "Petitioner was elected as member of the Punjab Vidhan Sabha in the last General Elections after defeating Hardip Singh, the brother-in-law of the Chief Minister of the State.",
      "type": "background",
      "date": null,
      "source": "state"
    },
    {
      "id": "f3",
      "text": "S. Surrinder Singh Kairon, son of the Chief Minister, and S. Ranjit Singh Grewal, posted as Senior Superintendent of Police at Amritsar, have married sisters.",
      "type": "background",
      "date": null,
      "source": "state"
    },
    {
      "id": "f4",
      "text": "S. Mukund Singh, the father-in-law of S. Surrinder Singh, owned vast lands. S. Mukund Singh died without leaving any male issue and the estate came under the Court of Wards, and the petitioner obtained some of the lands from the Court of Wards.",
      "type": "background",
      "date": null,
      "source": "state"
    },
    {
      "id": "f5",
      "text": "In May, 1960, the agitation for Punjabi Suba was started and the petitioner was arrested under ss. 411/414, Indian Penal Code, and a report was sent against him under s. 107/151, Cr. P. C., and a warrant was also issued. The petitioner was held for interrogation on a remand by the court.",
      "type": "procedural",
      "date": "1960-05",
      "source": "state"
    },
    {
      "id": "f6",
      "text": "The petitioner was also arrested in a case under the Arms Act, and another, under the Indian Opium Act.",
      "type": "procedural",
      "date": null,
      "source": "state"
    },
    {
      "id": "f7",
      "text": "Petitioner's father and six others were arrested on 26-1-1961 under s. 107/151, Cr. P. C., but were discharged as a result of compromise in court.",
      "type": "procedural",
      "date": "1961-01-26",
      "source": "state"
    },
    {
      "id": "f8",
      "text": "The petitioner was convicted and sentenced to two years rigorous imprisonment in the case under the Arms Act and that sentence has been upheld by the High Court.",
      "type": "procedural",
      "date": null,
      "source": "state"
    },
    {
      "id": "f9",
      "text": "He was also convicted in a case under the Prisons Act and sentenced to six months rigorous imprisonment, which sentence was also confirmed by the High Court. These sentences are to run consecutively.",
      "type": "procedural",
      "date": null,
      "source": "state"
    },
    {
      "id": "f10",
      "text": "The two cases in which the transfer is asked for are Nos. 33/3 and 33/4 of 1963 under S. 52 of the Prisons Act, pending for trial in the court of Mr. Sant Singh, Magistrate, First Class, Amritsar. They have been referred to the Magistrate by the Superintendent, Jail, Amritsar.",
      "type": "procedural",
      "date": null,
      "source": "state"
    },
    {
      "id": "f11",
      "text": "After his election to the Vidhan Sabha, he has not been able to attend any meeting because he has been arrested and continuously kept in jail.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "The petitioner is a protagonist of the Punjabi Suba, and supported the Akali candidates as against the Sadh Sangat Board which is supported by the Chief Minister.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "In the criminal cases in which the Petitioner was arrested, a bail of rupees one lakh was demanded from him as also from his father and six others. Since such a heavy bail could not be furnished, his father and the other persons languished in jail for four months till they were discharged on compromise in court, while he continued in jail.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "A suit has been filed against the petitioner by the widow of S. Mukund Singh for Rs. 12,500 for arrears of rent and for eviction, and in the written statement made by the petitioner in that suit, he has alleged that the Court of Wards is being specially continued to save the application of the ceilings on land to the property left by S. Mukund Singh. The petitioner has also claimed in that suit that if the arrears of rent have to be paid, they are payable only by S. Surrinder Singh and S. Ranjit Singh Grewal.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "While he was in jail, S. Surrinder Singh with police force took possession of the lands in September, 1960.",
      "type": "disputed",
      "date": "1960-09",
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "A criminal complaint was filed against S. Surrinder Singh for threatening the petitioner's wife with a gun, the complaint was dismissed by the court for default of appearance of the petitioner as he was in jail and could not attend it.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "The Superintendent, jail, has purposely referred these cases to the Magistrate instead of dealing with them himself, so that a severe punishment might be imposed upon the petitioner, and the intention is to keep him in jail, so that he may be kept away from his lands, his property and his other amenities.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "Another petition of S. Mohan Singh Tur was transferred from the Punjab to Saharanpur by this Court.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the two criminal cases pending in the Court of Magistrate Ist Class, Amritsar, should be transferred outside the State of Punjab under S. 527 CrPC due to apprehension of lack of fair trial.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether there is reasonable apprehension that the petitioner would not get justice in the State of Punjab given the lack of separation of Judiciary from Executive and influence of strong parties opposed to him.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Petitioner requests transfer of cases Nos. 33/3 and 33/4 of 1963 under S. 52 Prisons Act outside Punjab as he entertains reasonable apprehension of not getting justice due to political enmity with Chief Minister's family, heavy bails, land disputes, executive control over magistracy, and prior similar transfer.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f11",
        "f12",
        "f13",
        "f14",
        "f15",
        "f16",
        "f17",
        "f18"
      ],
      "legal_basis": "S. 527 Cr. P. C.; principle that justice should not only be done but seen to be done"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "State admitted some facts but evasively denied or omitted to deny others in affidavit; no specific denial of serious allegations like excessive bail, dismissal of complaint due to petitioner's incarceration, or misconduct by Chief Minister's son and SSP.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In absence of specific denial by State, Chief Minister, or SSP on affidavit, petitioner's serious allegations remain uncontroverted and must be accepted; Court acts on affidavits in such proceedings without examining witnesses.",
      "addresses_issue": "i2",
      "key_observation": "Allegations of very serious character not denied, e.g., excessive bail, dismissal of complaint, personal aspersions against officials."
    },
    {
      "id": "cr2",
      "text": "Allegation of no separation of Judiciary from Executive cannot be blanketly accepted, but question is whether petitioner entertains reasonable apprehension of no justice; one of highest principles is justice should not only be done but seen to be done.",
      "addresses_issue": "i2",
      "key_observation": "Enough allegations to show strong parties opposed to petitioner; sufficient circumstances for reasonable apprehension."
    },
    {
      "id": "cr3",
      "text": "In similar circumstances, this Court has previously transferred cases outside Punjab; interests of justice demand transfer here.",
      "addresses_issue": "i1",
      "key_observation": "Petitioner made out sufficient case for transfer."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Cases should be transferred outside the State of Punjab as petitioner entertains reasonable apprehension of not getting justice, and interests of justice demand it.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "S. Mohan Singh Tur petition",
      "citation": null,
      "treatment": "followed",
      "relevance": "Similar circumstances where cases transferred from Punjab to Saharanpur by this Court"
    }
  ],
  "statutes_cited": [
    {
      "name": "Criminal Procedure Code",
      "sections": [
        "S. 527",
        "S. 107",
        "S. 151"
      ],
      "relevance": "Petition under S. 527 for transfer; prior proceedings under S. 107/151"
    },
    {
      "name": "Prisons Act",
      "sections": [
        "S. 52"
      ],
      "relevance": "Pending cases under S. 52; prior conviction under Prisons Act"
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "Ss. 411",
        "414"
      ],
      "relevance": "Prior arrest under Ss. 411/414"
    },
    {
      "name": "Arms Act",
      "sections": [],
      "relevance": "Prior conviction and sentence upheld by High Court"
    },
    {
      "name": "Indian Opium Act",
      "sections": [],
      "relevance": "Prior arrest"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allows the transfer petition and directs transfer of cases Nos. 33/3 and 33/4 of 1963 under S. 52 Prisons Act pending in Amritsar Magistrate Court to a competent court outside Punjab for disposal, based on reasonable apprehension of bias.",
    "relief_granted": "Transfer of cases outside State of Punjab",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "One of the highest principles in the administration of law is that justice should not only be done but should be seen to be done.",
      "speaker": "court",
      "significance": "Core principle justifying transfer to ensure appearance of justice"
    },
    {
      "text": "In the absence of any specific denial on the part of the State, the Chief Minister and the Superintendent of Police concerned, we must reluctantly go by the affidavit filed by the petitioner.",
      "speaker": "court",
      "significance": "Basis for accepting petitioner's uncontroverted allegations"
    },
    {
      "text": "We are of opinion that the petitioner has, by his affidavit, made out sufficient circumstances from which it can be inferred that he does entertain, and entertain reasonably, an apprehension that he would not get justice in these cases.",
      "speaker": "court",
      "significance": "Finding that warrants transfer"
    }
  ],
  "_case_id": "1963_67",
  "_label": 1,
  "_text_length": 7967,
  "_extracted_at": "2026-02-10T19:48:20.987247"
}