{
  "metadata": {
    "case_name": "Appellants (Mortgagees) v. Pratap Singh & Sham Singh",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "AYYANGAR J."
    ],
    "case_number": "Civil Appeal No. 594 of 1960",
    "date_of_judgment": "1963-03-13"
  },
  "facts": [
    {
      "id": "f1",
      "text": "By a registered deed of mortgage dated March 6, 1933 Sham Singh (respondent No. 2) effected an usufructuary mortgage of land measuring 7530 Kanals and 19 Marlas situate in village Mohanpur in the District of Multan in Pakistan to the father of appellants 1 to 3 and to Topan Das--the father of the 4th appellant. The sum secured by the mortgage was Rs. 30,000/-. The stipulation in the mortgage was that the income derived from the properties transferred to the possession of the mortgagees was to be treated as interest on Rs. 10,000/- out of the principal sum and that the balance of Rs. 20,000/- was to carry a sum of Rs. 1,650/- per annum as interest. The deed further fixed a term of 10 years beyond which the mortgagee could sue for the recovery of the mortgage-money.",
      "type": "background",
      "date": "1933-03-06",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Subsequent to the deed of mortgage, about 4 years thereafter, the mortgagor-Sham Singh sold a major portion of the mortgaged property consisting of about 6,568 Kanals of land to Guranditta Ram and others. Out of the consideration for this sale a sum of Rs. 26,500/- was left with the transferee the same being directed to be paid in discharge of the mortgage.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Sale to Guranditta Ram was subject to a preemption claim and pre-emptor exercised his rights to obtain that relief. Narain Singh-father of Partap Singh, the 1st respondent-was the preemptor and in a suit filed by him he obtained on February 16, 1940 a decree for sale in his favour by virtue of his right of preemption and in pursuance of this decree he obtained symbolical possession of the land, the mortgagees still continuing to retain the actual possession of the land.",
      "type": "material",
      "date": "1940-02-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The sum of Rs. 26,500/- retained with the vendee under the sale by Sham Singh was not paid over to the mortgagee and thus the entire amount of the mortgage-money remained outstanding.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "While things were in this state, the country was partitioned in 1947 and both the mortgagor as well as the mortgagees moved into India and they were displaced persons.",
      "type": "background",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The owners of the property, viz., the original mortgagor- respondent No.2 Sham Singh and the pre-emptor-vendee were, as displaced persons, allotted agricultural land in India on the basis of their original holdings in Pakistan in pursuance of the relevant rules under the Displaced Persons Compensation and Rehabilitation Rules.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The appellants as the mortgagees entitled to possession of the lands were in June-July 1950, under these rules put in possession of the properties allotted to both Sham Singh-the original mortgagor as well as of Pratap Singh-the legal representative of the deceased pre-emptor respondent No. 1. The total extent of land which the respondent had been put in possession was 51 standard acres and 9 units of land made up of 37.4 standard acres as being the property belonging to the pre-emptor-vendee respondent No. 1 and 14.5 standard acres by virtue of the property allottable to Sham Singh the original mortgagor respondent No. 2.",
      "type": "procedural",
      "date": "1950-06",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Union Legislature enacted in November, 1951 the Displaced Persons (Debts Adjustment) Act, 1951 (Act LXX of 1951).",
      "type": "background",
      "date": "1951-11",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Sham Singh as well as Pratap Singh made separate applications under s. 5 of the Act seeking to obtain the benefit of the settlement and adjustment provision contained in its s. 16. The two applications were, in view of their having reference to the same mortgage debt, consolidated and were heard together by the Senior Sub-judge, Karnal who was the relevant Tribunal under the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Several objections were raised by the mortgagee-appellants to these applications but they were overruled and the mortgage debt was scaled down under s. 16 and other relevant statutory provisions.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "An appeal was preferred from this decision to the High Court of Punjab but the same was dismissed by the learned Single judge. A further appeal under the Letters Patent to a Bench of the High Court was dismissed in limine and a certificate of fitness being refused, the appellants applied to this Court for special leave and this being granted, the appeal is now before us.",
      "type": "procedural",
      "date": "1958-03-06",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The total mortgage-debt under the mortgage deed was computed at Rs. 51,700/- calculating interest as permitted by the relevant statutory provisions and taking into account s. 29. The total mortgaged land not belonging to the petitioner Pratap Singh and respondent No. 5 Sham Singh has been assessed as equivalent to 359 standard acres 14-3/4 units (329 standard acres 13-3/4 units of the petitioner plus 22 standard acres 6-1/2 units of the respondent No. 5) and in lieu thereof the mortgagors have been given in all 51 standard acres 9 units (37.4 to the petitioners and 14.5 to the respondent No. 5). As provided under s. 16(4) of the Act the amount of the debt payable to respondents 1 to 4 has been reduced in the same proportion in which the land has been allotted to the mortgagors. For the land belonging to them the mortgage debt amounting to Rs. 51,700/- when reduced to this proportion comes approximately to Rs. 7,420/-.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Pratap Singh—the representative of the purchaser of the equity of redemption—was a debtor within s. 2(6), because there was no contractual relationship between him and the displaced creditor i.e., the appellants, and whether amount under purely usufructuary mortgage without personal covenant to repay is a 'debt'.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the liability under a mortgage debt could be scaled down and adjusted under the Act only in a suit for redemption filed by the creditor and that it was incompetent for a debtor to invoke the jurisdiction of the Tribunal to effect the scaling down and adjustment by an application under s. 5.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the scaling down of the debt under proviso to s. 16(4) was correctly done on the basis of proportion of standard acres allotted in India to value of lands left in West Pakistan, or whether 'value' means market value and mere area proportion is insufficient.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Pratap Singh is not a debtor within s. 2(6), because there was no contractual relationship between him and the displaced creditor i.e., the appellants. A mortgagor under a purely usufructuary mortgage where there was no personal covenant to repay the loan, could not be said to be a debtor and the amount secured under such a mortgage could not therefore be a debt within the definition. The position of a purchaser of the equity of redemption Vis-a-Vis the mortgagee was similar. The absence of a personal liability to discharge the obligation out of his other property not under mortgage was the essence of a debtor and creditor relationship under the definition.",
      "supporting_facts": [
        "f1",
        "f3"
      ],
      "legal_basis": "Section 2(6); Lachhman Singh v. Natha Singh (Lahore HC); Manubhai Mahijibhai Patel v. Trikamlal Lakshmidas (Bom HC)"
    },
    {
      "id": "pa2",
      "text": "The liability under a mortgage debt could be scaled down and adjusted under the Act only in a suit for redemption filed by the creditor and that it was incompetent for a debtor to invoke the jurisdiction of the Tribunal to effect the scaling down and adjustment by an application under s. 5.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Section 5(1); Section 16"
    },
    {
      "id": "pa3",
      "text": "Under the proviso to s. 16(4) the reduction of the debt has to bear the same proportion as the value of the lands allotted to the creditor in India bears to the value of lands left by him in Pakistan. Value means market value. The Tribunal took into account merely the proportion between the two extents or areas i.e., the standard acres left in Pakistan compared to the standard acres allotted in India in lieu thereof.",
      "supporting_facts": [
        "f7",
        "f12"
      ],
      "legal_basis": "Section 16(4) proviso"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Debt includes pecuniary liability secured by mortgage including usufructuary mortgage. S.16(4) specifically includes such debts secured on agricultural lands with possession. Applies even without personal covenant. Purchaser of equity of redemption is debtor as mortgagee can sue for sale of property.",
      "addresses_issue": "i1",
      "key_observation": "The Act has not left the meaning of the expression debt where such debt is secured by a mortgage including an usufructuary mortgage in any manner of doubt, but on the other hand by making specific provision therefore, has put beyond the pale of argument that these are debts which could be scaled down under it."
    },
    {
      "id": "cr2",
      "text": "Section 5(1) enables a debtor to make an application to the tribunal for the adjustment of his debts. The amount due on or secured by the mortgage is a debt within the meaning of S. 5 to settle which an application could be filed and the debt being a secured debt answering to the description contained in the main part of s. 16(4), the applicants were entitled to have an adjustment in terms of that specified in the proviso to that section.",
      "addresses_issue": "i2",
      "key_observation": "There is no merit in the point about the locus standi of the respondent-debtors to file the application and it has to be rejected on the plain terms of s. 5 read with s. 16."
    },
    {
      "id": "cr3",
      "text": "In computing the standard acres left by a displaced person in Pakistan the rehabilitation authorities are, under the relevant rules and instructions, directed to take into account the income yield of the two sets of lands and thus the value of the land left behind is reflected in ascertaining the standard acres. The nature of the land left behind—whether it was canal-irrigated, well-irrigated or dry or merely rain-fed—was taken into account and numerical factors were prescribed based on these criteria for ascertaining the equivalent of those lands in India.",
      "addresses_issue": "i3",
      "key_observation": "When the provision in proviso to s. 16(4) spoke of value it must have had in contemplation the value as determined by the procedure for fixing the same under the relevant rules for the computation of equivalents of property of displaced persons left behind in Pakistan and the allotment of evacuee property to them in India."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Every usufructuary mortgage, whatever its nature, is within the definition of debt under the Act for the purpose of scaling down under s. 16 and that it is wholly immaterial whether or not the creditor is entitled to proceed personally against the debtor and recover the amount of the mortgage.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Debtors (including purchaser of equity of redemption) have locus standi to apply under s.5 for adjustment of secured mortgage debt under s.16(4).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Scaling down of debt proportionate to standard acres allotted in India (reflecting value per rehabilitation rules) vs. equivalent standard acres of land left in Pakistan is correct under proviso to s.16(4).",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Lachhman Singh v. Natha Singh",
      "citation": "I.L.R. 1941 Lah. 71",
      "treatment": "distinguished",
      "relevance": "Held amount secured by pure usufructuary mortgage without personal liability not a debt under Punjab Relief of Indebtedness Act, 1934; but inapplicable here due to s.16 terms and personal covenant present."
    },
    {
      "case_name": "Manubhai Mahijibhai Patel v. Trikamlal Lakshmidas",
      "citation": "I.L.R. 1958 Bom. 1429",
      "treatment": "distinguished",
      "relevance": "Under Bombay Agricultural Debtors Relief Act, purchaser of equity without personal liability not entitled to apply; turned on specific definitions, not general proposition."
    },
    {
      "case_name": "Lahori Lal v. Kasturi Lal",
      "citation": "1956 58 P. L. R. 331",
      "treatment": "followed",
      "relevance": "Debt as defined in s. 2(6) of the Act is not limited to personal liabilities only."
    },
    {
      "case_name": "Rajkumari Kaushalya Devi v. Bawa Pritam Singh",
      "citation": "1960 3 S.C.R. 570",
      "treatment": "followed",
      "relevance": "Mortgage-debt is within definition of 'debt' in s. 2(6); pecuniary liability to be understood with reference to other provisions like s.16."
    }
  ],
  "statutes_cited": [
    {
      "name": "Displaced Persons (Debts Adjustment) Act, 1951",
      "sections": [
        "Section 2(6)",
        "Section 2(9)",
        "Section 5",
        "Section 10",
        "Section 16",
        "Section 29",
        "Section 32"
      ],
      "relevance": "Defines debt, enables debtor application for adjustment of secured debts esp. usufructuary mortgages on agricultural land left in Pakistan; scales down debt proportionate to value of allotted lands in India; no interest post 15.8.1947."
    },
    {
      "name": "Punjab Relief of Indebtedness Act, 1934",
      "sections": [],
      "relevance": "Debt construed narrowly excluding pure usufructuary mortgages without personal liability; distinguished."
    },
    {
      "name": "Bombay Agricultural Debtors Relief Act",
      "sections": [
        "Section 4"
      ],
      "relevance": "Purchaser of equity without personal liability not entitled to apply; distinguished based on specific definitions."
    },
    {
      "name": "Displaced Persons (Compensation and Rehabilitation) Rules",
      "sections": [],
      "relevance": "Basis for allotting lands in India reflecting value/income yield of Pakistan lands via standard acres computation."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court rejected all contentions of the appellants, upheld the Tribunal's scaling down of the mortgage debt from Rs.51,700/- to approx. Rs.7,420/- under s.16(4) proviso based on proportion of standard acres allotted (51/359), confirmed appellants' right to continue in possession until satisfaction/redemption, and dismissed the appeal.",
    "relief_granted": "None to appellants; debt scaled down upheld in favour of respondents.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Act has not left the meaning of the expression debt where such debt is secured by a mortgage including an usufructuary mortgage in any manner of doubt, but on the other hand by making specific provision therefore, has put beyond the pale of argument that these are debts which could be scaled down under it.",
      "speaker": "court",
      "significance": "Core holding on inclusion of usufructuary mortgages as 'debts' under the Act."
    },
    {
      "text": "Every usufructuary mortgage, whatever its nature, is within the definition of debt under the Act for the purpose of scaling down under s. 16 and that it is wholly immaterial whether or not the creditor is entitled to proceed personally against the debtor.",
      "speaker": "court",
      "significance": "Clarifies broad scope of 'debt' for displaced persons' debt adjustment."
    },
    {
      "text": "Value, learned Counsel says, means market value. ... The fallacy in the argument of learned Counsel consists in ignoring the fact that in computing the standard acres left by a displaced person in Pakistan the rehabilitation authorities ... take into account the income yield of the two sets of lands.",
      "speaker": "court",
      "significance": "Explains why standard acres proportion correctly reflects 'value' under s.16(4)."
    }
  ],
  "_case_id": "1963_45",
  "_label": 0,
  "_text_length": 26353,
  "_extracted_at": "2026-02-10T19:47:46.485765"
}