{
  "metadata": {
    "case_name": "Oriental Bank of Commerce Ltd. v. Harcharan Das Loomba",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 300 of 1961",
    "date_of_judgment": "1963-03-05"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Oriental Bank of Commerce Ltd. was incorporated in February 1943 under the Indian Companies Act, 1913. The Bank had its registered office at Delhi and it opened branches in Lahore and in other towns which are now in Pakistan.",
      "type": "background",
      "date": "1943-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The capital of the Bank was divided into 5,97,584 ordinary shares of Rs. 10/- each, and 24,200 B class ordinary shares of Re. 1/- each. The paid-up capital of the Bank as on December 31, 1946 was approximately Rs. 23 lakhs.",
      "type": "background",
      "date": "1946-12-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On account of disturbances which followed in the wake of the setting up of the Dominions of India and Pakistan, the Bank lost a substantial part of its assets in the territory now called West Pakistan and was unable to recall its advances. By 1950 the accumulated losses of the Bank amounted to Rs. 10,57,850/-.",
      "type": "material",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In December 1950, the Directors of the Bank made a call of Rs. 2/8- per share on its ordinary shareholders.",
      "type": "material",
      "date": "1950-12",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Parliament enacted the Displaced Persons Debts Adjustment Act, 70 of 1951. That Act defines displaced person by s. 2(10) as meaning any person who on account of the setting up of the Dominions of India and Pakistan, or on account of civil disturbances or the fear of such disturbances in any area now forming part of West Pakistan, has, after the first day of March, 1947, left, or been displaced from, his place of residence in such area and who has been subsequently residing in India, and includes any person who is resident in any place now forming part of India and who for that reason is unable or has been rendered unable to manage, supervise or control any immovable property belonging to him in West Pakistan.",
      "type": "background",
      "date": "1951",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "An extraordinary General Meeting of the Bank was convened on November 29, 1951 and special resolutions were passed reducing the issued and subscribed capital of the Bank to Rs. 4,56,137 ordinary shares of Rs. 5/- each and 24,200 B-class ordinary shares of annas 8 each. This reduction was to be effected by cancelling the paid-up capital to the extent of Rs. 5/- on each ordinary share and annas 8 on each B class ordinary share.",
      "type": "procedural",
      "date": "1951-11-29",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Pursuant to the resolution passed by the Bank at an extraordinary General Meeting on November 29, 1951 an application was submitted before the District judge, Delhi exercising powers of the Company judge for an order under ss. 55,56 and 57 of the Indian Companies Act, 1913 for reduction of the share capital of the Bank.",
      "type": "procedural",
      "date": "1951-11-29",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "This application was opposed by two shareholders who contended that the Bank was merely trying to circumvent the provisions of the Displaced Persons Debts Adjustment Act, 70 of 1951 by resolving to reduce the capital.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "At the hearing of the application counsel for the Bank proposed that the Bank would accept, without any payment, surrender of ordinary shares of Rs. 10/each on which Rs 5/- had been paid up, by any person entitled to relief under s 19 of the Displaced Persons Debts Adjustment Act, so as to relieve him from further liability to pay the call of Rs. 2/8/- per share made by the Bank and all future calls. This condition was accepted by the shareholders who appeared at the hearing.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The Company judge allowed the petition and confirmed the resolution reducing the share-capital on the terms and conditions relating to surrender accepted by the Bank and directed that notice be given under S. 61 of the Indian Companies Act, offering to all persons intending to avail themselves of the option of surrender an opportunity to apply in that behalf to the Bank within two weeks of the publication of the notice.",
      "type": "procedural",
      "date": "1957-11-13",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The respondent Harcharan Das Loomba was a holder, since 1944, of 500 ordinary shares of the face value of Rs. 10/- each on which Rs. 5/- were paid.",
      "type": "admitted",
      "date": "1944",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The respondent was a displaced person within the meaning of Act 70 of 1951 but he did not appear at the hearing of the petition for reduction of capital, nor did he avail himself of the option to surrender the shares given under the order of the Company judge.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On January 7, 1954 he applied to the Bank under s. 19(2) of Act 70 of 1951 to convert his holding of 500 ordinary shares into 250 fully paid up shares.",
      "type": "procedural",
      "date": "1954-01-07",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "By its letter dated January 16, 1954 the Bank declined to carry out the conversion.",
      "type": "procedural",
      "date": "1954-01-16",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "The respondent then petitioned the Tribunal under s. 19(4) of the Displaced Persons Debts Adjustment Act for an order directing the Bank to convert 500 partly paid-up shares held by him into 250 fully paid-up shares.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "The petition was resisted by the Bank, inter alia, on the grounds that the order of the Company judge sanctioning reduction of capital and granting facility for surrender their holding to shareholders entitled to apply under s. 19(2) of the Act was conclusive and binding upon all shareholders and the respondent having failed to avail himself of the option given by the order was not entitled to enforce his rights under s. 19(2).",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "The Bank also submitted that the right conferred by s. 19(4) of Act 70 of 1951 was not absolute and that there were good grounds for not complying with the requisition under s. 19(2), in that at the date of the special resolution for reduction of capital there being practically no assets with the Bank on which a fresh credit structure could be built, funds had to be raised by making calls and by issuing fresh capital and the claim for conversion of partly paid-up shares into fully paid-up shares was neither fair nor equitable to the shareholders who had already paid the call or had subscribed to the new shares.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "In the view of the Tribunal losses suffered by the Bank and doubtful debts had been accumulating for a long time, but the Bank resorted to the scheme of capital reduction after Act 70 of 1951 was enacted, only with a view to deprive the displaced shareholders of the benefit under the provisions of s. 19 of the Act. This view of the Tribunal was affirmed in appeal by Khosla J. of the Punjab High Court, and also by a Division Bench in an appeal under cl. 10 of the Letters Patent.",
      "type": "material",
      "date": "1957-11-13",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Appeal by special leave from the judgment and order dated November 13, 1957, of the Punjab High Court at Chandigarh, in Letters Patent Appeal No. 19-D of 1955.",
      "type": "procedural",
      "date": "1957-11-13",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order of the Company judge in the petition filed by the Bank under ss. 55, 56 and 57 of the Indian Companies Act for sanctioning reduction of capital is conclusive and binding upon the respondent so as to deprive him of his right to claim that his partly paid-up shares be converted into fully paid-up shares under s.19 of the Displaced Persons Debts Adjustment Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the case shown by the Bank for refusing to convert the holding of the respondent into fully paid-up shares was good or sufficient.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order of the Company judge sanctioning reduction of capital and granting facility for surrender of holding to shareholders entitled to apply under s. 19(2) of the Act was conclusive and binding upon all shareholders and the respondent having failed to avail himself of the option given by the order was not entitled to enforce his rights under s. 19(2).",
      "supporting_facts": [
        "f10",
        "f12",
        "f16"
      ],
      "legal_basis": "ss. 55, 56, 57, 60 of Indian Companies Act, 1913"
    },
    {
      "id": "pa2",
      "text": "The right conferred by s. 19(4) of Act 70 of 1951 was not absolute and there were good grounds for not complying with the requisition under s. 19(2), in that at the date of the special resolution for reduction of capital there being practically no assets with the Bank, funds had to be raised by making calls and by issuing fresh capital and the claim for conversion was neither fair nor equitable to other shareholders.",
      "supporting_facts": [
        "f3",
        "f4",
        "f6",
        "f17"
      ],
      "legal_basis": "s. 19(4) Displaced Persons Debts Adjustment Act, 70 of 1951"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Bank was merely trying to circumvent the provisions of the Displaced Persons Debts Adjustment Act, 70 of 1951 by resolving to reduce the capital.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Displaced Persons Debts Adjustment Act, 70 of 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The order of the Court under s. 60 of the Companies Act, 1913, sanctioning reduction would normally be binding upon all shareholders. But s. 3 of Act 70 of 1951 invests the provisions of the Act with overriding effect notwithstanding anything contained in any other law or in any decree or order of a court. The order could not deprive a displaced person of the special statutory right granted under s. 19. The jurisdiction to decide whether there is good ground for refusing conversion is vested exclusively in the Tribunal.",
      "addresses_issue": "i1",
      "key_observation": "A displaced person was not obliged to avail himself of the option given by the Company judge, and if he did not, his right under s.19 was not affected."
    },
    {
      "id": "cr2",
      "text": "The Tribunal held that the resolution for reduction of capital was passed mala fide and with a view to deprive the displaced persons of their right to claim conversion. The finding that the cause set up by the Bank was not genuine and the resolution was a device to nullify the statutory protection is supported by evidence and binding.",
      "addresses_issue": "i2",
      "key_observation": "No good cause has been shown by the Bank for declining to convert the partly paid shares."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The order of the Company judge remains valid and binding but subject to such orders as the Tribunal may make in respect of any individual shareholder who makes an application under sub-s. (4) of s.19.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The expression 'no cause for such refusal' within the meaning of cl. (4) must mean 'no good cause for refusal'. The Tribunal is authorised to adjudicate whether the cause set up by the company is a cause reasonably justifying refusal.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "The order directing the Bank to convert the shares of the respondent into fully paid-up shares must be confirmed, because no good cause has been shown by the Bank for declining to convert the partly paid shares.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Companies Act, 1913",
      "sections": [
        "ss. 55",
        "ss. 56",
        "ss. 57",
        "s. 60",
        "s. 61"
      ],
      "relevance": "Governs reduction of share capital; order sanctioning reduction normally binding but overridden by Displaced Persons Act"
    },
    {
      "name": "Displaced Persons (Debts Adjustment) Act, 70 of 1951",
      "sections": [
        "s. 2(10)",
        "s. 3",
        "s. 19(1)",
        "s. 19(2)",
        "s. 19(3)",
        "s. 19(4)",
        "s. 19(5)",
        "s. 19(6)"
      ],
      "relevance": "Provides relief to displaced persons including conversion of partly paid-up shares into fully paid-up shares; overriding effect; Tribunal to direct compliance if no good cause for refusal"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the Bank's appeal, confirmed the Tribunal's order directing the Bank to convert the respondent's 500 partly paid-up shares into 250 fully paid-up shares, holding that the Company Judge's order did not deprive the respondent of his statutory right under s.19 of the Displaced Persons Act and that the Bank showed no good cause for refusal.",
    "relief_granted": "Direction to Bank to convert 500 partly paid-up ordinary shares into 250 fully paid-up shares",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The expression 'no cause for such refusal' within the meaning of cl. (4) must mean 'no good cause for refusal'.",
      "speaker": "court",
      "significance": "Defines the standard for Tribunal's power to direct conversion under s.19(4)"
    },
    {
      "text": "s. 3 of Act 70 of 1951 invests... the provisions of the Act... with overriding effect notwithstanding anything contained in any other law... or in any decree or order of a court.",
      "speaker": "court",
      "significance": "Establishes supremacy of Displaced Persons Act over Companies Act and court orders"
    },
    {
      "text": "The finding of the Tribunal which was confirmed by the High Court establishes that the cause set up by the Bank was not genuine the resolution for reduction of capital was a device to which resort was had for nullifying the statutory protection granted to displaced persons.",
      "speaker": "court",
      "significance": "Rejects Bank's grounds for refusal as mala fide"
    }
  ],
  "_case_id": "1963_46",
  "_label": 0,
  "_text_length": 16081,
  "_extracted_at": "2026-02-10T19:47:38.683767"
}