{
  "metadata": {
    "case_name": "State of Assam & Anr. v. Bimal Kumar Pandit",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 832 of 1962",
    "date_of_judgment": "1963-02-12"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent Bimal Kumar Pandit was serving appellant No. 1, the State of Assam, as an Extra-Assistant Commissioner, Shillong.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On December 11, 1959, the second appellant, the Chief Secretary to the Government of Assam, served on the respondent a charge-sheet containing eleven specific charges and called upon him to show cause why he should not be dismissed from service or otherwise punished under Rule 55 of the Civil Services (Classification, Control & Appeal) Rules read with Art. 311 of the Constitution.",
      "type": "procedural",
      "date": "1959-12-11",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The notice informed the respondent that the Governor of Assam had authorised the Commissioner of Plains Division, Assam, to conduct the enquiry and to report to appellant No. 2.",
      "type": "procedural",
      "date": "1959-12-11",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On January 13, 1960 the respondent submitted an elaborate explanation in respect of all the charges.",
      "type": "procedural",
      "date": "1960-01-13",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Commissioner of Plains Division held an enquiry and made a report on April 12, 1960, finding that out of 11 charges, 6 had not been proved, charges 7 and 10 fully established, charges 1, 2 and 4 partially established.",
      "type": "procedural",
      "date": "1960-04-12",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Enquiry Officer stated that the lapses proved did not cast serious doubt on honesty and integrity, but showed inexperience (charges 1,2) and irresponsibility (charges 2,4); recommended withholding of three increments for charges 7 and 10.",
      "type": "material",
      "date": "1960-04-12",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On June 1, 1960, appellant No. 2 served a second notice under Art. 311(2) requiring the respondent to show cause why penalty of removal from service should not be imposed, enclosing copy of Enquiry Officer's report; explanation to be submitted by June 18, 1960.",
      "type": "procedural",
      "date": "1960-06-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent submitted explanation on June 21, 1960 in respect of charges held proved.",
      "type": "procedural",
      "date": "1960-06-21",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On July 8, 1961, Governor of Assam ordered reduction of respondent (on probation in Class I) to Assam Civil Service Class II permanently, with probation for two years, pay at minimum scale, seniority from joining date.",
      "type": "procedural",
      "date": "1961-07-08",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Respondent filed writ petition in Assam High Court on August 24, 1961 challenging validity of order, inter alia on ground of no reasonable opportunity under Art. 311(2).",
      "type": "procedural",
      "date": "1961-08-24",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Assam High Court in Civil Rule No. 369 of 1961 by judgment dated January 22, 1962 upheld contention under Art. 311(2), allowed writ, issued mandamus directing appellants not to give effect to order dated July 8, 1961.",
      "type": "procedural",
      "date": "1962-01-22",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellants appealed to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the second notice under Article 311(2) must expressly state that the dismissing authority has accepted the findings of the Enquiring Officer and provide reasons therefor, to afford reasonable opportunity of showing cause against the proposed action.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court misinterpreted scope of Art. 311(2); no need for express statement of acceptance of findings if copy of report supplied, as issuance of notice implies acceptance; desirable but not mandatory.",
      "supporting_facts": [
        "f7",
        "f11"
      ],
      "legal_basis": "Article 311(2) of the Constitution"
    },
    {
      "id": "pa2",
      "text": "Affidavit shows Government accepted findings before notice; punishment justified even on proved charges; enquiry officer's punishment recommendation not binding.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7",
        "f9"
      ],
      "legal_basis": "A. N. D'Silva v. Union of India"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Second notice did not clearly indicate acceptance of findings or provide reasons/grounds, so no reasonable opportunity under Art. 311(2); severity of proposed punishment (removal) suggests disagreement with some favourable findings.",
      "supporting_facts": [
        "f7",
        "f6"
      ],
      "legal_basis": "Article 311(2) of the Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Public officer entitled to two opportunities: enquiry and second show cause under Art. 311(2). Issuance of second notice proposing punishment implies provisional acceptance of adverse findings, especially with report copy supplied; no infirmity if not expressly stated when accepting report in entirety.",
      "addresses_issue": "i1",
      "key_observation": "Desirable to state concurrence, but failure does not contravene Art. 311(2) where report enclosed and acceptance implied."
    },
    {
      "id": "cr2",
      "text": "If dismissing authority differs from enquiry report (e.g., rejects favourable findings), must specify provisional conclusions in notice. Here, acceptance in entirety implied; proposed punishment justified on proved charges alone.",
      "addresses_issue": "i1",
      "key_observation": "Enquiry officer not required to recommend punishment."
    },
    {
      "id": "cr3",
      "text": "Distinguished cases where authority differed from report; upheld notices implying acceptance as in State of Orissa v. Govindadas; grounds in prior cases mean enquiry findings, not authority's reasons for acceptance.",
      "addresses_issue": "i1",
      "key_observation": "Art. 311(2) requires communication of enquiry findings/results, not authority's reasons for agreeing."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Second notice under Art. 311(2) need not expressly state acceptance of enquiry findings or give reasons therefor if report copy supplied and acceptance implied by proposing punishment; sufficient reasonable opportunity provided.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Where authority differs from report, must communicate its provisional conclusions on disagreed findings.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "A. N. D'Silva v. Union of India",
      "citation": "1962 Supp. 1 S.C.R. 968",
      "treatment": "followed",
      "relevance": "Enquiry officer not required to specify punishment."
    },
    {
      "case_name": "High Commissioner of India v. I. M. Lal",
      "citation": "1945 F.C.R. 103",
      "treatment": "followed",
      "relevance": "Art. 311(2) equivalent requires communicating enquiry findings/grounds (not authority's reasons)."
    },
    {
      "case_name": "Khem Chand v. Union of India",
      "citation": "1958 S.C.R. 1080",
      "treatment": "distinguished",
      "relevance": "Authority must apply mind and provisionally decide, but no obligation to state acceptance expressly in every case."
    },
    {
      "case_name": "State of Orissa v. Govindadas Panda",
      "citation": null,
      "treatment": "followed",
      "relevance": "Notice without express acceptance upheld if implied and punishment clear."
    },
    {
      "case_name": "State of Andhra v. T. Ramayya Suri",
      "citation": "A.I.R. 1957 Andh. 370",
      "treatment": "distinguished",
      "relevance": "Where authority differs on charge, must communicate conclusion; not general rule for reasons."
    },
    {
      "case_name": "Bimal Charan Mitra v. State of Orissa",
      "citation": "A.I.R. 1957 Orissa 184",
      "treatment": "overruled",
      "relevance": "No mandatory requirement to supply punishing authority's findings separately."
    },
    {
      "case_name": "Krishan Gopal Mukherjee v. The State",
      "citation": "A.I.R. 1960 Orissa 37",
      "treatment": "overruled",
      "relevance": "Same as above."
    },
    {
      "case_name": "State of Bombay v. Gajanan Mahadev Badley",
      "citation": "A.I.R. 1954 Bom. 351",
      "treatment": "distinguished",
      "relevance": "Must communicate enquiry findings as grounds, not authority's separate reasons."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 311(1)",
        "Article 311(2)"
      ],
      "relevance": "Governs dismissal/removal/reduction in rank of civil servants; requires reasonable opportunity of showing cause against proposed action."
    },
    {
      "name": "Civil Services (Classification, Control & Appeal) Rules",
      "sections": [
        "Rule 55"
      ],
      "relevance": "Applicable for disciplinary proceedings and punishment."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court judgment and mandamus set aside; respondent's writ petition dismissed. Order of demotion upheld as compliant with Art. 311(2).",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"it would be plain to the delinquent officer that the issuance of the notice indicating the provisional conclusions of the dismissing authority as to the punishment that should be imposed on him, obviously and clearly implies that the findings recorded against him by the enquiring officer have been accepted by the dismissing authority\"",
      "speaker": "court",
      "significance": "Core holding on implied acceptance in second notice."
    },
    {
      "text": "\"We ought, however, to add that if the dismissing authority differs from the findings recorded in the enquiry report, it is necessary that its provisional conclusions in that behalf should be specified in the second notice.\"",
      "speaker": "court",
      "significance": "Exception when authority disagrees with report."
    },
    {
      "text": "\"the grounds to which the judgment refers are the findings or conclusions reached by the enquiring officer.\"",
      "speaker": "court",
      "significance": "Clarifies 'grounds' in precedents mean enquiry findings, not authority's reasons."
    }
  ],
  "_case_id": "1963_28",
  "_label": 1,
  "_text_length": 29552,
  "_extracted_at": "2026-02-10T19:47:36.863408"
}