{
  "metadata": {
    "case_name": "Appellant v. Chamanlal Mehra",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA J."
    ],
    "case_number": "Criminal Appeal No. 44 of 1961",
    "date_of_judgment": "1963-05-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was examined as a witness for the prosecution in the court of the Additional Chief Presidency Magistrate, Calcutta, in a case instituted by Mayadas Khanna against respondent Chamanlal Mehra and two others under ss. 504 and 506 IPC.",
      "type": "background",
      "date": "1957-05-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The case ended in acquittal of the accused persons.",
      "type": "procedural",
      "date": "1957-05-10",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "On June 28, 1957, application made in Magistrate's court under s. 476 CrPC alleging appellant and other witnesses including Mayadas Khanna gave false evidence, fabricated false evidence, forged documents, abetted offences.",
      "type": "procedural",
      "date": "1957-06-28",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Learned Magistrate Mr. Jahangir Kabir no longer available; application transferred by Chief Presidency Magistrate to Mr. J. M. Bir, nominated as successor.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Mr. J. M. Bir opined s. 479A CrPC complete bar against action against appellant and other witnesses (not complainant); directed complaint only against Mayadas Khanna, rejected against rest.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appeal by Chamanlal Mehra against Magistrate's refusal; Calcutta High Court in Criminal Appeal No. 56 of 1958, judgment dated September 16, 1960, held s. 479A no application to forgery or criminal conspiracy to commit forgery; directed complaint against appellant for offences under s. 467 and s. 467/120B IPC.",
      "type": "procedural",
      "date": "1960-09-16",
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether s. 479A CrPC has no application to offences under s. 467 and s. 467/120B IPC and does not bar action under s. 476 CrPC against a witness for such offences.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Scope of s. 479A CrPC: whether it bars action under s. 476 CrPC for offences other than giving false evidence or fabricating false evidence (s. 193 IPC and cognate sections in Chapter XI).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Challenges correctness of High Court's view that s. 479A has no application to offences under s. 467 and s. 467/120B IPC and does not bar action under s. 476 CrPC.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s. 479A CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "s. 479A has no application to offence of committing forgery or being party to criminal conspiracy to commit forgery; expedient in interests of justice to make complaint against appellant under s. 467 and s. 467/120B IPC.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6"
      ],
      "legal_basis": "ss. 467, 467/120B IPC; s. 476 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s. 479A prescribes special procedure only for prosecution of witness for intentionally giving false evidence or fabricating false evidence (punishable under s. 193 IPC and cognate sections in Chapter XI); nothing precludes other procedures for other offences.",
      "addresses_issue": "i1",
      "key_observation": "Special provision prevails over general only to extent its scope covers; s. 479A limited to perjury offences."
    },
    {
      "id": "cr2",
      "text": "Unreasonable to read s. 479A to cover other offences like forgery even if for purpose of fabricating false evidence; ss. 476-479 continue to apply for other offences post s. 479A enactment.",
      "addresses_issue": "i2",
      "key_observation": "Legislature would have used clear words if intended broader application."
    },
    {
      "id": "cr3",
      "text": "No opinion on whether appellant prima facie committed offences under s. 467/120B IPC as not argued.",
      "addresses_issue": "i1",
      "key_observation": "Question of prima facie case not before court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s. 479A CrPC has no application to prosecution for offences other than under s. 193 IPC and cognate sections in Chapter XI; ss. 476-479 continue to apply for other offences.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court's view correct that s. 479A does not bar action under s. 476 CrPC for offences under s. 467 and s. 467/120B IPC.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "476",
        "479A",
        "477",
        "478",
        "479"
      ],
      "relevance": "s. 479A special procedure for perjury offences does not bar s. 476 for other offences like forgery."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "504",
        "506",
        "467",
        "120B",
        "193"
      ],
      "relevance": "Offences alleged: false evidence (193), forgery (467), conspiracy (120B); s. 479A limited to 193 and Chapter XI."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave against Calcutta High Court order directing complaint under s. 476 CrPC against appellant for offences under ss. 467/120B IPC dismissed; Supreme Court upheld High Court's view that s. 479A CrPC does not apply to such offences.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The special procedure of s. 479A is prescribed only for the prosecution of a witness for the act of giving false evidence... or for fabrication of false evidence... There is nothing in the section which precludes the application of any other procedure...",
      "speaker": "court",
      "significance": "Defines precise scope of s. 479A CrPC."
    },
    {
      "text": "s. 479A has no application to prosecution for offences other than an offence under s. 193 and cognate sections in Chapter XI and that as regards other offences ss. 476... continue to apply even after the enactment of s. 479A.",
      "speaker": "court",
      "significance": "Core holding on applicability of provisions."
    }
  ],
  "_case_id": "1963_283",
  "_label": 0,
  "_text_length": 8260,
  "_extracted_at": "2026-02-10T19:51:00.249007"
}