{
  "metadata": {
    "case_name": "Life Insurance Corporation (Unit: Bharat Insurance Co. Ltd.) v. Commissioner of Income-tax",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "A.K. Sarkar",
      "J.C. Shah",
      "M. Hidayatullah"
    ],
    "case_number": "Civil Appeals No. 678-680 of 1962",
    "date_of_judgment": "1963-12-09"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appeals relate to the assessment to income-tax of the income of the life insurance business of the Bharat Insurance Co. Ltd. (merged in the Life Insurance Corporation Ltd.) for assessment years 1952-53, 1953-54 and 1954-55.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The assessee debited a sum of Rs. 18,75,000 to its Consolidated Revenue Account and credited it to the Investment Reserve Fund because the securities in respect of which the Investment Reserve Fund had been constituted had depreciated, making the fund inadequate.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The Income-tax Officer found that the balance in the Investment Reserve Fund exceeded the deficit on book values by Rs. 30,420 and that securities were undervalued in books by Rs. 1,89,185 (market value check), directing reduction of the transfer by Rs. 1,75,000.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Appellate Assistant Commissioner reduced the adjustment to Rs. 1,45,000.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Income-tax Appellate Tribunal held that adjustment could only be made under proviso to r.3(b) requiring prior consultation with Controller of Insurance, which was not done, so accepted the full transfer of Rs. 18,75,000.",
      "type": "procedural",
      "date": "1956-10-23",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Commissioner applied to Tribunal under s.66(1) for reference, rejected; then to High Court under s.66(2), which ordered reference. Question referred: Whether upon the facts found by the Tribunal, the Income-tax Officer had jurisdiction to proceed to make adjustment in terms of r. 3(b) of the Schedule.",
      "type": "procedural",
      "date": "1960-03-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Punjab High Court answered the question in the affirmative, holding ITO not deprived of authority to correct errors like undervaluation, and proviso not applicable.",
      "type": "procedural",
      "date": "1960-03-02",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Life Insurance Corporation substituted as appellant under s.9 of Life Insurance Corporation Act, 1956, after takeover.",
      "type": "procedural",
      "date": "1960-07-06",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Actuarial valuation for inter-valuation period ending Dec 31, 1951; method under r.2(b) produced larger income.",
      "type": "background",
      "date": "1951-12-31",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "No consultation with Controller of Insurance by ITO.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Income-tax Officer had jurisdiction to make adjustments to the assessee's accounts by reducing the transfer to Investment Reserve Fund on grounds of undervaluation of securities, without consultation with Controller of Insurance under proviso to Rule 3(b) of the Schedule to s.10(7) of Income-tax Act, 1922.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under r.2(b), ITO must accept surplus from actuarial valuation made under Insurance Act, with limited adjustments under r.3; no power to revalue securities or adjust accounts outside rules; adjustment only under proviso to r.3(b) after consultation with Controller of Insurance.",
      "supporting_facts": [
        "f1",
        "f2",
        "f5",
        "f9",
        "f10"
      ],
      "legal_basis": "Income-tax Act, 1922 s.10(7), Schedule r.2(b), r.3(b) proviso; Insurance Act, 1938"
    },
    {
      "id": "pa2",
      "text": "Reducing transfer to reserve disturbs liability calculations based on assumed interest rate, affecting policyholders.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": "Insurance Act, 1938 Regulations"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "ITO has general power under main part of r.3(b) to correct undervaluation of securities using market quotations, without needing proviso or consultation; proviso applies only to interest rate inconsistencies.",
      "supporting_facts": [
        "f3",
        "f7"
      ],
      "legal_basis": "Income-tax Act, 1922 Schedule r.3(b) main part"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Assessment governed strictly by Schedule to s.10(7); under r.2(b), ITO takes actuarial surplus with specific exclusions; r.3(b) mandates allowing assessee's book entries for depreciation/appreciation; no general power to revalue or adjust outside rules.",
      "addresses_issue": "i1",
      "key_observation": "Present adjustment neither under main r.3(b) (which follows assessee's accounts) nor proviso (which requires consultation and specific conditions on interest rate inconsistency)."
    },
    {
      "id": "cr2",
      "text": "No other provision authorizes adjustments; insurance accounts controlled by Controller under Insurance Act; tampering by ITO unwarranted.",
      "addresses_issue": "i1",
      "key_observation": "High Court erred in assuming general power to prevent evasion; traveled beyond referred question."
    },
    {
      "id": "cr3",
      "text": "Hidayatullah J.: Main r.3(b) mandatory, follows book entries; proviso exclusively governs discrepancies via consultation, considering policyholder bonuses/contingencies; no independent general power.",
      "addresses_issue": "i1",
      "key_observation": "Proviso negatives separate power; former Rule 30 cases inapplicable post-proviso addition."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Income-tax Officer has no jurisdiction to make the adjustments under r.3(b); question answered in negative.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Western India Life Insurance Co. Ltd., In re",
      "citation": "1938 6 I.T.R. 44",
      "treatment": "distinguished",
      "relevance": "Permitted adjustments under former Rule 30; inapplicable as new r.3(b) with proviso alters regime."
    },
    {
      "case_name": "Commissioner of Income-Tax, Bombay, Sind and Rajasthan v. Indian Life Assurance Co. Ltd.",
      "citation": "1946 14 I.T.R. 347",
      "treatment": "distinguished",
      "relevance": "Applied Bombay HC dictum under superseded rules."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "s.10(7)",
        "s.66(1)",
        "s.66(2)",
        "Schedule r.2",
        "Schedule r.3",
        "Schedule r.3(b) proviso"
      ],
      "relevance": "Special rules for insurance business profits; limits ITO adjustments to actuarial surplus."
    },
    {
      "name": "Insurance Act, 1938",
      "sections": [
        "s.11",
        "s.13",
        "s.27",
        "s.27A"
      ],
      "relevance": "Governs actuarial valuations, accounts, balance sheets, investment reserves; Controller oversees."
    },
    {
      "name": "Life Insurance Corporation Act, 1956",
      "sections": [
        "s.9",
        "s.45",
        "s.2(3)"
      ],
      "relevance": "Substitution of LIC as appellant after takeover."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeals, answered the referred question in the negative holding that the Income-tax Officer lacked jurisdiction to make the adjustments without following the proviso to r.3(b), as no general power exists outside the specific rules.",
    "relief_granted": "Appeals allowed; Tribunal's order upheld implicitly by reversing High Court.",
    "costs": "With costs"
  },
  "key_quotes": [
    {
      "text": "\"We think that these appeals should be allowed... the Income-tax Officer could not make the adjustment that he did in these cases.\"",
      "speaker": "court",
      "significance": "Core holding reversing High Court."
    },
    {
      "text": "\"The assessment of the profits of an insurance business is completely governed by the rules in the Schedule and there is no power to do anything not contained in it.\"",
      "speaker": "court",
      "significance": "Emphasizes strict limits on ITO powers."
    },
    {
      "text": "\"Action has to be taken in the manner laid down in the proviso or not at all.\"",
      "speaker": "court",
      "significance": "Hidayatullah J. clarifies proviso's exclusive role."
    }
  ],
  "_case_id": "1963_187",
  "_label": 1,
  "_text_length": 47331,
  "_extracted_at": "2026-02-10T19:49:33.574519"
}