{
  "metadata": {
    "case_name": "Societe De Traction Et De Electricite Societe Anonyme v. Kamani Engineering Corporation Ltd",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J"
    ],
    "case_number": "Civil Appeal No. 196 of 1963",
    "date_of_judgment": "1963-04-18"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Societe De Traction Et De Electricite Societe Anonyme (Traction) is a Corporation incorporated under the laws of Belgium and carries on business as consulting and construction engineers at Brussels.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Kamani Engineering Corporation Ltd (Kamani) is a company registered under the Indian Companies Act, 1913 and carries on business as an engineering concern.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On April 22, 1959, Kamani entered into a Collaboration agreement with Traction whereby Traction undertook to provide technical assistance for the construction of overhead railway electrification, tramway systems and trolley buses in India, Burma, Ceylon and/or Nepal.",
      "type": "material",
      "date": "1959-04-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Collaboration agreement contained an arbitration clause in Article X providing: 'All disputes arising in connection with this agreement during the period of the agreement or thereafter shall be finally settled under the Rules of Conciliation and Arbitration of the International Chamber of Commerce by one or more arbitrators appointed in accordance with the Rules of the said International Chamber of Commerce.'",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On September 1, 1961, Kamani instituted Suit No. 296 of 1961 in the High Court of Judicature at Bombay for: (1) declaration that Traction committed breaches and agreement terminated; (2) accounts of invoice items; (3) decree for Rs. 9,00,000 with interest; (4) handover of documents etc.",
      "type": "procedural",
      "date": "1961-09-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On January 22, 1962, Traction took out notice of motion for stay of suit under s.3 Arbitration Protocol and Convention Act 1937, s.34 Arbitration Act 1940, s.151 CPC or inherent powers, alternatively injunction restraining further proceedings.",
      "type": "procedural",
      "date": "1962-01-22",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Kantawalla J refused the motion on grounds arbitration clause invalid under s.389 Companies Act 1956.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court confirmed refusal in Appeal No. 32 of 1962 by judgment dated November 15/16, 1962, holding arbitration clause invalid as it obliged Kamani contrary to s.389 Companies Act 1956 to arbitrate otherwise than under Arbitration Act 1940.",
      "type": "procedural",
      "date": "1962-11-15",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Certificate granted by Bombay High Court for appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether an agreement to refer a future dispute to arbitration according to the rules of the International Chamber of Commerce between a Company registered under the Indian Companies Act and a foreigner is binding upon the former.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Section 389 Companies Act 1956 is an enabling provision and does not compel an Indian Company to agree to refer differences to arbitration only in accordance with Arbitration Act 1940; power to submit to arbitration is incident of power to enter into contracts.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": "s.389 Companies Act 1956; s.28 Indian Contract Act"
    },
    {
      "id": "pa2",
      "text": "Sub-s.3 of s.389 applies not to consensual arbitrations but only to statutory arbitrations in pursuance of Companies Act e.g. under s.494(3)(b).",
      "supporting_facts": [],
      "legal_basis": "s.389(3), s.494(3)(b) Companies Act 1956"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Arbitration clause invalid as it obliged Indian company contrary to s.389 Companies Act 1956 to go to arbitration otherwise than in accordance with Arbitration Act 1940.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "s.389 Companies Act 1956; Societe Italians per Lavori Marittimi v. Hind Constructions Ltd."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Detailed review of ICC Rules showing differences from Arbitration Act 1940 scheme: Court of Arbitration appoints arbitrators, finality without court remit/set aside, power to modify award etc.",
      "addresses_issue": "i1",
      "key_observation": "Scheme of ICC Rules different from ss.3-38 Arbitration Act 1940."
    },
    {
      "id": "cr2",
      "text": "s.389 Companies Act 1956 (replacing s.152 of 1913 Act) is enabling but regulates: company may refer by written agreement in accordance with Arbitration Act 1940; provisions of Arbitration Act apply to all arbitrations pursuant to Companies Act to which company party.",
      "addresses_issue": "i1",
      "key_observation": "Regulates power but does not prohibit other schemes."
    },
    {
      "id": "cr3",
      "text": "Historical review of legislation from Companies Act 1882, Arbitration Act 1899, CPC 1908 Sch II, Companies Act 1913 s.152, Arbitration Act 1940 s.47, Protocol Act 1937 s.3, concluding s.389 requires compliance with Arbitration Act but s.47 saves Protocol Act 1937.",
      "addresses_issue": "i1",
      "key_observation": "Protocol Act 1937 applicable even if inconsistent with Arbitration Act via s.47 proviso."
    },
    {
      "id": "cr4",
      "text": "Agreement to ICC arbitration governed by Protocol on Arbitration Clauses 1923; thus valid under Protocol Act 1937, not inconsistent with s.389.",
      "addresses_issue": "i1",
      "key_observation": "Distinguishes/does not sustain Societe Italians case as overlooked s.47 Arbitration Act and Protocol Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Arbitration agreement to refer disputes under ICC Rules is valid and binding on Indian company; High Court erred in holding it invalid under s.389 Companies Act 1956.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Societe Italians per Lavori Marittimi v. Hind Constructions Ltd.",
      "citation": "Appeal No. 63 of 1959 decided on September 22, 1960 (Unreported)",
      "treatment": "distinguished",
      "relevance": "High Court relied on it to hold arbitration clause invalid; SC holds view unsustainable as overlooked s.47 Arbitration Act and Protocol Act 1937."
    },
    {
      "case_name": "Sita Ram Balmukand v. The Punjab National Bank Ltd. Ambala City",
      "citation": "I.L.R. 1956 17 Lah. 722 (F.B.)",
      "treatment": "followed",
      "relevance": "s.152 Companies Act 1913 enabling, not obligatory to arbitrate under Arbitration Act 1899."
    },
    {
      "case_name": "Jhirighat Native Tea Company Ltd. v. Bipul Chandra Gupta",
      "citation": "I.L.R. 1940 1 Cal. 358",
      "treatment": "referred",
      "relevance": "All arbitrations involving companies must follow Arbitration Act 1899 per s.152 Companies Act 1913."
    },
    {
      "case_name": "East Bengal Bank Ltd. v. Jogesh Chandra Banerji",
      "citation": "L.R. 1940 2 Cal. 237",
      "treatment": "referred",
      "relevance": "Modifies Jhirighat: pendentelite arbitration governed by CPC Sch II, not s.152."
    },
    {
      "case_name": "The Catholic Bank Ltd. Mangalore v. F.P.S. Albuquerque",
      "citation": "I.L.R. 1944 Mad. 335 (F.B.)",
      "treatment": "referred",
      "relevance": "Companies could submit to arbitration only under Arbitration Act 1899 pre-1940."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Companies Act, 1956",
      "sections": [
        "s.389",
        "s.494(3)(b)"
      ],
      "relevance": "Regulates company's power to refer disputes to arbitration in accordance with Arbitration Act 1940; s.389 repealed by Act 65 of 1960."
    },
    {
      "name": "Arbitration Act, 1940",
      "sections": [
        "s.3 to 38",
        "s.34",
        "s.46",
        "s.47"
      ],
      "relevance": "Governs consensual arbitrations; s.47 saves other laws like Protocol Act 1937."
    },
    {
      "name": "Arbitration (Protocol and Convention) Act, 1937",
      "sections": [
        "s.3"
      ],
      "relevance": "Stay of suit if arbitration agreement under Protocol; applies notwithstanding Arbitration Act or CPC."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [
        "s.152"
      ],
      "relevance": "Predecessor to s.389; enabling provision for arbitration per then Arbitration Act."
    },
    {
      "name": "Indian Contract Act, 1872",
      "sections": [
        "s.28"
      ],
      "relevance": "Agreements in restraint of legal proceedings void except arbitration agreements."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "s.151",
        "Sch. II"
      ],
      "relevance": "Inherent powers; arbitration provisions."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Appeal allowed to extent High Court held arbitration clause invalid; matter remitted to High Court to decide whether stay should be granted under s.3 Arbitration (Protocol and Convention) Act 1937, as no finding on that by trial court or High Court.",
    "relief_granted": "High Court to consider stay application afresh",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The question which falls to be determined in this appeal... is Whether an agreement to refer a future dispute to arbitration according to the rules of the International Chamber of Commerce between a Company registered under the Indian Companies Act and a foreigner is binding upon the former.\"",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "\"Section 389 of the Companies Act, 1956 therefore, does not confer any new right upon Companies to agree to refer disputes... the section recognises the rights of a company to refer present disputes to arbitration, and seeks to regulate the right by placing a restriction upon the exercise of that right.\"",
      "speaker": "court",
      "significance": "Explains regulatory nature of s.389."
    },
    {
      "text": "\"By virtue of s.47... the provisions of the Arbitration (Protocol and Convention) Act, 1937, applicable to consensual arbitrations under the Arbitration Act of 1940 when the conditions prescribed... are attracted, even if the scheme... is inconsistent with ss.3 to 38.\"",
      "speaker": "court",
      "significance": "Key to upholding validity via s.47 proviso."
    }
  ],
  "_case_id": "1963_225",
  "_label": 1,
  "_text_length": 41934,
  "_extracted_at": "2026-02-10T19:50:23.861324"
}