{
  "metadata": {
    "case_name": "Eight Appellants v. State",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": "Criminal Appeal No. 95 of 1961",
    "date_of_judgment": "1963-08-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "There was enmity between Tikam (deceased) and the appellants.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On January 24, 1960, just about noon time Tikam was sitting at the shop of a blacksmith in village Nandgaon Police Station Barsana District Mathura. Dulli and Nathi who were examined as P. Ws. 2 & 3 were sitting near him.",
      "type": "material",
      "date": "1960-01-24",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellants who were armed with Ballams, a Pharsa and Lathis arrived on the spot and on seeing Tikam started to assault him. Tikam was severely injured and fell in a ditch adjacent to the road but even after he fell in it the assault was continued by the appellants. He died the same day about five hours later.",
      "type": "material",
      "date": "1960-01-24",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After assaulting Tikam, these appellants decided to ransack his house and started towards it. On the way they were met by the other four accused and this brought their number to twelve.",
      "type": "material",
      "date": "1960-01-24",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "While they were going to the house of Tikam they saw Puran and decided to beat him. Puran was assaulted.",
      "type": "material",
      "date": "1960-01-24",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellants (eight in number) were originally charged under S. 302 read with S. 149, Indian Penal Code for the murder of Tikam.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Sessions Judge, Mathura, did not think that a case of murder was made out and convicted them of the lesser offence under S. 325 read with S. 149 and sentenced to three years rigorous imprisonment. They have also been convicted variously under ss. 147, 148, Indian Penal Code and sentenced to smaller terms which run concurrently.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Their appeal to the High Court (Criminal Appeal No. 1597 of 1960) was dismissed on February 15, 1961, and the conviction and sentences were maintained.",
      "type": "procedural",
      "date": "1961-02-15",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "There was another trial at which these eight persons and four others were tried under S. 307/149 for causing hurt to Puran and under ss. 147, 148. Sessions Judge held injuries warranted offence under s. 323; accused and Puran compounded that offence and all acquitted of it. Sessions Judge convicted 11 out of 12 under ss. 147, 148.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "One Koka was acquitted because his plea that he was blind from birth was accepted.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The 11 accused in the second case appealed to High Court (Criminal Appeal No. 1598 of 1960) and were acquitted on January 31, 1961.",
      "type": "procedural",
      "date": "1961-01-31",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The learned magistrate who committed the accused framed a common charge in respect of the two incidents but the Sessions judge amended the charge and divided it into two charges and separated the two trials.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Mr. Justice Sharma delivered judgment in the High Court appeal on two consecutive days in the presence of the appellants and their counsel.",
      "type": "procedural",
      "date": "1961-02-15",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellants were denied a fair hearing because Mr. Justice Sharma did not allow them a chance to reply to the arguments on behalf of the State.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the prior acquittal in the second case (Puran assault) operates as a bar to the conviction in the present case (Tikam assault).",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the earlier judgment destroys the prosecution case in the present appeal.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Mr. Justice Sharma did not allow the appellants a chance to reply to the arguments on behalf of the State and thus denied them a fair hearing.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The prior acquittal in the second case operates as a bar to the conviction in the present case.",
      "supporting_facts": [
        "f11",
        "f8"
      ],
      "legal_basis": "Sambasivam v. Public Prosecutor Federation of Malaya (1950 A.C. 458); Pritam Singh v. State of Punjab (AIR 1956 S.C. 415)"
    },
    {
      "id": "pa3",
      "text": "The earlier judgment involved almost the same evidence and the reasoning of the learned judge in Puran’s case destroys the prosecution case in the present appeal.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "If any right to reply had been denied, appellants should have brought it to the notice of the Judge immediately; they did not raise it before certification, so point cannot be considered.",
      "addresses_issue": "i1",
      "key_observation": "No grievance made contemporaneously; hoping for acquittal based on prior case."
    },
    {
      "id": "cr2",
      "text": "Prior acquittal on different and independent charge (assault on Puran after Tikam assault was over); assault on Tikam complete before new common object to assault Puran formed.",
      "addresses_issue": "i2",
      "key_observation": "No bar under s. 403 CrPC as not same offence or same facts; distinct offences spaced by time and place."
    },
    {
      "id": "cr3",
      "text": "Sambasivam and Pritam Singh distinguished: those involved indivisible confession or evidence affecting admissibility; here charges independent.",
      "addresses_issue": "i2",
      "key_observation": "Followed Mohinder Singh v. State of Punjab and Gurcharan Singh v. State of Punjab."
    },
    {
      "id": "cr4",
      "text": "Sessions Judge right in separating charges and trials; ss. 236, 237 CrPC not applicable as offences distinct.",
      "addresses_issue": "i2",
      "key_observation": "Even if connected by time/place, offences required separate charges."
    },
    {
      "id": "cr5",
      "text": "Cannot rely on reasoning in earlier judgment as it was on separately recorded evidence; earlier judgment admissible only for parties/decision, not appreciation of evidence (ss. 40-43 Evidence Act).",
      "addresses_issue": "i3",
      "key_observation": "No review of facts/evidence by Supreme Court absent special circumstances."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Prior acquittal in Puran case does not create a bar to conviction for Tikam assault.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No denial of fair hearing established.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Supreme Court will not review evidence accepted by High Court and Sessions Court absent special circumstances.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sambasivam v. Public Prosecutor Federation of Malaya",
      "citation": "1950 A.C. 458",
      "treatment": "distinguished",
      "relevance": "Cited by appellants for bar of prior acquittal; distinguished as involved indivisible confession."
    },
    {
      "case_name": "Pritam Singh v. State of Punjab",
      "citation": "A.I.R. 1956 S.C. 415",
      "treatment": "distinguished",
      "relevance": "Cited by appellants; distinguished as acquittal affected admissibility of evidence in murder case."
    },
    {
      "case_name": "Mohinder Singh v. State of Punjab",
      "citation": null,
      "treatment": "followed",
      "relevance": "Distinguished Sambasivam and Pritam Singh; acquittal later than conviction on substantive charge."
    },
    {
      "case_name": "Gurcharan Singh v. State of Punjab",
      "citation": "1963 3 S.C.R. 585",
      "treatment": "followed",
      "relevance": "Distinguished Pritam Singh as acquittal under Arms Act later than conviction."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302/149",
        "325/149",
        "147",
        "148",
        "307/149",
        "323"
      ],
      "relevance": "Charges and convictions for murder, grievous hurt, rioting, unlawful assembly."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "403",
        "236",
        "237"
      ],
      "relevance": "S.403 on autrefois acquit; ss.236/237 on doubtful offences and alternative convictions; not applicable here."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "40-43"
      ],
      "relevance": "Conditions for relevance of prior judgment; admissible for parties/decision, not evidence appreciation."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by special leave against the Allahabad High Court judgment upholding Sessions Court convictions under S.325/149, 147, 148 IPC is dismissed. Prior acquittal in companion case does not bar conviction; no fair hearing denial; no review of evidence.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The effect of a verdict of acquittal pronounced by a competent court on a lawful charge and after a lawful trial is not completely stated by saying that the person acquitted cannot be tried again for the same offence. To that it must be added that the verdict is binding and conclusive in all subsequent proceedings between the parties to the adjudication.",
      "speaker": "court",
      "significance": "Quote from Sambasivam cited by appellants but distinguished by court."
    },
    {
      "text": "There is nothing in common between the present appeal and the two cases relied upon by the appellants. In this case there is no doubt a prior acquittal but on a charge which was quite different from and independent of the charge in the present case.",
      "speaker": "court",
      "significance": "Core reasoning rejecting bar of prior acquittal."
    }
  ],
  "_case_id": "1963_206",
  "_label": 0,
  "_text_length": 14216,
  "_extracted_at": "2026-02-10T19:50:28.344359"
}