{
  "metadata": {
    "case_name": "Akola Electric Supply Company v. Its Employees",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Das Gupta J."
    ],
    "case_number": "Civil Appeal No. 637 of 1962",
    "date_of_judgment": "1963-03-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeal by special leave from the award dated April 29, 1961 of the State Industrial Court at Nagpur in Industrial Reference No. 13 of 1959 under s. 38(a) of the Central Provinces and Berar Industrial Disputes Settlement Act, 1947.",
      "type": "procedural",
      "date": "1961-04-29",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By an earlier award dated December 4, 1959, the Industrial Court ordered the payment of gratuity to the employees of the appellant Company on certain rates, to come into force from December 4, 1959.",
      "type": "procedural",
      "date": "1959-12-04",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "On an application by the Company under Art. 227 of the Constitution, the Nagpur High Court set aside the Industrial Court's order and remanded the matter for reconsideration after examining the financial condition of the Company.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "After remand, the Industrial Court took evidence of both parties as regards the financial condition of the Company and concluded that the Company was in a very sound financial position and could easily bear the burden of payment of gratuity to the extent of Rs. 50,000/- or even more.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Industrial Court made a fresh award directing payment of gratuity to the Company's employees at the rate of 1 month's average wage (average wage calculated for the period December 1, 1958 to November 30, 1959) to every employee who had to his credit uninterrupted continuous service of not less than five years on termination of his service, except by dismissal on account of misconduct. The award to come into force from April 29, 1961.",
      "type": "material",
      "date": "1961-04-29",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The Appellant Company was a licensee for supplying electric energy to the public within the area approximating to the Municipal limits of Akola. The license expired on December 6, 1959.",
      "type": "background",
      "date": "1959-12-06",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Prior to expiry, the State Electricity Board had by a notice dated November 27, 1957, intimated its intention to exercise its option to purchase the undertaking on the expiry of the license.",
      "type": "background",
      "date": "1957-11-27",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "It was after the notice had been served and it was known that the Company would be closing its business on December 6, 1959, that the claim for gratuity was first made.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The very application for referring this and other disputes for arbitration contained the frank statement that it was in view of the impending closure of business that the claim for gratuity was being made.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "The earlier award by the Industrial Court was made only two days before the Company's license expired and the business was taken over by the Bombay Electricity Board.",
      "type": "procedural",
      "date": "1959-12-04",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The award under appeal was made more than a year after the Company had closed its business.",
      "type": "procedural",
      "date": "1961-04-29",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Tribunal was justified in imposing on the Company a gratuity scheme at a time when it had already ceased to carry on its business.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Gratuity schemes are planned on a long term basis, the ruling principle being to make the employer pay retiral benefits to such of its employees as retire from year to year. The framing of a gratuity scheme when an industry is on the verge of closure or after it has closed is wholly unjustified.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8",
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The fact that an industry is going to close or has actually closed is no bar to a framing of gratuity scheme for its employees.",
      "supporting_facts": [],
      "legal_basis": "Indian Hume Pipe Co. v. Its Workmen; Bharatkhand Textile Mfg. Co. Ltd. v. Textile Labour Assn."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Gratuity schemes are for industries expected to carry on for a fairly long time; one important factor is the ability of the industry to bear the additional financial burden on a long-term basis, considering average retirements per year.",
      "addresses_issue": "i1",
      "key_observation": "There is considerable force in the contention that gratuity schemes are not justified post-closure."
    },
    {
      "id": "cr2",
      "text": "Statutory provision for retrenchment compensation is no bar to gratuity scheme (citing Indian Hume Pipe), but gratuity helps after retirement whatever cause, while retrenchment comp relieves sudden termination.",
      "addresses_issue": "i1",
      "key_observation": "No precedent for gratuity scheme in closing industries."
    },
    {
      "id": "cr3",
      "text": "Existence of Provident Fund is no bar to gratuity (citing Bharatkhand Textile), but considerations include long-term financial condition, not temporary prosperity/adversity.",
      "addresses_issue": "i1",
      "key_observation": "Gratuity evolved by industrial adjudication for ongoing industries where small percentage retire yearly."
    },
    {
      "id": "cr4",
      "text": "When industry closes, all workmen retire at once, making gratuity equivalent to additional retrenchment compensation, which finds no justification in principles of social justice.",
      "addresses_issue": "i1",
      "key_observation": "Industrial Court acted wrongly in directing gratuity payment."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Industrial Court acted wrongly in directing any gratuity to be paid by the Company to its employees when the industry had closed.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Indian Hume Pipe Co. v. Its Workmen",
      "citation": "1960 2 S.C.R. 32",
      "treatment": "followed",
      "relevance": "Statutory retrenchment compensation no bar to gratuity scheme; distinguishes purposes of gratuity and retrenchment comp."
    },
    {
      "case_name": "Bharatkhand Textile Mfg. Co. Ltd. v. Textile Labour Assn.",
      "citation": "1960 3 S.C.R. 329",
      "treatment": "followed",
      "relevance": "Provident Fund no bar to gratuity; considerations for gratuity scheme include long-term financial capacity, average retirements."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Provinces and Berar Industrial Disputes Settlement Act, 1947",
      "sections": [
        "s. 38(a)"
      ],
      "relevance": "Basis for Industrial Court's award."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 227"
      ],
      "relevance": "Nagpur High Court set aside earlier award and remanded under this article."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed and the award made by the Industrial Court is set aside. No gratuity directed to be paid by the Company to its employees.",
    "relief_granted": "Setting aside of the Industrial Court's award",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the framing of a gratuity scheme when an industry is on the verge of closure or after it has closed is, it is urged, wholly unjustified. In our opinion, there is considerable force in this contention.",
      "speaker": "court",
      "significance": "Acknowledges strength of appellant's main contention."
    },
    {
      "text": "In such a case the entire body of workmen will retiring at one and the same time so that in substance, though not in name, the provision of gratuity would be equivalent to the grant of retrenchment compensation, in addition to what is provided for in the statute.",
      "speaker": "court",
      "significance": "Core reasoning why gratuity not applicable post-closure."
    },
    {
      "text": "We have therefore come to the conclusion that the Industrial Court acted wrongly in directing any gratuity to be paid by the Company to its employees.",
      "speaker": "court",
      "significance": "Key holding leading to appeal allowance."
    }
  ],
  "_case_id": "1963_222",
  "_label": 1,
  "_text_length": 8437,
  "_extracted_at": "2026-02-10T19:50:19.444549"
}