{
  "metadata": {
    "case_name": "Appellant (elected candidate) v. Satrughna Sahu & Ors.",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO J."
    ],
    "case_number": "Civil Appeal No. 603 of 1962",
    "date_of_judgment": "1963-03-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant stood for election to the Orissa Legislative Assembly from the Choudwar constituency in the district of Cuttack and was elected.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant was opposed by three persons who are the respondents before the Supreme Court.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent No. 1, Satrughna Sahu, filed an election petition against the appellant and the other two candidates.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Before the tribunal, an objection was raised that the election petition was not numbered in accordance with s. 82 of the Representation of the People Act, 1951, and this defect was fatal under s. 90(3). The tribunal dismissed the petition as a preliminary issue.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Satrughna Sahu appealed to the Orissa High Court under s. 116-A of the Act. The appeal was heard on March 5 and 6, 1962, and fixed for judgment on March 8, 1962.",
      "type": "procedural",
      "date": "1962-03-05",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On March 7, 1962, Satrughna Sahu filed an application to withdraw the appeal, stating he did not want to prosecute it further.",
      "type": "procedural",
      "date": "1962-03-07",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The High Court withheld the judgment in the main appeal pending disposal of the withdrawal application on March 8, 1962.",
      "type": "procedural",
      "date": "1962-03-08",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The appellant supported the withdrawal, but the other two respondents objected, contending no absolute right to withdraw and principles analogous to ss. 109 and 110 applied.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On March 28, 1962, the High Court refused permission to withdraw, applying principles of ss. 109 and 110, kept the withdrawal application alive for the tribunal, set aside the tribunal's order, and remanded the election petition.",
      "type": "procedural",
      "date": "1962-03-28",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The appellant's applications for certificate to appeal to Supreme Court were dismissed; special leave petitions were allowed, leading to this appeal on the withdrawal issue.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Satrughna Sahu, as appellant before the High Court under s. 116-A, had an absolute right to withdraw the appeal analogous to O. XXIII r. 1(1) CPC, or whether principles of ss. 109 and 110 of the Act applied.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the High Court erred in refusing withdrawal and referring the application to the election tribunal instead of deciding it itself under ss. 109 and 110.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Satrughna Sahu had an absolute right to withdraw the appeal analogous to O. XXIII r. 1(1) CPC, and the High Court was bound to permit it without applying ss. 109 and 110.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "O. XXIII r. 1(1) CPC; s. 116-A(2) RPA"
    },
    {
      "id": "pa2",
      "text": "Even if ss. 109 and 110 applied, the High Court should have decided the withdrawal itself and not converted it into an application for withdrawal of the election petition to be referred to the tribunal.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "ss. 109 and 110 RPA"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No absolute right to withdraw the appeal; principles analogous to ss. 109 and 110 of the Act applied, requiring permission of the High Court.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "ss. 109 and 110 RPA"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Chapter IV (ss. 108-116) deals with withdrawal of election petitions before Commission or tribunal, not appeals; public interest in purity of elections justifies restrictions on petitions but not explicitly on appeals under Chapter IVA.",
      "addresses_issue": "i1",
      "key_observation": "No express provision in s. 116-A or Chapter IVA applying ss. 109-110 to appeals; High Court powers under s. 116-A(2) mirror those in civil appeals from original decrees."
    },
    {
      "id": "cr2",
      "text": "Under s. 116-A(2), High Court follows CPC procedure for appeals from original decrees; O. XXIII r. 1(1) CPC gives absolute right to appellant to withdraw unconditionally before judgment, subject to costs.",
      "addresses_issue": "i1",
      "key_observation": "Precedents confirm appellant's absolute right to withdraw appeal if no cross-objections creating respondent interest."
    },
    {
      "id": "cr3",
      "text": "High Court erred in importing ss. 109-110 principles to appeals; no necessary implication; Parliament could have explicitly applied them if intended.",
      "addresses_issue": "i1",
      "key_observation": "Withdrawal of appeal after tribunal trial less risks purity of elections than petition withdrawal."
    },
    {
      "id": "cr4",
      "text": "Even if ss. 109-110 applied, High Court should have decided under s. 110 itself, not refer to tribunal.",
      "addresses_issue": "i2",
      "key_observation": "High Court erred in treating appeal withdrawal as petition withdrawal."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant under s. 116-A has absolute right to unconditionally withdraw appeal before High Court, analogous to O. XXIII r. 1(1) CPC; ss. 109-110 do not apply to appeals.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court must permit unconditional withdrawal of such appeal; cannot refuse and proceed to hear merits.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kamaraja Nadar v. Kunju Thevar",
      "citation": "1959 S.C.R. 583",
      "treatment": "referred",
      "relevance": "Public interest in election petitions beyond candidates; justifies restrictions on withdrawal to preserve purity of elections."
    },
    {
      "case_name": "T. K. Gangi Reddy v. M. C. Anjaneya Reddy",
      "citation": "1960 22 E.L.R. 261",
      "treatment": "followed",
      "relevance": "High Court jurisdiction under s. 116-A(2) similar to appeals from original decrees; entire case reopens unless Act curtails expressly."
    },
    {
      "case_name": "Kalyan Singh v. Rahmu",
      "citation": "I.L.R. 1901 23 All. 130",
      "treatment": "followed",
      "relevance": "Appellant has absolute right to withdraw appeal before judgment if no respondent objection."
    },
    {
      "case_name": "Kanhaya Lal v. Partap Chand",
      "citation": "1931 29 A.L.J. 232",
      "treatment": "followed",
      "relevance": "Appellant right to withdraw unconditionally under O. XXIII r.1(1) and s.107(2) CPC, subject to costs."
    },
    {
      "case_name": "Dhondo Narayan Shiralkar v. Annaji Pandurang Kokatnur",
      "citation": "I.L.R. 1952 Bom. 66",
      "treatment": "followed",
      "relevance": "Appellant entitled to withdraw appeal as of right unless respondent acquired interest."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "s. 82",
        "s. 90(3)",
        "s. 116-A",
        "s. 109",
        "s. 110",
        "s. 108",
        "s. 111",
        "s. 112-116",
        "s. 107(1)",
        "s. 117"
      ],
      "relevance": "Governs election petitions, withdrawal/abatement (Ch. IV), appeals from tribunal (Ch. IVA s.116-A); no application of petition withdrawal rules to appeals."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "O. XXIII r. 1(1)",
        "O. XXIII r. 1(2)",
        "O. XXIII r. 1(3)",
        "s. 107(2)",
        "O. XLI r. 22(4)"
      ],
      "relevance": "Applies to appeals under s.116-A(2) RPA as if from original decree; gives absolute right to withdraw appeal unconditionally."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed; the High Court's order refusing withdrawal is set aside; the appeal before the High Court stands withdrawn in view of Satrughna Sahu's unconditional withdrawal application.",
    "relief_granted": "High Court order on withdrawal set aside; High Court appeal deemed withdrawn.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the High Court has the same powers, jurisdiction and authority and has to follow the same procedure in the matter of withdrawal of appeals under s. 116-A as in the matter of an appeal from an original decree before it\"",
      "speaker": "court",
      "significance": "Core holding on applicability of CPC to appeal withdrawals under RPA."
    },
    {
      "text": "\"an appellant under s. 116-A makes an application for an unconditional withdrawal of the appeal, the power of the High Court... is to allow such withdrawal\"",
      "speaker": "court",
      "significance": "Affirms absolute right to withdraw appeal."
    },
    {
      "text": "\"the petitioner in an election petition has no an absolute right to withdraw it nor has the respondent the absolute right to withdraw from opposing the petition\"",
      "speaker": "court",
      "significance": "Contrasts petition withdrawal (restricted) with appeal withdrawal (unrestricted)."
    }
  ],
  "_case_id": "1963_155",
  "_label": 1,
  "_text_length": 24832,
  "_extracted_at": "2026-02-10T19:49:37.266628"
}