{
  "metadata": {
    "case_name": "State of Bihar & Anr. v. Kundan Singh & Ors.",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar J."
    ],
    "case_number": "Civil Appeal No. 219 of 1962",
    "date_of_judgment": "1963-04-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents owned an area of 0.12 acre of land in village Bermo No. 18 in the district of Hazaribagh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Land required for construction of Aerial Rope-way for Bokaro Thermal Power Plant.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Declaration under s. 4 of the Land Acquisition Act, 1894 made on August 9, 1952.",
      "type": "procedural",
      "date": "1952-08-09",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Property consists of two buildings: main structure and out-houses together with open space in front.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Government acquired space of 50 ft in width for electric wire, including portion of open space and out-houses.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Land Acquisition Officer fixed compensation at Rs. 4,451/5/6 for land and out-houses.",
      "type": "procedural",
      "date": "1952-11-27",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondents applied for reference under s. 18, claiming additional compensation: Rs. 21,765/8/- spent on principal building and loss of monthly rent Rs. 160/-, due to contiguous lands/buildings not acquired making them useless; referrable to s. 23(3).",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Deputy Commissioner made reference, noting claim for additional compensation due to loss from non-acquisition of contiguous property.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Kundan Singh (respondent No. 1) gave evidence before District Judge that on October 22, 1952, he applied for acquisition of other quarters as they were contiguous and useless.",
      "type": "disputed",
      "date": "1952-10-22",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "District Judge held narrow strip left affected utility of larger building and unacquired land; awarded additional Rs. 1,000/- besides LAO amount.",
      "type": "procedural",
      "date": "1960-08-31",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Respondents appealed to Patna High Court under s. 54, claiming rope-way spoiled main building, so out-houses could not be acquired without main building; sought direction to acquire main building.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Appellants contended before High Court: s. 49 plea not open in s. 18 reference appeal; point not raised before LAO or District Judge.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "High Court rejected contentions, directed Land Acquisition Officer to acquire remaining area and building, assess compensation, deduct Rs. 1,000/- awarded by District Judge.",
      "type": "procedural",
      "date": "1960-08-31",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "No application under s. 49 produced or shown to High Court; District Judge did not accept s. 49 plea.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court could entertain a plea under s. 49 of the Land Acquisition Act in an appeal arising from reference proceedings under s. 18.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether respondents had made an application under s. 49 before the Land Acquisition Officer made the award.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Plea under s. 49 not open in appeal from s. 18 reference; such plea foreign to s. 18 enquiry and should be under s. 49 proceedings.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "Sections 18, 49, 54 of Land Acquisition Act"
    },
    {
      "id": "pa2",
      "text": "No application under s. 49 made before Land Acquisition Officer or District Judge; respondents' reference claim was under s. 23(1) third/fourth clauses.",
      "supporting_facts": [
        "f7",
        "f9",
        "f14"
      ],
      "legal_basis": "Section 49(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Claim in s. 18 reference petition (para I d) showed reliance on s. 49; contiguous property not acquired caused huge loss; entitled to acquisition of whole property including main building.",
      "supporting_facts": [
        "f7",
        "f9",
        "f11"
      ],
      "legal_basis": "Sections 23(3), 49"
    },
    {
      "id": "ra2",
      "text": "Rope-way completely spoiled main building; Land Acquisition Officer could not acquire out-houses without main building.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Section 49"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No evidence respondents made s. 49 application before award; District Judge rejected it implicitly, treated claim under s. 23; no such application produced.",
      "addresses_issue": "i2",
      "key_observation": "Respondents' s. 18 petition claimed under s. 23, not s. 49."
    },
    {
      "id": "cr2",
      "text": "Scope of s. 18 reference limited to measurement, amount of compensation, persons entitled, apportionment; court considers s. 23 factors therein, but s. 49 claim separate proceeding before award.",
      "addresses_issue": "i1",
      "key_observation": "S. 49 prohibits partial acquisition if owner desires whole before award; distinct from s. 18."
    },
    {
      "id": "cr3",
      "text": "S. 49(1) ban operates before award under s. 11; owner must object post ss. 4/6 notifications but pre-award; post-award, claim under s. 23 only.",
      "addresses_issue": "i1",
      "key_observation": "Two alternative remedies: s. 23 additional compensation or pre-award s. 49 full acquisition."
    },
    {
      "id": "cr4",
      "text": "Distinguished Narayanaswamy Chettier (special circumstances allowed post-award claim); followed Krishna Das Roy (s. 49 before award).",
      "addresses_issue": "i1",
      "key_observation": "Scheme of s. 49 requires pre-award expression of desire."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court erred in allowing s. 49 plea in s. 18 reference appeal; such claim must be raised before award in separate s. 49 proceedings.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No s. 49 application made by respondents before award.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pramatha Nath Mullick v. Secretary of State for India",
      "citation": "1929 L.R. 57 I.A. 100",
      "treatment": "followed",
      "relevance": "Scope of enquiry under s. 18 limited to four specified objections."
    },
    {
      "case_name": "Secretary of State for India in Council v. Narayanaswamy Chettier",
      "citation": "1931 I.L.R. 55 Mad. 391",
      "treatment": "distinguished",
      "relevance": "Held s. 49 claim not required before award, but disapproved as contrary to s. 49 scheme (special circumstances there)."
    },
    {
      "case_name": "Krishna Das Roy v. The Land Acquisition Collector of Pabna",
      "citation": null,
      "treatment": "followed",
      "relevance": "S. 49 application must be made before award."
    }
  ],
  "statutes_cited": [
    {
      "name": "Land Acquisition Act, 1894",
      "sections": [
        "4",
        "5A",
        "6",
        "9",
        "11",
        "12",
        "16",
        "18",
        "23",
        "49",
        "54"
      ],
      "relevance": "Governs acquisition proceedings, reference for compensation, scope of enquiries, prohibition on partial acquisition of house if owner desires whole pre-award."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, set aside the Patna High Court order directing acquisition of remaining property under s. 49, and restored the District Judge's order awarding additional Rs. 1,000/- compensation.",
    "relief_granted": "Restoration of District Judge's award of Rs. 4,451/5/6 + Rs. 1,000/-",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The scope of the enquiry under s. 18(1) is specifically indicated by the section itself.",
      "speaker": "court",
      "significance": "Defines limits of s. 18 reference proceedings."
    },
    {
      "text": "A claim under s. 49... cannot be mixed up with a claim which can be made in reference proceedings sent to the Court under s. 18.",
      "speaker": "court",
      "significance": "Clarifies separation of s. 49 and s. 18 remedies."
    },
    {
      "text": "The owner has to express his desire that the whole of his house should be acquired before the award is made.",
      "speaker": "court",
      "significance": "Interprets timing requirement under s. 49(1)."
    }
  ],
  "_case_id": "1963_54",
  "_label": 1,
  "_text_length": 25422,
  "_extracted_at": "2026-02-10T19:47:38.726704"
}