{
  "metadata": {
    "case_name": "Mahalaxmi Mills Ltd. & Master Silk Mills Ltd. v. Commissioner of Income-tax",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Das Gupta, J."
    ],
    "case_number": "Civil Appeals Nos. 599, 600, 601 and 602 of 1962",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Assessees Mahalaxmi Mills Ltd. and Master Silk Mills Ltd. carried on business in Bhavnagar, formerly an Indian State.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1948, Bhavnagar along with other Kathiawar states formed United States of Kathiawar, later renamed Saurashtra.",
      "type": "background",
      "date": "1948",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On March 16, 1949, Raj Pramukh instituted Saurashtra Income-tax Ordinance, 1949, in force for assessment year 1949-50.",
      "type": "background",
      "date": "1949-03-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Assets of both assessees acquired before previous year 1949-50, so s.13(5)(b) of Ordinance applied for written down value.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "ITO deducted depreciation which would have been allowable under Indian Income-tax Act, 1922, if in force: Rs.17,21,041 for Mahalaxmi (CA 599/62), Rs.2,02,500 for Master Silk (CA 601/62).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Assessees contended no deduction as no claim made under 1922 Act.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Appellate Assistant Commissioner and Tribunal held no deduction permitted under the expression.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "High Court answered reference under s.66(1) in affirmative: written down value computed by deducting allowable depreciation under 1922 Act even if not claimed; granted certificate under s.66A(2).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In 1950, Saurashtra became Part B State; Indian Income-tax Act, 1922 extended by s.3 Indian Finance Act, 1950.",
      "type": "background",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "For 1951-52, ITO under s.10(5)(b) deducted depreciation allowed in 1950-51 under 1922 Act, 1949-50 under Ordinance (conceded deductible), and prior years under Bhavnagar War Profits Act: Rs.5,93,285 (Mahalaxmi CA 600/62), Rs.1,26,707 (Master Silk CA 602/62).",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellate Assistant Commissioner agreed with ITO; Tribunal differed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court answered questions: Notification No.19 S.R.O.477/1953 ultra vires (not disputed); depreciation under Bhavnagar War Profits Act deductible under s.10(5)(b) read with Removal of Difficulties Order para 2.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Removal of Difficulties Order made by Central Govt on Dec 2, 1950 under s.12 Finance Act 1950.",
      "type": "background",
      "date": "1950-12-02",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether under s.13(5)(b) Saurashtra Income-tax Ordinance 1949, written down value computed by deducting depreciation allowable under Indian IT Act 1922 even if not claimed, on proper construction of 'or which would have been allowed to him if the Indian Income-tax Act, 1922, was in force in the past'.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether under s.10(5)(b) Indian IT Act 1922 read with Taxation Laws (Part B States) Removal of Difficulties Order 1950 para 2, depreciation availed under Bhavnagar War Profits Act deductible in computing written down value for 1951-52.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Ordinance uses 'would have been allowed' not 'would have been allowable if claim supported by prescribed particulars made'; no justification to read in claim requirement.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.13(5)(b) Saurashtra Ordinance"
    },
    {
      "id": "pa2",
      "text": "Assessee might not claim depreciation if not in interest; words insufficient to express intention of deducting hypothetical depreciation if claim made.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Makes position worse than if 1922 Act actually in force, where only actually allowed deducted; unreasonable.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Causes undue hardship as no actual availment of depreciation.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa5",
      "text": "For 1951-52: No difficulty actually experienced; Removal of Difficulties Order para 2 applies only if difficulty arises in particular case.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "s.12 Finance Act 1950; Removal of Difficulties Order para 2"
    },
    {
      "id": "pa6",
      "text": "Bhavnagar War Profits Act not law of Part B State (ceased before Saurashtra formed); not covered by 'laws or rules of a Part B State'; 'of a Part B State' applies by ellipsis to 'any law relating to tax on profits of business'.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Removal of Difficulties Order para 2"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Deduct depreciation which would have been allowable under 1922 Act if in force and claim made.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "s.13(5)(b) Saurashtra Ordinance"
    },
    {
      "id": "ra2",
      "text": "Depreciation under Bhavnagar War Profits Act deductible under Removal of Difficulties Order para 2 as 'any law relating to tax on profits of business'.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "s.10(5)(b) IT Act 1922; Removal of Difficulties Order para 2"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Words 'which would have been allowed to him if the Indian Income-tax Act, 1922, was in force' implicit that proper claim made; meaningless without claim; apt to express intention of deducting allowable depreciation assuming claim.",
      "addresses_issue": "i1",
      "key_observation": "Authority appreciated no allowance without claim; words sufficient."
    },
    {
      "id": "cr2",
      "text": "Not unreasonable; Raj Pramukh assumed proper claim ordinarily made if Act in force.",
      "addresses_issue": "i1",
      "key_observation": "Hardship irrelevant; words unambiguous."
    },
    {
      "id": "cr3",
      "text": "Distinguished CIT v. Kamala Mills (no similar expression); Rajaratna Mills (different words 'applicable' not 'allowed').",
      "addresses_issue": "i1",
      "key_observation": "Precedents inapplicable."
    },
    {
      "id": "cr4",
      "text": "Removal of Difficulties Order valid; once made on satisfaction difficulties arisen generally, applies to all cases per its terms without needing difficulty per case.",
      "addresses_issue": "i2",
      "key_observation": "No separate order per case needed."
    },
    {
      "id": "cr5",
      "text": "Para 2 requires deducting depreciation under 'any laws or rules of a Part B State relating to income-tax... or any law relating to tax on profits of business'; 'of a Part B State' deliberately omitted from second part to include pre-Part B laws in area.",
      "addresses_issue": "i2",
      "key_observation": "Not ellipsis; intention to include component state laws like Bhavnagar War Profits Act."
    },
    {
      "id": "cr6",
      "text": "Comparison with Merged States Order 1949 supports deliberate addition.",
      "addresses_issue": "i2",
      "key_observation": "Bhavnagar War Profits Act covered."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under s.13(5)(b) Saurashtra Ordinance, written down value computed by deducting depreciation allowable under IT Act 1922 even if not claimed.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Depreciation under Bhavnagar War Profits Act deductible under s.10(5)(b) IT Act 1922 read with Removal of Difficulties Order para 2.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax v. Kamala Mills Ltd.",
      "citation": "(1949) 17 ITR 130",
      "treatment": "distinguished",
      "relevance": "'Actually allowed' unambiguous, means in fact given; no similar expression as 'would have been allowed if Act in force'."
    },
    {
      "case_name": "Rajaratna Naranbhai Mills Ltd. v. Commissioner of Income-tax",
      "citation": "(1950) 18 ITR 122",
      "treatment": "distinguished",
      "relevance": "'Depreciation applicable' immaterial if benefit taken; not 'allowed' or similar to phrase here."
    },
    {
      "case_name": "Commissioner of Income-tax Hyderabad v. Dewan Bahadur Ram Gopal Mills Ltd.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Central Govt determines if difficulty arisen under s.12 Finance Act 1950; order valid."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s.10(5)(b)",
        "s.66(1)",
        "s.66A(2)",
        "s.60A"
      ],
      "relevance": "Governs written down value by deducting actually allowed depreciation; basis for hypothetical in Ordinance; extended to Part B States."
    },
    {
      "name": "Saurashtra Income-tax Ordinance, 1949",
      "sections": [
        "s.13(5)(b)"
      ],
      "relevance": "Written down value: actual cost less depreciation actually allowed or would have been allowed if IT Act 1922 in force."
    },
    {
      "name": "Indian Finance Act, 1950",
      "sections": [
        "s.3",
        "s.12"
      ],
      "relevance": "Extended IT Act to Part B States; empowered Removal of Difficulties Order."
    },
    {
      "name": "Taxation Laws (Part B States) Removal of Difficulties Order, 1950",
      "sections": [
        "para 2"
      ],
      "relevance": "Depreciation under Part B State laws or any law on profits tax deducted in written down value under s.10(5)(b)."
    },
    {
      "name": "Notification No.19 S.R.O.477 dated 9th March 1953",
      "sections": null,
      "relevance": "Under s.60A IT Act; held ultra vires (not disputed)."
    },
    {
      "name": "Bhavnagar War Profits Act",
      "sections": null,
      "relevance": "Depreciation availed under it deductible as law relating to tax on profits of business."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "All four appeals dismissed; High Court correct on both issues for 1949-50 and 1951-52 assessments regarding computation of written down value by deducting specified depreciation.",
    "relief_granted": null,
    "costs": "with costs"
  },
  "key_quotes": [
    {
      "text": "'The words which would have been allowed to him were used to mean which should have been allowed if proper claim had been made. For, it would be meaningless to speak of a depreciation allowance being allowed without a claim.'",
      "speaker": "court",
      "significance": "Core interpretation of s.13(5)(b) resolving issue i1."
    },
    {
      "text": "Paragraph 2 requires all depreciation actually allowed under any laws or rules of a Part B State relating to income-tax and super-tax or any law relating to tax on profits of business to be taken into account in computing the written down value.",
      "speaker": "court",
      "significance": "Applies Removal of Difficulties Order broadly, including Bhavnagar Act."
    }
  ],
  "_case_id": "1963_277",
  "_label": 0,
  "_text_length": 23459,
  "_extracted_at": "2026-02-10T19:51:09.046773"
}