{
  "metadata": {
    "case_name": "State of U.P. v. Jogendra Singh",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 301 of 1961",
    "date_of_judgment": "1963-03-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent Jogendra Singh was appointed a Naib Tehsildar under the appellant, the State of U. P. in the year 1937.",
      "type": "background",
      "date": "1937",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On August 4, 1952, he was suspended as complaints had been received against him and an enquiry into the said complaints was contemplated.",
      "type": "procedural",
      "date": "1952-08-04",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Accordingly, charges were framed against him and his case was referred for investigation to the Administrative Tribunal appointed under the Rules. The Tribunal held an enquiry and exonerated the respondent from the charges framed against him, in August 1953.",
      "type": "procedural",
      "date": "1953-08",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "While the proceedings before the Tribunal were pending, additional complaints were received by the appellant against the respondent's conduct, and they were communicated by the appellant to the Tribunal with an intimation that the appellant proposed to send those further charges against the respondent for enquiry.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Tribunal did not wait for receipt of the said additional charges because it was asked by the government to proceed with the charge already with it and concluded its enquiry.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On October 28, 1955, the respondent was again suspended and charges framed on the additional complaints received against him were delivered to him on October 29, 1956.",
      "type": "procedural",
      "date": "1955-10-28",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On November 12, 1956, the respondent submitted his explanation and pleaded that in case the appellant wanted to pursue the enquiry against him, it might be entrusted to the Administrative Tribunal in accordance with the Rules.",
      "type": "procedural",
      "date": "1956-11-12",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "On June 28, 1958, the Deputy Secretary, Board of Revenue, U. P., informed the respondent that in accordance with the orders passed by the appellant his case had been entrusted to the Commissioner, Gorakhpur Division, with directions to take disciplinary proceedings against him, and his request that the charges against him should be entrusted for investigation to the Administrative Tribunal had been rejected.",
      "type": "procedural",
      "date": "1958-06-28",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Thereupon, the respondent filed a writ petition in the High Court of judicature at Allahabad on July 14, 1958, and prayed that a writ, or a direction or an appropriate order should be passed against the appellant quashing the proceedings intended to be taken against him before the enquiring officer appointed by the appellant under Rule 55 of the Civil Services (Classification, Control and Appeal) Rules.",
      "type": "procedural",
      "date": "1958-07-14",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The learned single judge who heard the writ petition held that the respondent being a gazetted officer, the appellant was bound to grant his request that the enquiry against him should be held by the Administrative Tribunal appointed under the Rules. That is why the writ petition was allowed and the order directing the enquiry to be held by the appointed authority under Rule 55 of the said Civil Services Rules was quashed.",
      "type": "procedural",
      "date": "1960-03-10",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "This order was challenged by the appellant by an appeal under the Letters Patent before a Division Bench of the said High Court. The Division Bench agreed with the view taken by the learned single judge and dismissed the appeal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The appellant then applied for and obtained a certificate from the said High Court and it is with the said certificate that it has come to this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "The short point of law which arises in this appeal relates to the construction of Rule 4(2) of the Uttar Pradesh Disciplinary Proceedings (Administrative Tribunal) Rules, 1947. Whether the word 'may' in Rule 4(2) confers discretion on the Governor, or does it mean 'shall' or 'must' obliging the Governor to refer the case of a gazetted government servant to the Tribunal upon his request.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Mr. Hajela for the appellant contends that the conclusion reached by the Courts below is not supported on a fair and reasonable construction of Rule 4(2) of the Rules. The appellant's case is that in the State of U. P. it is competent to the Governor to direct that disciplinary proceedings against the officers specified in Rule 4 of the Rules should be tried before an Administrative officer, but there is no obligation on the Governor in that behalf. The Governor may, if he so decides direct that the said enquiry may be held under Rule 55 of the Civil Services Rules and conducted by an appropriate authority appointed in that behalf. Whether the enquiry should be held by the Administrative Tribunal, or by an appropriate authority, is a matter entirely within the discretion of the Governor.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Rule 4(2) of the Uttar Pradesh Disciplinary Proceedings (Administrative Tribunal) Rules, 1947"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The respondent pleaded that in case the appellant wanted to pursue the enquiry against him, it might be entrusted to the Administrative Tribunal in accordance with the Rules. The High Court held that so far as cases of gazetted government servants are concerned, they are covered by Rule 4(2) of the Rules and on a fair construction of the said Rule, it is clear that if gazetted government servant requests that the enquiry against him should be held by the Administrative Tribunal, the Governor is bound to grant his request.",
      "supporting_facts": [
        "f7",
        "f10",
        "f11"
      ],
      "legal_basis": "Rule 4(2) of the Uttar Pradesh Disciplinary Proceedings (Administrative Tribunal) Rules, 1947"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 4(1) confers discretion on the Governor to refer to the Tribunal cases falling under clauses (a) to (d) in respect of servants specified by the first part of sub-rule (1). In regard to these cases, the government servant concerned cannot claim that the enquiry against him should not be held by a Tribunal and the matter falls to be decided solely in the discretion of the Governor. Rule 4(2) deals with the class of gazetted government servants and gives them the right to make a request to the Governor that their cases should be referred to the Tribunal in respect of matters specified in clauses (a) to (d) of sub-rule (1).",
      "addresses_issue": "i1",
      "key_observation": "Gazetted government servants are included in sub-rule (1), so if Rule 4(1) had stood by itself, even gazetted government servants would have no right to claim that the enquiry against them should not be held by a Tribunal."
    },
    {
      "id": "cr2",
      "text": "The word 'may' generally does not mean must or shall. But it is well settled that the word 'may' is capable of meaning must or shall in the light of the context. It is also clear that where a discretion is conferred upon a public authority coupled with an obligation, the word 'may' which denotes discretion should be construed to mean a command.",
      "addresses_issue": "i1",
      "key_observation": "Sometimes, the legislature uses the word 'may' out of deference to the high status of the authority on whom the power and the obligation are intended to be conferred and imposed."
    },
    {
      "id": "cr3",
      "text": "In the present case, it is the context which is decisive. The whole purpose of rule 4(2) would be frustrated if the word 'may' in the said rule receives the same construction as in sub-rule (1). It is because in regard to gazetted government servants the discretion had already been given to the Governor to refer their cases to the tribunal that the rule-making authority wanted to make a special provision in respect of them as distinguished from other government servants falling under rule 4(1) and rule 4(2) has been prescribed, otherwise rule 4(2) would be wholly redundant.",
      "addresses_issue": "i1",
      "key_observation": "The plain and unambiguous object of enacting rule 4(2) is to provide an option to the gazetted government servants to request the Governor that their cases should be tried by a Tribunal and not otherwise."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rule 4(2) imposes an obligation on the Governor to grant a request made by the gazetted government servant that his case should be referred to the Tribunal under the Rules.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Uttar Pradesh Disciplinary Proceedings (Administrative Tribunal) Rules, 1947",
      "sections": [
        "Rule 4(1)",
        "Rule 4(2)"
      ],
      "relevance": "Governs reference of disciplinary cases to the Tribunal; Rule 4(1) discretionary for specified matters, Rule 4(2) obliges Governor to refer gazetted servant's case to Tribunal on his request."
    },
    {
      "name": "Civil Services (Classification, Control and Appeal) Rules",
      "sections": [
        "Rule 55"
      ],
      "relevance": "Alternative procedure for enquiry by appointed authority, which was sought to be used but quashed as violative of Rule 4(2)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The High Court was right in quashing the proceedings proposed to be taken by the appellant against the respondent otherwise than by referring his case to the Tribunal under the Rules, as such a request was admittedly made by the respondent and has not been granted.",
    "relief_granted": "Writ petition allowed; order directing enquiry by Commissioner quashed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The whole purpose of rule 4(2) would be frustrated if the word 'may' in the said rule receives the same construction as in sub-rule (1).",
      "speaker": "court",
      "significance": "Explains contextual interpretation making 'may' mandatory in Rule 4(2)."
    },
    {
      "text": "The plain and unambiguous object of enacting rule 4(2) is to provide an option to the gazetted government servants to request the Governor that their cases should be tried by a Tribunal and not otherwise.",
      "speaker": "court",
      "significance": "Core holding on the purpose and effect of Rule 4(2)."
    },
    {
      "text": "It is well settled that the word 'may' is capable of meaning must or shall in the light of the context.",
      "speaker": "court",
      "significance": "Principle of statutory interpretation applied to resolve the issue."
    }
  ],
  "_case_id": "1963_44",
  "_label": 0,
  "_text_length": 9065,
  "_extracted_at": "2026-02-10T19:47:36.614212"
}