{
  "metadata": {
    "case_name": "Ananda Bazar Patrika (P) Ltd. v. Its Workmen",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 633 of 1962",
    "date_of_judgment": "1963-05-07"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is Ananda Bazar Patrika (P) Ltd., carries on business of printing and publishing newspapers: Ananda Bazar Patrika (Bengali Daily), Desh (Bengali Weekly), Hindustan Standard (English daily).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Mr. Pulakesh De Sarkar appointed as journalist by appellant's management in March 1940, worked continuously until discharged on May 15, 1958.",
      "type": "background",
      "date": "1940-03",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Union of appellant's employees took up discharge of Mr. Sarkar, raised industrial dispute alleging illegal discharge, entitlement to reinstatement and/or compensation.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Dispute referred by Government of West Bengal to Second Labour Court on September 25, 1958.",
      "type": "procedural",
      "date": "1958-09-25",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Labour Court award dated December 8, 1959: directed appellant to reinstate Mr. Sarkar and pay emoluments for period of forced unemployment, with adjustment for amounts paid on January 27, 1959.",
      "type": "procedural",
      "date": "1959-12-08",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "On December 16, 1957, Chief Reporter Mr. Shibdas Bhattacharjee proceeded on leave, appointed Mr. Madhusudan Chakravorty as Acting Chief Reporter temporarily, wrote letter to Managing Director with copies to Editor, News Editor, Chief Accountant, Reporting Department, and copy hung on Notice Board of Reporting Section.",
      "type": "material",
      "date": "1957-12-16",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Mr. Sarkar took exception to arrangement, interviewed Managing Director requesting cancellation; MD explained it was at instance of Accounts Department for financial transactions documentation.",
      "type": "material",
      "date": "1957-12",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Mr. Sarkar wrote letter to Managing Director on December 20, 1957, taking strong exception to arrangement and Mr. Bhattacharjee's letter, stated he would decide his own assignments 'standing on my own right and merit' until Chief Reporter resumes; copy hung on Notice Board, sent to Editor, News Editor, Reporting Department.",
      "type": "material",
      "date": "1957-12-20",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Mr. Sarkar ignored assignments allotted by Acting Chief Reporter Mr. Chakravorty.",
      "type": "disputed",
      "date": "1957-12-16 to 1957-12-31",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Managing Director wrote to Mr. Sarkar on December 31, 1957, calling upon him to show cause why action should not be taken for gross misconduct and subversive conduct.",
      "type": "procedural",
      "date": "1957-12-31",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Mr. Sarkar told MD he was willing to remove his letter from Notice Board, gave account of self-assigned work from December 16 to 31, 1957.",
      "type": "material",
      "date": "1957-12-31",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Acting Chief Reporter complained to MD that Mr. Sarkar ignored assignments.",
      "type": "material",
      "date": "1957-12",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Managing Director wrote to Mr. Sarkar on January 11, 1958, calling upon him to show cause why he should not be dismissed for insubordination due to defiant attitude.",
      "type": "procedural",
      "date": "1958-01-11",
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Mr. Sarkar gave elaborate explanation of his conduct on January 12, 1958.",
      "type": "material",
      "date": "1958-01-12",
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Managing Director informed Mr. Sarkar on January 29, 1958, that enquiry would be held by Mr. S.K. Basu (Editor of Hindustan Standard) on February 1, 1958 at 1 P.M.",
      "type": "procedural",
      "date": "1958-01-29",
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Mr. Basu held enquiry into charges: whether Mr. Sarkar flouted lawful orders of Acting Chief Reporter. Mr. Sarkar cross-examined witnesses elaborately and gave evidence.",
      "type": "procedural",
      "date": "1958-02-01",
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Enquiry officer Mr. Basu concluded on April 14, 1958, that Mr. Sarkar guilty of deliberate disobedience of lawful orders of properly appointed Acting Chief Reporter.",
      "type": "material",
      "date": "1958-04-14",
      "source": "petitioner"
    },
    {
      "id": "f18",
      "text": "Management considered report and evidence, concluded Mr. Sarkar guilty of gross misconduct deserving dismissal, but due to long service, decided to discharge him.",
      "type": "material",
      "date": "1958-05",
      "source": "petitioner"
    },
    {
      "id": "f19",
      "text": "Management terminated Mr. Sarkar's services with effect from May 16, 1958, by letter dated May 15, 1958; given one month's pay in lieu of notice, advised to collect dues including wages, gratuity, PF informed.",
      "type": "material",
      "date": "1958-05-15",
      "source": "petitioner"
    },
    {
      "id": "f20",
      "text": "Appellant paid some moneys to Mr. Sarkar on January 27, 1959.",
      "type": "procedural",
      "date": "1959-01-27",
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Labour Court held enquiry not fair, not in accordance with natural justice: Mr. Basu did not allow examination of even single witness (Editor), disallowed relevant questions, punishment too severe, no consultation with Editor; acted mala fide; Bhattacharjee not authorised to appoint Chakravorty; Mr. Sarkar's explanation reasonable; ordered reinstatement.",
      "type": "material",
      "date": "1959-12-08",
      "source": "lower_court"
    },
    {
      "id": "f22",
      "text": "Mr. Sarkar wanted to examine only one witness, the Editor, at enquiry; Mr. Basu refused as irrelevant to narrow issue.",
      "type": "disputed",
      "date": "1958-02-01",
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Argument before Labour Court: enquiry officer outsider, void ab initio (overruled); Mr. Basu bore malice due to Provident Fund agitation where Mr. Sarkar active, trustees (incl. Basu, MD) criticised for loan to management, settled March 7/9, 1957 (Labour Court rejected).",
      "type": "disputed",
      "date": "1957-03",
      "source": "respondent"
    },
    {
      "id": "f24",
      "text": "Practice: Chief Reporter nominates successor during absence; Accounts Dept insists on written authorisation for financial transactions; verbal formerly.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f25",
      "text": "Mr. Chakravorty previously acted as Acting Chief Reporter on several occasions when Chief Reporter on leave.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the domestic enquiry conducted by Mr. Basu was fair and in accordance with rules of natural justice.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the management acted maliciously, vindictively, or with mala fides in discharging Mr. Sarkar.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Mr. Bhattacharjee was authorised to appoint Mr. Chakravorty as Acting Chief Reporter.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Extent of jurisdiction of Labour Court/Tribunal: can it interfere if domestic enquiry proper and conclusions not perverse.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Domestic enquiry proper, held in accordance with natural justice, conclusions not perverse; Labour Court cannot consider merits or propriety.",
      "supporting_facts": [
        "f16",
        "f17",
        "f22"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No mala fides or victimisation; refusal to examine Editor justified as irrelevant; questions disallowed irrelevant/unfair; no duty to consult Editor on punishment; discharged instead of dismissed considering long service.",
      "supporting_facts": [
        "f15",
        "f18",
        "f19",
        "f22"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Mr. Bhattacharjee authorised per practice: Chief Reporter nominates during absence, Accounts Dept requires writing; Chakravorty previously acted.",
      "supporting_facts": [
        "f6",
        "f7",
        "f24",
        "f25"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "No evidence of malice from Provident Fund incident.",
      "supporting_facts": [
        "f23"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Enquiry unfair: not allowed to examine witnesses (Editor), relevant questions disallowed; punishment too severe without consulting Editor; mala fides.",
      "supporting_facts": [
        "f21",
        "f22"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Mr. Bhattacharjee not authorised to appoint Acting Chief Reporter; Editor in charge.",
      "supporting_facts": [
        "f6",
        "f21"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Mr. Sarkar's letter removed upon management's exception; explanation reasonable; not justified to take action.",
      "supporting_facts": [
        "f8",
        "f11",
        "f21"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Malice due to Mr. Sarkar's role in Provident Fund agitation against trustees (Basu, MD).",
      "supporting_facts": [
        "f23"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Jurisdiction of Labour Court/Tribunal settled: cannot interfere if proper domestic enquiry per natural justice, non-perverse conclusions, unless mala fides/victimisation.",
      "addresses_issue": "i4",
      "key_observation": "Labour Court wrongly held enquiry unfair and mala fides."
    },
    {
      "id": "cr2",
      "text": "Enquiry fair: Mr. Sarkar wanted only Editor as witness, irrelevant to issue of disobeying Acting Chief Reporter; full cross-examination allowed; disallowed questions irrelevant/unfair.",
      "addresses_issue": "i1",
      "key_observation": "No caprice or mala fides in refusals."
    },
    {
      "id": "cr3",
      "text": "No duty to consult Editor on punishment; discharged not dismissed considering long service shows fairness.",
      "addresses_issue": "i2",
      "key_observation": "No mala fides."
    },
    {
      "id": "cr4",
      "text": "No evidence of malice from Provident Fund; Mr. Sarkar overrates his role.",
      "addresses_issue": "i2",
      "key_observation": "Labour Court rightly rejected."
    },
    {
      "id": "cr5",
      "text": "Mr. Bhattacharjee authorised per practice/evidence: nominates successor, Accounts requires writing; MD confirmed; previous instances.",
      "addresses_issue": "i3",
      "key_observation": "Mr. Sarkar not justified in militant attitude; even if grievance, should not ignore orders."
    },
    {
      "id": "cr6",
      "text": "Findings of no mala fides/unfair enquiry mean Labour Court had no jurisdiction on merits.",
      "addresses_issue": "i1",
      "key_observation": "Victimisation finding not casual; no evidence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "If termination follows proper domestic enquiry per natural justice, non-perverse conclusions, no mala fides, Tribunal cannot interfere with conclusions or order.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Domestic enquiry fair; no mala fides; Mr. Bhattacharjee authorised; Mr. Sarkar guilty of misconduct.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Appeal succeeds; Labour Court award set aside.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, Labour Court award directing reinstatement and back wages set aside; no interference justified as domestic enquiry proper, no mala fides.",
    "relief_granted": "None to respondent; discharge upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The extent of the jurisdiction which a Labour Court or an industrial Tribunal can exercise in dealing with such disputes is well-settled. If the termination of an industrial employees services has been proceeded by a proper domestic enquiry which has been held in accordance with the rules of natural justice and the conclusions reached at the said enquiry are not perverse the Tribunal is not entitled to consider the propriety or the correctness of the said conclusions.\"",
      "speaker": "court",
      "significance": "Defines limits of Tribunal jurisdiction in domestic enquiries."
    },
    {
      "text": "\"We have repeatedly pointed out that though industrial adjudication can and must protect industrial employees from victimisation, a finding as to mala fides or victimisation should be drawn only where evidence has been led to justify it such a finding should not be made either in a casual manner or lightheartedly.\"",
      "speaker": "court",
      "significance": "Caution against casual findings of mala fides."
    },
    {
      "id": "kq3",
      "text": "\"In the result, the appeal succeeds and the order passed by the Labour Court is set aside.\"",
      "speaker": "court",
      "significance": "Final disposition of the case."
    }
  ],
  "_case_id": "1963_65",
  "_label": 1,
  "_text_length": 25277,
  "_extracted_at": "2026-02-10T19:48:28.360067"
}