{
  "metadata": {
    "case_name": "Appellant v. State",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "AYYANGAR J."
    ],
    "case_number": "Criminal Appeal No. 3 of 1962",
    "date_of_judgment": "1963-07-31"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The wall of the latrine of the house of the deceased had fallen down about a week prior to the day of the occurrence-July 16, 1959, with the result that her latrine had become exposed to public view.",
      "type": "background",
      "date": "1959-07-09",
      "source": "courts_below"
    },
    {
      "id": "f2",
      "text": "Consequently the deceased among others, started using the latrine of the accused.",
      "type": "background",
      "date": "1959-07-09",
      "source": "courts_below"
    },
    {
      "id": "f3",
      "text": "The accused resented this and made it clear to them that they did not have his permission to use it and protested against their coming there.",
      "type": "background",
      "date": null,
      "source": "courts_below"
    },
    {
      "id": "f4",
      "text": "The oral warnings proved ineffective.",
      "type": "background",
      "date": null,
      "source": "courts_below"
    },
    {
      "id": "f5",
      "text": "The accused fixed up a copper wire across the passage leading up to his latrine.",
      "type": "material",
      "date": null,
      "source": "courts_below"
    },
    {
      "id": "f6",
      "text": "This wire was naked and uninsulated and carried current from the electrical wiring of his house to which it was connected.",
      "type": "material",
      "date": null,
      "source": "courts_below"
    },
    {
      "id": "f7",
      "text": "There was no warning that the wire was live.",
      "type": "material",
      "date": null,
      "source": "courts_below"
    },
    {
      "id": "f8",
      "text": "The deceased managed to pass into the latrine without contacting the wire but that as she came out her hand happened to touch it and she got a shock as a result of which she died soon after.",
      "type": "material",
      "date": "1959-07-16",
      "source": "courts_below"
    },
    {
      "id": "f9",
      "text": "The voltage of the current passing through the naked wire being high enough to be lethal.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "At the time of the accident it was past day break and there was therefore enough light.",
      "type": "disputed",
      "date": "1959-07-16",
      "source": "accused"
    },
    {
      "id": "f11",
      "text": "An electric light was burning some distance away.",
      "type": "disputed",
      "date": "1959-07-16",
      "source": "accused"
    },
    {
      "id": "f12",
      "text": "The accused was also charged before the learned Sessions Judge with an offence under section 304 of the Indian Penal Code but on the finding that the accused had no intention to cause the death of the deceased he was acquitted of that charge.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the accused was guilty of an offence under s. 304A of the Indian Penal Code for causing the death of Mst. Madilen by a rash or negligent act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the accused had a right of private defence of property under s. 97 IPC subject to s. 99, justifying the act.",
      "framed_by": "high_court"
    },
    {
      "id": "i3",
      "text": "Whether the deceased was a trespasser to whom no duty was owed, and thus the act was neither a tort nor a crime.",
      "framed_by": "appellant"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The accused had a right of private defence of property and that the death was caused in the course of the exercise of that right.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "s. 97 of the Indian Penal Code subject to s. 99 and s. 103"
    },
    {
      "id": "pa2",
      "text": "The deceased had been sufficiently warned: at the time of the accident it was past day break with enough light, and an electric light was burning some distance away.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "The deceased was a trespasser and there was no duty owed by an occupier like the accused towards the trespasser; therefore no cause of action for damages, and if not a tort, could not be a crime.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Common Law principle outside IPC"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "On these facts the Courts below held that the accused was guilty of an offence under s. 304A IPC: Whoever causes the death of any person by doing any rash or negligent act not amounting to culpable homicide shall be punished...",
      "addresses_issue": "i1",
      "key_observation": "Charging the naked wire with lethal voltage was a rash act done in reckless disregard of serious consequences."
    },
    {
      "id": "cr2",
      "text": "Neither daylight nor nearby light constitutes warning as conditions of the wire being charged could not be detected merely by lighting.",
      "addresses_issue": "i1",
      "key_observation": "No effective warning provided."
    },
    {
      "id": "cr3",
      "text": "The right of private defence of property is subject to s. 99 IPC; the type of injury caused by the trap cannot be brought within s. 99 or s. 103.",
      "addresses_issue": "i2",
      "key_observation": "Defence repelled correctly."
    },
    {
      "id": "cr4",
      "text": "IPC defines crimes and defences with particularity; cannot invoke Common Law principles outside the Code to treat a statutory crime as permissible.",
      "addresses_issue": "i3",
      "key_observation": "Improper to import external principles."
    },
    {
      "id": "cr5",
      "text": "A trespasser is not an outlaw; occupier cannot inflict personal injury by direct violence or indirectly by traps likely to cause serious injury.",
      "addresses_issue": "i3",
      "key_observation": "Setting naked live wire is like spring-gun trap, actionable wrong."
    },
    {
      "id": "cr6",
      "text": "Occupier owes no duty of care to trespasser but cannot set traps designed to do bodily harm or act calculated to do so; e.g., no man-traps or spring guns.",
      "addresses_issue": "i3",
      "key_observation": "This is no more than ordinary civilised behaviour."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Accused guilty under s. 304A IPC as act was rash and negligent.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No right of private defence applies to such a lethal trap.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Act constitutes both tort and crime; occupier cannot set lethal traps for trespassers.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "English cases on spring-guns",
      "citation": null,
      "treatment": "followed",
      "relevance": "One who sets spring-guns to shoot at trespassers is guilty of a tort; laying such trap is arrangement to shoot without firing."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "304A",
        "304",
        "97",
        "99",
        "103"
      ],
      "relevance": "Defines offence of causing death by rash/negligent act; right of private defence subject to limitations; trap injury not within scope."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave against Patna High Court judgment dismissing appeal against conviction and sentence under s. 304A IPC by Sessions Judge upheld; conviction and sentence affirmed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Whoever causes the death of any person by doing any rash or negligent act not amounting to culpable homicide shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.\"",
      "speaker": "court",
      "significance": "Defines the offence under s. 304A IPC applied to facts."
    },
    {
      "text": "\"The trespasser enters entirely at his own risk, but the occupier must not set traps designed to do him bodily harm or to do any act calculated to do bodily harm to the trespasser whom he knows to be or who to his knowledge is likely to be on his premises.\"",
      "speaker": "court",
      "significance": "Summarises UK Law Reform Committee position adopted; key to rejecting no-duty argument."
    },
    {
      "text": "\"This is no more than ordinary civilised behaviour.\"",
      "speaker": "court",
      "significance": "Crux of holding that lethal traps impermissible even against trespassers."
    }
  ],
  "_case_id": "1963_230",
  "_label": 0,
  "_text_length": 7890,
  "_extracted_at": "2026-02-10T19:50:17.589874"
}