{
  "metadata": {
    "case_name": "State of Orissa & Anr. v. Tulloch & Co. Private Ltd. & Anr.",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Ayyangar J."
    ],
    "case_number": "Civil Appeals No. 561 and 562 of 1962",
    "date_of_judgment": "1963-08-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent Tulloch Co. Private Ltd., a company incorporated under the Indian Companies Act, works a manganese mine in the State of Orissa under a lease granted by that State under the provisions of the Mines & Minerals (Development & Regulation) Act, 1948 (Central Act 53 of 1948), and the rules made thereunder.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "State Legislature of Orissa passed the Orissa Mining Areas Development Fund Act, 1952 (Orissa Act 27 of 1952), constituting certain areas as mining areas and empowering the State Government to levy a fee on a percentage of the value of the mined ore at the pit's mouth for development of mining areas.",
      "type": "material",
      "date": "1952",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "State Government took necessary steps to bring provisions of Orissa Act into operation and made demands on the respondent on August 1, 1960, for payment of fees due for the period July 1957 to March 1958.",
      "type": "material",
      "date": "1960-08-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent filed petition O.J.C. 142 of 1960 before Orissa High Court under Art. 226 praying for writ of mandamus restraining appellants (State of Orissa and Administrator) from applying Orissa Act and directing cancellation of notices of demand.",
      "type": "procedural",
      "date": "1960",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Orissa High Court allowed the writ petition by judgment dated April 18, 1961, holding Orissa Act superseded by Central Act 67 of 1957 effective from June 1, 1958.",
      "type": "procedural",
      "date": "1961-04-18",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "High Court granted certificate under Art. 132(1) of Constitution, leading to these appeals.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Similar facts in Civil Appeal No. 562 of 1962 with no material difference.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Fees in question accrued for six quarters from September 30, 1956, to March 31, 1958.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Orissa Mining Areas Development Fund Act, 1952, continues to be operative and whether fees leviable thereunder remain exigible after the coming into force of the Mines and Minerals (Regulation and Development) Act, 1957 (Central Act 67 of 1957) on June 1, 1958.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether demands for fees accrued prior to June 1, 1958, under the Orissa Act can be enforced notwithstanding its supersession by the Central Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Object and purposes of Orissa Act (providing amenities to labour in mining areas) distinct from Central Act (development of mineral resources); no common field covered, so State Act continues.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Entry 23 State List; Entry 54 Union List"
    },
    {
      "id": "pa2",
      "text": "Even if fields overlap, no repugnancy until Central Government makes rules under Central Act covering same purposes.",
      "supporting_facts": [],
      "legal_basis": "Section 18 Central Act; Tika Ramji v. State of U.P."
    },
    {
      "id": "pa3",
      "text": "Power to levy fees is independent under Entry 66 State List / Entry 96 Union List, not affected by Central Act under Entry 54.",
      "supporting_facts": [],
      "legal_basis": "Entries 66 State List, 96 Union List"
    },
    {
      "id": "pa4",
      "text": "Central Act not retrospective; fees accrued prior to June 1, 1958, remain recoverable; s.6 General Clauses Act applies to implied repeal.",
      "supporting_facts": [
        "f3",
        "f8"
      ],
      "legal_basis": "Section 6 General Clauses Act, 1897"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Central Act covers entire field of mineral development via declaration in s.2 and s.18(1), including provision of amenities to stimulate mining; Orissa Act superseded.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "Entry 54 Union List; Section 18 Central Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "State legislative power under Entry 23 State List subject to Union control via Entry 54; Central Act's declaration withdraws State's competence to extent of control assumed.",
      "addresses_issue": "i1",
      "key_observation": "States lose competence only to extent Parliament declares Union control expedient."
    },
    {
      "id": "cr2",
      "text": "Orissa Act for constituting mining areas and fund for amenities; Central Act covers regulation of mines and development of minerals, including via rules under ss.13,18.",
      "addresses_issue": "i1",
      "key_observation": "Central Act covers field of Orissa Act."
    },
    {
      "id": "cr3",
      "text": "Hingir-Rampur Coal Co. v. State of Orissa concludes that declaration in Central Act covers field of conservation and development of minerals, rendering Orissa Act ineffective without need for rules.",
      "addresses_issue": "i1",
      "key_observation": "No need for rules to make declaration effective; test is whether declaration covers field."
    },
    {
      "id": "cr4",
      "text": "Fees power not independent if subject-matter (mineral development) taken over by Union; no matter in State List left for fee.",
      "addresses_issue": "i1",
      "key_observation": "Fee must relate to matter in List."
    },
    {
      "id": "cr5",
      "text": "Supersession by Central Act is implied repeal; s.6 General Clauses Act applies as legislative intent to supersede implies same as express repeal; past accrued liabilities survive.",
      "addresses_issue": "i2",
      "key_observation": "Principle of continuance of accrued rights applies to implied repeals."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Orissa Act superseded by Central Act from June 1, 1958, due to Parliamentary declaration covering field of mineral development.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Past dues under Orissa Act accrued before June 1, 1958, remain recoverable as s.6 General Clauses Act saves accrued liabilities even in implied repeal.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hingir-Rampur Coal Co. Ltd. v. State of Orissa",
      "citation": "1961 2 S.C.R. 537",
      "treatment": "followed",
      "relevance": "Holds that Parliamentary declaration under Entry 54 covers field of mineral development/conservation, excluding State competence without need for rules."
    },
    {
      "case_name": "Keshavan Madhava Menon v. State of Bombay",
      "citation": "1951 S.C.R. 228",
      "treatment": "referred",
      "relevance": "Discusses effect of law becoming void under Constitution; past closed transactions survive."
    },
    {
      "case_name": "Tika Ramji v. State of Uttar Pradesh",
      "citation": "1956 S.C.R. 393",
      "treatment": "distinguished",
      "relevance": "Repugnancy requires actual conflict, not possibility; distinguished as here declaration covers entire field."
    },
    {
      "case_name": "Trust Mai Lachhmi Sialkoti Bradari v. Chairman, Amritsar Improvement Trust",
      "citation": "1963 1 S.C.R. 242",
      "treatment": "referred",
      "relevance": "Point on implied repeal left open."
    }
  ],
  "statutes_cited": [
    {
      "name": "Orissa Mining Areas Development Fund Act, 1952 (Orissa Act 27 of 1952)",
      "sections": [
        "3",
        "4",
        "5"
      ],
      "relevance": "Empowers constitution of mining areas, levy of fee up to 5% of mineral value for development fund and amenities."
    },
    {
      "name": "Mines and Minerals (Regulation and Development) Act, 1957 (Central Act 67 of 1957)",
      "sections": [
        "2",
        "13",
        "18",
        "25"
      ],
      "relevance": "Declares Union control over regulation/development of mines/minerals; empowers rules for fees, development."
    },
    {
      "name": "Mines & Minerals (Development & Regulation) Act, 1948 (Central Act 53 of 1948)",
      "sections": [
        "2",
        "6"
      ],
      "relevance": "Predecessor Act with similar declaration; amended by 1957 Act."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "246",
        "Art. 132(1)",
        "Art. 226",
        "Entry 23 State List",
        "Entry 54 Union List",
        "Entry 66 State List",
        "Entry 96 Union List"
      ],
      "relevance": "Distributes legislative powers; State power subject to Union declaration."
    },
    {
      "name": "General Clauses Act, 1897",
      "sections": [
        "6"
      ],
      "relevance": "Saves accrued rights/liabilities on repeal, including implied repeal."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; High Court writ petitions dismissed. Orissa Act superseded from June 1, 1958, but State entitled to recover fees accrued prior thereto via notices of demand dated August 1, 1960.",
    "relief_granted": "Appellants (State) permitted to enforce past fee demands; no injunction against recovery.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is hereby declared that it is expedient in the public interest that the Union should take under its control the regulation of mines and the development of minerals to the extent hereinafter provided.\"",
      "speaker": "court",
      "significance": "Declaration in s.2 Central Act 1957 triggering Union control under Entry 54."
    },
    {
      "text": "\"In order that the declaration should be effective it is not necessary that rules should be made or enforced; all that is required is a declaration by Parliament that it is expedient in the public interest to take the regulation and development of mines under the control of the Union.\"",
      "speaker": "court",
      "significance": "From Hingir-Rampur; no need for rules to exclude State power."
    },
    {
      "text": "\"The effect of reading the two Entries together is clear. The jurisdiction of the State Legislature under Entry 23 is subject to the limitation imposed by the latter part of the said Entry.\"",
      "speaker": "court",
      "significance": "Explains interplay of Entries 23 and 54."
    }
  ],
  "_case_id": "1963_127",
  "_label": 1,
  "_text_length": 49105,
  "_extracted_at": "2026-02-10T19:49:05.508165"
}