{
  "metadata": {
    "case_name": "Hukma Ram v. State of Rajasthan",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Das Gupta J."
    ],
    "case_number": "Criminal Appeal No. 152 of 1962",
    "date_of_judgment": "1963-08-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On receipt of information that gold smuggled from Pakistan was being carried, Lal Singh, Sub-Inspector of the Check-post of Barmer, followed the appellant into a railway train at Luni railway station.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "In the running train between stations of Kerla and Pali, Lal Singh searched appellant's person and found 286 tolas of gold in a pouli under his trousers.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Gold seized consisted of six blocks bearing marks 999, N. M. Rothschild Sons, 22 bars bearing marks 999, 3 small pieces of gold and one pair of murkies.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Lal Singh seized the gold after preparing a seizure list (Exh. P.3) in presence of witnesses and produced appellant along with gold before Superintendent, Land Customs, Barmer.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "By order of Collector of Customs, New Delhi dated July 19, 1957, gold was confiscated and fine of Rs. 10,000 imposed on appellant.",
      "type": "procedural",
      "date": "1957-07-19",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Criminal proceedings instituted against appellant for offence under s.167(81) Sea Customs Act, 1878.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Trial court acquitted appellant, holding prosecution failed to prove recovery, Lal Singh had no authority to search/seize, seizure not under Land Customs Act, and not convinced gold was smuggled.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Rajasthan High Court set aside acquittal, convicted appellant under s.167(81) Sea Customs Act, sentenced to rigorous imprisonment for one year.",
      "type": "procedural",
      "date": "1962-04-04",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Defence plea: No gold recovered from appellant.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Defence witness Poonam Chand stated police searched compartment enroute Luni to Pali, searched Hukma Ram and others, no gold from Hukma Ram but purse recovered in compartment.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Defence examined Pukh Raj s/o Basti Mal, resident Ajit, claiming to be only Pukh Raj in village; seizure list mentioned Pukh Raj s/o Awasthi Mal.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Appellant, a railway pointsman, suggested Lal Singh inimically disposed as he once refused to serve water promptly.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Notification appointing Land Customs Officers: Officers of Rajasthan Civil Police and Armed Constabulary of and above Head Constable rank in Districts of Barmer, Bikaner, Ganganagar, Jaisalmer, Jalore appointed Land Customs Officers for areas adjoining Land Customs Frontiers separating West Pakistan from India, within jurisdiction of Collector of Land Customs, Delhi.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether High Court was justified in disturbing trial court's finding that seizure of gold from accused had not been proved.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether Lal Singh had authority to seize gold at the place of seizure (in running train between Kerla and Pali).",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether prosecution proved mens rea necessary for offence under s.167(81) Sea Customs Act, even if s.178A applied and gold was smuggled.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court not justified in disturbing trial court's finding that seizure not proved, as prosecution failed to examine search witnesses named in seizure memo Exh. P.3.",
      "supporting_facts": [
        "f4",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Lal Singh not a Customs Officer for place of seizure; notification gives authority only for areas few miles from border or only within listed districts (not including seizure place).",
      "supporting_facts": [
        "f2",
        "f13"
      ],
      "legal_basis": "Land Customs Act, 1924 s.3; Notification"
    },
    {
      "id": "pa3",
      "text": "Even if s.178A applies and gold smuggled, prosecution failed to prove mens rea (knowingly carrying to evade prohibition).",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Sea Customs Act, 1878 s.167(81), s.178A"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Gold smuggled; under s.178A burden on accused to prove not smuggled; proved by evidence.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Sea Customs Act s.178A"
    },
    {
      "id": "ra2",
      "text": "Even apart from s.178A, guilt proved by confession before Deputy Superintendent Land Customs, corroborated by recovery.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Prosecution evidence of Lal Singh detailed and credible; defence witness Poonam Chand supports search and recovery in compartment (purse found, no suggestion others searched); no reason to falsely implicate appellant over real culprit; witnesses likely gained over; recovery proved.",
      "addresses_issue": "i1",
      "key_observation": "Lal Singh's evidence along with Poonam Chand's unwittingly supports prosecution story."
    },
    {
      "id": "cr2",
      "text": "Notification appoints listed officers as Land Customs Officers for entire areas adjoining West Pakistan frontier within jurisdiction of Collector Land Customs Delhi (covering Punjab, J&K, Rajasthan etc.); 'adjoining' not restricted to few miles or districts; Lal Singh (Barmer officer) competent everywhere in jurisdiction including seizure place.",
      "addresses_issue": "i2",
      "key_observation": "Entire Rajasthan adjoins frontier; jurisdiction co-extensive with Collector's."
    },
    {
      "id": "cr3",
      "text": "s.178A shifts burden on smuggled gold; accused failed to discharge; circumstances (concealed manner, quantity 286 tolas ~3kg, form in blocks/bars, appellant railway pointsman) prove knowledge and intent to evade import prohibition.",
      "addresses_issue": "i3",
      "key_observation": "Circumstances establish mens rea beyond doubt."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Seizure of gold from appellant proved.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Lal Singh authorised to seize under Land Customs Act notification; s.178A Sea Customs Act applies.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "All ingredients of offence u/s 167(81) Sea Customs Act proved, including mens rea.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Sea Customs Act, 1878",
      "sections": [
        "s.167(81)",
        "s.178A"
      ],
      "relevance": "Offence of knowingly dealing with smuggled gold; presumption and burden on accused to prove gold not smuggled; mens rea required separately."
    },
    {
      "name": "Land Customs Act, 1924",
      "sections": [
        "s.3(1)",
        "s.2(e)",
        "s.2(g)"
      ],
      "relevance": "Appointment of Collector and Customs Officers for areas adjoining foreign frontier; definitions of foreign frontier and land customs area."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upheld Rajasthan High Court's conviction and sentence of one year rigorous imprisonment under s.167(81) Sea Customs Act.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It does not stand to reason that if two other persons had been searched and gold had been found within one of them, this appellant, a pointsman in the Railway, should be falsely implicated.\"",
      "speaker": "court",
      "significance": "Supports credibility of recovery from appellant."
    },
    {
      "text": "\"We can see no justification for such a restricted construction of the word adjoining.\"",
      "speaker": "court",
      "significance": "Interprets notification jurisdiction broadly."
    },
    {
      "id": "kq3",
      "text": "\"All these circumstances establish beyond a shadow of doubt that accused was carrying the gold knowingly and with the intention of evading the prohibition.\"",
      "speaker": "court",
      "significance": "Establishes mens rea."
    }
  ],
  "_case_id": "1963_74",
  "_label": 0,
  "_text_length": 18686,
  "_extracted_at": "2026-02-10T19:48:21.523495"
}