{
  "metadata": {
    "case_name": "T. Prem Sagar v. Standard Vacuum Oil Company",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal Nos. 581 and 582 of 1963",
    "date_of_judgment": "1963-12-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant T. Prem Sagar appointed by respondent as Road Engineer at Madras on 5th February, 1951.",
      "type": "background",
      "date": "1951-02-05",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In January, 1952, appellant promoted as Operations Assistant on salary of Rs. 450 p.m., placed on probation for six months, declared to have completed probation satisfactorily.",
      "type": "background",
      "date": "1952-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In October, 1957, due to misunderstandings, appellant placed on probation again from 1st October, 1957 for six months in same post of Operations Assistant.",
      "type": "material",
      "date": "1957-10-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "At end of probation, appellant received letter from Operations Manager that he had done work satisfactorily as probationer.",
      "type": "admitted",
      "date": "1958-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Alleged appellant did not show capacity for growth, offered lower post of Senior Operations Supervisor (specifically created for him, salary Rs. 900 p.m., while drawing Rs. 1,000 p.m. as Operations Assistant).",
      "type": "disputed",
      "date": "1958-04",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Appellant asked to take due leave; on return, management refused to allow him to join as Operations Assistant.",
      "type": "material",
      "date": "1958-04",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant not prepared to take Senior Operations Supervisor post; services terminated by management with effect from 30th April, 1958 vide letter dated 2nd May, 1958.",
      "type": "material",
      "date": "1958-05-02",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant filed appeal before Addl. Commissioner for Workmens Compensation under s.41 of Madras Shops and Establishments Act, 1947, contending termination invalid for non-compliance with s.41.",
      "type": "procedural",
      "date": "1958-05",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Respondent filed petition before Addl. Commissioner alleging no jurisdiction as appellant in position of management; moved Commissioner of Labour under s.51 to determine status.",
      "type": "procedural",
      "date": "1958",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Commissioner of Labour, after evidence, on 12th January, 1959, held appellant employed under respondent and not in position of management.",
      "type": "procedural",
      "date": "1959-01-12",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Addl. Commissioner overruled respondent's contentions, held Act applied, rejected contentions against appellant's work, set aside termination order.",
      "type": "procedural",
      "date": "1959",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Respondent filed Writ Petition No. 521 of 1959 challenging Commissioner of Labour's order, and Writ Petition No. 573 of 1959 challenging Addl. Commissioner's order.",
      "type": "procedural",
      "date": "1959",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Balakrishna Ayyar J. dismissed both writ petitions, holding question of fact not open to certiorari even if erroneous.",
      "type": "procedural",
      "date": "1960-02-18",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Division Bench of Madras High Court allowed Letters Patent Appeals (Nos. 139 and 140 of 1959), issued certiorari quashing Commissioner of Labour's finding as error of law apparent on face.",
      "type": "procedural",
      "date": "1960-02-18",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Appellant filed present appeals to Supreme Court with certificate from High Court.",
      "type": "procedural",
      "date": "1963",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Validity of writ of certiorari issued by Madras High Court Division Bench quashing Commissioner of Labour's order under s.51 of Madras Shops and Establishments Act, 1947.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Limits of High Court's jurisdiction under Art.226 to interfere with Commissioner of Labour's final decision under s.51 on employee's status (position of management under s.4(1)(a)).",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether appellant was employed in a position of management exempt under s.4(1)(a), or a 'person employed' under s.2(12)(iii) entitled to s.41 protection.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court cannot issue certiorari unless error of law apparent on face of record or jurisdictional error/fraud; s.51 makes Commissioner's decision final.",
      "supporting_facts": [
        "f10",
        "f14"
      ],
      "legal_basis": "Art.226 Constitution; s.51 Madras Shops Act; precedents like Rai Brij Raj Krishna v. S.K. Shaw Brothers; Parry & Co. Ltd. v. Commercial Employees Association"
    },
    {
      "id": "pa2",
      "text": "No error of law apparent; Commissioner applied correct tests for 'position of management' and recorded findings on evidence.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "s.4(1)(a), s.2(12)(iii) Madras Shops Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant in position of management, exempt under s.4(1)(a); Commissioner applied wrong test by focusing only on managerial powers re head office.",
      "supporting_facts": [
        "f5",
        "f10"
      ],
      "legal_basis": "s.4(1)(a), s.2(5), s.2(12) Madras Shops Act"
    },
    {
      "id": "ra2",
      "text": "Commissioner's order suffers from error of law apparent on face (two statements show misapplication of test).",
      "supporting_facts": [
        "f10",
        "f14"
      ],
      "legal_basis": "Art.226 Constitution"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Certiorari lies for error of law apparent on face of record, notwithstanding s.51 finality; not limited to jurisdictional error or fraud.",
      "addresses_issue": "i2",
      "key_observation": "Distinction between jurisdictional facts and merits; status question on merits, correctable only if error apparent."
    },
    {
      "id": "cr2",
      "text": "Appellant not 'employer' under s.2(5) as no general management/control of establishment.",
      "addresses_issue": "i3",
      "key_observation": "Definition requires overall control, not departmental."
    },
    {
      "id": "cr3",
      "text": "Tests for 'position of management' under s.4(1)(a): power to operate bank, payments, agreements, supervise clerks, control correspondence, appoint/punish staff, etc.; salary not decisive.",
      "addresses_issue": "i3",
      "key_observation": "Commissioner applied correct tests, recorded findings (no appointment power, no discipline, no leave grant, etc.); two statements not vitiating whole order."
    },
    {
      "id": "cr4",
      "text": "No error apparent on face; Commissioner's elaborate order considers evidence properly; Division Bench erred in quashing without remanding.",
      "addresses_issue": "i1",
      "key_observation": "High Court should remand if error found, not substitute findings."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Writ of certiorari not justified; Commissioner of Labour's order does not suffer from error of law apparent on face.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court's jurisdiction under Art.226 extends to errors of law apparent on face, even with statutory finality under s.51.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Appellant not in position of management under s.4(1)(a); termination invalid for non-compliance with s.41.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rai Brij Raj Krishna v. S.K. Shaw Brothers",
      "citation": "1951 S.C.R. 145",
      "treatment": "referred",
      "relevance": "Distinction between collateral jurisdictional facts and merits facts; finality on merits."
    },
    {
      "case_name": "Colonial Bank of Australasia v. Willan",
      "citation": "5 P.C. 417",
      "treatment": "followed",
      "relevance": "Adjudication on merits conclusive if no defect on face."
    },
    {
      "case_name": "Parry & Co. Ltd. v. Commercial Employees Association, Madras",
      "citation": "1952 S.C.R. 519",
      "treatment": "distinguished",
      "relevance": "Certiorari not for mere error, but observation not limiting to jurisdiction/fraud only."
    },
    {
      "case_name": "Nagendra Nath v. Commissioner of Hills Division",
      "citation": "1958 S.C.R. 1240",
      "treatment": "followed",
      "relevance": "Certiorari for error of law apparent on face."
    },
    {
      "case_name": "Syed Yakoob v. K.S. Radhakrishnan",
      "citation": "1964 5 S.C.R. 64",
      "treatment": "referred",
      "relevance": "No general test for error apparent on face."
    },
    {
      "case_name": "Chandra T.P. v. Commissioner for Workmens Compensation, Madras",
      "citation": "1958 1 L.L.J 55",
      "treatment": "referred",
      "relevance": "Tests for position of management; salary not material."
    },
    {
      "case_name": "Salem Sri Ramaswami Bank Ltd. v. Additional Commissioner for Workmens Compensation",
      "citation": "1956 2 L.L.J 254",
      "treatment": "referred",
      "relevance": "Tests for position of management."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Shops and Establishments Act, 1947",
      "sections": [
        "s.2(3)",
        "s.2(5)",
        "s.2(12)(iii)",
        "s.2(18)",
        "s.4(1)(a)",
        "s.29",
        "s.31",
        "s.32",
        "s.33",
        "s.41",
        "s.51"
      ],
      "relevance": "Definitions of commercial establishment, employer, person employed; exemption for management position; mandatory procedure for dismissal after 6 months; appeal; s.51 finality on applicability/status."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.226"
      ],
      "relevance": "High Court jurisdiction to issue certiorari."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeals, set aside the Division Bench's order issuing writ of certiorari, holding no error of law apparent on face of Commissioner's order; restored orders of Commissioner of Labour and Addl. Commissioner, upholding validity of s.41 protection and invalidity of termination.",
    "relief_granted": "Termination order set aside; appellant's service protected under s.41.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the control or management which is associated with persons falling under the definition of employer is the general management or control of the said establishment it is a kind of overall management or control\"",
      "speaker": "court",
      "significance": "Clarifies s.2(5) 'employer' requires overall control, not departmental."
    },
    {
      "text": "\"a writ of certiorari can be issued where the order of the inferior tribunal is shown to suffer from an error which is apparent on the face of the record.\"",
      "speaker": "court",
      "significance": "Defines scope of certiorari under Art.226 despite statutory finality."
    },
    {
      "text": "\"It would... be inappropriate for the High Court exercising its writ jurisdiction to consider the evidence for itself and reach its own conclusions in matters which have been left by the legislature to the decisions of specially constituted Tribunals.\"",
      "speaker": "court",
      "significance": "Limits HC role in writ proceedings to correction, not substitution."
    }
  ],
  "_case_id": "1963_255",
  "_label": 1,
  "_text_length": 31417,
  "_extracted_at": "2026-02-10T19:50:24.849851"
}