{
  "metadata": {
    "case_name": "Chittaranjan Das v. State",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Criminal Appeal No. 165 of 1960",
    "date_of_judgment": "1963-04-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Chittaranjan Das charged under section 376 IPC with three counts of rape on Sandhyarani Das Gupta alias Nirmala: between November 18-21, 1958; December 1-6, 1958; December 9-15, 1958 at 29A and B, Kailash Bose Street, Calcutta.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Ganesh De charged with abetting appellant under section 376 read with s.109 IPC.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Presidency Magistrate, 8th Court, Calcutta committed both accused to Sessions on May 4, 1960 after finding prima facie case.",
      "type": "procedural",
      "date": "1960-05-04",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "City Sessions Court at Calcutta tried case with jury; jury returned verdict of guilty against appellant on all three counts and against Ganesh De; Sessions Judge accepted verdict as not perverse, convicted appellant under s.376, sentenced to 4 years rigorous imprisonment on first charge (no separate sentence on others); similar sentence for Ganesh De on July 9, 1960.",
      "type": "procedural",
      "date": "1960-07-09",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Calcutta High Court Division Bench summarily dismissed appellant's appeal on July 22, 1960.",
      "type": "procedural",
      "date": "1960-07-22",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "High Court granted certificate under Article 134(1)(c) on grounds of substantial points of law: invalidity of charge, summary dismissal, misdirection.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Sandhyarani Das Gupta, minor girl staying with mother Soudamini in Refugee Colony at Ghola, induced by Maniprova alias Manibala Majumdar to go to her house in first week of November 1958 with promise of nurse's job.",
      "type": "background",
      "date": "1958-11-first week",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Sandhya taken to appellant's house mid-November 1958 on representation he would give employment; appellant ravished her, promising job; taken 2-3 more times within a month, sexual intercourse each time.",
      "type": "material",
      "date": "1958-11-mid to December",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Sandhya conceived; Manibala attempted abortion unsuccessfully; taken to Chittaranjan Sevasadan on February 11, 1959 where abortion completed; later sent back home at her insistence.",
      "type": "material",
      "date": "1959-02-11",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Sandhya taken again to appellant's house, ravished 2-3 more times; introduced to Himangsu Ganguli; appellant made them pose for show marriage photo with Ganesh De and Manibala; photo given to appellant, Sandhya ravished again.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Mother filed complaint on June 6, 1959 that daughter disappeared; investigated by Enforcement Branch; Sandhya recovered from Ganesh De's house on June 10, 1959; statement recorded at Tollygunge PS, transferred to Amherst Street PS; statement again on June 12, 1959 specifying dates November 14, 1958, May 30, 1959, June 6, 1959.",
      "type": "procedural",
      "date": "1959-06-06",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Appellant moved High Court in revision against committal; High Court rejected, held charge valid under s.222 and 234 CrPC.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the charge under s.222 CrPC was invalid for specifying periods instead of precise dates and times of offence.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether High Court erred in summarily dismissing the appeal under s.421 CrPC.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Sessions Judge's charge to jury contained misdirections: on validity of charge, evidence of prosecutrix, age of girl, previous statements under s.145 Evidence Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Charge invalid under s.222(1) CrPC as it specified periods (3-6 days) instead of precise date and time; only s.222(2) allows periods for specific offences.",
      "supporting_facts": [
        "f1",
        "f12"
      ],
      "legal_basis": "s.222 CrPC; Ali Hyder v. Emperor"
    },
    {
      "id": "pa2",
      "text": "High Court should not have summarily dismissed appeal as it raised arguable points.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "s.421 CrPC; Mushtak Hussein v. State of Bombay; Shreekantiah Ramayya v. State of Bombay"
    },
    {
      "id": "pa3",
      "text": "Sessions Judge misdirected jury by leaving validity of charge to them; should have decided as question of law.",
      "supporting_facts": [
        "f4",
        "f12"
      ],
      "legal_basis": "s.222 CrPC"
    },
    {
      "id": "pa4",
      "text": "Judge failed to direct jury that prosecutrix evidence unreliable due to contradictions, past career; corroboration required as matter of prudence.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Evidence of prosecutrix in rape cases"
    },
    {
      "id": "pa5",
      "text": "No direction on onus of proving age below 16 on prosecution; benefit of doubt to accused.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s.376 IPC"
    },
    {
      "id": "pa6",
      "text": "Previous statements under s.145 Evidence Act mischaracterized; should be substantive evidence.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "s.145 Evidence Act"
    },
    {
      "id": "pa7",
      "text": "Sessions Judge should have found jury verdict perverse given charge's tone.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Charge valid under s.222(1) CrPC if gives reasonably sufficient notice; periods of 3-6 days permissible as 'on or about' date is usual; no prejudice; nature of case (minor refugee girl) makes precise dates impossible.",
      "addresses_issue": "i1",
      "key_observation": "Test: did accused have reasonably sufficient notice? Precision depends on prosecution information."
    },
    {
      "id": "cr2",
      "text": "High Court entitled to summarily dismiss under s.421(1) CrPC if no arguable/substantial issue after perusal; applied mind implied.",
      "addresses_issue": "i2",
      "key_observation": "Summary dismissal means merits considered and no substance found."
    },
    {
      "id": "cr3",
      "text": "No misdirection on charge validity: High Court already upheld; judge leaving to jury not prejudicial to accused.",
      "addresses_issue": "i3",
      "key_observation": "Charge fair overall, more favorable to accused."
    },
    {
      "id": "cr4",
      "text": "Charge adequately warned jury on prosecutrix evidence: uncorroborated, contradictions, unsafe without corroboration; judge cannot usurp jury function.",
      "addresses_issue": "i3",
      "key_observation": "Jury to decide reliability."
    },
    {
      "id": "cr5",
      "text": "Onus on age already explained earlier in charge; no need to repeat.",
      "addresses_issue": "i3",
      "key_observation": "Not material misdirection."
    },
    {
      "id": "cr6",
      "text": "Previous statements under s.145 for contradiction only, not substantive evidence; correct direction.",
      "addresses_issue": "i3",
      "key_observation": "True legal position."
    },
    {
      "id": "cr7",
      "text": "Jury verdict not perverse despite uncorroborated testimony; judge did duty in charge.",
      "addresses_issue": "i3",
      "key_observation": "Jury unanimous after deliberation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Charge specifying short periods valid if reasonably sufficient notice under s.222 CrPC; no prejudice shown.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Summary dismissal of appeal proper if High Court finds no substance after consideration.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No material misdirections in Sessions Judge's charge to jury.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ali Hyder v. Emperor",
      "citation": "1939 40 Cr. L. J. 280",
      "treatment": "distinguished",
      "relevance": "High Court thought supported invalid charge contention; SC held does not."
    },
    {
      "case_name": "Mushtak Hussein v. State of Bombay",
      "citation": "AIR 1953 SC 282",
      "treatment": "followed",
      "relevance": "High Courts should not summarily dismiss appeals raising arguable points."
    },
    {
      "case_name": "Shreekantiah Ramayya Munipalli v. State of Bombay",
      "citation": "AIR 1955 SC 287",
      "treatment": "followed",
      "relevance": "Disapproves summary rejection of appeals raising substantial issues."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "376",
        "109"
      ],
      "relevance": "Offences of rape and abetment charged."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "222",
        "234",
        "421",
        "535",
        "537"
      ],
      "relevance": "Charge particulars; summary dismissal of appeals; procedural irregularities not vitiating trial without prejudice."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "145"
      ],
      "relevance": "Previous statements for contradiction, not substantive evidence."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 134(1)(c)"
      ],
      "relevance": "Certificate for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding the conviction and sentence by Sessions Court and summary dismissal by High Court; found charge valid, no misdirections, no perversity in jury verdict.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the requirement of s.222(1) is that the accused person must have a reasonably sufficient notice as to the case against him.",
      "speaker": "court",
      "significance": "Core test for charge validity."
    },
    {
      "text": "Summary dismissal only means that having considered the merits of the appeal, the High Court does not think it advisable to admit the appeal because in its opinion, the decision appealed against is right.",
      "speaker": "court",
      "significance": "Explains propriety of High Court's summary dismissal."
    },
    {
      "text": "before convicting the appellant on the uncorroborated testimony of Sandhya, the members of the jury should ask themselves whether they were so much convinced about the truthfulness of the girl as to accept her evidence in its entirety.",
      "speaker": "court",
      "significance": "Judge's caution on prosecutrix evidence upheld as fair."
    }
  ],
  "_case_id": "1963_271",
  "_label": 0,
  "_text_length": 31424,
  "_extracted_at": "2026-02-10T19:51:06.379790"
}