{
  "metadata": {
    "case_name": "Plaintiffs v. Defendants 1st and 2nd Parties",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "AYYANGAR J."
    ],
    "case_number": "Civil Appeal No. 195 of 1961",
    "date_of_judgment": "1963-04-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Subject matter is a piece of land of about 14 bighas and 5 kathas in khata No.741 in mauza Chaugain.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Plaintiffs' ancestors executed a registered rehan bond on October 28, 1897 of lands including those in suit, in favour of the ancestors of the persons who were impleaded as defendants 3rd parties.",
      "type": "background",
      "date": "1897-10-28",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "During the subsistence of the 1897 mortgage, plaintiffs' ancestors executed another registered rehan bond in June, 1907 in favour of persons who were the ancestors of the persons impleaded as defendants 4th parties, a portion of the mortgage money being left with these second mortgagees to enable them to redeem the earlier mortgage.",
      "type": "background",
      "date": "1907-06",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Defendants 4th party redeemed the 1897 mortgage and got into possession of the entirety of the property mortgaged to them.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "On June 8, 1941, the plaintiffs paid off the amount due on the rehan bond of 1907 and entered satisfaction on the bond making an endorsement thereon.",
      "type": "material",
      "date": "1941-06-08",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "On redemption in 1941, the plaintiffs obtained possession of a portion of the lands under mortgage but could not obtain possession of the lands in suit.",
      "type": "material",
      "date": "1941-06-08",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Suit lands were in the possession of the defendants 1st and 2nd parties who claimed title on the basis of their being entitled to occupancy rights in the lands and they refused to surrender actual possession of the land to the plaintiffs.",
      "type": "disputed",
      "date": "1941",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Defendants claimed the suit lands were raiyati lands from which they, the tenants in cultivation, could not be evicted.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Present suit filed for declaration that the land was zeraiti land of the plaintiffs, that defendants 1st and 2nd parties had no right or title thereto, recovery of possession, mesne profits for three years before suit and enquiry into future profits under O. XX r. 12 CPC.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Defendants asserted they had been in possession and occupation of the land as tenants long before the rehan of 1897, even 30 years earlier.",
      "type": "disputed",
      "date": "pre-1897",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Plaintiffs case: Defendants were inducted to the land for the first time as tenants of the mortgagees under the first rehan of 1897 and originally brought in as tenants for a term of 7 years which expired in or about 1912-13.",
      "type": "disputed",
      "date": "1897",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Defendants claimed they had perfected title by adverse possession for over 12 years under Art. 144 Limitation Act.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Trial judge findings: Land was zeraiti land of plaintiffs, in their actual possession and not in possession of tenants at date of 1st rehan 1897; defendants came into possession under lease deed about 1906 for term expiring 1912-13, thereafter continued as tenants of zeraiti land, no occupancy right; possession not adverse until June 1941 redemption, suit within 12 years.",
      "type": "admitted",
      "date": "1947-10-10",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Trial court decreed suit on October 10, 1947 as prayed for.",
      "type": "procedural",
      "date": "1947-10-10",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Defendants 2nd party appealed to Patna High Court, obtained stay of possession.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "Bihar Land Reforms Act 1950 enacted, came into force September 25, 1950.",
      "type": "background",
      "date": "1950-09-25",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Plaintiffs' estate vested in State as from January 1, 1955 under notification under s.3(1) Bihar Land Reforms Act.",
      "type": "material",
      "date": "1955-01-01",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Patna High Court in September 1957: Upheld trial findings on zeraiti character, possession date, etc.; considered effect of Act, held plaintiffs lost title to possession due to vesting; granted declaration of zeraiti, mesne profits up to 31.12.1954, set aside decree for possession; State added but no appearance, request for decree refused.",
      "type": "admitted",
      "date": "1957-09-03",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "Plaintiffs' plaint para 10: Defendants 1st/2nd parties have no kasht right, after redemption their possession wrongful.",
      "type": "admitted",
      "date": "1941",
      "source": "petitioner"
    },
    {
      "id": "f20",
      "text": "Plaintiffs' plaint para 11: On 08.06.1941 redeemed rehan 1907, entered possession of other property but defendants 1st/2nd prevented entry into suit land, fresh invasion against title.",
      "type": "material",
      "date": "1941-06-08",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Proper construction of the vesting sections of the Bihar Land Reforms Act, 1950 and in particular the scope of s. 6 thereof.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Was the suit-land zeraiti land as claimed by the plaintiffs or raiyati land as pleaded by the contesting defendants?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "When did the defendants 1st and 2nd parties first come into possession and cultivation of the land?",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Had the plaintiffs lost title to the land and their suit for recovery thereof barred by limitation by reason of the contesting defendants having perfected their title by adverse possession?",
      "framed_by": "court"
    },
    {
      "id": "i5",
      "text": "Whether plaintiffs in khas possession of suit land on date of vesting (01.01.1955) under s.6(1)(c) Bihar Land Reforms Act as lands forming subject matter of subsisting mortgage on redemption of which intermediary entitled to recover khas possession.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Land zeraiti of plaintiffs, so would not vest in State due to saving in s.6 Bihar Land Reforms Act; falls within s.6(1)(c) as subject of subsisting mortgage, plaintiffs deemed in khas possession on vesting date.",
      "supporting_facts": [
        "f1",
        "f13",
        "f17"
      ],
      "legal_basis": "Bihar Land Reforms Act 1950 s.6(1)(c), s.2(k); relied on Mahanth Sukhdeo Das v. Kashi Prasad Tiwari; s.62 Transfer of Property Act; Art.148 Limitation Act"
    },
    {
      "id": "pa2",
      "text": "Khas possession includes constructive possession; mortgagee continuing after payment holds on behalf of mortgagor; suit for possession is redemption suit; defendants as tenants of mortgagees bound by same equities.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5",
        "f6"
      ],
      "legal_basis": "Full Bench Patna HC in Mahanth Sukhdeo Das v. Kashi Prasad Tiwari; AIR 1938 Patna 638; LR 1933 Allahabad 97"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Suit should fail as plaintiffs lost title to property which vested in State under s.3/4 Bihar Land Reforms Act; challenge zeraiti finding, possession pre-1897.",
      "supporting_facts": [
        "f10",
        "f17"
      ],
      "legal_basis": "Bihar Land Reforms Act 1950 ss.3,4"
    },
    {
      "id": "ra2",
      "text": "Defendants perfected title by adverse possession over 12 years under Art.144 Limitation Act.",
      "supporting_facts": [
        "f10",
        "f11",
        "f12"
      ],
      "legal_basis": "Limitation Act Art.144"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Trial and High Court concurrent findings on zeraiti character, entry into possession 1906 lease expiring 1912-13, no occupancy rights, adverse possession from 1941 redemption upheld; not permitting challenge as no cross-appeal by respondents.",
      "addresses_issue": "i2",
      "key_observation": "Land zeraiti; defendants tenants under mortgagees, possession became adverse/trespassory in 1941 on redemption."
    },
    {
      "id": "cr2",
      "text": "Plaintiffs not in khas possession on vesting date; mortgage redeemed 1941, no subsisting mortgage; defendants' possession adverse, as trespassers claiming occupancy rights against both mortgagee and mortgagor; s.6(1)(c) not applicable.",
      "addresses_issue": "i1",
      "key_observation": "Khas possession per s.2(k) requires actual/constructive via derivative holding; here defendants held adversely, not on behalf of plaintiffs."
    },
    {
      "id": "cr3",
      "text": "Even if mortgagee continues post-payment without more, holds for mortgagor; but overt acts/claims make adverse; here defendants resisted as kasht tenants post-redemption.",
      "addresses_issue": "i5",
      "key_observation": "Plaintiffs treated defendants as trespassers in plaint; possession not derived from plaintiffs."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Plaintiffs entitled to declaration that lands are zeraiti/private lands and mesne profits up to 31.12.1954; not entitled to possession as estate vested in State on 01.01.1955, suit lands not saved under s.6(1)(c) Bihar Land Reforms Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Defendants' possession became adverse to plaintiffs from date of redemption in 1941; suit not barred by limitation.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mahanth Sukhdeo Das v. Kashi Prasad Tiwari",
      "citation": "A.I.R. 1958 Patna 630",
      "treatment": "referred",
      "relevance": "Constructive khas possession of co-sharers; possession of trespasser equated to khas of owner (doubted by SC)"
    },
    {
      "case_name": "Unnamed (Full Bench Patna HC)",
      "citation": "A.I.R. 1938 Patna 638",
      "treatment": "followed",
      "relevance": "Suit by mortgagor post-payment as redemption under Bengal Regulation XV of 1793"
    },
    {
      "case_name": "Unnamed",
      "citation": "L.R. 1933 Allahabad 97",
      "treatment": "referred",
      "relevance": "Suit by mortgagor post-payment as redemption"
    }
  ],
  "statutes_cited": [
    {
      "name": "Bihar Land Reforms Act, 1950",
      "sections": [
        "s.3(1)",
        "s.4",
        "s.4(ee)",
        "s.6(1)(a)(b)(c)",
        "s.2(k)",
        "s.7A",
        "s.7B"
      ],
      "relevance": "Vesting of estates in State; saving of khas possession lands including those under subsisting mortgage; State added as party"
    },
    {
      "name": "Bihar Tenancy Act, 1885",
      "sections": [
        "s.116"
      ],
      "relevance": "Landlords' private lands let out under lease"
    },
    {
      "name": "Chota Nagpur Tenancy Act, 1908",
      "sections": [
        "s.43"
      ],
      "relevance": "Landlords' privileged lands let out under registered lease"
    },
    {
      "name": "Limitation Act",
      "sections": [
        "Art.144",
        "Art.148"
      ],
      "relevance": "12 years adverse possession; 60 years for mortgagor vs mortgagee"
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "s.62"
      ],
      "relevance": "Effect of payment on usufructuary mortgage"
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "O. XX r.12"
      ],
      "relevance": "Enquiry into future mesne profits"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding High Court decree: plaintiffs entitled to declaration that suit lands are their zeraiti/private lands, mesne profits for three years before suit and up to 31.12.1954 (estate vesting 01.01.1955), but decree for possession set aside as lands vested in State and not saved under s.6(1)(c).",
    "relief_granted": "Declaration of zeraiti title; mesne profits up to 31.12.1954, to be ascertained in subsequent proceedings",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the proper construction of the vesting sections of the Bihar Land Reforms Act, 1950 hereinafter called the Act , and in particular the scope of s. 6 thereof is the principal point that arises in this appeal",
      "speaker": "court",
      "significance": "States core issue"
    },
    {
      "text": "the possession of defendants 1st party or defendant 2nd party became that of a trespasser as against the plaintiffs on the redemption of the rehan in 1941",
      "speaker": "lower_court",
      "significance": "Key finding on adverse possession start date"
    },
    {
      "text": "Section 6 1 c cannot, in terms, therefore apply since the mortgagor-mortgagee relationship did not subsist on January 1, 1955",
      "speaker": "court",
      "significance": "Rejects application of saving provision"
    }
  ],
  "_case_id": "1963_162",
  "_label": 0,
  "_text_length": 29887,
  "_extracted_at": "2026-02-10T19:49:49.855710"
}