{
  "metadata": {
    "case_name": "Successors of Cursetjee Cowasjee Banajee v. State of Bombay",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 560 of 1962",
    "date_of_judgment": "1963-04-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "By an agreement called Cowl dated October 2, 1830 the Principal Collector of Konkan conferred on behalf of the East India Company farm rights upon Cursetjee Cowasjee Banajee in seven villages: Mogra, Wasivre, Bandivli, Majas, Part Pahadi, Goregaon and Poisar.",
      "type": "material",
      "date": "1830-10-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By two letters dated October 17, 1835 and July 17, 1841 the original cowl was modified and Banajee was required to pay Rs. 2,708/7/- per annum to the East India Company.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Banajee constructed extensive salt works in the villages and expended Rs. 2 lakhs in improving and developing the villages.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On September 22, 1847 the East India Company granted to Banajee the seven villages freed from the covenants of the cowl, and from liability to pay assessment on land revenue in consideration of the amount spent by him and Rs. 30,000/- paid by him.",
      "type": "material",
      "date": "1847-09-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The villages were held and enjoyed by the successors of Banajee under the terms of the grant without payment of land revenue till 1952.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Legislature of Bombay State enacted Salsette Estates Land Revenue Exemption Abolition Act, XLVII of 1951, assent of President on January 4, 1952, brought into force on March 1, 1952.",
      "type": "material",
      "date": "1952-01-04",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Collector of Bombay Suburban District by letter dated February 28, 1952 informed appellant (successor-in-interest of Banajee) that from March 1, 1952 waste lands vest in Government per s.4, Bombay Land Revenue Code s.37 applies, and directed not to collect land revenue or rent.",
      "type": "procedural",
      "date": "1952-02-28",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Appellant by letter dated March 5, 1952 submitted that seven villages held as absolute owner under indenture of September 22, 1847, freed from cowl and land revenue liability, Act does not apply.",
      "type": "procedural",
      "date": "1952-03-05",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Collector by letter dated June 25, 1952 informed appellant that Act applicable to seven villages.",
      "type": "procedural",
      "date": "1952-06-25",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "On November 28, 1952 appellant commenced Suit No. 52 of 1953 in Bombay High Court for declaration that Act does not apply and injunction restraining State from enforcing Act.",
      "type": "procedural",
      "date": "1952-11-28",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "State of Bombay contended appellant not absolute owner, Act applies.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "K. Desai J. held indenture not a lease but grant of farm right to recover revenue as agent; estate within s.2(b); not exempted under s.3(1).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Division Bench in Appeal No. 50 of 1959 held villages held under agreement from State Govt per s.2(d), estate per s.2(b), exemption abolished; rights not saved by s.3(3); confirmed decree.",
      "type": "procedural",
      "date": "1961-02-23",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appellant challenged Act under Arts. 19(1)(f) and 31, plea abandoned after Constitution Fourth Amendment Act, 1955.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the villages held by the appellant constitute an estate within the meaning of s. 2(b) of the Bombay Act 47 of 1951",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If the villages constitute an estate, whether the exemption from payment of land revenue granted under the indenture is saved by sub-s. 3 of s. 3",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The seven villages were held as absolute owner under indenture of 1847, freed from cowl of 1830 and land revenue liability; Act does not apply.",
      "supporting_facts": [
        "f4",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The agreement contemplated by s.2(d) is a personal agreement not relating to the estate; covenants in indenture not of that nature.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Section 2(d) of Act XLVII of 1951"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant not absolute owner; Act applies to villages; no decree for declaration and injunction.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Villages specified in Schedule; held under 'cowl' as defined in s.2(d) meaning lease, farm or agreement from State Government.",
      "addresses_issue": "i1",
      "key_observation": "Not a lease or farm, but held under an agreement due to covenants imposing obligations subject to which exemption from land revenue granted."
    },
    {
      "id": "cr2",
      "text": "Indentured dated 1847 grants ownership subject to reservations and covenants (respect tenants' rights, maintain dewasthans etc., pay Re.1 rent if demanded); constitutes agreement per s.2(d).",
      "addresses_issue": "i1",
      "key_observation": "State grant of land does not absolve from revenue liability absent agreement; villages held under agreement for revenue exemption."
    },
    {
      "id": "cr3",
      "text": "s.3(1) makes all lands in estate liable to land revenue notwithstanding cowl; subject to s.3(3) which saves exemptions for persons other than estate-holder under special contract/grant recognized by cowl.",
      "addresses_issue": "i2",
      "key_observation": "Estate-holder's exemption extinguished; s.3(3) excludes estate-holder."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Villages constitute an estate under s.2(b) as held under agreement from State Government per s.2(d).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Exemption from land revenue not saved by s.3(3) for estate-holder.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Salsette Estates Land Revenue Exemption Abolition Act, XLVII of 1951",
      "sections": [
        "s.2(b)",
        "s.2(d)",
        "s.3(1)",
        "s.3(3)",
        "s.4"
      ],
      "relevance": "Abolishes exemption from land revenue for estates (villages in Schedule held under cowl); imposes liability on lands in estate except for non-estate-holders under special grants."
    },
    {
      "name": "Bombay Land Revenue Code",
      "sections": [
        "s.37"
      ],
      "relevance": "Applies to waste lands vesting in Government."
    },
    {
      "name": "Regulation XVII of 1827",
      "sections": [],
      "relevance": "Liability to contribute to land revenue under which exemption granted."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 19(1)(f)",
        "Art. 31"
      ],
      "relevance": "Challenge to Act abandoned post Fourth Amendment."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Bombay High Court; villages are estate under s.2(b) held under agreement per s.2(d); exemption from land revenue abolished under s.3(1), not saved for estate-holder by s.3(3). Appeal dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"an estate as meaning a village or a part thereof specified in the Schedule, and held under a cowl.\"",
      "speaker": "court",
      "significance": "Definition under s.2(b)"
    },
    {
      "text": "\"Nothing in sub-section (1) shall be deemed to affect the right of any person to hold any land in an estate wholly or partially exempt from the payment of land revenue under a special contract, or grant made or recognised by the terms of the cowl in respect of the estate or under a law for the time being in force in favour of any person other than the estate-holder.\"",
      "speaker": "court",
      "significance": "s.3(3) excludes estate-holder from exemption protection"
    },
    {
      "text": "The villages though held in absolute right are still in the matter of liability to pay land revenue held under an agreement from the State Government.",
      "speaker": "court",
      "significance": "Key holding on s.2(d) interpretation"
    }
  ],
  "_case_id": "1963_226",
  "_label": 0,
  "_text_length": 25612,
  "_extracted_at": "2026-02-10T19:50:22.173632"
}