{
  "metadata": {
    "case_name": "Chandra Deo Singh v. Prokash Chandra Bose",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Criminal Appeal No. 155 of 1960",
    "date_of_judgment": "1963-01-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On December 25, 1957, one Panchanan Roy lodged a first information report at 11:00 p.m. at the police station, Bhangor in the district of 24 Parganas alleging that respondent No. 1 Prokash Chandra Bose, proprietor of a fishery, had killed a man named Nageswar Singh, a darwan posted at the informant's master's fishery, by shooting him with a gun. After the occurrence, the assailant's party was chased but respondent No. 1 made good his escape in his own car. Two associates, Pannalal Saha and Sankar Ghosh, were arrested by local people and produced in the police station.",
      "type": "material",
      "date": "1957-12-25",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Police undertook investigation on the basis of the first information report but submitted a final report on September 17, 1958.",
      "type": "procedural",
      "date": "1958-09-17",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "On November 3, 1958, one Mahendra Singh, claiming to be a distant relative of the deceased (fact denied by the widow), filed a complaint before the Sub-Divisional Magistrate of 24 Parganas Alipore against the police final report, alleging that the first information report by Panchanan Roy was false at the instance of his master Bidhu Bhusan Sarkar, enemy of respondent No. 1, and asked for processes against certain other persons for murdering Nageswar Singh.",
      "type": "procedural",
      "date": "1958-11-03",
      "source": "complainant"
    },
    {
      "id": "f4",
      "text": "Sub-Divisional Magistrate examined Mahendra Singh on oath, looked into police papers, and directed Mr. N. M. Chowdhry, Magistrate First Class, to hold a judicial enquiry into Mahendra Singh's allegations and submit a report.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "During pendency of enquiry into Mahendra Singh's complaint, Chandra Deo Singh, nephew of the deceased, filed a complaint on December 30, 1958 before Mr. Chowdhry stating that respondent No. 1 had fired a shot at Nageswar Singh at point blank range and murdered him.",
      "type": "procedural",
      "date": "1958-12-30",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Sub-Divisional Magistrate examined Chandra Deo Singh on oath and referred the matter to Mr. N. M. Chaudhry for enquiry and report.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "During the enquiry, respondent No. 1 was permitted to appear through counsel. Seven witnesses produced by complainant Chandra Deo Singh were examined. Pannalal Saha and Sankar Ghosh, alleged associates of respondent No. 1, examined as court witnesses allegedly at instance of respondent's counsel.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "On February 9, 1959, Mr. N. M. Choudhry reported to Sub-Divisional Magistrate that prima facie case made out against Upendra Neogi, Asim Mondal and Arun Mondal under s. 302/34 IPC, but no prima facie case against respondent No. 1.",
      "type": "procedural",
      "date": "1959-02-09",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Sub-Divisional Magistrate directed summonses against the three persons and commenced committal proceedings against them; dismissed Chandra Deo Singh's complaint without assigning reasons.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Chandra Deo Singh filed revision before Sessions Judge, Alipore, who after notice to respondent No. 1 and hearing counsel, directed Sub-Divisional Magistrate to make further enquiry against respondent No. 1.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Respondent No. 1 and the three persons filed revision applications before Calcutta High Court, heard together by single judge who granted applications of respondent No. 1 and Upendra Neogi.",
      "type": "procedural",
      "date": "1960-01-27",
      "source": "high_court"
    },
    {
      "id": "f12",
      "text": "High Court granted certificate under Art. 134(1)(c) for appeal to Supreme Court on four grounds (except first initially, but all examined).",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f13",
      "text": "Two of the three persons against whom summons issued were eventually committed for trial before Court of Sessions (outcome uncertain).",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "On March 22, 1961, High Court stayed committal proceedings against Asim Mondal and Arun Mondal pending disposal of this appeal.",
      "type": "procedural",
      "date": "1961-03-22",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether respondent No. 1 had locus standi to appear and contest a criminal case before the issue of process.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the test propounded by the learned single judge of the High Court for determining whether process should be issued was erroneous.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether a Magistrate making an enquiry under s. 202 Cr.P.C. had jurisdiction to weigh the evidence in golden scales.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the Sub-Divisional Magistrate acted in contravention of s. 203 Cr.P.C. in dismissing the complaint without recording reasons.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Respondent No. 1 had no locus standi to appear and contest before issue of process; Magistrate had no jurisdiction to permit participation or examine witnesses at his instance.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Ch. XVI Cr.P.C.; s. 202 Cr.P.C."
    },
    {
      "id": "pa2",
      "text": "Test propounded by single judge erroneous: Magistrate to see if sufficient ground for proceeding, not for conviction.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "s. 202 Cr.P.C."
    },
    {
      "id": "pa3",
      "text": "Magistrate under s. 202 Cr.P.C. has no jurisdiction to weigh evidence like at trial.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "s. 202 Cr.P.C."
    },
    {
      "id": "pa4",
      "text": "Sub-Divisional Magistrate dismissed complaint without recording reasons, contravening s. 203 Cr.P.C.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "s. 203 Cr.P.C."
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Accused can waive privilege under Ch. XVI Cr.P.C. and participate in enquiry to prevent harassment by frivolous complaint.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s. 202 Cr.P.C."
    },
    {
      "id": "ra2",
      "text": "Enquiring Magistrate right to examine Pannalal Saha and Sankar Ghosh; desirable for careful enquiry given prior police investigation; complaints were Naraji petitions, one inquiry proper.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Error in not recording reasons curable under s. 537 Cr.P.C.; only one offence, so no further enquiry needed as others tried.",
      "supporting_facts": [
        "f9",
        "f13"
      ],
      "legal_basis": "s. 537 Cr.P.C.; Willie (William) Slaney v. State of MP"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under Ch. XVI Cr.P.C., accused has no right to participate in enquiry before process issued; Magistrate cannot permit or examine witnesses at accused's instance. Enquiry vitiated as Pannalal Saha and Sankar Ghosh examined at respondent's counsel instance.",
      "addresses_issue": "i1",
      "key_observation": "Accused may be present but cannot take part; enquiry to ascertain truth of complaint, not trial."
    },
    {
      "id": "cr2",
      "text": "Test for process: sufficient ground for proceeding, not conviction. Enquiry under s. 202 not trial; Magistrate ascertains if evidence supports allegations, not weighs for guilt.",
      "addresses_issue": "i2",
      "key_observation": "High Court judge's test wholly wrong; cited precedents confirm scope."
    },
    {
      "id": "cr3",
      "text": "s. 202 enquiry not to weigh evidence in golden scales; only consider complainant's material, not extraneous police investigation or other complaints.",
      "addresses_issue": "i3",
      "key_observation": "High Court improperly considered police evidence, other complaint witnesses; Magistrate cannot do what High Court cannot."
    },
    {
      "id": "cr4",
      "text": "s. 203 requires brief reasons for dismissal after considering enquiry result; no reasons given, and considered extraneous matter; prejudice to complainant.",
      "addresses_issue": "i4",
      "key_observation": "Error goes to root; not curable; complainant entitled to know reasons for revision."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Accused has no locus standi to participate in s. 202 enquiry before process; Magistrate cannot permit or act on accused's suggestions.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Magistrate under s. 202/203 to determine if sufficient ground for proceeding based on complainant's material only, not weigh for conviction or consider extraneous evidence.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Enquiry Magistrate cannot weigh evidence like trial; High Court erred in doing so.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "s. 203 mandates recording brief reasons for dismissal; absence prejudices complainant.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h5",
      "text": "Where prima facie case exists, even if defence possible, must issue process; matter for trial.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Vadilal Panchal v. Dattatraya Dulaji Ghadigsonkar",
      "citation": "1961 1 S.C.R. 1",
      "treatment": "followed",
      "relevance": "Enquiry under s. 202 to ascertain truth/falsehood of complaint for process, not trial; Magistrate can consider plea like private defence if misdirection absent."
    },
    {
      "case_name": "Parmanand Brahmachari v. Emperor",
      "citation": "A.I.R. 1949 Pat. 36",
      "treatment": "referred",
      "relevance": "Scope of s. 202 enquiry: opinion on process issuance, not conviction."
    },
    {
      "case_name": "Radha Kishun Sao v. S. K. Misra",
      "citation": "A.I.R. 1931 Bom. 524",
      "treatment": "referred",
      "relevance": "Object of s. 202: form opinion on process, consider complainant evidence."
    },
    {
      "case_name": "Ramkisto Sahu v. The State of Bihar",
      "citation": "A.I.R. 1930 Pat. 30",
      "treatment": "referred",
      "relevance": "s. 202 enquiry not trial; see if evidence supports allegations."
    },
    {
      "case_name": "Emperor v. J. A. Finan",
      "citation": "A.I.R. 1952 Pat. 125",
      "treatment": "referred",
      "relevance": "Magistrate sees evidence in support, not sufficiency for conviction."
    },
    {
      "case_name": "Baidya Nath Singh v. Muspratt",
      "citation": "1886 I.L.R. 14 Cal. 141",
      "treatment": "referred",
      "relevance": "Scope of s. 202 enquiry."
    },
    {
      "case_name": "Ramgopal Ganpatrai Ruia v. The State of Bombay",
      "citation": "1958 S.C.R. 618",
      "treatment": "followed",
      "relevance": "Prima facie case requires committal even if much to be said on both sides."
    },
    {
      "case_name": "Willie (William) Slaney v. The State of Madhya Pradesh",
      "citation": "1955 2 S.C.R. 1140",
      "treatment": "distinguished",
      "relevance": "Errors curable under s. 537 if no prejudice; here prejudice exists."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "202",
        "203",
        "537"
      ],
      "relevance": "s.202: Enquiry before process to ascertain truth of complaint; s.203: Dismissal requires reasons after considering enquiry; s.537: Curable irregularities."
    },
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "302/34"
      ],
      "relevance": "Murder with common intention alleged."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "134(1)(c)"
      ],
      "relevance": "Certificate for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order set aside; Sub-Divisional Magistrate directed to make further enquiry into appellant's complaint against respondent No. 1. Noted stay on committal of others pending appeal.",
    "relief_granted": "Further enquiry into complaint against respondent No. 1",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the very question for consideration being whether he should be called upon to face an accusation, he has no right to take part in the proceedings nor has the Magistrate any jurisdiction to permit him to do so.\"",
      "speaker": "court",
      "significance": "Defines accused's non-participation in pre-process enquiry."
    },
    {
      "text": "\"For determining the question whether any process is to be issued or not, what the Magistrate has to be satisfied is whether there is sufficient ground for proceeding and not whether there is sufficient ground for the conviction.\"",
      "speaker": "court",
      "significance": "Core test for issuing process under s.202/203 Cr.P.C."
    },
    {
      "text": "\"The enquiry is for the purpose of ascertaining the truth or falsehood of the complaint that is, for ascertaining whether there is evidence in support of the complaint so as to justify the issue of process.\"",
      "speaker": "court",
      "significance": "Quotes Vadilal on limited scope of s.202 enquiry."
    }
  ],
  "_case_id": "1963_1",
  "_label": 1,
  "_text_length": 26095,
  "_extracted_at": "2026-02-10T19:47:13.167210"
}