{
  "metadata": {
    "case_name": "Babu Lal v. Jairam and others",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No.708 of 1962",
    "date_of_judgment": "1963-09-18"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Jairam and three others (plaintiffs) sued Babu Lal in the Court of the Munsiff, Koil, District Aligarh, for a decree for possession of a strip of land, for removal of a wall and a slab of stone and for an injunction restraining the making of certain constructions in the northern wall of the plaintiffs' house.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Plaintiffs claimed that Mohini wife of Jairam the first plaintiff had purchased the house occupied by them by sale deed dated August 1, 1932 from the vendor who was also named Mohini, who in her turn had purchased the house by sale deed dated July 25, 1917 from the original owner Kishan Lal.",
      "type": "background",
      "date": "1932-08-01",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Babu Lal who is the son of Kishan Lal pleaded that the vendor Mohini had acquired only a life interest in the house by the deed under which the property was conveyed to her by Kishan Lal and the plaintiffs' predecessor-in-interest had acquired no title under the sale deed dated August 1, 1932.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "In support of this plea Babu Lal gave evidence at the trial of the suit and tendered in evidence an agreement dated July 25, 1917 purported to be executed by Mohini to whom Kishan Lal had conveyed the house reciting that the sale deed in her favour was without consideration and that she had only a life interest in the house.",
      "type": "material",
      "date": "1917-07-25",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The Trial judge held that the agreement relied upon by Babu Lal was not genuine and that Mohini, predecessor-in-interest of the plaintiffs had under the sale deed dated August 1, 1932 acquired title to the house in dispute and on that footing decreed the suit.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Before the suit was disposed of by the Munsiff the plaintiffs had applied that action be taken against Babu Lal under s. 479A of the Code of Criminal Procedure, because Babu Lal had given false evidence before the Court, that he had forged the agreement relied upon by him, and that he had fabricated false evidence and had used such fabricated evidence at the trial, and had thereby committed offences punishable under ss. 193, 209, 463 and 471 of the Indian Penal Code.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The Munsiff did not dispose of the application by his judgment deciding the suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "After the disposal of the suit the plaintiffs moved the Munsiff for an order on the application filed by them.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "The Munsiff held that no action could be taken against Babu Lal for the offence of intentionally giving false evidence or intentionally fabricating false evidence for the purpose of being used in the suit for such action was barred by s. 479A Code of Criminal Procedure, but in his opinion it was expedient in the interest of justice that a complaint be filed against Babu Lal for offences under ss. 463 and 471 I.P. Code.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Pursuant to this order on May 30, 1959 a complaint was filed against Babu Lal charging him with committing an offence under s. 471 read with s. 463 Indian Penal Code by using the agreement dated July 25, 1917 knowing or having reason to believe that it was a forged document.",
      "type": "procedural",
      "date": "1959-05-30",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The order passed by Trial Court was confirmed in appeal by the District Judge, Aligarh and a revision application to the High Court of Allahabad challenging the order was dismissed on January 31, 1962.",
      "type": "procedural",
      "date": "1962-01-31",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "In appeal to the District Court the finding that the agreement was not genuine was not challenged.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Munsiff could, after not recording a finding under s.479A CrPC at the time of judgment, subsequently make a complaint under s.476 CrPC for offences under ss.463 and 471 IPC regarding the use of a forged document.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether s.479A CrPC bars proceedings under s.476 CrPC for offences like s.471 IPC which do not fall within the specific categories of intentionally giving false evidence or fabricating false evidence by a witness.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "A complaint for an offence under s. 471 Indian Penal Code may also be made under s. 479A Code of Criminal Procedure and not otherwise.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "s.479A CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Trial Court accepted the restriction under s.479A and correctly directed complaint under s.476 for using forged document.",
      "supporting_facts": [
        "f5",
        "f9"
      ],
      "legal_basis": "s.476 CrPC, ss.463, 471 IPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 479A applies only to prosecution of a witness who has intentionally given false evidence or intentionally fabricated false evidence for use in judicial proceeding; it does not cover offence under s.471 IPC of using as genuine a forged document.",
      "addresses_issue": "i1",
      "key_observation": "Sub-s.6 of s.479A excludes ss.476-479 only for cases within sub-s.1, which is limited to s.193 IPC type offences by witnesses."
    },
    {
      "id": "cr2",
      "text": "The Munsiff did not record at time of judgment that it was expedient to prosecute for false evidence or fabrication under s.479A, so could not later do so; but could proceed under s.476 for forgery/use offences.",
      "addresses_issue": "i1",
      "key_observation": "Offences of forgery (ss.463,471 IPC) and fabricating false evidence (s.192 IPC) are distinct."
    },
    {
      "id": "cr3",
      "text": "Cited precedents confirm s.479A special procedure only for perjury/fabrication by witness, not other offences affecting justice administration.",
      "addresses_issue": "i2",
      "key_observation": "s.476 remains applicable for offences like s.471 IPC."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s.479A CrPC has limited operation to offences of intentionally giving false evidence or fabricating false evidence by a witness; does not preclude s.476 for other offences like using forged document under s.471 IPC.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Offences under ss.463, 471 IPC are distinct from fabricating false evidence under s.193 IPC and fall under s.476 procedure.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Raghubir Prosad Dudhtvalla v. Chamanlal Mehra and another",
      "citation": "1964 3 S.C.R. 980",
      "treatment": "followed",
      "relevance": "Special procedure of s.479A only for giving false evidence or fabrication by witness; does not preclude other procedures for other offences."
    },
    {
      "case_name": "Shabir Hussain Bholu v. State of Maharashtra",
      "citation": "1963 Supp. 1 S.C.R. 501",
      "treatment": "followed",
      "relevance": "s.476 general for offences affecting justice; s.479A exclusive only for specific witness perjury offences."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "476",
        "476A",
        "476B",
        "478",
        "479",
        "479A"
      ],
      "relevance": "Prescribes procedures for complaints on offences affecting administration of justice; s.479A mandatory and exclusive for perjury/fabrication by witnesses at time of judgment."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "193",
        "194",
        "195",
        "209",
        "192",
        "463",
        "464",
        "471"
      ],
      "relevance": "ss.193 etc. for false evidence/fabrication; ss.463,471 for forgery and using forged document, distinct offences allowing s.476 procedure."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by Babu Lal against the order directing a complaint under s.476 CrPC for offence under s.471/463 IPC is dismissed, upholding the trial court's, district court's and high court's orders.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The special procedure of s. 479A is prescribed only for the prosecution of a witness for the act of giving false evidence in any stage of judicial proceeding or for fabrication of false evidence for the purpose of being used in any stage of a judicial proceeding.",
      "speaker": "court",
      "significance": "Defines limited scope of s.479A CrPC."
    },
    {
      "text": "The offences of forgery and of fabricating false evidence for the purpose of using it in a judicial proceeding are therefore distinct, and within the description of fabricating false evidence for the purpose specified in s.479A Criminal Procedure Code, the offence of forgery is not included.",
      "speaker": "court",
      "significance": "Distinguishes forgery from fabrication of false evidence."
    }
  ],
  "_case_id": "1963_80",
  "_label": 0,
  "_text_length": 12948,
  "_extracted_at": "2026-02-10T19:48:18.633125"
}