{
  "metadata": {
    "case_name": "Mcleod Company Ltd. v. its workmen",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, J."
    ],
    "case_number": "Civil Appeal No. 514 of 1963",
    "date_of_judgment": "1963-11-29"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Industrial dispute between appellant Mcleod Company Ltd. and respondents its workmen centered round two claims: cash allowance in lieu of tiffin arrangements and discontinuation of re-employment of retired persons.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Fourth Industrial Tribunal, West Bengal awarded on August 21, 1962 in Case No. VIII-332 of 1961: clerical staff As. 8/- per day, subordinate staff As. 6/- per day in lieu of tiffin; stop re-employment of retired workmen in clerks above C grade.",
      "type": "procedural",
      "date": "1962-08-21",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Total employees: 453 (36 officers, 90 junior grade Assistants, 196 clerks, 131 subordinate staff). Disputes concern clerks and subordinate staff.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1956 industrial dispute, tiffin claim not pressed, left to appellant's discretion. Post-award negotiations led to settlement: two cups tea and two biscuits to clerical staff, one cup tea and one biscuit to subordinate staff; same on Saturdays.",
      "type": "background",
      "date": "1956",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Current tiffin arrangements unsatisfactory per respondents.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "31 comparable concerns in region supply free tiffin to employees (Ext. 10).",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Appellant started canteen under Factories Act; no statutory obligation for tiffin cash allowance. Wage structure fair with dearness allowance per Bengal Chamber of Commerce Formula.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "6 retired persons re-employed, sometimes at reduced salary e.g. Chandi Charan Banerjee: pre-retirement Rs. 380 basic + DA, post Rs. 250 consolidated (half former wages for same work).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "1960 dispute on re-employment raised, State Government refused reference (only 4 cases noticed). Later representations noted assurances disregarded.",
      "type": "procedural",
      "date": "1960",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Re-employments partly humanitarian, but respondents contended not solely so.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Re-employed persons filed affidavit supporting practice.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Tribunal erred in directing cash allowance in lieu of tiffin (As. 8/- clerical, 6/- subordinate per working day).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Tribunal erred in partially directing stoppage of re-employment of retired workmen in clerks above C grade.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No obligation statutory or otherwise to provide tiffin cash allowance; canteen under Factories Act sufficient; fair wage structure with DA per Bengal Chamber formula accounts for cost of living.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Factories Act"
    },
    {
      "id": "pa2",
      "text": "Re-employment of retired persons inspired by humanitarian considerations; should not be stopped.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Tiffin arrangements unsatisfactory; demand cash allowance; practice in 31 comparable concerns provides free tiffin.",
      "supporting_facts": [
        "f5",
        "f6",
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Practice of re-employing retired persons at lower wages blocks promotions and introduces inferior wage structure; not solely humanitarian.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "History of relations, 1956 negotiations, prevailing practice in comparable concerns make tiffin provision an implied condition of service/amenity; no error in Tribunal's direction for cash allowance.",
      "addresses_issue": "i1",
      "key_observation": "Appellant throughout provided tiffin; sympathetic consideration post-1956 award."
    },
    {
      "id": "cr2",
      "text": "Re-employments at reduced salary inferior to award wage structure, impermissible under industrial law; hampers junior promotions; limited direction justified despite humanitarian motives in some cases.",
      "addresses_issue": "i2",
      "key_observation": "Re-employed get half wages for same work; affidavits from re-employed not material."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Tiffin cash allowance is implied condition of service based on history and comparable practices; Tribunal's direction upheld.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Re-employment at inferior wages impermissible under industrial law; stop in clerks above C grade justified.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Factories Act",
      "sections": [],
      "relevance": "Relevant provisions required canteen; no further obligation for tiffin but history created implied term."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against Tribunal award dismissed; upheld directions for tiffin cash allowance to clerical (As. 8/-) and subordinate staff (As. 6/-) per working day, and stop re-employment of retired in clerks above C grade.",
    "relief_granted": "Tribunal award upheld in favour of respondents.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the history of the relations between the parties coupled with the prevailing practice in the comparable concerns in the region strongly supports the view taken by the Tribunal that in the appellants concern it was an implied condition of service that... a provision for tiffin was an amenity\"",
      "speaker": "court",
      "significance": "Justifies upholding tiffin allowance as implied term."
    },
    {
      "text": "\"if re-employments are made on the basis of reduced salary, that really means that the appellant is introducing a wage structure in respect of the reemployed personnel which is definitely inferior to the wage structure devised for the employees of the appellant by the award , and that clearly cannot be permitted under industrial law.\"",
      "speaker": "court",
      "significance": "Key reason for restricting re-employment."
    }
  ],
  "_case_id": "1963_182",
  "_label": 0,
  "_text_length": 9198,
  "_extracted_at": "2026-02-10T19:49:26.966306"
}