{
  "metadata": {
    "case_name": "Appellant (Tenant) v. Respondent (Landlord)",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR J."
    ],
    "case_number": "Civil Appeal No. 14 of 1963",
    "date_of_judgment": "1963-03-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Premises let out to appellant by respondent under rent-note executed on December 8, 1953, for five years, for use as Oil Mill.",
      "type": "background",
      "date": "1953-12-08",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Lease terms: appellant to pay agreed rent monthly; default for three months entitled respondent to evict before expiry and claim remaining rent.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent received rent from appellant up to October 31, 1957; thereafter appellant defaulted despite demands, failed to pay house tax.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Appellant's tenancy expired on December 1, 1958 by efflux of time, but appellant failed to deliver possession.",
      "type": "material",
      "date": "1958-12-01",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Appellant deposited lump sum of Rs. 1053/- to cover period from November 1, 1957 to November 30, 1958.",
      "type": "procedural",
      "date": "1958-12-02",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Respondent alleged appellant committed more than three defaults in payment of rent of two months each during 18 months, plus arrears of rent/mesne profits for 5 months and 2 days at suit date.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Respondent sued appellant for ejectment on May 2, 1959, in Court of Munsif, East Jaipur City.",
      "type": "procedural",
      "date": "1959-05-02",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant denied defaults, claimed protection under section 13(1)(a) of Rajasthan Premises (Control of Rent and Eviction) Act, 1950; alleged waiver by respondent's acceptance of rent.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "At first hearing in trial court, appellant deposited Rs. 648/- on account of rent due up to that date, accepted by respondent without prejudice.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Trial court framed issues, principal issue: whether appellant committed three defaults of two months within 18 months; found in favour of appellant, dismissed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Respondent appealed to Additional Sessions Judge, Jaipur City; appellate court held three defaults committed, set aside trial decree, allowed ejectment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellant filed second appeal to Rajasthan High Court; single judge dismissed, rejected leave under Letters Patent.",
      "type": "procedural",
      "date": "1962-07-30",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appellant applied for special leave to Supreme Court, granted on September 26, 1962.",
      "type": "procedural",
      "date": "1962-09-26",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "In SLP petition, ground 6 stated respondent claimed eviction based on non-payment from December 2, 1958, but appellate courts set up new case on prior defaults; paragraph 3 of plaint specifically referred to defaults from November 1, 1957 to November 30, 1958.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "SLP ground stated appellant became statutory tenant, no default after December 1, 1958; omitted that deposit accepted without prejudice.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Appellant invested large amounts in machinery for Oil Mill in premises.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether special leave granted to appellant should be revoked due to inaccurate and misleading statements in special leave petition.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Construction of section 13(1)(a) of the Act read with section 13(4).",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Respondent not entitled to ejectment by virtue of section 13(1)(a) of the Act; waiver by acceptance of rent; no defaults.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 13(1)(a) Rajasthan Premises (Control of Rent and Eviction) Act, 1950"
    },
    {
      "id": "pa2",
      "text": "High Court misconstrued section 13(1)(a); appellate courts set up new case on defaults prior to December 2, 1958 not relied on in plaint; became statutory tenant, no default after December 1, 1958.",
      "supporting_facts": [
        "f14",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Counsel did not refer to impugned grounds at special leave stage, only urged misconstruction of section 13(1)(a); statements carried from High Court appeal.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant committed more than three defaults of two months each in 18 months; entitled to ejectment; plaint para 3 specifically alleged defaults from November 1957-November 1958.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "SLP contained serious misstatements: ground 6 wholly untrue about plaint; another untrue about no default after Dec 1, 1958 omitting 'without prejudice'; special leave obtained on misrepresentations.",
      "supporting_facts": [
        "f14",
        "f15",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No need to deal with merits as respondent's prayer to revoke special leave well-founded due to inaccurate, untrue, misleading statements in SLP petition.",
      "addresses_issue": "i1",
      "key_observation": "Paragraph 3 of plaint specifically refers to defaults Nov 1957-Nov 1958; ground 6 wholly untrue."
    },
    {
      "id": "cr2",
      "text": "SLP statement on no default after Dec 1, 1958 untrue as deposit accepted without prejudice; statements if true would assist under s.13(1)(a).",
      "addresses_issue": "i1",
      "key_observation": "Omission of 'without prejudice' material."
    },
    {
      "id": "cr3",
      "text": "Court takes SLP statements at face value; unfair to betray confidence with untrue/misleading statements; what urged at admission not decisive as different counsel/bench possible.",
      "addresses_issue": "i1",
      "key_observation": "Utmost importance to avoid inaccurate statements in SLP applications."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Special leave granted to appellant revoked due to material inaccurate, untrue, misleading statements in petition.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Rajasthan Premises (Control of Rent and Eviction) Act, 1950 (Act XVII of 1950)",
      "sections": [
        "13(1)(a)",
        "13(4)"
      ],
      "relevance": "Provision protecting tenant from eviction; construction not reached on merits"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Special leave revoked and appeal dismissed due to misstatements in special leave petition; appellant to pay respondent's costs; on unconditional undertaking, respondent not to execute ejectment decree for six months from judgment date to allow vacating premises.",
    "relief_granted": "Six months time to vacate on undertaking",
    "costs": "Appellant to pay costs of respondent"
  },
  "key_quotes": [
    {
      "text": "It is of utmost importance that in making material statements and setting forth grounds in applications for special leave, care must be taken not to make any statements which are inaccurate, untrue or misleading.",
      "speaker": "court",
      "significance": "Core principle justifying revocation of special leave"
    },
    {
      "text": "In dealing with applications for special leave, the Court naturally takes statements of fact and grounds of fact contained in the petitions at their face value and it would be unfair to betray the confidence of the Court by making statements which are untrue and misleading.",
      "speaker": "court",
      "significance": "Explains why misstatements warrant revocation"
    }
  ],
  "_case_id": "1963_41",
  "_label": 0,
  "_text_length": 11320,
  "_extracted_at": "2026-02-10T19:47:41.471419"
}