{
  "metadata": {
    "case_name": "London Rubber Co. Ltd. v. Durex Products Inc.",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar J."
    ],
    "case_number": "Civil Appeal No. 26 of 1961",
    "date_of_judgment": "1963-03-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Durex Products Inc., of New York City, U.S.A. made an application before the Deputy Registrar of Trade Marks on May 28, 1946 for registering the mark Durex used by it on contraceptive devices including prophylactic sheaths or condoms, vaginal diaphragms, instruments for inserting diaphragms and models for demonstrating insertion of diaphragms, vaginal jellies, applicators for vaginal jellies and surgical lubricating jellies.",
      "type": "material",
      "date": "1946-05-28",
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "London Rubber Co., Ltd., London, the appellant, claims to be well-established manufacturer of surgical rubber goods and proprietor in India of the trade mark Durex which it has been using in India since the year 1932 i.e., from the year in which it was registered in the United Kingdom.",
      "type": "background",
      "date": "1932",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "On December 23, 1946 the appellant applied for registration of the word Durex in clause X which application was granted on July 11, 1951. Thereafter, on July 24, 1954 the registration was renewed for a period of 15 years as from December 23, 1953.",
      "type": "procedural",
      "date": "1946-12-23",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The appellant lodged an opposition to the registration on March 29, 1951.",
      "type": "procedural",
      "date": "1951-03-29",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "The Deputy Registrar of Trade Marks, by order dated December 31, 1954, overruled the objection and admitted the mark Durex to registration as sought by the respondent No. 1.",
      "type": "procedural",
      "date": "1954-12-31",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "An appeal was preferred before the High Court of Calcutta under s. 76 of the Trade Marks Act, 1949 which was dismissed by a Division Bench of that Court on March 9, 1959.",
      "type": "procedural",
      "date": "1959-03-09",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appeal to Supreme Court by certificate granted by the High Court of Calcutta under Art. 133(1)(c) of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Durex Products Inc. has done a substantial business in India since 1930, with use of the mark from 1928.",
      "type": "admitted",
      "date": "1928",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Respondent's goods are confined to contraceptives for use by women which can only be used with medical assistance while the appellant's contraceptives are essentially for men.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Throughout there has not been a single instance of confusion.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Deputy Registrar of Trade Marks, Calcutta, was right in admitting to registration the trade mark Durex which respondent No. 1 claims to own and is using on the packing of the contraceptives manufactured and marketed by it, despite the identical mark of the appellant.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether s.8(a) prohibits registration absolutely or whether s.10(2) permits registration in case of honest concurrent use or other special circumstances even if s.8(a) applies.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether there was honest concurrent use by the respondent and special circumstances justifying registration under s.10(2).",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "As the marks are identical, deception of various purchasers was inevitable and therefore registration had to be refused under s.8(a) of the Act.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Section 8(a) of Trade Marks Act, 1949"
    },
    {
      "id": "pa2",
      "text": "The Deputy Registrar was in error in applying the provisions of s.10(2) of the Act inasmuch as the provisions of s.8(a) are not subject to those provisions.",
      "supporting_facts": [],
      "legal_basis": "Section 10(2) is proviso to s.10(1), which applies only where a competing trade mark is already on the register"
    },
    {
      "id": "pa3",
      "text": "Requirements of s.10(2) were not satisfied: no concurrent use within the meaning due to insufficient volume of use.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Section 10(2) Trade Marks Act, 1940"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Honest concurrent use of the mark from 1928 with substantial business in India since 1930.",
      "supporting_facts": [
        "f1",
        "f8"
      ],
      "legal_basis": "Section 10(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.8(a) is a general provision prohibiting registration of marks likely to deceive or cause confusion; s.10(1) limited to cases where a mark is already registered; s.10(2) permits registration by more than one proprietor in case of honest concurrent use or special circumstances, irrespective of whether a mark is already on the register.",
      "addresses_issue": "i2",
      "key_observation": "Provisions of s.10(2) are by way of exception to prohibitory provisions of s.8(a) and s.10(1)"
    },
    {
      "id": "cr2",
      "text": "Honest concurrent use established: substantial business since 1930, commercial use, no hard and fast rule on volume; accepted affidavits including Florence S. Goodwin's.",
      "addresses_issue": "i3",
      "key_observation": "Use has been substantial; volume depends on facts, commercial use sufficient"
    },
    {
      "id": "cr3",
      "text": "Special circumstances: (1) word Durex is the name of the company itself; (2) use for considerable period since 1928; (4) applicant's mark confined to contraceptives for women, different from appellant's for men.",
      "addresses_issue": "i3",
      "key_observation": "Special circumstances connected with use of the mark justify registration"
    },
    {
      "id": "cr4",
      "text": "No reasonable probability of confusion: no single instance of confusion; goods differ (women vs men contraceptives).",
      "addresses_issue": "i1",
      "key_observation": "Hardly any likelihood of confusion or deception"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s.10(2) applies even where identical mark not yet registered; honest concurrent use and special circumstances permit registration by more than one proprietor.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Honest concurrent use by respondent established for considerable period.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Special circumstances justify registration of respondent's mark.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Re Hack's Application",
      "citation": "1940 58 R.P.C. 91",
      "treatment": "referred",
      "relevance": "Registrar has discretion to register or not after deciding question of fact on likelihood of deception"
    },
    {
      "case_name": "Re Arthur Fairest Ltd's Application",
      "citation": null,
      "treatment": "referred",
      "relevance": "Discretion against applicant requires positive objection usually from illegality"
    },
    {
      "case_name": "Snow v. Dunn",
      "citation": "1890 15 A.C. 252",
      "treatment": "referred",
      "relevance": "Deception from resemblance to registered or unregistered mark or trade name"
    },
    {
      "case_name": "Ram Narain Sons Ltd. v. Assistant Commissioner of Sales Tax",
      "citation": "1955 2 S.C.R. 483",
      "treatment": "distinguished",
      "relevance": "Proviso limited to main provision; not applicable here as s.10(2) not labelled proviso"
    },
    {
      "case_name": "Bass v. Nicholson",
      "citation": "1932 49 R.P.C. 88",
      "treatment": "followed",
      "relevance": "Trade mark not necessarily disentitled if deceives; s.11 does not override s.12(2) of English Act"
    },
    {
      "case_name": "Spillers Ltd's Application",
      "citation": "1952 69 R.P.C. 327",
      "treatment": "followed",
      "relevance": "s.12(2) discretion applies even if confusion under s.11; consider s.12(2) first"
    },
    {
      "case_name": "Holt & Co. (Leeds) Ltd Application",
      "citation": "1957 R.P.C. 289",
      "treatment": "followed",
      "relevance": "Special circumstances include any peculiar to application, e.g., use before conflicting mark"
    },
    {
      "case_name": "Lyle & Kinahan Ltd's Application",
      "citation": "24 R.P.C. 249",
      "treatment": "referred",
      "relevance": "Volume of use need not be larger than opponent's"
    },
    {
      "case_name": "Huxley's Application",
      "citation": "1924 41 R.P.C. 423",
      "treatment": "referred",
      "relevance": "s.12(1) more effective where opponent registered but no reputation proved"
    },
    {
      "case_name": "Alexander Pirie & Sons Ltd's Application",
      "citation": "1933 50 R.P.C. 147",
      "treatment": "referred",
      "relevance": "Honest concurrent use disposes of objection under general prohibition"
    },
    {
      "case_name": "Be Kidax (Shirts) Ltd's Application",
      "citation": "1960 R.P.C. 117 C.A.",
      "treatment": "referred",
      "relevance": "Honest concurrent use without confusion"
    }
  ],
  "statutes_cited": [
    {
      "name": "Trade Marks Act, 1949",
      "sections": [
        "Section 8(a)",
        "Section 10(1)",
        "Section 10(2)",
        "Section 10(3)",
        "Section 76"
      ],
      "relevance": "Prohibits registration of deceptive marks but permits under s.10(2) for honest concurrent use or special circumstances"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(c)"
      ],
      "relevance": "Certificate for appeal to Supreme Court"
    },
    {
      "name": "Trade Marks Act, 1940",
      "sections": [],
      "relevance": "Basis for Indian Act; compared to English Act 1938"
    },
    {
      "name": "Trade Marks Act, 1938 (UK)",
      "sections": [
        "Section 11",
        "Section 12(1)",
        "Section 12(2)",
        "Section 12(3)"
      ],
      "relevance": "Corresponding provisions to ss.8 and 10 of Indian Act"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The Supreme Court upholds the Deputy Registrar and High Court's decision permitting registration of respondent's 'Durex' mark under s.10(2) on grounds of honest concurrent use since 1928 and special circumstances.",
    "relief_granted": "Registration of Durex mark permitted for respondent",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In case of honest concurrent use or of other special circumstances which, in the opinion of the Registrar, make it proper so to do he may permit the registration by more than one proprietor of trade marks which are identical or nearly resemble each other\" - s.10(2)",
      "speaker": "court",
      "significance": "Core provision enabling dual registration"
    },
    {
      "text": "The provisions of sub-s. (2) of s. 10 are by way of an exception to the prohibitory provisions of the Trade Marks Act. Those provisions are contained in s. 8(a) and s. 10(1).",
      "speaker": "court",
      "significance": "Key holding on interplay of sections"
    },
    {
      "text": "\"There is hardly any likelihood of confusion or deception here because the respondents goods are confined to contraceptives for use by women which can only be used with medical assistance while the appellants contraceptives are essentially for men.\"",
      "speaker": "court",
      "significance": "Explains no deception despite identical marks"
    }
  ],
  "_case_id": "1963_220",
  "_label": 0,
  "_text_length": 33086,
  "_extracted_at": "2026-02-10T19:50:24.309371"
}