{
  "metadata": {
    "case_name": "Bai Velbai K. Jadhavji v. Commissioner of Income-tax",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "K. DAS J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is the widow of Kanji Jadhavji who had extensive businesses including stevedoring, company hauling, freight brokerage, clearing and forwarding, loading and unloading of steamers, chartering of steamers.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant inherited the businesses on the death of her husband.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Husband died in 1931, under his will appellant had to disburse legacies worth Rs. 2,50,000.",
      "type": "background",
      "date": "1931",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "For assessment year 1947-48 (accounting year calendar year 1946), appellant assessed on total income of Rs. 3,69,371, reduced to Rs. 2,99,471 by Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": "1947-48",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Income-tax Officer added Rs. 1,38,000 as income from undisclosed sources being amount of certain high denomination notes encashed by appellant.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellant encashed 246 high denomination currency notes of total value Rs. 2,46,000 in January 1946 when High Denomination Notes Demonetisation Ordinance promulgated.",
      "type": "material",
      "date": "1946-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Declaration by appellant on encashment: sources were 1. movable and immovable properties including cash left by husband, 2. profits from inherited business, 3. rents and income from landed properties, 4. moneys withdrawn from business from time to time, 5. three fixed deposits withdrawn in 1942 during WWII panic.",
      "type": "admitted",
      "date": "1946-01",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "ITO held 8 notes formed part of day-to-day cash balance of business; out of remaining 238 notes (Rs. 2,38,000), Rs. 1,00,000 at most savings, balance Rs. 1,38,000 undisclosed income.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "No books available for 1944-45 and first four months of 1945-46 due to explosion in Bombay docks on April 14, 1944.",
      "type": "background",
      "date": "1944-04-14",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant appealed to AAC; AAC called for statements of income returned/assessed 1931-1945, capital accounts and withdrawals 1936-37 to 1946-47; successor AAC upheld addition, dismissed appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appeal to Tribunal; Tribunal by order May 6, 1959 held no positive and tangible proof relating encashment of Rs. 2,38,000 HDN to previous savings/withdrawals, dismissed appeal.",
      "type": "procedural",
      "date": "1959-05-06",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellant applied to Tribunal for reference of questions of law u/s 66(1) Income-tax Act 1922; Tribunal rejected holding no question of law arose.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appellant applied to High Court u/s 66(2); HC summarily dismissed on March 27, 1961.",
      "type": "procedural",
      "date": "1961-03-27",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Supreme Court granted special leave to appeal from HC order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appellant had accounts: Bai Velbai Kanji account (withdrawals 1934-1945 nearly two lakhs, used for legacies); Bai Velbai Kanji personal account (dividend, interest credited, no appreciable withdrawals).",
      "type": "material",
      "date": "1934-1945",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Property investments over five lakhs in late thirties; fixed deposits Rs. 4,98,041 swelled to Rs. 5,40,774 by 1940-41; withdrew Rs. 4,00,220 in early 1942 (war panic), reinvested Rs. 2,53,980 municipal bonds Sept 1942, Rs. 70,000 shares 1943, further 1945 municipal debentures.",
      "type": "material",
      "date": "1930s-1945",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Soon after encashment, Rs. 2,14,000 reinvested in municipal debentures, Rs. 24,000 in Scindia shares.",
      "type": "material",
      "date": "1946",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Withdrawals from capital accounts in businesses 1936-37 to 1945-46; some transfer entries but cash withdrawals in 1939-40 to 1945-46.",
      "type": "disputed",
      "date": "1936-1946",
      "source": "petitioner"
    },
    {
      "id": "f19",
      "text": "Appellant's letter dated November 19, 1957 explaining sources of income and withdrawals 1932-34.",
      "type": "material",
      "date": "1957-11-19",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was any evidence or material to support the finding of the Tribunal that Rs. 1,38,000 represented appellant's income from undisclosed sources.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the conclusion of the Tribunal that Rs. 1,38,000 was income from undisclosed sources was perverse in the sense that no reasonable man could come to it on the materials on record.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the said conclusion was based on conjecture, surmise or suspicion and on a failure to consider relevant evidence on record.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether any questions of law arise out of the Tribunal's order dated May 6, 1959.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Tribunal's finding that Rs. 1,38,000 is income from undisclosed sources based on no evidence, but on conjecture and surmise; vitiated by failure to consider crucial matters like cash withdrawals from business capital accounts 1936-37 to 1945-46, total withdrawals from business and fixed deposits come to Rs. 6,00,000.",
      "supporting_facts": [
        "f18",
        "f7",
        "f16"
      ],
      "legal_basis": "Section 66 Income-tax Act 1922"
    },
    {
      "id": "pa2",
      "text": "No evidence that legacy disbursements spread over long period; ITO inconsistently excluded then included withdrawals for expenses/legacies based on surmise.",
      "supporting_facts": [
        "f3",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Distinction between Rs. 1,00,000 and Rs. 1,38,000 not based on particular materials; Tribunal failed to consider explanation for remaining Rs. 76,000 after reinvestments.",
      "supporting_facts": [
        "f8",
        "f16"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant not type to keep large savings uninvested at home; HDN not relatable to accumulated savings from 1931; withdrawals from fixed deposits reinvested, not plausible source for cash; shrewd investor, impossible to keep Rs. 2,50,000 idle.",
      "supporting_facts": [
        "f15",
        "f16",
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Capital accounts for inter-departmental transfers, not personal needs.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Short question is correctness of HC order dated March 27, 1961, depending on whether questions of law arise from Tribunal order May 6, 1959; not answering questions but whether they arise.",
      "addresses_issue": "i4",
      "key_observation": "Prima facie question whether Rs. 1,38,000 from savings/withdrawals or undisclosed income is fact, but open to attack if no evidence, perverse, or without considering relevant facts."
    },
    {
      "id": "cr2",
      "text": "Tribunal's finding prima facie based on no evidence but conjecture/surmise; failure to consider withdrawals from business capital accounts; total withdrawals suffice to explain cash.",
      "addresses_issue": "i1",
      "key_observation": "Three questions raised by appellant are questions of law arising from Tribunal order."
    },
    {
      "id": "cr3",
      "text": "Kept in mind observations in cited precedents; read Tribunal order as whole.",
      "addresses_issue": "i2",
      "key_observation": "Not indulging in conjectures etc., but questions arise warranting detailed consideration."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Three questions formulated by appellant are questions of law arising out of Tribunal's order dated May 6, 1959.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sree Meenakshi Mills v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "referred",
      "relevance": "Finding of fact open to attack u/s 66 if no evidence, perverse, or without due consideration of relevant facts."
    },
    {
      "case_name": "Omar Salary Mahomed Sait v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "referred",
      "relevance": "Kept in mind observations."
    },
    {
      "case_name": "Homi Jehangir Gheesta v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "referred",
      "relevance": "Tribunal in considering probabilities does not indulge in conjectures, surmises or suspicions; read order as whole."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "Section 66(1)",
        "Section 66(2)"
      ],
      "relevance": "Reference to High Court for questions of law arising from Tribunal order."
    },
    {
      "name": "High Denomination Notes Demonetisation Ordinance",
      "sections": [],
      "relevance": "Promulgated in January 1946 leading to encashment."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order dated March 27, 1961 set aside; Tribunal directed to state case and refer questions of law to High Court for decision.",
    "relief_granted": "Direction for reference u/s 66 Income-tax Act 1922",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"there was no positive and tangible proof to connect the encashment of high denomination notes worth Rs. 2,38,000 with any previous saving or withdrawals of the appellant.\"",
      "speaker": "lower_court",
      "significance": "Tribunal's key finding on lack of proof upheld as fact but challenged as lacking evidence."
    },
    {
      "text": "\"It is impossible to believe that she could have kept this huge amount of about Rs. 2,50,000 in loose and idle cash or notes in her safe as an utterly unremunerative capital.\"",
      "speaker": "lower_court",
      "significance": "Illustrates Tribunal's reasoning based on probabilities, alleged as conjecture."
    },
    {
      "text": "\"the three questions which the appellant has raised... are questions of law which do arise out of the Tribunals order dated May 6, 1959.\"",
      "speaker": "court",
      "significance": "Core holding allowing appeal and directing reference."
    }
  ],
  "_case_id": "1963_10",
  "_label": 1,
  "_text_length": 16486,
  "_extracted_at": "2026-02-10T19:47:07.619654"
}