{
  "metadata": {
    "case_name": "State of Maharashtra v. Defendant No. 7",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plaintiff-respondent No. 1 instituted Special Suit No. 5 of 1957 in the Court of the Civil Judge Senior Division at Ahmednagar to recover Rs. 13,205 on account of the principal lent to defendant No. 7 and interest up to the date of the suit at the rate of 9% per annum.",
      "type": "material",
      "date": "1957",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On July 18, 1960, the claim was decreed in a sum of Rs. 13,033-6-6 with future interest from the date of suit till realisation at 4% per annum on a sum of Rs. 10,120.",
      "type": "procedural",
      "date": "1960-07-18",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Defendant No. 7 appealed to the High Court against the decree. In the memorandum of appeal, defendant No. 7 valued the claim for purposes of jurisdiction and court-fee at Rs. 13,033-6-6.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Grounds Nos. 1 and 48 of appeal: That the lower Court erred in decreeing the plaintiffs suit. That the decree is otherwise erroneous, unjust and illegal and therefore deserves to be set aside. The remaining 46 grounds related to the merits of the plaintiffs claim and did not deal with the correctness of the trial Court awarding future pendente lite interest or the rate at which it was to be calculated.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Taxing Officer held that the appeal was against the whole decree and the amount or value of the subject-matter in dispute for purposes of court-fee was Rs. 14,036.80 nP. as the amount of interest from the date of the suit till the date of the decree on Rs. 10,120 came to Rs. 1,033.40 nP. Directed defendant-appellant to pay deficit court-fee of Rs. 70.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Defendant-appellant filed a revision to the High Court under s. 52 of the Act. Objection upheld by the learned Judge who held that the subject-matter in appeal is the real matter in dispute between the parties and not something which must stand or fall with the decision on it, meaning the right which is in dispute between the parties. Set aside order of Taxing Officer.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The State of Maharashtra filed this appeal by special leave against the High Court order.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the amount of interest decreed for the period subsequent to the institution of the suit comes within the expression amount or value of the subject-matter in dispute in art. 1 of Schedule I of the Bombay Court-fees Act, 1959, for purposes of court-fee payable on the memorandum of appeal.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The view expressed by the learned Judge is not correct and relies on the construction put by Courts on the expression value or subject-matter in dispute in the relevant provisions relating to the High Courts giving leave to appeal to the Privy Council, where interest up to decree is included.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Gooroopersad Khoond v. Juggutchunder 8 M.I.A. 166; Doorga Doss Chowdry v. Ramanauth Chowdry 8 M.I.A. 262"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The subject-matter in appeal is the real matter in dispute between the parties and not something which must stand or fall with the decision on it. In other words, it must mean the right which is in dispute between the parties.",
      "supporting_facts": [
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Act is a taxing statute and its provisions therefore have to be construed strictly, in favour of the subject-litigant. The Privy Council cases relate to liberal construction for appeals to higher court, not applicable here.",
      "addresses_issue": "i1",
      "key_observation": "Expression in the Act not to be construed in light of Privy Council construction for appeal leave."
    },
    {
      "id": "cr2",
      "text": "Defendant disputes principal and interest up to suit date (Rs. 13,033-6-6), but not pendente lite interest. No grounds challenge pendente lite interest specifically.",
      "addresses_issue": "i1",
      "key_observation": "Subject-matter in dispute is what is actually disputed in appeal."
    },
    {
      "id": "cr3",
      "text": "Value determined on substantial allegations in plaint or pleas in memo of appeal re points in dispute. Claims not based on asserted right but dependent on decision of disputed right and in discretion of court (like pendente lite interest, costs) not included.",
      "addresses_issue": "i1",
      "key_observation": "Pendente lite interest awarded in discretion u/s 34 CPC, no right to it."
    },
    {
      "id": "cr4",
      "text": "If appellant succeeds on main claim, appellate court will modify interest/costs accordingly. No need to appeal unless specifically disputed.",
      "addresses_issue": "i1",
      "key_observation": "Court-fee on pendente lite interest only if specifically challenged independently."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The amount of pendente lite interest decreed is not to be included in the amount or value of the subject-matter in dispute in appeal for purposes of art. 1 of Schedule I of the Act unless the appellant specifically challenges the correctness of the decree for the amount of interest pendente lite independently of the claim to set aside that decree.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gooroopersad Khoond v. Juggutchunder",
      "citation": "8 M.I.A. 166",
      "treatment": "distinguished",
      "relevance": "Interest up to decree included for Privy Council appeal valuation, but not applicable to court-fee Act."
    },
    {
      "case_name": "Doorga Doss Chowdry v. Ramanauth Chowdry",
      "citation": "8 M.I.A. 262",
      "treatment": "referred",
      "relevance": "Costs not part of subject-matter in dispute."
    },
    {
      "case_name": "Mitthu Lal v. Chameli",
      "citation": "57 All. 71",
      "treatment": "followed",
      "relevance": "No court-fee on pendente lite interest unless specifically challenged; same as costs."
    },
    {
      "case_name": "Keolapati, Mst. v. B. N. Varma",
      "citation": "I.L.R. 12 Luck. 466",
      "treatment": "followed",
      "relevance": "No court-fee on future interest unless expressly challenged."
    },
    {
      "case_name": "Ashutosh v. Satindra Kumar",
      "citation": "54 C.W.N. 380",
      "treatment": "followed",
      "relevance": "Costs not part of subject-matter; follows main decision automatically."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Court-fees Act, 1959",
      "sections": [
        "Article 1 of Schedule I",
        "Section 52"
      ],
      "relevance": "Court-fee ad valorem on amount or value of subject-matter in dispute in appeal; revision against taxing officer."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Section 34",
        "Section 35"
      ],
      "relevance": "Court's discretion to award pendente lite interest and costs."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by the State of Maharashtra is dismissed. The High Court order holding that the memorandum of appeal is sufficiently stamped, as pendente lite interest is not included in subject-matter valuation since not specifically challenged, is upheld.",
    "relief_granted": "None; High Court order affirmed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Act is a taxing statute and its provisions therefore have to be construed strictly, in favour of the subject-litigant.",
      "speaker": "court",
      "significance": "Key principle for interpreting court-fees provision."
    },
    {
      "text": "The amount of pendente lite interest decreed is not to be included in the amount or value of the subject-matter in dispute in appeal for the purposes of art. 1 of Schedule I of the Act unless the appellant specifically challenges the correctness of the decree for the amount of interest pendente lite independently of the claim to set aside that decree.",
      "speaker": "court",
      "significance": "Core holding of the judgment."
    },
    {
      "text": "Interest pendente lite is awarded under section 34 of the Civil Procedure Code. The Court may award it whether the plaintiff claims it or not. In this respect the Court's power stands on the same footing as its power to award costs to a successful party.",
      "speaker": "court",
      "significance": "Equates pendente lite interest to costs for court-fee purposes (citing Mitthu Lal)."
    }
  ],
  "_case_id": "1963_252",
  "_label": 0,
  "_text_length": 14046,
  "_extracted_at": "2026-02-10T19:50:21.718550"
}