{
  "metadata": {
    "case_name": "Appellant v. Respondents",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO J."
    ],
    "case_number": "Civil Appeal 271 of 1962",
    "date_of_judgment": "1963-02-18"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant was selected for the post of Programme Assistant on May 3, 1949 and was appointed on probation for one year, and the letter of appointment said that during the said period his services might be terminated without any notice and without any cause being assigned.",
      "type": "background",
      "date": "1949-05-03",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant accepted the offer and joined service on June 4, 1949.",
      "type": "background",
      "date": "1949-06-04",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "His period of probation expired on June 3, 1950, but it was extended from time to time.",
      "type": "procedural",
      "date": "1950-06-03",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On December 6, 1951 soon after the appellant's probation was extended up to June 3, 1952, he was informed that during the period he had been employed his work had been found to be much below the standard required for the post. The main defects that were found were also pointed out to him, namely, (i) immature taste, (ii) cannot be entrusted to work without supervision, and (iii) has few ideas but cannot think logically and plan systematically.",
      "type": "material",
      "date": "1951-12-06",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "He was given an opportunity to remedy the defects and to make attempts to bring himself up to the standard at least of an average Programme Assistant by systematic concentration on his subjects, application to his job and by making wider studies and contacts. He was told to seek guidance and help of his senior officers. Finally he was told that it would not be possible to give him any further extension of probation after the present one and that if his work during that period did not come up to the required standard, his services might have to be terminated.",
      "type": "procedural",
      "date": "1951-12-06",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "On July 4, 1952, the appellant was informed that his probation period would not be extended and was called upon to show cause why his services should not be terminated.",
      "type": "procedural",
      "date": "1952-07-04",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "The notice said that the appellant's work had not come up to the average standard of a Programme Assistant and four defects were pointed out, namely, (i) immaturity in taste, and want of tact and discretion, (ii) inability to think logically and plan systematically, (iii) want of programme sense and background necessary for an average programme man, and (iv) he could not be entrusted to work without supervision.",
      "type": "material",
      "date": "1952-07-04",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The appellant showed cause / gave his explanation in reply to this notice which was duly considered.",
      "type": "procedural",
      "date": "1952-07-04",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "On July 31, 1952, he was informed that the explanation given by him was not satisfactory and that his services were to be terminated after August 31, 1952.",
      "type": "procedural",
      "date": "1952-07-31",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "The appellant then filed a petition under Art. 226 of the Constitution in the Punjab High Court, which was dismissed by judgment and order dated May 18, 1959 in L.P.A. No. 24-D of 1956. The High Court granted a certificate for appeal to the Supreme Court.",
      "type": "procedural",
      "date": "1959-05-18",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "It is not in dispute that the appellant was never confirmed in his appointment.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Though the letter of appointment said that the appellant will be on probation for a period of one year, his probation period was extended from time to time.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant is entitled to the protection of Art. 311(2) of the Constitution",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether rr. 49 and 55-B of the Civil Services Classification, Control and Appeal Rules apply to the appellant and were complied with",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether in view of r. 3(a) of the Rules, the term in the letter of appointment prevails over r. 55-B",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether r. 55-B was complied with before termination of services",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "He was entitled to the protection of Art. 311(2) of the Constitution and as this was not afforded to him the order terminating his services was illegal.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Art. 311(2)"
    },
    {
      "id": "pa2",
      "text": "He was governed by rr. 49 and 55-B of the Civil Services Classification, Control and Appeal Rules and therefore he was entitled to the protection of those rules. As however his services had been terminated without compliance with those rules he was in any case entitled to reinstatement.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "rr. 49, 55-B"
    },
    {
      "id": "pa3",
      "text": "The rules themselves made it obligatory that Art. 311(2) should be complied with before the services of a probationer were terminated, reliance on Explanation 2 to r. 49 as amended October 10, 1947.",
      "supporting_facts": [],
      "legal_basis": "Explanation 2 to r. 49 (1947 amendment)"
    },
    {
      "id": "pa4",
      "text": "He was entitled to the protection of r. 55-B and as that rule was not complied with, the termination of his service was illegal. The notice was not sufficient compliance with r. 55-B; elaborate procedure of r. 55 should have been gone through.",
      "supporting_facts": [
        "f6",
        "f7",
        "f9"
      ],
      "legal_basis": "r. 55-B"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "rr. 49 and 55-B of the Rules did not apply to the appellant and he was governed by the contract of his service which provided that his services might be terminated without any notice and without any cause being assigned during the period of probation.",
      "supporting_facts": [
        "f1",
        "f11"
      ],
      "legal_basis": "r. 3(a), terms of appointment letter"
    },
    {
      "id": "ra2",
      "text": "rr. 49 and 55-B would not in any case apply to the appellant in the face of the contract under which he was appointed in view of r. 3(a) of the Rules.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "r. 3(a)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The protection of Art. 311 of the Constitution applies to temporary government servants also where dismissal, removal or reduction in rank is sought to be inflicted by way of punishment. But where the services of a temporary government servant are terminated not by way of punishment, Art. 311 will not apply and the services of such a servant can be terminated under the terms of the contract or by giving him the usual one month's notice.",
      "addresses_issue": "i1",
      "key_observation": "Termination not by way of punishment"
    },
    {
      "id": "cr2",
      "text": "A probationer has no right to the post held by him and under the terms of his appointment he is liable to be discharged at any time during the period of his probation subject to the rules governing such cases.",
      "addresses_issue": "i1",
      "key_observation": "Appellant was a probationer, termination not amounting to dismissal or removal"
    },
    {
      "id": "cr3",
      "text": "Explanation 2 to r. 49 as amended in October 1947 was deleted by amendment in November 1949, and a new Explanation substituted which provides that termination of employment of a person appointed on probation during or at the end of probation in accordance with terms of appointment and rules governing probationary service does not amount to removal or dismissal.",
      "addresses_issue": "i1",
      "key_observation": "Relevant Explanation in force in 1952 excludes Art. 311(2)"
    },
    {
      "id": "cr4",
      "text": "r. 3(a) excludes application of Rules only where special provision is made by or under any law for appointment and conditions of employment. The term in appointment letter is not such special provision by virtue of any law.",
      "addresses_issue": "i3",
      "key_observation": "r. 55-B applies, not excluded by r. 3(a)"
    },
    {
      "id": "cr5",
      "text": "r. 55-B requires that where it is proposed to terminate employment of probationer for specific fault or unsuitability, he shall be apprised of grounds and given opportunity to show cause. Appellant was apprised of grounds in Dec 1951 and July 1952 notices, given opportunity, explanation considered.",
      "addresses_issue": "i4",
      "key_observation": "Sufficient compliance with r. 55-B; no need for r. 55 procedure as not punishment"
    },
    {
      "id": "cr6",
      "text": "Purpose of notice under r. 55-B is to ascertain after considering explanation whether probationer should be retained or not; sufficient if grounds communicated and explanation considered.",
      "addresses_issue": "i4",
      "key_observation": "This was done"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant not entitled to protection of Art. 311(2) as termination not by way of punishment and as per new Explanation to r. 49.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "r. 55-B applies to appellant and was complied with.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "r. 3(a) does not exclude r. 55-B.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Parshotam Lal Dhingra v. Union of India",
      "citation": "1958 S.C.R. 828",
      "treatment": "followed",
      "relevance": "Protection of Art. 311 applies only if termination by way of punishment; temporary servant's services can be terminated under contract or one month's notice if not punishment"
    },
    {
      "case_name": "The State of Orissa v. Ram Narain Das",
      "citation": "1961 S.C.R. 606",
      "treatment": "followed",
      "relevance": "Probationer has no right to post and liable to discharge during probation subject to rules, not amounting to dismissal or removal under Art. 311(2)"
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226",
        "Art. 311(2)"
      ],
      "relevance": "Art. 226 for petition; Art. 311(2) protection not applicable to non-punitive termination of probationer"
    },
    {
      "name": "Civil Services (Classification, Control and Appeal) Rules",
      "sections": [
        "r. 3(a)",
        "r. 49",
        "r. 55-B"
      ],
      "relevance": "r. 55-B applies and complied with; governs termination of probationer for unsuitability by apprising grounds and opportunity to show cause"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed, though for slightly different reasons. The Supreme Court held that Art. 311(2) does not apply, r. 55-B applies but was complied with, and termination valid.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The discharge of a probationer whether during or at the end of the period of probation, for some specific fault or on account of his unsuitability for the service, amounts to removal or dismissal within the meaning of this rule.",
      "speaker": "court",
      "significance": "Quoted old Explanation 2 to r.49, but noted it was deleted"
    },
    {
      "text": "The termination of employment (a) of a person appointed on probation during or at the end of the period of probation, in accordance with the terms of the appointment and the rules governing the probationary service ... does not amount to removal or dismissal within the meaning of this rule or of rule 55.",
      "speaker": "court",
      "significance": "Relevant new Explanation excluding Art. 311(2)"
    },
    {
      "text": "A probationer has no right to the post held by him and under the terms of his appointment he is liable to be discharged at any time during the period of his probation subject to the rules governing such cases.",
      "speaker": "court",
      "significance": "Core holding on probationer's status"
    },
    {
      "text": "We therefore dismiss the appeal, though for slightly different reasons.",
      "speaker": "court",
      "significance": "Final disposition"
    }
  ],
  "_case_id": "1963_33",
  "_label": 0,
  "_text_length": 15303,
  "_extracted_at": "2026-02-10T19:47:43.733283"
}