{
  "metadata": {
    "case_name": "State of Andhra Pradesh v. Sub-Inspector of Police (Respondent)",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 626 of 1961",
    "date_of_judgment": "1963-04-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On February 18, 1954, an offence of house-breaking and theft was reported at Kodur police station, Visakhapatnam District, registered on February 19, 1954. Village Munsif of Vechalam reported suspect Durgalu, who was absconding.",
      "type": "background",
      "date": "1954-02-18",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Durgalu apprehended by Village Munsif of Kalogotla on March 5, 1954, handed over to Village Munsif of Vechalam, who sent him to Kodur police station with village servants V. Polayya, Vechalapu Simhachalam, Kodamanchali Simhachalam and Koduru Sumudram.",
      "type": "material",
      "date": "1954-03-05",
      "source": "state"
    },
    {
      "id": "f3",
      "text": "State's case: Durgalu handed over to respondent (Sub-Inspector in charge of Kodur PS) on night of March 5, 1954, but no written acknowledgment given, no entry in station diary, and Durgalu confined in police station without Magistrate's remand order.",
      "type": "disputed",
      "date": "1954-03-05",
      "source": "state"
    },
    {
      "id": "f4",
      "text": "Respondent entrusted charge to head constable and left for Kakinada on casual leave for five days on March 7, 1954, returned March 12, 1954.",
      "type": "admitted",
      "date": "1954-03-07",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After respondent's departure, constables arrested Reddy Simhachalam on evening of March 7, 1954. State's case: tortured by constables Nos. 1199, 363 and 662, became unconscious.",
      "type": "material",
      "date": "1954-03-07",
      "source": "state"
    },
    {
      "id": "f6",
      "text": "Dead body of Reddy Simhachalam found floating in well near police station on morning of March 9, 1954. Revenue Divisional Officer, Narsipatnam, enquired into death.",
      "type": "material",
      "date": "1954-03-09",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In RDO enquiry, Durgalu stated he witnessed torture of Reddy Simhachalam by the three constables.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Constables 1199, 363, 662 charged before Sub-Magistrate, Chodavaram, under ss. 304, 201 r/w s. 114 IPC for causing death and disappearance of evidence.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Before Sub-Magistrate, Durgalu retracted: said he escaped custody of village servants before reaching Kodur PS on March 5, 1954, re-arrested March 8, 1954; induced to make false witness statement.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Sub-Magistrate discharged constables: no direct evidence after Durgalu turned hostile.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Sessions Judge, Visakhapatnam, suo motu called record, held Durgalu was arrested March 5, taken to Kodur PS, wrongfully confined since then; rejected escape story.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Departmental enquiry commenced May 1954 against respondent. Amended charge: Reprehensible conduct in wrongfully confining K.D. Chandana Durgalu (Cr. No.17/54) from night of 5-3-54 to 7-3-1954 in PS when he went on casual leave. Statement of facts: handed over night March 5, no acknowledgment, no station records, confined till March 7.",
      "type": "procedural",
      "date": "1954-05",
      "source": "state"
    },
    {
      "id": "f13",
      "text": "Respondent's explanation: Durgalu not handed over on March 5 or before leave on March 7; instructed head constable to trace Durgalu.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Deputy SP held enquiry, report Oct 27, 1954: State's evidence strong, Durgalu handed over March 5, escape story false; but if Magistrate's judgment taken as sacred truth, benefit of doubt.",
      "type": "procedural",
      "date": "1954-10-27",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Provisional conclusion: dismissal. Respondent show-caused, submitted representation.",
      "type": "procedural",
      "date": null,
      "source": "state"
    },
    {
      "id": "f16",
      "text": "Deputy IG Police, Northern Range: Charge proved, dismissal deserved.",
      "type": "procedural",
      "date": "1955-03-10",
      "source": "state"
    },
    {
      "id": "f17",
      "text": "Appeal to IG Police: Accepted State's evidence, respondent dishonest, untrustworthy, unsatisfactory records; reduced to removal from service considering age/inexperience. Order Sept 24, 1955.",
      "type": "procedural",
      "date": "1955-09-24",
      "source": "state"
    },
    {
      "id": "f18",
      "text": "Respondent filed Writ Petition No. 922/1956 u/Art. 226 in AP High Court seeking quashing of DIG order March 10, 1955 and IG order Sept 24, 1955.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f19",
      "text": "High Court quashed both orders on Nov 18, 1959.",
      "type": "procedural",
      "date": "1959-11-18",
      "source": "high_court"
    },
    {
      "id": "f20",
      "text": "Supreme Court appeal by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "In enquiry, respondent wanted to examine constables 178, 506, 569 to prove Durgalu not in lock-up till March 8. 506 examined, not accepted. Respondent promised to produce, later examined some, signed that all defence witnesses examined, no further objection raised.",
      "type": "procedural",
      "date": "1954-09",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court had jurisdiction under Art. 226 to interfere with the findings of fact in the departmental enquiry by re-appreciating evidence and applying criminal standard of proof beyond reasonable doubt.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the departmental enquiry violated principles of natural justice: (i) refusal to summon defence witnesses; (ii) no specific charge of falsifying records.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Departmental authorities accepted State's evidence that Durgalu handed over on March 5, 1954; High Court cannot re-appreciate evidence or apply criminal proof standard in Art. 226 proceedings.",
      "supporting_facts": [
        "f2",
        "f3",
        "f14",
        "f16",
        "f17"
      ],
      "legal_basis": "Art. 226 of Constitution"
    },
    {
      "id": "pa2",
      "text": "No violation of natural justice: Respondent had opportunity to examine witnesses, signed that all examined; charge-sheet included failure to record in station records.",
      "supporting_facts": [
        "f12",
        "f21"
      ],
      "legal_basis": "Principles of natural justice"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Durgalu not handed over on March 5; escaped and re-arrested March 8.",
      "supporting_facts": [
        "f9",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Enquiry flawed: Witnesses not summoned; no charge of falsifying records; authorities examined evidence separately, ignored onus, did not apply proof beyond reasonable doubt.",
      "supporting_facts": [
        "f21"
      ],
      "legal_basis": "Art. 226; natural justice; criminal standard of proof"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court exceeded jurisdiction: Not a court of appeal; cannot review evidence if some legal evidence supports findings. Standard in departmental enquiry is preponderance of probability, not proof beyond reasonable doubt.",
      "addresses_issue": "i1",
      "key_observation": "Where there is some evidence which may reasonably support the conclusion, High Court cannot interfere."
    },
    {
      "id": "cr2",
      "text": "Enquiry Officer accepted State's evidence sarcastically noting Magistrate's judgment not binding; no error.",
      "addresses_issue": "i1",
      "key_observation": "Criminal court judgment not binding in departmental proceedings."
    },
    {
      "id": "cr3",
      "text": "No refusal of witnesses: Respondent examined some, signed all examined, no timely objection.",
      "addresses_issue": "i2",
      "key_observation": "Record shows respondent did not press for further witnesses."
    },
    {
      "id": "cr4",
      "text": "Charge included failure to record in statement of facts; full notice given, no prejudice.",
      "addresses_issue": "i2",
      "key_observation": "Charge-sheet and facts form single document."
    },
    {
      "id": "cr5",
      "text": "Proceedings regular, supported by evidence; High Court had no jurisdiction to set aside.",
      "addresses_issue": "i1",
      "key_observation": "Departmental authorities sole judges of facts if enquiry proper."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court under Art. 226 not to re-appreciate evidence or apply criminal standard if some evidence supports departmental findings.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No violation of natural justice where opportunity given and no timely objection raised.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Jurisdiction of High Court in writ petitions to quash departmental orders; limited to competency, procedure, natural justice."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "Section 304",
        "Section 201",
        "Section 114"
      ],
      "relevance": "Charges against constables in criminal case related to background facts."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, High Court order dated November 18, 1959 quashed, writ petition No. 922 of 1956 dismissed.",
    "relief_granted": "Restoration of departmental orders of removal from service.",
    "costs": "No order as to costs."
  },
  "key_quotes": [
    {
      "text": "The High Court is not constituted in a proceeding under Art. 226 of the Constitution a Court of appeal over the decision of the authorities holding a departmental enquiry against a public servant.",
      "speaker": "court",
      "significance": "Defines limited scope of High Court's jurisdiction in Art. 226 writs against departmental enquiries."
    },
    {
      "text": "Where there is some evidence, which the authority... has accepted and which evidence may reasonably support the conclusion... it is not the function of the High Court... to review the evidence and to arrive at an independent finding.",
      "speaker": "court",
      "significance": "Key principle on non-interference with factual findings in departmental proceedings."
    },
    {
      "text": "The departmental authorities are... the sole judges of facts and if there be some legal evidence on which their findings can be based, the adequacy or reliability of that evidence is not a matter which can be canvassed before the High Court.",
      "speaker": "court",
      "significance": "Establishes finality of departmental fact-finding if supported by some evidence."
    }
  ],
  "_case_id": "1963_111",
  "_label": 1,
  "_text_length": 21191,
  "_extracted_at": "2026-02-10T19:49:06.597203"
}