{
  "metadata": {
    "case_name": "Union of India v. Respondent",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal J."
    ],
    "case_number": "Civil Appeal No. 53 of 1961",
    "date_of_judgment": "1963-05-09"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Dominion of India, as owner of Madras and Southern Mahratta Railway, represented by General Manager, invited tenders for supply of jaggery to railway grain shops.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent submitted tender for supply of 14,000 imperial maunds of cane jaggery during months of February and March 1948.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Tender form paragraph 2 specified quantity required and dates of delivery: 14,000 imperial maunds for December 1947 and January 1948 in equal lots of 1,750 maunds from 10th December 1947 to 31st January 1948. Note: This Administration reserves the right to cancel the contract at any stage during the tenure of the contract without calling up the outstandings on the unexpired portion of the contract.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Paragraph 8 of tender: Security deposit of five percent of tender value required.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Paragraph 9 of tender: Formal order for supply placed only after furnishing receipt for security deposit.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Paragraph 12: Rejection of supplies if unacceptable quality.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Paragraph 13: Penalties for non-effecting supplies on dates or non-replacement of rejected goods: purchase in open market at risk and expense of supplier, cancel outstandings, forfeit security.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Deputy General Manager accepted tender by letter dated January 29, 1948, asked respondent to remit Rs. 7,900/- for security, official order on receipt.",
      "type": "procedural",
      "date": "1948-01-29",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Deputy General Manager letter dated February 16, 1948: Reiterated acceptance subject to terms on reverse, including delivery programme: 3,600 maunds March 1, 3,500 March 22, 3,500 April 5, 3,500 April 21. Note repeated reserving right to cancel contract.",
      "type": "material",
      "date": "1948-02-16",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Dates slightly changed by letter dated February 28, 1948.",
      "type": "procedural",
      "date": "1948-02-28",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Deputy General Manager letter dated March 8, 1948: Balance quantity outstanding against order dated February 16, 1948 treated as cancelled, contract closed.",
      "type": "material",
      "date": "1948-03-08",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Respondent protested cancellation, relying on stipulation reserving right to cancel.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Respondent instituted suit against Union of India for damages for breach of contract.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Trial Court dismissed suit, holding railway could cancel contract without reason or liability for damages.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Madras High Court in O.S. Appeal No. 64 of 1952 by judgment dated August 9, 1956 held clause reserving right to cancel void, remanded for decision on damages.",
      "type": "procedural",
      "date": "1956-08-09",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Union of India obtained special leave and filed Civil Appeal No. 53 of 1961.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "On proper construction of terms, did appellant agree to buy only quantity required up to maximum 14,000 maunds, no enforceable obligation for entire quantity?",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Did respondent agree to clause reserving right to terminate contract at any stage, making it valid provision for discharge?",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Was contract complete for supply of definite 14,000 maunds on specified dates, clause repugnant and exercisable only for good reason not arbitrarily?",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "What is true nature of contract between parties?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Contract to buy only such quantity as required up to maximum 14,000 maunds, no enforceable obligation for entire quantity.",
      "supporting_facts": [
        "f3",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Respondent agreed to impugned clause reserving right to terminate contract at any stage regarding outstandings, valid and binding, provision for discharge.",
      "supporting_facts": [
        "f3",
        "f9",
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Contract complete for supply of definite 14,000 maunds on dates in order February 16, 1948 (later modified February 28), stipulation repugnant, if valid only for good and reasonable ground not arbitrarily.",
      "supporting_facts": [
        "f2",
        "f9",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Acceptance of tender January 29 constituted agreement but not full contract as dates not specified, formal order per para 9 after security.",
      "addresses_issue": "i4",
      "key_observation": "Agreement loosely called contract, note in para 2 refers to cancelling this agreement before formal order."
    },
    {
      "id": "cr2",
      "text": "Expressions like 'tenure of the contract', 'outstandings on unexpired portion' indicate continuing nature, cancellable before formal order.",
      "addresses_issue": "i4",
      "key_observation": "Distinction in para 13 between outstandings and purchase due."
    },
    {
      "id": "cr3",
      "text": "Letter February 16 placed formal order for entire 14,000 maunds in instalments on definite dates, clause in letter refers to pre-order supplies.",
      "addresses_issue": "i1",
      "key_observation": "Once formal order placed specifying quantity and dates, binding contract on both parties."
    },
    {
      "id": "cr4",
      "text": "March 8 letter distinguishes order and contract, cancels balance against order, but clause does not apply to placed orders.",
      "addresses_issue": "i2",
      "key_observation": "Condition applies only to supplies without formal order."
    },
    {
      "id": "cr5",
      "text": "Contract of second type per Cheshire & Fifoot: standing offer up to maximum, each requisition separate contract; here formal order for full quantity binding.",
      "addresses_issue": "i4",
      "key_observation": "Note consistent with standing offer nature."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Condition in note to para 2 of tender and letter February 16 refers to right to cancel agreement for supplies without formal order, does not apply to formal orders specifying quantity and dates.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Formal order February 16 for entire quantity creates binding contract, incumbent on both to perform.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Not necessary to decide if stipulation amounts to term for discharge as clause does not apply to placed order.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chatturbhuj Vithaldas Jasani v. Moreshwar Parashram",
      "citation": "1954 S.C.R. 817",
      "treatment": "followed",
      "relevance": "Arrangement set terms for business if orders placed; order and acceptance create contract governed by terms."
    },
    {
      "case_name": "Cheshire & Fifoot, Law of Contract, 5th Ed. p.36",
      "citation": null,
      "treatment": "referred",
      "relevance": "Tender as standing offer up to maximum; acceptance by requisition for definite quantity creates separate contract."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court construed contract as standing offer until formal order; February 16 order for full quantity binding, cancellation invalid for ordered supplies. Appeal against High Court remand dismissed implicitly by upholding binding nature post-order.",
    "relief_granted": "Suit remanded for damages as per High Court upheld in effect",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Once the order is placed for such supply on such dates, that order amounts to a binding contract making it incumbent on the respondent to supply jaggery in accordance with the terms of the order and also making it incumbent on the Deputy General Manager to accept the jaggery delivered in pursuance of that order.\"",
      "speaker": "court",
      "significance": "Core holding on binding nature of formal order"
    },
    {
      "text": "\"We construe the contract between the parties in the instant case to be of the second type.\"",
      "speaker": "court",
      "significance": "Classifies as standing offer per textbook, but full order binding"
    }
  ],
  "_case_id": "1963_202",
  "_label": 0,
  "_text_length": 20144,
  "_extracted_at": "2026-02-10T19:49:45.294256"
}