{
  "metadata": {
    "case_name": "Proprietor of Wanaparthy Jagir v. Income Tax Authorities",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar J."
    ],
    "case_number": "Civil Appeal No. 420 of 1962",
    "date_of_judgment": "1963-04-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was the proprietor of the Wanaparthy Jagir in the former Indian State of Hyderabad.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Certain payments described as interim maintenance allowances were made to appellant under the Hyderabad Abolition of Jagirs Regulation 1358 F.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "These payments were brought to tax under the Income-tax Act, 1922 as income.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant contended that the payments were capital and not liable to be taxed.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Appellant took various proceedings and eventually a case was stated to the High Court of Andhra Pradesh on the question: Whether the interim maintenance allowances received by the assessee under the Hyderabad Abolition of Jagirs Regulation, 1358 Fasli, are income and therefore liable to tax.",
      "type": "procedural",
      "date": "1959-04-03",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The High Court answered the question against the appellant.",
      "type": "procedural",
      "date": "1959-04-03",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Under s. 6 of Abolition Regulation, jagirs included in Diwani (Government) as from appointed day (s. 5), powers, rights and liabilities of Jagirdars ceased.",
      "type": "material",
      "date": "1949-09-15",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Section 8: Payment to Government of specified percentage of gross revenue for administration expenses.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Section 10: Payment to Jagirdar out of jagir income equivalent to half of what he was getting before, as remuneration for managing, and distribution to Hissedars.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Section 11: Net income distributed between Jagirdar and Hissedars in pre-existing proportions.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Section 14: Amounts payable deemed interim maintenance allowances until terms for commutation determined.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Commutation Regulation s.3: Commutation sum multiple of basic annual revenue.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "s.6: Commutation sum distributable in same proportion as income under Abolition s.11.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Appellant's rights in Jagir extinguished as result of Regulations.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appellant divested of Jagir as from appointed day, September 15, 1949.",
      "type": "disputed",
      "date": "1949-09-15",
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Commutation sum payable under Commutation Regulation paid as compensation.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Four payments totalling Rs. 1,47,857-4-0: first on January 25, 1950; others on April 10, 1950, July 3, 1950, August 3, 1950.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Tribunal directed Income-tax officer to enquire nature of last three payments made after April 1, 1950.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the interim maintenance allowances received by the assessee under the Hyderabad Abolition of Jagirs Regulation, 1358 Fasli, are income and therefore liable to tax.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether these payments constituted capital or income.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Payments were capital and not liable to tax.",
      "supporting_facts": [
        "f4",
        "f14",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Interim maintenance allowances were part of the commutation sum, as indicated by 'final commutation' in Commutation Regulation s.7(2).",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "Hyderabad Jagirs Commutation Regulation, 1359F s.7(2)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Payments were income liable to tax under Income-tax Act, 1922.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Regulations make clear distinction between interim maintenance allowances (under Abolition Regulation, fraction of current income, recurring until commutation terms determined) and commutation sum (multiple of annual revenue, fixed sum, compensation).",
      "addresses_issue": "i1",
      "key_observation": "Allowances cease when commutation terms determined; post-April 1, 1950 allowances recoverable from commutation sum."
    },
    {
      "id": "cr2",
      "text": "Allowances not compensation for loss of Jagir but for interim period loss of income; recurring, regular, called 'maintenance allowances'; sui generis income.",
      "addresses_issue": "i2",
      "key_observation": "Right to allowances created by Abolition Regulation, enforceable in court; income-compensation."
    },
    {
      "id": "cr3",
      "text": "Payments after April 1, 1950 towards commutation sum are capital, not income; enquiry needed for specific payments.",
      "addresses_issue": "i1",
      "key_observation": "High Court correctly stated that allowances not forming part of commutation amount are income."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Interim maintenance allowances are income liable to tax, except those forming part of commutation amount.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Payments subsequent to April 1, 1950 towards commutation amount are not income.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shanmugha Rajeswara Sethupathi v. Income-tax officer, Karaikudi",
      "citation": "1962 44 I.T.R. 853",
      "treatment": "referred",
      "relevance": "Different view on date of divestment of Jagir."
    },
    {
      "case_name": "Commissioner of Income-tax v. Shaw Wallace Co.",
      "citation": "1932 L.R. 59 I.A. 206",
      "treatment": "followed",
      "relevance": "Regularity and recurring nature characteristic of income."
    },
    {
      "case_name": "Commissioner of Inland Revenue v. Butterley Co. Ltd.",
      "citation": "1936 SOT, 411",
      "treatment": "followed",
      "relevance": "Interim payments sui generis income-compensation, not from trade/business; statutory origin."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [],
      "relevance": "Payments brought to tax as income."
    },
    {
      "name": "Hyderabad Abolition of Jagirs Regulation 1358 F",
      "sections": [
        "s.3",
        "s.5",
        "s.6",
        "s.8",
        "s.10",
        "s.11",
        "s.13",
        "s.14",
        "s.21"
      ],
      "relevance": "Created right to interim maintenance allowances from Jagir income until commutation terms determined."
    },
    {
      "name": "Hyderabad Jagirs Commutation Regulation 1359 F",
      "sections": [
        "s.3",
        "s.4",
        "s.5",
        "s.6",
        "s.7(2)"
      ],
      "relevance": "Provided for commutation sum as compensation; distinguished from interim allowances; final commutation as from April 1, 1950."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court upheld High Court's answer that interim maintenance allowances not forming part of commutation amount are income liable to tax; payments towards commutation after April 1, 1950 not taxable; approved Tribunal's direction for enquiry into nature of specific post-April payments.",
    "relief_granted": "Direction for enquiry by Income-tax officer on nature of three payments after April 1, 1950.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The allowances were measured as a fraction of the current income while the commutation was a multiple of annual revenue. The allowances were recurring payments for a certain time while the Commutation sum was a fixed sum payable at once or by instalments.",
      "speaker": "court",
      "significance": "Highlights distinction between allowances (income) and commutation (capital)."
    },
    {
      "text": "These allowances were obviously not intended to be compensation. The question then arises, if these allowances were not paid as compensation for the loss of the Jagir and were not of the nature of capital as such, what was their nature? ... there is no doubt that they were of the nature of income ... Sui generis.",
      "speaker": "court",
      "significance": "Core reasoning classifying allowances as taxable income."
    },
    {
      "text": "It is income-compensation, if I may use that expression, that is to say, a series of periodical payments an independent right to which is conferred by the Act by way of compensation for the loss of income sustained.",
      "speaker": "Jenkins L.J. (in Butterley case)",
      "significance": "Adopted to describe nature of interim payments."
    },
    {
      "text": "They are sui generis and it would, I think, lead to confusion if they were described in any terms except those which are strictly applicable to their own special circumstances.",
      "speaker": "Lord Radcliffe (in Butterley case)",
      "significance": "Supports sui generis income nature of statutory interim payments."
    }
  ],
  "_case_id": "1963_53",
  "_label": 0,
  "_text_length": 18889,
  "_extracted_at": "2026-02-10T19:47:39.819395"
}