{
  "metadata": {
    "case_name": "Shivram Poddar v. Income-tax Officer",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Balmokand Radheshyam, a firm with head office at Calcutta, carried on business in commission agency and cotton piece-goods, consisting of four partners including Shivram Poddar, the appellant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The firm was dissolved in February 1950, and its business was discontinued.",
      "type": "material",
      "date": "1950-02",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For the assessment year 1949-50, one of the partners submitted a return of the firm's income, and it was assessed on October 28, 1952, in the status of an unregistered firm.",
      "type": "procedural",
      "date": "1952-10-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On March 28, 1955, the Income-tax Officer issued a notice under section 34 read with section 22(2) of the Indian Income-tax Act, 1922, to the appellant as a partner of the firm at the time of its dissolution, calling upon him to submit a return of the income of the firm for the year ending March 31, 1950.",
      "type": "procedural",
      "date": "1955-03-28",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The appellant moved the High Court of Judicature at Calcutta for a writ of mandamus under Article 226 of the Constitution commanding the Income-tax Officer to forbear from giving effect to the notice.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The writ petition was dismissed by D.N. Sinha J., and that order was confirmed in appeal under the Letters Patent by the High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the income earned by the firm in the year ending March 1950 could be assessed to tax under section 44 of the Indian Income-tax Act, 1922, after the firm was dissolved.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The notice addressed by the Income-tax Officer to the appellant was in law inoperative, since section 44 applies in relation to a firm only when there is discontinuance of its business and not when there is dissolution of the firm.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "Section 44 of the Indian Income-tax Act, 1922; observations in R.N. Bose v. Manindra Lal Goswami"
    },
    {
      "id": "pa2",
      "text": "Dissolution and discontinuance are different concepts; if discontinuance included dissolution it was unnecessary to make express provision for dissolution of association of persons.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Section 44 of the Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 44 authorises assessment of tax on income earned before discontinuance or dissolution and imposes joint and several liability on partners at the time of discontinuance or dissolution.",
      "addresses_issue": "i1",
      "key_observation": "The object is to ensure continuity in assessment machinery notwithstanding discontinuance."
    },
    {
      "id": "cr2",
      "text": "In C.A. Abraham v. Income-tax Officer, the Court observed that assessment proceedings may be commenced and continued against a firm after discontinuance as if it had not taken place.",
      "addresses_issue": "i1",
      "key_observation": "Applies even after dissolution upon death of partner."
    },
    {
      "id": "cr3",
      "text": "Section 44 operates on discontinuance of business by firm or association, or dissolution of association; for firms, it applies on discontinuance whether resulting from dissolution or other cause.",
      "addresses_issue": "i1",
      "key_observation": "Mere dissolution without discontinuance does not attract s.44 for firms."
    },
    {
      "id": "cr4",
      "text": "Distinction due to scheme of Income-tax Act treating firm as unit of assessment independent of partners; reconstitution does not discontinue business.",
      "addresses_issue": "i1",
      "key_observation": "Provisions like ss.25(1), 26(1),(2) handle changes in constitution or succession."
    },
    {
      "id": "cr5",
      "text": "In this case, business was discontinued on dissolution, so s.44 applies; firm remains liable as unregistered firm.",
      "addresses_issue": "i1",
      "key_observation": "Assessment under Chapter IV machinery."
    },
    {
      "id": "cr6",
      "text": "High Court writ jurisdiction under Art.226 not for bypassing revenue machinery unless fundamental rights infringed or lack of jurisdiction.",
      "addresses_issue": "i1",
      "key_observation": "Revenue to ascertain facts and grant relief."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 44 is attracted only when the business of a firm is discontinued, i.e., complete cessation, whether as a result of dissolution or other cause.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "A dissolved firm which has discontinued business is assessed under the Act's machinery, with partners jointly and severally liable.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "C.A. Abraham v. Income-tax Officer, Kottayam",
      "citation": null,
      "treatment": "followed",
      "relevance": "Assessment and penalty proceedings valid after discontinuance due to dissolution."
    },
    {
      "case_name": "Commissioner of Income-tax v. Raja Reddy Mallaram",
      "citation": null,
      "treatment": "followed",
      "relevance": "Reiterated application of s.44 to dissolved association of persons."
    },
    {
      "case_name": "R.N. Bose v. Manindra Lal Goswami",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Obiter observations that s.44 does not expressly cover dissolution of firm, but parties proceeded on assumption it did."
    },
    {
      "case_name": "Commissioner of Income-tax v. Srinivasan",
      "citation": null,
      "treatment": "referred",
      "relevance": "Section 25(1) enables premature assessment on discontinuance."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 44",
        "Section 34",
        "Section 22(2)",
        "Section 3",
        "Section 23(3)",
        "Section 23(4)",
        "Section 23(5)",
        "Section 25(1)",
        "Section 26(1)",
        "Section 26(2)"
      ],
      "relevance": "Governs assessment of discontinued or dissolved firms/associations; joint liability on partners; machinery for assessment despite changes."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Writ jurisdiction for mandamus against ITO notice."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the High Court's dismissal of the writ petition is dismissed. The notice under s.34 r/w s.22(2) is valid as s.44 applies to assessment of the firm's income after discontinuance of business upon dissolution, with partners jointly liable.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In effect, the Legislature has enacted by section 44 that the assessment proceedings may be commenced and continued against a firm of which business is discontinued as if discontinuance has not taken place.\"",
      "speaker": "court",
      "significance": "Explains purpose of s.44 for continuity of assessment."
    },
    {
      "text": "\"Section 44 is, therefore, attracted only when the business of a firm is discontinued, i.e., when there is complete cessation of the business and not when there is a change in the ownership of the firm, or in its constitution.\"",
      "speaker": "court",
      "significance": "Clarifies scope of s.44 for firms distinct from AOP."
    },
    {
      "text": "\"Resort to the High Court in exercise of its extraordinary jurisdiction conferred on recognised by the Constitution in matters relating to assessment, levy and collection of income-tax may be permitted only when questions of infringement of fundamental rights arise.\"",
      "speaker": "court",
      "significance": "Limits writ jurisdiction in tax matters."
    }
  ],
  "_case_id": "1963_145",
  "_label": 0,
  "_text_length": 14900,
  "_extracted_at": "2026-02-10T19:48:57.214061"
}