{
  "metadata": {
    "case_name": "Company (Petitioner No. 1) & Shareholders (Petitioners Nos. 2 & 3) v. State of West Bengal (Respondent No. 1) & State of Uttar Pradesh & Officers (Respondents Nos. 2 to 6)",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Petition No. 13 of 1962",
    "date_of_judgment": "1963-01-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "First petitioner is a Company incorporated under the Indian Companies Act with its registered office at Calcutta, owner of a factory at Varanasi in Uttar Pradesh.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Petitioners Nos. 2 and 3 are shareholders of the first petitioner Company.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "State of Uttar Pradesh agreed to advance a loan of Rs. 1,45,00,000 on the mortgage of the Company's assets at its jute mills at Budge Budge and at Ghusuri, all situated in West Bengal.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Deed of mortgage executed at Lucknow in Uttar Pradesh on March 22, 1957.",
      "type": "material",
      "date": "1957-03-22",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "To the deed of mortgage, first petitioner affixed stamps of value Rs. 1,08,751 purchased from Collector of Stamps, Calcutta.",
      "type": "material",
      "date": "1957-03-22",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Deed of mortgage duly registered at Calcutta on April 5, 1957.",
      "type": "procedural",
      "date": "1957-04-05",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "On March 23, 1957, deed executed between first petitioner and State of Uttar Pradesh releasing part of mortgage property in West Bengal and substituting part of properties in Uttar Pradesh.",
      "type": "material",
      "date": "1957-03-23",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Deed of substitution duly stamped and registered in Uttar Pradesh; no objection taken to stamps on original deed of mortgage.",
      "type": "procedural",
      "date": "1957-03-23",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "In 1960, first petitioner requested State of Uttar Pradesh to release further part of mortgage properties in original deed and accept assets of Company's factory at Varanasi as substituted security.",
      "type": "procedural",
      "date": "1960",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Draft deed of substitution sent by first petitioner to Collector of Varanasi for ascertaining stamp duty payable and benefits of reduced rates for substitution of security.",
      "type": "procedural",
      "date": "1960",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Collector of Varanasi referred matter to Board of Revenue for adjudication of stamp duty on substitution document.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Board of Revenue, Uttar Pradesh, decided original document executed in Uttar Pradesh must bear stamps issued by Uttar Pradesh Government; rejected argument that document of March 23, 1957 was not an instrument; held Company liable to pay Rs. 1,74,000 as stamp duty on document dated March 23, 1957 before concessional rate for substituted security; order dated August 11, 1961.",
      "type": "disputed",
      "date": "1961-08-11",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Collector of Varanasi by letter dated September 8, 1961 informed first petitioner that draft deed for substitution chargeable under Art. 40(c) Schedule I-B UP Stamp Amendment Act, 1958 with duty Rs. 7,554 provided original mortgage deed of March 22, 1957 first properly stamped by payment of deficit duty Rs. 1,74,000; requested deposit of Rs. 1,74,000 and Rs. 7,554.",
      "type": "procedural",
      "date": "1961-09-08",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Tehsildar, Chandauli, Varanasi by letter dated November 17, 1961 demanded payment of Rs. 1,74,000 within a week.",
      "type": "procedural",
      "date": "1961-11-17",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "First petitioner replied on November 30, 1961 asking for one month's time.",
      "type": "procedural",
      "date": "1961-11-30",
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Present petition filed on December 22, 1961.",
      "type": "procedural",
      "date": "1961-12-22",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Original mortgage deed impounded by Inspector of Stamps on August 9, 1961.",
      "type": "procedural",
      "date": "1961-08-09",
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "Stamp duty on original deed adjudicated by Collector of Stamps, Calcutta based on circular dated August 2, 1954 issued by State of West Bengal.",
      "type": "admitted",
      "date": "1957",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Where an instrument executed in Uttar Pradesh and consequently liable to stamp duty under the Indian Stamp Act as amended in Uttar Pradesh but relating to property in West Bengal bears stamps overprinted with the name of West Bengal before a public officer of Uttar Pradesh, is such officer right in holding that the instrument is not duly stamped inasmuch as it does not bear stamps overprinted with the name of Uttar Pradesh?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether under the provisions of the Stamp Act a document can be said to be unstamped unless it comes within the mischief of s. 15 of the Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether Rule 3 of the Stamp Rules framed by Uttar Pradesh Government is unconstitutional as constituting unreasonable restriction on fundamental rights under Art. 19(1)(f) and 19(1)(g).",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether circular dated August 2, 1954 of West Bengal Government is null and void and State of West Bengal illegally exacted Rs. 1,08,751 infringing Art. 19(1)(f) and 19(1)(g).",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Document cannot be said to be unstamped unless it comes within mischief of s. 15 of the Stamp Act; Board of Revenue wrong in holding mortgage deed of March 22, 1957 not properly stamped unless bore stamps of Rs. 1,74,000 issued by UP Government.",
      "supporting_facts": [
        "f4",
        "f5",
        "f12"
      ],
      "legal_basis": "Section 15 of Indian Stamp Act"
    },
    {
      "id": "pa2",
      "text": "Already paid stamp duty in West Bengal Rs. 1,08,751 after proper adjudication by Collector Calcutta based on WB circular August 2, 1954.",
      "supporting_facts": [
        "f5",
        "f18"
      ],
      "legal_basis": "Circular dated August 2, 1954 by State of West Bengal"
    },
    {
      "id": "pa3",
      "text": "Rule 3 of UP Stamp Rules unconstitutional as unreasonable restriction on fundamental rights under Art. 19(1)(f) and 19(1)(g).",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Article 19(1)(f), 19(1)(g) of Constitution; Rule 3 UP Stamp Rules"
    },
    {
      "id": "pa4",
      "text": "Alternatively, WB circular August 2, 1954 null and void; WB illegally exacted Rs. 1,08,751 without authority of law infringing Art. 19(1)(f) and 19(1)(g).",
      "supporting_facts": [
        "f5",
        "f18"
      ],
      "legal_basis": "Article 19(1)(f), 19(1)(g)"
    },
    {
      "id": "pa5",
      "text": "On proper interpretation of Stamp Act and Rules, wrong to hold document required stamps purchased from UP Government; 'duly stamped' under s.2(11) means affixed/used in accordance with law in force in India, which includes WB law.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Section 2(11) Indian Stamp Act; WB Stamp Act amendments and Rules"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Board's order dated August 11, 1961 in accordance with law.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Indian Stamp Act as amended in UP; Rule 3 UP Stamp Rules"
    },
    {
      "id": "ra2",
      "text": "Circular dated August 2, 1954 not illegal; State of West Bengal did not illegally exact Rs. 1,08,751 without authority of law.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": "WB Stamp Act amendments and Rules"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Public officer of State must apply Indian Stamp Act in light of modifications by State Legislature; for UP officers, apply Act as amended by UP.",
      "addresses_issue": "i1",
      "key_observation": "UP officers had to examine Indian Stamp Act as amended by UP Legislature."
    },
    {
      "id": "cr2",
      "text": "Section 3 as amended by UP creates liability; execution in UP makes chargeable under s.3(aa); Rule 3 requires payment by impressed stamps overprinted 'Uttar Pradesh' or 'U.P.' or adhesive 'P.'",
      "addresses_issue": "i1",
      "key_observation": "Document executed in UP liable under s.3(aa); must use UP overprinted stamps per Rule 3."
    },
    {
      "id": "cr3",
      "text": "'Duly stamped' in s.2(11) means bears stamp not less than proper amount and affixed/used in accordance with law for time being in force in India; for UP officer, law in force in India includes UP Act and Rules.",
      "addresses_issue": "i1",
      "key_observation": "Stamps overprinted West Bengal not in accordance with UP law; hence not duly stamped."
    },
    {
      "id": "cr4",
      "text": "State Legislatures amended s.3 treating State equivalent to India; liability arises on execution in particular State; must be discharged per that State's law including rules.",
      "addresses_issue": "i1",
      "key_observation": "Liability in UP discharged only by UP stamps."
    },
    {
      "id": "cr5",
      "text": "S.19A avoids double duty where instrument chargeable in one State then higher in another; pay excess in second State per its stamps; where same/lower, no further duty.",
      "addresses_issue": "i1",
      "key_observation": "Here first liability on execution in UP; WB stamping irrelevant for UP officer."
    },
    {
      "id": "cr6",
      "text": "UP officers rightly held original mortgage deed not duly stamped as did not bear UP stamps; fact stamped per WB law does not make it stamped per law in force in India for UP purposes.",
      "addresses_issue": "i1",
      "key_observation": "Petitioners not entitled to relief."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Instrument executed in UP relating to WB property, bearing WB stamps, not duly stamped before UP public officer as lacks UP overprinted stamps per UP law.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Petitioners not entitled to any relief.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Stamp Act",
      "sections": [
        "Section 3",
        "Section 2(11)",
        "Section 15",
        "Section 74",
        "Section 75",
        "Section 76",
        "Section 19A"
      ],
      "relevance": "Creates stamp duty liability on execution in State; defines 'duly stamped'; empowers rules; s.19A for excess duty."
    },
    {
      "name": "U.P. Stamp Amendment Act, 1948",
      "sections": [
        "Schedule I-A"
      ],
      "relevance": "Amends s.3 for instruments executed in/out UP."
    },
    {
      "name": "U.P. Stamp Amendment Act, 1952",
      "sections": [
        "Schedule I-B"
      ],
      "relevance": "Amends s.3 for instruments executed in/out UP."
    },
    {
      "name": "U.P. Stamp Amendment Act, 1958",
      "sections": [
        "Schedule I-B, Art. 40(c)"
      ],
      "relevance": "Chargeability of substitution deed."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 19(1)(f)",
        "Article 19(1)(g)"
      ],
      "relevance": "Petition for enforcement of fundamental rights; challenged restrictions."
    },
    {
      "name": "Indian Companies Act",
      "sections": [],
      "relevance": "Incorporation of petitioner company."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Court held that the mortgage deed executed in Uttar Pradesh was not duly stamped before UP officers as it bore West Bengal overprinted stamps, not UP stamps as required by UP Stamp Act and Rules; petitioners not entitled to any relief including quashing Board order or refunds.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Where an instrument executed in Uttar Pradesh and consequently liable to stamp duty under the Indian Stamp Act as amended in Uttar Pradesh but relating to property in West Bengal bears stamps overprinted with the name of West Bengal before a public officer of Uttar Pradesh, is such officer right in holding that the instrument is not duly stamped?",
      "speaker": "court",
      "significance": "Principal question framed by Court."
    },
    {
      "text": "'Duly stamped' as applied to an instrument means that the instrument bears an adhesive or impressed stamp of not less than the proper amount and that such stamp has been affixed or used in accordance with the law for the time being in force in India.",
      "speaker": "court",
      "significance": "Key definition interpreted in context of State-specific laws."
    },
    {
      "text": "The public officer was therefore bound to hold that it had not been stamped in accordance with the law in force in Uttar Pradesh.",
      "speaker": "court",
      "significance": "Core holding on application of State law by local officers."
    },
    {
      "text": "The Officers of the State of U. P. therefore rightly held that the original mortgage deed was not duly stamped. The petitioners are not, therefore, entitled to any relief.",
      "speaker": "court",
      "significance": "Final conclusion dismissing petition."
    }
  ],
  "_case_id": "1963_11",
  "_label": 0,
  "_text_length": 26795,
  "_extracted_at": "2026-02-10T19:47:45.644376"
}