{
  "metadata": {
    "case_name": "Bank v. Jogilal Prabhu Chand (Defendants 1 and 2)",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Civil Appeal No. 340 of 1960",
    "date_of_judgment": "1963-02-07"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Defendants 1 and 2 carried on business at Bihar Sharif under the name Messrs. Jogilal Prabhu Chand.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On February 17, 1941, defendants executed a cash credit agreement in favour of the Bank for facilities up to Rs. 50,000 against cloth bales; Rs. 15,000 advanced same day.",
      "type": "material",
      "date": "1941-02-17",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "On August 28, 1947, Firm executed promissory note for Rs. 50,000 in favour of Bihar Sharif branch of Bank and requested immediate advance of Rs. 35,000 for price of cloth allotted by Ms. Manohardas Jainarain.",
      "type": "material",
      "date": "1947-08-28",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Arrangement: Firm to draw on security of promissory note, pledge bales after receipt.",
      "type": "material",
      "date": "1947-08-28",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Firm drew cheque for Rs. 35,000 on August 29, 1947 in favour of second defendant (Mahabir Lal), passed by Manager Kapur and amount paid to second defendant.",
      "type": "disputed",
      "date": "1947-08-29",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "On August 30, 1947, false telegram from defendant No. 2 received by Manager alleging Potdar did not deposit money and requesting Rs. 35,000 be made available.",
      "type": "material",
      "date": "1947-08-30",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "On September 1, 1947, Manager informed Firm allegations false.",
      "type": "material",
      "date": "1947-09-01",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "On September 9, 1947, letter from Mahabir Lal alleging Manager and Potdar misappropriated Rs. 35,000.",
      "type": "material",
      "date": "1947-09-09",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Bank instituted suit for recovery of Rs. 35,000.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Defendants denied claim; instituted criminal case against Manager Kapur and Potdar for misappropriation, which failed.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Firm admitted arrangement for Rs. 35,000 loan for 42 bales from Manohardas Jainarain but contended Bank advances only on goods in custody.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Conditions: Execute loan bond and promissory note Rs. 50,000; draw cheque Rs. 35,000 endorsed to self; money sent via Potdar Ram Bharosa Singh to Manohardas Jainarain; Potdar to take delivery and bring bales to Bank.",
      "type": "material",
      "date": "1947-08-29",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Cheque drawn 5:00 a.m. August 29, 1947; Manager Kapur went to treasury with Potdar, returned with money wrapped in gamchha tied to Potdar's waist.",
      "type": "material",
      "date": "1947-08-29",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Potdar, second defendant, and servant Mahadeo Ram went to Patna by bus.",
      "type": "material",
      "date": "1947-08-29",
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "At Patna ekka stand, Potdar sent second defendant ahead to Manohardas Jainarain, said he would follow from Patna City Branch with money.",
      "type": "material",
      "date": "1947-08-29",
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "Second defendant waited, Potdar did not come; checked Patna City Branch, Potdar not there; sent telegram to Kapur, lodged police report.",
      "type": "material",
      "date": "1947-08-29",
      "source": "respondent"
    },
    {
      "id": "f17",
      "text": "On return August 30, second defendant told Kapur; Kapur said not to worry, would get bales released.",
      "type": "material",
      "date": "1947-08-30",
      "source": "respondent"
    },
    {
      "id": "f18",
      "text": "Trial court decreed suit for Bank; Firm appealed to Patna High Court (F.A. No. 230 of 1950), judgment March 11, 1958 allowing appeal, dismissing Bank's claim.",
      "type": "procedural",
      "date": "1958-03-11",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Patna HC: Trial court noted even if Potdar took money, he was temporary servant of Mahabir Lal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "In HC, Bank's counsel Mr. B.C. De conceded Potdar took money to Patna to pay Manohardas Jainarain.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Bank got certificate from Patna HC for SC appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Rs. 35,000 was paid by Bank to Firm, given money handed to Potdar to deliver to Manohardas Jainarain.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Firm liable despite concession that Potdar took money to Patna, relying on s.85 Negotiable Instruments Act.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Bank can hold Firm liable for misappropriation by Bank's Potdar/Manager.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Cheque for Rs. 35,000 drawn and cashed by Manager, paid to second defendant.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Even if Potdar took money to Patna, Rs. 35,000 went out of Bank's coffers against cheque; Bank not responsible who got it after honoured.",
      "supporting_facts": [
        "f20"
      ],
      "legal_basis": "s.85 Negotiable Instruments Act; Calcutta/Bombay HC decisions"
    },
    {
      "id": "pa3",
      "text": "No concession by Mr. De; challenge HC record too late.",
      "supporting_facts": [
        "f20"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Even if Potdar misappropriated, Bank not responsible as criminal act outside employment.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Gopal Chandra Bhattacharjee v. Secretary of State; Cheshire v. Bailey"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Money not paid to Firm; handed to Potdar to pay Manohardas Jainarain and bring bales.",
      "supporting_facts": [
        "f12",
        "f13",
        "f14",
        "f15",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Arrangement unusual; Manager had no authority to pay before goods in custody.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Accept HC record of concession by Bank's counsel Mr. De that Potdar took money to Patna; cannot challenge now.",
      "addresses_issue": "i2",
      "key_observation": "Statement in judgment not to be challenged unless both parties agree or court admits error."
    },
    {
      "id": "cr2",
      "text": "Money not paid to Firm; not handed to second defendant or Firm's agent; Potdar was Bank's agent to pay Manohardas and take goods.",
      "addresses_issue": "i1",
      "key_observation": "Arrangement constituted Potdar as Bank's agent; no point in Potdar accompanying if not Bank's agent."
    },
    {
      "id": "cr3",
      "text": "s.85 NI Act requires payment to Firm or on its behalf; payment to Bank's agent not payment to Firm.",
      "addresses_issue": "i2",
      "key_observation": "Jagjivandas case founded on s.85 inapplicable."
    },
    {
      "id": "cr4",
      "text": "s.118 NI Act irrelevant.",
      "addresses_issue": "i2",
      "key_observation": "No bearing on case."
    },
    {
      "id": "cr5",
      "text": "Bank cannot hold Firm liable for Bank's servant's criminal act; vicarious liability on master, not stranger.",
      "addresses_issue": "i3",
      "key_observation": "Principle applies to hold master liable, not to fasten on third party."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rs. 35,000 not paid to Firm; Potdar was Bank's agent.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "s.85 NI Act inapplicable without payment to Firm.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Firm not liable for misappropriation by Bank's Potdar/Manager; Bank bears loss.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jagjivandas Jamnadas v. The Nagar Central Bank Ltd.",
      "citation": "1925 I.L.R. 50 Bom. 118",
      "treatment": "distinguished",
      "relevance": "Founded on s.85 NI Act; inapplicable without payment to Firm"
    },
    {
      "case_name": "Gopal Chandra Bhattacharjee v. Secretary of State for India",
      "citation": "1900 I.L.R. Cal. 647",
      "treatment": "distinguished",
      "relevance": "Master not liable for servant's fraud outside course of employment for private benefit"
    },
    {
      "case_name": "Cheshire v. Bailey",
      "citation": "1905 1 K.B. 237",
      "treatment": "distinguished",
      "relevance": "Master not liable for servant's misconduct for own benefit"
    }
  ],
  "statutes_cited": [
    {
      "name": "Negotiable Instruments Act, 1881",
      "sections": [
        "Section 85",
        "Section 118"
      ],
      "relevance": "s.85 requires payment to payee or behalf; inapplicable here. s.118 irrelevant."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed Bank's appeal, upholding Patna High Court; held Rs. 35,000 not paid to Firm as money given to Bank's Potdar as agent to deliver to third party and take goods; Firm not liable for Bank's loss from Potdar's misappropriation.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Mr. B. C. De, who appeared for the plaintiff conceded at the outset that, in fact, Ram Bharosa Singh, Potdar, had taken the money to Patna City to pay to the Firm of Manohardass Jainarain.\"",
      "speaker": "court",
      "significance": "Records Bank's counsel concession, binding and unchallenged"
    },
    {
      "text": "\"Payment to a person who had nothing to do with the Firm or a payment to an agent of the Bank would not be a payment to the Firm.\"",
      "speaker": "court",
      "significance": "Explains why s.85 NI Act inapplicable"
    },
    {
      "text": "\"vicarious liability may, in appropriate cases, rest on the master with respect to his servants acts but it cannot possibly rest on a stranger with respect to the criminal acts of a servant of another.\"",
      "speaker": "court",
      "significance": "Core holding rejecting Bank's attempt to shift loss to Firm"
    }
  ],
  "_case_id": "1963_31",
  "_label": 0,
  "_text_length": 15906,
  "_extracted_at": "2026-02-10T19:47:40.968013"
}