{
  "metadata": {
    "case_name": "Appellant v. State Bank of India",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA J."
    ],
    "case_number": "Civil Appeal No. 707 of 1962",
    "date_of_judgment": "1963-04-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant was appointed as a clerk in the State Bank of India on December 14, 1953. At the time of appointment his salary was Rs. 95/- per month with a dearness allowance of Rs. 50/-",
      "type": "background",
      "date": "1953-12-14",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Sastry Award in the disputes between certain banking companies and their workmen as modified by the Labour Appellate Tribunal was given statutory force by the Industrial Disputes (Banking Companies) Decisions Act, 1955",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In applying the Sastry Award to the appellant, the bank proceeded on the basis that under it the appellant was entitled to get his annual increment in each year on April 1",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "According to the appellant, under the award he is entitled to have his annual increment in December each year",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "On December 14, 1960, the appellant made an application under s. 33C(2) of the Industrial Disputes Act before the Labour Court, Delhi, praying that the benefit under the award of which he is being deprived by the bank by the alleged error in its implementation should be computed and directed to be paid to him. A schedule was annexed purporting to show entitlement to additional sum of Rs. 146/- plus dearness allowance on basis of increments on December 14 each year",
      "type": "procedural",
      "date": "1960-12-14",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Bank raised preliminary objection that question of entitlement cannot be raised or decided in application under s. 33C(2). On merits, bank pleaded it acted in accordance with Sastry Award allowing increments on April 1 each year",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Labour Court rejected preliminary objection but held on merits that annual increment fell due after April 1, 1954, and on April 1 in succeeding years. Rejected the application by order dated December 11, 1961",
      "type": "procedural",
      "date": "1961-12-11",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appeal filed by special leave against Labour Court order",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Labour Court considered appellant's petition and four others together: two appointed February 24, 1950; one March 15, 1951; one June 1, 1953",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Revised scales of pay brought into operation under para 627 of Sastry Award with effect from April 1, 1953. Award signed between March 5 and March 20, 1953",
      "type": "material",
      "date": "1953-04-01",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Para 292 of Sastry Award dealt with fitting existing staff into revised scales of pay. After modification by Labour Appellate Tribunal, para 292(12) states: 'The adjusted pay shall have effect from April 1, 1954'",
      "type": "material",
      "date": "1954-04-01",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Persons joining after April 1, 1953 not governed by para 292 as they are not existing staff; they come straight into revised scales and get increments on anniversary of joining",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Appellant would get Rs. 100/- pm from Dec 14,1954 to Dec 13,1955; Rs. 106 pm from Dec 14,1955 to Dec 13,1956 etc., entitling him to Rs. 146/- plus DA",
      "type": "material",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Labour Court has jurisdiction under s. 33C(2) of the Industrial Disputes Act to decide whether the workman is entitled to the benefits claimed under the award",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether under the Sastry Award, annual increments for the appellant appointed on December 14, 1953 fall due on December 14 each year or on April 1 each year",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under the Sastry Award his pay had to be fixed in accordance with directions in cl. 7 of para 292 but bank wrongly fixed on basis as employees before Jan 31, 1950. Increments fall due on December 14 each year",
      "supporting_facts": [
        "f1",
        "f4",
        "f13"
      ],
      "legal_basis": "Sastry Award cl. 7 para 292"
    },
    {
      "id": "pa2",
      "text": "Labour Court erred in thinking that under award annual increments to workmen appointed after Jan 31, 1950 and before new scales fell due on April 1 starting April 1, 1954",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Question of entitlement cannot be raised or decided in application under s. 33C(2)",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "s. 33C(2) Industrial Disputes Act"
    },
    {
      "id": "ra2",
      "text": "Bank acted in accordance with Sastry Award allowing increments on April 1 each year as adjusted salary has effect from April 1, 1954 per para 292(12)",
      "supporting_facts": [
        "f3",
        "f11"
      ],
      "legal_basis": "Sastry Award para 292(12)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Scope of s. 33C(2) considered in Central Bank of India Ltd. v. P.S. Rajagopalan; Labour Court has jurisdiction to examine award or settlement to decide entitlement to claimed benefits. Preliminary objection rightly rejected",
      "addresses_issue": "i1",
      "key_observation": "Labour Court has jurisdiction"
    },
    {
      "id": "cr2",
      "text": "Para 292 deals with fitting existing staff into revised scales; applies to those before new scales effective April 1, 1953 per para 627. Appellant joined after, not existing staff, comes straight into revised scales with increments on Dec 14 anniversary",
      "addresses_issue": "i2",
      "key_observation": "Appellant entitled to increments on joining date anniversary, not April 1"
    },
    {
      "id": "cr3",
      "text": "Labour Court wrong in applying para 292(12) 'adjusted pay from April 1, 1954' to appellant and others post-April 1, 1953",
      "addresses_issue": "i2",
      "key_observation": "Rule for existing staff only"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Labour Court has jurisdiction under s. 33C(2) to determine entitlement under award",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Workmen appointed after April 1, 1953 entitled to increments under revised scales on anniversary of appointment date, not April 1",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Central Bank of India Ltd. v. P.S. Rajagopalan",
      "citation": "[1964] 3 SCR 140",
      "treatment": "followed",
      "relevance": "Scope of s. 33C(2); Labour Court jurisdiction to examine award for entitlement"
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act",
      "sections": [
        "s. 33C(2)"
      ],
      "relevance": "Application to compute benefits under award; jurisdiction of Labour Court to determine entitlement"
    },
    {
      "name": "Industrial Disputes (Banking Companies) Decisions Act, 1955",
      "sections": [],
      "relevance": "Gave statutory force to Sastry Award as modified"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, Labour Court order set aside, sum computed at Rs. 146/- plus dearness allowance directed to be paid to appellant under Sastry Award",
    "relief_granted": "Payment of Rs. 146/- plus dearness allowance",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The present appellant appointed on December 14, 1953 would get the benefit of the new scales of pay from the very date of his appointment. Consequently, he would get the increments under the new scale on December 14 of each year",
      "speaker": "court",
      "significance": "Core reasoning on increment due date for post-1953 appointees"
    },
    {
      "text": "we have decided there that the Labour Court has got jurisdiction to decide on an examination of an award or settlement whether or not the workman is entitled to the benefits claimed by him",
      "speaker": "court",
      "significance": "Confirms jurisdiction under s.33C(2)"
    }
  ],
  "_case_id": "1963_164",
  "_label": 1,
  "_text_length": 6533,
  "_extracted_at": "2026-02-10T19:49:33.594984"
}