{
  "metadata": {
    "case_name": "Appellants v. State",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Das Gupta J."
    ],
    "case_number": "Criminal Appeal No. 56 of 1960",
    "date_of_judgment": "1963-10-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "On November 15, 1956, Bhadai Sah, a businessman from Teotith, police station Baikunthpur, was passing along the village road on his way to purchase patua.",
      "type": "background",
      "date": "1956-11-15",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "The seven appellants, armed with lathis, surrounded Bhadai Sah and demanded he hand over the monies he had with him. Bhadai had Rs. 250 but refused.",
      "type": "material",
      "date": "1956-11-15",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Kesho Singh, one of the appellants, tried to take away forcibly the currency notes from Bhadai's pocket but Bhadai caught hold of his arm and raised an alarm.",
      "type": "material",
      "date": "1956-11-15",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "All the appellants assaulted Bhadai with their lathis; as he fell injured, Kesho Singh took away the money from his pocket.",
      "type": "material",
      "date": "1956-11-15",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Bhadai Sah filed a petition of complaint in the Court of the Sub-Divisional Magistrate, Gopalgunj, on November 22, 1956.",
      "type": "procedural",
      "date": "1956-11-22",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "The Magistrate examined Bhadai on solemn affirmation and made an order asking the Sub-Inspector of Police, Baikunthpur, to institute a case and report by December 12, 1956.",
      "type": "procedural",
      "date": "1956-11-22",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "A charge-sheet was submitted by the Police and the accused persons were committed to the Court of Sessions.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "The Assistant Sessions Judge, Saran, tried the appellants on charges under s. 395 and s. 323 IPC and acquitted them of both charges.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Bhadai Sah filed an appeal under s. 417(3) CrPC against the acquittal in the Patna High Court in Criminal Appeal No. 63 of 1957.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Two learned Judges of the Patna High Court ordered that the appeal will be heard.",
      "type": "procedural",
      "date": "Following day after filing",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Two other Judges of the Patna High Court, on November 27, 1959, set aside the acquittal, convicted the appellants under s. 395 IPC, and sentenced them to two years rigorous imprisonment, finding the Sessions Judge rejected evidence on unsound standards without assessing credibility.",
      "type": "procedural",
      "date": "1959-11-27",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellants filed present appeal by special leave of the Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether an appeal lay to the High Court against the order of acquittal under s. 417(3) CrPC, as the case was instituted on a police report or on a complaint.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the High Court was justified in interfering with the order of acquittal passed by the Assistant Sessions Judge.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the Magistrate acted without jurisdiction in asking the police to institute a case, rendering subsequent proceedings void.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No appeal lay under s. 417(3) CrPC to the High Court as the case was instituted on a police report, not on a complaint.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "s. 417(3) CrPC; s. 190 CrPC"
    },
    {
      "id": "pa2",
      "text": "The High Court was not justified in interfering with the acquittal order passed by the Sessions Judge.",
      "supporting_facts": [
        "f8",
        "f11"
      ],
      "legal_basis": "Principles on interference with acquittal orders"
    },
    {
      "id": "pa3",
      "text": "The Magistrate acted without jurisdiction by asking police to institute a case, making subsequent proceedings void.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s. 156(3), s. 202 CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The case was instituted on the complaint as the Magistrate took cognizance by examining the complainant under s. 200 CrPC.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "s. 200, s. 202 CrPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "A case is instituted on a complaint when the Magistrate takes cognizance under s. 190 CrPC by examining complainant under s. 200; here, Magistrate examined Bhadai under s. 200 on solemn affirmation, taking cognizance on the complaint filed November 22, 1956.",
      "addresses_issue": "i1",
      "key_observation": "Examination under s. 200 puts it beyond doubt that cognizance was taken on the complaint."
    },
    {
      "id": "cr2",
      "text": "The Magistrate's order 'To S.I. Baikunthpur for instituting a case and report by 12.12.56' after s. 200 examination is under s. 202 CrPC, not s. 156(3), as cognizance had already been taken.",
      "addresses_issue": "i1",
      "key_observation": "Police report treated as under s. 202; no fresh cognizance possible after initial cognizance."
    },
    {
      "id": "cr3",
      "text": "High Court correctly interfered as Sessions Judge rejected evidence on unsound standards without assessing credibility; prosecution case fully established.",
      "addresses_issue": "i2",
      "key_observation": "High Court followed principles on interference with acquittals; Supreme Court satisfied on evidence review."
    },
    {
      "id": "cr4",
      "text": "Magistrate's order properly under s. 202 CrPC; at most irregular, but no failure of justice.",
      "addresses_issue": "i3",
      "key_observation": "Irregularity does not vitiate conviction and sentence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Case instituted on complaint on November 22, 1956, when Magistrate took cognizance; appeal under s. 417(3) CrPC lay to High Court.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court justified in setting aside acquittal and convicting appellants under s. 395 IPC.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Magistrate's order under s. 202 CrPC; no jurisdictional error vitiating proceedings.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "R. Chari v. State of U.P.",
      "citation": "1951 S.C.R. 312",
      "treatment": "followed",
      "relevance": "Magistrate takes cognizance when applies mind under Chapter XVI; not for s.156(3) investigation."
    },
    {
      "case_name": "Gopal Das v. State of Assam",
      "citation": "A.I.R. 1961 S.C. 986",
      "treatment": "followed",
      "relevance": "Magistrate takes cognizance when applies mind for Chapter XVI proceedings; not for investigation under s.156(3) or search warrant."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 395",
        "s. 323"
      ],
      "relevance": "Charges framed; conviction under s. 395"
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 417(3)",
        "s. 190(1)",
        "s. 193",
        "s. 194",
        "s. 200",
        "s. 202",
        "s. 203",
        "s. 204",
        "s. 156(3)",
        "s. 173"
      ],
      "relevance": "Governs institution of case on complaint vs police report, cognizance, inquiry/investigation, appeal against acquittal"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upheld the Patna High Court's order setting aside the acquittal by the Assistant Sessions Judge, and confirmed the conviction of the appellants under s. 395 IPC with two years rigorous imprisonment, rejecting contentions on appealability, interference with acquittal, and jurisdictional irregularity.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is well settled that when on a petition of complaint being filed before him a Magistrate applies his mind for proceeding under the various provisions of Chapter XVI of the Code of Criminal Procedure, he must be held to have taken cognizance of the offences mentioned in the complaint.",
      "speaker": "court",
      "significance": "Defines when cognizance taken on complaint"
    },
    {
      "text": "This examination by the Magistrate under s. 200 of the Code of Criminal Procedure puts it beyond doubt that the Magistrate did take cognizance of the offences mentioned in the complaint.",
      "speaker": "court",
      "significance": "Confirms cognizance in this case via s.200 examination"
    },
    {
      "text": "The High Court examined the matter fully and carefully and on a detailed consideration of the evidence came to the conclusion that assessment of the evidence had resulted in a serious failure of justice.",
      "speaker": "court",
      "significance": "Justifies High Court's interference with acquittal"
    }
  ],
  "_case_id": "1963_294",
  "_label": 0,
  "_text_length": 14118,
  "_extracted_at": "2026-02-10T19:51:01.044783"
}