{
  "metadata": {
    "case_name": "Appellants (Textile Dealers) v. Commercial Tax Officer and State of Andhra Pradesh",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Ayyangar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants were and are doing business in the purchase and sale of textile goods.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Under Section 5 of the Andhra Pradesh General Sales Tax Act, 1957, dealers are liable to pay sales tax on their turnover; sub-s. (3)(a) read with Sch. II made cotton textile goods liable to tax at a single point.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Section 9 of the Act enabled the State Government to exempt tax leviable under the Act.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Notification issued on December 13, 1957 under sub-Section (1) of Section 9 exempting from tax payable under the Act, with effect from December 14, 1957, the sale or purchase of goods in the appendix including all varieties of textiles; proviso stated exemption subject to conditions where additional duties of excise leviable by Central Government under clause 3 of Additional Duties of Excise Bill, 1957 read with s.4 Provisional Collection of Taxes Act, 1931.",
      "type": "material",
      "date": "1957-12-13",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Condition in proviso: dealer to prove to satisfaction of assessing authority that additional duties of excise levied and collected by Central Government, else liable to pay tax under Act or lump sum compensation.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Clause 3(1) of Additional Duties of Excise Bill, 1957 levied duties on cotton fabrics, rayon or artificial silk fabrics and woollen fabrics produced or manufactured in India and on such goods lying in stock within precincts of factory, warehouse or other premises.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellants claimed exemption from sales tax on textile goods in stock with them on December 14, 1957 relying on notification.",
      "type": "disputed",
      "date": "1957-12-14",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Sales Tax authorities rejected claim; Commercial Tax Officer issued notice demanding sales tax on these goods.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Appellants filed Writ Petition under Art. 226 in High Court praying for quashing the notice, claiming no tax payable by reason of notification and also impugning constitutional validity of Sales Tax Act and provisions on textile goods.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "High Court dismissed Writ Petition rejecting all contentions including exemption claim and constitutional challenge.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellants obtained special leave to appeal to Supreme Court; constitutional invalidity arguments not repeated, only construction of notification argued.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Textile goods in possession of appellants not subject to excise duty or additional excise duty under clause 3(1) of the Bill.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Proper construction and legal effect of notification under s.9(1) of the Andhra Pradesh General Sales Tax Act, 1957, particularly whether appellants entitled to exemption for textile goods in stock on December 14, 1957 given the proviso.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "On plain reading of notification, appellants entitled to benefit of exemption if para 1 stood alone; proviso does not apply as no additional duty of excise leviable on their goods, so no need to prove payment.",
      "supporting_facts": [
        "f1",
        "f4",
        "f7",
        "f12"
      ],
      "legal_basis": "Notification under s.9(1) AP GST Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Exemption granted to avoid double taxation (excise and sales tax); proviso applies if goods of class (textiles) on which additional duties leviable under cl.3(1), even if not actually leviable due to location outside factory/warehouse; 'any class of such goods' covers textiles generally.",
      "supporting_facts": [
        "f4",
        "f6",
        "f12"
      ],
      "legal_basis": "Clause 3(1) Additional Duties of Excise Bill; proviso to notification"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "First paragraph grants unqualified exemption for textiles from Dec 14, 1957; proviso restricts only where additional excise duties leviable under cl.3(1); since appellants' goods not leviable (not in factory/warehouse), proviso inapplicable; 'class of such goods' refers to goods actually liable under full cl.3(1) including location condition.",
      "addresses_issue": "i1",
      "key_observation": "Proviso operates only where duty leviable; appellants' goods outside scope as no liability to additional excise duty."
    },
    {
      "id": "cr2",
      "text": "Object to avoid double taxation not relevant; fiscal provisions construed by plain words, no equity; taxpayer within plain terms entitled to benefit.",
      "addresses_issue": "i1",
      "key_observation": "Operation judged by words employed, not supposed intention."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellants entitled to exemption from sales tax under notification dated December 13, 1957 for textile goods in stock on December 14, 1957 as proviso does not apply.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Salomon v. Salomon & Co.",
      "citation": "1897 A.C. 22",
      "treatment": "referred",
      "relevance": "Intention of legislature ascertained from express words or necessary intendment, not speculative opinion."
    }
  ],
  "statutes_cited": [
    {
      "name": "Andhra Pradesh General Sales Tax Act, 1957 (A.P. Act VI of 1957)",
      "sections": [
        "Section 5",
        "Section 5(3)(a)",
        "Section 9(1)",
        "Schedule II"
      ],
      "relevance": "Charging section for sales tax; power to exempt; exemption notification issued thereunder applied to grant relief."
    },
    {
      "name": "Additional Duties of Excise (Levy and Distribution) Bill, 1957",
      "sections": [
        "Clause 3(1)"
      ],
      "relevance": "Levy of additional excise on textiles in specified premises; proviso to notification conditioned on this levy."
    },
    {
      "name": "Provisional Collection of Taxes Act, 1931 (Central Act XVI of 1931)",
      "sections": [
        "Section 4"
      ],
      "relevance": "Read with Additional Duties Bill for levy of duties."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for writ petition in High Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order dismissing writ petition set aside; declaration that appellants entitled to benefit of notification exempting sales tax on textile goods in stock on December 14, 1957; respondents restrained from levying/collecting such tax; no interference with High Court costs order as constitutional challenge unsuccessful.",
    "relief_granted": "Declaration of exemption from sales tax on specified goods and restraint on collection.",
    "costs": "High Court costs order not interfered with."
  },
  "key_quotes": [
    {
      "text": "If the tax-payer is within the plain terms of the exemption he cannot be denied its benefit by calling in aid any supposed intention of the exempting authority.",
      "speaker": "court",
      "significance": "Core principle of construction of fiscal exemptions."
    },
    {
      "text": "In a taxing statute there is no room for any intendment but regard must be had to the clear meaning of the words.",
      "speaker": "court",
      "significance": "Rejects purposive overreach beyond plain language."
    }
  ],
  "_case_id": "1963_288",
  "_label": 1,
  "_text_length": 18435,
  "_extracted_at": "2026-02-10T19:51:10.460956"
}