{
  "metadata": {
    "case_name": "Moti Singh and Jagdamba Prasad v. State",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Criminal Appeals Nos. 146 and 147 of 1962",
    "date_of_judgment": "1963-01-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Moti Singh and Jagdamba Prasad, appellants, together with five other persons, were convicted by the Sessions Judge of Unnao of offences under s. 148, 302 read with 149 and 307 read with 149 I.P.C. Each sentenced to life imprisonment under s. 302 read with s. 149 I.P.C.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On appeal, the High Court acquitted the other five persons of the various offences. Conviction of the appellants under s. 148 I.P.C. was set aside, but their conviction for offences under ss. 302 and 307 read with s. 149 altered to ss. 302 and 307 read with s. 34 I.P.C.",
      "type": "procedural",
      "date": "1962-02-02",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "On application of Krishna Kumar, brother of one murdered person, High Court enhanced sentence of appellants for murder to death.",
      "type": "procedural",
      "date": "1962-02-02",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Incident occurred on February 9, 1960, in which several persons lost lives; appellants convicted for participation.",
      "type": "background",
      "date": "1960-02-09",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "All eye-witnesses deposed in identical terms about accused party firing with guns and pistols from inside and outside room on one side of passage and from seori cattle shed on other side when victim party passed along passage.",
      "type": "disputed",
      "date": "1960-02-09",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "High Court doubted firing from cattle shed, acquitted Sheo Shankar, Jagjiwan and Shankar Dayal said to have fired from there.",
      "type": "material",
      "date": "1960-02-09",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "High Court believed prosecution version of firing from room and later from platform based on prosecution witnesses and statements Ex. Kha 5, Kha 8, Kha 75.",
      "type": "disputed",
      "date": "1960-02-09",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Statements Ex. Kha 5 and Kha 8 made by Ram Shankar and Jageshwar (Court witnesses 1 and 2), disbelieved by Sessions Judge; High Court relied on them erroneously as substantive evidence.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Ex. Kha 75, statement of Gaya Charan (deceased), alleged dying declaration: 'Lallan, Chandu, Raj Narain, Sardar, Sri Prakash were going to the bazar. Shots were fired from front, Jagdamba, Phunnar, Moti and one man whom I know by face fired gunshots on us.'",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Raj Kumar PW 11, Chandra Kumar PW 15 partisan; Shyam Lal PW 12, Gopi Singh PW 14 independent; Lal Singh PW 17, Sardar CW 16 injured.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court relied on Ex. Kha 75 as complete account; acquitted Sheo Darshan Singh and Avadh Behari as not named therein.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Jagdamba Prasad absconding till arrest on September 30, 1960.",
      "type": "background",
      "date": "1960-09-30",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Gaya Charan injured February 9, 1960; Dr. Bhatnagar found two gun shot wounds dangerous to life. Left hospital; died March 1, 1960; body burnt before post-mortem.",
      "type": "material",
      "date": "1960-02-09",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "No evidence Gaya Charan died due to injuries; Ram Shankar had similar injury but survived.",
      "type": "disputed",
      "date": "1960-03-01",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "High Court fixed number of assailants at four based on Ex. Kha 75; no offence u/s 148, s.149 not applicable.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the conviction of appellants under ss. 302/34 and 307/34 IPC can be maintained on the evidence, particularly the admissibility and reliability of Gaya Charan's alleged dying declaration Ex. Kha 75.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether statements Ex. Kha 5 and Kha 8 of disbelieved witnesses Ram Shankar and Jageshwar could be used as substantive evidence.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether Gaya Charan died due to injuries received in the incident, making his statement admissible u/s 32(d) Evidence Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Alleged dying declaration Ex. Kha 75 of Gaya Charan inadmissible as not proved he died from injuries received in incident.",
      "supporting_facts": [
        "f13",
        "f14"
      ],
      "legal_basis": "Section 32 clause d, Evidence Act"
    },
    {
      "id": "pa2",
      "text": "Statements Ex. Kha 5 and Kha 8 could not be used as substantive evidence since witnesses disbelieved in court.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Evidence Act (corroboration/contradiction only)"
    },
    {
      "id": "pa3",
      "text": "Remaining evidence insufficient to prove participation beyond reasonable doubt; High Court would have acquitted if not relied on inadmissible evidence.",
      "supporting_facts": [
        "f7",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Indefiniteness of 'Moti' in dying declaration as three Motis in village.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Disputed that dying declaration inadmissible.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court erred in using statements Ex. Kha 5 and Kha 8 as substantive evidence; could only corroborate/contradict court testimony of disbelieved witnesses.",
      "addresses_issue": "i2",
      "key_observation": "Those statements could not be used as independent evidence."
    },
    {
      "id": "cr2",
      "text": "No evidence Gaya Charan died due to injuries; injuries dangerous to life but occurred three weeks prior, body cremated without post-mortem; similar injury to Ram Shankar who survived.",
      "addresses_issue": "i3",
      "key_observation": "Finding that he died of injuries not supported by evidence."
    },
    {
      "id": "cr3",
      "text": "Ex. Kha 75 inadmissible u/s 32(d) Evidence Act as cause of death not in question and not proved due to incident injuries.",
      "addresses_issue": "i1",
      "key_observation": "Statement not relevant when death not proved from transaction."
    },
    {
      "id": "cr4",
      "text": "High Court mainly relied on Ex. Kha 75 for identifying appellants and number of assailants; without it, remaining evidence insufficient per High Court's own view.",
      "addresses_issue": "i1",
      "key_observation": "Appellants get benefit of doubt as others acquitted similarly."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Ex. Kha 75 inadmissible; appellants not proved to have participated in incident.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Prior statements of disbelieved witnesses not substantive evidence.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Gaya Charan not proved to have died due to injuries.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "148",
        "302",
        "149",
        "307",
        "34"
      ],
      "relevance": "Offences convicted under; High Court altered to 302/34, 307/34; s.149 not applicable due to number of assailants."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "32 (clause d)"
      ],
      "relevance": "Statement relevant only if made as to cause of death or circumstances thereof when cause of death comes into question."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; High Court order set aside; appellants Moti Singh and Jagdamba Prasad acquitted of offences under ss. 302/34 and 307/34 IPC.",
    "relief_granted": "Acquittal",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The mere fact that the two gun-shot injuries were dangerous to life is not sufficient for holding that Gaya Charan's death which took place about three weeks after the incident must have been on account of those injuries.\"",
      "speaker": "court",
      "significance": "Rejects presumption of death from injuries without evidence."
    },
    {
      "text": "\"Clause (d) of s. 32 of the Evidence Act makes a statement of a person who has died relevant only when that statement is made by a person as to the cause of his death or as to any of the circumstances of the transaction which resulted in his death, in cases in which the cause of that person's death comes into question.\"",
      "speaker": "court",
      "significance": "Explains inadmissibility of dying declaration."
    },
    {
      "text": "\"We therefore hold that Moti Singh and Jagdamba Prasad have not been proved to have taken part in that incident on February 9, 1960.\"",
      "speaker": "court",
      "significance": "Core holding leading to acquittal."
    }
  ],
  "_case_id": "1963_9",
  "_label": 1,
  "_text_length": 13486,
  "_extracted_at": "2026-02-10T19:46:57.338705"
}