{
  "metadata": {
    "case_name": "Appellant v. Respondent",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 194 of 1961",
    "date_of_judgment": "1963-02-11"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent (wife of appellant) obtained decree for maintenance on August 9, 1949, ordering appellant to pay Rs. 3,000 per year on 28th February every year with 6% interest if not paid on due date; decree included arrears of past maintenance and created charge for past and future maintenance on three lots of properties.",
      "type": "material",
      "date": "1949-08-09",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent filed execution petition No. 91 of 1952 to bring charged properties to sale; purchased two items for Rs. 20,200 subject to maintenance charge after court permission; deposited Rs. 6,010 towards balance after deducting maintenance amount due up to June 28, 1952.",
      "type": "procedural",
      "date": "1952",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Amounts due up to June 28, 1952, realised by sale of properties lots 1 and 2.",
      "type": "material",
      "date": "1952-06-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent filed execution No. 43 of 1955 seeking sale of properties other than those purchased by her; sum due between June 28, 1952, and February 28, 1955, including Rs. 8,000 maintenance and Rs. 867-8-0 costs.",
      "type": "procedural",
      "date": "1955",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Appellant filed application under s. 47 CPC to record full satisfaction of decree, contending respondent cannot maintain fresh execution after purchasing properties subject to charge.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Subordinate Judge of Visakhapatnam upheld appellant's contention and dismissed execution petition as not maintainable.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Respondent appealed to Andhra Pradesh High Court at Hyderabad in C.M.A. No. 120 of 1956; High Court reversed Subordinate Judge on July 28, 1959, and ordered execution to proceed.",
      "type": "procedural",
      "date": "1959-07-28",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant obtained special leave and filed Civil Appeal No. 194 of 1961 in Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the decree must be held to be satisfied because the respondent purchased in an earlier execution one lot of properties subject to her charge for maintenance.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether execution against properties in appellant's possession can proceed or respondent must first proceed against properties purchased by her.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Respondent must look to the properties purchased by her for satisfaction of her claim in respect of maintenance past or future.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "In the alternative, execution against properties in his possession cannot proceed till respondent has first proceeded against properties with her; assumes merger of right under maintenance decree with auction purchase right.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Analogy to mortgage where mortgagee acquires mortgagor's share in portion of property.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Execution petition maintainable; entitled to proceed against remaining charged properties.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Maintenance decree is not only declaratory but executory; provides for payment as long as respondent lives; becomes executable repeatedly as future sums due; charge subsists on remaining properties till decree ceases.",
      "addresses_issue": "i1",
      "key_observation": "No merger or transfer of charge in entirety to purchased properties; charge continues jointly and severally over all properties."
    },
    {
      "id": "cr2",
      "text": "Charge different from mortgage: mortgage transfers interest (jus in rem), charge merely right to payment out of property (jus ad rem); no personal liability unless specified.",
      "addresses_issue": "i2",
      "key_observation": "Appellant's mortgage analogy ill-founded; charge enforceable against all or any properties at holder's option."
    },
    {
      "id": "cr3",
      "text": "No requirement for respondent to proceed first against her purchased properties; no marshalling; court may choose order of sale among judgment-debtor's properties but cannot force exhaustion of charge-holder's own properties.",
      "addresses_issue": "i2",
      "key_observation": "Respondent entitled to proceed against appellant's remaining charged properties."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Executing court may sell sufficient items to meet dues but appellant cannot insist respondent proceed against her purchased properties.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No opinion on personal execution against appellant as question did not arise.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s. 47"
      ],
      "relevance": "Appellant applied under this for recording full satisfaction of decree."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding the High Court's order allowing execution to proceed against remaining charged properties in appellant's possession; respondent entitled to enforce charge without first exhausting properties purchased by her.",
    "relief_granted": "Execution No. 43 of 1955 to proceed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The short question is whether the decree must be held to be satisfied because the respondent purchased in an earlier execution one lot of properties subject to her charge for maintenance.",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "A charge is different from a mortgage. A mortgage is a transfer of an interest in property while a charge is merely a right to receive payment out of some specified property.",
      "speaker": "court",
      "significance": "Key distinction rejecting appellant's analogy."
    },
    {
      "text": "The respondent was entitled to proceed against the remaining properties in the hands of the appellant which continued charged.",
      "speaker": "court",
      "significance": "Principal holding allowing execution."
    }
  ],
  "_case_id": "1963_104",
  "_label": 0,
  "_text_length": 7812,
  "_extracted_at": "2026-02-10T19:48:52.981252"
}