{
  "metadata": {
    "case_name": "Appellants (original nine plaintiffs including Kedar Nath) v. Respondents (defendant No. 1 and defendant No. 2)",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal J."
    ],
    "case_number": "Civil Appeal No. 577 of 1961",
    "date_of_judgment": "1963-05-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Nine persons, including Kedar Nath, instituted a suit for ejectment and recovery of rent against two defendants on the allegation that defendant No. 1 was the tenant-in-chief who had sub-let the premises to defendant No. 2.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The suit for ejectment was decreed against both the defendants and for arrears of rent against defendant No. 1.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On appeal by defendant No. 2 the District Judge set aside the decree for ejectment against defendant No. 2 and confirmed the rest of the decree against defendant No. 1.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The nine original plaintiffs filed the second appeal in the Allahabad High Court on February 29, 1952.",
      "type": "procedural",
      "date": "1952-02-29",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Kedar Nath, appellant No. 3, died on September 8, 1955.",
      "type": "material",
      "date": "1955-09-08",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In view of rr. 3 and 11 of O. XXII of the Code of Civil Procedure, the appeal abated so far as Kedar Nath was concerned as no application for bringing his legal representatives on the record was made within the prescribed time.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On October 1, 1956, two applications were filed in the High Court: one under s. 5 of the Limitation Act for condonation of the delay in filing the application for substitution of the heirs in place of Kedar Nath, and the other for substitution praying that Bithal Das and Banarsi Das, the sons of Kedar Nath, be substituted as his heirs and representatives.",
      "type": "procedural",
      "date": "1956-10-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "These two applications were dismissed on May 1, 1957, with the result that the appeal stood abated as against Kedar Nath.",
      "type": "procedural",
      "date": "1957-05-01",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Bhagwati Prasad, appellant No. 9, died on July 2, 1956. His widow, Rameshwari Devi, was brought on the record in his place.",
      "type": "material",
      "date": "1956-07-02",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "When the appeals of the appellants other than Kedar Nath came up for hearing on September 1, 1958, a preliminary objection was taken by the respondent that the entire appeal had abated.",
      "type": "procedural",
      "date": "1958-09-01",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Mr. Jagdish Swarup, counsel for the appellants, contended that the deceased belonged to a joint Hindu family and other members were already on record, so no abatement.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Court allowed time for filing affidavit on joint family facts. On September 8, 1958, affidavit filed by Suraj Prasad Misra stating Lala Ram Chandra Prasad (appellant No. 8) managed family properties including the disputed one, acted for the family.",
      "type": "procedural",
      "date": "1958-09-08",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Counter-affidavit filed stating allegations misleading, no averment of joint family, members separated, separate income-tax assessments, property not joint.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Rejoinder affidavit by Sri Narain re-affirming Ram Chandra Prasad managed house property for the family.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "At hearing, only point urged was competence to continue under O. XLI r. 4. Repelled based on Baij Nath v. Ram Bharose as interests joint and indivisible, leading to inconsistent decrees. High Court dismissed appeal.",
      "type": "procedural",
      "date": "1959-01-07",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Appeal to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the nine appellants constituted a joint Hindu family such that r. 2 of O. XXII applies and surviving appellants could continue the appeal.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether, after abatement as to Kedar Nath under r. 3 of O. XXII, the surviving appellants could continue the appeal under O. XLI r. 4, allowing reversal or variation of the whole decree.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether O. XLI r. 33 empowers the court to pass a decree in favour of the rights and interests of the deceased Kedar Nath despite abatement.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The nine appellants constitute a joint Hindu family and the surviving plaintiffs could continue the appeal under r. 2 of O. XXII.",
      "supporting_facts": [
        "f11",
        "f12",
        "f14"
      ],
      "legal_basis": "O. XXII r. 2, CPC"
    },
    {
      "id": "pa2",
      "text": "Even if appeal abated as to Kedar Nath, surviving appellants could continue under O. XLI r. 4 as the decree proceeded on a ground common to all plaintiffs, allowing appeal from whole decree.",
      "supporting_facts": [
        "f3",
        "f15"
      ],
      "legal_basis": "O. XLI r. 4, CPC; Baij Nath v. Ram Bharose (alleged misconstrued); Ramphal Sahu v. Babu Satdeo Jha"
    },
    {
      "id": "pa3",
      "text": "O. XLI r. 33 allows court to pass decree in favour of rights and interests of Kedar Nath.",
      "supporting_facts": [
        "f6",
        "f8"
      ],
      "legal_basis": "O. XLI r. 33, CPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Entire appeal abated due to abatement as to Kedar Nath, as interests joint and indivisible, leading to inconsistent decrees if proceeded.",
      "supporting_facts": [
        "f6",
        "f8",
        "f10",
        "f13"
      ],
      "legal_basis": "O. XXII rr. 3, 11; O. XLI r. 4; Baij Nath v. Ram Bharose"
    },
    {
      "id": "ra2",
      "text": "Family not joint Hindu family: no averment in affidavits, members separated, separate income-tax assessments, property not joint; substitution application treated sons as heirs.",
      "supporting_facts": [
        "f7",
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Affidavits do not aver that Kedar Nath and surviving appellants formed joint Hindu family despite opportunity; substitution application treated sons as heirs, not joint family members. Not proved joint family.",
      "addresses_issue": "i1",
      "key_observation": "The inference is obvious... these people did not form a joint Hindu family."
    },
    {
      "id": "cr2",
      "text": "O. XLI r. 4 inapplicable: second appeal filed jointly by all nine, not by one representing all; after abatement, cannot treat as filed under r. 4 as time-barred; surviving appellants did not represent Kedar Nath; would lead to decree against finality for legal representatives.",
      "addresses_issue": "i2",
      "key_observation": "The surviving appellants cannot be said to have filed the appeal as representing Kedar Nath."
    },
    {
      "id": "cr3",
      "text": "O. XXII r. 9 abatement means decree final, appellate court cannot modify directly or indirectly (citing State of Punjab v. Nathu Ram).",
      "addresses_issue": "i2",
      "key_observation": "Abatement... means not only that the decree... has become final, but also... the appellate Court cannot... modify that decree directly or indirectly."
    },
    {
      "id": "cr4",
      "text": "O. XLI r. 4 and O. XXII r. 9 operate at different stages: r. 4 at filing, r. 9 during pendency. No override.",
      "addresses_issue": "i2",
      "key_observation": "There is no inconsistency between the provisions of r. 9 of O. XXII and those of r. 4 of O. XLI."
    },
    {
      "id": "cr5",
      "text": "O. XLI r. 33 discretionary for justice, not to nullify abatement; would lead to contradictory decrees; appeal incompetent post-abatement (citing Mahomed Khaleel Shirazi). Majority High Courts hold no power to proceed under r. 4 post-abatement.",
      "addresses_issue": "i3",
      "key_observation": "The discretionary power cannot be exercised to nullify the effect of the abatement."
    },
    {
      "id": "cr6",
      "text": "All appellants had common right and interest in ejectment; defendant cannot be tenant of some but not others when joint right.",
      "addresses_issue": "i1",
      "key_observation": "It is not possible for the defendant to continue as tenant of one of the landlords and not as a tenant of the others."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellants did not prove joint Hindu family; r. 2 O. XXII r. 2 does not apply; right to appeal did not survive to surviving appellants alone.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "O. XLI r. 4 does not permit surviving appellants to continue appeal post-abatement under O. XXII r. 3; appeal filed jointly, not by one representing all; post-abatement use time-barred and against finality.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "O. XLI r. 33 does not override abatement under O. XXII r. 9; cannot pass decree for deceased's share.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Baij Nath v. Ram Bharose",
      "citation": "I.L.R. 1953 All. 434",
      "treatment": "followed",
      "relevance": "Interests joint/indivisible; cannot proceed under O. XLI r. 4 post-abatement leading to inconsistent decrees."
    },
    {
      "case_name": "Ramphal Sahu v. Babu Satdeo Jha",
      "citation": "I.L.R. 19 Pat. 870",
      "treatment": "followed",
      "relevance": "Majority view: no power under O. XLI r. 4 if abatement under O. XXII r. 3."
    },
    {
      "case_name": "State of Punjab v. Nathu Ram",
      "citation": "1962-2 S.C.R. 636",
      "treatment": "followed",
      "relevance": "Abatement means decree final; appellate court cannot modify directly/indirectly."
    },
    {
      "case_name": "Mahomed Khaleel Shirazi & Sons v. Los Panneries Lyonnaises",
      "citation": "53 I.A. 84",
      "treatment": "followed",
      "relevance": "O. XLI r. 33 not for incompetent appeals."
    },
    {
      "case_name": "Amin Chand v. Baldeo Sahai Ganga Sahai",
      "citation": "I.L.R. 15 Lah. 667",
      "treatment": "followed",
      "relevance": "Majority view against proceeding under r. 4 post-abatement."
    },
    {
      "case_name": "Nanak v. Ahmad Ali",
      "citation": "I.L.R. 1946 Lah. 399",
      "treatment": "followed",
      "relevance": "Same."
    },
    {
      "case_name": "Pyarelal v. Sikhar Chand",
      "citation": "I.L.R. M.P. 21",
      "treatment": "followed",
      "relevance": "Same."
    },
    {
      "case_name": "Raghu Sutar v. Nrusingha Nath",
      "citation": "A.I.R. 1959 Orissa 148",
      "treatment": "followed",
      "relevance": "Same."
    },
    {
      "case_name": "Venkata Ram Rao v. Narayana",
      "citation": "A.I.R. 1963 A.P. 168",
      "treatment": "followed",
      "relevance": "Same."
    },
    {
      "case_name": "Sonahar Ali v. Mukbul Ali",
      "citation": "A.I.R. 1956 Assam 164",
      "treatment": "followed",
      "relevance": "Same."
    },
    {
      "case_name": "Shripad Balwant v. Nagu Kusheba",
      "citation": "I.L.R. 1943 Bom. 143",
      "treatment": "distinguished",
      "relevance": "Minority view allowing proceeding under r. 4."
    },
    {
      "case_name": "Satulal Bhattachariya v. Asiruddin Shaikh",
      "citation": "I.L.R. 61 Cal. 879",
      "treatment": "distinguished",
      "relevance": "Minority view."
    },
    {
      "case_name": "Somasundaram Chettiar v. Vaithilinga Mudaliar",
      "citation": "I.L.R. 40 Mad. 846",
      "treatment": "distinguished",
      "relevance": "Minority view."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order XXII r. 2",
        "Order XXII r. 3",
        "Order XXII r. 9",
        "Order XXII r. 11",
        "Order XLI r. 4",
        "Order XLI r. 33",
        "Order XLI r. 31",
        "Order XLI r. 32",
        "s. 35A"
      ],
      "relevance": "Governing abatement of appeals, substitution of legal representatives, competence to file/continue appeals by some plaintiffs, appellate powers to vary decrees."
    },
    {
      "name": "Limitation Act",
      "sections": [
        "s. 5"
      ],
      "relevance": "Condonation of delay in substitution application."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the Allahabad High Court's dismissal of the second appeal due to abatement as to Kedar Nath rendering the entire appeal incompetent, as appellants did not prove joint family status and O. XLI rr. 4 and 33 do not permit continuation or variation in favour of deceased's share post-abatement.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The abatement of an appeal means not only that the decree between the appellant and the deceased respondent had become final, but also, as a necessary corollary, that the appellate Court cannot, in any way, modify that decree directly or indirectly.",
      "speaker": "court",
      "significance": "Defines effect of abatement, preventing modification."
    },
    {
      "text": "It is not possible for the defendant to continue as tenant of one of the landlords and not as a tenant of the others when all of them had a joint right to eject him or to have him as their tenant.",
      "speaker": "court",
      "significance": "Explains indivisibility of joint interest in ejectment."
    },
    {
      "text": "The discretionary power cannot be exercised to nullify the effect of the abatement of the appeal so far as Kedar Nath is concerned.",
      "speaker": "court",
      "significance": "Limits O. XLI r. 33 application post-abatement."
    }
  ],
  "_case_id": "1963_124",
  "_label": 0,
  "_text_length": 18096,
  "_extracted_at": "2026-02-10T19:49:09.007301"
}