{
  "metadata": {
    "case_name": "Borough Municipality of Bhusawal v. Bhusawal Electricity Co. Ltd. & State of Bombay",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar J."
    ],
    "case_number": "Civil Appeals Nos. 47 and 48 of 1961",
    "date_of_judgment": "1963-12-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Two separate suits instituted by the appellant, Borough Municipality of Bhusawal, against Bhusawal Electricity Co. Ltd. (respondent No. 1), with State of Bombay later added as defendant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant claimed refund of two sums of money paid under protest to respondent No. 1 as electricity charges surcharge under Bombay Electricity Supply (Licensed Undertakings) War Costs Order, 1944.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Appellant succeeded in both suits in trial court and District Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Bombay High Court in second appeal (Appeal No. 1085 of 1954 with Second Appeal No. 1086 of 1954, judgment dated August 5, 1957) set aside decrees of lower courts and dismissed the suits.",
      "type": "procedural",
      "date": "1957-08-05",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "High Court admitted certain documents as additional evidence by order dated April 30, 1958; no objection raised by appellant at that time.",
      "type": "procedural",
      "date": "1958-04-30",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant based claim on interpretation of agreements for payment of electric charges, asserting no liability to pay surcharge under Surcharge Order, 1944 for electrical energy consumed by it.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Respondent No. 1's defence: Dispute between municipality and company decided by Government of Bombay; decision final and binding under second proviso to cl. 5 of Surcharge Order, 1944.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Government communication Ex. 68 dated May 22, 1946, directed municipality to pay surcharge at 15% fixed in Government Order No. 6331/36-IV dated August 15, 1944, unless company raised street lighting rate above 4 annas per unit.",
      "type": "material",
      "date": "1946-05-22",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Both parties stated their cases before Government, as referenced in the communication ending with Government letter dated May 10, 1946.",
      "type": "background",
      "date": "1946-05-10",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant did not produce correspondence showing it did not refer dispute to Government.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Bombay High Court was competent in second appeal to admit additional evidence under O. XLI r. 27 CPC, and whether it could be used to fill lacuna in evidence.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether dispute between parties was referred to Government of Bombay and whether Ex. 68 dated May 22, 1946 constitutes a final binding decision under second proviso to cl. 5 of Surcharge Order, 1944.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether second proviso to cl. 5 requires reference by both parties as arbitration under Arbitration Act, 1940.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court incompetent in second appeal to admit additional evidence as O. XLI r. 27 CPC inapplicable to second appeal; cannot fill lacuna left by party.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "O. XLI r. 27, Code of Civil Procedure"
    },
    {
      "id": "pa2",
      "text": "No evidence in trial court that dispute referred to Government; Ex. 68 contains only opinion, not decision.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Second proviso to cl. 5, Surcharge Order, 1944"
    },
    {
      "id": "pa3",
      "text": "Proviso constitutes Government as arbitrator; requires reference by both parties under Arbitration Act, 1940.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Arbitration Act, 1940; Second proviso to cl. 5, Surcharge Order, 1944"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Dispute decided by Government of Bombay; decision final and binding under second proviso to cl. 5 of Surcharge Order, 1944.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Second proviso to cl. 5, Bombay Electricity Supply (Licensed Undertakings) War Costs Order, 1944"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Unnecessary to decide if High Court could admit additional evidence in second appeal or if proper in circumstances.",
      "addresses_issue": "i1",
      "key_observation": "No objection raised by appellant when High Court admitted evidence on April 30, 1958."
    },
    {
      "id": "cr2",
      "text": "Ex. 68 shows Government fully considered cases of both parties under second proviso to cl. 5 after correspondence; decided municipality must pay surcharge unless condition met; on face a decision, not mere opinion.",
      "addresses_issue": "i2",
      "key_observation": "Appellant's omission to produce correspondence construes against it; both parties acted under proviso."
    },
    {
      "id": "cr3",
      "text": "Proviso language 'in the event of dispute by any party interested' does not require referral by both parties.",
      "addresses_issue": "i3",
      "key_observation": "Point not raised below or in statement of case; not permitted."
    },
    {
      "id": "cr4",
      "text": "Trial court and District Court misconstrued Ex. 68, which is basis of respondent's claim; misconstruction is error of law correctable in second appeal by High Court.",
      "addresses_issue": "i2",
      "key_observation": "Document not merely evidentiary but foundational to claim."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Government's decision under second proviso to cl. 5 of Surcharge Order, 1944 is final and binding; appellant liable to pay surcharge.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court entitled to correct lower courts' misconstruction of Ex. 68 as error of law in second appeal.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bombay Electricity Supply (Licensed Undertakings) War Costs Order, 1944",
      "sections": [
        "Clause 5, second proviso"
      ],
      "relevance": "Fixes war costs surcharge rates; Government's decision on applicability to contracts final and binding in event of dispute by any interested party."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order XLI Rule 27"
      ],
      "relevance": "Relates to admission of additional evidence in appeal; issue raised but not decided."
    },
    {
      "name": "Arbitration Act, 1940",
      "sections": [],
      "relevance": "Petitioner argued proviso requires arbitration reference; not permitted as not raised below."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals by special leave, upholding Bombay High Court's judgment setting aside lower courts' decrees and dismissing suits for refund of surcharge payments, as Government's decision under Surcharge Order was final and binding.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Government has fully considered your case under the second proviso to clause 5 of the Bombay Electricity Supply (Licensed Undertakings) War Costs Order, 1944, and has decided that you should pay the surcharge to the Bhusawal Electricity Co. Ltd., at the rate of 15% fixed...\"",
      "speaker": "court",
      "significance": "Government's binding decision on surcharge liability, central to upholding respondent's claim."
    },
    {
      "text": "\"In the event of dispute by any party interested, the decision of the Provincial Government shall be final.\"",
      "speaker": "court",
      "significance": "Key proviso language showing no need for bilateral referral; decision binding."
    },
    {
      "text": "\"Misconstruction of such a document would thus be an error of law and the High Court in second appeal would be entitled to correct it.\"",
      "speaker": "court",
      "significance": "Justifies High Court's interference despite not deciding additional evidence issue."
    }
  ],
  "_case_id": "1963_217",
  "_label": 0,
  "_text_length": 8431,
  "_extracted_at": "2026-02-10T19:50:18.265466"
}