{
  "metadata": {
    "case_name": "Appellants v. Seth Balkishan Nathani & Ors.",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Civil Appeals Nos. 370 and 371 of 1960",
    "date_of_judgment": "1963-01-30"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent 1, Seth Balkishan Nathani, was the proprietor and lambardar of Mouza Sonpairi in Tahsil and District Raipur.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On January 14, 1947, Respondent 1 executed perpetual pattas in favour of his wife Vashodabai (since deceased) and respondents 4, 5 and 6 in respect of khudkasht and grass lands of Mouza Sonpairi.",
      "type": "material",
      "date": "1947-01-14",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In Tabdili jamabandi of the year 1946-47 the said lands were recorded as the Occupancy Tenancy Holdings of the said respondents 4 to 6 and respondent 2, Govindlal Nathani, the legal representative of Vashodabai. The same entry was found in the jamabandis of the subsequent years.",
      "type": "admitted",
      "date": "1946-47",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Madhya Pradesh Abolition of Proprietary Rights, Estates, Mahals, Alienated Lands Act, 1950 (1 of 1951), hereinafter called the Act, came into force on January 22, 1951.",
      "type": "background",
      "date": "1951-01-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Thereafter, in due course the estate of the said proprietor was duly notified under s. 3 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On March 25, 1952, the Deputy Commissioner, Land Reforms, acting under S. 40 of the Act, recognized the said Balkishan Nathani as the pattadar and settled the assessment payable by him in respect of Khasra Nos. 289/12 and 366/7 of Mouza Sonpairi. No appeal was preferred against that order.",
      "type": "procedural",
      "date": "1952-03-25",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Thereafter, appellant 2, the Nistar Officer cum Additional Deputy Commissioner Raipur, started proceedings against the respondent for the correction of old annual papers in Mouza Sonpairi, with a view to reopen the earlier order made under s. 40 of the Act, as the earlier order was passed on the basis of the entries found in Tabdili jamabandi of the year 1946-47 and subsequent years.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent 1, Seth Balkishan Nathani, raised an objection that appellant 2 had no jurisdiction to initiate the proceedings. Appellant 2 overruled the objection.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant 2 made the following order: 'On the next hearing, 5 witnesses may be produced for proving cultivation. The names of the purchasers, to whom the lands have been sold, be obtained from the Patwari, and a notice be served on them that they should file their statements as well as should bring the sale-deeds along with them. Hearing fixed for date 4-8-1954. The applicants may file other evidence, which they wish to file.'",
      "type": "procedural",
      "date": "1954-08-04",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The second Appellant purported to make an inquiry in regard to the factum of cultivation as well as the validity of the sale-deeds whereunder respondent 1 created interests in the other respondents.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Respondent 1 preferred an appeal from that order to the Board of Revenue, Madhya Pradesh, but the same was dismissed on the ground that it was premature.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The respondents filed the writ petition No. 22 of 1955 in the High Court of Madhya Pradesh.",
      "type": "procedural",
      "date": "1955",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Civil Appeal No. 371 of 1960 relates to patti No. 1 of Mouza Kachna in Tahsil and District Raipur. Respondent 1 was the Proprietor and lambardar of the said Mouza.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "On February 19, 1948, the said Seth Balkishan Nathani executed perpetual pattas in respect of the said lands in favour of the same respondents as in the other appeal.",
      "type": "material",
      "date": "1948-02-19",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "In the annual papers the said lands were recorded as the Occupancy Tenancy Holdings of respondents 2 to 6.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "On December 8, 1954, appellant 2 made an inspection of the said lands and made the following order on December 9, 1954: 'There were found to be obvious mistakes in Government documents-Khasra, Jamabandi and Tabdilat. Mistakes discovered by me in Patwari papers have been corrected. Ex-proprietors 1 Balkishan Nathani and others and 2 Narayanrao made absolutely bogus transfers in favour of their family members... Patwari entered names without cultivation and agricultural possession against Land Record Manual, Volume 1. Mistakes found in patwari records have been corrected by me after spot inspection. These papers be filed.'",
      "type": "procedural",
      "date": "1954-12-09",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The second appellant found that the transfers made by respondent 1 in favour of the other respondents were bogus and that he also corrected the entries in the annual papers to the effect that the landlord was not cultivating the lands as recorded in the earlier papers.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "The respondents filed writ petition No. 274 of 1955 in the High Court to quash the said order.",
      "type": "procedural",
      "date": "1955",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "A Full Bench of the High Court held that neither s. 15(3) of the Act nor s. 47(1) of the Central Provinces Land Revenue Act, 1917, conferred a power on the Nistar officer to review orders already made in respect of the factum of cultivation or the occupancy rights recognized under the relevant provisions of the said Acts.",
      "type": "procedural",
      "date": "1956-03-08",
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "In the result, it allowed the two writ petitions quashing the proceedings started by the Nistar officer in the case of Mouza Sonpairi and the order dated December 9, 1954, passed by him in the case of Mouza Kachna and prohibiting him from taking further proceedings which may affect the occupancy tenancy rights of the petitioners in the lands in dispute.",
      "type": "procedural",
      "date": "1956-03-08",
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "Mr. Pai argued that the appeals have abated: (1) the second petitioner died after arguments heard by High Court and before judgment, petition to set aside abatement dismissed; (2) second respondent died on March 7, 1956, application on June 28, 1957 to set aside abatement out of time.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Under s. 47(1) of the Land Revenue Act the Nistar officer has jurisdiction to correct entries made for earlier years in a subsequent year on the ground of mistake.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "The said officer has also jurisdiction to review under s. 15(3) of the Act the order made by him under s. 40 thereof.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under s. 47(1) of the Land Revenue Act the Nistar officer has jurisdiction to correct entries made for earlier years in a subsequent year on the ground of mistake.",
      "supporting_facts": [
        "f7",
        "f9",
        "f16"
      ],
      "legal_basis": "Section 47(1) of the Central Provinces Land Revenue Act, 1917"
    },
    {
      "id": "pa2",
      "text": "The said officer has also jurisdiction to review under s. 15(3) of the Act the order made by him under s. 40 thereof.",
      "supporting_facts": [
        "f6",
        "f7",
        "f16"
      ],
      "legal_basis": "Section 15(3) of the Madhya Pradesh Abolition of Proprietary Rights Act, 1950"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The appeals have abated for two reasons: (1) the second petitioner died after the arguments were heard by the High Court and before the judgment was delivered and the petition filed by the appellants to set aside abatement was dismissed, and (2) the second respondent in the appeals died on March 7, 1956 and the application filed on June 28, 1957, to set aside the abatement and to bring his legal representatives on record was out of time.",
      "supporting_facts": [
        "f21"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Sustain the judgment of the High Court for the reasons mentioned therein.",
      "supporting_facts": [
        "f19",
        "f20"
      ],
      "legal_basis": "Sections 15(3) of the Act and 47(1) of the Land Revenue Act do not confer power to review"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The order made by the Deputy Commissioner under s.40 determining rent on basis that proprietor was occupancy tenant had become final as no provision in Act authorizes review, subject only to appeal under s.84.",
      "addresses_issue": "i2",
      "key_observation": "Nistar Officer had no jurisdiction to reopen final s.40 order"
    },
    {
      "id": "cr2",
      "text": "s.15(3) of the Act permits review of orders under s.13 by Compensation Officer etc., not orders under s.40 by Deputy Commissioner.",
      "addresses_issue": "i2",
      "key_observation": "s.13 and s.15(3) have no relevance to s.40 orders"
    },
    {
      "id": "cr3",
      "text": "Under ss.45,46,47 of Land Revenue Act, entries in record-of-rights can only be modified on specific grounds under s.46; s.47 for preparing annual papers recording subsequent changes, not correcting past mistakes in cultivation factum.",
      "addresses_issue": "i1",
      "key_observation": "Annual papers record existing facts and changes, not investigate correctness of prior entries"
    },
    {
      "id": "cr4",
      "text": "Follows Mangloo v. Board of Revenue: s.47(1) deals only with preparation of annual papers, not their correction if erroneous.",
      "addresses_issue": "i1",
      "key_observation": "No provision for correcting wrong entries in annual papers re past facts"
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Nistar Officer has no jurisdiction under s.15(3) of the Act to review s.40 order, as s.15(3) applies only to s.13 orders.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Nistar Officer has no jurisdiction under s.47(1) of Land Revenue Act to correct entries for earlier years regarding past cultivation to reopen s.40 matter.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mangloo v. Board of Revenue",
      "citation": "I.L.R. 1954 Nag. 143",
      "treatment": "followed",
      "relevance": "s.47(1) of Land Revenue Act deals only with preparation of annual papers, not correction of erroneous entries; no provision to correct wrong entries in annual papers"
    }
  ],
  "statutes_cited": [
    {
      "name": "Madhya Pradesh Abolition of Proprietary Rights, Estates, Mahals, Alienated Lands Act, 1950 (Act 1 of 1951)",
      "sections": [
        "Section 3",
        "Section 4(2)",
        "Section 13",
        "Section 15(1)",
        "Section 15(3)",
        "Section 40",
        "Section 84"
      ],
      "relevance": "Governs vesting of proprietary rights, occupancy tenancy for post-1948-49 cultivation by proprietor, finality of s.40 orders, no review for s.40"
    },
    {
      "name": "Central Provinces Land Revenue Act, 1917 (C.P. Act No. II of 1917)",
      "sections": [
        "Section 45",
        "Section 46",
        "Section 47(1)"
      ],
      "relevance": "Governs preparation and amendment of record-of-rights and annual papers; no power to correct past cultivation entries in annual papers"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals fail and are dismissed. The High Court order quashing the proceedings and order of Nistar Officer and prohibiting further proceedings affecting occupancy rights is upheld.",
    "relief_granted": "None to appellants; High Court writs allowed upheld",
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "It is, therefore, manifest that the order made by the Deputy Commissioner in respect of lands in question determining the rent on the basis that the proprietor was an occupancy tenant had become final.",
      "speaker": "court",
      "significance": "Emphasizes finality of s.40 order absent review provision"
    },
    {
      "text": "Neither s. 13 nor s. 15(3) has any relevance in the context of an order made by the Deputy Commissioner under s. 40 of the Act.",
      "speaker": "court",
      "significance": "Rejects review power under s.15(3) for s.40"
    },
    {
      "text": "Section 47(1) of the Central Provinces Land Revenue Act contemplates entering only such changes in the annual papers as take place during the course of the agricultural year. That section, therefore, does not cover a case of correction of the entries on the ground of mistake.",
      "speaker": "court",
      "significance": "Limits scope of s.47(1), affirming High Court view"
    }
  ],
  "_case_id": "1963_17",
  "_label": 0,
  "_text_length": 23910,
  "_extracted_at": "2026-02-10T19:47:49.482628"
}