{
  "metadata": {
    "case_name": "State of Maharashtra v. Respondent No. 1 (Defendant No. 7)",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal J."
    ],
    "case_number": "Civil Appeal No. 587 of 1962",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plaintiff-respondent No. 1 instituted Special Suit No. 5 of 1957 in the Court of the Civil Judge Senior Division at Ahmedabad to recover Rs.13,205 on account of the principal lent to defendant No. 7 and interest up to the date of the suit at the rate of 9% per annum.",
      "type": "material",
      "date": "1957",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On July 18, 1960, the suit was decreed in a sum of Rs. 13,033-6-6 with future interest from the date of suit till realization at 4% per annum on a sum of Rs. 10,120.",
      "type": "procedural",
      "date": "1960-07-18",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Defendant No. 7 appealed to the Bombay High Court against the decree. In the memorandum of appeal, valued the claim for purposes of jurisdiction and court-fee at Rs. 13,033-6-6.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Grounds of appeal: Ground No.1 - lower Court erred in decreeing the plaintiff's suit; Ground No.48 - decree is otherwise erroneous, unjust and illegal; remaining 46 grounds related to merits of plaintiff's claim, did not deal with correctness of trial Court awarding future pendente lite interest.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Taxing Officer held appeal was against the whole decree, subject-matter value Rs. 14,036.80nP. including interest from suit date till decree on Rs.10,120 (Rs.1,033.40nP.), directed deficit court-fee of Rs.70.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Defendant No.7 filed revision to Bombay High Court under s.52 of the Bombay Court-fees Act, 1959. Objection upheld by single Judge on April 12, 1961, who held subject-matter is real matter in dispute, right in dispute; set aside Taxing Officer's order.",
      "type": "procedural",
      "date": "1961-04-12",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "State of Maharashtra filed appeal by special leave to Supreme Court against High Court order.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the amount of interest decreed for the period subsequent to the institution of the suit comes within the expression 'amount or value of the subject-matter in dispute' in Art.1 of Schedule 1 of the Bombay Court-fees Act, 1959, for purposes of court-fee payable on the memorandum of appeal.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "View of High Court Judge is not correct; relies on construction by Courts on 'value or subject-matter in dispute' in provisions for High Courts giving leave to appeal to Privy Council, e.g., interest up to decree included (Gooroo Persad, Doorga Doss); costs not part of subject-matter.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Privy Council cases: Gooroo Persad Khoond v. Juggutchunder; Doorga Doss Chowdry v. Ramanauth Chowdry"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Subject-matter in appeal is the real matter in dispute between the parties and not something which must stand or fall with the decision on it; it must mean the right which is in dispute between the parties.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Act is taxing statute, provisions construed strictly in favour of subject-litigant; unlike liberal construction for Privy Council appeals. Defendant valued appeal at Rs.13,033-6-6, disputing principal and interest up to suit; did not dispute pendente lite interest, no grounds challenge it specifically.",
      "addresses_issue": "i1",
      "key_observation": "Value determined by substantial allegations/pleas on points in dispute; pendente lite interest awarded in discretion u/s.34 CPC, no right to it unless specifically challenged."
    },
    {
      "id": "cr2",
      "text": "Well-settled: no court-fee on interest pendente lite unless specifically challenged (Mitthu Lal v. Chameli); same for costs and future interest post-decree; principle: value of right claimed, not discretionary awards.",
      "addresses_issue": "i1",
      "key_observation": "If appellant succeeds on main claim, discretionary awards modified automatically; no need to appeal them unless expressly disputed."
    },
    {
      "id": "cr3",
      "text": "No good reason to distinguish costs from pendente lite interest; both discretionary, not asserted rights.",
      "addresses_issue": "i1",
      "key_observation": "Grounds of appeal relate only to principal and pre-suit interest."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Amount of pendente lite interest decreed is not to be included in the amount or value of the subject-matter in dispute in appeal for purposes of Art.1 Schedule 1 of the Act unless appellant specifically challenges correctness of decree for pendente lite interest independently of claim to set aside decree.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gooroo Persad Khoond v. Juggutchunder",
      "citation": "8 M.I.A. 166",
      "treatment": "referred",
      "relevance": "Interest decreed up to date of decree included in value for Privy Council appeal leave."
    },
    {
      "case_name": "Doorga Doss Chowdry v. Ramanauth Chowdry",
      "citation": "8 M.I.A. 262",
      "treatment": "referred",
      "relevance": "Costs of suit not part of subject-matter in dispute."
    },
    {
      "case_name": "Mitthu Lal v. Chameli",
      "citation": "57 All. 71",
      "treatment": "followed",
      "relevance": "No court-fee on pendente lite interest unless specifically challenged; same as costs."
    },
    {
      "case_name": "Keolapati, Mst. v. B.N. Varma",
      "citation": "I.L.R. 12 Luck. 466",
      "treatment": "followed",
      "relevance": "No court-fee on future interest from suit to appeal filing unless expressly challenged."
    },
    {
      "case_name": "Ashutosh v. Satindra Kumar",
      "citation": "54 C.W.N. 380",
      "treatment": "followed",
      "relevance": "Costs not part of subject-matter; appellant succeeds on costs if succeeds on main matter."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Court-fees Act, 1959",
      "sections": [
        "Art. 1 Schedule 1",
        "s. 52"
      ],
      "relevance": "Court-fee on memo of appeal ad valorem on amount/value of subject-matter in dispute; revision against Taxing Officer."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "s. 34",
        "s. 35"
      ],
      "relevance": "Court's discretion to award pendente lite interest and costs."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; High Court order upheld; memorandum of appeal sufficiently stamped as defendant did not specifically challenge pendente lite interest.",
    "relief_granted": "None to appellant; confirmation of High Court order in favour of respondent.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The Act is a taxing statute and its provisions therefore have to be construed strictly, in favour of the subject-litigant.",
      "speaker": "court",
      "significance": "Principle of strict construction for court-fees."
    },
    {
      "text": "Interest pendente lite is awarded under section 34 of the Civil Procedure Code. The Court may award it whether the plaintiff claims it or not.",
      "speaker": "court",
      "significance": "Explains discretionary nature, like costs."
    },
    {
      "text": "We therefore hold that the amount of pendente lite interest decreed is not to be included in the amount or value of the subject-matter in dispute in appeal for the purposes of art. 1 of Schedule 1 of the Act unless the appellant specifically challenges the correctness of the decree for the amount of interest pendente lite independently of the claim to set aside that decree.",
      "speaker": "court",
      "significance": "Core holding of the judgment."
    }
  ],
  "_case_id": "1963_90",
  "_label": 0,
  "_text_length": 14404,
  "_extracted_at": "2026-02-10T19:48:20.644957"
}