{
  "metadata": {
    "case_name": "Appellant Company v. Workmen",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 970 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Company carries on activity as engineers and contractors in different parts of West Bengal with a store yard at Sukchar employing 30 workmen, 11 permanent and remaining temporary.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Practice of appellant Company: fourteen days holidays in each year including 1st of January; if holiday fell on Sunday, following day made holiday.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "11 permanent workmen did not attend work on 2nd January 1961 treating it as holiday; Company case: expressly told due to pressure of work 2nd January working day, holiday in lieu later.",
      "type": "disputed",
      "date": "1961-01-02",
      "source": "petitioner | respondent"
    },
    {
      "id": "f4",
      "text": "Absent workmen given charge-sheet, placed under suspension before enquiry, dismissed after enquiry.",
      "type": "procedural",
      "date": "1961-01-02",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Union instance led to reference to Labour Officer for conciliation which failed as Company did not appear.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Government of West Bengal referred to Labour Tribunal on April 21, 1961: 'Whether the dismissal of the following 11 workmen is justified, what relief if any they are entitled to'.",
      "type": "procedural",
      "date": "1961-04-21",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Tribunal award dated May 4, 1962: no lock-out or lay-off; workmen went on strike which was not illegal; dismissal victimization, unjustified in severity for one day strike; set aside dismissal, reinstatement with back wages except for January 2, 1961.",
      "type": "material",
      "date": "1962-05-04",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Enquiry Officer recommended dismissal of only 8 workmen; 3 excused: Quigly (Christian, informed Works Manager, excused with warning and deprivation of wages for 2nd Jan); J.C. Bose (joined 31 Dec, not aware, warned, absence against leave); A.K. Sarkar (on leave till 31 Dec, informed by Quigly it was holiday, warned, absence as leave).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Three excused workmen ordered to join duty but did not as Union opined original dispute pending for conciliation.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the reference is bad because it refers to 11 workmen as dismissed when only 8 were so treated.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Tribunal was justified in interfering with the punishment of dismissal after concluding workmen went on strike even though strike not illegal.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Reference bad as only 8 workmen dismissed, not 11.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Tribunal cannot interfere with finding or quantum of punishment; management's prerogative to decide punishment for misconduct under Standing Orders; no victimization shown.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "Principles from cases like Bengal Bhatdee Coal Co., Buckingham Carnatic Co., etc."
    },
    {
      "id": "pa3",
      "text": "Workmen found guilty at enquiry and by Tribunal; punishment matter for employer.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Conduct of workmen regarded as collective strike, result of conspiracy; only permanent workers targeted, ulterior motive to break Union by using temporary hands.",
      "supporting_facts": [
        "f1",
        "f3",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Reference valid as all 11 charged together, common defence on holiday practice; three could not join due to Union; Government entitled to treat as single dispute.",
      "addresses_issue": "i1",
      "key_observation": "Technically correct but no interference on this ground alone."
    },
    {
      "id": "cr2",
      "text": "Tribunal powers limited: interfere only for lack of bona fides, victimization, unfair practice, basic error, natural justice violation, or shockingly disproportionate punishment no reasonable employer would impose.",
      "addresses_issue": "i2",
      "key_observation": "Principles from cited cases."
    },
    {
      "id": "cr3",
      "text": "Punishment shockingly disproportionate: established practice of next day holiday; nothing special on 2nd Jan; absence could be leave without pay, warning, fine; no reasonable employer would dismiss entire permanent staff.",
      "addresses_issue": "i2",
      "key_observation": "Interference justified in extraordinary circumstances."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No interference with award on ground of reference to 11 workmen.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Tribunal justified in interfering as punishment shockingly disproportionate, no reasonable employer would impose.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bengal Bhatdee Coal Co. Ltd. v. Ram Probesh Singh Ors.",
      "citation": "1964 1 S.C.R. 709",
      "treatment": "followed",
      "relevance": "Principles for Tribunal interference in punishment."
    },
    {
      "case_name": "Buckingham Carnatic Co. Ltd. v. Workers",
      "citation": "1952 L.A.C. 490",
      "treatment": "followed",
      "relevance": "Tribunal powers in domestic enquiries."
    },
    {
      "case_name": "Titaghur Paper Mills Co. Ltd. v. Ram Naresh Kumar",
      "citation": "1961 1 L.L.J. 511",
      "treatment": "followed",
      "relevance": "Guidance on victimization and punishment."
    },
    {
      "case_name": "Doom Dooma Tea Co. Ltd. v. Assam Chah Karamchari Sangh",
      "citation": "1960 2 L.L.J. 56",
      "treatment": "followed",
      "relevance": "Interference where punishment disproportionate."
    },
    {
      "case_name": "Punjab National Bank Ltd. v. Workmen",
      "citation": "1959 II L.L.J. 666",
      "treatment": "followed",
      "relevance": "Management's right on punishment."
    },
    {
      "case_name": "Chartered Bank Bombay v. Chartered Bank Employees Union",
      "citation": "1960 II L.L.J. 222",
      "treatment": "followed",
      "relevance": "Limits on Tribunal substituting its view."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Disputes Act",
      "sections": [],
      "relevance": "Reference to Tribunal, award powers implied."
    },
    {
      "name": "Standing Orders",
      "sections": [],
      "relevance": "Punishment for misconduct under Standing Orders matter for management."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; Tribunal's award upheld setting aside dismissal of 11 workmen and ordering reinstatement with back wages except for January 2, 1961, as punishment was shockingly disproportionate.",
    "relief_granted": "Reinstatement with back wages upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the punishment imposed was one which no reasonable employer would have imposed in like circumstances unless it served some other purpose.\"",
      "speaker": "court",
      "significance": "Core holding on disproportionate punishment justifying interference."
    },
    {
      "text": "\"Tribunal should not interfere with the kind or severity of punishment except in very extraordinary circumstances.\"",
      "speaker": "court",
      "significance": "Limits on Tribunal powers emphasized."
    }
  ],
  "_case_id": "1964_291",
  "_label": 0,
  "_text_length": 10295,
  "_extracted_at": "2026-02-10T19:46:15.686458"
}