{
  "metadata": {
    "case_name": "Commissioner of Income Tax, Madras v. Mir Mohd. Ali",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri J.",
      "Subba Rao J.",
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 145 of 1963",
    "date_of_judgment": "1964-04-24"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, Mir Mohd. Ali, hereinafter referred to as the assessee, is a bus owner and transport operator at Vellore, North Arcot District.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "During the year of account ending with March 31, 1950 relevant to assessment year 1950-51 he replaced the petrol engines in two of his buses MDJ 583 and MDJ 723 by new Diesel engines, incurring an expenditure of Rs. 18,544/- in this connection.",
      "type": "material",
      "date": "1950-03-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Before the Income Tax Officer, apart from claiming normal depreciation under the first Paragraph of cl. (vi) of s. 10(2), he also claimed depreciation under the second paragraph of cl. (vi) and cl. (via) of the Indian Income Tax Act, 1922.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Income Tax Officer only allowed 25 per cent depreciation under the first paragraph of cl. (vi).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The assessee appealed unsuccessfully to the Appellate Assistant Commissioner on this point.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On further appeal, the Appellate Tribunal held that the assessee is not entitled to extra depreciation under s. 10(2)(vi) or s. 10(2)(via) because however important the engine might be for running of a motor, it is after all part of an equipment and it cannot by itself become machinery for the purpose of claiming extra depreciation, as envisaged in these sub-sections.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The Income Tax Appellate Tribunal, on the application of the assessee, referred the following question to the High Court: Whether extra depreciation is admissible under the provisions of section 10(2)(via) of the Income Tax Act, in respect of a diesel oil engine fitted to a motor vehicle in replacement of the existing engine.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "As the High Court felt that there had been an accidental slip in framing the question, it amended the question as: Whether extra depreciation is admissible under the provisions of s. 10(2)(vi) and section 10(2)(via) of the Income Tax Act in respect of the diesel oil engines fitted to the motor vehicles in replacement of the existing engines.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The High Court answered this question in the affirmative i.e., in favour of the assessee.",
      "type": "procedural",
      "date": "1959-11-16",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The Commissioner of Income Tax, on obtaining a certificate under s. 66A(2) of the Income Tax Act, has filed this appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The point at issue before us has been considered by three High Courts. The Bombay and Andhra Pradesh High Courts have held against the assessee while in the judgment under appeal, the Madras High Court has held in favour of the assessee.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether extra depreciation is admissible under the provisions of s. 10(2)(vi) and section 10(2)(via) of the Income Tax Act in respect of the diesel oil engines fitted to the motor vehicles in replacement of the existing engines.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The engine is part of an equipment and it cannot by itself become machinery for the purpose of claiming extra depreciation under s. 10(2)(vi) or s. 10(2)(via). The installation of the new engines is only a capital addition.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "s. 10(2)(vi), s. 10(2)(via)"
    },
    {
      "id": "pa2",
      "text": "The scheme of para two of cl. (vi) and cl. (via) requires that machinery must be a self-contained unit capable of being put to use in the business. Plant, including a vehicle should be viewed as a unit and component parts thereof are excluded.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s. 10(2)(vi) para 2, s. 10(2)(via), s. 10(5)"
    },
    {
      "id": "pa3",
      "text": "The word 'installed' is wholly inappropriate to cover the fixing of a diesel engine in a motor vehicle. Replacement of a petrol engine by a diesel engine in a motor transport vehicle is not installation of plant or machinery.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s. 10(2)(vi) para 2"
    },
    {
      "id": "pa4",
      "text": "Buildings, machinery or plant for which the initial allowance is admissible must be a self-contained unit capable of being put to use in the business. Mere replacement, addition, or repair to existing units do not qualify.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s. 10(2)(vi) para 2"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Machinery must be given the same meaning with reference to each of the statutory provisions, in s. 10(2)(vi) and s. 10(2)(via). A diesel engine is machinery by the test laid down in Corporation of Calcutta case.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s. 10(2)(vi), s. 10(2)(via)"
    },
    {
      "id": "ra2",
      "text": "Machinery does not cease to be machinery merely because it has to be used in conjunction with one or more machines. Nor does it cease to be machinery merely because it is installed as part of a manufacturing or industrial plant.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "The statutory provision for depreciation is in the alternative. Whether it is plant or whether it is machinery without its being itself a plant, the assessee is entitled to claim the statutory allowance for depreciation.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s. 10(2)(vi), s. 10(2)(via)"
    },
    {
      "id": "ra4",
      "text": "The Legislature has not put any restriction and therefore any new machinery or plant or a part thereof installed qualifies for the benefit of the initial allowance.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s. 10(2)(vi) para 2"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The history of para two of cl. (vi) introduced by Income Tax Amendment Act, 1946 to encourage modernisation and rehabilitation of industry post-war. Word 'machinery' occurs consistently in clauses and must have same meaning.",
      "addresses_issue": "i1",
      "key_observation": "No difference in scheme of para two that restricts meaning of machinery; it must be new and installed, but that does not define what is machinery."
    },
    {
      "id": "cr2",
      "text": "Definition of plant in s.10(5) does not throw light on meaning of machinery. Test from Privy Council in Corporation of Calcutta: machinery is mechanical contrivances which generate power etc. A diesel engine fits this.",
      "addresses_issue": "i1",
      "key_observation": "Diesel engines were machinery when purchased, not yet part of plant; all conditions satisfied."
    },
    {
      "id": "cr3",
      "text": "'Installed' means fixed in position, inducted, introduced, or placed in position for service or use; fixing engine in vehicle qualifies.",
      "addresses_issue": "i1",
      "key_observation": "High Court correct in answering affirmatively."
    },
    {
      "id": "cr4",
      "text": "Dissenting: Machinery or plant must be self-contained unit used for business purposes. Replacement of engine is not installation of new machinery; part of existing unit. Initial allowance for new industries/extensions, not replacements.",
      "addresses_issue": "i1",
      "key_observation": "Diesel engine in transport business not self-contained; normal depreciation covers."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Extra depreciation is admissible under s. 10(2)(vi) and s. 10(2)(via) in respect of diesel oil engines fitted to motor vehicles in replacement of existing engines. A diesel engine is machinery and its installation qualifies.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Corporation of Calcutta v. Chairman, Cossipore and Chitpore Municipality",
      "citation": "1922 I.L.R. 49 Cal. 190",
      "treatment": "followed",
      "relevance": "Definition of machinery: mechanical contrivances which by themselves or in combination generate power etc."
    },
    {
      "case_name": "Srikantiah v. Commissioner of Income-Tax Andhra Pradesh",
      "citation": "1961 41 I.T.R. 518",
      "treatment": "referred",
      "relevance": "Andhra Pradesh High Court held against assessee, followed Bombay, dissented from Madras."
    },
    {
      "case_name": "Mr. Mohd. Ali v. Commissioner of Income-Tax, Madras",
      "citation": "1960 38 I.T.R. 413",
      "treatment": "followed",
      "relevance": "Judgment under appeal by Madras High Court in favor of assessee."
    },
    {
      "case_name": "Commissioner of Income-Tax v. Saraspur Mills Ltd.",
      "citation": "1959 36 I.T.R. 580",
      "treatment": "referred",
      "relevance": "'Installed' means fixed in position or inducted/introduced."
    },
    {
      "case_name": "Commissioner of Income Tax, Madras v. Sri Ram Vilas Services Pvt Ltd.",
      "citation": "1960 38 I.T.R. 25",
      "treatment": "referred",
      "relevance": "'Installed' means to place an apparatus in position for service or use."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act, 1922",
      "sections": [
        "s. 10(2)(vi)",
        "s. 10(2)(via)",
        "s. 66A(2)",
        "s. 10(5)"
      ],
      "relevance": "Provisions for depreciation allowances on buildings, machinery, plant; extra/initial depreciation for new installations after specified dates; definition of plant includes vehicles."
    },
    {
      "name": "Income Tax Amendment Act, 1946",
      "sections": [],
      "relevance": "Inserted provisions for extra depreciation to encourage modernisation post-war."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by the Commissioner of Income Tax is dismissed with costs. The High Court was correct in holding that extra depreciation is admissible under s. 10(2)(vi) and s. 10(2)(via) for the diesel engines installed in replacement of petrol engines.",
    "relief_granted": "Extra depreciation allowed to assessee",
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "\"The word machinery, when used in ordinary language prima facie, means some mechanical contrivances which, by themselves or in combination with one or more other mechanical contrivances, by the combined movement and inter-dependent operation of their respective parts generate power, or evoke, modify, apply or direct natural forces...\"",
      "speaker": "court",
      "significance": "Adopted Privy Council test to hold diesel engine is machinery."
    },
    {
      "text": "\"We have to hold that the installation of the new engines is only a capital addition... the assessee was rightly refused the extra depreciation he claims.\"",
      "speaker": "lower_court",
      "significance": "Tribunal's view rejected by Supreme Court."
    },
    {
      "text": "\"Accordingly, we hold that the High Court was correct in answering the question referred to it in the affirmative. The appeal, therefore fails and is dismissed with costs.\"",
      "speaker": "court",
      "significance": "Majority holding affirming assessee's claim."
    }
  ],
  "_case_id": "1964_112",
  "_label": 0,
  "_text_length": 26514,
  "_extracted_at": "2026-02-10T19:44:13.573625"
}