{
  "metadata": {
    "case_name": "Appellant (Bullion Merchant) v. Bombay Bullion Association Ltd. and Directors",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Ayyangar, J."
    ],
    "case_number": "Civil Appeal No. 56 of 1962",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a member of the first respondent, Bombay Bullion Association Ltd., and carries on business as a bullion merchant.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By notification dated March 14, 1949, Government of Bombay sanctioned bye-laws framed by the Association under s. 6 of Bombay Forward Contracts Control Act, 1947 (Bombay Act LXIV of 1947), permitting forward dealings in bullion subject to bye-laws.",
      "type": "background",
      "date": "1949-03-14",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Settlement for Maha Vaida originally fixed for February 2, 1953, postponed to February 3, 1953 by Board under bye-law 32(3) due to circumstances (strike of clerks).",
      "type": "procedural",
      "date": "1953-02-02",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant defaulted in performing obligation as forward seller to tender bullion on settlement day February 3, 1953; failed to submit delivery orders for 853 bars of silver under bye-laws 137 and 137-A.",
      "type": "material",
      "date": "1953-02-03",
      "source": "admitted"
    },
    {
      "id": "f5",
      "text": "Association purchased silver at risk of appellant (defaulter seller), claimed difference of Rs. 1,37,880-12-0; appellant paid on February 5, 1953 under protest.",
      "type": "material",
      "date": "1953-02-05",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant filed suit on February 6, 1953 against Association and Directors for refund, alleging purchase invalid as contrary to bye-laws because purchasers defaulted.",
      "type": "procedural",
      "date": "1953-02-06",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Heavy settlement on February 3, 1953: total outstanding sale/purchase of 1897 bars silver; sellers of 1004 bars gave delivery orders.",
      "type": "material",
      "date": "1953-02-03",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Purchasers required to submit Clearance Sheets and pay Rs. 88,31,050 into Clearing House (Bank of Baroda, Bullion Hall Sub-branch) by February 3, 1953 under bye-law 137-B.",
      "type": "material",
      "date": "1953-02-03",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Directors extended time for payment and Clearance Sheets to 7 p.m. on February 3, 1953 due to heavy volume and clerk strike.",
      "type": "procedural",
      "date": "1953-02-03",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Payments by purchasers: some cash; Rs. 42,99,400 by cheques on Bullion Hall Sub-branch; Rs. 24,64,050 by four pay slips of other banks; Rs. 15,30,150 by transfers from Jhaveri Bazar branch; Rs. 4,65,000 by cheque on Fort Branch of Bank of Baroda.",
      "type": "material",
      "date": "1953-02-03",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Bank of Baroda confirmed receipt of all Rs. 88,31,050 on February 3, 1953, credited to Association; concurrent finding of both lower courts that purchasers' cheques paid into Clearing House on February 3, 1953.",
      "type": "admitted",
      "date": "1953-02-03",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Trial before Coyajee J., Bombay High Court: found no default by purchasers, dismissed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appeal to Division Bench, Bombay High Court (Appeal No. 27 of 1957), judgment dated March 3-4, 1958: affirmed dismissal.",
      "type": "procedural",
      "date": "1958-03-03",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appellant's plea of mala fides by Directors (personal interest as purchasers) negatived by trial judge, not pressed further.",
      "type": "disputed",
      "date": "1953-02-03",
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Bank of Baroda appointed Clearing House under bye-law 120 since 1949; special Bullion Hall Sub-branch; all members opened accounts per bye-law 174(3); special triple-foil pay-in-slips used.",
      "type": "background",
      "date": "1949",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Some purchasers funded accounts with margin money refunds on February 3, 1953; appellant alleged premature under bye-law 33-C(2).",
      "type": "disputed",
      "date": "1953-02-03",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Proper construction of bye-law 137-B of Bombay Bullion Association: whether purchasers fulfilled obligations by submitting payments in permitted forms (cheque certified good for payment, demand draft, bank pay-in-slip, or cash) on Vaida day February 3, 1953, enabling Association to purchase at risk of defaulting seller (appellant).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Purchase at appellant's risk invalid as purchasers failed to fulfill obligations under bye-law 137-B; no payment in permitted modes (only cash valid; cheques/pay slips not certified good, post-banking hours, insufficient funds initially, premature margin refunds, inter-branch issues).",
      "supporting_facts": [
        "f4",
        "f6",
        "f10",
        "f14",
        "f16"
      ],
      "legal_basis": "Bye-law 137-B; strict literal construction required due to consequences."
    },
    {
      "id": "pa2",
      "text": "Cheques on same branch not 'certified good for payment'; certification is specific commercial procedure between banks.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Bye-law 137-B; Gaden v. Newfoundland Savings Bank; Bank of Baroda v. Punjab National Bank."
    },
    {
      "id": "pa3",
      "text": "Payments after 2:30 p.m. banking hours invalid; margin refunds premature under bye-law 33-C(2).",
      "supporting_facts": [
        "f9",
        "f10",
        "f16"
      ],
      "legal_basis": "Bye-laws 137-B, 33-C(2)."
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Purchasers fulfilled bye-law 137-B; all payments received and credited on February 3, 1953; cheques backed by sufficient funds, verified by bank; extension to 7 p.m. valid.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "Bye-law 137-B (substantial compliance); bank verification equivalent to certification."
    },
    {
      "id": "ra2",
      "text": "Margin refunds proper as conditions ceased; no impact on payment validity.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "Bye-law 33-C(2)."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Concurrent finding of fact: purchasers' cheques paid into Clearing House on February 3, 1953; no need to re-examine evidence.",
      "addresses_issue": "i1",
      "key_observation": "Finding not challenged."
    },
    {
      "id": "cr2",
      "text": "Bye-law 137-B requires payment in specified forms along with Clearance Sheet; payments (cheques on same branch, inter-branch, pay slips) substantially complied after bank verification of funds.",
      "addresses_issue": "i1",
      "key_observation": "Cheque on same branch to Clearing House account is virtually cash payment; no need for formal certification."
    },
    {
      "id": "cr3",
      "text": "Extension of banking hours to 7 p.m. not illegal, benefited customers; bank continued as Clearing House.",
      "addresses_issue": "i1",
      "key_observation": "No detriment to constituents."
    },
    {
      "id": "cr4",
      "text": "Margin refunds: conditions ceased even on original Vaida; early refund immaterial as accounts in credit when cheques presented.",
      "addresses_issue": "i1",
      "key_observation": "Bye-law 33-C does not preclude early refund."
    },
    {
      "id": "cr5",
      "text": "Specific cases (Khimji Poonja, Bansilal Sons, Jethalal Shah): funds verified; inter-bank credits accepted by bank; only one minor irregularity immaterial (25 bars).",
      "addresses_issue": "i1",
      "key_observation": "Payments backed by sufficient funds satisfy bye-law."
    },
    {
      "id": "cr6",
      "text": "No mala fides; plea negatived.",
      "addresses_issue": "i1",
      "key_observation": "No evidence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Payments by purchasers substantially, if not literally, in accordance with bye-law 137-B; Association entitled to purchase at risk of defaulting appellant seller.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gaden v. The Newfoundland Savings Bank",
      "citation": "1899 A.C. 281",
      "treatment": "referred",
      "relevance": "Effect of cheque certification: adds bank's credit, shows sufficient funds."
    },
    {
      "case_name": "Bank of Baroda v. Punjab National Bank",
      "citation": "71 I.A. 124",
      "treatment": "referred",
      "relevance": "History of certification/marking of cheques in India."
    },
    {
      "case_name": "Arsene Larocque v. Hyacin the Beauchmin",
      "citation": "1897 A.C. 358",
      "treatment": "followed",
      "relevance": "Payment by cheque transfer within same bank equivalent to cash."
    },
    {
      "case_name": "Spargos case",
      "citation": "L.R. 8 Ch. 407",
      "treatment": "followed",
      "relevance": "Exchange of cheques or internal transfer is payment in cash; no need for physical handover."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Forward Contracts Control Act, 1947",
      "sections": [
        "Section 6"
      ],
      "relevance": "Empowered sanction of Association's bye-laws for forward dealings."
    },
    {
      "name": "Bye-laws of Bombay Bullion Association Ltd.",
      "sections": [
        "Bye-law 32",
        "Bye-law 120",
        "Bye-law 125",
        "Bye-law 127",
        "Bye-law 134(1)",
        "Bye-law 137",
        "Bye-law 137-A(1)",
        "Bye-law 137-B",
        "Bye-law 147",
        "Bye-law 174(3)",
        "Bye-law 33-C(2)"
      ],
      "relevance": "Governed forward settlements, Clearing House operations, obligations of sellers/purchasers, defaults, margin refunds; central to compliance determination."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court decisions; found purchasers complied with bye-law 137-B; purchase at appellant's risk valid; suit for refund properly dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"where a payment was made by a cheque drawn on an account with the Bullion Exchange Sub-branch and the amount represented by that cheque was transferred to the Clearing House Account of the Association it is virtually a payment in cash, though in form a payment by cheque.\"",
      "speaker": "court",
      "significance": "Core holding on substantial compliance with bye-law 137-B."
    },
    {
      "text": "\"The only effect of the certifying is to give the cheque additional currency by showing on the face that it is drawn in good faith on funds sufficient to meet its payment\"",
      "speaker": "court",
      "significance": "Explains certification, distinguishes from internal bank transfers."
    }
  ],
  "_case_id": "1964_151",
  "_label": 0,
  "_text_length": 38239,
  "_extracted_at": "2026-02-10T19:44:48.277430"
}