{
  "metadata": {
    "case_name": "Sunil Kumar Paul v. State",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Criminal Appeal No. 156 of 1961",
    "date_of_judgment": "1964-03-06"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was a clerk in the office of the Sub-Divisional Health Officer at Barrackpore in 1955-56. He used to prepare bills of the establishment, present them at the Sub-treasury and later at the State Bank at Barrackpore, receive payment in cash and make over that amount to the Sub-Divisional Health Officer.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Certain bills were drawn under the heading 38-Medical. Certain bills were to be drawn under the heading 39-Public Health. Some other bills were drawn under other headings.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On October 5, 1956, the appellant presented a bill for Rs. 1,769 out of which a sum of Rs. 5-10-0 was to be credited in the Postal Life Insurance Ledger and the balance of Rs. 1,763-6-0 was to be received in cash. This bill was duly passed by the Sub-Treasury and was subsequently presented to the Bank on October 6, 1956 for payment of Rs. 1,763-6-0. The Bank paid this amount to the appellant.",
      "type": "material",
      "date": "1956-10-05",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The amount was not paid to the Sub-Divisional Health Officer. In fact, the records of the Office of the Sub-Divisional Health Officer did not refer to any such bill being prepared and submitted to the Sub-Treasury and the Bank for payment.",
      "type": "material",
      "date": "1956-10-06",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "A bill for practically the same items which were mentioned in the bill cashed on October 6 was however presented on October 1, 1956. It was for an amount of Rs. 1,767 out of which Rs. 5-10-0 were to be credited to the PLI account ledger and the balance of Rs. 1,761-6-0 were to be paid in cash. The amount of this bill was received on October 1 and was duly handed over to the Sub-Divisional Health Officer. This bill cashed on October 1, 1956 was at first prepared for Rs. 1,769 and the amount to be received in cash was to be Rs. 1,763-6-0 but prior to this encashment, a correction was made at some stage, and the bill was reduced by Rs. 2 in the total amount and consequently in the amount to be paid in cash.",
      "type": "material",
      "date": "1956-10-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The fact of the presentation of a bill for its encashment of Rs. 1,763-6-0 on October 6, 1956 came to the notice of the Sub-Divisional Health Officer at the instance of the Accountant General and on enquiry it was found that no such bill had been actually presented by his office for encashment and that no such amount was received by him.",
      "type": "material",
      "date": "1956-10-06",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "This led to a complaint and further enquiries and investigation which ended in the prosecution of the appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The case was made over to the Special Judge by the Government in view of the provisions of the West Bengal Criminal Law Amendment (Special Courts) Act, 1949 (W.B. Act XXI of 1949), as it involved an offence punishable under s. 409 I.P.C.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Special Judge tried the appellant for that offence and convicted him and sentenced him to rigorous imprisonment for two years and to pay a fine of Rs. 2,000.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The appellant went in appeal to the High Court of Calcutta. The High Court agreed with the appellant's contention that no offence under s. 409 I.P.C. had been made out, but held that he was proved to have committed an offence under s. 420 I.P.C. It accordingly altered his conviction from an offence under s. 409 I.P.C. to one under s. 420 I.P.C., for cheating the employees of the State Bank, Barrackpore, by representing that the bill for Rs. 1,769 gross and Rs. 1,763-6-0 cash drawn on October 6, 1956, was a genuine bill drawn by the Sub-Divisional Health Officer, and thereby dishonestly inducing the Bank's staff to make over the sum of Rs. 1,763-6-0 to him and sentenced him to rigorous imprisonment for one year and to fine of Rs. 2,000.",
      "type": "procedural",
      "date": "1961-06-15",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellant obtained certificate from Calcutta High Court under Art. 134(1)(c) of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The charge-sheet narrates that on the 6th October 1956 Sunil Kumar Paul, a Public servant in the employment of the office of the Sub-Divisional Health Officer, Barrackpore i.e., clerk dishonestly drew Rs. 1,763-6-0 excluding Postal Life Insurance deduction of Rs. 5-10-0 from the State Bank of India, Barrackpore Branch by submitting a false duplicate Estt. Pay Bill for the office of the said S.D.H.O., Barrackpore. The money drawn was not credited to the office of the Sub-Divisional Health Officer, Barrackpore.",
      "type": "material",
      "date": "1956-10-06",
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a case involving an offence under s. 420 IPC can be allotted for trial to a Special Court by the State Government when such an offence is not committed by a public servant while purporting to act as such public servant.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the Special Court could take recourse to the provisions of s. 237 Cr. P.C., and if it could, whether the requirements of s. 237 Cr. P.C. were satisfied in the present case, and consequently whether the High Court could have altered the conviction of the appellant from an offence under s. 409 I.P.C. to one under s. 420 IPC.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the ingredients of an offence under s. 420 I.P.C. were alleged or proved by the prosecution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the accused has been prejudiced on account of the absence of the necessary allegations and the omission to frame a charge for an offence under s.420 I.P.C. and therefore whether the provisions of s. 537 Cr. P.C. would cure this defect in trial.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether the sentence is severe.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "A case involving an offence under s. 420 P.C. cannot be allotted for trial to a Special Court by the State Government when such an offence is not committed by a public servant while purporting to act as such public servant.",
      "supporting_facts": [
        "f3",
        "f4",
        "f12"
      ],
      "legal_basis": "West Bengal Criminal Law Amendment (Special Courts) Act, 1949, Schedule"
    },
    {
      "id": "pa2",
      "text": "The Special Court could not take recourse to the provisions of s. 237 Cr. C., and if it could, the requirements of s. 237 Cr. P.C. were not satisfied in the present case, and consequently the High Court could not have altered the conviction of the appellant from an offence under s. 409 I.P.C. to one under s. 420.",
      "supporting_facts": [
        "f8",
        "f9",
        "f10"
      ],
      "legal_basis": "s. 237 CrPC; Bhajahar Mondal v. State of West Bengal"
    },
    {
      "id": "pa3",
      "text": "The ingredients of an offence under s. 420 I.P.C. were neither alleged nor proved by the prosecution.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "s. 420 IPC"
    },
    {
      "id": "pa4",
      "text": "The accused has been prejudiced on account of the absence of the necessary allegations and the omission to frame a charge for an offence under s.420 I.P.C. and therefore the provisions of s. 537 Cr. P. C. would not cure this defect in trial.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "s. 537 CrPC"
    },
    {
      "id": "pa5",
      "text": "The sentence is severe.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 409 I.P.C. is mentioned in the Schedule referred to in sub-s. (2) of s. 4 of the Act. The State Government was therefore competent to allot the case involving that offence to the Special Court. An offence under s. 420 P.C. when committed in certain circumstances is also mentioned in the Schedule. It has to be tried by Special Courts only when it is committed by a public servant while purporting to act as such.",
      "addresses_issue": "i1",
      "key_observation": "The appellant did present the false bill purporting to present it in the discharge of his duties as a clerk of the Office of the Sub-Divisional Health Officer who was duly authorised to present bills and cash them."
    },
    {
      "id": "cr2",
      "text": "Bhajahar Mondal case distinguished because there the allotment related to a non-existing offence, unlike here where s.409 existed and was in Schedule.",
      "addresses_issue": "i1",
      "key_observation": "On the facts proved, it is not to be doubted that the appellant presented the bill for Rs. 1,763-6-0 at the State Bank on October 6, purporting to act as the clerk of the Sub-Divisional Health Officer."
    },
    {
      "id": "cr3",
      "text": "Apart from the consideration that the offence of cheating fell within the offences mentioned in the Schedule, the appellant could be tried by the Special Court for this offence in view of the proviso to s. 4. The proviso authorizes the Special Court, when trying a case involving an offence specified in the Schedule to try any offence other than that offence with which the accused may be charged at the same trial in accordance with the provisions of the Code of Criminal Procedure.",
      "addresses_issue": "i1",
      "key_observation": "The accused could be charged with an offence under s. 420 I.P.C. if he could be tried for this offence at the trial for an offence under s. 409 I.P.C. He could be so tried in view of ss. 236 and 237 Cr. P. C."
    },
    {
      "id": "cr4",
      "text": "The power of the Court to frame various charges contemplated by s. 236 Cr. P. C. therefore arises when it cannot be said with any definiteness, either by the prosecutor or by the Court, that such and such facts would be proved. The facts alleged prior to framing charge in charge-sheet sufficient for s.420.",
      "addresses_issue": "i2",
      "key_observation": "When a charge under s. 420 I.P.C. could have been framed by the trial Court by virtue of s. 236 Cr. P.C. that Court or the appellate Court can, in law, convict the appellant of this offence instead of an offence under s. 409 I.P.C. if it be of the view that the offence of cheating had been established. This would be in accordance with the provisions of s. 237 Cr. P. C."
    },
    {
      "id": "cr5",
      "text": "Nanak Chand case does not help as there was no doubt about facts constituting murder only.",
      "addresses_issue": "i2",
      "key_observation": "At the trial of the appellant for an offence under s. 409 I.P.C., the appellant could have also been charged for an offence under s. 420 I.P.C. in view of s. 236 of the Code of Criminal Procedure."
    },
    {
      "id": "cr6",
      "text": "Under proviso to s.4, Special Court can try other offence if accused could be charged with it under CrPC. No requirement that charge must be framed. s.5(2) applies CrPC provisions not inconsistent.",
      "addresses_issue": "i2",
      "key_observation": "It was however open to it and to the appellate Court to convict him of the offence under s. 420 P.C. when trying for an offence under s. 409 I.P.C. in view of s. 237 of the Code."
    },
    {
      "id": "cr7",
      "text": "Proviso does not limit to offences related to s.409; only to what CrPC allows.",
      "addresses_issue": "i2",
      "key_observation": "The Court has to see whether the accused could be charged with any offence, other than the one referred to in the allotment order, in view of the provisions of the Code."
    },
    {
      "id": "cr8",
      "text": "The statement in the charge-sheet that the appellant presented a false bill to the State Bank and cashed it is sufficient for s.420. Presentation carries representation it is genuine. If genuine, would be s.409. No prejudice.",
      "addresses_issue": "i3",
      "key_observation": "The framing of the charge under s. 420 I.P.C. was not essential and s. 237 Cr. P. C. itself justifies his conviction of the offence under s. 420 if that be proved on the findings on the record."
    },
    {
      "id": "cr9",
      "text": "Sentence of 1 year's rigorous imprisonment and fine of Rs. 2,000 not severe.",
      "addresses_issue": "i5",
      "key_observation": "We do not consider a sentence of 1 years rigorous imprisonment and a fine of Rs. 2,000 severe."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Special Court competent to try offence under s.420 IPC as appellant committed it while purporting to act as public servant, and per proviso to s.4 and ss.236/237 CrPC.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Requirements of s.237 CrPC satisfied; High Court could alter conviction to s.420.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Ingredients of s.420 proved on facts alleged and found.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "No prejudice; s.537 not needed as s.237 applies directly.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "Sentence not severe.",
      "resolves_issue": "i5",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bhajahar Mondal v. The State of West Bengal",
      "citation": "1959 S.C.R. 1276",
      "treatment": "distinguished",
      "relevance": "Facts different; allotment there for non-existing offence unlike s.409 here."
    },
    {
      "case_name": "Begu v. The King Emperor",
      "citation": "52 I.A. 191",
      "treatment": "followed",
      "relevance": "ss.236 and 237 allow conviction for offence not charged if evidence establishes charge that might have been made."
    },
    {
      "case_name": "Ramaswamy Nadar v. The State of Madras",
      "citation": "1958 S.C.R. 739",
      "treatment": "followed",
      "relevance": "Approved Begu; High Court could convict under different offence."
    },
    {
      "case_name": "State of Andhra Pradesh v. Kandimalla Subbaiah",
      "citation": "1962 1 S.C.R. 194, 203",
      "treatment": "followed",
      "relevance": "Special Judge could try other offences if chargeable at same trial under CrPC."
    },
    {
      "case_name": "Nanak Chand v. The State of Punjab",
      "citation": "1955 1 S.C.R. 1201",
      "treatment": "distinguished",
      "relevance": "s.236 applies where doubt on offence from facts; no doubt there on murder."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "409",
        "420",
        "417"
      ],
      "relevance": "Offences charged; s.409 criminal breach of trust by public servant, s.420 cheating; both in Schedule if by public servant purporting to act as such."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "236",
        "237",
        "537"
      ],
      "relevance": "s.236/237 allow charging/convicting alternative offences where doubt on which proved; s.537 cures irregularities."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "134(1)(c)"
      ],
      "relevance": "Certificate for appeal to Supreme Court."
    },
    {
      "name": "West Bengal Criminal Law Amendment (Special Courts) Act, 1949",
      "sections": [
        "4",
        "5",
        "Schedule"
      ],
      "relevance": "Special Courts for scheduled offences like s.409/420 by public servants; proviso s.4(1) allows trying other chargeable offences."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The Supreme Court upheld the Calcutta High Court's alteration of conviction from s.409 IPC to s.420 IPC, finding the Special Court competent to try s.420 under the Act and CrPC provisions, ingredients proved, no prejudice, and sentence not severe.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The appellant did present the false bill purporting to present it in the discharge of his duties as a clerk of the Office of the Sub-Divisional Health Officer who was duly authorised to present bills and cash them.\"",
      "speaker": "court",
      "significance": "Key to jurisdiction under Schedule for s.420 as purporting to act as public servant."
    },
    {
      "text": "\"A man may be convicted of an offence, although there has been no charge in respect of it, if the evidence is such as to establish a charge that might have been made.\"",
      "speaker": "court",
      "significance": "From Begu, justifying s.237 application."
    },
    {
      "text": "\"We do not consider a sentence of 1 years rigorous imprisonment and a fine of Rs. 2,000 severe.\"",
      "speaker": "court",
      "significance": "Rejects challenge to sentence."
    }
  ],
  "_case_id": "1964_168",
  "_label": 0,
  "_text_length": 25416,
  "_extracted_at": "2026-02-10T19:45:02.400998"
}