{
  "metadata": {
    "case_name": null,
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo J."
    ],
    "case_number": "Civil Appeal No. 760 of 1962",
    "date_of_judgment": "1964-02-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant acted as agent in the then State of Hyderabad to both resident and non-resident principals in regard to sale of betel leaves.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Under the Hyderabad General Sales Tax Act, No. XIV of 1950, betel leaves were taxable at the purchase point from May 1, 1953, by virtue of a notification in that behalf.",
      "type": "material",
      "date": "1953-05-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The assessment period concerned is from May 1, 1953 to March 31, 1954, covered by the assessment year 1953-54.",
      "type": "procedural",
      "date": "1953-05-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellant collected sales tax from the purchasers in connection with the sales made by it on the basis that the incident of the tax lay on the sellers and assured the purchasers that after paying the tax to the appellant, there would be no further liability on them.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After realising the tax, the appellant did not pay the amount realised to the Government but kept it in the suspense account of its principals, namely, the purchasers.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "When the accounts were scrutinized by the Sales Tax Department, this was discovered and thereupon the appellant was called upon to pay the amounts realised to the Government.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The appellant objected to the payment on the ground that it was the seller and the relevant notification for the relevant period imposed tax at the purchase point, i.e. on the purchaser.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "This objection was over-ruled and the appellant was directed to pay the amount to Government.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The appellant filed a writ petition in the Andhra Pradesh High Court questioning the validity of s. 11(2) of the Hyderabad General Sales Tax Act, No. XIV of 1950.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "The High Court dismissed the writ petition (Writ Petition No. 1123 of 1956) by judgment and order dated July 16, 1959.",
      "type": "procedural",
      "date": "1959-07-16",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The High Court refused a certificate to appeal to this Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The appellant obtained special leave and filed this appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The appellant is a registered dealer.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "It is not disputed, as appears from the final assessment order of the Sales Tax Officer dated September 27, 1956, that the appellant was not liable to pay the amount as sales tax for the relevant period.",
      "type": "admitted",
      "date": "1956-09-27",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether s. 11(2) of the Hyderabad General Sales Tax Act, No. XIV of 1950, which authorised the Government to recover from any person who had collected or collects after May 1, 1950, any amount by way of tax otherwise than in accordance with the provisions of the Act, as arrears of land revenue, was within the legislative competence of the State legislature under Entry 54 of List II.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether s. 11(2) could be sustained as an ancillary or incidental provision to the taxing power under Entry 54 of List II.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether s. 11(2) could be justified as a penalty provision.",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether s. 11(2) could be sustained under Entry 26 of List II (trade and commerce within the State).",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "s. 11(2) of the Act, which authorised the Government to recover from any person who had collected or collects after May 1, 1950, any amount by way of tax otherwise than in accordance with the provisions of the Act, as arrears of land revenue, was beyond the legislative competence of the State legislature.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "Entry 54 of List II of the Seventh Schedule to the Constitution"
    },
    {
      "id": "pa2",
      "text": "Entry 54 vests power to make a law for taxing sales and purchases of goods and for making all necessary incidental provisions for levy and collection, but does not empower enactment requiring a dealer who collected tax without authority to hand it over to Government, as such collection is not a tax levied under the law.",
      "supporting_facts": [
        "f4",
        "f5",
        "f7"
      ],
      "legal_basis": "Entry 54 of List II"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "s. 11(2) is good as an ancillary provision with regard to the collection of sales or purchase tax and therefore incidental to the taxing power under Entry 54 of List II.",
      "supporting_facts": [],
      "legal_basis": "Entry 54 of List II"
    },
    {
      "id": "ra2",
      "text": "Assuming Entry 54 cannot sustain s. 11(2), it could be sustained under Entry 26 of List II.",
      "supporting_facts": [],
      "legal_basis": "Entry 26 of List II"
    },
    {
      "id": "ra3",
      "text": "s. 11(2) regulates trade and commerce.",
      "supporting_facts": [],
      "legal_basis": "Entry 26 of List II"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s. 11(2) applies to collections made after May 1, 1950 by any person and lays down that any amount collected by way of tax otherwise than in accordance with the provisions of the Act shall be paid over to the Government and in default recovered as arrears of land revenue.",
      "addresses_issue": "i1",
      "key_observation": "The amount collected by way of tax was not exigible as tax under the Act."
    },
    {
      "id": "cr2",
      "text": "The sums collected by way of tax are not in fact tax exigible under the Act, so the State legislature was not directly legislating for imposition of sales or purchase tax under Entry 54.",
      "addresses_issue": "i1",
      "key_observation": "Provision cannot be justified as directly under Entry 54."
    },
    {
      "id": "cr3",
      "text": "Incidental or ancillary powers must aid the main topic of taxing sales or purchases; cannot extend to requiring payment of non-exigible amounts merely because collected as tax by mistake.",
      "addresses_issue": "i2",
      "key_observation": "Such provision goes beyond ancillary power."
    },
    {
      "id": "cr4",
      "text": "s. 11(2) is not a penalty for breach of any prohibition, unlike penalties in ss. 19, 20, 28, 46 of Income Tax Act.",
      "addresses_issue": "i3",
      "key_observation": "No element of penalty; s.20(c) consequential and falls with it."
    },
    {
      "id": "cr5",
      "text": "Entry 26 deals with trade and commerce, separate from taxing entries; s.11(2) has no element of regulation of trade and commerce.",
      "addresses_issue": "i4",
      "key_observation": "Cannot be upheld under Entry 26."
    },
    {
      "id": "cr6",
      "text": "Orient Paper Mills case inapplicable as it dealt with refund conditions, not forcing payment of non-tax amounts.",
      "addresses_issue": "i1",
      "key_observation": "Different situation."
    },
    {
      "id": "cr7",
      "text": "Indian Aluminium Co. v. State of Madras decision incorrect.",
      "addresses_issue": "i1",
      "key_observation": "Similar provision held wrong."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "s. 11(2) of the Hyderabad General Sales Tax Act, No. XIV of 1950 is not within the competence of the State legislature under Entry 54 of List II, even as ancillary or incidental, nor as penalty, nor under Entry 26 of List II.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "s. 20(c) falls with s. 11(2) as consequential.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Sales Tax Officer not entitled to ask appellant to pay over amounts collected wrongly as sales tax.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Orient Paper Mills Limited v. The State of Orissa",
      "citation": "1962 1 S.C.R. 549",
      "treatment": "distinguished",
      "relevance": "Dealt with refund conditions under incidental power; inapplicable to forcing payment of non-exigible tax amounts."
    },
    {
      "case_name": "State of Bombay v. The United Motors (India) Limited",
      "citation": "1953 S.C.R. 1069",
      "treatment": "referred",
      "relevance": "Mentioned in context of Orient Paper Mills regarding non-taxability of inter-state dispatches."
    },
    {
      "case_name": "Indian Aluminium Co. v. The State of Madras",
      "citation": "1962 XIII S.T.C. 967",
      "treatment": "doubted",
      "relevance": "Upheld similar provision; held incorrect."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hyderabad General Sales Tax Act, No. XIV of 1950",
      "sections": [
        "s. 11(2)",
        "s. 11(1)",
        "s. 19",
        "s. 20",
        "s. 20(c)"
      ],
      "relevance": "s.11(2) held ultra vires; provides for recovery of amounts collected as tax not exigible under Act."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Entry 54 List II",
        "Entry 26 List II"
      ],
      "relevance": "s.11(2) not within legislative competence under these entries."
    },
    {
      "name": "Indian Income Tax Act, 1922",
      "sections": [
        "s. 28",
        "s. 46"
      ],
      "relevance": "Examples of penalties for evasion or default in payment of taxes properly levied."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; s.11(2) held ultra vires and incompetent; assessment order dated September 27, 1956 quashed insofar as based on s.11(2).",
    "relief_granted": "Quashing of assessment order to the extent based on s.11(2)",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"though the amount may have been collected by way of tax it was not exigible as tax under the Act.\"",
      "speaker": "court",
      "significance": "Core finding on why s.11(2) not a tax provision."
    },
    {
      "text": "\"the ambit of ancillary or incidental power goes to the extent of permitting the legislature to provide that though the amount collected may be wrongly by way of tax is not exigible under the law as made under the relevant taxing entry, it shall still be paid over to Government, as if it were a tax.\"",
      "speaker": "court",
      "significance": "Rejects ancillary power argument."
    },
    {
      "text": "\"If a dealer has collected anything from a purchaser which is not authorised by the taxing law, that is a matter between him and the purchaser.\"",
      "speaker": "court",
      "significance": "State cannot recover non-tax amounts indirectly."
    }
  ],
  "_case_id": "1964_7",
  "_label": 1,
  "_text_length": 17404,
  "_extracted_at": "2026-02-10T19:42:23.559683"
}