{
  "metadata": {
    "case_name": "Tata Oil Mills Co. Ltd. v. Respondent No. 1",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, C.J."
    ],
    "case_number": "Civil Appeal No. 517 of 1963",
    "date_of_judgment": "1964-03-31"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is Tata Oil Mills Co. Ltd., engaged in soaps and toilet articles industry, owns three factories including one at Tatapuram, Ernakulam, Kerala, and 12 sales offices.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "K. K. Raghavan was working with appellant at Tatapuram factory.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 12th November 1955, Raghavan and another employee Mathews waylaid and assaulted C. A. Augustine, Chargeman of Soap Plant, while returning home after second shift duty.",
      "type": "material",
      "date": "1955-11-12",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Charge-sheets issued against Raghavan and Mathews on 14th November 1955.",
      "type": "procedural",
      "date": "1955-11-14",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondent Union represented that justice would not be done unless enquiry held by outsider; General Manager appointed Y. D. Joshi, Law Officer from Head Office, to hold enquiry.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Joshi held enquiry from 27th to 30th December 1955, report dated 7th January 1956.",
      "type": "procedural",
      "date": "1955-12-27",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Pending industrial dispute, appellant applied to Industrial Tribunal for approval of dismissals; Tribunal approved Raghavan's dismissal but not Mathews'.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant dismissed Raghavan with effect from 14th November 1955 pursuant to Tribunal approval.",
      "type": "procedural",
      "date": "1955-11-14",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Respondent raised industrial dispute on propriety and validity of Raghavan's dismissal; reference ordered on 3rd December 1958.",
      "type": "procedural",
      "date": "1958-12-03",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Industrial Tribunal held appellant not justified in dismissing Raghavan, ordered reinstatement; Award dated 28th September 1960.",
      "type": "procedural",
      "date": "1960-09-28",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Assault occurred outside factory at considerable distance.",
      "type": "admitted",
      "date": "1955-11-12",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Enquiry Officer found assault motivated by Raghavan's hostility to C. A. Augustine's support for Incentive Bonus Scheme; Augustine called 'black-leg Karinkali' interested in increased production for bonus; linked to rivalry between two unions.",
      "type": "material",
      "date": "1955-11-12",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Charge alleged assault to terrorise workmen supporting increased production under incentive bonus scheme, subversive of discipline.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "Raghavan wanted to examine witnesses M. P. Menon and Chalakudi; Enquiry Officer wrote letters to them to assist; Menon replied unable to attend; Chalakudi sent unsigned letter reaching on 31st Dec 1955 when Officer leaving, no action taken.",
      "type": "procedural",
      "date": "1955-12-31",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Criminal proceedings started against Raghavan.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Tribunal found no victimization; no evidence management foisted case or motivated by unfair labour practice.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether facts proved against Raghavan attract Standing Order 22(viii) which includes riotous or disorderly behaviour without the factory.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether domestic enquiry conducted in accordance with principles of natural justice.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether dismissal actuated by malafides or amounts to victimisation.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether Tribunal could consider merits itself despite fair domestic enquiry.",
      "framed_by": "court"
    },
    {
      "id": "i5",
      "text": "Whether domestic enquiry should have been stayed pending criminal proceedings.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Assault not purely private; motivated by hostility over Incentive Bonus Scheme supported by Augustine, opposed by Raghavan; connected to employment and subversive of discipline; attracts Standing Order 22(viii).",
      "supporting_facts": [
        "f3",
        "f12",
        "f13"
      ],
      "legal_basis": "Standing Order 22(viii)"
    },
    {
      "id": "pa2",
      "text": "Domestic enquiry fair; Enquiry Officer assisted Raghavan by writing to witnesses; no duty to compel attendance or grant indefinite adjournments.",
      "supporting_facts": [
        "f5",
        "f6",
        "f14"
      ],
      "legal_basis": "Principles of natural justice"
    },
    {
      "id": "pa3",
      "text": "No malafides or victimisation; Tribunal itself found no victimisation.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Findings of domestic enquiry binding on Tribunal unless perverse or unsupported by evidence.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Assault purely private matter between individuals; not connected to employment; Standing Order 22(viii) not attracted as it covers disputes not purely private.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Standing Order 22(viii)"
    },
    {
      "id": "ra2",
      "text": "Enquiry violated natural justice; Enquiry Officer refused to properly summon/adjourn for witnesses M.P. Menon and Chalakudi; unsympathetic attitude.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Principles of natural justice"
    },
    {
      "id": "ra3",
      "text": "Framing charge under Standing Order 22(viii) despite not applying shows malafides; no adjournment introduces unfairness/malafides.",
      "supporting_facts": [
        "f10",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Employee should get opportunity before Tribunal to lead evidence if unable at domestic enquiry, akin to Phulbari Tea Estate.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Phulbari Tea Estate v. Its Workmen"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Assault not purely private; motivated by difference over Incentive Bonus Scheme and union rivalry; rational connection to employment; attracts Standing Order 22(viii). Accepts domestic Tribunal findings as based on evidence.",
      "addresses_issue": "i1",
      "key_observation": "Disorderly behaviour without factory attracts SO if connected to employment."
    },
    {
      "id": "cr2",
      "text": "Enquiry fair; Officer assisted by writing letters; no duty to compel witnesses or accept unsigned letter/adjourn indefinitely; Raghavan failed to produce witnesses.",
      "addresses_issue": "i2",
      "key_observation": "Domestic enquiry officer not required to summon witnesses like court."
    },
    {
      "id": "cr3",
      "text": "No malafides; Tribunal erred in finding malafides from non-adjournment or charge under SO; error in conclusion does not imply malafides; no victimisation.",
      "addresses_issue": "i3",
      "key_observation": "Tribunal found no victimisation."
    },
    {
      "id": "cr4",
      "text": "Fair domestic enquiry findings binding on Tribunal; cannot re-examine unless perverse.",
      "addresses_issue": "i4",
      "key_observation": "Distinguishes Phulbari: applies only if enquiry defective."
    },
    {
      "id": "cr5",
      "text": "Desirable but not mandatory to stay domestic enquiry pending criminal trial; proceeding despite pending criminal does not vitiate enquiry.",
      "addresses_issue": "i5",
      "key_observation": "Not vitiated merely for not staying."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Standing Order 22(viii) applies to riotous behaviour outside factory if rationally connected to employment.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Domestic enquiry conducted per natural justice principles.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "No malafides or victimisation in dismissal.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "Tribunal cannot re-appraise facts if domestic enquiry fair and findings supported by evidence.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h5",
      "text": "Domestic enquiry not vitiated solely for not staying pending criminal proceedings.",
      "resolves_issue": "i5",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Phulbari Tea Estate v. Its Workmen",
      "citation": "1960 1 S.C.R. 32",
      "treatment": "followed",
      "relevance": "Employer may justify dismissal before Tribunal if domestic enquiry defective; distinguished as inapplicable to fair enquiry."
    },
    {
      "case_name": "Delhi Cloth and General Mills Ltd. v. Kushal Bhan",
      "citation": "1960 3 S.C.R. 227",
      "treatment": "followed",
      "relevance": "Desirable to stay domestic enquiry pending criminal trial for grave charges, but not mandatory; proceeding does not vitiate."
    }
  ],
  "statutes_cited": [
    {
      "name": "Certified Standing Orders of the appellant",
      "sections": [
        "22(viii)"
      ],
      "relevance": "Defines misconduct to include riotous or disorderly behaviour without factory; applied to assault connected to employment."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; Industrial Tribunal's order set aside; reference answered in favour of appellant; reinstatement direction quashed.",
    "relief_granted": "None to Raghavan; appellant offered ex gratia Rs. 1,000/- to Raghavan in addition to stay amounts.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In order that standing order 22 viii may be attracted, the appellant should be able to show that the disorderly or riotous behaviour had some rational connection with the employment of the assailant and the victim.\"",
      "speaker": "court",
      "significance": "Defines scope of Standing Order 22(viii) for acts outside factory."
    },
    {
      "text": "\"Findings properly recorded at such enquiries are binding on the parties, unless, of course, it is known that the said findings are perverse, or are not based on any evidence.\"",
      "speaker": "court",
      "significance": "Limits Tribunal's power to interfere with fair domestic enquiries."
    },
    {
      "text": "\"I do not for a moment believe, says the Tribunal, that the management foisted a case against the ex-worker.\"",
      "speaker": "lower_court",
      "significance": "Tribunal's own finding rejecting victimisation."
    }
  ],
  "_case_id": "1964_15",
  "_label": 1,
  "_text_length": 20246,
  "_extracted_at": "2026-02-10T19:42:19.905488"
}