{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. Express Newspapers Ltd.",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Civil Appeal No. 596 of 1963",
    "date_of_judgment": "1964-05-07"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Free Press of India Madras Ltd. was a private limited company carrying on business as printers and publishers of newspapers including Indian Express, Dinamani, Andhra Prabha at Madras, Eastern Express and Bharat at Calcutta, Sunday Standard and Morning Standard at Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Express Newspapers Limited (assessee-company) was formed on or about April 22, 1946.",
      "type": "background",
      "date": "1946-04-22",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On August 31, 1946, Free Press Company passed a resolution transferring to the assessee-company the right to print and publish the said newspapers from September 1, 1946, letting out its machinery and assets and authorizing the assessee-company to collect the book debts and pay off the liabilities of the Free Press Company.",
      "type": "material",
      "date": "1946-08-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Assessee-company started publishing newspapers from September 1, 1946.",
      "type": "material",
      "date": "1946-09-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On October 31, 1946, Free Press Company resolved at a General Body Meeting to wind up the company voluntarily. The liquidator appointed thereunder was directed to carry on the business of the company.",
      "type": "material",
      "date": "1946-10-31",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On November 1, 1946, the liquidator ascertained the value of the assets over the liabilities taken over by the assessee-company as per the balance-sheet at Rs. 19,36,000 and this amount was credited to the account of the two directors of the Free Press Company in the assessee's books.",
      "type": "material",
      "date": "1946-11-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Profit of Free Press Company worked out to Rs. 6,08,666, being the difference between the written down value and the sale price of the machinery: (i) Rs. 2,14,090 difference between original cost price and written down value; (ii) Rs. 3,94,576 amount in excess over original cost price.",
      "type": "material",
      "date": "1946-11-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Income-tax Officer included Rs. 2,14,090 as profit under proviso to s.10(2)(vii) and Rs. 3,94,576 as capital gains under s.12B in total income of assessee-company and assessed each to tax.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Income-tax Appellate Tribunal upheld inclusion of capital gains item but decided against inclusion of first item.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Tribunal referred two questions to Madras High Court under s.66(1) of Income-tax Act: (1) Whether Free Press Company made business profit of Rs.2,14,090 under proviso to s.10(2)(vii)? (2) Whether capital gain made by Free Press Company liable to be assessed in hands of Express Company under s.26(2)?",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Madras High Court (Rajagopalan and Ramachandra Iyer, JJ.) answered both questions in the negative against the department by judgment dated March 1, 1960 in Case Referred No.11 of 1955.",
      "type": "procedural",
      "date": "1960-03-01",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "During accounting year 1946-47, Free Press Company did not do business of printing and publishing from September 1, 1946; thereafter assessee-company alone carried on the business.",
      "type": "disputed",
      "date": "1946-47",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Liquidator confirmed transfer of assets on November 1, 1946; machinery sold yielding profit of Rs.6,08,666 to Free Press Company.",
      "type": "material",
      "date": "1946-11-01",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Machinery sold by Free Press Company during accounting year after it closed down business and went into voluntary liquidation.",
      "type": "material",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Free Press Company made a business profit of Rs. 2,14,090/- under proviso to section 10(2)(vii) of the Act?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the capital gain made by the Free Press Company is liable to be assessed in the hands of the Express Company, under section 26(2) of the Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The first item of Rs. 2,14,090/-, representing the surplus over the written down value of the machinery was assessable in accordance with the proviso to s. 10(2)(vii) of the Act.",
      "supporting_facts": [
        "f7",
        "f13",
        "f14"
      ],
      "legal_basis": "Proviso to s.10(2)(vii) Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "The second item of Rs. 3,94,576/-, representing the capital gains made by the Free Press Company is assessable in the hands of the assessee-company, who succeeded to the said business, under s. 26(2) of the Act.",
      "supporting_facts": [
        "f7",
        "f13",
        "f14"
      ],
      "legal_basis": "s.26(2) proviso, Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Neither the conditions laid down in s. 10(2)(vii) of the Act nor those laid down in s. 26(2) thereof attracted the said two items of income and therefore they were not assessable in the hands of the assessee-company.",
      "supporting_facts": [
        "f12",
        "f14"
      ],
      "legal_basis": "s.10(2)(vii), s.26(2) Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Second proviso to s.10(2)(vii) applies only if: (1) business carried on by assessee during previous year or part; (2) machinery used in business; (3) sold when business carried on, not for closing or winding up. Here, sale after business closed and during winding up, so first item not assessable.",
      "addresses_issue": "i1",
      "key_observation": "Sale of machinery after business closed and during liquidation not in course of business carried on."
    },
    {
      "id": "cr2",
      "text": "Distinguishes National Syndicate as applying to substantive clause vii for losses, not proviso for profits; Pursa Ltd. directly covers as sale not in furtherance of business but realisation in winding up.",
      "addresses_issue": "i1",
      "key_observation": "Winding up sale not trading or doing business."
    },
    {
      "id": "cr3",
      "text": "Capital gains under s.12B distinct head from business profits u/s.10; s.26(2) and proviso apply only to business profits/gains (4th head s.6), not capital gains (separate 6th head); succession provisions limited to business income.",
      "addresses_issue": "i2",
      "key_observation": "Heads of income mutually exclusive; capital gains not business profits even if from business assets."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "First item Rs.2,14,090 not liable to tax under proviso to s.10(2)(vii) as sale not during carrying on of business but during winding up.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Capital gains not assessable on assessee under s.26(2) as that section applies only to business profits, not capital gains which is separate head.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Liquidators of Pursa Limited v. Commissioner of Income-tax, Bihar",
      "citation": "1954 S.C.R. 767",
      "treatment": "followed",
      "relevance": "Sale of assets in winding up not business profits under proviso s.10(2)(vii); machinery not used in business year."
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay Circle II v. The National Syndicate, Bombay",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Applies to substantive s.10(2)(vii) for losses after closure if used earlier; not to proviso for profits."
    },
    {
      "case_name": "K. M. S. Reddy, Commissioner of Income-tax, Kerala v. The West Coast Chemicals and Industries Ltd.",
      "citation": "1962 Supp. 3 S.C.R. 960",
      "treatment": "followed",
      "relevance": "Winding up realisation sale not carrying on business; distinction between trading sales and winding up sales."
    },
    {
      "case_name": "United Commercial Bank Ltd. v. Commissioner of Income-tax, West Bengal",
      "citation": "1958 S.C.R. 79",
      "treatment": "followed",
      "relevance": "Sections 7 to 12 mutually exclusive heads of income."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "s.3",
        "s.6",
        "s.10(1)",
        "s.10(2)(iv,v,vi,vii) proviso 2",
        "s.12B",
        "s.24(2A)",
        "s.24(2B)",
        "s.25(4)",
        "s.26(2) proviso",
        "s.66(1)"
      ],
      "relevance": "Governs computation of business profits, capital gains as separate heads; succession only for business profits; proviso s.10(2)(vii) for recoupment of excess depreciation only if sale during business."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal preferred by the Revenue against the Madras High Court judgment answering both referred questions in the negative, holding neither the Rs.2,14,090 business profit under proviso s.10(2)(vii) nor the Rs.3,94,576 capital gains under s.26(2) assessable in assessee's hands.",
    "relief_granted": "None; upholds High Court decision against Revenue.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the sale of the machinery in the instant case having taken place after the business was closed and during the winding up proceedings, it would fall outside the scope of the said proviso\"",
      "speaker": "court",
      "significance": "Core reason first item not taxable under s.10(2)(vii) proviso."
    },
    {
      "text": "\"profits and gains of business and capital gains are two distinct concepts in the Income-tax Act\"",
      "speaker": "court",
      "significance": "Distinguishes heads, limits s.26(2) to business profits only."
    },
    {
      "text": "\"a winding up sale was not trading or doing business\"",
      "speaker": "court",
      "significance": "Affirms principle from West Coast Chemicals that liquidation sales not business activity."
    }
  ],
  "_case_id": "1964_41",
  "_label": 0,
  "_text_length": 29203,
  "_extracted_at": "2026-02-10T19:43:35.099308"
}