{
  "metadata": {
    "case_name": "Appellant v. Respondents",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO, J."
    ],
    "case_number": "Civil Appeal No. 119 of 1963",
    "date_of_judgment": "1964-02-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The money in question was deposited with the appellant by his sister as far back as January 1946. The total amount deposited was Rs. 90,000/-, but the appellants sister took back Rs. 5,000/-, with the result that the balance of Rs. 85,000/- remained deposited with the appellant.",
      "type": "material",
      "date": "1946-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellants sister thereafter migrated to Pakistan sometimes between June to August 1949.",
      "type": "material",
      "date": "1949-06 to 1949-08",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Sometime later, the Assistant Custodian General called upon the appellant to pay this sum lying in deposit under s. 48 of the Administration of Evacuee Property Act, No. XXXI of 1950.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The appellant contested the matter on the ground that the money had been given to him as a loan and its recovery was barred in January 1949 long before his sister had migrated to Pakistan.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "The Assistant Custodian however directed the recovery of the amount as arrears of land revenue under s. 48 of the Act, as it then stood.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The matter was taken in appeal before the Custodian, Saurashtra, but the appeal failed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The appellant then went in revision to the Custodian General, and the revision also failed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Then followed a writ petition by the appellant before the Saurashtra High Court in 1955. The writ petition was dismissed by a learned Single Judge but on Letters Patent Appeal the appellant succeeded, the High Court holding that the amount was not recoverable under s. 48 of the Act as it stood at the relevant time. This decision was given on December 9, 1957.",
      "type": "procedural",
      "date": "1955 to 1957-12-09",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "In the meantime, s. 48 had been amended on October 22, 1956.",
      "type": "background",
      "date": "1956-10-22",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "After the appellant had succeeded in the High Court, another notice of demand was served on him by the Assistant Custodian on January 22, 1958, and after hearing the objections of the appellant, the Assistant Custodian again directed the amount to be recovered.",
      "type": "procedural",
      "date": "1958-01-22",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The appellant then took the matter in appeal to the Custodian General. The Custodian General allowed the appeal in August 1958 and remanded the proceedings for further enquiry as directed by him.",
      "type": "procedural",
      "date": "1958-08",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The Custodian General held that s. 48 as amended applied to the fresh proceedings which began on the notice issued by the Assistant Custodian in January 1958. He further held that the amount was recoverable under the amended s. 48 provided it was due to the evacuee on the date the property of the evacuee vested in the Custodian.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "After the remand further evidence was taken and it was held that the amount in question was payable by the appellant as it was a deposit and was still recoverable when the property vested in the Custodian.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Thereupon the appellant again went in appeal to the Custodian General and that appeal was dismissed on February 6, 1961.",
      "type": "procedural",
      "date": "1961-02-06",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Then the appellant applied to this Court for special leave which was granted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "On the findings of the authorities concerned, it appears that the deposit was made sometime in January 1946.",
      "type": "admitted",
      "date": "1946-01",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "The demand was made for the first time on January 10, 1952 by the Assistant Custodian.",
      "type": "procedural",
      "date": "1952-01-10",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether the amended s. 48 can be applied to the present case",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "whether the claim of the Custodian is barred even on the basis of the transaction between the appellant and his sister being a deposit and not a loan",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The money had been given to him as a loan and its recovery was barred in January 1949 long before his sister had migrated to Pakistan.",
      "supporting_facts": [
        "f1",
        "f2",
        "f4"
      ],
      "legal_basis": "law of limitation"
    },
    {
      "id": "pa2",
      "text": "Amended s.48 does not apply as it is only for sums payable in respect of evacuee property, not the property itself; recovery of property under s.9.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "s.48(1), s.9 of the Act"
    },
    {
      "id": "pa3",
      "text": "Even if deposit, right to recover barred by limitation; demand Jan 10, 1952, barred by Jan 1955; sub-s.3 not retrospective.",
      "supporting_facts": [
        "f17",
        "f2"
      ],
      "legal_basis": "Art. 60 Limitation Act 1908, s.48(3)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Amended s.48 applies as procedural; sum payable in respect of evacuee property (actionable claim).",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "s.48 as amended, s.10(2)(i)"
    },
    {
      "id": "ra2",
      "text": "Appellant never contested before authorities that recovery barred if deposit; only if loan. New plea not allowed; evidence might have been led otherwise.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "procedural fairness"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sub-sections (1) and (2) of amended s.48 are clearly procedural and would apply to all cases which have to be investigated in accordance therewith after October 22, 1956, even though the claim may have arisen before.",
      "addresses_issue": "i1",
      "key_observation": "Procedural amendments apply retrospectively to actions after coming into force."
    },
    {
      "id": "cr2",
      "text": "The amount is not evacuee property itself but the right to recover it (actionable claim) which vested; recoverable under s.48(1)(2) as sum payable in respect thereof.",
      "addresses_issue": "i1",
      "key_observation": "S.9 for physical seizure, s.48 for incorporeal like actionable claims."
    },
    {
      "id": "cr3",
      "text": "Limitation had not begun to run on migration date (June-Aug 1949) as deposit, no demand; right vested alive.",
      "addresses_issue": "i2",
      "key_observation": "Art.60 Limitation Act; runs from demand."
    },
    {
      "id": "cr4",
      "text": "Appellant never contested before authorities that recovery barred if deposit (only if loan); cannot raise new point now; might have led evidence on conditions, acknowledgements.",
      "addresses_issue": "i2",
      "key_observation": "New plea raises fact questions not investigated."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Amended s.48(1) and (2) apply as procedural to proceedings after Oct 22, 1956; sum recoverable as payable in respect of evacuee property (actionable claim).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Appellant not permitted to raise plea that recovery barred even if deposit, as not raised before authorities.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Administration of Evacuee Property Act, 1950",
      "sections": [
        "s.48",
        "s.9",
        "s.10(2)(i)"
      ],
      "relevance": "Recovery of sums due in respect of evacuee property as arrears of land revenue; amended by Act 91 of 1956 from Oct 22, 1956 to deem payable notwithstanding limitation."
    },
    {
      "name": "Indian Limitation Act, 1908",
      "sections": [
        "Art. 60"
      ],
      "relevance": "Limitation for deposit runs from demand."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed as amended s.48 applies procedurally, the amount is recoverable as sum in respect of vested actionable claim, and appellant not allowed new limitation plea if deposit.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "It is well settled that procedural amendments to a law apply, in the absence of anything to the contrary, retrospectively in the sense that they apply to all actions after the date they come into force even though the actions may have begun earlier or the claim on which the action may be based may be of an anterior date.",
      "speaker": "court",
      "significance": "Basis for applying amended s.48(1)(2)"
    },
    {
      "text": "the property which vested in the Custodian would be the right of the appellants sister to recover the amount from the appellant and that would be incorporeal property in the form of an actionable claim.",
      "speaker": "court",
      "significance": "Clarifies nature of vested property and applicability of s.48"
    },
    {
      "text": "the appellant therefore cannot now for the first time in this Court take the plea that recovery could not be made under s. 48 and sub-s. 3 thereof would not apply even if the amount is treated as a deposit.",
      "speaker": "court",
      "significance": "Rejects new limitation argument"
    }
  ],
  "_case_id": "1964_10",
  "_label": 0,
  "_text_length": 15845,
  "_extracted_at": "2026-02-10T19:42:17.713195"
}