{
  "metadata": {
    "case_name": "Appellant v. Munichinnappa",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo J."
    ],
    "case_number": "Civil Appeal No. 401 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "An election was held to the Bangalore South Scheduled Castes constituency in February 1962.",
      "type": "procedural",
      "date": "1962-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Four persons stood for election including the appellant and Munichinnappa (respondent No. 1), who obtained the highest number of votes and was declared elected.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellant filed an election petition challenging the election of respondent No. 1 on a number of grounds, including that respondent No. 1 was not a member of any of the scheduled castes mentioned in the Constitution Scheduled Castes Order, 1950.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Respondent No. 1 claimed that he belonged to the scheduled caste listed as Bhovi in the Order.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The appellant contended that respondent No. 1 was a Voddar by caste and that Voddar was not a scheduled caste specified in the Order.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The Election Tribunal held that the caste mentioned as Bhovi in the Order was a subcaste amongst the Voddars and that only this sub-caste was included in the Order and not the entire Voddar caste; also held that respondent No. 1 did not belong to the sub-caste of Bhovi and therefore was not eligible; consequently set aside the election and ordered re-election.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Respondent No. 1 appealed to the Mysore High Court, contending he belonged to the scheduled caste Bhovi.",
      "type": "procedural",
      "date": "1963-10-14",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Mysore High Court held that Voddar caste as such was not included in the Order, but considering facts and circumstances at the time the Order was passed in 1950, the Bhovi caste mentioned therein was no other than Voddar caste; allowed the appeal, held respondent No. 1 being a Voddar must be held to be a member of Bhovi caste, and dismissed the election petition.",
      "type": "procedural",
      "date": "1963-10-14",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "High Court refused leave to appeal; appellant obtained special leave from Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In Mysore State as it was before re-organisation of 1956, there was no caste known as Bhovi at all.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Resolution passed by Voddar caste at conference in July 1944 to change name from Voddar to Bhovi.",
      "type": "background",
      "date": "1944-07",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Order passed by Mysore Government on February 2, 1946: 'Government are pleased to direct that the community known as Vodda be in future called Boyi in all Government communications and records.'",
      "type": "background",
      "date": "1946-02-02",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Since 1946, in all government records the Voddar caste has been known as Boyi; Voddar and Vodda are the same.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Variations in spelling: Voddar as Voddara, Yoddar, Vodda; Boyi as Bovi, Bhovi; Kanada equivalent is one and the same.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Constitution Scheduled Castes Order, 1950 mentions Bhovi for Mysore State.",
      "type": "background",
      "date": "1950",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether respondent No. 1, who is a Voddar by caste, is a member of the scheduled caste Bhovi mentioned in the Constitution Scheduled Castes Order, 1950, and thus eligible to stand for election from a scheduled caste constituency.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether evidence is admissible to show that Voddar caste is the same as Bhovi caste specified in the Order, given Article 341 of the Constitution.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "A person is only entitled to stand for election from a scheduled caste constituency if he is a member of a caste specified in the Order; it is not open to claim that though not a member of a specified caste, another caste is included in it.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Article 341; Constitution Scheduled Castes Order, 1950"
    },
    {
      "id": "pa2",
      "text": "Wherever a caste has more than one name, the Order specifies the other name in brackets; even where spelt differently, various spellings are included in the same entry; since Bhovi does not mention Voddar in brackets, evidence cannot be taken that Voddar is the same as Bhovi.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Constitution Scheduled Castes Order, 1950"
    },
    {
      "id": "pa3",
      "text": "Notification under Article 341(1) is final and cannot be varied except by Parliament under clause (2); no evidence (oral or documentary) can include a caste not specifically mentioned.",
      "supporting_facts": [],
      "legal_basis": "Article 341"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Respondent No. 1 belonged to the scheduled caste Bhovi mentioned in the Order and was entitled to stand for election from the scheduled caste constituency.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Constitution Scheduled Castes Order, 1950"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Article 341 provides for notification by President after consultation with Governor, final except modification by Parliament; object to avoid disputes by specifying castes.",
      "addresses_issue": "i2",
      "key_observation": "Notification final, but in peculiar case where no Bhovi caste existed pre-1956 in Mysore, evidence necessary to identify caste meant by Bhovi."
    },
    {
      "id": "cr2",
      "text": "Generally not open to lead evidence that one caste is part of or same as specified caste unless indicated (e.g., brackets); but here, undisputed no Bhovi caste pre-1956, so evidence required to determine which caste meant.",
      "addresses_issue": "i2",
      "key_observation": "Peculiar circumstance: no specific Bhovi caste, President could not include non-existent caste."
    },
    {
      "id": "cr3",
      "text": "Evidence: 1944 Voddar resolution to change to Bhovi; 1946 Govt order Vodda to Boyi; since then Voddar known as Boyi in records; President consulted Rajpramukh, likely used then-official name.",
      "addresses_issue": "i1",
      "key_observation": "Voddar changed name officially in 1946 to Boyi."
    },
    {
      "id": "cr4",
      "text": "Spelling differences (Bhovi vs Boyi) not material; no Bhovi caste existed, variations common (e.g., govt notification spells Voddar differently); High Court right not to attach importance to English spelling.",
      "addresses_issue": "i1",
      "key_observation": "Kanada equivalent same; spellings vary in official docs."
    },
    {
      "id": "cr5",
      "text": "Respondent No. 1 though Voddar by caste belongs to scheduled caste of Bhovi mentioned in the Order.",
      "addresses_issue": "i1",
      "key_observation": "Evidence establishes identity in peculiar circumstances."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In peculiar circumstances where no caste specifically known as Bhovi existed in Mysore pre-1956, evidence admissible to determine caste meant by Bhovi in Order; evidence shows Voddar (name changed to Boyi/Bhovi in 1946) is that caste.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Respondent No. 1, being Voddar, is member of scheduled caste Bhovi under Order 1950.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 341"
      ],
      "relevance": "President specifies Scheduled Castes by notification after consultation; final except Parliament modification; basis for interpreting Order."
    },
    {
      "name": "Constitution (Scheduled Castes) Order, 1950",
      "sections": [],
      "relevance": "Specifies castes including Bhovi for Mysore; interpretation requires identifying caste where name mismatch due to non-existence."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the High Court's decision that respondent No. 1, a Voddar, belongs to the scheduled caste Bhovi as per the 1950 Order, due to historical name change and non-existence of separate Bhovi caste; election petition dismissed.",
    "relief_granted": "None to appellant; election of respondent No. 1 upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The object of this provision obviously is to avoid all disputes as to whether a particular caste is a Scheduled Caste or not and only those castes can be Scheduled Castes which are notified in the Order made by the President under Art. 341.",
      "speaker": "court",
      "significance": "Explains purpose and finality of Article 341 notifications."
    },
    {
      "text": "But when the undisputed fact is that there was no caste specifically known as Bhovi in the Mysore State as it existed before 1956 and one finds a caste mentioned as Bhovi in the Order, one has to determine which was the caste which was meant by that word on its inclusion in the Order.",
      "speaker": "court",
      "significance": "Justifies admission of evidence in peculiar circumstances."
    },
    {
      "text": "We agree with the High Court that respondent No. 1 though Voddar by caste belongs to the scheduled caste of Bhovi mentioned in the Order.",
      "speaker": "court",
      "significance": "Core holding on eligibility."
    }
  ],
  "_case_id": "1964_53",
  "_label": 0,
  "_text_length": 15591,
  "_extracted_at": "2026-02-10T19:43:26.460695"
}