{
  "metadata": {
    "case_name": "Appellant v. Modem Electrical Works",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Criminal Appeal No. 128 of 1962",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant hired a Westinghouse C. motor from the Modem Electrical Works on April 4, 1958 on a rent of Rs. 40 per month. The hiring period was to last for at least three months and it was agreed that if the motor or parts thereof were lost or damaged by the appellant, he would be bound to pay the whole cost of the motor and the parts.",
      "type": "material",
      "date": "1958-04-04",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The motor remained in the use of the appellant and hire-charges were paid by him from April 1958 to January 1959. Thereafter no hire-charges were paid.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On June 8, 1959, the appellant wrote a letter to the Works stating that he had purchased the motor for Rs. 600 on condition that it would be tried for three months, and if satisfactory the money would be paid and purchase completed; if not, pay three months hire at Rs. 40 per month and return it. Stated Rs. 620 paid in all, purchase completed, requested slip confirming sale as no further money due.",
      "type": "disputed",
      "date": "1959-06-08",
      "source": "appellant"
    },
    {
      "id": "f4",
      "text": "On June 15, 1959, the Works replied denying any such agreement, denied Rs. 620 paid, stated only Rs. 400 paid and Rs. 200 due for February to June 1959.",
      "type": "disputed",
      "date": "1959-06-15",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The appellant replied reiterating his stand and giving details of Rs. 620 payment.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "On July 1, 1959, the Works filed a complaint through Mohd. Ayub alleging criminal breach of trust under s. 406 IPC.",
      "type": "procedural",
      "date": "1959-07-01",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Presidency Magistrate 9th Court, Calcutta summoned appellant, took some prosecution evidence, discharged appellant holding no satisfactory evidence of dishonest misappropriation, dispute civil in nature.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Mohd. Ayub filed revision to Calcutta High Court, which set aside discharge and directed further enquiry by another Magistrate.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Third Presidency Magistrate, Calcutta found appellant not guilty and acquitted on ground of dispute as to nature of transaction, no dishonest intention to misappropriate.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Mohd. Ayub appealed to High Court under s. 417(3) CrPC. Division Bench held letter of June 8, 1959 showed dishonest violation of entrustment, no bona fide claim, convicted under s. 406 IPC.",
      "type": "procedural",
      "date": "1962-01-30",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Calcutta High Court granted certificate for appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant committed criminal breach of trust under s. 406 IPC by writing the letter dated June 8, 1959, asserting ownership over the motor, given the dispute over the nature of the entrustment agreement (hire vs. trial purchase).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The entrustment was on the basis of an agreement to purchase if satisfactory after three months trial, paying Rs. 600, or return after paying three months hire; Rs. 620 paid, purchase completed; dispute is civil as to nature of agreement.",
      "supporting_facts": [
        "f1",
        "f3",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "No dishonest misappropriation or conversion; mere assertion of his version of the agreement does not constitute breach of trust.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "s. 405 IPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Entrustment was merely by way of hire; letter of June 8, 1959 shows dishonest claim of ownership, violation of entrustment causing wrongful loss to Works and gain to appellant; not bona fide, mere pretence.",
      "supporting_facts": [
        "f1",
        "f2",
        "f4",
        "f10"
      ],
      "legal_basis": "s. 406 IPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Motor entrusted to appellant for his use; dispute is civil as to nature of agreement (hire vs. trial purchase). Letter of June 8 merely puts forward appellant's side, no change in use of motor, no misappropriation or conversion.",
      "addresses_issue": "i1",
      "key_observation": "No evidence of appellant doing something to motor he was not entitled to do; use same before and after letter."
    },
    {
      "id": "cr2",
      "text": "s. 405 IPC requires dishonest misappropriation, conversion, use or disposal in violation of legal contract; letter does not show such; no disposal to third party, no change in possession or use.",
      "addresses_issue": "i1",
      "key_observation": "Mere raising civil dispute via letter does not constitute criminal breach of trust."
    },
    {
      "id": "cr3",
      "text": "Not expressing opinion on correctness of either party's case on agreement; emphasis that dispute is civil, no criminal offence on basis of letter.",
      "addresses_issue": "i1",
      "key_observation": "s. 405 contemplates something done with property indicating misappropriation, conversion, or violation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Writing the letter of June 8, 1959 does not amount to dishonest misappropriation, conversion, use or disposal of the motor in violation of s. 405 IPC; no criminal breach of trust under s. 406 IPC.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 405",
        "s. 406"
      ],
      "relevance": "Defines criminal breach of trust; court interprets requirements of dishonest misappropriation, conversion, use or disposal in violation of legal contract."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 417(3)"
      ],
      "relevance": "Basis for respondent's appeal to High Court against acquittal."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, High Court's conviction and order set aside, appellant acquitted of offence under s. 406 IPC. Fine, if paid, to be refunded.",
    "relief_granted": "Acquittal and setting aside of conviction.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the letter of June 8 merely raises a dispute of civil nature between the parties and there is no question of any criminal breach of trust with respect to the motor on the basis of that letter.\"",
      "speaker": "court",
      "significance": "Core holding distinguishing civil dispute from criminal breach of trust."
    },
    {
      "text": "\"Clearly s. 405 contemplates something being done with respect to the property which would indicate either misappropriation or conversion or its use or disposal in violation of the contract, express or implied.\"",
      "speaker": "court",
      "significance": "Interpretation of s. 405 IPC requirements."
    }
  ],
  "_case_id": "1964_157",
  "_label": 1,
  "_text_length": 10467,
  "_extracted_at": "2026-02-10T19:44:49.738771"
}