{
  "metadata": {
    "case_name": "Appellant v. Respondents",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": "Civil Appeal No. 800 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant holds a contract carriage permit granted by Regional Transport Authority, Agra, valid till February 1, 1955, covering the whole Agra region comprising six districts: Mathura, Agra, Aligarh, Etah, Etawah and Mainpuri. No special route or routes indicated; terminals are frontiers of the region.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1955, Government of Uttar Pradesh frames scheme for nationalisation of transport services under S. 3 of U.P. Road Transport Services Development Act, 1955. Scheme struck down by Allahabad High Court on petition of private operators.",
      "type": "procedural",
      "date": "1955",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Motor Vehicles Act, 1939 amended by introduction of Chapter IVA via Motor Vehicles Amendment Act, 1956, effective February 16, 1957.",
      "type": "background",
      "date": "1956-02-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After amendment, State Government reconsiders scheme and takes action under Chapter IVA, s. 68C of Motor Vehicles Act. Scheme removes 56 specified routes from operation of contract carriage permits of private operators in Agra region; State to provide adequate State Road Transport Contract Carriage services on those routes or portions; prohibits other transport services on those routes.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Scheme published in Gazette on October 17, 1959, after overruling objections of private operators.",
      "type": "procedural",
      "date": "1959-10-17",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant and others file Civil Miscellaneous Writ Petition No. 26622 of 1959 objecting to scheme. Allowed on February 1, 1962 by Mr. Justice Oak: scheme set aside and remanded for reconsideration as objections not considered and no reasonable opportunity to produce evidence given to petitioners. Scheme struck down in full but only partially in respect of petitioners; State at liberty to enforce in other respects.",
      "type": "procedural",
      "date": "1962-02-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "After remand, objections considered; Legal Remembrancer passes order on October 18, 1963 reaffirming scheme overruling objections. Change: instead of 'adequate' services, provides for '16 contract carriage services or more or less in accordance with the need from time to time' on the routes or portions.",
      "type": "procedural",
      "date": "1963-10-18",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant files petition in Allahabad High Court challenging scheme; rejected by Mr. Justice Broome on March 17, 1964.",
      "type": "procedural",
      "date": "1964-03-17",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant files special appeal under Letters Patent (Special Appeal No. 27 of 1964); dismissed summarily by High Court on March 30, 1964.",
      "type": "procedural",
      "date": "1964-03-30",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant appeals to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the scheme, purporting to be under s. 68C of Motor Vehicles Act, meets its requirements or is merely unchanged scheme under s. 3 of U.P. Act without satisfying s. 68C preconditions.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether provision of '16 contract carriages or more or less' satisfies requirement of 'adequate' services under s. 68C.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether scheme can validly exclude specific routes from an area-based contract carriage permit held by appellant, or must exclude an area instead.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Scheme purports under s. 68C but is unchanged scheme under s. 3 U.P. Act approved after remands; requirements of s. 68C (efficient, adequate, economical, properly coordinated service in public interest) not borne in mind, unlike s. 3.",
      "supporting_facts": [
        "f2",
        "f4",
        "f6",
        "f7"
      ],
      "legal_basis": "s. 68C Motor Vehicles Act; s. 3 U.P. Road Transport Services Development Act, 1955"
    },
    {
      "id": "pa2",
      "text": "Provision of 16 carriages or more/less does not carry out s. 68C requirement of adequate services; fixing number in advance inadequate; scheme challengeable whenever number less than adequate.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s. 68C Motor Vehicles Act"
    },
    {
      "id": "pa3",
      "text": "Scheme confuses contract carriage permit (for area) with stage carriage (for route); cannot dismember area permit by specifying routes; must specify area for exclusion. Contrary to scheme of permits under Chapter IV MV Act; s. 68G distinguishes areas/routes for compensation.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": "ss. 46, 49, 68G Motor Vehicles Act; Chapter IV Motor Vehicles Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Notification of 56 routes curtails the area of the permit; no breach of Motor Vehicles Act. Distinction between area/route not always preserved; route is an area limited to the route.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": "s. 68C Motor Vehicles Act"
    },
    {
      "id": "ra2",
      "text": "s. 51(2) allows contract carriage permit to be limited to specified route(s); scheme can cut down area by subtracting routes. s. 68B makes Chapter IVA prevail over Chapter IV; s. 68F allows modification of existing permits by curtailing area or route.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": "ss. 51(2), 68B, 68F Motor Vehicles Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Requirements of s. 3 U.P. Act and s. 68C substantially same despite verbiage difference; scheme uses 'adequate' language from s. 68C; power valid under s. 68C.",
      "addresses_issue": "i1",
      "key_observation": "Change in language does not alter underlying intention; requirements basically same."
    },
    {
      "id": "cr2",
      "text": "Provision of 16 carriages (more/less as needed) adequate at present; prior 'adequate' challenged as vague, hence specified; no need to consider future inadequacy.",
      "addresses_issue": "i2",
      "key_observation": "Scheme provides sixteen contract carriages; affirmed not inadequate now."
    },
    {
      "id": "cr3",
      "text": "Contract carriage defined without route picking up; but s. 51(2) allows permit limited to specified routes. Scheme subtracts routes from area effectively; Chapter IVA prevails over Chapter IV per s. 68B; s. 68F allows curtailment of area/route. Precedents confirm route as area.",
      "addresses_issue": "i3",
      "key_observation": "No inconsistency between area and route; taking over routes cuts down area."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Scheme validly framed under s. 68C; meets requirements; routes properly excluded from area permit.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Provision of 16 or more/less carriages satisfies 'adequate' requirement.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Scheme can specify routes to curtail area-based contract carriage permit per s. 51(2), 68B, 68F.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "C.P.C. Motor Services, Mysore v. State of Mysore",
      "citation": "1962 Supp. 1 S.C.R. 717",
      "treatment": "referred",
      "relevance": "Explains 'route' and 'area' under MV Act as sometimes interchangeable."
    },
    {
      "case_name": "Kondala Rao v. A.P. State Road Transport Corpn.",
      "citation": "A.I.R. 1961 S.C. 82",
      "treatment": "referred",
      "relevance": "Similar view on 'route' and 'area'."
    },
    {
      "case_name": "Dosa Satyanarayanamurty v. Andhra Pradesh State Road Transport Corporation",
      "citation": "1961 1 S.C.R. 642",
      "treatment": "followed",
      "relevance": "Under s. 68C, scheme for route is area limited to route; no inconsistency."
    }
  ],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act, 1939",
      "sections": [
        "s. 68C",
        "s. 68B",
        "s. 68F",
        "s. 68G",
        "s. 51(2)",
        "s. 46",
        "s. 49",
        "Chapter IV",
        "Chapter IVA"
      ],
      "relevance": "Governs framing, publication, and effect of nationalisation scheme; prevails over permit provisions; allows route specification for contract carriages and curtailment."
    },
    {
      "name": "U.P. Road Transport Services Development Act, 1955",
      "sections": [
        "s. 3"
      ],
      "relevance": "Original basis for scheme; requirements substantially same as s. 68C MV Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against Allahabad High Court order dismissing challenge to nationalisation scheme held without merit; scheme validly excludes 56 routes from appellant's Agra region contract carriage permit.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The change in language is no doubt there but the intention underlying the words is the same and even if the exact words of s. 68C might not have been present before the framers of the scheme, it is quite obvious that they took into account those very factors.\"",
      "speaker": "court",
      "significance": "Rejects argument that scheme fails s. 68C requirements."
    },
    {
      "text": "\"By the taking over of the routes the area is as effectively cut down as when an area is included in the permit but routes are indicated on which alone the contract carriages can ply.\"",
      "speaker": "court",
      "significance": "Core holding on validity of route exclusion from area permit."
    },
    {
      "text": "\"Under s. 68C of the Act the scheme may be framed in respect of any area or a route or a portion of any area or a portion of a route.\" (Subba Rao J.)",
      "speaker": "court",
      "significance": "Cited to affirm route as valid basis for scheme."
    }
  ],
  "_case_id": "1964_306",
  "_label": 0,
  "_text_length": 16281,
  "_extracted_at": "2026-02-10T19:46:19.088782"
}