{
  "metadata": {
    "case_name": "Brij Mohan Singh v. Priya Brat Narain Sinha",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Dass Gupta, J."
    ],
    "case_number": "Civil Appeal No. 9 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant Brij Mohan Singh and the respondent Priya Brat Narain Sinha were among the candidates who contested the Aurangabad Constituency seat for the Bihar Legislative Assembly at the General Election held in 1962.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The polling took place on February 21, 1962.",
      "type": "procedural",
      "date": "1962-02-21",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellant received a majority of votes and was declared elected.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The respondent Priya Brat Narain Sinha, who was the sitting member, was defeated.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On April 9, 1962, the respondent filed a petition challenging the validity of the appellant's election, praying for a declaration that the election of the appellant be declared void and that the respondent be declared to have been duly elected to the Bihar Legislative Assembly from the Aurangabad Constituency.",
      "type": "procedural",
      "date": "1962-04-09",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Grounds of challenge: (1) The appellant was born on October 15, 1937 and was thus under 25 years of age on the date of filing the nomination papers and therefore disqualified under Art. 173 of the Constitution from being a member of the Bihar Legislative Assembly; (2) He held subsisting contracts under the Bihar Government in his individual and personal capacity and was thus disqualified under s. 7(d) of the Representation of the People Act; (3) The appellant, and with his consent, his party-men Rameshwar Prasad Singh and others were directly responsible for publication and distribution of copies of leaflets containing direct insinuations and aspersions against the respondent's personal character, these being false to the knowledge of the appellant.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "The Election Tribunal held on a consideration of the oral and documentary evidence produced before it that none of these or the other grounds on which the validity of the election was challenged had been established and accordingly dismissed the petition.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "On appeal in Election Appeal No. 2 of 1963, the Patna High Court by judgment and order dated September 9, 1964 set aside the judgment and order of the Election Tribunal and made an order setting aside the election of the appellant Brij Mohan Singh to the Bihar Legislative Assembly, but refused the respondent's prayer to be declared duly elected.",
      "type": "procedural",
      "date": "1964-09-09",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The present appeal has been preferred on a certificate granted by the High Court under Art. 133(1)(b) of the Constitution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The High Court agreed with the Election Tribunal that the allegation that the appellant held a contract under the Government in his personal capacity had not been established.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The High Court held that the appellant was below the age of 25 years on the date of filing the nomination and was therefore not qualified to be a candidate for the Bihar Legislative Assembly.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The High Court held that the appellant had published a leaflet Ex. 10 containing attacks upon the personal character of the respondent and was thus guilty of a corrupt practice within the meaning of s. 123(4) of the Representation of the People Act.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "The findings of the High Court on the question of age and also on the question of publication of the document Ex. 10 have been challenged before the Supreme Court.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "It was urged that in any case the pamphlet Ex. 10 did not amount to an attack on the personal character of the respondent.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "On examination of the physical appearance of the hathchitha and the entries made therein, the evidence of the Chowkidar and the circumstances under which this document was ultimately produced before the Tribunal, the Supreme Court inclined to agree with the view of the Election Tribunal that this is a genuine document which was maintained by the Chowkidar in the discharge of his official duty.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The entry in the hathchitha showing the birth of a son to Sarjoo Singh on October 15, 1935.",
      "type": "material",
      "date": "1935-10-15",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The Chowkidar was illiterate and did not make the entry himself; it was made by somebody else at his request.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "The Chowkidar refused to produce the document readily when summoned, requiring a warrant of arrest.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant was below 25 years of age on the date of filing the nomination papers and therefore disqualified under Article 173 of the Constitution.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether the appellant held subsisting contracts under the Bihar Government in his personal capacity disqualifying him under s. 7(d) of the Representation of the People Act.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether the appellant published leaflet Ex. 10 containing attacks upon the personal character of the respondent amounting to corrupt practice under s. 123(4) of the Representation of the People Act.",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether an entry made in an official record maintained by an illiterate public servant by somebody else at his request is relevant under s. 35 of the Evidence Act.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The findings of the High Court on the question of age and publication of Ex. 10 are incorrect.",
      "supporting_facts": [
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The pamphlet Ex. 10 did not amount to an attack on the personal character of the respondent.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "s. 123(4) Representation of the People Act"
    },
    {
      "id": "pa3",
      "text": "When an illiterate public servant is unable to make an entry himself and gets the entry made by somebody else, this should be treated as an entry made by the public servant.",
      "supporting_facts": [
        "f17"
      ],
      "legal_basis": "s. 35 Evidence Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant born October 15, 1937, under 25 on nomination date, disqualified under Art. 173 Constitution.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Art. 173 Constitution"
    },
    {
      "id": "ra2",
      "text": "Appellant held subsisting contracts under Bihar Government in personal capacity, disqualified under s. 7(d) Representation of the People Act.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s. 7(d) Representation of the People Act"
    },
    {
      "id": "ra3",
      "text": "Appellant with consent responsible for publication and distribution of leaflets containing insinuations against respondent's personal character, false to knowledge, corrupt practice.",
      "supporting_facts": [
        "f6",
        "f12"
      ],
      "legal_basis": "s. 123(4) Representation of the People Act"
    },
    {
      "id": "ra4",
      "text": "The omission of the Chowkidar to produce the document and issue of warrant were pre-arranged to create atmosphere for acceptance as genuine.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "After considering the evidence his Lordship concluded that it was not proved that the appellant had committed any corrupt practice or that he was below twenty-five years on the date of filing of nomination papers.",
      "addresses_issue": "i3",
      "key_observation": "Not proved corrupt practice or under age."
    },
    {
      "id": "cr2",
      "text": "On examination of the physical appearance on the hathchitha and the entries made therein, the evidence of the Chowkidar and the circumstances under which this document was ultimately produced before the Tribunal, inclined to agree with the Election Tribunal that this is a genuine document maintained by the Chowkidar in discharge of official duty.",
      "addresses_issue": "i1",
      "key_observation": "Hathchitha document is genuine."
    },
    {
      "id": "cr3",
      "text": "If the document had been manufactured to assist the appellant, unlikely Chowkidar would refuse to produce it readily; warrant of arrest convincing that unwilling.",
      "addresses_issue": "i1",
      "key_observation": "Circumstances support genuineness."
    },
    {
      "id": "cr4",
      "text": "Not impressed by argument that omission to produce and warrant were pre-arranged; appellant's lawyers could not be sure Tribunal would issue warrant.",
      "addresses_issue": "i1",
      "key_observation": "Pre-arrangement argument rejected."
    },
    {
      "id": "cr5",
      "text": "The entry showing birth on October 15, 1935 can be of no assistance unless admissible under Evidence Act.",
      "addresses_issue": "i1",
      "key_observation": "Admissibility key."
    },
    {
      "id": "cr6",
      "text": "If entry made by Chowkidar himself, relevant under s. 35 Evidence Act; but Chowkidar did not make it.",
      "addresses_issue": "i4",
      "key_observation": "Entry not made by public servant himself."
    },
    {
      "id": "cr7",
      "text": "Argument that illiterate public servant getting entry made by somebody else should be treated as made by public servant rejected; probability of true recording high only if made by public servant himself; reduced if depends on somebody else.",
      "addresses_issue": "i4",
      "key_observation": "Reduced probability due to illiteracy."
    },
    {
      "id": "cr8",
      "text": "High Court right in holding that entry made in official record by illiterate Chowkidar by somebody else at his request does not come within s. 35 Evidence Act.",
      "addresses_issue": "i1",
      "key_observation": "Entry inadmissible."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "It was not proved that the appellant was below twenty-five years on the date of filing of nomination papers.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "It was not proved that the appellant had committed any corrupt practice.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Entry made in an official record maintained by illiterate Chowkidar by somebody else at his request does not come within s. 35 of the Evidence Act.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Allegation of holding contract under Government in personal capacity not established.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 173",
        "Art. 133(1)(b)"
      ],
      "relevance": "Art. 173 for age qualification of 25 years for Legislative Assembly member; Art. 133(1)(b) for certificate for appeal."
    },
    {
      "name": "Representation of the People Act",
      "sections": [
        "s. 7(d)",
        "s. 123(4)"
      ],
      "relevance": "s. 7(d) for disqualification due to government contracts; s. 123(4) for corrupt practice of attacks on personal character."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "s. 35"
      ],
      "relevance": "Relevance of entries in official records made by public servants."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court considered the challenge to the High Court's findings on age and corrupt practice, held the hathchitha entry inadmissible under s. 35 Evidence Act but concluded it was not proved that appellant was below 25 or committed corrupt practice, thereby upholding the election against the High Court's order setting it aside.",
    "relief_granted": "Appeal allowed; High Court order setting aside election set aside.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "After considering the evidence his Lordship concluded that it was not proved that the appellant had committed any corrupt practice or that he was below twenty- five years on the date of filing of nomination papers.",
      "speaker": "court",
      "significance": "Core finding reversing High Court on key grounds."
    },
    {
      "text": "We have therefore come to the conclusion that the High Court is right in holding that the entry made in an official record maintained by the illiterate Chowkidar, by somebody else at his request does not come within s. 35 of the Evidence Act.",
      "speaker": "court",
      "significance": "Holding on admissibility of age proof evidence."
    },
    {
      "text": "The reason why an entry made by a public servant in a public or other official book, register, or record stating a fact in issue or a relevant fact has been made relevant is that when a public servant makes it himself in the discharge of his official duty, the probability of its being truly and correctly recorded is high.",
      "speaker": "court",
      "significance": "Explanation for rejecting extended application of s. 35 to illiterate public servant."
    }
  ],
  "_case_id": "1964_91",
  "_label": 1,
  "_text_length": 7141,
  "_extracted_at": "2026-02-10T19:43:43.525533"
}