{
  "metadata": {
    "case_name": "Commissioner of Income-tax (Appellant) v. K. H. Chambers (Respondent)",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Civil Appeal No. 1106 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "One G. A. Chambers was carrying on two businesses, one in the name and style of Chambers Co. concerned with export of hides, skins and mica, insurance and shipping brokerage, assessed under the Indian Income-tax Act, 1918.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In or about 1931 G. A. Chambers handed over the management of Chambers Co. to his son, K. H. Chambers.",
      "type": "background",
      "date": "1931",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Towards the end of 1932 G. A. Chambers transferred the business of Chambers Co. to his son K. H. Chambers.",
      "type": "disputed",
      "date": "1932-11",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "K. H. Chambers carried on the business in his own name till January 1, 1948, when the business was taken over by a limited company.",
      "type": "admitted",
      "date": "1948-01-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "For the assessment year 1948-49 K. H. Chambers claimed relief under s. 25(4) of the Indian Income-tax Act on the ground that the business had been assessed under the old Act of 1918 when carried on by his father, and father transferred to him end of 1932.",
      "type": "procedural",
      "date": "1948-49",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Income-tax Officer by order dated March 18, 1949 held K. H. Chambers did not take over the business of his father as a whole running concern, no relief u/s 25(4).",
      "type": "procedural",
      "date": "1949-03-18",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellate Assistant Commissioner agreed with ITO that business by K.H. Chambers was not the same as originally assessed under 1918 Act.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Income-tax Appellate Tribunal held identity of business lost, no succession, referred question to Madras High Court u/s 66(1): Whether Tribunal right in refusing relief u/s 25(4).",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Madras High Court answered question in negative in favour of assessee: son succeeded to business after November 1932, succession u/s 25(4). Judgment dated December 21, 1960.",
      "type": "procedural",
      "date": "1960-12-21",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "In July 1932, before son left for foreign countries, G. A. Chambers wrote letter dated July 7, 1932 suggesting winding up Chambers Co. unless further investment, offered goodwill.",
      "type": "material",
      "date": "1932-07-07",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Son replied July 8, 1932 preferring to start afresh in own name or Chambers Co., smaller place/staff, use private codes.",
      "type": "material",
      "date": "1932-07-08",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On December 5, 1932, G.A. Chambers asked auditors to close accounts of Chambers Co. upto November 30, 1932, transfer accounts; from December 1, 1932, K. H. Chambers running export business separately in own name.",
      "type": "material",
      "date": "1932-12-01",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Auditors prepared balance-sheet: G.A. Chambers given assets Rs. 5,67,485-10-2, liabilities Rs. 5,95,433-12-3; K.H. Chambers assets Rs. 55,214-2-3, liabilities Rs. 27,266-0-2 (including difference for father). Father took liabilities/assets to discharge them, son got stock/debts.",
      "type": "material",
      "date": "1932-11-30",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "After allotment, K. H. Chambers continued same lines of business, took over constituents, same premises, telephone, Post Box, private codes, trade marks, important staff.",
      "type": "admitted",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On May 23, 1933, G. A. Chambers wrote to Liverpool and London and Globe Insurance Co. transferring export business to K.H. Chambers at his risk; father used good offices to transfer agency.",
      "type": "material",
      "date": "1933-05-23",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "K. H. Chambers invested Rs. 40,000 prior to July 1932, managed business running at loss.",
      "type": "background",
      "date": "1932-07",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there was succession to the whole of the business within the meaning of s. 25(4) of the Indian Income-tax Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the question referred by the Tribunal to the High Court was a pure question of fact, depriving High Court of jurisdiction.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The question referred was pure question of fact, High Court had no jurisdiction.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Where transferor retains goodwill and most assets, transferee carries on with part assets, no succession to whole business u/s 25(4).",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "s. 25(4) Indian Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Son succeeded to father's business after November 1932, entitled to relief u/s 25(4).",
      "supporting_facts": [
        "f3",
        "f12",
        "f14"
      ],
      "legal_basis": "s. 25(4) Indian Income-tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "From documents and admissions: father conducted two businesses; son invested Rs.40,000, managed export business at loss; father suggested alternatives but son continued independently; changeover after audit, father took liabilities/assets to discharge debts, son took stock/debts; son continued same business, premises, codes, staff, name advantages transferred.",
      "addresses_issue": "i1",
      "key_observation": "Father retained assets not to continue business but to help son unburdened by debts."
    },
    {
      "id": "cr2",
      "text": "Succession involves change of ownership, transfer of whole business, preserving identity and continuity; arrangement re assets/liabilities to enable transferee to run unhampered does not detract from totality of succession.",
      "addresses_issue": "i1",
      "key_observation": "Whole export business transferred, identity preserved, continuity maintained."
    },
    {
      "id": "cr3",
      "text": "Whether succession u/s 25(4) is mixed question of law and fact: tests of change of ownership, integrity, identity, continuity must be applied; if Tribunal's finding does not satisfy tests, open to review.",
      "addresses_issue": "i2",
      "key_observation": "High Court had jurisdiction as question arose from Tribunal's order."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "There was succession to the business within meaning of s. 25(4); assessee entitled to relief.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Question of succession u/s 25(4) is mixed question of law and fact; High Court had jurisdiction to review Tribunal's finding.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Reynolds, Sons & Co., Ltd. v. Ogston (H.M. Inspector of Taxes)",
      "citation": "1929 15 T.C. 501",
      "treatment": "followed",
      "relevance": "Tests for succession: close identity between former and present proprietorship."
    },
    {
      "case_name": "Commissioner of Income-tax, Burma v. N.N. Firm",
      "citation": "1934 2 I.T.R. 85",
      "treatment": "followed",
      "relevance": "Succeeded means taking over business as a whole."
    },
    {
      "case_name": "Commissioner of Income-tax, Burma v. A.L.V.R.P. Firm",
      "citation": "1940 8 I.T.R. 531",
      "treatment": "followed",
      "relevance": "Reiterated succession to business as a whole."
    },
    {
      "case_name": "Jittanram Nirmalram v. Commissioner of Income-tax, Bihar and Orissa",
      "citation": "1953 23 I.T.R. 288",
      "treatment": "followed",
      "relevance": "Substantial identity or similarity in nature and extent of activities sufficient; not mathematical sameness."
    },
    {
      "case_name": "Malayalam Plantations, Ltd. v. Clark (H.M. Inspector of Taxes)",
      "citation": "1935 19 T.C. 314",
      "treatment": "followed",
      "relevance": "Taking over as going concern with growing things, coolies; omission of some assets not preventing succession."
    },
    {
      "case_name": "Meenakshi Mills, Madurai v. Commissioner of Income-tax, Madras",
      "citation": "1956 S.C.R. 691",
      "treatment": "followed",
      "relevance": "Ultimate finding involving application of law is mixed question; pure fact inferences not reviewable unless perverse."
    },
    {
      "case_name": "Bell (Surveyor of Taxes) v. National Provincial Bank of England, Ltd.",
      "citation": "1903 5 T.C. 1",
      "treatment": "referred",
      "relevance": "Finding of no succession within rule is question of law/construction, not pure fact."
    },
    {
      "case_name": "Wilson and Barlow v. Chibbett (H.M. Inspector of Taxes)",
      "citation": "1929 14 T.C. 407",
      "treatment": "referred",
      "relevance": "Succession primary fact but Commissioners may err in law; if correct tests not applied, reviewable."
    },
    {
      "case_name": "Briton Ferry Steel Co., Ltd. v. Barry",
      "citation": "1940 1 K.B. 463",
      "treatment": "referred",
      "relevance": "Tests for succession: similar trade, goodwill, staff, stock/debts, no interval."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 25(4)",
        "s. 66(1)"
      ],
      "relevance": "Relief on succession to business previously assessed under prior Act; reference to High Court."
    },
    {
      "name": "Indian Income-tax Act, 1918",
      "sections": [],
      "relevance": "Business previously assessed under this Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Madras High Court's decision that there was succession to the business within s. 25(4), entitling the assessee to relief; appeal by Revenue dismissed.",
    "relief_granted": "Relief under s. 25(4) confirmed for assessee.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Succession involves change of ownership that is, the transferor goes out and the transferee comes in; it connotes that the whole business is transferred it also implies that substantially the identity and the continuity of the business are preserved.\"",
      "speaker": "court",
      "significance": "Defines key elements of succession under s. 25(4)."
    },
    {
      "text": "\"If there is a transfer of a business, any arrangement between the transferor and the transferee in respect of some of the assets and liabilities not with a view to enable the transferor to run a part of the business transferred but to enable the transferee to run the business unhampered by the load of debts... cannot detract from the totality of succession.\"",
      "speaker": "court",
      "significance": "Explains why retention of assets by father did not break succession."
    },
    {
      "text": "\"The tests crystallized by decisions have given a legal content to the expression succession within the meaning of S. 25(4) of the Act and whether facts proved satisfy those tests is a mixed question of law and fact.\"",
      "speaker": "court",
      "significance": "Holds question reviewable by High Court."
    }
  ],
  "_case_id": "1964_147",
  "_label": 0,
  "_text_length": 21579,
  "_extracted_at": "2026-02-10T19:44:49.970426"
}