{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. Amrutanjan Ltd.",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "SHAH, J."
    ],
    "case_number": "Civil Appeals Nos. 521-523 of 1963",
    "date_of_judgment": "1964-04-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Nageswara Rao Panthulu set up a business of manufacturing a pain-balm marketed in the trade-name of Amrutanjan.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In September 1936 the respondent company was floated as a public limited company under the Indian Companies Act, 1913, to acquire and carry on the business of manufacture and sale of Amrutanjan.",
      "type": "background",
      "date": "1936-09",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Authorised capital of the company was 7,000 ordinary shares and 3,000 preference shares of Rs. 100 each; issued and paid-up capital was 2,500 ordinary and 3,000 preference shares.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Preference shareholders entitled to a fixed dividend of 7% on the face value of the shares, with right in the balance of the profits.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondent company took over the business conducted by Nageswara Rao Panthulu for Rs. 5,50,000 paid in the form of 2,500 ordinary and 3,000 preference fully paid-up shares.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Company managed by a firm which after death of Nageswara Rao Panthulu consisted of Ramayamma (widow), Kamakshamma (daughter), Ramchandra Rao (Ramayamma's brother) and Sambu Prasad (Kamakshamma's husband).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Between April 1, 1946 to March 31, 1949 Ramayamma held 2,185 ordinary shares and Kamakshamma held 250 ordinary shares.",
      "type": "material",
      "date": "1946-04-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Out of preference shares only 385 held by directors including Ramayamma and Kamakshamma.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Under Articles of Association, both preference and ordinary shareholders entitled to vote at company meetings, one vote per share.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "For years ending March 31, 1947, 1948, 1949, company declared total dividend of Rs. 38,750 each year (7.5% on preference, 6% on ordinary), less than 60% of amount available under s.23A.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Income-tax Officer served notice after approval of Inspecting Assistant Commissioner, ordered on March 31, 1953 under s.23A that undistributed portion deemed distributed as dividend.",
      "type": "procedural",
      "date": "1953-03-31",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Order confirmed by Appellate Assistant Commissioner and Income-tax Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Several contentions raised before Revenue authorities and Tribunal challenging competence of ITO under s.23A including unconstitutionality, negatived by Tribunal and High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Tribunal referred three questions to Madras High Court under s.66(1); third question: Whether provisions of s.23A correctly applied for the three years?",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "High Court held respondent company one in which public substantially interested, ITO no jurisdiction under s.23A, answered question negatively.",
      "type": "procedural",
      "date": "1960-04-05",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "No investigation by Income-tax Department whether group controlling the company.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Ramayamma holding 87.40% of ordinary shares.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Total voting power 5,500 (one vote per share, ordinary and preference); 25% is 1,375.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the provisions of s. 23-A were correctly applied for the three relevant years?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the respondent company is one in which the public are substantially interested, so as to exclude application of s.23A?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Explanation to s.23A(1) defines company in which public substantially interested; respondent not such a company due to controlling interest.",
      "supporting_facts": [
        "f7",
        "f8",
        "f17"
      ],
      "legal_basis": "s.23A Explanation"
    },
    {
      "id": "pa2",
      "text": "Distinction between controlling group and public not along directors vs members; directors not in controlling group count as public.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.23A Explanation"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Company is one in which public substantially interested.",
      "supporting_facts": [],
      "legal_basis": "s.23A proviso and Explanation"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S.23A enacted to prevent avoidance of super-tax by controlling shareholders not distributing dividends; does not apply to companies where public substantially interested.",
      "addresses_issue": "i1",
      "key_observation": "Object to foil accumulation of profits to avoid super-tax."
    },
    {
      "id": "cr2",
      "text": "Explanation raises presumption, not definition: if shares (not fixed dividend) carrying not less than 25% voting power held by public, presumed public substantially interested.",
      "addresses_issue": "i2",
      "key_observation": "Fixed dividend shares excluded from 25% computation."
    },
    {
      "id": "cr3",
      "text": "Total voting power includes all shares; 25% of 5500 is 1375, but must be ordinary shares held by public outside controlling group; here Ramayamma holds 87.4% ordinary, no 25% public ordinary shares shown.",
      "addresses_issue": "i2",
      "key_observation": "Explanation has no operation as presumption not invoked."
    },
    {
      "id": "cr4",
      "text": "No investigation whether controlling group exists to bring within third proviso; question of fact not decided by Tribunal.",
      "addresses_issue": "i2",
      "key_observation": "Cannot decide controlling interest without findings."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court interpretation of Explanation incorrect; no presumption arises under Explanation.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    },
    {
      "id": "h2",
      "text": "Revenue made no investigation on controlling interest; cannot decide if company one where public not substantially interested.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 23A",
        "s. 66(1)"
      ],
      "relevance": "Core provision for deeming undistributed income as dividend; proviso excludes companies where public substantially interested; Explanation raises presumption if 25% voting power (excluding fixed dividend shares) held by public."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [],
      "relevance": "Company incorporated under this Act; Articles govern voting rights."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals dismissed as High Court order affirmed on different grounds: Explanation inapplicable, no Revenue finding on controlling interest; cannot decide issue.",
    "relief_granted": "None; High Court order continued.",
    "costs": "With costs."
  },
  "key_quotes": [
    {
      "text": "The Explanation had no application, because no presumption on the facts found could arise thereunder.",
      "speaker": "court",
      "significance": "Core reason Explanation not triggered."
    },
    {
      "text": "Whether in fact there exists such a controlling interest in the hands of one shareholder or a group of shareholders as would render the company one in which the public are not substantially interested is a question which therefore cannot be decided by this Court.",
      "speaker": "court",
      "significance": "Explains why appeals dismissed despite HC error."
    }
  ],
  "_case_id": "1964_225",
  "_label": 0,
  "_text_length": 15611,
  "_extracted_at": "2026-02-10T19:45:32.724290"
}