{
  "metadata": {
    "case_name": "Champaran Cane Concern v. State of Bihar",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "K. Das J."
    ],
    "case_number": "Civil Appeals Nos. 537, 538 and 539 of 1962",
    "date_of_judgment": "1963-04-09"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Champaran Cane Concern assessed to agricultural income-tax under Bihar Agricultural Income-tax Act (Bihar Act 32 of 1948) by Agricultural Income-tax Officer, Motihari for years 1356 F, 1357 F, 1358 F corresponding to 1948-49, 1950-51, 1951-52.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Assessee claimed to be a company-ownership concern belonging to Padampat Singhania (Re. 0-4-0 share) and Lala Bishundayal Jhunjhunwala (Re. 0-12-0 share), residents of Uttar Pradesh.",
      "type": "background",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f3",
      "text": "Concern carried on agricultural operations on six farms consisting of over 2000 acres, of which about 1600 acres purchased jointly by two owners and 483 acres purchased in name of Motilal Padampat Sugar Mill owned by them; later separated by mill resolution and cultivated entirely by concern.",
      "type": "material",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f4",
      "text": "Two owners appointed S.K. Kanodia as common manager for facility of cultivation and management; he looked after and managed agricultural operations during relevant years.",
      "type": "material",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f5",
      "text": "Lands undivided between owners; total net profits from joint cultivation divided between two owners in proportion to shares.",
      "type": "material",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f6",
      "text": "Assessed as partnership firm despite claim; plea that s.13 applies and common manager should be assessed for each owner's share rejected by Income-tax Officer.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appeals to Deputy Commissioner of Agricultural Income-tax dismissed with modifications.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Revisions to Board of Revenue; Board reduced assessment under Schedule C but rejected s.13 plea.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Assessee applied to Board for reference to High Court on question assuming partnership; Board refused.",
      "type": "procedural",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f10",
      "text": "Patna High Court under s.28(3) called reference on question: whether common manager should be assessed under s.13 for persons jointly liable.",
      "type": "procedural",
      "date": "1959-09-29",
      "source": "high_court"
    },
    {
      "id": "f11",
      "text": "Board submitted statement reverting to old question; High Court answered its framed question against assessee, holding it a partnership firm as question of fact.",
      "type": "procedural",
      "date": "1959-09-29",
      "source": "high_court"
    },
    {
      "id": "f12",
      "text": "Special leave obtained; appeals to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Returns filed indicated status as company-ownership concern, with manager's name; printed form had 'firm' uncut as no tenancy-in-common option.",
      "type": "material",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f14",
      "text": "Deputy Commissioner finding: two owners appointed Kanodia as common manager; no definite shares by metes and bounds; profits distributed per shares.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances, the common manager should be assessed under section 13 of the Bihar Agricultural Income-tax Act in respect of the agricultural income-tax payable by the persons jointly liable?",
      "framed_by": "high_court"
    },
    {
      "id": "i2",
      "text": "Whether the assessee was a partnership firm within the meaning of the Indian Partnership Act, 1932 or a company-ownership concern (tenancy-in-common)?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Assessee is company-ownership concern (tenancy-in-common) of two persons; common manager appointed under agreement holds land on behalf of jointly interested persons; s.13 applies even if partnership (later conceded not arguable).",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f5",
        "f13",
        "f14"
      ],
      "legal_basis": "Bihar Agricultural Income-tax Act s.13; Indian Partnership Act 1932"
    },
    {
      "id": "pa2",
      "text": "No agreement to share profits of business; no agency between owners; profits divided per ownership shares without implying partnership; question mixed fact and law.",
      "supporting_facts": [
        "f4",
        "f5",
        "f14"
      ],
      "legal_basis": "Indian Partnership Act s.4; Lindley on Partnership"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Assessee is partnership firm; facts allow inference of partnership; High Court right on question of fact.",
      "supporting_facts": [
        "f11",
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Concedes s.13 applies if company-ownership concern.",
      "supporting_facts": [],
      "legal_basis": "Bihar Agricultural Income-tax Act s.13"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Income from agricultural land not disputed; definitions of 'firm' and 'person' in s.2; charging s.3 applies to firm as unit.",
      "addresses_issue": "i1",
      "key_observation": "S.13 applies to common manager holding land for jointly interested persons, not partnerships."
    },
    {
      "id": "cr2",
      "text": "Narrow issue: partnership or company-ownership? Mixed question of fact/law; authorities must apply correct principles.",
      "addresses_issue": "i2",
      "key_observation": "No evidence of partnership agreement, mutual agency, or community of profit/loss implying business partnership."
    },
    {
      "id": "cr3",
      "text": "Facts consistent with tenancy-in-common: joint appointment of manager, undivided lands, profit share per ownership; name neutral; returns indicate ownership concern.",
      "addresses_issue": "i2",
      "key_observation": "High Court erred; no facts compel partnership inference."
    },
    {
      "id": "cr4",
      "text": "Distinctions: ownership not from agreement; no necessary community of profit/loss; no transfer restrictions evident; no agency.",
      "addresses_issue": "i2",
      "key_observation": "Cited Lindley on Partnership differences."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Assessee is company-ownership concern (tenancy-in-common), not partnership firm; common manager to be assessed under s.13.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court answer to referred question incorrect.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Morden Rigg Co. and R. B. Eskrigge Co. Monks",
      "citation": "1923 8 T.C. 450, 464",
      "treatment": "followed",
      "relevance": "Partnership or non-partnership is mixed question of fact and law if wrong legal principle applied."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bihar Agricultural Income-tax Act (Bihar Act 32 of 1948)",
      "sections": [
        "s.2 (definitions of agricultural income, firm, person)",
        "s.3 (charging section)",
        "s.13 (assessment on common manager)",
        "s.28(3) (reference to High Court)"
      ],
      "relevance": "Governs assessment; s.13 applies to common manager for jointly interested persons in land, not firms."
    },
    {
      "name": "Indian Partnership Act, 1932",
      "sections": [
        "s.4 (definition of partnership)"
      ],
      "relevance": "Firm has same meaning; requires agreement to share business profits; distinguishes from tenancy-in-common."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s.3"
      ],
      "relevance": "Similar charging provision compared for firms."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; judgment and orders of Patna High Court dated September 29, 1959 set aside; question answered in favour of assessee holding common manager assessable under s.13.",
    "relief_granted": "Assessments to be made on common manager under s.13",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "partnership or non-partnership is ordinarily a question of fact, but ... it is a mixed question of fact and law in the sense that if the authorities ... apply a wrong principle of law ... their finding of fact is not conclusive",
      "speaker": "court",
      "significance": "Establishes reviewability of partnership finding."
    },
    {
      "text": "the facts and circumstances found by the taxing authorities were all consistent with the claim of the assessee that it was a tenancy-in-common concern the common manager whereof was liable to assessment under s.13 of the Act.",
      "speaker": "court",
      "significance": "Core holding on nature of assessee."
    }
  ],
  "_case_id": "1964_35",
  "_label": 1,
  "_text_length": 18964,
  "_extracted_at": "2026-02-10T19:43:28.239192"
}