{
  "metadata": {
    "case_name": "Municipal Council, Khurai v. Assessees",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Civil Appeal No. 974 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On December 28, 1962 the Municipal Council by a resolution, appointed a Sub-Committee consisting of the Vice-President and two Members for hearing objections under S. 138(2) of the Act against the new assessment which the Chief Municipal Officer would propose to make.",
      "type": "procedural",
      "date": "1962-12-28",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On December 30, 1962 the Chief Municipal Officer was directed to prepare the assessment lists for all the 11 wards into which the municipal area has been divided.",
      "type": "procedural",
      "date": "1962-12-30",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Up till then taxes were levied at the rate of Rs. 7-12-0 per cent. on the annual letting value of the house properties and building sites liable to be taxed.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On March 3, 1963 the Council considered a proposal for introducing a slab system for assessing these properties. Upon that one of the members, Smt. Poonabai suggested a modification of the office proposal and her suggestion was accepted by the majority of the members of the Council.",
      "type": "material",
      "date": "1963-03-03",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On March 6, 1963 the assessment list prepared by the Chief Municipal Officer in pursuance of the resolution was authenticated by him. It was then duly published that day under s. 136 of the Act. Objections were also invited from the assessees.",
      "type": "procedural",
      "date": "1963-03-06",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "About 2,200 objections were lodged which were considered by the Sub-Committee between April 7, 1963 and April 14, 1963.",
      "type": "procedural",
      "date": "1963-04-07 to 1963-04-14",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "A suit had been instituted by some of the assessees in which the validity of the resolution of March 3, 1963 varying the rate of tax and seeking a permanent injunction against the Committee restraining it from giving effect to the new basis of assessment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On April 28, 1963 the resolution of March 3, 1963 was revoked and the old rate of assessment was reverted to.",
      "type": "material",
      "date": "1963-04-28",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Numerous complaints were made by assessees to the effect that the Sub-Committee had shown partiality in dealing with objections to assessments and had in fact shown favour to rich persons. The President of the Council enquired into the complaints and was satisfied that there was substance in them.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Pursuant to a decision of the Sub-Committee dated August 21, 1963 the assessment list as revised by the Sub-Committee was authenticated by the Chief Municipal Officer as required by s. 140 of the Act and was published on August 30, 1963.",
      "type": "procedural",
      "date": "1963-08-21 and 1963-08-30",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Notices of demand were also issued against the assessees on the basis of the revised list.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The President had intimated to the Collector that the Sub-Committee had shown partiality, particularly to rich assessees and invited him to suspend the revised list in exercise of his supervisory powers.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On October 9, 1963 the Collector made an order suspending the execution of the decision of the Sub-Committee under section 323 of the M.P. Municipalities Act, 1961, stating it was not in conformity with the law, detrimental to the interest of the Council and causing annoyance to the public. The decision shall remain suspended until the assessment is properly revised afresh.",
      "type": "procedural",
      "date": "1963-10-09",
      "source": "collector"
    },
    {
      "id": "f14",
      "text": "The Collector forwarded a copy of the order to the Government of Madhya Pradesh and requested that his Order may be confirmed under s. 323(2) of the Act. He also called upon the Council to show cause for its failure under section 327(1).",
      "type": "procedural",
      "date": "1963-10-09",
      "source": "collector"
    },
    {
      "id": "f15",
      "text": "After receiving this communication the President caused a proclamation to be made bringing it to the notice of the assessees that the assessment list had been suspended and intimating to them that taxes on the basis of the revised list should not be paid.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "On December 2, 1963 the Government issued notice to the Council under s. 323(2) to show cause why the order passed by the Collector should not be confirmed. Eventually the Government confirmed the Collector's Order.",
      "type": "procedural",
      "date": "1963-12-02",
      "source": "government"
    },
    {
      "id": "f17",
      "text": "On December 29, 1963 the Council, at a special meeting, resolved that the assessment lists should be revised under s. 141 of the Act.",
      "type": "procedural",
      "date": "1963-12-29",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "On January 7, 1964 the Council issued individual notices to 300 persons to show cause why the annual letting value of their properties should not be enhanced.",
      "type": "procedural",
      "date": "1964-01-07",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "The Council heard the objections between February 16, 1964 and February 20, 1964 and revised the assessments of some or all the persons to whom notices had been issued.",
      "type": "procedural",
      "date": "1964-02-16 to 1964-02-20",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "On February 24, 1964 the Council, at a special meeting, confirmed the revised assessment as from April 1, 1963.",
      "type": "material",
      "date": "1964-02-24",
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Its resolution was authenticated on March 4, 1964 under s. 140(1) by the Chief Municipal Officer and according to the Council the assessment list then became final.",
      "type": "procedural",
      "date": "1964-03-04",
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Writ petition presented before the High Court by some of the assessees challenging the assessment list.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f23",
      "text": "High Court judgment and order dated September 10, 1964 in Misc. Petition No. 113 of 1964 quashing the assessment list on the ground that notice was given only to 300 assessees and not the remaining 1900.",
      "type": "procedural",
      "date": "1964-09-10",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the assessment list of house tax and conservancy tax confirmed by the Municipal Council, Khurai, at a special meeting on February 24, 1964 is effective or is liable to be quashed on the ground that it was not made in accordance with the provisions of the Madhya Pradesh Municipalities Act, 1961.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Municipal Council was competent to appoint a Sub-Committee for the purpose of hearing and deciding the objections made against the assessment list.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether the notice given for lodging objections against the assessment list was in accordance with the provisions of the Act.",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether the Municipal Council acted illegally in adopting a slab system with different and varying rates in disregard of the initial rate.",
      "framed_by": "respondent"
    },
    {
      "id": "i5",
      "text": "Whether after suspension of the Sub-Committee's decision, it was open to the Municipal Council to have recourse to section 141 for making limited amendments, or whether it had to prepare a fresh assessment list under sections 137, 138 and 140.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "An appeal had already been preferred by the respondents against the assessment list and therefore they were not entitled to any relief under Art. 226.",
      "supporting_facts": [],
      "legal_basis": "Article 226 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "The list having been authenticated by the Chief Municipal Officer under s. 140 it became final and therefore under s. 141 it was open to the Municipal Council to amend the assessment list.",
      "supporting_facts": [
        "f10",
        "f21"
      ],
      "legal_basis": "Sections 140(1), 141(1) of the M.P. Municipalities Act, 1961"
    },
    {
      "id": "pa3",
      "text": "Procedure laid down in ss. 134, 135 and 136 was duly followed, 2,200 objections were investigated by the Sub-Committee, and then authenticated under s. 140(1), so list became final and amendable under s. 141(1).",
      "supporting_facts": [
        "f5",
        "f6",
        "f10"
      ],
      "legal_basis": "Sections 134, 135, 136, 140(1), 141(1)"
    },
    {
      "id": "pa4",
      "text": "Objections to delegation or rates were not urged before High Court.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "S. 141(1) can be availed of only for correcting arithmetical errors or other similar errors and not for revising the taxes; available only for current list, but since list not final under s. 142, could not be amended; appropriate provision is s. 146.",
      "supporting_facts": [
        "f21"
      ],
      "legal_basis": "Sections 141(1), 142, 146 of the Act"
    },
    {
      "id": "ra2",
      "text": "Since the assessment list had been suspended by the Collector under s. 323, the Council had no power to amend it under s. 141.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Section 323"
    },
    {
      "id": "ra3",
      "text": "Power of hearing objections or revising the list could not be delegated to the Sub-Committee.",
      "supporting_facts": [
        "f1",
        "f6"
      ],
      "legal_basis": "Section 78"
    },
    {
      "id": "ra4",
      "text": "Provisional assessment list published under s. 136 was on basis of revoked March 3 resolution; after revocation on April 28, fresh list needed; objections dealt with by Sub-Committee invalid.",
      "supporting_facts": [
        "f4",
        "f5",
        "f8"
      ],
      "legal_basis": "Sections 136, 137"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court had discretion to entertain writ despite alternative remedy; no interference unless arbitrary.",
      "addresses_issue": "i1",
      "key_observation": "High Court not arbitrary in granting relief."
    },
    {
      "id": "cr2",
      "text": "Assessment list under s. 136 must contain particulars per s. 134(1) including valuation, rate of tax, amount; after revocation of March 3 resolution, particulars changed, so list invalid.",
      "addresses_issue": "i3",
      "key_observation": "Objections based on published list, not new rates; opportunity under s. 137 not given."
    },
    {
      "id": "cr3",
      "text": "No tax without authority of law per Art. 265; procedure must be strictly complied with.",
      "addresses_issue": "i1",
      "key_observation": "Liability not according to law if procedure not followed."
    },
    {
      "id": "cr4",
      "text": "No provision except possibly s. 78 for delegation of hearing objections; s. 78 allows delegation to President/Vice-President/Chairman etc., not to Sub-Committee; Sub-Committee not equivalent to Vice-President.",
      "addresses_issue": "i2",
      "key_observation": "Delegation invalid."
    },
    {
      "id": "cr5",
      "text": "Thus assessment list not prepared according to law; s. 141 not available.",
      "addresses_issue": "i1",
      "key_observation": "List not final."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The assessment list authenticated by the Chief Municipal Officer was not prepared according to law and therefore provisions of s. 141 were not available to the Council.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Delegation to Sub-Committee invalid under s. 78.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "After revocation of tax rate resolution, fresh publication under s. 136 required; objections process invalid.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": null,
      "citation": null,
      "treatment": null,
      "relevance": null
    }
  ],
  "statutes_cited": [
    {
      "name": "Madhya Pradesh Municipalities Act, 1961",
      "sections": [
        "134",
        "135",
        "136",
        "137",
        "138(2)",
        "140",
        "140(1)",
        "141",
        "141(1)",
        "142",
        "146",
        "78",
        "71",
        "323",
        "323(2)",
        "327(1)",
        "92"
      ],
      "relevance": "Governs preparation, publication, objections, authentication, amendment of assessment lists; delegation; supervisory powers of Collector/Government."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "265",
        "226"
      ],
      "relevance": "No tax without authority of law (strict procedure); High Court writ jurisdiction despite alternative remedy."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld the High Court's decision quashing the assessment list confirmed on February 24, 1964, finding it not prepared according to law due to invalid delegation to Sub-Committee and failure to republish list after revocation of tax rate resolution, making s. 141 inapplicable. No need to consider High Court's specific reason.",
    "relief_granted": "Writ granted to respondents (asseesees); assessment list quashed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Under Art. 265 of the Constitution no tax shall be levied or collected except by authority of law. This clearly implies that the procedure for imposing the liability to pay a tax has to be strictly complied with.\"",
      "speaker": "court",
      "significance": "Core principle invalidating the assessment process."
    },
    {
      "text": "\"the assessment list authenticated by the Chief Municipal Officer was not prepared according to law and, therefore, the provisions of s. 141 were not available to the Council.\"",
      "speaker": "court",
      "significance": "Final holding on invalidity of the list."
    }
  ],
  "_case_id": "1964_80",
  "_label": 0,
  "_text_length": 16641,
  "_extracted_at": "2026-02-10T19:43:38.357990"
}