{
  "metadata": {
    "case_name": "Radha Kishan v. Collector of Central Excise and Land Customs",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Civil Appeal No. 777 of 1962",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "A number of gold bars, held to be smuggled gold, were recovered from the person of the appellant on September 17, 1957, when he was going in a truck from Jaisalmer to Pokaran.",
      "type": "material",
      "date": "1957-09-17",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Superintendent of Land Customs issued a notice to the appellant on December 4, 1957, to show cause why penal action be taken against him and why the goods should be confiscated under s. 167(8) of the Sea Customs Act, 1878.",
      "type": "procedural",
      "date": "1957-12-04",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Appellant showed cause.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "On March 21, 1959, the Collector of Central Excise and Land Customs ordered confiscation of the gold seized from the person of the appellant and imposition of a penalty of Rs. 15,000 on him under S. 167(8) of the Act.",
      "type": "procedural",
      "date": "1959-03-21",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Collector recorded finding: 'In view of all this evidence on record I hold that the gold in question is smuggled one and was recovered from Shri Radha Kishan while he was taking the same to Pokaran in truck No. RJM 40. I therefore order confiscation of the seized gold under Section 167 of the Land Customs Act. I also impose upon Shri Radha Kishan a personal penalty of Rs. 15,000 under Section 167(8) of the Sea Customs Act, 1878.'",
      "type": "admitted",
      "date": "1959-03-21",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellant presented writ application under Art 226 of the Constitution to the High Court of Punjab praying for writ of certiorari quashing the Collector's order and writ of mandamus directing respondents not to take steps for realisation of penalty.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Writ petition allowed by learned Single Judge on ground that Collector had not recorded finding that appellant was concerned in smuggling gold into the country, citing Balbir Singh v. Collector of Central Excise.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "On Letters Patent Appeal (L.P.A. No. 120-D of 1960), appellate Bench set aside Single Judge order and dismissed writ petition, relying on Full Bench decision in Union of India v. Jagdish Singh.",
      "type": "procedural",
      "date": "1962-03-06",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellant obtained special leave from Supreme Court for this appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellant does not question finding that gold was recovered from his person or that it was smuggled gold.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "No evidence about any action taken by appellant in connection with import of the gold.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "No allegation that appellant himself smuggled the gold from outside the country.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether mere possession of smuggled gold justifies the conclusion that the appellant was 'concerned' in the illegal importation of the gold so as to attract penalty under S. 167(8) of the Sea Customs Act, 1878, without a specific finding or evidence of involvement prior to importation.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Collector must record a finding that the person was concerned in the importation, or if it can be implicit.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Findings that gold was recovered from person of appellant and was smuggled gold do not justify conclusion that appellant was concerned in committing offence of importing gold illegally.",
      "supporting_facts": [
        "f1",
        "f10"
      ],
      "legal_basis": "S. 167(8) Sea Customs Act"
    },
    {
      "id": "pa2",
      "text": "Collector did not record any finding that appellant was concerned in importation of gold; hence not competent to impose penalty.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "S. 167(8) Sea Customs Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "On these facts appellant must be held to be interested in the importation of smuggled gold; 'concerned' in S. 167(8) to be construed in light of policy of Act and difficulties in establishing actual concern in importing.",
      "supporting_facts": [
        "f1"
      ],
      "legal_basis": "S. 167(8) Sea Customs Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Person penalised under S. 167(8) must be one concerned in commission of offence of bringing prohibited goods into India; mere possession after importation does not suffice as offence completes when goods cross customs frontier.",
      "addresses_issue": "i1",
      "key_observation": "Interest or involvement must be at stage prior to completion of illegal importation."
    },
    {
      "id": "cr2",
      "text": "Mere finding of possession of smuggled gold does not raise presumption of responsibility for importation; no evidence of appellant's action connecting him to import.",
      "addresses_issue": "i1",
      "key_observation": "Possession alone insufficient to conclude 'concerned in importation'."
    },
    {
      "id": "cr3",
      "text": "Omission to record formal finding not fatal if order shows consideration of whether person concerned in importation and reasons therefor.",
      "addresses_issue": "i2",
      "key_observation": "Collector's order must indicate consideration of person's concern in illegal importation."
    },
    {
      "id": "cr4",
      "text": "In this case, Collector's order based merely on possession; circumstances like false plea and recovery sufficient for knowledge but not for connection to importation.",
      "addresses_issue": "i1",
      "key_observation": "Smuggled goods can be carried by persons unconnected to smuggling who acquire possession later."
    },
    {
      "id": "cr5",
      "text": "View expressed followed by Bombay, Calcutta, Madras High Courts; Punjab High Court view in Balbir Singh and Jagdish Singh differed from.",
      "addresses_issue": "i1",
      "key_observation": "No circumstances alleged connecting appellant to actual importing."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Mere finding that person in possession of smuggled goods does not imply Collector considered question of concern in illegal importation nor justifies conclusion of such concern; other circumstances indicating connection prior to import required.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Collector's order must show consideration of person's being concerned in illegal importation and reasons; mere possession insufficient basis.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Balbir Singh v. Collector of Central Excise Land Customs, New Delhi",
      "citation": "A.I.R. 1960 Pun. 488",
      "treatment": "followed",
      "relevance": "Held Collector must record finding of being concerned in smuggling; relied on by Single Judge."
    },
    {
      "case_name": "Union of India v. Jagdish Singh",
      "citation": "A.I.R. 1962 Punj. 484",
      "treatment": "distinguished",
      "relevance": "Held no formal finding necessary; relied on by Division Bench but SC holds order must show consideration of concern in importation."
    },
    {
      "case_name": "Pukhraj Jain v. D. R. Kohli",
      "citation": "I.L.R. 1959 Bom. 1771",
      "treatment": "followed",
      "relevance": "Mere possession insufficient for penalty under S.167(8)."
    },
    {
      "case_name": "Gopal Mayaji v. T. C. Seth",
      "citation": "A.I.R. 1960 Bom. 478",
      "treatment": "followed",
      "relevance": "Mere possession insufficient for penalty under S.167(8)."
    },
    {
      "case_name": "Addl. Collector of Customs v. Sitarmn",
      "citation": "A.I.R. 1962 Cal. 242",
      "treatment": "followed",
      "relevance": "Mere possession insufficient for penalty under S.167(8)."
    },
    {
      "case_name": "Devi Chand J. Co. v. Collector, Central Excise",
      "citation": "I.R. 1960 Mad. 281",
      "treatment": "followed",
      "relevance": "Mere possession insufficient for penalty under S.167(8)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Sea Customs Act, 1878",
      "sections": [
        "S. 167(8)",
        "S. 18",
        "S. 19"
      ],
      "relevance": "Provides for confiscation and penalty if person concerned in prohibited importation; offence complete on crossing customs frontier."
    },
    {
      "name": "Land Customs Act",
      "sections": [
        "Section 167"
      ],
      "relevance": "Basis for confiscation order."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for writ petition seeking certiorari and mandamus."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court holds that Collector's order imposing penalty is invalid as it lacks finding or evidence that appellant was concerned in illegal importation of gold prior to crossing frontier; mere possession insufficient.",
    "relief_granted": "Implied quashing of Collector's penalty order in favour of appellant.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The mere finding of fact recorded by the Collector of Customs in this case about the smuggled gold being recovered from the possession of the appellant is not sufficient to conclude that the appellant was concerned in the illegal importation.\"",
      "speaker": "court",
      "significance": "Core holding on insufficiency of possession for penalty."
    },
    {
      "text": "\"The interest or the involvement or the engagement or the mixing up of the appellant in the commission of the offence must be at a stage prior to the completion of the offence of illegal importation.\"",
      "speaker": "court",
      "significance": "Defines scope of 'concerned' under S.167(8)."
    },
    {
      "text": "\"A mere finding of fact that a person is in possession of smuggled goods does neither imply that the Collector of Customs had considered the question of the person's being concerned in the commission of the offence.\"",
      "speaker": "court",
      "significance": "Rejects implicit finding based on possession."
    }
  ],
  "_case_id": "1964_202",
  "_label": 1,
  "_text_length": 16155,
  "_extracted_at": "2026-02-10T19:45:36.385429"
}