{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Daulatram Rawatmal",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, Daulatram Rawatmal, is a firm registered under the Indian Income-tax Act, 1922. At all material times there were six partners: Nandlal Bhowalka, Giridharilal Bhowalka, Shyamlal Bhowalka, Bajranlal Bhowalka, Rawatmal Nopany and Rameshwarlal Nopany.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The firm carried on business as dealers and commission agents in jute, rice and other commodities.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For the account year 2001-2002 Bikram Samvat (September 27, 1944, to October 15, 1945) the firm was assessed in the assessment year 1946-47 by the Income-tax Officer Non-Companies-cum-E.P.T. Circle, under section 23(3) of the Indian Income-tax Act.",
      "type": "procedural",
      "date": "1946-47",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On February 19, 1955, the Income-tax Officer, Central Circle VI, to whom the case was transferred by the Central Board of Revenue, issued a notice under section 34 of the Act calling upon the firm to file a revised return of income for the corresponding accounting year.",
      "type": "procedural",
      "date": "1955-02-19",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Pursuant to the notice, the firm filed a return showing an income of Rs. 2,75,168 according to its original assessment as reduced in appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Income-tax Officer inspected the books of account of the assessee.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On November 2, 1944, an amount of Rs. 5,00,000 was tendered in cash to the Barabazar Branch of the Central Bank of India with instruction to transfer the same to the Bombay head office of the bank and a demand draft for the said amount was issued through the Bombay head office on its Jamnagar branch.",
      "type": "material",
      "date": "1944-11-02",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Out of the remittance, a fixed deposit receipt was purchased in the name of Raghunath Prasad Agarwalla, son of Rawatmul Nopany, with the Jamnagar branch on November 8, 1944.",
      "type": "material",
      "date": "1944-11-08",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Raghunath Prasad Agarwalla died on August 16, 1945, and the fixed deposit receipt matured on December 19, 1945.",
      "type": "material",
      "date": "1945-08-16",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Upon maturity, the sum of Rs. 5,00,000 was paid to the heirs of Raghunath Prasad Agarwalla, but it was adjusted against the overdraft of the assessee.",
      "type": "material",
      "date": "1945-12-19",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The assessee's books showed a credit of Rs. 5,00,000 in the account of Raghunath Prasad Agarwalla. The account showed a current account involving large sums and balance of Rs. 5,64,970 carried forward to next year, continued in same name despite death.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On November 15, 1944, another amount of Rs. 5,00,000 was tendered in cash in the Barabazar branch with instructions to transfer to Bombay head office; demand draft issued in name of B. N. Gupta, son of Bajranglal Bhowalka, on Jamnagar branch; fixed deposit opened November 21, 1944.",
      "type": "material",
      "date": "1944-11-15",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On December 2, 1944, letter of guarantee and letter of continuity signed by Raghunath Prasad Agarwalla and B. N. Gupta along with promissory notes signed by the firm for keeping the two deposits under lien were lodged with the bank for securing overdraft facilities for the assessee in Rs. 10,00,000.",
      "type": "material",
      "date": "1944-12-02",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "On October 5, 1944, Rs. 5,00,000 tendered in cash in Barabazar branch with instructions to remit to Jamnagar branch by demand draft converted into fixed deposit dated October 11, 1944, in name of Sheo Prasad Agarwalla, son of Rameshwarlal Nopany.",
      "type": "material",
      "date": "1944-10-05",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The deposit of Sheo Prasad Agarwalla was later offered as security for overdraft facility granted to Sri Hanuman Sugar Mills Ltd., in the managing agency of which the partners of the assessee had a controlling interest.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Income-tax Officer viewed the amounts of fixed deposit receipts in names of three sons as secreted profits belonging to assessee and added Rs. 15,00,000 to total assessable income and completed reassessment.",
      "type": "disputed",
      "date": null,
      "source": "income_tax_officer"
    },
    {
      "id": "f17",
      "text": "In appeal, Appellate Assistant Commissioner held assessee explained source of Rs. 50,000 only out of B.N. Gupta deposit, added Rs. 14,50,000 as secreted profits.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Tribunal confirmed AAC order for two deposits (Raghunath Prasad and B.N. Gupta), but excluded Rs. 5,00,000 of Sheo Prasad deposit dated October 11, 1944, as no connecting link between assessee and amount; deposit utilised by Sri Hanuman Sugar Mills Ltd., not assessee.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f19",
      "text": "Commissioner applied under section 66(1) to Tribunal for reference to High Court: 'Whether inference by Tribunal that fixed deposit of Rs. 5 lakhs in name of S.P. Agarwalla did not represent concealed income of assessee firm was justified in law.' Tribunal rejected as question of fact.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f20",
      "text": "High Court of Calcutta rejected Commissioner's application to direct Tribunal to state case.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f21",
      "text": "With special leave, Commissioner appealed to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Three partners of assessee were directors of Sri Hanuman Sugar Mills Ltd.; assessee advanced over Rs. 8,00,000 to Hanuman Investment Ltd. (managing agents), which found its way to Sugar Mills.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in the facts and circumstances of this case the inference drawn by the Tribunal that the fixed deposit of Rs. 5 lakhs in the name of S. P. Agarwalla did not represent the concealed income of the assessee firm was justified in law.",
      "framed_by": "commissioner"
    },
    {
      "id": "i2",
      "text": "Whether the decision of the Tribunal involves a question of law such that no person acting judicially and properly instructed as to the relevant law could have arrived at that decision.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The three deposits made in quick succession in same bank, branch, Indian State, similar circumstances; two held by Tribunal as secreted profits; names of sons of partners; source obscured; assessee connected to Hanuman Sugar Mills via advances and control; only one inference possible: Sheo Prasad deposit also secreted profits of assessee; contrary conclusion perverse.",
      "supporting_facts": [
        "f7",
        "f8",
        "f12",
        "f14",
        "f15",
        "f18",
        "f22"
      ],
      "legal_basis": "Principles under section 66: finding perverse if no reasonable body could reach it; Sree Meenakshi Mills Ltd. v. CIT"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Principles governing references under section 66 well settled: Findings of pure fact by Tribunal not disturbed unless no evidence or perverse; even if High Court would differ. Point of pure law (construction) referable; mixed: legal effect reviewable; fact finding open if no evidence or perverse. Inference from facts remains fact.",
      "addresses_issue": "i2",
      "key_observation": "Cited Sree Meenakshi Mills Ltd. v. CIT"
    },
    {
      "id": "cr2",
      "text": "High Court exercises advisory jurisdiction under s.66; cannot require case if some evidence supports Tribunal finding, even if High Court might differ on re-appreciation.",
      "addresses_issue": "i2",
      "key_observation": "Tribunal conclusion not perverse."
    },
    {
      "id": "cr3",
      "text": "Similarity of transactions, proximity raise suspicion, strengthened by Hanuman Sugar Mills as beneficiary and benami possibility, but do not justify inference assessee concerned with October 11 deposit from secreted profits. No link established by evidence: unlike other deposits, no entry in books, no guarantee/continuity involving assessee, not adjusted to assessee OD.",
      "addresses_issue": "i1",
      "key_observation": "Suspicion cannot take place of evidence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Tribunal's finding that Rs. 5 lakhs deposit in Sheo Prasad Agarwalla's name did not represent concealed income of assessee is finding of fact supported by evidence, not perverse; no question of law arises for reference under s.66(1).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Circumstances raise suspicion but fail to establish connecting link by evidence that assessee was concerned with the deposit dated October 11, 1944.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sree Meenakshi Mills Ltd. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Principles which govern references under section 66: findings of fact not disturbed unless no evidence or perverse."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "23(3)",
        "34",
        "66(1)"
      ],
      "relevance": "Original assessment u/s 23(3); reassessment notice u/s 34; reference to High Court u/s 66(1)"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave filed by the Commissioner of Income-tax, upholding the Tribunal's exclusion of Rs. 5,00,000 fixed deposit in Sheo Prasad Agarwalla's name from the assessee's income as no question of law arose from the Tribunal's order, the finding being one of fact not perverse.",
    "relief_granted": "Appeal dismissed; no reference directed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "suspicion cannot take the place of evidence.",
      "speaker": "court",
      "significance": "Core reason for upholding Tribunal's finding despite suspicions."
    },
    {
      "text": "When the findings is one of fact, the fact that it is itself an inference from other basic facts will not alter its character as one of fact.",
      "speaker": "court",
      "significance": "Explains why Tribunal's inference is not reviewable as law."
    },
    {
      "text": "no person acting judicially and properly instructed as to the relevant law could have arrived at that decision.",
      "speaker": "petitioner_counsel",
      "significance": "Petitioner's contention on perversity, rejected by court."
    }
  ],
  "_case_id": "1964_99",
  "_label": 0,
  "_text_length": 14555,
  "_extracted_at": "2026-02-10T19:44:08.407076"
}