{
  "metadata": {
    "case_name": "Radhey Shyam Sharma v. Union of India",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO, J."
    ],
    "case_number": "Writ Petition No. 208 of 1963",
    "date_of_judgment": "1964-03-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner appointed as a Telegraphist by the Post Master General Nagpur in 1949.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In July 1960, petitioner serving as an officiating Teleprinter Supervisor at Jaipur.",
      "type": "background",
      "date": "1960-07",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Employees of the Posts and Telegraphs Department went on strike from the midnight of July 11, 1960 throughout India, including at Jaipur.",
      "type": "material",
      "date": "1960-07-11",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Petitioner was on duty on July 11, 1960 from 12 noon to 8 p.m. After duty, he went to the dormitory, fell asleep as tired, woke up at about 11:30 p.m., wanted to go home but was arrested by police as one of the demonstrators outside in connection with the strike.",
      "type": "disputed",
      "date": "1960-07-11",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Petitioner arrested under the Essential Services Maintenance Ordinance, No. 1 of 1960.",
      "type": "procedural",
      "date": "1960-07-11",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On July 13, 1960, petitioner suspended on the ground that a criminal charge was pending against him; criminal charge withdrawn on July 18, 1960.",
      "type": "procedural",
      "date": "1960-07-13",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On July 21, 1960, charge-sheet served: Shri Radhey Shyam Sharma, ICS Telegraphist, CTO Jaipur committed gross misconduct in that on the midnight of the 11th July 1960, he took part in a demonstration in furtherance of the strike of the P.T. Employees in violation of the orders dated 8-7-1960 issued by the Government of India under the Essential Services Maintenance Ordinance, 1960 (1 of 1960) prohibiting strike in any postal, telegraph or telephone Service.",
      "type": "material",
      "date": "1960-07-21",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Inquiry made by the Post Master General, Central Services Nagpur; enquiry officer found petitioner guilty of the charge.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Notice issued to show cause why the penalty of reduction in the time scale by three stages for a period of two years affecting the future increments be imposed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Post Master General ordered pay of petitioner reduced in the time scale by three stages for a period of two years and on restoration the period of reduction was not to operate to postpone his future increments.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Petitioner filed appeal to the Director General, Posts and Telegraphs; Director General directed further evidence to be taken; no further evidence given by Department; appeal rejected on merits.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Petitioner was the Secretary of the local union of the employees of the Department.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Petitioner's duty finished at 8 p.m. on July 11, 1960 but he stayed on in the dormitory till 11:30 p.m., which was half an hour before the strike was to commence.",
      "type": "admitted",
      "date": "1960-07-11",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Demonstration held in connection with the strike by employees at 11:30 p.m. on July 11, 1960; petitioner took part and was arrested amongst the demonstrators.",
      "type": "admitted",
      "date": "1960-07-11",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Central Government issued order dated July 8, 1960 under s.3 of the Ordinance prohibiting strike in the Department.",
      "type": "admitted",
      "date": "1960-07-08",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether ss.3, 4 and 5 of the Essential Services Maintenance Ordinance, No. 1 of 1960 are ultra vires as they contravene sub-clauses (a) and (b) of Art. 19(1).",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the punishment imposed upon the petitioner is violative of his fundamental rights under Arts. 19(1)(a) and 19(1)(b).",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether there was any evidence on which it could be found that the charge against the petitioner had been proved.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Punishment imposed is violative of fundamental rights under Arts. 19(1)(a) and 19(1)(b) and should be quashed.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": "Arts. 19(1)(a), 19(1)(b); Kameshwar Prasad v. State of Bihar; O. Ghosh v. E.X. Joseph"
    },
    {
      "id": "pa2",
      "text": "Ss. 3, 4 and 5 of the Ordinance are ultra vires as they contravene sub-clauses (a) and (b) of Art. 19(1).",
      "supporting_facts": [],
      "legal_basis": "Art. 19(1)(a), (b)"
    },
    {
      "id": "pa3",
      "text": "There was no evidence on which it could be found that the charge against the petitioner had been proved.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Ordinance is perfectly constitutional and does not violate any fundamental rights.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "The two cases relied upon by the petitioner (Kameshwar Prasad and O. Ghosh) are of no assistance as they were concerned with R.4-A and Rule 4-B of the Central Civil Services (Conduct) Rules, 1955.",
      "supporting_facts": [],
      "legal_basis": "Central Civil Services (Conduct) Rules, 1955 rr.4-A, 4-B"
    },
    {
      "id": "ra3",
      "text": "There was evidence on which the authorities concerned could find the charge proved against the petitioner.",
      "supporting_facts": [
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "There is no fundamental right to strike, and the Ordinance provides with respect to illegal strikes; it does not restrict freedom of speech and expression or right to assemble peaceably and without arms under Art. 19(1)(a) and (b).",
      "addresses_issue": "i1",
      "key_observation": "A perusal of Art. 19(1) shows that there is no fundamental right to strike."
    },
    {
      "id": "cr2",
      "text": "Kameshwar Prasad case related to R.4-A of Bihar rules prohibiting demonstrations; held violative insofar as demonstrations but valid for strikes. O.K. Ghosh concerned Central Conduct Rules rr.4-A, 4-B; did not deal with the Ordinance.",
      "addresses_issue": "i2",
      "key_observation": "The charge is based entirely on the Ordinance and has no connection with rr.4-A and 4-B."
    },
    {
      "id": "cr3",
      "text": "Charge is for gross misconduct by taking part in demonstration in furtherance of illegal strike under ss.3,4,5 of Ordinance; strike was illegal per order dated 8-7-1960; acting in furtherance punishable under s.5.",
      "addresses_issue": "i2",
      "key_observation": "The charge does not deal with freedom of speech or assembly but acting in furtherance of illegal strike."
    },
    {
      "id": "cr4",
      "text": "Undisputed facts: petitioner Secretary of union, duty ended 8pm but stayed till 11:30pm, demonstration at 11:30pm half hour before strike, arrested amongst demonstrators; sufficient evidence to find charge proved.",
      "addresses_issue": "i3",
      "key_observation": "If on these undisputed facts the authorities came to the conclusion that the petitioner acted in furtherance of the strike... it cannot be said that there was no evidence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Ss.3, 4 and 5 of the Ordinance are not violative of fundamental rights under Art. 19(1)(a) and (b); Ordinance is valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Punishment not violative of Arts. 19(1)(a) and (b) as charge based on acting in furtherance of illegal strike under Ordinance, not speech or assembly.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "There was evidence on which authorities could find charge proved.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "All India Bank Employees Association v. National Industrial Tribunal",
      "citation": "1962 3 S.C.R. 269",
      "treatment": "followed",
      "relevance": "Held there is no fundamental right to strike."
    },
    {
      "case_name": "Kameshwar Prasad v. State of Bihar",
      "citation": "1962 Supp. 3 S.C.R. 369",
      "treatment": "distinguished",
      "relevance": "Related to R.4-A of Bihar Government Servants Conduct Rules prohibiting demonstrations; violative of Art.19(1)(a),(b) for demonstrations but valid for strikes."
    },
    {
      "case_name": "O. K. Ghosh v. E. X. Joseph",
      "citation": "1963 Supp. 1 S.C.R. 789",
      "treatment": "distinguished",
      "relevance": "Concerned rr.4-A, 4-B of Central Civil Services Conduct Rules; did not deal with the Ordinance or similar charge."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 32",
        "Art. 19(1)(a)",
        "Art. 19(1)(b)",
        "Art. 19(2)",
        "Art. 19(3)"
      ],
      "relevance": "Petition under Art.32 for enforcement of fundamental rights under Art.19(1)(a),(b); restrictions under cls.2,3."
    },
    {
      "name": "Essential Services Maintenance Ordinance, No. 1 of 1960",
      "sections": [
        "s. 2(1)",
        "s. 3",
        "s. 4",
        "s. 5"
      ],
      "relevance": "Prohibits strikes in essential services including postal/telegraph/telephone; makes strikes illegal; punishes commencement, participation, instigation or acting in furtherance."
    },
    {
      "name": "Central Civil Services (Conduct) Rules, 1955",
      "sections": [
        "r. 4-A",
        "r. 4-B"
      ],
      "relevance": "Mentioned in cited cases but charge not based on these; distinguished."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The petition under Art.32 challenging the punishment of reduction in time scale as violative of Art.19(1)(a),(b), Ordinance validity, and lack of evidence is dismissed; Ordinance upheld as constitutional, charge proved on evidence, punishment not violative of fundamental rights.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A perusal of Art. 19(1) shows that there is no fundamental right to strike",
      "speaker": "court",
      "significance": "Core holding rejecting challenge to Ordinance and punishment."
    },
    {
      "text": "The Ordinance thus has nothing to do with restricting the fundamental rights enshrined in sub-cls. (a) and (b) of Art. 19(1)",
      "speaker": "court",
      "significance": "Dismisses ultra vires claim under Art.19."
    },
    {
      "text": "If on these undisputed facts the authorities came to the conclusion that the petitioner acted in furtherance of the strike... it cannot be said that there was no evidence",
      "speaker": "court",
      "significance": "Upholds finding of guilt based on circumstantial evidence."
    }
  ],
  "_case_id": "1964_298",
  "_label": 0,
  "_text_length": 13673,
  "_extracted_at": "2026-02-10T19:46:24.026321"
}