{
  "metadata": {
    "case_name": "Gillanders Arbuthnot & Co. Ltd. v. Commissioner of Income-tax",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeals Nos. 825-828 of 1963",
    "date_of_judgment": "1964-05-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a public limited company incorporated under the Indian Companies Act, 1913, with registered office at Calcutta and branches in Bombay, Madras, New Delhi and Kanpur.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant carried on business in diverse lines: buying and selling on its own account, introducing customers to principals, acting as managing agents, shipping agents, purchasing agents, sole importers and distributors on behalf of United Kingdom principals, and acting as secretaries.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Since January 21, 1886, Ms. Gillanders Arbuthnot & Co., predecessors-in-interest of the appellant, were the sole agents and distributors in India of explosives manufactured by the Imperial Chemical Industries Export Ltd., Glasgow, Scotland (principal company). No written agreement; agency terminable at the option of the principal company.",
      "type": "material",
      "date": "1886-01-21",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellant was incorporated for taking over the business of Ms. Gillanders Arbuthnot & Co. and acted as sole agent and distributor without a written agreement.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In May 1945, the principal company desired to set up its own organisation for distributing its products and intimated the appellant that the agency may be cancelled after two or three years.",
      "type": "material",
      "date": "1945-05",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "By letter dated March 11, 1947, the principal company informed the appellant that the agency will stand terminated from April 1, 1948, and proposed compensation: for first three post-transfer years, two-fifths of the commission accrued on actual sales in the territory at former rates; in the third year, additionally full commission on principal's sales in territory.",
      "type": "material",
      "date": "1947-03-11",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Letter dated March 11, 1947, stated as a condition of payment, request for formal undertaking to refrain from selling or accepting agency for explosives or competitive commodities; principal company to prepare formal agreement, but no formal agreement executed or even draft submitted.",
      "type": "material",
      "date": "1947-03-11",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Pursuant to conditions in letter dated March 11, 1947, appellant received: for previous year corresponding to assessment year ending 31st March 1949: Rs.1,53,471/11/-; ending 31st March 1950: Rs.1,59,271/4/-; ending 31st March 1951: Rs.6,20,131/2/-. Included in profit & loss account as commission received.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In assessment proceedings, appellant claimed amounts as compensation on termination of agency, capital receipts not liable to tax. Income-tax Officer rejected, held revenue taxable under Indian Income-tax Act, 1922; also assessed to Business Profits Tax for period ending March 31, 1949.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellate Assistant Commissioner accepted appellant's contention: compensation for termination and for agreeing not to compete.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Appellate Tribunal held compensation incidental to business; not separate business or loss of enduring asset; non-compete covenant not accepted as no formal undertaking.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Tribunal referred three questions under s.66(1) of Indian Income-tax Act, 1922 to Calcutta High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "High Court answered: (1) Agency not separate business, closure not destruction of capital asset; (2) Compensation income chargeable; (3) No part for non-compete, not exempt.",
      "type": "procedural",
      "date": "1962-01-10",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Appeals to Supreme Court with certificate of fitness from High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Agency continued over sixty years; extensive market built up; goodwill taken over by new agents.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Appellant employed expert officers for explosives; eighty per cent staff maintained at principal's expense; five officers taken over by principal, six retained and absorbed elsewhere.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the assessee's agency of the Imperial Chemical Industries Export Ltd. was a separate business by itself, the closure of which resulted in the destruction of a capital asset of the assessee?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether on the facts and circumstances, the compensation sums received by the assessee from the Imperial Chemical Industries Export Ltd. are income chargeable in the hands of the assessee?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether on the facts and circumstances, no part of the compensation money was received by the assessee on the condition not to carry on a competitive business in the same line of activity in explosives and as such no part of the money was in the nature of capital being exempt from Indian Income-tax levy?",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether the amounts received by the appellant as compensation for loss of agency are of the nature of capital or revenue?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Amounts were compensation received on determination of the agency, receipts of a capital nature not liable to tax.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Amounts in lieu of compensation for cancellation of agency, loss of goodwill, and agreeing not to carry on competitive business.",
      "supporting_facts": [
        "f3",
        "f6",
        "f7",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Explosives agency was a separate business; termination amounted to loss of enduring asset.",
      "supporting_facts": [
        "f3",
        "f16"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Cancellation of a single contract of agency out of a number of selling agencies was in the ordinary course of business; sums received as compensation for cancellation were revenue, taxable.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Indian Income-tax Act, 1922"
    },
    {
      "id": "ra2",
      "text": "Compensation merely incidental to carrying on of business; explosives agency not separate business; termination not loss of enduring asset.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Non-compete covenant did not form consideration as no formal acceptance or undertaking given.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No evidence that compensation paid for non-compete undertaking or loss of goodwill; no formal agreement executed; condition ignored; payments spread over three years not indicative of permanent restraint.",
      "addresses_issue": "i3",
      "key_observation": "No reliance placed by appellant on non-compete or goodwill before revenue authorities."
    },
    {
      "id": "cr2",
      "text": "Agency terminable at will; notice given in 1945; compensation computed on basis of lost profits (commissions on sales); one of many agencies in diverse business lines; did not impair trading structure.",
      "addresses_issue": "i2",
      "key_observation": "Acquisition and termination of individual agencies normal incident of business."
    },
    {
      "id": "cr3",
      "text": "Applying principles from Kettlewell Bullen: where cancellation does not affect trading structure or deprive source of income, but is normal incident leaving assessee free to carry on trade, receipt is revenue.",
      "addresses_issue": "i4",
      "key_observation": "Cancellation deprived appellant of a trading avenue but left it free to carry on rest of business."
    },
    {
      "id": "cr4",
      "text": "No evidence of impairment to organization; staff largely at principal's expense; other inflammable commodities handled; could obtain other agencies.",
      "addresses_issue": "i1",
      "key_observation": "Not independent of other lines; no substantial impairment."
    },
    {
      "id": "cr5",
      "text": "Shaw Wallace not laying down immutable principle that all agency terminations yield capital receipts.",
      "addresses_issue": "i4",
      "key_observation": "Each case on attendant circumstances."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Agency not separate business; closure not destruction of capital asset.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Compensation sums received are income chargeable to tax.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No part of compensation received on condition not to compete; no part capital/exempt.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Compensation for loss of agency is revenue receipt, not capital.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Kettlewell Bullen & Co. v. Commissioner of Income-tax, Calcutta",
      "citation": "1964 S.C.R. 93",
      "treatment": "followed",
      "relevance": "Survey of principles governing compensation on termination of agency: revenue if normal incident not impairing trading structure; capital if impairing source of income."
    },
    {
      "case_name": "Commissioner of Income-tax v. Shaw Wallace & Co.",
      "citation": null,
      "treatment": "referred",
      "relevance": "Did not lay down that every agency cancellation results in capital loss."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 66(1)"
      ],
      "relevance": "Reference of questions to High Court by Tribunal."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [],
      "relevance": "Incorporation of appellant company."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court agreed with the High Court that the compensation received by the appellant for termination of the agency was revenue income chargeable to tax, not capital; appeals dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Where on a consideration of the circumstances, payment is made to compensate a person for cancellation of a contract which does not affect the trading structure of his business, nor deprive him of what in substance is his source of income, termination of the contract being a normal incident of the business, and such cancellation leaves him free to carry on his trade freed from the contract terminated the receipt is revenue.\"",
      "speaker": "court",
      "significance": "Key principle from Kettlewell Bullen applied to hold receipts as revenue."
    },
    {
      "text": "\"There is, in our judgment, no immutable principle that compensation received on cancellation of an agency must always be regarded as capital.\"",
      "speaker": "court",
      "significance": "Rejects blanket rule for agency terminations; case-specific."
    }
  ],
  "_case_id": "1964_119",
  "_label": 0,
  "_text_length": 22460,
  "_extracted_at": "2026-02-10T19:44:12.061374"
}