{
  "metadata": {
    "case_name": "V. K. A. Ranganatha Konar v. Tiruchirappalli Municipal Council",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, C.J."
    ],
    "case_number": "Civil Appeal No. 675 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On September 1, 1944, respondent No. 1, Tiruchirappalli Municipal Council, leased T.S. No. 3283/1-A/2 to the appellant, V. K. A. Ranganatha Konar, for a term of three years at a rent of Rs. 100/- per month.",
      "type": "background",
      "date": "1944-09-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On the premises thus let out to him, the appellant erected a building for the purpose of exhibiting cinematographic films.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1945, he sub-leased the property to the second respondent, A. Muthukumaran.",
      "type": "background",
      "date": "1945",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1947, the lease was renewed for a period of three years, and so, it expired on March 31, 1950. Nevertheless, the appellant and respondent No. 2 continued in possession.",
      "type": "background",
      "date": "1947 to 1950-03-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On December 23, 1954, respondent No. 1 instituted a suit for the eviction of the appellant and respondent No. 2 and for arrears of rent.",
      "type": "procedural",
      "date": "1954-12-23",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "While the suit was pending the Act was extended to the Municipal Town of Tiruchirappalli. Accordingly, the value of the improvements made by the appellant and respondent No. 2 was determined by the learned trial Judge and declared to be Rs. 64,661-13-5 under s. 4(1) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On March 26, 1956, the trial Court passed a decree which, inter alia, provided that the defendants do put the plaintiff in possession of the suit properties described hereunder on payment of Rs. 64,661-13-5 by the plaintiff to the first defendant being the compensation for the superstructure belonging to the first defendant. This decree did not in terms direct respondent No. 1 to pay the said amount within three months from its date.",
      "type": "procedural",
      "date": "1956-03-26",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On October 1, 1956, the appellant filed an application I.A. No. 301 of 1956 inviting the attention of the Court to the fact that respondent No. 1 had not made the deposit within three months from the date of the decree, and claiming that by virtue of the provision prescribed by s. 4(4) of the Act, the Court was bound to dismiss the suit filed by respondent No. 1 for ejecting him and respondent No. 2.",
      "type": "procedural",
      "date": "1956-10-01",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On November 5, 1956, respondent No. 1 filed a counter to this interlocutory application. On the same date, respondent No. 1 filed another interlocutory application praying that the decree in question should be amended so as to specify the time within which the deposit should be made.",
      "type": "procedural",
      "date": "1956-11-05",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Pending these applications, on November 15, 1956, respondent No. 1 sent a cheque to the Court in regard to the said amount. The said cheque was duly cashed and the amount credited in the accounts of the Court on November 20, 1956.",
      "type": "procedural",
      "date": "1956-11-15",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On the date the trial Judge passed an order directing that the decree should be amended by inserting a direction to the effect that the deposit should be made before June 23, 1956, that is to say within three months from March 26, 1956 on which date the original decree had been passed. Since this amendment would not help respondent No. 1, the learned trial Judge proceeded to pass an order dismissing the suit under the provisions of s. 4(4).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "This order of dismissal was challenged by respondent No. 1 by an appeal preferred before the Madras High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The Madras High Court allowed the appeal, confirmed the original decree passed on March 26, 1956. The result of this decision is that respondent No. 1 is at liberty to take out execution for obtaining possession of the property.",
      "type": "procedural",
      "date": "1960-08-17",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The appellant then applied for and obtained a certificate from the High Court and preferred this appeal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "The short question which this appeal raises before us relates to the construction of S. 4(1) read with S. 4(4) of the Madras City Tenants Protection Act, 1921 (Madras Act III of 1922), specifically whether a decree under s.4(1) that does not expressly direct payment within three months triggers the mandatory dismissal under s.4(4) if not paid within three months.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The High Court's decision under appeal proceeds on a misconstruction of the provisions contained in s. 4(4) read with s. 4(1) of the Act. The provision prescribed by s. 4(4) is mandatory and any defect in the decree which is passed under s. 4(1) cannot help respondent No. 1 to circumvent the effect of the said provision.",
      "supporting_facts": [
        "f7",
        "f8",
        "f10"
      ],
      "legal_basis": "S. 4(1) and S. 4(4) of the Madras City Tenants Protection Act, 1921"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Since the original decree did not give a specific direction that the amount of compensation should be paid within three months, the provisions of s. 4(4) could not be invoked until the decree was suitably amended. It is only when the decree makes a direction calling upon the plaintiff to deposit a certain amount by way of compensation to the defendant-tenant within three months, that the requirements of s. 4(1) are complied with, and it is only where a decree has been properly drawn in accordance with the requirements of s. 4(1) that the mandatory provisions of s. 4(4) could be invoked.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "S. 4(1) and S. 4(4) of the Madras City Tenants Protection Act, 1921"
    },
    {
      "id": "ra2",
      "text": "Though the original decree did not comply with the requirements of s. 4(1) inasmuch as it failed to specify the period of three months within which the amount of compensation should be paid, it cannot be said to be a nullity; it is a decree passed by a court of competent jurisdiction, and so, when the appellant seeks to invoke s. 4(4), what he is virtually asking the Court to do is to ignore the fact that the decree did not direct respondent No. 1 to pay the amount within three months.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "S. 4(1) and S. 4(4) of the Madras City Tenants Protection Act, 1921"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In dealing with this question, it is necessary to bear in mind the object which the Act is intended to achieve. As the preamble indicates, the Act was passed to give protection to certain classes of tenants in areas to which it was extended. The Legislature thought that it was necessary to give protection to tenants who had constructed buildings on others lands in the hope that they would not be evicted so long as they paid a fair rent for the land.",
      "addresses_issue": "i1",
      "key_observation": "Object of Act is to protect tenants who constructed buildings on leased land."
    },
    {
      "id": "cr2",
      "text": "What s. 4(1) purports to do is to require that the decree in the suit to which it applies shall, in the first instance, declare the amount found due by way of compensation. The said provision also requires that the decree shall declare that the tenant shall put the landlord into possession of the land on payment by the landlord into court, within three months from the date of the decree, of the amount found due. The two operative parts of the decree as contemplated by s. 4(1) are the declaration of the amount due to the tenant, and the direction to the tenant to deliver possession of the land to the landlord in case he paid into Court within three months of the date of the decree the amount declared due.",
      "addresses_issue": "i1",
      "key_observation": "Reference to payment within three months in s.4(1) is a condition, not a strict direction controlling s.4(4)."
    },
    {
      "id": "cr3",
      "text": "Having regard to the specific and mandatory terms in which s. 4(4) is couched, it would not be reasonable to construe s. 4(1) as controlling s. 4(4). The provision of s. 4(4) clearly shows that if the amount found due is not paid within three months, the suit of the landlord shall stand dismissed. The expression 'the decree under sub-section (1)' merely describes the sub-section under which the decree is passed, the emphasis being on the date of the said decree and not so much on the strict compliance with the form prescribed by s. 4(1).",
      "addresses_issue": "i1",
      "key_observation": "s.4(4) applies even to defective decrees under s.4(1); date of decree starts the three-month period."
    },
    {
      "id": "cr4",
      "text": "If the decree happens to be defective in the sense that it does not reproduce the requirement of s. 4(1) expressly in its terms, that would not take the case outside the purview of s. 4(4). Having regard to the mandatory terms used in s. 4(4), it would be illogical and unreasonable to suggest that a defective decree like the present enables the landlord to circumvent the provisions of s. 4(4).",
      "addresses_issue": "i1",
      "key_observation": "Defective form does not defeat tenant protection under s.4(4)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The provision prescribed by s. 4(4) is mandatory and paramount; even if the decree does not mention that the amount has to be paid within three months, the landlord's obligation to make the payment within three months is still enforceable under s. 4(4). The applicability of s. 4(4) cannot be repelled merely on the ground that the decree passed under s. 4(1) does not specify the period of three months within which the amount found due has to be paid.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Madras City Tenants Protection Act, 1921 (Madras Act III of 1922)",
      "sections": [
        "Section 3",
        "Section 4(1)",
        "Section 4(4)",
        "Section 6",
        "Section 10"
      ],
      "relevance": "Governs compensation for improvements by tenants on ejectment, form of decree in ejectment suits, mandatory dismissal if compensation not paid within three months, and application to pending suits and unexecuted decrees."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed, the decree passed by the High Court is set aside and that of the trial Court restored. Respondent No. 1 has not paid the amount within three months from the date of the decree and the suit instituted by it shall stand dismissed under s. 4(4).",
    "relief_granted": "Suit dismissed under s.4(4); appellant's possession protected.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The provision prescribed by s. 4(4) is mandatory and any defect in the decree which is passed under s. 4(1) cannot help respondent No. 1 to circumvent the effect of the said provision.",
      "speaker": "court",
      "significance": "Core holding on mandatory nature of s.4(4) despite decree defects."
    },
    {
      "text": "Having regard to the mandatory terms used in s. 4(4), it would be illogical and unreasonable to suggest that a defective decree like the present enables the landlord to circumvent the provisions of s. 4(4).",
      "speaker": "court",
      "significance": "Emphasizes tenant protection overriding formal defects."
    },
    {
      "text": "The Act was passed to give protection to certain classes of tenants in areas to which it was extended.",
      "speaker": "court",
      "significance": "States the purpose guiding interpretation."
    }
  ],
  "_case_id": "1964_84",
  "_label": 1,
  "_text_length": 16877,
  "_extracted_at": "2026-02-10T19:43:27.572178"
}