{
  "metadata": {
    "case_name": "State of Mysore v. Respondent",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "AYYANGAR, J."
    ],
    "case_number": "Civil Appeal No. 677 of 1963",
    "date_of_judgment": "1964-03-25"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent was recruited as an Upper Division Clerk by the Government of Bombay in 1931 and was later appointed substantively as a Junior Assistant in the Political Department.",
      "type": "background",
      "date": "1931",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On September 17, 1943, his services were transferred on deputation to the office of the Controller of Rationing, Bombay to work as a Senior Assistant in the newly started Rationing department which was a temporary department.",
      "type": "material",
      "date": "1943-09-17",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "He obtained successive promotions in this department and by March, 1954 he was drawing a pay of Rs. 460/- p.m. in the grade Rs. 350-30-650 as Rationing Officer.",
      "type": "material",
      "date": "1954-03",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "That department was abolished in March, 1954 and thereafter he was reverted to his parent department.",
      "type": "material",
      "date": "1954-03",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Though his parent department was the Political Department, the respondent was, after he ceased to be a Rationing Officer, posted first to the Labour Department and then to the Public Works Department.",
      "type": "procedural",
      "date": "1954",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "When this reversion took place his pay was fixed at Rs. 120/- p.m.",
      "type": "material",
      "date": "1954",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The respondent protested against this reversion and this loss of his emoluments on the ground that this fixation of pay was contrary to the Rules framed by Government in regard to the service conditions of a Government servant who was appointed on deputation in another department.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The officer next below him in his parent department - one Nadkarni - had been appointed as an Assistant Secretary by virtue of normal and regular promotion.",
      "type": "admitted",
      "date": "1954-06-01",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The States Reorganisation Act, 1956 came into force and the respondent was allotted to the State of Mysore.",
      "type": "background",
      "date": "1956",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On November 27, 1958 the Government of Mysore informed the respondent that he should be considered to have held the post of Senior Assistant on June 1, 1954 on a salary of Rs. 225/- in the grade Rs. 210-15-300.",
      "type": "procedural",
      "date": "1958-11-27",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The respondent filed a petition under Art. 226 for inter alia a writ of mandamus directing the appellant-State to include the petitioner in the grade-pay of an Assistant Secretary I and fix him above Nadkarni.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Mysore High Court judgment and order dated March 31, 1961 in Writ Petition No. 283 of 1959 allowed the writ and granted the respondent the relief.",
      "type": "procedural",
      "date": "1961-03-31",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "By the date of the pendency of these proceedings in the High Court the respondent had retired on account of superannuation.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "High Court granted certificate under Art. 133 for appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Proper construction of Rule 50(b) of the Bombay Civil Services Rules: whether an officer reverted from deputation is entitled to increments in the time scale applicable to the post on which he holds a lien as well as the position (including promotions) he would have held had he not been deputed.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether a Government servant has a legal right to promotion (on seniority-cum-merit basis) under Rule 50(b) upon reversion from deputation.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether breach of Rule 50(b), a statutory rule, gives rise to a cause of action enforceable by writ under Art. 226.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "On a proper construction of Rule 50(b), an officer who after serving on deputation is reverted to his parent department is entitled to nothing more than the increments allowable in the time scale applicable to the substantive appointment which he held at the time of the transfer, stress on words 'increments in the time scale applicable to the post on which the Government servant holds a lien'.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "Bombay Civil Services Rule 50(b)"
    },
    {
      "id": "pa2",
      "text": "A Government servant has no legal right to be promoted to a higher post upon reversion; the construction by High Court concedes a right to automatic promotion which they would not have had if not deputed.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Entitled to be posted as Assistant Secretary and allowed scale of emoluments applicable, as he would have held that post had he not been deputed, per Service Rules and Bombay Govt circular dated October 31, 1950; fix above Nadkarni.",
      "supporting_facts": [
        "f2",
        "f8",
        "f10"
      ],
      "legal_basis": "Bombay Civil Services Rule 50(b); Circular dated October 31, 1950"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Rule 50(b) entitles service on deputation to count for increments in time scale of lien post and posts he would hold had lien not suspended; plural 'posts' contemplates promotions; circular dated October 31, 1950 gives effect to rule by restoring position as if not deputed.",
      "addresses_issue": "i1",
      "key_observation": "No logic in different criteria for lien vs suspended lien cases; circular dispels ambiguity."
    },
    {
      "id": "cr2",
      "text": "No right to promotion if selection post, but where seniority-cum-merit, service on deputation equated to parent dept service entitling to promotions; next below rule applies for paper-promotion.",
      "addresses_issue": "i2",
      "key_observation": "Satisfactory service in deputation dept deemed rendered in parent dept."
    },
    {
      "id": "cr3",
      "text": "Breach of statutory rule under Art. 309/313 gives cause of action for writ.",
      "addresses_issue": "i3",
      "key_observation": "Not disputed per State of U.P. v. Babu Ram Upadhya."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rule 50(b) provides that service on deputation counts for increments and position (including seniority-cum-merit promotions) in parent department as if not deputed.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Government servant entitled to promotion on reversion if based on seniority-cum-merit, treating deputation service equivalently.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Infraction of statutory service rule gives cause of action enforceable in court.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of U.P. v. Babu Ram Upadhya",
      "citation": "(1961) 2 S.C.R. 679",
      "treatment": "followed",
      "relevance": "Breach of statutory rule framed under Art. 309 or continued under Art. 313 gives recourse to court."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Civil Services Rules",
      "sections": [
        "Rule 50(b)",
        "Rule 41 Note 4",
        "Rule 51",
        "Rule 22(a)"
      ],
      "relevance": "Rule 50(b) governs counting of deputation service for increments and lien posts/promotions on reversion."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 133",
        "Art. 226",
        "Art. 309",
        "Art. 313"
      ],
      "relevance": "Certificate under Art. 133; writ under Art. 226; statutory rules under Art. 309/313 enforceable."
    },
    {
      "name": "States Reorganisation Act, 1956",
      "sections": [],
      "relevance": "Allotted respondent to State of Mysore."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The respondent is entitled to the position and emoluments of Assistant Secretary as per Rule 50(b), treating his deputation service equivalently to parent department service for increments and promotions.",
    "relief_granted": "High Court writ upheld; respondent entitled to remuneration as if holding Assistant Secretary post.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the case should be so regulated as to restore the position the person concerned would have occupied in his parent Department had he not been deputed.\"",
      "speaker": "court",
      "significance": "Circular interpreting Rule 50(b), confirming entitlement to hypothetical position."
    },
    {
      "text": "\"Service in another post... service on deputation... counts for increments in the time scale applicable to the post on which the Government servant holds a lien as well as in time scale applicable to the post or posts, if any, on which he would hold a lien had his lien not been suspended.\"",
      "speaker": "court",
      "significance": "Verbatim Rule 50(b) central to construction."
    },
    {
      "text": "\"it stands to reason that that satisfactory service... should be deemed to be rendered in the parent department also so as to entitle him to promotions, which are often on seniority-cum-merit basis.\"",
      "speaker": "court",
      "significance": "Core reasoning equating deputation service for promotions."
    }
  ],
  "_case_id": "1964_17",
  "_label": 0,
  "_text_length": 12305,
  "_extracted_at": "2026-02-10T19:42:18.010325"
}