{
  "metadata": {
    "case_name": "Ratan Ahir and others v. State of Bihar",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal J."
    ],
    "case_number": "Criminal Appeal No. 29 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On the morning of November 28, 1957, a number of cattle belonging to several persons, including Shamnarain Singh, were observed grazing in a kurthi field about which there was a dispute between the authorities of the Basic School and Shamnarain Singh each claiming the field.",
      "type": "background",
      "date": "1957-11-28",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Ramnandan Singh and others, including Ram Rattan alias Ratan Ahir, seized those cattle and proceeded to take them to the pound at village Tilauthu. These persons were armed with sharp-edged weapons and lathis.",
      "type": "material",
      "date": "1957-11-28",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The report of the seizure reached Shamnarain Singh and other people in the village. A number of people, variously armed, started from the village to rescue the cattle. They were joined by others on the way. This party, including Sukhari Mahto, Deocharan, Sheodutt, Hari Mahto and Ramdeo, caught up with the other party a short distance from the cattle pound and asked that party to release the cattle.",
      "type": "material",
      "date": "1957-11-28",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Altercation took place between the parties and then they fought together. According to the prosecution case, members of the appellants party attacked Shamnarain Singh and his companions. According to the appellants it was the other party which attacked them.",
      "type": "disputed",
      "date": "1957-11-28",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "As a result of the fight five persons got injured on the side of Shamnarain Singh. Of them, Ramdeo got one gaping punctured wound in the right thigh with a spear. He died as a result of the injury received. Sukhari Mahto received 16 injuries including 4 incised wounds. The other three injured persons received ordinary injuries: Deocharan had an abrasion, Sheodutt Singh got a lacerated wound, a swelling and an abrasion and Hari Mahto had a lacerated wound.",
      "type": "material",
      "date": "1957-11-28",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On the side of the appellants, four persons got injured. Ramnandan Singh received 12 injuries, including 4 incised wounds and 3 punctured wounds. Ratan Ahir got three injuries including 2 punctured wounds. Sheorattan got 5 injuries including 2 punctured wounds. Rajkumar Singh got 2 injuries including one punctured wound.",
      "type": "material",
      "date": "1957-11-28",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Hari Mahto lodged a report on behalf of the complainant party against 20 persons. Ratan Ahir lodged a report against 26 persons.",
      "type": "procedural",
      "date": "1957-11-28",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The police, as a result of investigation, sent up 28 persons for trial.",
      "type": "procedural",
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "The Additional Sessions Judge, Arrah, acquitted all of them.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Sessions Judge found: 1. Shamnarain Singh was in lawful possession of the kurthi field on the date of occurrence and the supposed claim thereto raised on behalf of the defence was not in good faith; 2. the cattle were seized in the presence of the charwahas in spite of their protest; 3. even though the seizure of the cattle from the kurthi field by the accused party in these circumstances was an unlawful act, the conduct of the complainant-party, who were fully armed, in following them in order to release the cattle, was not justified as it showed a determination on their part to get their cattle released by use of force and that therefore there did not exist any right on the part of the owners of the cattle to the extent of securing the release of their cattle from the hands of those who had seized them earlier by use of force; 4. there was strong probability in favour of the view that it was the prosecution-party which created the crisis and took the aggression to initiate the assault and that the prosecution narration as to the manner in which the assault commenced at the scene of occurrence did not commend itself to him and that part of the prosecution story appeared to suffer from material suppression, and that, in these circumstances, the accused party had the reasonable apprehension of suffering grievous hurt or death at the hands of the prosecution party and they were justified in the exercise of their right of private defence of their bodies in causing such injuries to the men on the prosecution side as might cause death, the death so caused being justifiable homicide.",
      "type": "procedural",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The State of Bihar appealed against the acquittal of the 28 accused.",
      "type": "procedural",
      "date": "1960",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "The Patna High Court allowed the appeal against 13 respondents and convicted Ratan Ahir under S. 302 I.P.C. and the others under s. 326 read with s. 149 I.P.C. and of some other offences. One respondent had died and 14 others were acquitted. High Court agreed with Sessions Judge that the plot was in possession of Shamnarain Singh and seizure illegal, but held that members of prosecution party had right of private defence of property and could recover cattle by force, subject to limitations.",
      "type": "procedural",
      "date": "1962-12-13",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Supreme Court accepts findings of High Court: plot in possession of Shamnarain Singh, appellants seized cattle alleging damaging crops, to take to pound; Shamnarain Singh and others armed went to rescue; after altercation accused party opened attack.",
      "type": "admitted",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a person who seizes cattle illegally, purporting to act under S. 10 of the Cattle Trespass Act, 1871, commits the offence of theft or robbery.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the owners of the cattle had right of private defence of property to rescue the cattle by force.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sessions Judge's view supporting appellants: prosecution party not entitled to rescue by force; prosecution party aggressors; accused had right of private defence of person.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Illegal seizure does not amount to theft as it was purportedly under Cattle Trespass Act; no right of private defence of property arises without commission of offence.",
      "supporting_facts": [
        "f2",
        "f13"
      ],
      "legal_basis": "Cattle Trespass Act S.10; IPC S.40, S.378"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "High Court view: illegal seizure put accused in position of thieves/dacoits; prosecution party had right of private defence of property to rescue cattle by force.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": "Cattle Trespass Act; IPC right of private defence"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Act does not make illegal seizure of cattle an offence; remedy is under Chapter V (Ss.20-23) for compensation, not criminal offence. Seizure purporting under Act protected, police aid required.",
      "addresses_issue": "i1",
      "key_observation": "Illegal seizure purporting under S.10 not theft under IPC S.378 as no dishonest intention; moving to pound as per Act."
    },
    {
      "id": "cr2",
      "text": "Theft requires moving property with dishonest intent out of possession without consent. Mere seizure not moving; taking to pound directed by Act, no wrongful gain/loss as owner reimbursed.",
      "addresses_issue": "i1",
      "key_observation": "No dishonest intention; owner suffers no ultimate loss."
    },
    {
      "id": "cr3",
      "text": "No right of private defence of property without offence under IPC S.40. Accused had right of private defence of person as prosecution party armed and aggressive.",
      "addresses_issue": "i2",
      "key_observation": "Prosecution party aggressors; injuries support defence view."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Person seizing cattle illegally purporting to act under S.10 Cattle Trespass Act commits no offence of theft.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No right of private defence of property to owners; accused entitled to private defence of person.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "K. N. Mehra v. The State of Rajasthan",
      "citation": "1957 S.C.R. 623",
      "treatment": "followed",
      "relevance": "Explains elements of theft: moving with dishonest intention."
    },
    {
      "case_name": "Queen v. Preonath Banerjee",
      "citation": "5 W.R. 68 criminal",
      "treatment": "distinguished",
      "relevance": "Seizure not under Act, to satisfy claims, held theft."
    },
    {
      "case_name": "Wazuddi v. Rahimuddi",
      "citation": "A.I.R. 1941 Lah. 221",
      "treatment": "distinguished",
      "relevance": "Seizure not under Act."
    },
    {
      "case_name": "Abdul Khaliq v. Emperor",
      "citation": "I.L.R. 22 Cal. 1017",
      "treatment": "distinguished",
      "relevance": "Seizure not under Act."
    },
    {
      "case_name": "Paryag Rai v. Arju Mian",
      "citation": "18 Crl. L.J. 849",
      "treatment": "distinguished",
      "relevance": "Seizure not under Act."
    },
    {
      "case_name": "Queen Empress v. Sri Churn Chungo",
      "citation": "I.L.R. 22 Cal. 139",
      "treatment": "distinguished",
      "relevance": "Seizure not under Act."
    },
    {
      "case_name": "Empress v. Ramjiawan",
      "citation": "1881 1 All. W.N. 158",
      "treatment": "followed",
      "relevance": "Illegal seizure under Act not mischief; remedy under Ss.20-22."
    },
    {
      "case_name": "Dayal v. Emperor",
      "citation": "A.I.R. 1943 Oudh. 280",
      "treatment": "followed",
      "relevance": "Illegal seizure and impounding not mischief or theft."
    }
  ],
  "statutes_cited": [
    {
      "name": "Cattle Trespass Act, 1871",
      "sections": [
        "S.10",
        "S.11",
        "S.12",
        "S.20",
        "S.21",
        "S.22",
        "S.23",
        "S.24",
        "S.25",
        "S.26",
        "S.29",
        "S.30"
      ],
      "relevance": "Authorizes seizure of trespassing cattle damaging crops; provides remedy for illegal seizure via complaint and compensation, not criminal offence; protects seizures purporting under Act."
    },
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "S.302",
        "S.326",
        "S.149",
        "S.378",
        "S.40"
      ],
      "relevance": "Convictions under these; theft defined; offence required for private defence."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "S.545"
      ],
      "relevance": "Compensation in mischief cases."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allows the appeal by special leave, sets aside the convictions of Ratan Ahir under S.302 IPC and others under S.326/149 IPC and other offences by Patna High Court.",
    "relief_granted": "Acquittal of appellants",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"This appeal, by special leave, raises the question whether a person who seizes cattle illegally, purporting to act under S. 10 of the Cattle Trespass Act, 1871, commits the offence of theft or robbery.\"",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "\"We therefore hold that in the circumstances of this case, Rattan and others, appellants, who had seized the cattle from the disputed field committed no offence of theft even if they had no right to that field.\"",
      "speaker": "court",
      "significance": "Key holding on no theft in illegal seizure under Act."
    },
    {
      "text": "\"The Act does not make the illegal seizure of cattle punishable as an offence.\"",
      "speaker": "court",
      "significance": "Explains legislative intent."
    }
  ],
  "_case_id": "1964_331",
  "_label": 1,
  "_text_length": 31918,
  "_extracted_at": "2026-02-10T19:47:10.877592"
}