{
  "metadata": {
    "case_name": "Appellants v. Union of India",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "AYYANGAR, J."
    ],
    "case_number": "Civil Appeals Nos. 115 and 116 of 1963",
    "date_of_judgment": "1964-03-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants constitute a partnership engaged in mining business and held a prospecting licence in Madhya Pradesh with concessions for prospecting and working minerals in several areas.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Under Mines and Minerals (Regulation and Development) Act, 1948 and Mineral Concession Rules, 1949, prospecting licence or mining lease requires certificate of approval from State Government.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellants obtained certificate of approval from Government of Madhya Pradesh from 1952, renewed yearly up to December 31, 1955.",
      "type": "admitted",
      "date": "1952-12-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellants applied on November 22, 1955 to Government of Madhya Pradesh for renewal of certificate for 1956, furnished required information, filed documents, recommended by District Officer, Bhandara.",
      "type": "procedural",
      "date": "1955-11-22",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Government of Madhya Pradesh rejected application on September 21, 1956 (communicated October 6, 1956) on ground that partners composing the firm had changed.",
      "type": "material",
      "date": "1956-09-21",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellants applied on November 15, 1956 to Union Government for review under Rule 57 of Mineral Concession Rules, 1949.",
      "type": "procedural",
      "date": "1956-11-15",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Correspondence ensued between Central Government and Government of Madhya Pradesh regarding the review application; appellants requested information, progress update, and personal hearing but were not informed of State Government's report or documents prior to rejection order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Union Government rejected review application on July 9, 1958, stating no valid ground for interfering with State Government's decision; based on State report not disclosed to appellants.",
      "type": "material",
      "date": "1958-07-09",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Appellants requested copy of State Government's report but were refused.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Appellants filed petition under Article 226 to Punjab High Court for writ of certiorari to quash Union Government's order; dismissed in limine on September 24, 1958.",
      "type": "procedural",
      "date": "1958-09-24",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Civil Appeal No. 115 by special leave under Article 136 against Union Government's order dated July 9, 1958; Civil Appeal No. 116 against High Court order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appellants' case: Partnership deed provides for continuance of firm identity notwithstanding changes in partners by death, retirement, or accession of new members.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "State Government refused renewal considering change in composition of firm destroyed its identity.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Union Government under Rules 57 and 59 of Mineral Concession Rules, 1949 acts as quasi-judicial authority and whether its order rejecting review without disclosing State Government report and without affording hearing to appellants violates natural justice.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Punjab High Court erred in holding jurisdiction under Rules 57 and 59 as administrative rather than quasi-judicial.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Union Government disposing application under Rule 57 in terms of Rule 59 acts as quasi-judicial authority; order passed considering State report without disclosing contents or affording opportunity to present case is contrary to natural justice and void.",
      "supporting_facts": [
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": "Shivji Nathubhai v. Union of India; principles of natural justice"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Counsel for respondent-Union of India did not support refusal to disclose contents of State report.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Union Government under Rule 59 functions as quasi-judicial authority; cannot act on material (State report) without giving appellants opportunity to make representation.",
      "addresses_issue": "i1",
      "key_observation": "Same principle applies whether review granted or rejected based on undisclosed materials."
    },
    {
      "id": "cr2",
      "text": "Appellants entitled to know points in State report against their representations and opportunity to rebut; non-disclosure violates natural justice.",
      "addresses_issue": "i1",
      "key_observation": "Reasonable opportunity of being heard is sine qua non of fair hearing."
    },
    {
      "id": "cr3",
      "text": "Punjab High Court erred viewing jurisdiction as administrative; Supreme Court had reversed similar view in Shivji Nathubhai post High Court judgment.",
      "addresses_issue": "i2",
      "key_observation": "High Court lacked advantage of Supreme Court pronouncement."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Order of Central Government dated July 9, 1958 vitiated as contrary to principles of natural justice for lack of reasonable opportunity to be heard.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Shivji Nathubhai v. Union of India",
      "citation": "1960 2 S.C.R. 775",
      "treatment": "followed",
      "relevance": "Supports that Central Government under Rule 59 acts quasi-judicially; principle applies to rejection of review based on undisclosed materials."
    }
  ],
  "statutes_cited": [
    {
      "name": "Mines and Minerals (Regulation and Development) Act, 1948",
      "sections": [
        "Act No. XLIII of 1948"
      ],
      "relevance": "Governs scheme requiring certificate of approval for prospecting licence or mining lease."
    },
    {
      "name": "Mineral Concession Rules, 1949",
      "sections": [
        "Rule 57",
        "Rule 59"
      ],
      "relevance": "Rule 57 allows application to Central Government for review of State refusal; Rule 59 provides procedure where Central Government acts quasi-judicially."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 136",
        "Article 226"
      ],
      "relevance": "Special leave for appeals; writ petition to High Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court holds Union Government's order dated July 9, 1958 rejecting review vitiated by violation of natural justice; both appeals challenge same order and are dealt together.",
    "relief_granted": "Order declared void as contrary to natural justice.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the Central Government acting under the rule referred to is functioning as a quasi-judicial authority. It does follow therefore that they could not act on the basis of material as regards which the appellants had no opportunity to make their representation.",
      "speaker": "court",
      "significance": "Establishes quasi-judicial nature and natural justice requirement."
    },
    {
      "text": "reasonable opportunity of being heard which is a sine qua non of a fair hearing.",
      "speaker": "court",
      "significance": "Core holding on violation of natural justice."
    }
  ],
  "_case_id": "1964_337",
  "_label": 1,
  "_text_length": 10514,
  "_extracted_at": "2026-02-10T19:46:57.071714"
}