{
  "metadata": {
    "case_name": "Income-tax Officer, Cuddapah v. Thimmayya & Venkatanarsu",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeals Nos. 1019-1020 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Krishnappa and his two sons-Thimmayya and Venkatanarsu-constituted a Hindu undivided family carrying on business in mining in the name and style of Krishnappa and Sons.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The family was disrupted in 1946, and all its properties were divided among the members of the family.",
      "type": "material",
      "date": "1946",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The business of Krishnappa and Sons was taken over by a firm of which the partners were Krishnappa and his two sons.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "A private limited Company styled Krishnappa Asbestos and Barytes Private Ltd. took over the business of the firm on May 21, 1947 for Rs. 2,04,000.",
      "type": "background",
      "date": "1947-05-21",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Thimmayya obtained employment under the Company as Mines Superintendent at a monthly salary of Rs. 400 and Venkatanarsu as General Manager at a monthly salary of Rs. 500.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Proceedings for assessment of tax due by the Hindu undivided family for the years 1941-42, 1942-43, 1944-45, 1945-46 and 1946-47 were pending at the time when the Hindu undivided family was disrupted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On May 20, 1946, Venkatanarsu claimed before the Additional Income-tax Officer, Cuddapah that the property of the Hindu undivided family had been partitioned among the members in definite portions.",
      "type": "material",
      "date": "1946-05-20",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "This claim was not disposed of till June 30, 1952.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Assessments for the five years in question were made by the Income-tax Officer on diverse dates between September 30, 1948 and November 30, 1950, resulting in a tax liability of Rs. 65,750 in the aggregate for the five years.",
      "type": "procedural",
      "date": "1948-09-30 to 1950-11-30",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appeals against the orders of assessment to the Appellate Assistant Commissioner and the Income-tax Appellate Tribunal proved unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "It was not contended in the appeals that in making the orders of assessment, without disposing of the claim that the family was disrupted in 1946, the Income-tax Officer had acted illegally.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On June 30, 1952 the Income-tax Officer, Special Circle, Madras, made an order under s. 25-A(1) recording that the property of the Hindu undivided family of Krishnappa and his sons was partitioned on November 2, 1946.",
      "type": "procedural",
      "date": "1952-06-30",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "As the tax due was not paid the Income-tax Officer made an order under s. 46(5) of the Indian Income-tax Act, 1922 on June 25, 1958 calling upon the Managing Director to withhold the amount of tax due from the salaries payable to the defaulters Thimmayya and Venkatanarsu and to show the same to the credit of the Government of India.",
      "type": "procedural",
      "date": "1958-06-25",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Thimmayya and Venkatanarsu lodged petitions under Art. 226 of the Constitution in the High Court of Andhra Pradesh at Hyderabad, praying that writs of certiorari or other appropriate writs be issued quashing the order dated June 25, 1958 of the Income-tax Officer under s. 46(5).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The petitions were decided by Seshachelapati J., in favour of the two petitioners, and the decision was confirmed in appeal by a Division Bench of the High Court of Andhra Pradesh.",
      "type": "procedural",
      "date": "1961-08-03",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Judgment and orders dated August 3, 1961 of the Andhra Pradesh High Court in Writ Appeals Nos. 49 and 50 of 1960.",
      "type": "procedural",
      "date": "1961-08-03",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether after the Income-tax Officer recorded an order on June 30, 1952 under s. 25-A(1) that the family had disrupted with effect from November 2, 1946, steps taken for recovery of the amount of tax assessed without an appropriate order under s. 25-A(2) were invalid.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether arrears of tax due by the erstwhile Hindu undivided family could be recovered from remuneration earned by Thimmayya and Venkatanarsu as employees of the Company.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether an order under s. 25-A(1) made subsequent to the assessment orders can reopen the final assessments and trigger personal liability under the proviso to s. 25-A(2).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The order on the claim made under s. 25-A(1) on June 30, 1952 was given a clear retrospective operation, and the Income-tax Officer was bound to give effect to that order recognising the partition and to follow up the consequences which flowed from the order.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "s. 25-A(1) and (2)"
    },
    {
      "id": "pa2",
      "text": "The second paragraph of sub-s. (2) which is in the form of a proviso, is in substance a substantive provision imposing joint and several liability for tax assessed on the total income received by or on behalf of the joint family against all members of the family once partition is effected, whether recorded or not under sub-s. (1).",
      "supporting_facts": [
        "f2",
        "f12"
      ],
      "legal_basis": "Proviso to s. 25-A(2)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "After the Income-tax Officer recorded an order under s. 25-A(1) that the family had disrupted, steps taken for recovery without an appropriate order under s. 25-A(2) were invalid.",
      "supporting_facts": [
        "f12",
        "f13"
      ],
      "legal_basis": "s. 25-A(2); proviso to sub-s. (2) of s. 25-A"
    },
    {
      "id": "ra2",
      "text": "Arrears of tax due by the erstwhile Hindu undivided family could not be recovered from remuneration earned by them as employees of the Company.",
      "supporting_facts": [
        "f5",
        "f13"
      ],
      "legal_basis": "s. 46(5); s. 25-A"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The scheme of s. 25-A is that a Hindu undivided family hitherto assessed in respect of its income will continue to be assessed in that status notwithstanding partition of the property among its members unless an order recording partition is passed under sub-s. (1) at the time of assessment.",
      "addresses_issue": "i3",
      "key_observation": "Failure to make an order on the claim made does not affect the jurisdiction of the Income-tax Officer to make an assessment of the Hindu family which had hitherto been assessed as undivided."
    },
    {
      "id": "cr2",
      "text": "The Act contains no machinery authorising an Income-tax Officer to re-open an assessment of a Hindu undivided family relying upon an order made by him under s. 25-A(1) after the order of assessment is made.",
      "addresses_issue": "i1",
      "key_observation": "Assessments had become final after confirmation by the Tribunal without objection to the procedure."
    },
    {
      "id": "cr3",
      "text": "In the absence of an order under s. 25-A(1) before assessments and consequent proceedings under sub-s. (2), liability to pay tax must rest upon the property of the Hindu undivided family; it cannot be enforced against the members personally.",
      "addresses_issue": "i2",
      "key_observation": "The Income-tax Officer cannot attach personal remuneration under s. 46(5) without personal liability arising under proviso to s. 25-A(2)."
    },
    {
      "id": "cr4",
      "text": "The proviso to sub-s. (2) makes members jointly and severally liable only after an order under sub-s. (1) is recorded and assessments apportioned thereunder.",
      "addresses_issue": "i1",
      "key_observation": "Proviso operates only where such an order has been passed."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "An order of assessment which has become final is not liable to be re-opened under s. 25-A(2) by the Income-tax Officer when an order under s. 25-A(1) is passed subsequent to the order of assessment.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Without an order under s. 25-A(1) and proceedings under sub-s. (2), tax liability remains on the property of the HUF and members are not personally liable; recovery from personal salaries under s. 46(5) is invalid.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 3",
        "s. 14(1)",
        "s. 23",
        "s. 25-A(1)",
        "s. 25-A(2)",
        "s. 46(5)"
      ],
      "relevance": "Governs assessment of HUF post-partition; requires order under s.25A(1) for recording partition and s.25A(2) for apportionment and personal liability; s.46(5) for salary attachment invalid without personal liability."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Basis for writ petitions quashing the recovery order."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals filed by the Income-tax Officer are dismissed. The order of the High Court quashing the order under s.46(5) is confirmed, as respondents are not personally liable without prior s.25A(1) order and apportionment under s.25A(2); recovery must be from HUF property.",
    "relief_granted": "Writs upheld; order under s.46(5) quashed.",
    "costs": "Appeals dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "The scheme of S. 25-A is therefore clear a Hindu undivided family hitherto assessed in respect of its income will continue to be assessed in that status notwithstanding partition of the property among its members.",
      "speaker": "court",
      "significance": "Explains core operation of s.25A."
    },
    {
      "text": "Liability which so long as an order was not recorded under s. 25-A(1) was restricted to the assets of the Hindu undivided family is by virtue of the proviso to sub-s. (2) transformed when the order is recorded, into personal liability of the members.",
      "speaker": "court",
      "significance": "Key to distinguishing family asset liability from personal liability."
    },
    {
      "text": "The High Court was, in our judgment, in error in holding that an order of assessment which has become final is liable to be re-opened under s. 25-A(2) by the Income-tax Officer, when an order under s. 25-A(1) is passed by him subsequent to the order of assessment.",
      "speaker": "court",
      "significance": "Rejects High Court's reasoning but upholds result."
    }
  ],
  "_case_id": "1964_77",
  "_label": 0,
  "_text_length": 18206,
  "_extracted_at": "2026-02-10T19:43:27.551976"
}