{
  "metadata": {
    "case_name": "Mst. Basmati Devi v. Chamroo Sao & Anr.",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "DAS GUPTA, J."
    ],
    "case_number": "Civil Appeal No. 241 of 1961",
    "date_of_judgment": "1964-04-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plaintiff owned 1.67 acres of lands recorded in Khata 56 and 10.56 acres in Khata 57 in village Sarifabad.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Plaintiff gave 1.27 acres out of Khata 56 and 8.24 acres out of Khata 57 in usufructuary mortgage to several defendants by separate mortgage bonds.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Under terms of mortgage bonds, mortgagees were liable to pay rent to the landlord.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Part of remaining land sold by plaintiff and rest settled with first defendant on Batai terms.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Mortgagees defaulted in payment of rent for some years.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Landlord brought suit for arrears of rent and obtained decree; lands sold in execution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Purchasers at sale: Besolal and Mst. Kirti Kuer, alleged by plaintiff to be benamidars of defendants 1 and 2 and other mortgagees.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Plaintiff claimed purchase enured for his benefit as mortgagor; right of redemption not affected.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Defendants 1 (Chamroo Sao, purchaser) and 2 (Besolal, son of Mst. Kirti Kuer) contested suit; denied benami; claimed right of redemption extinguished by court sale.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Trial Court held plaintiff failed to prove auction purchasers were benamidars of mortgagees; dismissed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Additional District Judge, Patna, on appeal: held purchase really by first and second defendants; mortgagees liable for rent; rent sale due to default of mortgagees; equity of redemption subsists; set aside trial court judgment, passed preliminary decree for redemption.",
      "type": "procedural",
      "date": "1958-03-04",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court (Patna): Single Judge (Sahai J.) found rent liability: 2.67 acres on def 1; 8.7 acres purchased + 1.76 acres ijra (total 2.43? acres? text unclear) on def 2; 3.83 acres on other defs; plaintiff liable for 3.39 acres out of total 1.67 (Khata 56) + 10.65 (Khata 57). Referred s.90 Trusts Act to Division Bench.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Division Bench held s.90 Trusts Act does not apply where sale due to default of mortgagor and mortgagee; allowed appeal, set aside first appellate decree, restored trial court decree.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Appeal to Supreme Court by Mst. Basmati Devi, legal representative of original plaintiff.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Two khatas (56 and 57) consolidated into one holding with one rental; rent suit and sale on consolidated holding.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Ex.2 mortgage bond for Khata 57: 'Annual rent payable to the zamindar is the concern of me, the executant' (mortgagor).",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether s.90 of the Indian Trusts Act applies where rent sale and purchase by mortgagees (benami) occurred due to default of both mortgagor and mortgagees, keeping equity of redemption alive.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether mortgagees liable for rent on Khata 57 lands post-consolidation.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court view (and prior Patna decisions) incorrect; defeats object of s.90 Trusts Act.",
      "supporting_facts": [
        "f8",
        "f11"
      ],
      "legal_basis": "Section 90 Indian Trusts Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Suit should fail as regards lands in Khata No.57 as mortgagees not liable for rent per Ex.2; mortgagor accepted liability.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "Ex. 2 mortgage bond"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Mortgagee defaulted in paying rent he was liable for, contributing to suit and sale; purchased at sale availing position as mortgagee; s.90 applies even if mortgagor also defaulted and mortgagee liable for substantial portion.",
      "addresses_issue": "i1",
      "key_observation": "Fact that mortgagor defaulted does not alter that mortgagee also defaulted and contributed to sale by availing his position."
    },
    {
      "id": "cr2",
      "text": "Khata 56 and 57 consolidated into one holding; Ex.2 does not affect as sale on consolidated holding with shared liability.",
      "addresses_issue": "i2",
      "key_observation": "Consolidation confirmed by prior judgment; default by both brought about sale."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 90 Indian Trusts Act applies; mortgagee who purchases at sale due to his own default (even joint with mortgagor) holds for benefit of mortgagor; equity of redemption subsists.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Mortgagees liable for portion of rent on consolidated holding including Khata 57.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Previous decisions of Patna High Court",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "High Court followed these holding s.90 inapplicable if mortgagor default; SC disagrees."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Trusts Act",
      "sections": [
        "Section 90"
      ],
      "relevance": "Mortgagee gaining advantage by purchase at sale due to his default holds for benefit of persons interested (mortgagor), subject to repayment of share."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "Section 76"
      ],
      "relevance": "Contrasted; where entire rent burden on mortgagee, but s.90 not limited to that."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court judgment and decree set aside; decree of Additional District Judge restored with preliminary decree for redemption; Pleader Commissioner to be appointed for accounts on deposit of Rs.50/-; respondents to pay court-fees on plaint, appeal memo, and SC appeal.",
    "relief_granted": "Preliminary decree for redemption of usufructuary mortgages; accounts to be taken.",
    "costs": "First and second defendants to pay court-fee on plaint, memorandum of appeal before District Judge, and Supreme Court appeal; High Court order for plaintiff to pay fees set aside."
  },
  "key_quotes": [
    {
      "text": "\"By his default he has contributed to the position that a suit had to be brought for arrears of rent and ultimately to the position that the property was put to sale in execution of the decree obtained in the suit. This contribution to the bringing about of the sale was a direct result of his position as a mortgagee.\"",
      "speaker": "court",
      "significance": "Core reasoning why s.90 applies despite joint default."
    },
    {
      "text": "\"To say in such circumstances that they did not take advantage of their position as mortgagees is entirely unrealistic.\"",
      "speaker": "court",
      "significance": "Rejects High Court view; emphasizes realism in applying s.90."
    },
    {
      "text": "Section 90: \"Where a tenant for life, co-owner, mortgagee or other qualified owner of any property, by availing himself of his position as such, gains an advantage in derogation of the rights of the other persons interested in the property... he must hold... the advantage so gained but subject to repayment by such persons of their due share...\"",
      "speaker": "court",
      "significance": "Full text of key provision interpreted."
    }
  ],
  "_case_id": "1964_180",
  "_label": 1,
  "_text_length": 11415,
  "_extracted_at": "2026-02-10T19:44:45.922402"
}