{
  "metadata": {
    "case_name": "Mugneeram Bangur & Co. v. Gurbachan Singh",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Civil Appeal No. 180 of 1962",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant company had divided land into building plots under Lake Colony Scheme by constructing roads and drains.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Plaintiff-respondent entered into contract with company by letter (probably dated May 14, 1941) to purchase plots Nos. 245 and 246, paid Rs. 202/- earnest money. Willing to purchase at Rs. 1,075/- per katta, complete transaction within one month from completion of road, time essence of contract, earnest forfeited if fail.",
      "type": "material",
      "date": "1941-05-14",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Different portions of land covered by scheme requisitioned by Government between November 12, 1941 and July 25, 1944. Plots contracted by respondent requisitioned by order dated February 18, 1944.",
      "type": "material",
      "date": "1941-11-12 to 1944-07-25",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Company sent circular notice on December 24, 1943 to contract holders: considerable portion requisitioned, cannot construct roads/drains during war; treat agreement cancelled and refund earnest within one month, or complete registration as is within one month, else deemed cancelled and earnest forfeited.",
      "type": "material",
      "date": "1943-12-24",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Respondent's attorneys wrote on May 8, 1946: learnt government de-requisitioning, inquire when company can deliver possession.",
      "type": "procedural",
      "date": "1946-05-08",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Company replied May 29, 1946: refer to circular, failure to exercise options, agreement cancelled, earnest forfeited.",
      "type": "procedural",
      "date": "1946-05-29",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Respondent's attorneys replied June 13, 1946: no receipt of circular, ask when roads to be completed to enable conveyance within one month, call upon to intimate expected date within 7 days, else legal steps.",
      "type": "procedural",
      "date": "1946-06-13",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Suit instituted by respondent on August 8, 1946 in Court of Second Subordinate Judge at Alipore for specific performance.",
      "type": "procedural",
      "date": "1946-08-08",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Suit decreed by trial court, decree upheld by Calcutta High Court on January 28, 1959 (Original Decree No. 226 of 1952).",
      "type": "procedural",
      "date": "1959-01-28",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Development work (roads and drains) completed by time of High Court appeal hearing.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Requisition order served on company: place land at disposal of Military Estates Officer from November 14, 1941 until six months after war termination unless earlier relinquished. Company lost possession and access.",
      "type": "material",
      "date": "1941-11-14",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the contract has been discharged by reason of frustration due to requisitioning orders making performance impossible or unlawful.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the suit for specific performance was premature as right to conveyance arises only after completion of development.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Contract discharged by frustration: performance rendered impossible due to requisitioning (temporary but made construction impracticable); also unlawful as entry on land by company would violate Defence of India Rules.",
      "supporting_facts": [
        "f3",
        "f4",
        "f11"
      ],
      "legal_basis": "Section 56 Contract Act; Denny Mott & Dickson Ltd. v. James B. Fraser Co. Ltd."
    },
    {
      "id": "pa2",
      "text": "Suit premature because under agreement, no right to sale deed till after development completed.",
      "supporting_facts": [
        "f2",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Circular of Dec 24, 1943 offered options, respondent failed to exercise, so cancelled.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Did not receive circular; insists on completion of roads then conveyance within one month as per agreement.",
      "supporting_facts": [
        "f2",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Discharge by frustration governed by S.56 and S.32 Contract Act, not implying terms as in England. Earlier decision in Satyabrata Ghose binds: requisition temporary, no time limit for development specified (parties aware of war risks, scarcity), so not frustrated by impossibility.",
      "addresses_issue": "i1",
      "key_observation": "Requisitioning only temporary, parties deliberately no time limit for roads/drains."
    },
    {
      "id": "cr2",
      "text": "Performance unlawful only temporarily (construction during requisition illegal under Defence of India Rules), not for all time. Contract not discharged unless unlawfulness at time performance due; here no fixed time for development, time essence only post-roads completion for conveyance.",
      "addresses_issue": "i1",
      "key_observation": "Ban temporary/indeterminate but not permanent; no time essence for development."
    },
    {
      "id": "cr3",
      "text": "S.46 Contract Act: reasonable time presumed, but parties knew circumstances, excluded war/requisition delays.",
      "addresses_issue": "i1",
      "key_observation": "Parties intended to exclude requisition time from reasonable time computation."
    },
    {
      "id": "cr4",
      "text": "Suit not premature: development completed by High Court hearing; courts can take notice of subsequent events to mould relief.",
      "addresses_issue": "i2",
      "key_observation": "Work completed when appeal heard."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Contract not discharged by frustration; requisitioning did not render performance impossible or permanently unlawful.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Suit for specific performance not premature; relief moulded considering subsequent completion of development.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Satyabrata Ghose v. Mugneeram Bangur & Co.",
      "citation": "1954 S.C.R. 310",
      "treatment": "followed",
      "relevance": "Binding decision on frustration due to requisitioning in similar Lake Colony Scheme contracts; left open unlawfulness point but observations relevant."
    },
    {
      "case_name": "Denny Mott & Dickson Ltd. v. James B. Fraser Co. Ltd.",
      "citation": "1944 A.C. 265",
      "treatment": "referred",
      "relevance": "Cited by counsel on discharge when performance unlawful; court distinguished temporary vs. permanent/indeterminate unlawfulness."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Contract Act",
      "sections": [
        "Section 32",
        "Section 46",
        "Section 56"
      ],
      "relevance": "Governs frustration: discharge if performance impossible or unlawful due to supervening events; no implied terms; reasonable time presumed but context excludes war delays."
    },
    {
      "name": "Defence of India Rules",
      "sections": [
        "Rule 75A sub-rule 7",
        "Rule 7"
      ],
      "relevance": "Requisition orders made entry/construction unlawful during subsistence; punishment for disobedience."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; decree of lower courts upheld granting specific performance to respondent as contract not frustrated and development completed.",
    "relief_granted": "Specific performance of contract upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the requisitioning of the land was only for a temporary period. Further the parties had deliberately not placed any time limit within which roads and drains had to be made\"",
      "speaker": "court",
      "significance": "Core reason contract not frustrated."
    },
    {
      "text": "\"if the performance of the contract is rendered unlawful either for a determinate period of time or for an indeterminate period of time the contract would not stand discharged unless the ban on its performance existed on the day or during the time in which it has to be performed.\"",
      "speaker": "court",
      "significance": "Distinguishes temporary unlawfulness from frustrating the contract."
    },
    {
      "text": "\"The Court would in such a case be justified in taking notice of subsequent events in moulding its relief accordingly.\"",
      "speaker": "court",
      "significance": "Justifies not dismissing suit as premature."
    }
  ],
  "_case_id": "1964_327",
  "_label": 0,
  "_text_length": 17130,
  "_extracted_at": "2026-02-10T19:46:58.201870"
}