{
  "metadata": {
    "case_name": "Appellant v. State",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Criminal Appeal No. 134 of 1962",
    "date_of_judgment": "1964-03-23"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Madras Public Service Commission published notification in Fort St. George Gazette dated August 3, 1948, inviting applications for permanent appointment as Assistant Surgeons in Madras Medical Service (Men's Section) from persons who rendered temporary service between September 3, 1939 and December 31, 1947, or War Service, possessing qualifications: registered under Madras Medical Registration Act, 1914, and L.M.S. or M.B., B.S. degree.",
      "type": "background",
      "date": "1948-08-03",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant, serving as temporary Civil Assistant Surgeon, applied falsely representing: name Kaza Krishnamurthy, birth Bezwada Krishna district, father K. R. Rao of Bezwada, held M.B.B.S. II Class from Andhra Medical College, Vizagapatam, Andhra University.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant convicted under s. 419 I.P.C. for cheating Service Commission by personating Kaza Krishnamurthy and misrepresenting qualifications, deception likely to damage reputation.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Appellant also tried for s. 420 and s. 465 I.P.C. related to acts in June and October 1944; trial court acquitted s. 465, convicted s. 420; Sessions Judge acquitted s. 420, confirmed s. 419; High Court dismissed revision on July 17, 1962.",
      "type": "procedural",
      "date": "1962-07-17",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Appellant interviewed by Service Commission (no written competitive examination or admission card issued), selected and recommended to Government for appointment as Civil Assistant Surgeon Class II.",
      "type": "material",
      "date": "1948",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Government appointed appellant, who served efficiently for about 10 years with good reports from superiors until case institution.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Service Commission sent list of successful candidates (including appellant's qualifications as M.B.B.S.) to Surgeon-General/Government for appointment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant committed the offence of cheating under s. 419 I.P.C. read with s. 415 I.P.C. by deceiving the Service Commission or the Government.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the deception of the Service Commission caused or was likely to cause damage to its reputation.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether any property (admission card) was delivered to appellant by Service Commission.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether the Government was deceived by the misrepresentation and induced to appoint and pay salary to appellant.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "No offence under s. 419 I.P.C. as appellant's efficiency not disputed, good reports from superiors, no damage to Service Commission's reputation.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s. 415 I.P.C."
    },
    {
      "id": "pa2",
      "text": "No property like admission card delivered; person deceived was Service Commission, not Government.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "s. 415 I.P.C."
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant cheated Service Commission, obtained admission card (property) entitling to competitive examination; deceived Government, induced appointment and salary payment.",
      "supporting_facts": [
        "f2",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "s. 415, 419 I.P.C."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Cheating under latter part of s. 415 requires deception inducing act/omission causing/likely to cause damage; no likelihood of damage to Service Commission reputation as appellant served efficiently 10 years, no evidence of detection or inefficiency.",
      "addresses_issue": "i2",
      "key_observation": "Appellant did not commit offence under latter part of s. 415 against Service Commission."
    },
    {
      "id": "cr2",
      "text": "No evidence of competitive written examination or admission card issued; only interview per records.",
      "addresses_issue": "i3",
      "key_observation": "No cheating under first part of s. 415 against Service Commission as no property delivered."
    },
    {
      "id": "cr3",
      "text": "Appointments by Government; Service Commission selects and recommends; misrepresentation in application to Commission continues to Government as final authority; Government believed qualifications via Commission's scrutiny and recommendation.",
      "addresses_issue": "i4",
      "key_observation": "Deception of statutory independent adviser (Commission) is deception of Government."
    },
    {
      "id": "cr4",
      "text": "Government induced to appoint and pay salary (property) which it would not have done absent deception.",
      "addresses_issue": "i1",
      "key_observation": "Principle from precedents: deception of agent/servant is deception of principal/authority."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No cheating of Service Commission under s. 415 I.P.C. as no damage to reputation or delivery of property.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Appellant deceived Government via continued misrepresentation, dishonestly induced delivery of property (salary).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of U.P. v. Manbodhan Lal Srivastava",
      "citation": "1958 S.C.R. 533",
      "treatment": "referred",
      "relevance": "Public Service Commission is independent statutory body advising Government on appointments."
    },
    {
      "case_name": "Crown v. Gunput",
      "citation": "1868 Punj. Rec. Col. Case No. 6",
      "treatment": "followed",
      "relevance": "Deception of ticket collector is deception of railway company."
    },
    {
      "case_name": "P. E. Billinghurst v. H. P. Blackburn",
      "citation": "27 C.W.N. 821; I.L.R. 51 Cal. 250",
      "treatment": "followed",
      "relevance": "Deception of government officials leading to payment is cheating government."
    },
    {
      "case_name": "Legal Remembrancer v. Manmatha Bhusan Chatterjee",
      "citation": null,
      "treatment": "followed",
      "relevance": "Deception of railway officers inducing allotment is cheating railway company."
    },
    {
      "case_name": "Legal Remembrancer v. Hridoy Narain",
      "citation": null,
      "treatment": "followed",
      "relevance": "Deception of railway officers inducing wagon chalans is cheating railway company."
    },
    {
      "case_name": "Emperor v. Fazal Din",
      "citation": "1906 4 Crl. L.J. 355",
      "treatment": "followed",
      "relevance": "Deception likely to harm agent or principal (railway authorities)."
    },
    {
      "case_name": "Queen-Empress v. Appasaimi",
      "citation": null,
      "treatment": "followed",
      "relevance": "Personation deceiving superintendent cheats university authorities."
    },
    {
      "case_name": "Ashwini Kumar Gupta v. Emperor",
      "citation": null,
      "treatment": "followed",
      "relevance": "Personation at university exam cheats registrar and damages university reputation."
    },
    {
      "case_name": "In re Hampshire Land Company",
      "citation": null,
      "treatment": "referred",
      "relevance": "Lender can assume internal management valid; analogous to government relying on commission."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "s. 415",
        "s. 419",
        "s. 420",
        "s. 465"
      ],
      "relevance": "Defines cheating; conviction under s. 419 for impersonation and cheating by deception inducing delivery of property or damage."
    },
    {
      "name": "Madras Medical Registration Act, 1914",
      "sections": [],
      "relevance": "Applicants must be registered practitioners."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "s. 241",
        "s. 266",
        "s. 264"
      ],
      "relevance": "Governors appoint to provincial services; Public Service Commission conducts exams, consulted on recruitment and suitability."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 320"
      ],
      "relevance": "Corresponding provisions emphasizing independence of Public Service Commission."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal against conviction under s. 419 I.P.C. dismissed as court held appellant cheated Government by deception leading to appointment and salary payment.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Whoever, by deceiving any person, fraudulently or dishonestly induces the person so deceived to deliver any property to any person...\"",
      "speaker": "court",
      "significance": "Quotes s. 415 I.P.C. defining cheating."
    },
    {
      "text": "Deception of such an adviser is deception of the Government which is expected to pay heed to its advice and act accordingly.",
      "speaker": "court",
      "significance": "Core holding on deception of PSC equating to deception of Government."
    },
    {
      "text": "A false representation in an application to the Service Commission continues and persists to be so till the application is considered by the final authority.",
      "speaker": "court",
      "significance": "Explains continuity of misrepresentation to appointing Government."
    }
  ],
  "_case_id": "1964_171",
  "_label": 0,
  "_text_length": 20572,
  "_extracted_at": "2026-02-10T19:45:08.608040"
}