{
  "metadata": {
    "case_name": "Petition by Advocate enrolled in Madras High Court",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Ayyangar, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner enrolled in Madras High Court on November 15, 1955 under the Indian Bar Councils Act, 1926.",
      "type": "background",
      "date": "1955-11-15",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Petitioner admitted to the rolls of Supreme Court on October 29, 1960 under Order IV of the Supreme Court Rules as then stood.",
      "type": "background",
      "date": "1960-10-29",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Petitioner is an Advocate entitled to practise in Supreme Court under Advocates Act, 1961.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Petition filed challenging validity of Rule 16 of Order IV of Supreme Court Rules as amended in 1962.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Prayer for declaration that Rule 16 is ultra vires and petitioner entitled to practise as Advocate on Record without complying with Rule 16.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Rule 16: No Advocate qualified as Advocate on Record unless (1) undergone training for one year with approved Advocate on Record and passed tests notified in Gazette (Attorneys exempted); (2) has office in Delhi within 10 miles of Court House and undertaking to employ registered clerk within one month; (3) pays Rs. 25 fee.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Rule 17: Advocate on Record entitled to act as well as plead on filing memorandum of appearance with Vakalatnama. No other Advocate entitled to file appearance or act.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Every Advocate on common roll under s.20 Advocates Act entitled to plead, but only registered Advocates on Record entitled to act.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Petitioner argued case in person.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Proper construction of Art. 145(1)(a) of the Constitution in context of prayer for declaration that Rule 16 of Order IV of Supreme Court Rules is invalid.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether impugned Rules 16 and 17 are valid exercises of rule-making power under Art. 145(1)(a), or ultra vires in light of s.58(3) Advocates Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "As Advocate entitled to practise in Supreme Court under Advocates Act, 1961, entitled as of right not merely to plead but also to act; rules prescribing qualifications to act are invalid.",
      "supporting_facts": [
        "f3",
        "f6",
        "f7"
      ],
      "legal_basis": "s.58(3) Advocates Act, 1961"
    },
    {
      "id": "pa2",
      "text": "Right to practise includes right to plead and act; rules under Art.145 subject to parliamentary law like s.58(3), which grants absolute right not controlled by rules.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": "Art.145(1)(a) Constitution; Aswini Kumar Ghosh v. Arabinda Bose (1953 SCR 1)"
    },
    {
      "id": "pa3",
      "text": "Art.145(1)(a) 'rules as to the persons practising before the Court' narrower than 'persons entitled to practise' (Entry 77 List I); cannot prescribe qualifications or entitlement, only regulate conduct of those already entitled by Parliament.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Art.145(1)(a); Sch.VII List I Entry 77"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Words 'persons practising before the Court' in Art.145(1)(a) not narrower than 'persons entitled to practise'; comprehensive to include prescribing qualifications for entitlement.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Art.145(1)(a); s.214(1) Govt of India Act 1935"
    },
    {
      "id": "ra2",
      "text": "Rules justified under inherent powers of Court.",
      "supporting_facts": [],
      "legal_basis": "In re Sant Ram"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.58(3) Advocates Act entitles petitioner to practise as of right subject to rules made by Supreme Court; right to practise includes plead and act if no rules, but subject to rules.",
      "addresses_issue": "i2",
      "key_observation": "s.58(3) expressly subjects right to rules made by Supreme Court."
    },
    {
      "id": "cr2",
      "text": "s.52 Advocates Act saves Supreme Court's rule-making power under Art.145, including determining persons entitled to act.",
      "addresses_issue": "i2",
      "key_observation": "No conflict with parliamentary law due to savings in s.52."
    },
    {
      "id": "cr3",
      "text": "Art.145(1)(a) 'rules as to the persons practising before the Court' is independent head of power, not limited to regulating conduct of those already entitled; includes prescribing qualifications for entitlement.",
      "addresses_issue": "i1",
      "key_observation": "Word 'including' and subject matter stamp it as independent; drawn from s.214(1) Govt of India Act 1935, under which Federal Court prescribed qualifications."
    },
    {
      "id": "cr4",
      "text": "No anomaly in Court prescribing qualifications subject to override by parliamentary law per opening words of Art.145.",
      "addresses_issue": "i1",
      "key_observation": "Rules operate subject to laws made by Parliament."
    },
    {
      "id": "cr5",
      "text": "Aswini Kumar Ghosh distinguished as based on implied repeal by specific enactment overriding High Court rules.",
      "addresses_issue": "i2",
      "key_observation": "Does not carry matter far here."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Impugned Rules 16 and 17 valid and within rule-making power under express terms of Art.145(1)(a).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Aswini Kumar Ghosh and Anr. v. Arabinda Bose and Anr.",
      "citation": "1953 S.C.R. 1",
      "treatment": "distinguished",
      "relevance": "Explained 'right to practise' includes plead and act; held 1951 Act prevailed over High Court rules, but distinguished as implied repeal not applicable here."
    },
    {
      "case_name": "In re Sant Ram",
      "citation": null,
      "treatment": "referred",
      "relevance": "Inherent powers of Supreme Court referred to, but not relied upon as decision rests on Art.145(1)(a)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 145(1)(a)"
      ],
      "relevance": "Empowers Supreme Court to make rules as to persons practising before the Court, held sufficient for Rules 16 and 17."
    },
    {
      "name": "Advocates Act, 1961",
      "sections": [
        "s.58(3)",
        "s.52",
        "s.20"
      ],
      "relevance": "s.58(3) grants right to practise subject to SC rules; s.52 saves Art.145 powers including determining persons entitled to act."
    },
    {
      "name": "Indian Bar Councils Act, 1926",
      "sections": [],
      "relevance": "Petitioner enrolled thereunder; referenced in s.58(3)."
    },
    {
      "name": "Supreme Court Advocates (Practice in High Courts) Act, 1951",
      "sections": [
        "s.2"
      ],
      "relevance": "Cited in Aswini Kumar for 'right to practise' meaning plead and act."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "s.214(1)"
      ],
      "relevance": "Precursor to Art.145(1)(a); Federal Court used similar words to prescribe qualifications for Advocates."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Petition challenging validity of Rule 16 Order IV Supreme Court Rules dismissed; rules held valid under Art.145(1)(a).",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'right to practise would in its normal connotation take in, not merely right to plead but the right to act as well'",
      "speaker": "court",
      "significance": "Confirms petitioner's view on scope of right, but holds subject to rules."
    },
    {
      "text": "We are inclined to read item (a) as an independent head of rule making power and not as merely a part of a power to make rules for regulating the practice and procedure of the Court.",
      "speaker": "court",
      "significance": "Core holding on construction of Art.145(1)(a)."
    },
    {
      "text": "the words persons practising before the Court were then used in a comprehensive sense so as to include a rule not merely as to the manner of practice but also of the right to practise",
      "speaker": "court",
      "significance": "Interprets scope based on historical usage."
    }
  ],
  "_case_id": "1964_89",
  "_label": 0,
  "_text_length": 14488,
  "_extracted_at": "2026-02-10T19:43:26.350054"
}