{
  "metadata": {
    "case_name": "Kumaranand v. Brij Mohan Lal",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 644 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "At the last general elections held in February 1962 the appellant Kumaranand contested a seat in the Rajasthan Legislative Assembly from the Beawar constituency and was declared elected.",
      "type": "background",
      "date": "1962-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Brij Mohan Lal who was a candidate at the election then presented a petition challenging the election of the appellant on the ground that the appellant had in the course of the election committed corrupt practices within the meaning of s. 123(4) of the Representation of the People Act, 1951, by publishing a poem containing false statements of fact relating to the personal character and conduct of the applicant Brij Mohan Lal and which were highly prejudicial to his election prospects.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "The Election Tribunal declared the appellants election void under s. 100(1)(b) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Against the order of the Tribunal, the appellant appealed to the High Court of Rajasthan at Jodhpur in D. B. Election Appeal No 93 of 1963.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "At the hearing of the appeal it was contended by the respondent Brij Mohan Lal, inter alia, that the appellant had failed to enclose with the memorandum of appeal a Government Treasury receipt showing that a deposit of five hundred rupees had been made by him in favour of the Election Commission as security for the costs of the appeal, and his appeal was, on that account, not maintainable.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The High Court held that the appellant had failed to comply with the provisions of s. 119A of the Act and on that account the appeal filed by him was incompetent.",
      "type": "procedural",
      "date": "1964-02-25",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "The High Court declined to accede to the request made by the appellant to condone the delay, if any, in the filing of the appeal under the proviso to s. 116A(3) and to rectify the defect arising from the appellants failure to enclose a Government Treasury receipt for Rs. 500 as required by s. 119A, and dismissed the appeal.",
      "type": "procedural",
      "date": "1964-02-25",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "With special leave, this appeal has been preferred by the appellant.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Instead of enclosing with the memorandum of appeal a Government Treasury receipt showing that a deposit of Rs. 500 had been made in favour of the Election Commission, the appellant through his Advocate Vijay Chandra Mehta tendered on October 21, 1963, the amount of Rs. 500 in the office of the Registrar of the High Court. The amount tendered was accepted and was duly credited in the name of the appellant as security deposit.",
      "type": "procedural",
      "date": "1963-10-21",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "The tender form for payment into Court of the security for costs, as completed by the office of the Registrar, High Court, Rajasthan, indicated: Original tender 771/21-10-63 R.D. No. 239/31-10-63; Name of party: Shri Kumaranand; Name of parties and number: Kumaranand v. Brij Mohan Lal D. B. Election appeal/63; Nature of payment: Security Deposits; Amount: Rs. 500; Office report: May be deposited.",
      "type": "material",
      "date": "1963-10-21",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The receipt was then entered in the Register and it was ordered by the Accountant that it may be filed with the record.",
      "type": "procedural",
      "date": "1963-10-31",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The Deputy Registrar of the High Court accepted the presentation and numbered the appeal without raising any objection to the procedure followed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Notice of the appeal was issued to the respondent. The objection to the regularity in the procedure was brought to the notice of the Court only at the hearing.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether failure to comply with s. 119A of the Representation of the People Act, 1951 by not enclosing a Government Treasury receipt showing deposit of Rs. 500 in favour of the Election Commission renders the appeal incompetent and liable to dismissal.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the High Court has jurisdiction to rectify the mistake in making the deposit for costs and proceed with the appeal despite non-compliance with s. 119A.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Requested the High Court to condone the delay, if any, in the filing of the appeal under the proviso to s. 116A(3) and to rectify the defect arising from failure to enclose a Government Treasury receipt for Rs. 500 as required by s. 119A.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Proviso to s. 116A(3) of the Representation of the People Act, 1951"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The appellant had failed to enclose with the memorandum of appeal a Government Treasury receipt showing that a deposit of five hundred rupees had been made by him in favour of the Election Commission as security for the costs of the appeal, and his appeal was, on that account, not maintainable.",
      "supporting_facts": [
        "f5",
        "f9"
      ],
      "legal_basis": "s. 119A of the Representation of the People Act, 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "This deposit of Rs. 500 in the High Court manifestly did not comply with the requirements of s. 119A of the Act. The tender form did not indicate that the deposit was at the disposal of the Election Commission or that it was to be utilised in the manner authorised by law.",
      "addresses_issue": "i1",
      "key_observation": "Failure to comply with s. 119A does not necessarily result in the dismissal of the appeal, for the Act imposes no express penalty for non-compliance with the requirements of that section."
    },
    {
      "id": "cr2",
      "text": "No similar penalty is prescribed by the Legislature in the matter of failure to comply with the requirements of s. 119A, unlike for other sections such as s.90(3). The Legislature has deliberately made a distinction between failure to comply with certain requirements.",
      "addresses_issue": "i1",
      "key_observation": "In cases where the election law does not prescribe the consequence or does not lay down penalty for non-compliance with certain procedural requirements, the jurisdiction of the tribunal is not affected."
    },
    {
      "id": "cr3",
      "text": "An amount of Rs. 500 was intended to be and was in fact deposited by the appellant as security for costs of the respondent. The Advocate acted negligently, but the office of the Registrar shared the ignorance, accepted the deposit, numbered the appeal, issued notice, and objection raised only at hearing.",
      "addresses_issue": "i2",
      "key_observation": "In the absence of any penalty prescribed, the jurisdiction of the High Court to entertain the appeal is not affected. The Court may exercise discretion to permit rectification of the mistake."
    },
    {
      "id": "cr4",
      "text": "The conduct of the office of the Registrar in accepting the deposit and defective presentation contributed to the irregularity. It is the duty of the Court to take care that the act of the Court does no injury to any suitor.",
      "addresses_issue": "i2",
      "key_observation": "The High Court erred in not taking into consideration the conduct of the office and should have directed rectification by depositing the amount in Government Treasury in favour of the Election Commission."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Failure to comply with s. 119A does not render the appeal incompetent or affect jurisdiction, as no express penalty is provided, and the court may permit rectification.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court has jurisdiction to direct rectification of the defect by obtaining Government Treasury receipt in favour of Election Commission and proceed to hear the appeal on merits.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jagan Nath v. Jaswant Singh and Ors.",
      "citation": "1954 S.C.R. 892, 895",
      "treatment": "followed",
      "relevance": "General rule that statutory requirements of election law must be strictly observed, but if no penalty prescribed for non-compliance with procedural requirements, jurisdiction not affected."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "s. 123(4)",
        "s. 100(1)(b)",
        "s. 119A",
        "s. 116A(3)",
        "s. 121",
        "s. 90(3)",
        "s. 81",
        "s. 82",
        "s. 85",
        "s. 117"
      ],
      "relevance": "Governs election petitions, appeals, corrupt practices, security deposits for costs; failure to comply with s.119A has no prescribed penalty unlike others."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court set aside the order of the Rajasthan High Court dismissing the appeal, directed the High Court to give opportunity to appellant to rectify the error by depositing Rs.500 in Government Treasury in favour of Election Commission and obtaining receipt, and to proceed to hear the appeal on merits. Appeal allowed with costs to respondent.",
    "relief_granted": "Opportunity to rectify defect under s.119A and hearing on merits.",
    "costs": "Appellant to pay costs of the respondent in this appeal."
  },
  "key_quotes": [
    {
      "text": "\"Failure to comply with the requirements of s. 119A does not necessarily result in the dismissal of the appeal, for the Act imposes no express penalty for non-compliance with the requirements of that section.\"",
      "speaker": "court",
      "significance": "Core holding on absence of penalty for s.119A non-compliance."
    },
    {
      "text": "\"It is a trite saying that it is duty of the Court to take care that the act of the Court does no injury to any suitor.\"",
      "speaker": "court",
      "significance": "Justifies permitting rectification due to court's office conduct."
    },
    {
      "text": "\"The general rule is well settled that the statutory requirements of election law must be strictly observed... None of these propositions however have any application if the special law itself confers authority on a tribunal to proceed with a petition in accordance with certain procedure and when it does not state the consequence of non-compliance.\"",
      "speaker": "court",
      "significance": "Quotes and applies precedent on procedural non-compliance."
    }
  ],
  "_case_id": "1964_315",
  "_label": 1,
  "_text_length": 15165,
  "_extracted_at": "2026-02-10T19:47:01.715856"
}