{
  "metadata": {
    "case_name": "Veljibhai v. State",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar J."
    ],
    "case_number": "Criminal Appeal No. 43 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The firm, Messrs. Bharat Silp Pramandal, formed in 1954 for building construction business, originally consisted of eight partners and the appellant was its working partner.",
      "type": "admitted",
      "date": "1954",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On February 6, 1957 three of the partners retired and the business was continued by the remaining five partners.",
      "type": "admitted",
      "date": "1957-02-06",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Disputes arose amongst partners, referred to arbitration of Mr. J. T. Desai, a Solicitor.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In pursuance of arbitration award, fresh agreement Ex. N entered into by partners on June 4, 1958.",
      "type": "admitted",
      "date": "1958-06-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Under Ex. N, appellant's share 50 nP in a rupee, complainant Nagindas Jivraj Mehta's share 6 nP.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Ex. N decided no new work; appellant to complete accounts, prohibited from borrowing in firm name, to realise pending bills, security deposits, claims, dispose plant, machinery etc.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Other partners to procure finance up to Rs. 25,000 if needed; excess by all partners pro rata.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Clause 8 of Ex. N permitted appellant to withdraw Rs. 10,000 on his account sooner he realises any pending claims, bills or security deposits.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Complainant alleged misappropriation of Rs. 8,905 consisting of six items: Rs. 2,871; 3,000; 1,100; 1,100; 750; 84.",
      "type": "disputed",
      "date": null,
      "source": "complainant"
    },
    {
      "id": "f10",
      "text": "Trial court acquitted appellant on last two items (750, 84) but convicted on first four.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant admits realising first four items but says in capacity as partner, utilised for partnership business.",
      "type": "admitted",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f12",
      "text": "Complainant instituted suit for dissolution of partnership and rendition of accounts.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Meeting of partners on January 7, 1959; item 15: Shri Veljibhai agrees to recover monies due by Shri Kablasingh immediately and deposit with Bankers of firm.",
      "type": "material",
      "date": "1959-01-07",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Item 16 of minutes: If further moneys required, spent out of recoveries of firm; no partner bound to bring further moneys.",
      "type": "material",
      "date": "1959-01-07",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a partner can be convicted under s. 409, Indian Penal Code on the ground that his failure to account for monies belonging to the firm amounts to criminal breach of trust.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the appellant's acts amount to dishonest misappropriation under s. 403 IPC even if not criminal breach of trust.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellant as working partner entitled to utilise realizations for carrying on work of firm per Ex. N.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Even if failed to account for four items, liability only civil, not criminal under s. 409 IPC; partner not entrusted in fiduciary capacity.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Bhuban Mohan Rana v. Surendra Mohan Das (ILR 1952 II Cal 23)"
    },
    {
      "id": "pa3",
      "text": "Complainant instituted complaint to hinder defence in civil suit for dissolution and accounts.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "By meeting on Jan 7, 1959, appellant entrusted with duty of making recoveries from debtors, specific entrustment.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Act amounts at least to dishonest misappropriation under s. 403 IPC.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Section 403 IPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Partner has dominion over property as owner, not by entrustment; prosecution must show special agreement entrusting dominion over partnership assets.",
      "addresses_issue": "i1",
      "key_observation": "Mere existence of dominion as partner insufficient for s. 405/409 IPC."
    },
    {
      "id": "cr2",
      "text": "No special agreement; Jan 7, 1959 minutes do not preclude others from recoveries and authorise spending recoveries on business.",
      "addresses_issue": "i1",
      "key_observation": "Item 15 and 16 read together permit use for business."
    },
    {
      "id": "cr3",
      "text": "Partner's undefined ownership means no misappropriation under s. 403; only civil accountability.",
      "addresses_issue": "i2",
      "key_observation": "Owner cannot misappropriate own property."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Partner cannot be convicted under s. 409 IPC for failure to account unless special entrustment shown.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No offence under s. 403 IPC by partner using partnership property.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bhuban Mohan Rana v. Surendra Mohan Das",
      "citation": "I.L.R. 1952 II Cal. 23",
      "treatment": "followed",
      "relevance": "Partner not entrusted with fiduciary dominion over partnership property; no s. 406 IPC charge possible."
    },
    {
      "case_name": "The Queen v. Okhoy Coomar Shaw",
      "citation": "13 Bengal Law Reports 307",
      "treatment": "distinguished",
      "relevance": "Earlier view allowing partner prosecution under s. 405 not correct as ignores no defined share till accounts."
    },
    {
      "case_name": "Jagannath Raghunathdas v. Emperor",
      "citation": "A.I.R. 1932 Bom. 47",
      "treatment": "distinguished",
      "relevance": "Allowed s. 406 where specific authority to collect, but court must approach carefully re shares/debts."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 409",
        "s. 405",
        "s. 403"
      ],
      "relevance": "s. 409 requires entrustment/dominion result of entrustment; s. 403 no misappropriation by owner/partner."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; conviction under s. 409 IPC set aside as no entrustment shown; alternative under s. 403 rejected.",
    "relief_granted": "Appellant acquitted",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Every partner has dominion over property by reason of the fact that he is a partner. This is a kind of dominion which every owner of property has over his property. But it is not dominion of this kind which satisfies the requirements of s. 405.",
      "speaker": "court",
      "significance": "Core reasoning distinguishing partner dominion from entrustment."
    },
    {
      "text": "In order to establish entrustment of dominion over property to an accused person the mere existence of that persons dominion over property is not enough. It must be further shown that his dominion was the result of entrustment.",
      "speaker": "court",
      "significance": "Defines requirement for criminal breach of trust."
    }
  ],
  "_case_id": "1964_273",
  "_label": 1,
  "_text_length": 12285,
  "_extracted_at": "2026-02-10T19:46:11.548308"
}