{
  "metadata": {
    "case_name": "Jute Dealers (Appellants) v. Superintendent of Taxes, Dhubri and others (Respondents)",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeals Nos. 86 to 97 of 1962",
    "date_of_judgment": "1964-02-04"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are merchants carrying on business as dealers in jute, principal place of business at Calcutta, branch office at Dhubri in Assam, registered dealers under Assam Sales Tax Act, 1947.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellants purchased jute at Dhubri and other places in Assam and despatched bales of jute to factories outside Assam.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellants submitted returns of turnover for sales-tax for period March 1948 to March 1950 before Superintendent of Taxes, Dhubri.",
      "type": "procedural",
      "date": "1948-03 to 1950-03",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Superintendent of Taxes called upon appellants under s.17(2) to produce books of account and evidence, granted time, but appellants failed to comply.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Superintendent made best judgment assessments under s.17(4) and issued demand notices.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellants preferred appeals to Assistant Commissioner of Taxes, produced some but not all books and documents.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Before Assistant Commissioner, appellants contended s.2(12) definition beyond competence, tax on sales outside State, export tax, and goods not in Assam at time of contracts per Explanation to s.2(12).",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Assistant Commissioner dismissed appeals.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "In revision to Commissioner of Taxes, appellants contended for first time that price of jute not liable as goods not in Province per Explanation to s.2(12).",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Commissioner rejected contention after examining 'time-table of cultivation': jute planted February, ready June, marketed July to June next; contracts March-September, deliveries after July, so contracts March-July for last year's crop in Province.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Commissioner modified assessments but those modifications not in issue.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellants filed petitions under Art.226 for certiorari/prohibition to quash tax orders and prohibit enforcement.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Assam High Court grounds: 1. Explanation to s.2(12) ultra vires GOI Act 1935; 2. Commissioner's finding speculative.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "High Court held Explanation not ultra vires pre-Constitution, no attempt to establish goods not in Assam before appellate authority, reasons not unjustified, declined to consider factual conclusions, granted certificate under Art.132 on constitutional question.",
      "type": "procedural",
      "date": "1955-07-25",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Appellants sought leave in SC to challenge factual finding that goods in Assam at contract time.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Explanation to s.2(12) of Assam Sales Tax Act, 1947 ultra vires Provincial Legislature under Government of India Act, 1935.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether Commissioner's finding that goods were actually in Assam at time of contracts speculative or unsupported.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether appellants can bypass statutory remedies under Act and invoke Art.226 jurisdiction to challenge factual findings of taxing authorities.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Definition of sale in s.2(12) beyond legislative competence of Provincial Legislature, tax on sales outside State, imposition amounts to export tax.",
      "supporting_facts": [
        "f2",
        "f7"
      ],
      "legal_basis": "Government of India Act, 1935"
    },
    {
      "id": "pa2",
      "text": "Goods not actually in Assam at time of contracts per Explanation to s.2(12), so not includible in turnover.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "Assam Sales Tax Act s.2(12) Explanation"
    },
    {
      "id": "pa3",
      "text": "Commissioner's finding speculative based on cultivation timetable; some contracts before goods marketable, some for jute from Pakistan, contracts for bales but purchases loose jute not identical.",
      "supporting_facts": [
        "f10",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Explanation to s.2(12) ultra vires as extends sale concept irrespective of contract place if goods in Province.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Government of India Act, 1935; Indian Sale of Goods Act, 1930"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Goods were actually in Province at time of contracts per cultivation timetable and marketing patterns.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Assam Sales Tax Act s.2(12) Explanation"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No leave to challenge factual findings beyond certificate grounds under Art.132; such leave only for grave miscarriage or Art.136 substantial questions.",
      "addresses_issue": "i2",
      "key_observation": "Appellants failed to produce full evidence before taxing authorities, cannot reopen facts in writ jurisdiction."
    },
    {
      "id": "cr2",
      "text": "Act provides complete hierarchy: Superintendent → Asst. Commissioner → Commissioner → reference to High Court on law under s.32; High Court not appellate on facts.",
      "addresses_issue": "i3",
      "key_observation": "Art.226 discretionary, not alternative to statutory remedies; will not bypass machinery or re-examine evidence."
    },
    {
      "id": "cr3",
      "text": "Appellants submitted returns but failed to produce books before Superintendent and fully before Asst. Commissioner; raised location issue late before Commissioner.",
      "addresses_issue": "i2",
      "key_observation": "Taxpayer must place all evidence before authorities; cannot invite High Court to act as appellate."
    },
    {
      "id": "cr4",
      "text": "Explanation to s.2(12) deems sale in Province if goods actually there at contract time, irrespective of contract place; not overstepping authority per Tata Iron case.",
      "addresses_issue": "i1",
      "key_observation": "No argument advanced to support unconstitutionality plea."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court jurisdiction under Art.226 not to be exercised where alternative statutory remedy available and efficacious; not to re-appraise facts vested in taxing authorities.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Explanation to s.2(12) not ultra vires Provincial Legislature under GOI Act 1935.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No interference with factual findings of taxing authorities in writ proceedings without exhausting statutory remedies.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Tata Iron & Steel Company Ltd. v. State of Bihar",
      "citation": null,
      "treatment": "followed",
      "relevance": "Holds that Legislature did not overstep authority by deeming sale situs based on goods location at contract time for sales tax."
    }
  ],
  "statutes_cited": [
    {
      "name": "Assam Sales Tax Act, 1947",
      "sections": [
        "s.2(3)",
        "s.2(12) and Explanation",
        "s.3",
        "s.4",
        "s.17(2)",
        "s.17(4)",
        "s.30",
        "s.31",
        "s.32"
      ],
      "relevance": "Defines dealer, sale (including Explanation deeming sales in Province if goods there at contract), charging section, assessment powers, appeals, revisions, references to High Court."
    },
    {
      "name": "Indian Sale of Goods Act, 1930",
      "sections": null,
      "relevance": "Sale complete when property passes; overridden by Act's Explanation for tax situs."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.132",
        "Art.226"
      ],
      "relevance": "Certificate for appeal on substantial constitutional question; writ jurisdiction discretionary."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": null,
      "relevance": "Limits on Provincial Legislature competence challenged re Explanation."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed all appeals with costs, upholding High Court orders; declined to entertain challenges to factual findings beyond certificate scope and held no need for detailed consideration of constitutional validity as no arguments advanced.",
    "relief_granted": null,
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "\"The jurisdiction of the High Court under Art. 226 of the Constitution is clothed in wide terms... But the exercise of the jurisdiction is discretionary it is not exercised merely because it is lawful to do so.\"",
      "speaker": "court",
      "significance": "Explains limits on writ jurisdiction when statutory remedies available."
    },
    {
      "text": "\"Resort to that jurisdiction is not intended as an alternative remedy for relief which may be obtained in a suit or other mode prescribed by statute.\"",
      "speaker": "court",
      "significance": "Core principle against bypassing tax statute machinery."
    },
    {
      "text": "\"The Legislature has thereby not overstepped the limits of its authority [Tata Iron Steel].\"",
      "speaker": "court",
      "significance": "Rejects ultra vires challenge to Explanation."
    }
  ],
  "_case_id": "1964_320",
  "_label": 0,
  "_text_length": 22936,
  "_extracted_at": "2026-02-10T19:47:06.920527"
}