{
  "metadata": {
    "case_name": "Karan Singh v. State",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Sarkar J."
    ],
    "case_number": "Criminal Appeal No. 55 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Karan Singh, Ramhans, and six other persons alleged to have committed murder of Gabde and attempted murder of Ramchandra.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Deceased Gabde and Ramchandra belonged to one party, alleged assailants to another party with great enmity for some time past.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "About midnight of November 18, 1959, deceased, Ramchandra and others sleeping on Tiwaria terrace; assailants entered, Ramhans shot Gabde dead with gun and fired two shots at Ramchandra injuring him.",
      "type": "material",
      "date": "1959-11-18",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Appellant Karan Singh standing armed with gun by side of Ramhans throughout incident; other persons armed variously; all entered with common intention of committing offences.",
      "type": "material",
      "date": "1959-11-18",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Ramhans absconded initially; appellant and six others tried for offences u/ss. 302 and 307 r/w ss. 148 and 149 IPC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Sessions Judge convicted appellant of offences u/ss. 302 and 307 r/w ss. 148 and 149 IPC, acquitted other six giving benefit of doubt.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "After Sessions Judge conviction but before High Court appeal heard, Ramhans arrested, tried on same charges, acquitted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "High Court relied on direct testimony of Ramchandra supported by Dwarka, Matadin and Maharajsingh: Gabde's murder committed by Ramhans firing gun; Ramhans fired two shots at Ramchandra to kill him; Karan Singh standing armed with gun by side of Ramhans.",
      "type": "material",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f9",
      "text": "Prosecution case at all stages: both Ramhans and Karan Singh went inside Tiwaria armed with guns; Karan Singh stood by side of Ramhans armed with gun throughout.",
      "type": "admitted",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Appellant appealed to Madhya Pradesh High Court Gwalior Bench in Criminal Appeal No. 18 of 1961; judgment dated August 27, 1962.",
      "type": "procedural",
      "date": "1962-08-27",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "High Court convicted appellant u/ss. 302 and 307 r/w s. 34 IPC instead of earlier sections r/w ss. 148 and 149.",
      "type": "procedural",
      "date": "1962-08-27",
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in view of acquittal of Ramhans by Sessions Judge (no appeal), High Court could hold appellant guilty of murder u/s. 302 r/w s. 34 IPC by finding on evidence that Ramhans shared common intention with appellant, shot deceased and attempted murder of Ramchandra.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Ramhans acquitted, so appellant could not be held constructively liable u/s. 149 IPC.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s. 149 IPC"
    },
    {
      "id": "pa2",
      "text": "Decision in Krishna Govind Patil v. State of Maharashtra showed High Court wrong in ignoring acquittal of Ramhans.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Krishna Govind Patil v. State of Maharashtra"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Reliance on judgments in Marachalil Pakku v. State of Madras, Bombadhar Pradhan v. State of Orissa, Sunder Singh v. State of Punjab.",
      "supporting_facts": [],
      "legal_basis": "Marachalil Pakku v. State of Madras (AIR 1954 SC 648); Bombadhar Pradhan v. State of Orissa (1956 SCR 206); Sunder Singh v. State of Punjab (AIR 1962 SC 121)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Pritam Singh v. State of Punjab referred to Sambasivam v. Public Prosecutor: acquittal verdict binding and conclusive in subsequent proceedings between same parties; no application here as Ramhans' acquittal not in proceeding to which appellant was party.",
      "addresses_issue": "i1",
      "key_observation": "Decision in each case turns on evidence led in it; Ramhans' case evidence irrelevant to appellant's case."
    },
    {
      "id": "cr2",
      "text": "Krishna Govind Patil dealt with situation where trial court acquitted three co-accused in same trial and convicted one u/s. 34, leading to conflicting findings; not applicable here as separate trials.",
      "addresses_issue": "i1",
      "key_observation": "Possible to convict under s. 34 with unknown persons, but not concerned here."
    },
    {
      "id": "cr3",
      "text": "Judgments relied on by High Court justify: despite acquittal in one case, court in another case can find (if evidence warrants) acquitted person guilty and hold tried person guilty u/s. 34 for committing offence along with acquitted person.",
      "addresses_issue": "i1",
      "key_observation": "No principle prevents this; Sambasivam principle inapplicable as different persons in separate cases; each case decided on its own evidence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Open to High Court to convict appellant u/s. 302 and 307 r/w s. 34 despite Ramhans' acquittal in separate trial, if evidence in appellant's case warrants finding of common intention and Ramhans' guilt.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Marachalil Pakku v. State of Madras",
      "citation": "AIR 1954 SC 648",
      "treatment": "followed",
      "relevance": "High Court relied on to reject contention re s. 149 after acquittal of Ramhans"
    },
    {
      "case_name": "Bombadhar Pradhan v. State of Orissa",
      "citation": "1956 SCR 206",
      "treatment": "followed",
      "relevance": "High Court relied on to reject contention re s. 149 after acquittal of Ramhans"
    },
    {
      "case_name": "Sunder Singh v. State of Punjab",
      "citation": "AIR 1962 SC 121",
      "treatment": "followed",
      "relevance": "High Court relied on to reject contention re s. 149 after acquittal of Ramhans"
    },
    {
      "case_name": "Pritam Singh v. State of Punjab",
      "citation": "AIR 1956 SC 415",
      "treatment": "distinguished",
      "relevance": "Appellant relied in High Court; refers to Sambasivam; inapplicable as no common parties"
    },
    {
      "case_name": "Sambasivam v. Public Prosecutor, Federation of Malaya",
      "citation": "LR 1952 AC 458, 479",
      "treatment": "distinguished",
      "relevance": "Acquittal binding in subsequent proceedings between same parties; inapplicable here"
    },
    {
      "case_name": "Krishna Govind Patil v. State of Maharashtra",
      "citation": "1964 1 SCR 678",
      "treatment": "distinguished",
      "relevance": "Appellant contended supports ignoring acquittal; concerns conflicting findings in same trial acquitting co-accused"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "307",
        "148",
        "149",
        "34"
      ],
      "relevance": "Offences charged: murder and attempt to murder r/w rioting/unlawful assembly/common object, later altered to r/w common intention"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court conviction of appellant Karan Singh under ss. 302 and 307 r/w s. 34 IPC, dismissing the appeal.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Relying on Ramchandras direct testimony as supported by Dwarka, Matadin and Maharajsingh, I would hold that Gabdes murder was committed by Ramhans by firing a gun at him and that Ramhans also fired two shots from his gun at Ramchandra in order to kill him.\"",
      "speaker": "high_court",
      "significance": "High Court's finding on evidence of Ramhans' actions and appellant's presence"
    },
    {
      "text": "\"The effect of a verdict of acquittal is not completely stated by saying that the person acquitted cannot be tried again for the same offence. To that it must be added that the verdict is binding and conclusive in all subsequent proceedings between the parties.\"",
      "speaker": "court",
      "significance": "Quote from Sambasivam distinguished as inapplicable due to different parties"
    },
    {
      "text": "\"While it (the High Court) acquitted accused 1, 3 and 4 under s. 302 read with section 34 of the Indian Penal Code, it convicted accused 2 under S. 302 read with s. 34... This is a legally impossible position.\"",
      "speaker": "court",
      "significance": "From Krishna Govind Patil; explains why distinguished (conflicting findings in same trial)"
    }
  ],
  "_case_id": "1964_78",
  "_label": 0,
  "_text_length": 8114,
  "_extracted_at": "2026-02-10T19:43:25.907663"
}