{
  "metadata": {
    "case_name": "State of Madhya Pradesh v. Zamindar of Bhadra Estate",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "SUBBA RAO, J."
    ],
    "case_number": "Civil Appeal No. 510/1963",
    "date_of_judgment": "1964-04-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent was the zamindar of Bhadra Estate in Balaghat District of Madhya Pradesh, known as Bahela Zamindari consisting of 78 villages.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Madhya Pradesh Abolition of Proprietary Rights (Estate, Mahals, Alienated Lands) Act, 1950 (M.P. Act No. 1 of 1951) came into force on January 26, 1951.",
      "type": "background",
      "date": "1951-01-26",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Under the Act, proprietary rights of the zamindari vested in the State and the respondent became entitled to compensation under s. 8 of the Act in accordance with rules in Schedule I.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Under r. 8 of Schedule I, compensation is 10 times the net income.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Net income under r. 2(2) of Schedule I calculated by deducting from gross income, inter alia, average of income-tax paid in respect of income from big forest during 30 agricultural years preceding the agricultural year in which the relevant date falls.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On November 30, 1951, Compensation Officer determined compensation at Rs. 2,21,330-12-6, deducting not only income-tax (average Rs. 3,760-2-9) but also super-tax and surcharge (total average Rs. 7,070-8-0), reducing net yearly income by Rs. 3,310-5-3.",
      "type": "procedural",
      "date": "1951-11-30",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Respondent moved Settlement Commissioner under s. 15 of the Act for enhancement; Commissioner confirmed Compensation Officer's order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Respondent filed application in Madhya Pradesh High Court under Arts. 226 and 227 of Constitution to quash Compensation Officer's order.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "High Court held, on construction of relevant provisions, that super-tax should not be taken into account while calculating compensation.",
      "type": "procedural",
      "date": "1960-01-22",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "State of Madhya Pradesh filed appeal by special leave against High Court order in Misc. Petition No. 35 of 1959.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the expression 'income-tax' in cl. (c) of sub-r. (2) of r. 2 of Schedule I to the Madhya Pradesh Abolition of Proprietary Rights (Estate, Mahals, Alienated Lands) Act, 1950 includes super-tax.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Object of r. 2(2)(c) is to provide method for ascertaining net income of estate; no justifiable distinction between income-tax and super-tax as both deducted from gross income to arrive at net income; Legislature used 'income-tax' in comprehensive sense including super-tax; super-tax is additional duty of income-tax under Income-tax Act.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "In construing provision of expropriatory Act, strict construction required; super-tax different in origin, description, scope, incidents and collection from income-tax.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Income-tax Act (relevant provisions)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Legislative intention manifest from express language and internal evidence; with knowledge of two separate duties under Income-tax Act, Legislature used 'income-tax' only, omitting 'super-tax'; qualification 'paid in respect of income from big forest' excludes super-tax as it is payable on total income, not allocable to particular source.",
      "addresses_issue": "i1",
      "key_observation": "Super-tax not paid in respect of income from big forest; no machinery to allocate super-tax to specific income source."
    },
    {
      "id": "cr2",
      "text": "Essential differences between income-tax and super-tax: income-tax computed per heads under s.6, super-tax on total income via separate Ch. IX (ss.55-58); super-tax identity maintained despite description as additional duty.",
      "addresses_issue": "i1",
      "key_observation": "Pronounced differences in incidents; impossible to attribute super-tax to particular source like big forest."
    },
    {
      "id": "cr3",
      "text": "Rules provide no machinery for allocating super-tax; if included, would deduct even if big forest income below taxable level but total income triggers it; strict construction for expropriatory statute requires express inclusion.",
      "addresses_issue": "i1",
      "key_observation": "Deduction only for items directly related to estate income; other construction introduces speculation."
    },
    {
      "id": "cr4",
      "text": "Precedents support distinction: super-tax is separate tax though additional duty.",
      "addresses_issue": "i1",
      "key_observation": "Parity with cases where 'income-tax' excludes super-tax unless specified."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "'Income-tax' in cl. (c) of r. 2(2) of Schedule I excludes super-tax; only average income-tax paid in respect of big forest income deductible.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Brooks v. The Commissioner of Inland Revenue",
      "citation": "1914 7 T.C. 236, 25 S.",
      "treatment": "followed",
      "relevance": "Super-tax is another and new tax nonetheless, though additional duty of income-tax."
    },
    {
      "case_name": "Bates, In re; Selmes v. Bates",
      "citation": "1925 Ch. D. 157, 159-160, 161",
      "treatment": "followed",
      "relevance": "Annuity free of income-tax only, not super-tax; super-tax not charge in respect of particular sum but on whole income."
    },
    {
      "case_name": "Reckitt, In re; Reckitt v. Reckitt",
      "citation": null,
      "treatment": "referred",
      "relevance": "Annuitant entitled to sum free of income-tax without super-tax deduction by trustees; distinguished Bates on will provisions but supports distinction."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madhya Pradesh Abolition of Proprietary Rights (Estate, Mahals, Alienated Lands) Act, 1950 (M.P. Act No. 1 of 1951)",
      "sections": [
        "s. 8",
        "s. 15",
        "Schedule I r. 2(2)(c)",
        "Schedule I r. 8"
      ],
      "relevance": "Basis for compensation calculation; 'income-tax' in r.2(2)(c) excludes super-tax."
    },
    {
      "name": "Income-tax Act",
      "sections": [
        "s. 3",
        "s. 4",
        "s. 6",
        "ss. 7 to 12",
        "Ch. IX ss. 55 to 58",
        "s. 55",
        "s. 56",
        "s. 56A",
        "s. 58(1)"
      ],
      "relevance": "Distinguishes income-tax (on income under heads) from super-tax (additional duty on total income)."
    },
    {
      "name": "Super-tax Act, 1917",
      "sections": [],
      "relevance": "Introduced super-tax separately."
    },
    {
      "name": "Super-tax Act, 1920",
      "sections": [],
      "relevance": "Replaced 1917 Act."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Arts. 226",
        "227"
      ],
      "relevance": "Basis for High Court petition."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave filed by the State of Madhya Pradesh against the Madhya Pradesh High Court order holding that super-tax is not to be included in 'income-tax' for calculating compensation under the Act.",
    "relief_granted": "High Court order upheld; super-tax exclusion confirmed for compensation enhancement.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'income-tax' in cl. (c) of sub-r. (2) of r. 2 of Schedule I to the Act excludes super-tax.",
      "speaker": "court",
      "significance": "Core holding resolving the issue."
    },
    {
      "text": "The mention of the one and the omission of the other is a sure indication of its intention.",
      "speaker": "court",
      "significance": "Explains legislative intent from language used."
    },
    {
      "text": "No super-tax is really payable in respect of this sum.",
      "speaker": "respondent_counsel",
      "significance": "From Bates case, supporting non-attribution to specific income."
    },
    {
      "text": "for super-tax tax is another and a new tax nonetheless, though it is an additional duty of Income Tax.",
      "speaker": "court",
      "significance": "From Brooks, affirming distinction."
    }
  ],
  "_case_id": "1964_117",
  "_label": 0,
  "_text_length": 17161,
  "_extracted_at": "2026-02-10T19:44:08.384641"
}