{
  "metadata": {
    "case_name": null,
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [],
    "case_number": "Civil Miscellaneous Petition No. 1223 of 1964 in Appeal from the judgment and decree dated August 31, 1962, of the Madhya Pradesh High Court in A. No. 597 of 1960",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "This application is under O. XLV, rr. 2 and 5 of the Supreme Court Rules.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Prayers: (i) direct respondents to furnish security for delivering possession of the lands in dispute and for payment of mesne profits and costs which the petitioners might get in appeal; (ii) restrain respondents from transferring the lands in dispute or creating any charge pending appeal; (iii) send for the record and get it printed under supervision of this Court; (iv) order early hearing.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Respondents-decree holders have obtained possession of the land in suit in execution of the decree in their favour.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Petitioners did not take any action under O. XLV, r. 13, Civil Procedure Code, at the time respondents applied for execution.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Notice of this petition served on respondents but they did not appear.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appeal from judgment and decree dated August 31, 1962, of the Madhya Pradesh High Court in A. No. 597 of 1960.",
      "type": "background",
      "date": "1962-08-31",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, after the decree has been executed and decree-holders put in possession, this Court can direct respondents-decree holders to furnish security for delivering possession and payment of mesne profits if appeal succeeds, and restrain them from transferring the lands pending appeal.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether prayers i and ii can be granted in exercise of inherent powers under r.5 O. XLV Supreme Court Rules.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Reliance on Mst. Jariutool-Butool v. Mst. Hoseinee Begum (Privy Council), followed in Narayanan Chetti v. Arunachallam Chetti (Madras HC) and Khushaldas Gokuldas v. Chimanlal Kalidas (Bombay HC); Sadar Dewani Adalat competent to require decree-holder to furnish security even after execution issued before appeal admitted.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Old Bengal Regulations XVI of 1797, XIII of 1808, V of 1798; O. XLV rr. 2 and 5 Supreme Court Rules"
    },
    {
      "id": "pa2",
      "text": "Reliefs to be granted in exercise of inherent powers.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "O. XLV r.5 Supreme Court Rules"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Petitioners did not apply for stay under O. XLV r.13 CPC when respondents applied for execution; High Court could have allowed execution on security from respondents or stayed on security from petitioners.",
      "addresses_issue": "i1",
      "key_observation": "No action taken at the time of execution application."
    },
    {
      "id": "cr2",
      "text": "Privy Council case under old Regulations; no provision empowered Sadar Dewani Adalat to demand security from decree-holders after possession obtained; Regulations directed allowing execution on security, but here no security taken initially.",
      "addresses_issue": "i1",
      "key_observation": "Old cases not applicable; Regulations did not support post-execution security from decree-holders."
    },
    {
      "id": "cr3",
      "text": "O. XLV r.13 CPC: Decree unconditionally executed unless Court otherwise directs before execution; directions for security under cl.(b) or stay under cl.(c) to be given when dealing with execution, not after.",
      "addresses_issue": "i1",
      "key_observation": "Post-execution, no power to impose conditions on decree-holder."
    },
    {
      "id": "cr4",
      "text": "r.14 O. XLV CPC for increasing security only if already furnished; no provision for demanding security afresh after unconditional execution.",
      "addresses_issue": "i1",
      "key_observation": "Legislature did not provide for post-execution security."
    },
    {
      "id": "cr5",
      "text": "O. XX r.1 Supreme Court Rules: No rule for directions on execution; powers of lower court under O. XLV CPC.",
      "addresses_issue": "i2",
      "key_observation": "No inherent power where Code deals fully with execution rights."
    },
    {
      "id": "cr6",
      "text": "Exercising inherent power post-execution would encourage abuse by defaulting judgment-debtor; transfers pendente lite subject to litigation result; mesne profits recoverable.",
      "addresses_issue": "i2",
      "key_observation": "Not in interests of justice to restrain party in possession delivered by Court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No power to direct decree-holders to furnish security or restrain transfer after possession obtained in execution.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Prayers i and ii cannot be granted even under inherent powers.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Prayer iii granted: record to be sent for and printed.",
      "resolves_issue": null,
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mst. Jariutool-Butool v. Mst. Hoseinee Begum",
      "citation": "10 M.I.A. 196",
      "treatment": "distinguished",
      "relevance": "Held Sadar Dewani Adalat competent to require security post-execution under old Regulations; Court finds Regulations did not empower this."
    },
    {
      "case_name": "Narayanan Chetti v. Arunachallam Chetti",
      "citation": "I.L.R. 19 Mad. 140",
      "treatment": "distinguished",
      "relevance": "Followed Privy Council case."
    },
    {
      "case_name": "Khushaldas Gokuldas v. Chimanlal Kalidas",
      "citation": "I.L.R. 50 Bom. 453",
      "treatment": "distinguished",
      "relevance": "Followed Privy Council case post-1908 Code."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order XLV Rule 13",
        "Order XLV Rule 14"
      ],
      "relevance": "Governs powers of court whose decree appealed during pendency; unconditional execution unless directed otherwise before execution; no post-execution security."
    },
    {
      "name": "Supreme Court Rules",
      "sections": [
        "Order XLV Rules 2 and 5",
        "Order XX Rule 1"
      ],
      "relevance": "Petition under rr.2,5; r.5 preserves inherent powers but not exercisable here; O.XX r.1 on stay but no execution directions."
    },
    {
      "name": "Bengal Regulation XVI of 1797",
      "sections": [
        "Section II",
        "Section IV"
      ],
      "relevance": "Cited in Privy Council; allowed execution on security or stay on security."
    },
    {
      "name": "Bengal Regulation XIII of 1808",
      "sections": [
        "Section II clause 3"
      ],
      "relevance": "Cited but irrelevant to Privy Council appeals."
    },
    {
      "name": "Bengal Regulation V of 1798",
      "sections": [
        "Sections III, IV, V, VI"
      ],
      "relevance": "Cited; on security during appeals, transfers void, attachment; not applicable post-execution."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Application rejected with respect to prayers (i) and (ii) for security and restraint; prayer (iii) granted to send for record and print papers under Registrar's supervision. Failure to obtain reliefs does not prejudice appellants if they succeed, as transfers subject to lis pendens and mesne profits recoverable.",
    "relief_granted": "Record sent for and to be printed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The question arises whether, after the decree has been executed and the decree-holders have been put in possession by the Court, this Court can put the respondents-decree holders to terms...",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "We are therefore of opinion that the aforesaid reliefs cannot be granted after the decree-holders had been put in possession of the property in suit in due execution of their decree.",
      "speaker": "court",
      "significance": "Key holding rejecting main prayers."
    },
    {
      "text": "To exercise any such inherent power would be not for the prevention of the abuse of the process of the Court but may be to encourage it...",
      "speaker": "court",
      "significance": "Rejects inherent power argument."
    }
  ],
  "_case_id": "1964_285",
  "_label": 0,
  "_text_length": 15487,
  "_extracted_at": "2026-02-10T19:46:12.785326"
}