{
  "metadata": {
    "case_name": "Ranchhodlal v. State",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Criminal Appeals Nos. 218 to 221 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant convicted in first two cases (Sessions Trial Nos. 35 and 36 of 1961) on January 17, 1962 by First Additional Sessions Judge, Ujjain, Shri B. Aggarwal, of offence under s. 409 IPC and sentenced to 4 years RI and fine; also convicted under s. 467 r/w 471 and s. 477A IPC, sentences concurrent with s. 409 sentence; sentences in two cases to run consecutively.",
      "type": "procedural",
      "date": "1962-01-17",
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "Appellant convicted in other two cases (Sessions Trial No. 55 of 1962 and another) on July 20, 1963 by Shri Dube, First Additional Sessions Judge, Ujjain, under s. 409 IPC and sentenced to 3 years RI each; sentences in these two cases concurrent with each other but not with earlier sentences.",
      "type": "procedural",
      "date": "1963-07-20",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Appeals against convictions in four cases dismissed by Madhya Pradesh High Court, Indore Bench, on May 21, 1964.",
      "type": "procedural",
      "date": "1964-05-21",
      "source": "high_court"
    },
    {
      "id": "f4",
      "text": "High Court remarked sentences under s. 409 were not excessive, somewhat lenient, fine feeble; in second case low due to other cases; in third, would enhance if prayed; in fourth, lenient.",
      "type": "procedural",
      "date": "1964-05-21",
      "source": "high_court"
    },
    {
      "id": "f5",
      "text": "Resulting total imprisonment: 11 years mainly under s. 409 IPC for offences as Sarpanch of Mandal Panchayat, Ujjain.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Offences of criminal breach of trust occurred from November 19, 1955 to February 23, 1956.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Special leave granted by Supreme Court on question of sentence only.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Investigating agency submitted charge sheets for later cases after first two (commitments in 1961 and 1962 leading to trials ending 1962 and 1963).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant held responsible position as Sarpanch dealing with public money for public benefit.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether separate trials in four cases for criminal breach of trust under s. 409 IPC with respect to different amounts, leading to consecutive sentences totaling 11 years, caused prejudice and harassment to appellant, and whether sentences should run concurrently.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether offences should have been charged as one under s. 222 CrPC by specifying gross sum within dates not exceeding one year.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether offences could be tried together under s. 234 CrPC (up to three offences of same kind within 12 months) or s. 235 CrPC (same transaction).",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether total sentence of 11 years is excessive given nature of offences under s. 409 IPC.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Separate trials in four cases for offences within few months led to prejudice and harassment with consecutive sentences under s. 397 CrPC.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "s. 397 CrPC"
    },
    {
      "id": "pa2",
      "text": "Offences should have been charged as one offence for total misappropriated amount under s. 222 CrPC, leading to one trial and one sentence not exceeding 4 years.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s. 222 CrPC"
    },
    {
      "id": "pa3",
      "text": "Three offences could have been tried at one trial under s. 234 CrPC.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s. 234 CrPC"
    },
    {
      "id": "pa4",
      "text": "Offences committed in course of same transaction, should have been tried at one trial under s. 235 CrPC.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s. 235 CrPC"
    },
    {
      "id": "pa5",
      "text": "Total sentence of 11 years severe; if jointly tried under s. 222, would not exceed 4 years.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "s. 409 IPC"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Under s. 397(1) CrPC, subsequent sentence ordinarily commences after previous unless court directs concurrently; Sessions Judges exercised discretion not to make later sentences concurrent with first.",
      "addresses_issue": "i1",
      "key_observation": "No illegality; not urged before Sessions Judges or High Court to make all concurrent; High Court viewed sentences as lenient."
    },
    {
      "id": "cr2",
      "text": "s. 222(2) CrPC allows lumping gross sum when particulars not specifiable; normal rule under s. 233 is separate charge for each distinct offence; separate trials correct mode.",
      "addresses_issue": "i2",
      "key_observation": "No illegality in separate charges/trials for distinct items."
    },
    {
      "id": "cr3",
      "text": "s. 234 CrPC enabling for up to three offences at one trial; exceeded three items; separate trials not illegal.",
      "addresses_issue": "i3",
      "key_observation": "Enabling provision, exception to s. 233."
    },
    {
      "id": "cr4",
      "text": "s. 235 CrPC enabling for same transaction; separate trials not illegal even if same transaction.",
      "addresses_issue": "i3",
      "key_observation": "Enabling provision."
    },
    {
      "id": "cr5",
      "text": "No evidence investigating agency had all cases before first trial; charge sheets submitted later; no design in multiple prosecutions.",
      "addresses_issue": "i1",
      "key_observation": "Separate trials not prejudicial."
    },
    {
      "id": "cr6",
      "text": "Sentence measure governed by nature/circumstances; s. 409 punishable up to life/10 years; deterrent sentence essential for public office holder misappropriating public money.",
      "addresses_issue": "i4",
      "key_observation": "Circumstances do not justify leniency; sentences not excessive."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No illegality in trying appellant in four separate cases or in not ordering sentences to run concurrently.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Separate charges and trials for distinct offences of criminal breach of trust correct under ss. 222, 233 CrPC.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Separate trials permissible despite ss. 234, 235 CrPC as enabling provisions.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Total sentence of 11 years not excessive for repeated criminal breach of trust by public official.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "s. 409",
        "s. 467",
        "s. 471",
        "s. 477A"
      ],
      "relevance": "Offences of criminal breach of trust, forgery etc. for which appellant convicted."
    },
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "s. 222",
        "s. 233",
        "s. 234",
        "s. 235",
        "s. 397"
      ],
      "relevance": "Framing of charge, joinder of charges/trials, commencement of subsequent sentences."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals by special leave (limited to sentence), holding no illegality in separate trials or consecutive sentences, and sentences not excessive given appellant's position and nature of offences.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A deterrent sentence is always essential so that others in such responsible Positions and having occasions to deal with large sums of public money do number victim to greed and dishonesty.\"",
      "speaker": "court",
      "significance": "Justifies upholding sentences for public deterrence."
    },
    {
      "text": "\"the basic offence is criminal breach of trust under section 409 IPC and a sentence of four years rigorous imprisonment cannot, in these circumstances, be companysidered excessive. If anything, I would call it somewhat lenient.\"",
      "speaker": "high_court",
      "significance": "High Court view on adequacy of sentence, influencing Supreme Court."
    }
  ],
  "_case_id": "1964_293",
  "_label": 0,
  "_text_length": 13113,
  "_extracted_at": "2026-02-10T19:46:15.962631"
}