{
  "metadata": {
    "case_name": "Commissioner of Quilon Municipality v. Various Respondents",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar J."
    ],
    "case_number": "Civil Appeals Nos. 415 to 419 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Before the Constitution came into force the Quilon Municipality had, in exercise of the power conferred by s. 91 of the Travancore District Municipalities Act, 23 of 1116 M.E. (corresponding to the year 1940, hereafter referred to as the Act) imposed a profession tax upon every company and every person who, among other things, transacts business within the limits of the municipality for not less than a certain period during a year.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Sub-section (1) of s. 91 further provides that a company or person liable to pay the tax shall pay a half-yearly tax assessed in accordance with the rules mentioned in Schedule H.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Schedule H contains rules, and rules 16 and 18 are the only rules relevant for consideration in these appeals.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Rule 16 sets out slabs of half-yearly income for the purpose of assessment of companies and persons to the tax. In this rule the assessees are divided into 12 classes. In the first class come assessees whose half-yearly income exceeds Rs. 21,000 who have to pay a tax of Rs. 275 per half-year. Next below it is cl. (2) which provides that those whose half-yearly income exceeds Rs. 18,000 but does not exceed Rs. 21,000 shall pay a tax of Rs. 225 every half-year. The liability of assessees whose incomes are below Rs. 18,000 goes on diminishing in each lower slab.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "There is a proviso to sub-r. (1) which runs thus: Provided that a company whose half-yearly income is more than twenty-one thousand rupees shall, notwithstanding anything contained in this or any other rule, pay in addition to the maximum half-yearly tax of rupees two hundred and seventy-five an additional half-yearly tax on such excess calculated at the rate of one rupee per one hundred rupees or part thereof.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "With respect to assessees falling within the first slab the proviso thus imposes an additional tax over and above Rs. 275 every half-year.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Rule 18 contains three sub-rules but we are concerned only with sub-rr. (1) and (2) and they are as follows: Where a company or person transacts business in any half-year exclusively in the area of a single municipality, the income of such company or person from the transaction of such business shall, for the purpose of levying profession-tax under this Act during the half-year, be deemed to be- (a) where income-tax is assessed on such company or person under the Travancore Income-tax Act for the year comprising the half-year, one-half of the amount at which the profits and gains of such business are computed under Section 8 of the Travancore Income-tax Act for the purpose of assessing the income-tax and (b) where the amount of the said profits and gains is not ascertainable or where such company or person is not assessed to income-tax, such percentage as our Government may prescribe, of the turn-over of the business transacted in the area of the municipality during the half-year or where this is also unascertainable during the corresponding half-year of the previous year.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Where a company or person transacts business partly in the area of a municipality and partly outside such area, the income of such company or person from the transaction of business in the area of the municipality shall, for the purpose of levying profession-tax under this Act, be deemed to be the percentage prescribed under clause (b) of sub-rule (1) of the turnover of the business transacted in such area during the half-year or the corresponding half-year of the previous year, as the case may be.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "By a notification of August 28, 1947 the appropriate authority empowered by s. 325 of the Act to frame rules added the following proviso to sub-r. (2): Provided that in the case of a company or person assessable to income tax, the total profits earned by the company or person as disclosed by the Income-tax assessment for the whole State for the year comprising the half-year for which the profession tax is to be levied, shall be divided in the proportion of the turn-over of the business of the company or person in the Municipality and outside, for purposes of assessment to profession tax.",
      "type": "background",
      "date": "1947-08-28",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "By the operation of s. 3 of the Indian Finance Act, 25 of 1950 the Travancore Income-tax Act stood repealed and the municipal authorities construed the reference to the Travancore Income-tax Act in sub-r. (1) of r. 18 as reference to the Indian Income-tax Act. They also construed the reference to the Travancore Income-tax Act in the proviso to sub-r. (2) in the same way.",
      "type": "procedural",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "In Harrisons and Crosfield Ltd. v. Commissioner of Quilon Municipality, I.L.R. 1955 T.C. 1003, the Travancore-Cochin High Court held that the proviso had only provided for the adoption of certain figures representing the total profits as disclosed by the Income-tax assessment for a particular year in which the emphasis was upon the assessable area, which, after the coming into force of the Indian Income-tax Act in the State of Travancore became impossible of ascertainment and that, therefore, the entire proviso was rendered obsolete.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Thereafter, the appropriate authority amended sub-rr. (1) and (2) of r. 18 by notification dated February 15, 1956 as follows: In clause (a) of sub-rule (1) of rule 18- (a) for the words 'Travancore Income Tax Act' wherever they occur, the words and figures 'Indian Income Tax Act, 1922' shall be substituted. (b) for the word and figure 'Section 8' the word and figure 'Section 10' shall be substituted. In the proviso to sub-rule (2) of Rule 18 for the words 'whole State' the words 'whole of the Indian Union' shall be substituted. These amendments shall be deemed to have come into effect from 1st April 1950.",
      "type": "procedural",
      "date": "1956-02-15",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The validity of the amendments was challenged before the High Court in Highland Produce Co. Ltd. v. The Commissioner, Alleppey Municipal Council on the ground that the power conferred by S. 325 of the Act to frame rules could not be exercised so as to give retrospective operation to any rule. The High Court accepted the contention.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Thereupon Act 14 of 1958, the validity of S. 2 of which is challenged before us, was enacted by the Kerala Legislature. That provision reads thus: Validation of the levy or collection of profession tax under the Travancore District Municipalities Act, 1116 Notwithstanding any judgment, decree or order of any court, the amendments to the Taxation and Finance Rules contained in Schedule II to, the Travancore District Municipalities Act, 1116 (XXIII of, 1116) made by Notification No. LS. 11-13975/55/ DD dated 15th February, 1956 of the Government of the former State of Travancore-Cochin, shall be deemed to have come into force with effect from the first day of April, 1950 and the validity of the levy or collection of profession tax made under the said Act and Rules shall not be called in question on the ground that the amendments made by the notification aforesaid cannot have any retrospective operation, and any profession tax so levied but not collected may be collected as if the said amendment had been validly made with effect from the first day of April, 1950.",
      "type": "background",
      "date": "1958",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The High Court struck down this section and the O.P. Nos. 196 to 202 of 1955 decided in October, 1956. Quilon Municipality and its Commissioner have come up before us in appeal.",
      "type": "procedural",
      "date": "1961-04-12",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Five writ petitions were preferred by the respondents and one by M/s. Brooke Bond India Ltd.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Statements filed in the High Court by the respondents marked as Ex 4, 13 and 23 showing for certain periods that taxable income under amended proviso (TI2) was higher than under unamended (TI1) for periods ending June 30, 1952, 1953, 1956.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether s. 2 of the Kerala Profession Tax Validation and Reassessment Act, 1958 (Act No. XIV of 1958) is invalid on the ground that it violates the provisions of Art. 276 of the Constitution.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "What the Act does is merely to adapt the machinery for the assessment and levy of the tax to a situation arising out of the repeal of the Travancore Income-Tax Act by s. 3 of the Indian Finance Act, 1950 and replacing that Act by the Indian Income-tax Act. It, therefore, according to him, does not infringe the provisions of Art. 276 of the Constitution.",
      "supporting_facts": [
        "f10",
        "f12",
        "f14"
      ],
      "legal_basis": "Art. 276; Mst. Jadao Bahuji v. Municipal Committee Khandwa"
    },
    {
      "id": "pa2",
      "text": "The retrospectivity given to the provision does not infringe the aforesaid constitutional provision.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Mst. Jadao Bahuji v. Municipal Committee Khandwa"
    },
    {
      "id": "pa3",
      "text": "The proviso merely purported to create a machinery for implementing the tax.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "In consequence of the amendment the total profits earned by a company or person as disclosed by the income-tax statement for the whole of India will now have to be divided in the same proportion as the turnover of the business of the company or person within the municipality bore to the turn-over outside the municipality, for the purpose of assessment of the tax. The result of this, according to him, may sometimes be that a much larger amount of profits will have to be taken into account for assessing the tax than under the unamended proviso.",
      "supporting_facts": [
        "f12",
        "f17"
      ],
      "legal_basis": "Art. 276"
    },
    {
      "id": "ra2",
      "text": "The amount of assessable profits would depend upon the permissible deductions under the Indian Income-tax Act and that if they are fewer than before the result would be that assessable profits determined under the Indian Income-tax Act would be higher than those under the Travancore Income-tax Act.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The proviso of 1947 introduced a new basis for assessment of the taxable income by linking up their computation with the income assessed for levying income-tax under Travancore Income-tax Act, which may result in higher profits than actual due to limited deductions.",
      "addresses_issue": "i1",
      "key_observation": "The proviso affected the basis of assessment of tax and did not merely deal with the procedure for assessing the tax."
    },
    {
      "id": "cr2",
      "text": "The amendment of 1956 links determination of profits to Indian Income-tax Act, 1922 (s.10) and 'whole of the Indian Union' instead of 'whole State', which could enhance assessee's liability as permissible deductions may differ and be fewer under Indian IT Act.",
      "addresses_issue": "i1",
      "key_observation": "Even on hypothetical figures in Ex.4 etc., in certain periods TI2 > TI1, so burden of tax liable to be increased."
    },
    {
      "id": "cr3",
      "text": "The amendment operates from April 1950, post-commencement of Constitution, and Art.276 prohibits tax exceeding Rs.250 per annum post-Constitution (except savings for pre-Constitution excesses).",
      "addresses_issue": "i1",
      "key_observation": "Kerala Legislature incompetent to enact s.2 validating post-Constitution enhancement."
    },
    {
      "id": "cr4",
      "text": "Distinguishes Mst. Jadao Bahuji as that validated pre-1939 excess but not post-date-line; here validation is for post-Constitution period.",
      "addresses_issue": "i1",
      "key_observation": "Prohibition in Art.276(2) circumscribes legislative power post-commencement."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The amendment must, therefore, be regarded as violating the provisions of Art. 276 and we hold that the Kerala Legislature was incompetent to enact s. 2 of the Validating Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Harrisons and Crosfield Ltd. v. Commissioner of Quilon Municipality",
      "citation": "I.L.R. 1955 T.C. 1003",
      "treatment": "referred",
      "relevance": "Held proviso obsolete after repeal of Travancore IT Act."
    },
    {
      "case_name": "Highland Produce Co. Ltd. v. The Commissioner, Alleppey Municipal Council",
      "citation": null,
      "treatment": "referred",
      "relevance": "Struck down retrospective amendments to rules under s.325."
    },
    {
      "case_name": "Mst. Jadao Bahuji v. Municipal Committee Khandwa",
      "citation": "1961 2 S.C.R. 636",
      "treatment": "distinguished",
      "relevance": "Validated pre-date-line tax excess but not post; observations against post-commencement excess."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 246",
        "Article 276"
      ],
      "relevance": "Art.276 limits profession tax to Rs.250 per annum post-Constitution, with proviso for pre-Constitution excesses."
    },
    {
      "name": "Travancore District Municipalities Act, 1116 M.E. (Act XXIII of 1116)",
      "sections": [
        "s.91",
        "s.325",
        "Schedule H (rules 16, 18)"
      ],
      "relevance": "Basis for imposing and assessing profession tax; rules amended retrospectively."
    },
    {
      "name": "Kerala Profession Tax Validation and Reassessment Act, 1958 (Act No. XIV of 1958)",
      "sections": [
        "s.2"
      ],
      "relevance": "Validated 1956 amendments retrospectively from 1.4.1950; held invalid."
    },
    {
      "name": "Indian Finance Act, 1950 (Act 25 of 1950)",
      "sections": [
        "s.3"
      ],
      "relevance": "Repealed Travancore Income-tax Act."
    },
    {
      "name": "Travancore Income-tax Act",
      "sections": [
        "Section 8"
      ],
      "relevance": "Pre-1950 basis for computing profits; repealed."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 10"
      ],
      "relevance": "Post-1950 substituted reference for profit computation."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court held that s.2 of the Kerala Profession Tax Validation and Reassessment Act, 1958 is invalid as it violates Art.276 of the Constitution by validating amendments that could enhance profession tax liability beyond Rs.250 per annum for periods post-commencement of the Constitution. Appeals dismissed with costs.",
    "relief_granted": "High Court judgment upheld; s.2 struck down.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "the amendment must, therefore, be regarded as violating the provisions of Art. 276 and we hold that the Kerala Legislature was incompetent to enact s. 2 of the Validating Act.",
      "speaker": "court",
      "significance": "Core holding invalidating the validation provision."
    },
    {
      "text": "The proviso thus affected the basis of assessment of tax and did not merely deal with the procedure for assessing the tax.",
      "speaker": "court",
      "significance": "Rejects argument that changes were mere machinery."
    },
    {
      "text": "There can be no doubt that if a law was passed after the amendment and sought to impose taxes on professions etc., for any period after March 31, 1939, it had to conform to the limit prescribed by s. 142-A.",
      "speaker": "court",
      "significance": "Quote from distinguished precedent emphasizing post-date-line limits."
    }
  ],
  "_case_id": "1964_144",
  "_label": 0,
  "_text_length": 21683,
  "_extracted_at": "2026-02-10T19:45:00.654490"
}