{
  "metadata": {
    "case_name": "Syed M. Karim v. Mst. Bibi Sakina",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeal No. 647 of 1962",
    "date_of_judgment": "1964-02-14"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Syed Aulad Ali purchased the suit properties on May 28, 1914 at a court sale, benami in the name of his son-in-law Hakir Alam.",
      "type": "material",
      "date": "1914-05-28",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Under the rules of the Darbhanga Raj where Syed Aulad Ali was employed, persons serving in certain capacities were prohibited from purchasing at court sales.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Sale certificate was issued in the name of Hakir Alam who was then living with Syed Aulad Ali.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "On January 6, 1950, Syed Aulad Ali sold the property to his son, the present appellant Syed M. Karim.",
      "type": "material",
      "date": "1950-01-06",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Hakir Alam sold the property to Bibi Sakina, defendant No.11, the respondent.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Suit brought for declaration of title and confirmation of possession or in the alternative for delivery thereof.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Appellant continued in possession of the property after the purchase by Syed Aulad Ali benami in the name of Hakir Alam.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Hakir Alam was the son-in-law of Syed Aulad Ali and was living with him.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "No suggestion that Syed Aulad Ali ever asserted any hostile title against Hakir Alam or that a dispute with regard to ownership and possession had ever arisen.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Patna High Court reversed concurrent judgments of the two courts below and ordered dismissal of the suit dated December 3, 1959 in Appeal from Appellate Decree No. 642 of 1957.",
      "type": "procedural",
      "date": "1959-12-03",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant's claim based on the benami nature of the 1914 transaction is barred by s.66 of the Code of Civil Procedure.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the title of Hakir Alam was extinguished by long and uninterrupted adverse possession of Syed Aulad Ali and after him of the plaintiff.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The findings clearly establish the benami nature of the transaction of 1914.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The case falls within the second sub-section of s.66 CPC under which a suit is possible at the instance of a third person who wishes to proceed against the property on the ground that it is liable to satisfy a claim of such third person against the real owner; reliance on transfer by Syed Aulad Ali to appellant as a claim by transferee against real owner.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s.66(2) Code of Civil Procedure"
    },
    {
      "id": "pa3",
      "text": "Title of Hakir Alam was extinguished by long and uninterrupted adverse possession of Syed Aulad Ali and after him of the plaintiff; plea of adverse possession raised, reliance on Sukan v. Krishanand and Sri Bhagwan Singh v. Ram Basi; long possession uninterrupted for 12 years or absolute title acquired.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Limitation Act"
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appellant's claim based upon the benami nature of the transaction cannot stand because s.66 CPC bars suit against any person claiming title under a purchase certified by the Court on the ground that the purchase was made on behalf of the plaintiff or someone through whom plaintiff claims; protection available not only to certified purchaser but anyone claiming through him; appellant as plaintiff hit by the section and defendants protected.",
      "addresses_issue": "i1",
      "key_observation": "Change in wording of s.66 protects not only certified purchaser but those claiming under."
    },
    {
      "id": "cr2",
      "text": "Second sub-section of s.66 refers to claims of creditors not transferees; latter dealt with in first sub-section; accepting appellant's meaning would defeat policy of law and make first sub-section dead letter.",
      "addresses_issue": "i1",
      "key_observation": "Transferees from real purchaser cannot use second sub-section."
    },
    {
      "id": "cr3",
      "text": "High Court did not accept adverse possession case; such case open if possession ripens into title under Limitation Act but must be clearly made and proved; plea not raised in suit; plaint sets out possession after purchase but does not say it was adverse to certified purchaser; no evidence when possession became adverse; adverse possession must be adequate in continuity, publicity and extent; plea required to show starting point of limitation.",
      "addresses_issue": "i2",
      "key_observation": "No proper plea or evidence of adverse possession; long possession not necessarily adverse; prayer clause not substitute for plea."
    },
    {
      "id": "cr4",
      "text": "Cited cases do not help; each case on its own plaint; in Bishun Dayal v. Kesho Prasad, Judicial Committee did not accept alternative case based on possession without proper plea; reading plaint as whole, no case based on adverse possession stated.",
      "addresses_issue": "i2",
      "key_observation": "Plea of adverse possession not properly raised."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Plaintiff's suit held barred under s.66 of the Code of Civil Procedure.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No case of adverse possession properly pleaded or proved.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sukan v. Krishanand",
      "citation": "I.L.R. 32 Pat. 353",
      "treatment": "referred",
      "relevance": "Relied on by appellant for plea of adverse possession not necessary or proper plea."
    },
    {
      "case_name": "Sri Bhagwan Singh and others v. Ram Basi and others",
      "citation": "A.I.R. 1957 Pat. 157",
      "treatment": "referred",
      "relevance": "Relied on by appellant for plea of adverse possession not necessary or proper plea."
    },
    {
      "case_name": "Bishun Dayal v. Kesho Prasad and another",
      "citation": "A.I.R. 1940 Cal. 202",
      "treatment": "followed",
      "relevance": "Judicial Committee did not accept alternative case based on possession after purchase without proper plea."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s.66"
      ],
      "relevance": "Bars suit challenging certified court sale purchase on benami grounds; protects certified purchaser and claimants under them; first sub-section for transferees, second for creditors."
    },
    {
      "name": "Limitation Act",
      "sections": [],
      "relevance": "Possession of real owner can ripen into title if adverse, allowing suit without relying on benami."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed; High Court judgment upheld reversing lower courts and ordering dismissal of suit as barred by s.66 CPC; no adverse possession established.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The appellants claim based upon the benami nature of the transaction cannot stand because s. 66 of the Code of Civil Procedure bars it.",
      "speaker": "court",
      "significance": "Core holding on bar to benami challenge."
    },
    {
      "text": "The words of the second sub-section refer to the claim of creditors and not to the claims of transferees.",
      "speaker": "court",
      "significance": "Clarifies scope of s.66(2) CPC."
    },
    {
      "text": "Long possession is not necessarily adverse possession and the prayer clause is not a substitute for a plea.",
      "speaker": "court",
      "significance": "Rejects adverse possession claim for lack of proper pleading."
    }
  ],
  "_case_id": "1964_5",
  "_label": 0,
  "_text_length": 6865,
  "_extracted_at": "2026-02-10T19:42:11.119248"
}