{
  "metadata": {
    "case_name": "Appellants (illegitimate son and daughter of Sardarni Prem Prakash Kaur) v. Respondents",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "AYYANGAR, J."
    ],
    "case_number": "Civil Appeal No. 467 of 1963",
    "date_of_judgment": "1964-03-13"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are the illegitimate son and daughter of Sardarni Prem Prakash Kaur.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By registered deed of sale dated December 1, 1956, Sardarni Prem Prakash Kaur sold 18 bighas, 1 biswas and 5-1/2 biswansis of agricultural land for Rs. 10,000/- to the respondents.",
      "type": "material",
      "date": "1956-12-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellants filed a suit to pre-empt this sale. There was some dispute about the consideration actually paid but the court is not concerned with it.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Both the trial court and the District Court on appeal granted the appellants a decree for pre-emption, though to a limited extent.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondents filed a second appeal to the Punjab High Court in Regular Second Appeal No. 837 of 1960.",
      "type": "procedural",
      "date": "1961-02",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Punjab High Court by judgment and decree dated February 1961 directed dismissal of the suit on the ground that appellants were not comprehended within s.15(2)(b) of the Punjab Pre-emption Act as amended by Act X of 1960.",
      "type": "procedural",
      "date": "1961-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Present appeal by special leave from the Punjab High Court judgment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Do the words 'son or daughter of such female' occurring in s.15(2)(b) of the Punjab Preemption Act, 1913 as amended by Act X of 1960 include an illegitimate son or illegitimate daughter of such female?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The provision in s.15 of the Pre-emption Act must be read in conjunction with the Hindu Succession Act, 1956 which made provision for the devolution of property belonging to a female owner and that as under the latter enactment illegitimate children of a Hindu female were entitled to succeed to her property, it must be held that when the Punjab legislature used in 1960 the expression 'son or daughter' it meant a son or a daughter who would be entitled to succeed as an heir of a Hindu female.",
      "supporting_facts": [],
      "legal_basis": "Hindu Succession Act, 1956"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellants were not comprehended within the class of persons who were entitled to pre-emption under s.15(2)(b) of the Punjab Pre-emption Act as it stands under the amendment effected by Act X of 1960.",
      "supporting_facts": [
        "f1",
        "f6"
      ],
      "legal_basis": "Punjab Pre-emption Act, 1913 s.15(2)(b) as amended by Act X of 1960"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Submission to read s.15 with Hindu Succession Act untenable; framers did not proceed on theory of heirs under Hindu Succession Act. Example: under s.15(2)(a), right vests in brother or brother's son, different from Hindu Succession Act devolution.",
      "addresses_issue": "i1",
      "key_observation": "Theory to resort to line of heirs under Hindu Succession Act untenable."
    },
    {
      "id": "cr2",
      "text": "If female vendor Christian, only legitimate issue denoted; statutory right applies equally to all, construction cannot depend on religion or changes in personal law.",
      "addresses_issue": "i1",
      "key_observation": "Construction would vary with vendor's religion or changes in intestate succession law, unsustainable."
    },
    {
      "id": "cr3",
      "text": "Normal rule of construction: words 'child, son or daughter' in statute include only legitimate children born in wedlock. No express provision or context to extend to illegitimate; s.3(j) Hindu Succession Act illustrates express extension.",
      "addresses_issue": "i1",
      "key_observation": "Words mean only legitimate issue."
    },
    {
      "id": "cr4",
      "text": "Words 'son or daughter' occur multiple times in s.15; for male vendor, conceded to mean legitimate only. Cannot differ for female vendor. Brother's son in s.15(2)(a)(i) means legitimate.",
      "addresses_issue": "i1",
      "key_observation": "Context confirms legitimate only; too clear for argument."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "When s.15(2)(b)(i) uses the words 'son or daughter' it meant only a legitimate son and a legitimate daughter of the female vendor.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Punjab Pre-emption Act, 1913",
      "sections": [
        "s.15(1)",
        "s.15(2)(a)",
        "s.15(2)(b)"
      ],
      "relevance": "Defines persons in whom right of pre-emption vests; key phrase 'son or daughter of such female' in s.15(2)(b) interpreted to mean legitimate only."
    },
    {
      "name": "Hindu Succession Act, 1956",
      "sections": [
        "s.15",
        "s.15(1)",
        "s.15(2)",
        "s.3(j)"
      ],
      "relevance": "Petitioners argued to read with Pre-emption Act for succession rights including illegitimate; court rejected. s.3(j) illustrates express inclusion of illegitimate."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Punjab High Court's judgment directing dismissal of the appellants' suit for pre-emption, holding that illegitimate son and daughter are not included in 'son or daughter' under s.15(2)(b) of the Punjab Pre-emption Act, 1913 as amended.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Do the words son or daughter of such female occurring in s.15(2)(b) of the Punjab Preemption Act, 1913 as amended by Act X of 1960 include an illegitimate son or illegitimate daughter of such female is the only question that arises in this appeal by special leave.",
      "speaker": "court",
      "significance": "Frames the sole legal issue."
    },
    {
      "text": "That the normal rule of construction of the words child, son or daughter occurring in a statute would include only legitimate children i.e., born in wedlock, is too elementary to require authority.",
      "speaker": "court",
      "significance": "States the primary rule of interpretation applied."
    },
    {
      "text": "The matter appears to us to be too clear for argument that when s.15(2)(b)(i) uses the words son or daughter it meant only a legitimate son and a legitimate daughter of the female vendor.",
      "speaker": "court",
      "significance": "Concludes the holding rejecting appellants' claim."
    }
  ],
  "_case_id": "1964_108",
  "_label": 0,
  "_text_length": 8952,
  "_extracted_at": "2026-02-10T19:43:59.002340"
}