{
  "metadata": {
    "case_name": "Administrator-General of West Bengal v. Commissioner of Income Tax",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri J."
    ],
    "case_number": "Civil Appeals Nos. 168 & 169 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Raja Profulla Nath Tagore died on July 2, 1938, leaving an elaborate will dated March 14, 1927.",
      "type": "background",
      "date": "1938-07-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Will provided certain legacies to specified persons and institutions, residue given to five sons.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Clause 81 of the Will: Save and except legacies and garden house, all remaining moveable and immoveable properties given to sons, subject to management and payment of trusts, debutter etc. and legacies.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Clause 10 of the Will: Legacies to be paid in full within 15 years of death, estate managed under supervision of Executors and Trustees, paid from small savings from income year after year, competent to sell portion of estate, no interest payable.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Numerous legacies had to be paid before residue could be ascertained.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Probate granted to five sons on August 24, 1938.",
      "type": "procedural",
      "date": "1938-08-24",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "High Court order dated May 10, 1948, appointed Administrator-General of West Bengal as Administrator de bonis non with copy of Will annexed.",
      "type": "procedural",
      "date": "1948-05-10",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Administrator-General submitted returns for Assessment years 1950-51 (accounting year 1949-50 / 1356 B.S.) showing income Rs. 33,611 and 1951-52 (1950-51 / 1357 B.S.) Rs. 39,630.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Administrator-General claimed income specifically receivable on behalf of five sons, shares definite and determinate.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Income-tax Officer rejected claim for 1950-51: Administrator-General is executor, execution not complete, beneficiaries question does not arise, assessable as Executor to estate.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Similar order for 1951-52 by ITO.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellate Assistant Commissioner upheld ITO orders, citing V. M. Raghavalu Naidu v. CIT and Asit Kumar Ghose v. CAIT; levy on separate incomes only when administration complete and residue ascertained; administration not complete till end of 1950-51.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appellate Tribunal rejected contention: Condition of S.41 is receiving on behalf of beneficiaries; per S.211 Succession Act, receives as legal representative, not on behalf of beneficiaries till administration complete or specific directions; shares indeterminate due to benefactions; tax at maximum rate; not entitled to separate assessment of beneficiaries.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Tribunal referred two questions to High Court on application.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Calcutta High Court judgment dated December 5, 1961, in Income-tax Reference No. 116 of 1957, answered questions against appellant.",
      "type": "procedural",
      "date": "1961-12-05",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "High Court held: Administrator-General expressly covered by S.41; income does not become beneficiaries' till administration complete; sons had no determinate share; proviso to S.41 attracted, tax at maximum rate.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Administration of estate was not completed within the accounting periods in question.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the assessments on the Administrator-General of West Bengal as an individual and not as representing the shares of the various beneficiaries under the Will of the late Raja P. N. Tagore separately was in accordance with law?",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "If the answer to Question No. 1 be in the affirmative, then whether on the facts and in the circumstances of the case, the assessment of the said Administrator-General at the maximum rate was legal?",
      "framed_by": "lower_court"
    },
    {
      "id": "i3",
      "text": "Did the Administrator-General receive the income on behalf of the five sons or on his own behalf during the period of incomplete administration?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court wrong in holding shares of five sons indeterminate; shares are 1/5th each; what matters is shares determinate, not actual sum variable.",
      "supporting_facts": [
        "f3",
        "f9"
      ],
      "legal_basis": "Birendra Kumar Datta v. Commissioner of Income tax, Calcutta (1961) 42 I.T.R. 661"
    },
    {
      "id": "pa2",
      "text": "S. 41 mandatory; if proviso does not apply, ITO bound to assess under S. 41.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Section 41 of Indian Income Tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "S. 41 does not apply; appellant did not receive income on behalf of five sons but as executor; executor not mentioned in S. 41, assessable under Ss. 3 & 4.",
      "supporting_facts": [
        "f7",
        "f10",
        "f13",
        "f17"
      ],
      "legal_basis": "Sections 3, 4, 41 of Indian Income Tax Act, 1922; Section 211 of Indian Succession Act"
    },
    {
      "id": "ra2",
      "text": "In the alternative, shares of sons indeterminate.",
      "supporting_facts": [
        "f4",
        "f5",
        "f17"
      ],
      "legal_basis": "Proviso to Section 41 of Indian Income Tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Accepts Revenue's submission that S.41 does not apply as Administrator-General did not receive income on behalf of five sons but on own behalf during administration; had discretion to use for legacies/expenses; sons entitled to residue finally, not income during administration.",
      "addresses_issue": "i3",
      "key_observation": "During administration, income received by administrator is for estate administration, not on behalf of residuary beneficiaries."
    },
    {
      "id": "cr2",
      "text": "Cites English law and cases: Residuary beneficiary has no interest in income until residue ascertained; income is of executors/administrators.",
      "addresses_issue": "i3",
      "key_observation": "No relation back for residue bequest."
    },
    {
      "id": "cr3",
      "text": "S.41 requires income received on behalf of a person; condition not fulfilled during incomplete administration even though Administrator-General expressly mentioned.",
      "addresses_issue": "i1",
      "key_observation": "Position of Administrator-General de bonis non same as executor regarding income received."
    },
    {
      "id": "cr4",
      "text": "High Court erred in repelling argument that Administrator-General not within S.41; section has additional condition of receiving on behalf of persons.",
      "addresses_issue": "i1",
      "key_observation": "Cites V. M. Raghavalu Naidu v. CIT approvingly."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 41 of the Indian Income Tax Act, 1922 not applicable as appellant received income on own behalf, not on behalf of five sons.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Answers to both referred questions in the affirmative.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "V. M. Raghavalu Naidu v. Commissioner of Income Tax and Excess Profits Tax, Madras",
      "citation": "(1950) 18 I.T.R. 787",
      "treatment": "followed",
      "relevance": "S.41 has no application where administration not completed"
    },
    {
      "case_name": "Asit Kumar Ghose v. Commissioner of Agricultural Income-Tax, West Bengal",
      "citation": "(1952) 22 I.T.R. 177",
      "treatment": "referred",
      "relevance": "Cited by AAC for levy only post-administration"
    },
    {
      "case_name": "Birendra Kumar Datta v. Commissioner of Income tax, Calcutta",
      "citation": "(1961) 42 I.T.R. 661",
      "treatment": "distinguished",
      "relevance": "Relied by appellant for determinate shares"
    },
    {
      "case_name": "R. v. Income Tax Special Commissioners, Ex parte, Dr. Barnardos Homes",
      "citation": "7 T.C. 646",
      "treatment": "followed",
      "relevance": "Income during administration is of executors, not residuary legatee"
    },
    {
      "case_name": "Lord Sudeley v. Attorney-General",
      "citation": "1897 A.C. 11",
      "treatment": "followed",
      "relevance": "Residuary legatee has no interest until residue ascertained"
    },
    {
      "case_name": "Maria Celeste Samaritan Society of the London Hospital v. The Commissioners of Inland Revenue",
      "citation": "11 T.C. 226",
      "treatment": "followed",
      "relevance": "Supports general proposition on residue"
    },
    {
      "case_name": "Corbett v. Commissioners of Inland Revenue",
      "citation": "21 T.C. 449",
      "treatment": "followed",
      "relevance": "General proposition applicable to all residue cases during administration"
    },
    {
      "case_name": "In re Cunliffe-Owen; Mountain v. Inland Revenue Commissioners",
      "citation": "1953 1 Ch. 545",
      "treatment": "distinguished",
      "relevance": "Title of residuary legatee same before/after administration, but does not mean executor receives income on their behalf"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act, 1922",
      "sections": [
        "Section 41",
        "Section 3",
        "Section 4",
        "Section 66A(2)"
      ],
      "relevance": "Governs assessment of income received by Administrator-General; S.41 applies only if received on behalf of persons, proviso for indeterminate shares/max rate; otherwise Ss.3,4"
    },
    {
      "name": "Indian Succession Act",
      "sections": [
        "Section 211"
      ],
      "relevance": "Administrator-General receives income as legal representative of deceased, not on behalf of beneficiaries"
    },
    {
      "name": "Mussalman Wakf Validating Act, 1913",
      "sections": [
        "6 of 1913"
      ],
      "relevance": "Mentioned in S.41 regarding trustees under wakf deeds"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals with costs, holding that Section 41 of the Indian Income Tax Act, 1922, does not apply as the Administrator-General received the income on his own behalf during incomplete administration, not on behalf of the beneficiaries; answers to referred questions affirmed in favour of Revenue.",
    "relief_granted": null,
    "costs": "with costs"
  },
  "key_quotes": [
    {
      "text": "\"It is the condition of the application of this section (s. 41) that the Administrator-General of West Bengal shall receive the income on behalf of the beneficiaries.\"",
      "speaker": "court",
      "significance": "Tribunal's key holding on S.41 condition"
    },
    {
      "text": "\"During the administration of the estate, the appellant did not receive the income on behalf of the five sons. When he received the income, he had a discretion to use it either for paying legacy A or legacy B or for meeting the expenses.\"",
      "speaker": "court",
      "significance": "Core reasoning why S.41 inapplicable"
    },
    {
      "text": "\"The income from which this Income Tax was deducted was not the income of the charity. It was the income of the executors.\" - Viscount Finlay",
      "speaker": "court",
      "significance": "From Dr. Barnardos case, illustrating income belongs to executors during administration"
    },
    {
      "text": "\"The appeals are, therefore, dismissed with costs.\"",
      "speaker": "court",
      "significance": "Final disposition"
    }
  ],
  "_case_id": "1964_199",
  "_label": 0,
  "_text_length": 19491,
  "_extracted_at": "2026-02-10T19:45:45.921003"
}