{
  "metadata": {
    "case_name": "Assessee (Appellant) v. Commissioner of Income-tax",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Appeal by special leave granted on November 5, 1962",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant filed a return showing an income of Rs. 78,350 for the assessment year 1954-55.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Income-tax Officer by order dated February 26, 1958, did not accept the trading accounts and added Rs. 75,000, concluding profits low compared to earlier year, no day-to-day stock details, and ridiculously small withdrawals (Shri R. S. Sanghvi Rs. 6,900, Shri C. T. Shah Rs. 6,300).",
      "type": "material",
      "date": "1958-02-26",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Assessee appealed to Appellate Assistant Commissioner, who by order dated October 16, 1958, accepted appeal, deleted Rs. 75,000 addition but allowed reduction of Rs. 70,510 due to undervalued closing stock of Eveready torches by Rs. 4,490.",
      "type": "procedural",
      "date": "1958-10-16",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "AAC accepted that dealing in hundreds of items made stock account heavy task; excluding commission sales, average profit margin 5.5% reasonable; no higher margins cited by ITO; no defects in accounts or suppression; purchases and sales vouched, parties identifiable.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Income-tax Officer appealed to Income-tax Appellate Tribunal, which restored addition made by ITO less Rs. 4,490.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Tribunal noted AAC overlooked that even preceding year had goods from National Carbon Co. Ltd.; eliminating them, preceding year margin 11.3% vs 5.8% this year; wholesale business, no difficulty tallying major items; fall in margin unexplained especially with import quota Rs. 8,00,000 yielding handsome profit; proviso to s.13 applicable; ITO margin reasonable.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Assessee applied to Tribunal under s.66(1) for statement of case; rejected by order dated December 19, 1960, as findings of fact based on adequate material, no question of law.",
      "type": "procedural",
      "date": "1960-12-19",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Assessee applied to High Court under s.66(2); dismissed by order dated October 3, 1961.",
      "type": "procedural",
      "date": "1961-10-03",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Supreme Court granted special leave to appeal on November 5, 1962.",
      "type": "procedural",
      "date": "1962-11-05",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order of the Tribunal that the proviso to section 13 was clearly applicable to the trading results and restoring the addition made by the Income-tax Officer to the extent of Rs. 70,510 is an order made without due consideration of evidence, on irrelevant materials, conjectures, surmises, or inadmissible material, and whether such addition should be deleted.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the proviso to section 13 can be applied merely on grounds of no stock register and low profits compared to previous years.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether there is any material to support the Tribunal's finding that income, profits and gains cannot properly be deduced from the method of accounting employed by the assessee.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellate Tribunal should have referred the question of law posed by assessee.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Section 66(1) of Indian Income-tax Act"
    },
    {
      "id": "pa2",
      "text": "Proviso to s.13 cannot be applied merely on no stock register and low profits vs previous years; these never attract proviso as matter of law.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "Pioneer Sports Ltd. v. CIT (Lahore HC); Pandit Bros. v. CIT (Punjab HC)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Tribunal conclusions are findings of fact based on adequate material, no question of law.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Wholesale business, no difficulty tallying major items; fall in profit margin unexplained, especially with Rs. 8L import quota yielding handsome profits; proviso to s.13 applicable.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Proviso to section 13"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Tribunal gave relevant reasons: wholesale basis, no difficulty tallying quantities of major items; fall in margin difficult to explain given import quota Rs. 8,00,000 yielding handsome profit.",
      "addresses_issue": "i3",
      "key_observation": "There is material supporting Tribunal's finding."
    },
    {
      "id": "cr2",
      "text": "Question whether income can be properly deduced from method of accounting is question of fact; only question of law is whether any material supports the finding.",
      "addresses_issue": "i1",
      "key_observation": "Not concerned with correctness of conclusion, only if material exists."
    },
    {
      "id": "cr3",
      "text": "Pioneer Sports and Pandit Bros. have no application; ITO noticed lowness vs previous years.",
      "addresses_issue": "i2",
      "key_observation": "Distinguished cited cases."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "There is material in support of the impugned finding of the Appellate Tribunal that income, profits and gains cannot properly be deduced from the method of accounting employed.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court was right in refusing to call for a statement of the case.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pioneer Sports Ltd. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Petitioner relied: absence of stock register and low profits not adequate to reject accounts; court distinguished."
    },
    {
      "case_name": "Ganga Ram Balmokand v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "referred",
      "relevance": "Whether accounts reliable is question of fact for ITO; reasons not capricious cannot be disturbed."
    },
    {
      "case_name": "Pandit Bros. v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Petitioner relied: low profits alone not ground for addition without stock account; mere warning to scrutinize; court held no application."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "13 (proviso)",
        "66(1)",
        "66(2)"
      ],
      "relevance": "Proviso applies if income cannot be properly deduced from accounting method; s.66 for reference of questions of law."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The Supreme Court holds that the Tribunal's finding is supported by material and is a question of fact; no question of law arises for reference under s.66. High Court correctly refused the application.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We are, therefore, satisfied that the proviso to section 13 was clearly applicable to the trading results in this case and having regard to the nature of business and the availability of imported materials the margin taken by the Income-tax Officer seems to be quite reasonable.",
      "speaker": "lower_court",
      "significance": "Tribunal's key finding justifying addition."
    },
    {
      "text": "In case involving the applicability of the proviso to section 13, the question to be determined by the Income-tax Officer is a question of fact, namely, whether the income, profits and gains can or cannot be properly deduced from the method of accounting regularly adopted by the assessee.",
      "speaker": "court",
      "significance": "Defines scope of inquiry as question of fact."
    },
    {
      "text": "What we have to see is whether the finding of the Appellate Tribunal that the income, profits and gains cannot properly be deduced from the method of accounting employed by the appellant is based on any material.",
      "speaker": "court",
      "significance": "Limits SC review to existence of material."
    }
  ],
  "_case_id": "1964_264",
  "_label": 0,
  "_text_length": 9449,
  "_extracted_at": "2026-02-10T19:46:14.883567"
}