{
  "metadata": {
    "case_name": "Appellant Firm v. Commissioner of Income-tax",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 83 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants, a firm carrying on business in cloth at Secunderabad, applied on June 30, 1955, for registration under s. 26-A of the Indian Income-tax Act, 1922, for the assessment year 1956-57.",
      "type": "procedural",
      "date": "1955-06-30",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "The application recited the following partners with shares in profits and losses: 1. Messrs Kylasa Sarabhiah, a firm (Yarn Shop) consisting of partners Kylasa Veeresalingam, Kylasa Nagendrarao, Kylasa Madhusudhanarao (0-6-9), Mahendrakar Narayanarao (0-3-3), Nune Vittayya (0-2-6), Pottupalli Chandrayya (0-2-6), Gande Ramayya (0-1-0).",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Four minors - K. Rajeshwarrao, K. Haranath Babu, K. Ramesh Babu and Shivakumar - admitted to the benefits of the partnership with equal shares in the profits falling to the share of the Yarn Shop; losses shared equally only by major partners K. Veeresalingam, Nagendrarao and K. Madhusudhanarao.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Yarn Shop constituted under instrument dated May 12, 1955, amending deed dated February 20, 1952.",
      "type": "background",
      "date": "1955-05-12",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Income-tax Officer rejected the application for registration.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Rejection confirmed in appeal by Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Income-tax Appellate Tribunal confirmed rejection, holding that benefits to minors not specified, particulars of profit/loss distribution not given, and Yarn Shop introduced as a partner.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Andhra Pradesh High Court answered negatively the question referred under s. 66(1): 'Whether on the facts and circumstances of the case, the assessee is entitled to registration under s. 26-A of the Income-tax Act?' dated August 18, 1960.",
      "type": "procedural",
      "date": "1960-08-18",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Application signed by major partners, accompanied by original instrument, certificate of prior year profits given.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of the case, the assessee is entitled to registration under s. 26-A of the Income-tax Act?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Deed of partnership specifies individual shares of partners, including division among Yarn Shop members and minors' benefits; application conforms to rules; signed by majors; Yarn Shop members are individual partners.",
      "supporting_facts": [
        "f2",
        "f3",
        "f9"
      ],
      "legal_basis": "s. 26-A Indian Income-tax Act, 1922; Rules 2, 3, 4"
    },
    {
      "id": "pa2",
      "text": "Defect in Yarn Shop's own deed does not affect appellant firm's registration.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Benefits to minors admitted not specified; no particulars of profit/loss distribution; Yarn Shop introduced as partner; no profit sharing ratio in Yarn Shop deed.",
      "supporting_facts": [
        "f3",
        "f4",
        "f7"
      ],
      "legal_basis": "s. 26-A Indian Income-tax Act, 1922; Dulichand Laxminarayan v. CIT"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Requirements of s. 26-A and rules must be strictly complied with for registration benefit.",
      "addresses_issue": "i1",
      "key_observation": "Registration if firm lawfully constituted under instrument specifying individual shares and ITO satisfied of genuine firm."
    },
    {
      "id": "cr2",
      "text": "Deed must be reasonably construed; firm not a legal person, agreement by firm name makes partners individual partners.",
      "addresses_issue": "i1",
      "key_observation": "Collective share of Yarn Shop specified as 0-6-9, with internal division recited in preamble for profits/losses and minors."
    },
    {
      "id": "cr3",
      "text": "Substance not overshadowed by collective description; agreement between seven individuals (three majors and four others of Yarn Shop); all signed as majors.",
      "addresses_issue": "i1",
      "key_observation": "Shares clearly defined though not in precise fractions; 'specify' means mentioning/describing in detail."
    },
    {
      "id": "cr4",
      "text": "Dulichand case distinguished: here shares specified, all relevant members signed.",
      "addresses_issue": "i1",
      "key_observation": "Yarn Shop deed defect irrelevant to appellant firm's registration."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Assessee entitled to registration under s. 26-A; High Court answer discharged, affirmative answer recorded.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dulichand Laxminarayan v. Commissioner of Income-tax, Nagpur",
      "citation": "1956 S.C.R. 154",
      "treatment": "distinguished",
      "relevance": "Held partnership between individual, HUF, firms could not be registered as firm cannot be partner and not all signed; distinguished here as shares specified and signed properly."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 26-A",
        "s. 59",
        "s. 66(1)"
      ],
      "relevance": "Governs registration of firms; requires instrument specifying individual shares; rules for application."
    },
    {
      "name": "Income-tax Rules",
      "sections": [
        "Rule 2",
        "Rule 3",
        "Rule 4",
        "Rule 6"
      ],
      "relevance": "Prescribe form, signing by partners (not minors), original deed, satisfaction for certificate, renewal."
    },
    {
      "name": "Indian Partnership Act, 1932",
      "sections": null,
      "relevance": "Defines partnership as relation between persons agreeing to share profits; firm not a person."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal by special leave allowed; High Court's negative answer to reference discharged; affirmative answer recorded that assessee entitled to registration under s. 26-A.",
    "relief_granted": "Registration under s. 26-A granted",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the substance of the agreement cannot be permitted to be overshadowed merely by the use of the collective description of some of the persons who agreed to be partners.",
      "speaker": "court",
      "significance": "Emphasizes looking at true partners despite firm name usage."
    },
    {
      "text": "The word 'specify' is used in s. 26-A and Rule 2 as meaning, mentioning, describing or defining in detail it does not mean expressly setting out in fractional or other shares.",
      "speaker": "court",
      "significance": "Clarifies requirement for share specification."
    }
  ],
  "_case_id": "1964_82",
  "_label": 1,
  "_text_length": 10496,
  "_extracted_at": "2026-02-10T19:43:32.016533"
}