{
  "metadata": {
    "case_name": "Devilal Modi v. Sales Tax Authorities",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar C.J."
    ],
    "case_number": "Civil Appeal No. 249 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant assessed to sales-tax for the year 1957-58 under the Madhya Bharat Sales Tax Act, 1950.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant challenged the assessment order by writ petition No. 114/1961 filed in Madhya Pradesh High Court on 25th April, 1961.",
      "type": "procedural",
      "date": "1961-04-25",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "High Court dismissed writ petition No. 114/1961.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Appellant filed appeal by special leave against High Court decision; dismissed by Supreme Court on 8th March, 1963.",
      "type": "procedural",
      "date": "1963-03-08",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Madhya Bharat Sales Tax Act, 1950 repealed by Madhya Pradesh General Sales Tax Act, 1958 on 1st April, 1959.",
      "type": "background",
      "date": "1959-04-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Notice issued to appellant by Assistant Commissioner of Sales Tax under 1958 Act on 31st December, 1960, stating sales from 1-4-1957 to 31-3-1958 escaped assessment, liable to reassessment under s.19(1).",
      "type": "material",
      "date": "1960-12-31",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Fresh assessment proceedings started; order passed on 31st March, 1961, imposing additional tax of Rs. 31,250 and penalty of Rs. 15,000 for 1957-58.",
      "type": "material",
      "date": "1961-03-31",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Earlier assessment under 1950 Act cancelled by order under s.39(2) of 1958 Act.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "In first writ petition, appellant contended: delegation under s.30 of 1958 Act was of duties not powers under s.19, invalidating proceedings; sales already assessed under 1950 Act, cancellation invalid.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Supreme Court rejected both contentions in appeal, dismissed with costs.",
      "type": "procedural",
      "date": "1963-03-08",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "In Supreme Court appeal hearing, appellant sought to raise two additional points not permitted: sales of sugar not chargeable under 1958 Act; penalty under s.14 of 1950 Act illegal as not saved by s.52 of 1958 Act.",
      "type": "procedural",
      "date": "1963-03-08",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Appellant filed second writ petition No. 129/1963 in Madhya Pradesh High Court on 23rd April, 1963, challenging same assessment order on the two additional grounds.",
      "type": "procedural",
      "date": "1963-04-23",
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "High Court considered additional grounds on merits and rejected them; dismissed second writ petition on 29th April, 1963.",
      "type": "procedural",
      "date": "1963-04-29",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the principle of constructive res judicata can be invoked against a writ petition filed under Art. 226 of the Constitution challenging the validity of the same order of assessment.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Principle of res judicata inappropriate against citizen invoking High Court's prerogative jurisdiction under Art. 226 to protect against illegal deprivation of property contrary to law.",
      "supporting_facts": [
        "f7",
        "f10"
      ],
      "legal_basis": "Article 226 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "No distinction should be made between assessments for same or different years; relied on general observations in Amalgamated Coalfields case.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Amalgamated Coalfields Ltd. v. Janapada Sabha"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Second writ petition barred by constructive res judicata as it challenges same order on grounds that could and should have been raised earlier.",
      "supporting_facts": [
        "f2",
        "f4",
        "f12"
      ],
      "legal_basis": "Doctrine of res judicata; S.11 Code of Civil Procedure"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "General principle of res judicata based on public policy: finality of court decisions and no one should face same litigation twice; applies to writ petitions under Art.226.",
      "addresses_issue": "i1",
      "key_observation": "Doctrine of constructive res judicata founded on same public policy considerations; if not applied, parties could file successive petitions urging new grounds."
    },
    {
      "id": "cr2",
      "text": "Distinguished Amalgamated Coalfields: there assessments for different years, cause of action not same; here same order for same year.",
      "addresses_issue": "i1",
      "key_observation": "Constructive res judicata applicable even if technical; prevents interminable litigation."
    },
    {
      "id": "cr3",
      "text": "Fundamental rights important but cannot override public policy and finality of judgments; earlier SC decision made impugned order final between parties.",
      "addresses_issue": "i1",
      "key_observation": "Allowing second petition would make HC order inconsistent with SC judgment."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Principle of constructive res judicata applies to writ petitions under Art.226; second writ petition challenging same assessment order barred.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Daryao and Others v. The State of U.P. Others",
      "citation": "1962 1 S.C.R. 574",
      "treatment": "followed",
      "relevance": "General principles of res judicata based on public policy: finality of decisions and avoiding repeated litigation."
    },
    {
      "case_name": "The Amalgamated Coalfields Ltd. and Anr. v. The Janapada Sabha, Chhindwara",
      "citation": "1963 Supp. 1 S.C.R. 172",
      "treatment": "distinguished",
      "relevance": "Constructive res judicata not generally applied to writs; but inapplicable there as different assessment years; general observations read in that context."
    },
    {
      "case_name": "The Amalgamated Coalfields Ltd. Anr. v. The Janapada Sabha, Chhindwara",
      "citation": "1962 1 S.C.R. 1",
      "treatment": "referred",
      "relevance": "Earlier dismissal of petition for one year; new points not allowed in appeal."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madhya Bharat Sales Tax Act, 1950",
      "sections": [
        "Section 14"
      ],
      "relevance": "Penalty imposed under this repealed Act; contended not saved."
    },
    {
      "name": "Madhya Pradesh General Sales Tax Act, 1958",
      "sections": [
        "Section 19(1)",
        "Section 30",
        "Section 39(2)",
        "Section 52"
      ],
      "relevance": "Reassessment under s.19(1); delegation under s.30; cancellation of prior assessment under s.39(2); saving clause s.52."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Writ jurisdiction invoked to challenge assessment order."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 11"
      ],
      "relevance": "Enacts constructive res judicata."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal against the High Court's dismissal of the second writ petition is dismissed, holding that the second writ petition is barred by constructive res judicata.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The short question which this appeal raises for our decision is whether the principle of constructive res judicata can be invoked against a writ petition filed by the appellant Devilal Modi... under Art. 226 of the Constitution.",
      "speaker": "court",
      "significance": "Frames the core legal issue."
    },
    {
      "text": "We are, therefore, satisfied that the second writ petition filed by the appellant in the present case is barred by constructive res judicata.",
      "speaker": "court",
      "significance": "Key holding on applicability of constructive res judicata to writs."
    },
    {
      "text": "Considerations of public policy cannot be ignored in such cases, and the basic doctrine that judgments pronounced by this Court are binding and must be regarded as final between the parties...",
      "speaker": "court",
      "significance": "Emphasizes public policy and finality overriding successive challenges."
    }
  ],
  "_case_id": "1964_236",
  "_label": 0,
  "_text_length": 16144,
  "_extracted_at": "2026-02-10T19:45:32.538512"
}