{
  "metadata": {
    "case_name": "State of Orissa v. Respondent Dealer",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "SIKRI, J."
    ],
    "case_number": "Civil Appeals Nos. 507-508 of 1963",
    "date_of_judgment": "1964-04-21"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, hereinafter referred to as the dealer, filed a return for the quarter ending June 30, 1951, under the Orissa Sales Tax Act (Orissa Act XIV of 1947) claiming a deduction of Rs. 2,40,000/- under s. 5(2)(a)(ii) in respect of the goods sold to a registered dealer, named M/s. Lal Co. Ltd., BA 1335.",
      "type": "material",
      "date": "1951-06-30",
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "For the quarter ending September 30, 1951, the dealer claimed a deduction of Rs. 15,677/1/3.",
      "type": "material",
      "date": "1951-09-30",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "By two assessment orders passed under s. 12(2) of the Act, the Sales Tax Officer, Cuttack III circle, Jaipur, Orissa, determined the tax payable allowing the deduction of Rs. 2,40,000/- and Rs. 15,677/1/3, under s. 5(2)(a)(ii).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The dealer filed appeals to the Assistant Collector, Sales Tax, challenging the assessment on grounds which are not relevant.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The dealer later filed revisions against the decision of the Assistant Collector.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "While the revisions were pending, the legislature amended the Orissa Sales Tax Act, in 1957, by Orissa Sales Tax Amendment Act (Orissa Act XX of 1957). The effect of this amendment was that revisions were treated as appeals to Sales Tax Tribunal, and it enabled the Government to file cross-objections.",
      "type": "background",
      "date": "1957",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The State of Orissa filed memorandum of cross-objections challenging the deduction of Rs. 2,40,000/- and Rs. 15,677/1/3, on the ground that the dealer had not produced any declaration, as required under r. 27(2) of the Orissa Sales Tax Rules, 1947, as evidenced from the Check Sheet kept on record.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The Tribunal upheld this objection and directed that fresh assessments be made.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The Tribunal stated a case to the High Court and one of the questions referred to was whether the assessing officer was not wrong in allowing deduction of Rs. 2,40,000/- for the quarter ending on 30-6-51 and Rs. 15,677/1/3 for the quarter ending on 30-9-51 from the respective gross turnover of the applicant.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The High Court, following its earlier decision in Member, Sales-tax Tribunal, Orissa v. Messrs S. Lal Co. Limited, answered the question in the affirmative.",
      "type": "procedural",
      "date": "1950-11-04",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The State of Orissa obtained special leave from this Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "The Sales Tax Officer was satisfied by a mere statement of the dealer.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "It has not been shown that in fact the registration certificate of the buying dealer, M/s S. Lal Co., did not contain the statement that the goods were intended for resale by him in Orissa.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the assessing officer was not wrong in allowing deduction of Rs. 2,40,000/- for the quarter ending on 30-6-51 and Rs. 15,677/1/3 for the quarter ending on 30-9-51 from the respective gross turnover of the applicant without production of declaration under r. 27(2).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Correct interpretation of s. 5(2)(a)(ii) and r. 27(2).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "It is clear that r. 27(2) was not complied with, and therefore the Sales Tax Officer was wrong in allowing the said deduction.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "r. 27(2) of the Orissa Sales Tax Rules, 1947"
    },
    {
      "id": "pa2",
      "text": "The rule making authority is entitled to make rules for carrying out the purposes of the Act, and r. 27(2) is designed to ensure that a buying dealer's certificate of registration does, in fact, mention that the goods are intended for resale by him, and for that purpose it has chosen one exclusive method of proving the fact before a Sales Tax Officer. No other method of proving that fact is permissible. Rule 27(2) is mandatory and if there is breach of it the selling dealer is not entitled to deduction.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "s. 5(2)(a)(ii) and r. 27(2)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "r. 27(2) is directory. The word 'shall' should be read as 'may', in the context.",
      "supporting_facts": [],
      "legal_basis": "r. 27(2)"
    },
    {
      "id": "ra2",
      "text": "Supposing the selling dealer brought the original certificate of registration of a buying dealer and produced it before the Sales Tax Officer, according to the appellant, this would not be enough, but this could never have been intended.",
      "supporting_facts": [],
      "legal_basis": "r. 27(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "It is plain from the terms of s. 5(2)(a)(ii) that a selling dealer is entitled to a deduction in respect of sales to a registered dealer of goods, if the goods are specified in the purchasing dealer's certificate of registration as being intended for re-sale by him in Orissa. No other condition is imposed by the above section.",
      "addresses_issue": "i2",
      "key_observation": "No condition in section requiring declaration; proviso deals with misuse by buyer."
    },
    {
      "id": "cr2",
      "text": "r. 27(2) must be reconciled with the section and the rule can be reconciled by treating it as directory. But the rule must be substantially complied with in every case. It is for the Sales Tax Officer to be satisfied that, in fact, the certificate of registration of the buying dealer contains the requisite statement, and if he has any doubts about it, the selling dealer must satisfy his doubts. But if he is satisfied from other facts on the record, it is not necessary that the selling dealer should produce a declaration in the form required in r. 27(2), before being entitled to a deduction.",
      "addresses_issue": "i2",
      "key_observation": "Rule directory, substantial compliance needed, other evidence permissible if STO satisfied."
    },
    {
      "id": "cr3",
      "text": "In this case, the Sales Tax Officer was satisfied by a mere statement of the dealer and it has not been shown that in fact the registration certificate of the buying dealer, M/s S. Lal Co., did not contain the statement that the goods were intended for resale by him in Orissa.",
      "addresses_issue": "i1",
      "key_observation": "STO satisfied, no proof certificate lacked requisite entry."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The High Court is correct in holding that the production of a declaration under r. 27(2) is not always obligatory on the part of a selling dealer when claiming the exemption. It is open to him to claim exemption by adducing other evidence so as to bring the transaction within the scope of s. 5(2)(a)(ii) of the Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Member, Sales-tax Tribunal, Orissa v. Messrs S. Lal Co. Limited",
      "citation": "1961 12 S.T.C. 25",
      "treatment": "followed",
      "relevance": "High Court followed this decision in answering the question in the affirmative."
    }
  ],
  "statutes_cited": [
    {
      "name": "Orissa Sales Tax Act, 1947 (Orissa Act XIV of 1947)",
      "sections": [
        "s. 5(2)(a)(ii)",
        "s. 12(2)"
      ],
      "relevance": "Governs deductions for sales to registered dealers and assessment procedure; key to entitlement to deduction if goods specified in buyer's certificate."
    },
    {
      "name": "Orissa Sales Tax Amendment Act, 1957 (Orissa Act XX of 1957)",
      "sections": [],
      "relevance": "Treated revisions as appeals to Tribunal and enabled Government cross-objections."
    },
    {
      "name": "Orissa Sales Tax Rules, 1947",
      "sections": [
        "r. 27(2)"
      ],
      "relevance": "Requires production of declaration for deduction claim under s.5(2)(a)(ii); held directory."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals fail and are dismissed with costs. The Supreme Court upheld the High Court's view that declaration under r.27(2) is not mandatory if Sales Tax Officer is otherwise satisfied.",
    "relief_granted": "None to petitioner; deductions upheld.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "r. 27(2) must be reconciled with the section and the rule can be reconciled by treating it as directory. But the rule must be substantially complied with in every case.",
      "speaker": "court",
      "significance": "Core holding on nature of the rule."
    },
    {
      "text": "It is open to him to claim exemption by adducing other evidence so as to bring the transaction within the scope of s. 5(2)(a)(ii) of the Act.",
      "speaker": "court",
      "significance": "Clarifies alternative proof permissible for deduction."
    }
  ],
  "_case_id": "1964_344",
  "_label": 0,
  "_text_length": 8039,
  "_extracted_at": "2026-02-10T19:46:55.518638"
}