{
  "metadata": {
    "case_name": "State of Madras v. Ranganatha Mudaliar",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "SIKRI J."
    ],
    "case_number": "Civil Appeal No. 701/1963",
    "date_of_judgment": "1964-04-30"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, hereinafter referred to as the assessee, purchased an estate in 1950, known as Silver Cloud Estate, consisting of tea, coffee and rubber plantations, in Gudalur, Nilgiris, Madras State.",
      "type": "background",
      "date": "1950",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Out of the sale price of Rs. 3,10,000, he borrowed Rs. 2,90,000, at interest varying from seven to eight per cent per annum.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For the assessment year 1955-56, the assessee claimed to deduct interest on this sum, amounting to Rs. 22,628-9-8.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Agricultural Income Tax Officer, Gudalur, disallowed Rs. 21,057-15-1, allowing Rs. 1,570-10-7, under S. 5(k) of the Madras Plantations Agricultural Income-Tax Act, 1955.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Gross income Rs. 1,04,710-13-11. Borrowing limited to 25 per cent thereof i.e. Rs. 26,177-11-6. Interest at six per cent thereon Rs. 1,570-10-7.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The assessee appealed to the Assistant Commissioner of Agricultural Income Tax, without success.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The assessee appealed to the Madras Plantations Agricultural Income Tax Appellate Tribunal. The Tribunal held that interest paid towards a loan borrowed for acquisition of the estate does not fall within section 5(e), as it is to liquidate a personal liability, lacking direct and proximate connection with the plantation.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f8",
      "text": "The assessee filed a revision application to the Madras High Court under s. 54(1) of the Act, raising the question: Whether interest paid on monies borrowed for the purchase of the plantation is expenditure of the nature referred to in section 5(e) of the Act.",
      "type": "procedural",
      "date": "1960-01-19",
      "source": "assessee"
    },
    {
      "id": "f9",
      "text": "The High Court held that the deduction claimed fell within s. 5(e), and the whole of Rs. 22,628-9-8 should have been deducted, not merely Rs. 1,570-10-7. Ordered assessment revised accordingly.",
      "type": "procedural",
      "date": "1960-01-19",
      "source": "high_court"
    },
    {
      "id": "f10",
      "text": "This Court gave special leave to the appellant to appeal against the High Court judgment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether interest paid on monies borrowed for the purchase of the plantation is expenditure of the nature referred to in section 5(e) of the Act and should therefore be deducted in assessing the income of the Plantation during the year.",
      "framed_by": "high_court"
    },
    {
      "id": "i2",
      "text": "Whether the interest payment is in the nature of capital expenditure, personal expense of the assessee, or not laid out wholly and exclusively for the purpose of the plantation under s.5(e).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Interest is in the nature of capital expenditure because the assessee bought the plantation with borrowed money, which was capital expenditure.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "S. 5(e) of the Act; Assam Bengal Cement Co. Ltd. v. CIT; S. Kuppuswami v. CIT; CIT v. Siddareddy Venkatasubba Reddy; European Investment Trust Co. v. Jackson"
    },
    {
      "id": "pa2",
      "text": "Interest payment is a personal expense of the assessee.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "S. 5(e)"
    },
    {
      "id": "pa3",
      "text": "Interest is not laid out or expended wholly and exclusively for the purpose of the plantation, lacking direct and proximate connection.",
      "supporting_facts": [
        "f2",
        "f7"
      ],
      "legal_basis": "S. 5(e); Metro Theatre Bombay Ltd. v. CIT"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Interest paid on monies borrowed for purchase of plantation falls within s.5(e) as expenditure wholly and exclusively laid out for the purpose of the plantation.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3"
      ],
      "legal_basis": "S. 5(e)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Payment of interest is revenue expenditure, not capital: no new asset acquired, no enduring benefit, part of circulating capital. Ordinary commercial practice treats interest as revenue.",
      "addresses_issue": "i2",
      "key_observation": "Applying principles from Assam Bengal Cement Co. Ltd. v. CIT."
    },
    {
      "id": "cr2",
      "text": "Not a personal expense: personal expenses are on the person or personal needs like clothes, food, not expenses to discharge obligation related to business.",
      "addresses_issue": "i2",
      "key_observation": "Any expense to discharge personal obligation does not become personal expense under s.5(e)."
    },
    {
      "id": "cr3",
      "text": "Expenditure laid out wholly and exclusively for purpose of plantation: assessee as owner working plantation, purchase and working integrated; interest closely related. No distinction between interest for acquisition and for running plantation.",
      "addresses_issue": "i1",
      "key_observation": "Act taxes agricultural income, deduct expenses per commercial accounting; farmer treats such interest as expense."
    },
    {
      "id": "cr4",
      "text": "Distinguished cases like Metro Theatre: there no immediate connection; here purchase for working as plantation.",
      "addresses_issue": "i2",
      "key_observation": "Cited Eastern Investments Ltd. v. CIT; Dharamvir Dhir v. CIT; CIT v. Jagannath Kissonlal; CIT Kerala v. Malayalam Plantations."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The deduction claimed by the assessee fell within the scope of s. 5(e) of the Act, and the whole of Rs. 22,628-9-8, and not merely Rs. 1,570-10-7, should have been deducted from his assessable income.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Assam Bengal Cement Co. Ltd. v. Commissioner of Income Tax",
      "citation": "1955 1 S.C.R. 972",
      "treatment": "followed",
      "relevance": "Principles to distinguish capital from revenue expenditure."
    },
    {
      "case_name": "Commissioner of Income Tax, Kerala v. Malayalam Plantation Ltd.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Scope of 'for the purpose of the business' under similar provision."
    },
    {
      "case_name": "Eastern Investments Ltd. v. Commissioner of Income Tax, West Bengal",
      "citation": null,
      "treatment": "followed",
      "relevance": "Interest on borrowings used for investments deductible as business expenditure."
    },
    {
      "case_name": "Dharamvir Dhir v. Commissioner of Income Tax",
      "citation": "1961 3 S.C.R. 359",
      "treatment": "followed",
      "relevance": "Payment of share of profits for financing deductible."
    },
    {
      "case_name": "Commissioner of Income Tax, Bombay v. Jagannath Kissonlal",
      "citation": null,
      "treatment": "followed",
      "relevance": "Deduction for amount paid on joint promissory note to bank."
    },
    {
      "case_name": "S. Kuppuswami v. Commissioner of Income Tax, Madras",
      "citation": "I.L.R. 1954 Mad. 977",
      "treatment": "distinguished",
      "relevance": "Goodwill acquisition capital expenditure."
    },
    {
      "case_name": "Commissioner of Income-Tax, Madras v. Siddareddy Venkatasubba Reddy",
      "citation": "1949 17 I.T.R. 15",
      "treatment": "distinguished",
      "relevance": "Mining rights acquisition capital."
    },
    {
      "case_name": "European Investment Trust Company Limited v. Jackson",
      "citation": "18 T.C. 1",
      "treatment": "distinguished",
      "relevance": "English rules prohibiting capital employment deductions."
    },
    {
      "case_name": "Metro Theatre Bombay Ltd. v. Commissioner of Income Tax",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Interest on borrowing for land lease not connected to cinema business."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Plantations Agricultural Income-Tax Act, 1955",
      "sections": [
        "S. 2(a)",
        "S. 2(r)",
        "S. 3",
        "S. 4",
        "S. 5(e)",
        "S. 5(k)",
        "S. 54(1)"
      ],
      "relevance": "Definition of agricultural income and plantation; charging section; computation of income with deductions for expenditure wholly for plantation and limited interest on borrowings."
    },
    {
      "name": "Income Tax Act, 1922",
      "sections": [
        "S. 10(2)",
        "S. 12(2)"
      ],
      "relevance": "Similar provisions to s.5(e); precedents applied analogously."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(c)"
      ],
      "relevance": "High Court refused certificate; Supreme Court granted special leave."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The Supreme Court agrees with the High Court that the full interest deduction of Rs. 22,628-9-8 is allowable under s.5(e) of the Act, without limitation under s.5(k).",
    "relief_granted": "Full deduction of interest claimed allowed; assessment to be revised accordingly.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the payment of interest on the amount borrowed for the purchase of the plantation when the whole transaction of purchase and the working of the plantation is viewed as an integrated whole, is so closely related to the plantation that the expenditure can be said to be laid out or expended wholly and exclusively for the purpose of the plantation.\"",
      "speaker": "court",
      "significance": "Core holding on why interest qualifies under s.5(e)."
    },
    {
      "text": "\"No farmer would treat interest paid on capital borrowed for the purchase of the plantation as anything but expenses, and as long as the deductions he claims... can be fairly said to lead to the determination of the true net agricultural income, these must be allowed under the Act.\"",
      "speaker": "court",
      "significance": "Justification based on commercial accounting and purpose of taxing net income."
    },
    {
      "text": "\"It is not possible to agree with the contention that interest paid in the year of account towards a loan borrowed by the proprietor for the purpose of acquisition of the estate will fall within the category of expenditure wholly and exclusively laid out for the purpose of the plantation.\"",
      "speaker": "tribunal",
      "significance": "Tribunal's view, rejected by High Court and Supreme Court."
    }
  ],
  "_case_id": "1964_256",
  "_label": 0,
  "_text_length": 19224,
  "_extracted_at": "2026-02-10T19:46:17.123756"
}