{
  "metadata": {
    "case_name": "State of Madras v. Owners of Lignite-bearing Lands",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeals Nos. 6 to 12 of 1963",
    "date_of_judgment": "1964-03-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Investigations conducted by the Geological Survey of India in 1947 revealed deposits of lignite in the South Arcot District of the State of Madras.",
      "type": "background",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Exploratory mining operations were commenced by the Government of Madras following discovery of lignite deposits.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Discovery of lignite led to speculation in lands in lignite-bearing areas.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On October 6, 1948, the Government of Madras issued a Press-Note announcing proposal to undertake legislation reserving power to compel any person who had purchased land on or after a date to be prescribed in 1947 in lignite-bearing areas to sell such lands to the Government at the rate at which it was purchased; advised owners not to sell to speculators.",
      "type": "background",
      "date": "1948-10-06",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On January 7, 1953, Government of Madras published a Bill to amend the Land Acquisition Act 1 of 1894.",
      "type": "procedural",
      "date": "1953-01-07",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Bill passed by State Legislature on June 2, 1953, received assent of President, published as Madras Lignite Acquisition of Land Act XI of 1953 on June 10, 1953, came into force on August 20, 1953.",
      "type": "procedural",
      "date": "1953-06-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Madras Act XI of 1953 provides: (1) compensation for lignite-bearing lands assessed on market value prevailing on April 28, 1947, not on date of s.4(1) notification; (2) power under s.17 LA Act for urgency possession for lignite mines; (3) in assessing 1947 value, non-agricultural improvements after that date not taken into account even if before s.4(1) notification.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Notifications under s.4(1) LA Act issued between January and May 1957 notifying acquisition of lands in Vriddhachalam taluk, South Arcot District.",
      "type": "procedural",
      "date": "1957-01 to 1957-05",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Notifications under s.6 LA Act followed s.4(1) notifications.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Between May and November 1957, Land Acquisition Officer made awards under s.11 LA Act assessing compensation on basis of market value on April 28, 1947, ignoring value of houses built or non-agricultural improvements made since that date.",
      "type": "procedural",
      "date": "1957-05 to 1957-11",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Owners of affected lands filed petitions under Art.226 Constitution to Madras High Court challenging validity of awards on ground that Madras Act XI of 1953 violated Art.31(2); claimed compensation at market value on s.4(1) dates, including post-1947 buildings and trees.",
      "type": "procedural",
      "date": "1958",
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "High Court upheld petitioners' contentions, declared awards based on Madras Act XI of 1953 could not be sustained.",
      "type": "procedural",
      "date": "1959-02-02",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "State of Madras preferred appeals to Supreme Court with certificate of fitness under Art.132.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether ss. 2 and 3 of the Madras Lignite Acquisition of Land Act XI of 1953 which seek to amend the Land Acquisition Act 1 of 1894 in their application to acquisition of lignite-bearing lands are invalid because they infringe the fundamental right under Art. 31 of the Constitution of owners of lands whose property is to be compulsorily acquired.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Provisions of Madras Act XI of 1953 violated fundamental right under Art.31(2); Land Acquisition Officer bound to award compensation at market value on dates of s.4(1) notifications, including value of buildings constructed after April 28, 1947 and trees thereon; awards valuing at 1947 rates excluding post-1947 improvements without jurisdiction.",
      "supporting_facts": [
        "f7",
        "f10",
        "f11"
      ],
      "legal_basis": "Art. 31(2) Constitution; Land Acquisition Act ss.4(1), 11"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Fixing anterior date (April 28, 1947) for market value not necessarily violation of Art.31(2), relying on observation in Bela Banerjee case that fixing anterior date may not violate if related to circumstances like price rise due to anticipated acquisition.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "State of West Bengal v. Mrs. Bela Banerjee (1954 S.C.R. 558)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Madras Act XI of 1953 departs from LA Act by freezing compensation at April 28, 1947 market value, depriving owners of appreciation since then and non-agricultural improvements post-1947; this is arbitrary and not just compensation under Art.31(2) as it stood pre-Fourth Amendment.",
      "addresses_issue": "i1",
      "key_observation": "Fixation of compensation on 1947 value for acquisitions years later wholly arbitrary, inconsistent with Art.31(2); no evidence appreciation solely due to acquisition scheme."
    },
    {
      "id": "cr2",
      "text": "Denial of value of non-agricultural improvements post-April 28, 1947 infringes Art.31(2) as land includes benefits, structures; owner deprived of just value of entirety acquired.",
      "addresses_issue": "i1",
      "key_observation": "Even with knowledge of possible acquisition, denial of value of post-1947 structures denies just compensation."
    },
    {
      "id": "cr3",
      "text": "Observation in Bela Banerjee about anterior dates does not save the Act; State failed to show 1947 value provides just equivalent; post-WWII land value appreciation common, not proven attributable only to lignite scheme.",
      "addresses_issue": "i1",
      "key_observation": "Prima facie denial of increments between fixed anterior date and s.4(1) date violates guarantee unless State proves otherwise."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Provisions of Madras Act XI of 1953 requiring assessment of compensation only on market value of land on April 28, 1947 plus agricultural improvements post-that date but excluding non-agricultural improvements are invalid under Art.31(2) as stood before Constitution Fourth Amendment Act, 1955.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Chiranjit Lal Chowdhuri v. Union of India",
      "citation": "1950 S.C.R. 869",
      "treatment": "followed",
      "relevance": "Cls.1 and 2 Art.31 relate to eminent domain; law must provide compensation or principles for it."
    },
    {
      "case_name": "State of West Bengal v. Subodh Gopal Bose",
      "citation": "1954 S.C.R. 587",
      "treatment": "followed",
      "relevance": "Art.31 protects against deprivation without authority of law and just compensation."
    },
    {
      "case_name": "State of West Bengal v. Mrs. Bela Banerjee",
      "citation": "1954 S.C.R. 558",
      "treatment": "followed",
      "relevance": "Principles for compensation must ensure just equivalent; fixing ceiling at anterior date (Dec 31, 1946) arbitrary if acquisition years later; anterior date may not violate in certain cases like anticipatory price rise."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Lignite Acquisition of Land Act XI of 1953",
      "sections": [
        "ss. 2",
        "s. 3"
      ],
      "relevance": "Amend LA Act for lignite lands: compensation on 1947 value, urgency s.17, exclude post-1947 non-agri improvements; held invalid under Art.31(2)."
    },
    {
      "name": "Land Acquisition Act 1 of 1894",
      "sections": [
        "s. 4(1)",
        "s. 6",
        "s. 11",
        "s. 16",
        "s. 17",
        "s. 3(a)"
      ],
      "relevance": "Standard: compensation at market value on s.4(1) date including improvements; Madras Act departs by using 1947 date."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 31(1)",
        "Art. 31(2)",
        "Art. 132",
        "Art. 226"
      ],
      "relevance": "Fundamental right against deprivation without just compensation; writs filed under 226; appeals under 132."
    },
    {
      "name": "Constitution (Fourth Amendment) Act, 1955",
      "sections": [
        "amendment to Art. 31(2)"
      ],
      "relevance": "Act passed before amendment; validity judged pre-amendment; no opinion on post-amendment retrospective legislation."
    },
    {
      "name": "Seventh Schedule, List III, Entry 42",
      "sections": [
        "Entry 42"
      ],
      "relevance": "Legislative power on principles for compensation in acquisition."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals by State of Madras, upholding Madras High Court declaration that awards under Madras Act XI of 1953 invalid; ss.2 and 3 held to infringe Art.31(2); no opinion on s.17 urgency provision.",
    "relief_granted": "Writs upheld; State to refrain from possession without adequate compensation.",
    "costs": "In C.A. No. 11/63 alone, State of Madras to pay costs of respondent; others no appearance."
  },
  "key_quotes": [
    {
      "text": "Fixation of compensation for compulsory acquisition of lands notified many years after that date, on the market value prevailing on the date on which lignite was discovered is wholly arbitrary and inconsistent with the letter and spirit of Art. 31(2).",
      "speaker": "court",
      "significance": "Core holding on why 1947 fixation arbitrary."
    },
    {
      "text": "The right which is guaranteed is undoubtedly the right to just indemnification for loss, and appreciation in the market value of the land because of the proposed acquisition may in assessing compensation be ignored.",
      "speaker": "court",
      "significance": "Clarifies limits on anterior date but rejects State's reliance."
    },
    {
      "text": "To deny to the owner of the land compensation at rates which justly indemnify him for his loss by awarding him compensation at rates prevailing ten years before the date on which the notification under s.4(1) was issued amounts in the circumstances to a flagrant infringement of the fundamental right.",
      "speaker": "court",
      "significance": "Emphasizes scale of injustice due to time gap."
    }
  ],
  "_case_id": "1964_252",
  "_label": 0,
  "_text_length": 20727,
  "_extracted_at": "2026-02-10T19:46:20.955730"
}