{
  "metadata": {
    "case_name": "Appellant (Tenant) v. Respondent (Landlord)",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Civil Appeal No. 61 of 1964",
    "date_of_judgment": "1964-04-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a tenant of the ground-floor of a house owned by the respondent.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent sued for ejectment of the appellant on the ground that he required the entire house, including the portion occupied by the appellant, for his residential purpose. The whole suit bungalow is very old-built about 75 years ago and at present its different parts are likely to give way and collapse. Before sometime, a little portion of an upper balcony had collapsed. In the circumstances, on finding it unsafe to stay in it without making additions, alterations and necessary changes, the plaintiff is obliged to wait till he gets possession of the whole bungalow. The plaintiff has got the upper portion of the said suit bungalow vacated at present and only after the whole bungalow is got overhauled, the plaintiff can utilize it for his personal use.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "The trial Court found that the respondent bona fide required the premises for his occupation. It repelled the contention of the appellant that the provisions of s. 13(1)(g) would not be applicable when the landlord did not wish to occupy the premises as such but intended to occupy it after carrying out major repairs, and decreed the respondent's suit for ejectment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "The appellant's appeal to the appellate Court was dismissed. The appellate Court agreed with the views of the trial Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "The appellant presented a revision petition to the Gujarat High Court (referred to as Bombay High Court in some parts), which was rejected on October 28, 1963 in Civil Revision Application No. 697 of 1962.",
      "type": "procedural",
      "date": "1963-10-28",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "True construction of sub-cls. (g) and (hh) of sub-s. (1) of S. 13 of the Bombay Rents, Hotel and Lodging House Rates Control Act, 1947.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether a decree in ejectment should be passed on the ground of personal requirement under s. 13(1)(g) of the Act where it was proved that the landlord wanted to pull down the premises and build another and then occupy it, or whether such case falls under cl. (hh) of s. 13(1).",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the revision to the High Court was competent, as no question of jurisdiction was involved.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The respondent did not reasonably and bona fide require the premises for his occupation and did not reasonably and bona fide require the premises for carrying out repairs.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "S. 13(1)(g) of the Act"
    },
    {
      "id": "pa2",
      "text": "The case falls under s. 13(1)(hh), as the respondent wants the premises for the immediate purpose of demolishing it and erecting a new building. The two grounds for ejectment under cls. (g) and (hh) are mutually exclusive and therefore a landlord cannot take advantage of cl. (g) when his case falls under cl. (hh). Cl. (g) applies only when the landlord bona fide needs to occupy the premises without making any alteration in them.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "S. 13(1)(g) and (hh) of the Act"
    },
    {
      "id": "pa3",
      "text": "On the facts found, the trial Court assumed jurisdiction which it did not have and therefore the revision was competent.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "S. 28 of the Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The respondent bona fide required the premises for occupation by himself after overhauling it.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "S. 13(1)(g) of the Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Preliminary objection upheld: Revision to High Court incompetent as no question of jurisdiction involved. Trial Court had jurisdiction under S. 28 to entertain suit and interpret cl. (g). High Court could not interfere in revision even if appellate Court erred on facts or law.",
      "addresses_issue": "i3",
      "key_observation": "The question raised is one of interpretation of cls. (g) and (hh), not jurisdiction."
    },
    {
      "id": "cr2",
      "text": "Respondent's case falls under cl. (g): Bona fide requirement for own occupation proved. Mere intention to make alterations due to condition of house does not affect applicability of cl. (g). No prohibition in cl. (g) requiring occupation without alterations.",
      "addresses_issue": "i1",
      "key_observation": "Once landlord establishes bona fide requirement for occupation, entitled to possession irrespective of alterations."
    },
    {
      "id": "cr3",
      "text": "Cl. (hh) applies where landlord requires premises for demolishing and erecting new building to let out to tenants, not for own occupation. Evidenced by undertakings in sub-s. (3A), and ss. 17A, 17B, 17C.",
      "addresses_issue": "i2",
      "key_observation": "Provisions of cl. (hh) unnecessary if for own occupation after alterations."
    },
    {
      "id": "cr4",
      "text": "Act restricts general right of ejectment but provides exceptions in s. 13. No reason to read restrictions into grounds. S. 17 protects against abuse of cl. (g).",
      "addresses_issue": "i1",
      "key_observation": "Narrow construction of 'premises' or 'occupies' not justified."
    },
    {
      "id": "cr5",
      "text": "Distinguished Bombay High Court cases (Manchharam and Allarkha): Expression 'occupation' in cl. (g) includes possession followed by actual occupation; aligns with Krishanlal case.",
      "addresses_issue": "i2",
      "key_observation": "Demolition and erection are intermediate steps to make fit for own occupation under cl. (g)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Revision application to High Court incompetent; appeal fails.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Landlord's case falls under s. 13(1)(g) where he bona fide requires premises for own occupation, even if intending alterations or demolition to rebuild for own use; not under s. 13(1)(hh).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Cls. (g) and (hh) not mutually exclusive in this context; (hh) for commercial redevelopment to let out.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Krishanlal Ishwarlal Desai v. Rai Vijkor",
      "citation": "(1964) 1 S.C.R. 553",
      "treatment": "followed",
      "relevance": "Construction of 'occupies' and 'occupation' under the Act; possession must be followed by overt act of occupation."
    },
    {
      "case_name": "Krishna Das v. Bidhan Chandra",
      "citation": "A.I.R. 1959 Cal. 181",
      "treatment": "referred",
      "relevance": "Provisions similar to cls. (g) and (hh) construed similarly."
    },
    {
      "case_name": "McKenna v. Porter Motors Ltd.",
      "citation": "1959 A.C. 20",
      "treatment": "referred",
      "relevance": "Provisions similar to cls. (g) and (hh) construed similarly."
    },
    {
      "case_name": "Bettys Cafes Ltd. v. Phillips Furnishing Stores Ltd.",
      "citation": "1956 A.C. 688",
      "treatment": "referred",
      "relevance": "Provisions similar to cls. (g) and (hh) construed similarly."
    },
    {
      "case_name": "Manchharam Ghelabhai Pittalwala v. The Surat Electricity Co. Ltd.",
      "citation": "Civil Revision Application No. 204/56 decided on 1-2-57 by Bombay High Court",
      "treatment": "distinguished",
      "relevance": "Held case falls under cl. (hh) not (g); Court disagreed."
    },
    {
      "case_name": "Allarkha Fakir-mahomed v. The Surat Electricity Co. Ltd.",
      "citation": "Civil Revision Application No. 164/57 decided on 8-10-57 by Bombay High Court",
      "treatment": "distinguished",
      "relevance": "Followed Manchharam; held occupation in (g) means possession followed by actual occupation, while (hh) for demolition purpose."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Rents, Hotel and Lodging House Rates Control Act, 1947 (Act LVII of 1947)",
      "sections": [
        "13(1)(g)",
        "13(1)(hh)",
        "13(1)",
        "13(3A)",
        "12(1)",
        "15",
        "17",
        "17A",
        "17B",
        "17C",
        "28",
        "5(12)"
      ],
      "relevance": "Grounds for ejectment; cl. (g) for bona fide personal occupation even with alterations; cl. (hh) for demolition to erect new building for letting out with undertakings and protections for tenants."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by special leave dismissed with costs. Revision to High Court held incompetent. On merits, landlord's suit for ejectment under s. 13(1)(g) upheld as he bona fide requires premises for own occupation after overhaul; does not fall under s. 13(1)(hh).",
    "relief_granted": "Ejectment decree of trial court affirmed.",
    "costs": "Appeal dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "The mere fact that he intends to make alterations in the house either on account of his sweet will or on account of absolute necessity in view of the condition of the house, does not affect the question of his requiring the house bona fide and reasonably for his occupation.",
      "speaker": "court",
      "significance": "Core holding on applicability of cl. (g) despite need for repairs."
    },
    {
      "text": "The provisions of cl. (hh) apply to cases where the landlord does not require the premises for his own occupation but requires them for erecting a new building which is to be let out to tenants.",
      "speaker": "court",
      "significance": "Distinguishes cl. (hh) from cl. (g)."
    },
    {
      "text": "Occupation of the premises in cl. (g) does not necessarily refer to occupation as residence. The owner can occupy a place by making use of it in any manner.",
      "speaker": "court",
      "significance": "Broad interpretation of 'occupation' under cl. (g)."
    }
  ],
  "_case_id": "1964_113",
  "_label": 0,
  "_text_length": 15610,
  "_extracted_at": "2026-02-10T19:44:08.440237"
}