{
  "metadata": {
    "case_name": "Workmen of Eagle Rolling Mills Ltd. & Ors. v. Eagle Rolling Mills Ltd. & Ors.",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR C.J."
    ],
    "case_number": "Civil Appeals Nos. 721-723 of 1962",
    "date_of_judgment": "1964-02-26"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants are workmen of three respondent concerns: Eagle Rolling Mills Ltd., Kumardhubi Engineering Works Ltd., and Kumardhubi Fire Clay and Silica Works Ltd., all under management of M/s. Bird. Co. Ltd. through a General Manager.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Respondent No. 1 in each appeal maintained a well-furnished hospital with provision for 60 permanent beds for the workmen, their families and dependents, providing satisfactory medical benefits of a very high order free of any charge.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "On 22nd August 1960, respondent No. 3 (Union of India) issued a notification under section 1, sub-section (3) appointing 28th August 1960 as the date on which some provisions of the ESI Act should come into force in certain areas of the State of Bihar, bringing the area where appellants work within the scope of the Act.",
      "type": "procedural",
      "date": "1960-08-22",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 25th August 1960, Chief Executive Officer of respondent No. 1 informed appellants that medical benefits including indoor and outdoor treatment upto the extent admissible under the Act will cease to be provided from the appointed day; notices issued and published indicating medical benefits would thereafter be governed by relevant provisions of the Act.",
      "type": "material",
      "date": "1960-08-25",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Appellants filed writ petitions before Patna High Court alleging s.1(3) of ESI Act contravenes Art.14 and suffers from excessive delegation; employers impleaded as respondent No.1, ESI Corporation and Union of India as respondents 2 and 3.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Patna High Court rejected the plea and dismissed writ petitions by judgment and order dated March 1, 1961 in Misc. Judicial Cases Nos. 1167, 1122 and 1235 of 1960.",
      "type": "procedural",
      "date": "1961-03-01",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellants appealed to Supreme Court by special leave; three appeals proceed on similar facts and raise identical question of law, heard together.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether section 1(3) of the Employees State Insurance Act, 1948 is invalid on grounds of excessive delegation.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether section 1(3) contravenes Article 14 of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether notices issued by respondent No.1 curtailing previous medical benefits are invalid.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Section 1(3) suffers from excessive delegation as it confers absolute discretion on Central Government to apply provisions by notification without guidance by any legislative provision; Act does not prescribe considerations for acting under it.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 1(3) ESI Act"
    },
    {
      "id": "pa2",
      "text": "Section 1(3) contravenes Art.14 of the Constitution.",
      "supporting_facts": [],
      "legal_basis": "Article 14 Constitution"
    },
    {
      "id": "pa3",
      "text": "Notices issued by respondent No.1 invalid as employers not entitled to curtail benefits provided earlier, which were superior qualitatively and quantitatively to those under the Act.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Challenge to notices issued by respondent No.1 cannot be considered under Art.226; proper remedy under s.10 Industrial Disputes Act or ss.74 and 75 of ESI Act.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Article 226 Constitution; s.10 Industrial Disputes Act; ss.74,75 ESI Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Section 1(3) is not delegated legislation but conditional legislation; Act prescribes self-contained code for insurance, establishes Corporation under s.3(1), and leaves timing and areas to Central Government as per usual conditional legislation practice.",
      "addresses_issue": "i1",
      "key_observation": "Powers conferred are directly under the Act itself; conditions fulfilled, legislation is automatic."
    },
    {
      "id": "cr2",
      "text": "Even if delegation, sufficient guidance from preamble (benefits for sickness, maternity, employment injury), definitions in s.2, scheme of chapters (Corporation, finance, contributions, benefits, adjudication, penalties). Impossible to apply nationwide at once; phased introduction necessary.",
      "addresses_issue": "i1",
      "key_observation": "Modern legislatures evolve welfare schemes and leave introduction to Government; not excessive delegation."
    },
    {
      "id": "cr3",
      "text": "Art.14 challenge not impressed; follows precedents on permissible delegation in welfare statutes.",
      "addresses_issue": "i2",
      "key_observation": "Consistent with Edward Mills, Bhikusa Yamasa cases."
    },
    {
      "id": "cr4",
      "text": "Question of notices' validity not under Art.226; industrial dispute for s.10 Industrial Disputes Act or ss.74,75 ESI Act.",
      "addresses_issue": "i3",
      "key_observation": "Powers under Art.226 wide but do not cover such industrial disputes."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Section 1(3) of ESI Act is constitutionally valid; not excessive delegation but conditional legislation with sufficient guidance from Act's policy and scheme.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Section 1(3) does not contravene Art.14.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Challenge to notices not maintainable under Art.226; remedy under Industrial Disputes Act s.10 or ESI Act ss.74,75.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Queen v. Burah",
      "citation": "5 I.A. 178",
      "treatment": "followed",
      "relevance": "Powers under conditional legislation are directly under the Act; legislature judges place, person, etc., conditionally."
    },
    {
      "case_name": "Edward Mills Co. Ltd., Beawar v. State of Ajmer",
      "citation": "1955 1 S.C.R. 735",
      "treatment": "followed",
      "relevance": "Delegation in Minimum Wages Act s.27 permissible; legislature authorizes what it might do itself."
    },
    {
      "case_name": "Bhikusa Yamasa Kshatriya v. Sangamner Akola Taluka Bidi Kamgar Union",
      "citation": "1963 Supp. 1 S.C.R. 524",
      "treatment": "followed",
      "relevance": "Approach to excessive delegation in welfare schemes."
    },
    {
      "case_name": "Bhikusa Yamasa Kshatriya (P) Ltd. v. Union of India",
      "citation": "1964 1 S.C.R. 860",
      "treatment": "followed",
      "relevance": "Approach to excessive delegation in welfare schemes."
    }
  ],
  "statutes_cited": [
    {
      "name": "Employees' State Insurance Act, 1948 (No. 34 of 1948)",
      "sections": [
        "1(3)",
        "2(1)",
        "3(1)",
        "2 (definitions: benefit period, employee, factory, injured person, sickness, wages)",
        "31",
        "74",
        "75"
      ],
      "relevance": "Impugned provision for bringing Act into force; scheme, definitions, Corporation, benefits, disputes; applied validly with phased implementation."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "14",
        "226"
      ],
      "relevance": "Equality violated alleged; writ jurisdiction not for industrial disputes."
    },
    {
      "name": "Industrial Disputes Act",
      "sections": [
        "10"
      ],
      "relevance": "Proper forum for disputing curtailment of benefits."
    },
    {
      "name": "Minimum Wages Act, 1948 (No. XI of 1948)",
      "sections": [
        "27"
      ],
      "relevance": "Precedent on permissible delegation."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeals, upholding validity of s.1(3) ESI Act against challenges of excessive delegation and Art.14 violation; directed appellants to seek remedy for notices under Industrial Disputes Act s.10 or ESI Act ss.74,75.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Section 1(3) is really not an illustration of delegated legislation at all it is what can be properly described as conditional legislation.\"",
      "speaker": "court",
      "significance": "Core reasoning distinguishing conditional from delegated legislation."
    },
    {
      "text": "\"Their Lordships think that it is a fallacy to speak of the powers thus conferred upon the Lieutenant-Governor (large as they undoubtedly are) as if, when they were exercised, the efficacy of the acts done under them would be due to any other legislative authority than that of the Governor-General in Council.\"",
      "speaker": "court",
      "significance": "Quote from Queen v. Burah applied to validate s.1(3)."
    },
    {
      "text": "\"The course adopted by modern legislatures in dealing with welfare schemes has uniformly conformed to the same pattern.\"",
      "speaker": "court",
      "significance": "Justifies phased implementation in beneficial legislation."
    }
  ],
  "_case_id": "1964_310",
  "_label": 0,
  "_text_length": 13598,
  "_extracted_at": "2026-02-10T19:47:06.448599"
}