{
  "metadata": {
    "case_name": "Writ Petition No. 110 of 1964 (Petitioner v. Union of India)",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Writ Petition No. 110 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner was Assistant in Grade IV of the Central Secretariat Service. Next post expected: Section Officer/Assistant Superintendent.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Recruitment to Section Officer: 50% by direct recruitment from lower ranks in IAS etc. examinations; 25% by promotion from Grade IV on basis of departmental examination by UPSC; 25% by promotion from Grade IV on seniority cum-fitness.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "February 1960: UPSC issued notification for limited competitive examination for promotion to Section Officer in June 1960. Reservation: 12.5% for Scheduled Castes, 5% for Scheduled Tribes. Number of vacancies to be announced later.",
      "type": "procedural",
      "date": "1960-02",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Petitioner sat for the examination and secured 37th position in order of merit.",
      "type": "material",
      "date": "1960-06",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "UPSC press communique: Expected 48 vacancies; 32 reserved for SC/ST, 16 unreserved.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "UPSC recommended 45 names: 16 unreserved, 29 reserved for SC/ST.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Government made 43 appointments: 15 unreserved, 28 reserved for SC/ST. Heavy reservation based on 1955 carry forward rule.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Ministry of Home Affairs resolution dated September 13, 1950: Reservation 12.5% SC, 5% ST, without carry forward rule.",
      "type": "background",
      "date": "1950-09-13",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "1952 supplementary instructions: If reserved vacancies unfilled, treat as unreserved but carry forward corresponding number to next year; if still unfilled next year, treat as unreserved and reservation lapses. Carry forward only for two years max.",
      "type": "background",
      "date": "1952",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "1955: Government substituted paras 5(3) and 5(4) of 1952 instructions. Unfilled reserved vacancies treated unreserved but added as additional quota to next year; if unfilled, carried to second year; not carried more than two years. Annual report required.",
      "type": "background",
      "date": "1955",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "This petition under Art. 32 is sequel to T. Devadasan v. Union of India (AIR 1964 SC 179), where 1955 carry forward rule struck down as unconstitutional.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "In Devadasan, only declaration that 1955 carry forward rule invalid; no other relief.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "One recommended reserved candidate died; one unreserved appointed elsewhere; hence 43 appointments.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the carry forward rule of 1952 still exists after substitution by 1955 rule which was struck down in Devadasan.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the carry forward rule of 1952, if existing, is unconstitutional under Art. 16.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether petitioner entitled to appointment assuming no carry forward rule in 1960.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Effect of Devadasan judgment: 1955 carry forward rule struck down; 1952 rule ceased to exist on substitution; no carry forward rule exists; only 12.5% SC + 5% ST reservation possible for 1960 exam.",
      "supporting_facts": [
        "f11",
        "f12",
        "f3"
      ],
      "legal_basis": "Art. 16 of Constitution; T. Devadasan v. Union of India"
    },
    {
      "id": "pa2",
      "text": "In alternative, if 1952 carry forward rule deemed to exist, it is also violative of Art. 16.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Art. 16 of Constitution"
    },
    {
      "id": "pa3",
      "text": "Petitioner entitled to appointment; set aside excess SC/ST appointments over 17%; UPSC to announce results afresh with 12.5% SC + 5% ST.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Even if 1952 carry forward rule non-existent, petitioner not entitled to appointment due to position secured in examination (37th).",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "1952 carry forward rule ceased to exist when substituted by 1955 rule; striking down 1955 does not revive 1952 as Government itself cancelled it. No carry forward rule exists post-Devadasan.",
      "addresses_issue": "i1",
      "key_observation": "Carry forward rule of 1952 clearly ceased to exist because its place was taken by the carry forward rule of 1955."
    },
    {
      "id": "cr2",
      "text": "Unnecessary to decide constitutionality of 1952 rule as it no longer exists.",
      "addresses_issue": "i2",
      "key_observation": "In this view of the matter it is unnecessary to consider whether the carry forward rule of 1952 would be unconstitutional, for that rule no longer exists."
    },
    {
      "id": "cr3",
      "text": "Devadasan only struck carry forward rule; does not affect year-to-year 12.5% SC + 5% ST reservation or adjustment between SC/ST vacancies in a year.",
      "addresses_issue": "i1",
      "key_observation": "The effect of the judgment in Devadasan's case therefore is only to strike down the carry forward rule."
    },
    {
      "id": "cr4",
      "text": "For 48 expected vacancies: 6 SC + 3 ST = 9 reserved, 39 unreserved. For 45 recommended: 6 SC + 3 ST = 9 reserved. For 43 actual: 6 SC + 3 ST = 9 reserved, 34 unreserved. Petitioner 37th (or 36th after adjustment), beyond 34 unreserved slots.",
      "addresses_issue": "i3",
      "key_observation": "The petitioner however was 36th on the unreserved quota and therefore even on the basis of there being no carry forward rule only 34 candidates would be appointed from the unreserved quota and the petitioner being 36th on his own showing can not claim appointment."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No carry forward rule exists after Devadasan: 1955 struck down, 1952 ceased on substitution.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Petitioner not entitled to appointment as merit position (36th/37th) does not qualify even without carry forward (only 34 unreserved slots out of 43).",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "T. Devadasan v. Union of India",
      "citation": "AIR 1964 SC 179",
      "treatment": "followed",
      "relevance": "Struck down 1955 carry forward rule as unconstitutional; this case is sequel, applies its effect"
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 16"
      ],
      "relevance": "Petition under Art. 32 for enforcement of fundamental rights; carry forward rules challenged as violative of Art. 16"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Petition dismissed. No carry forward rule exists post-Devadasan. Without carry forward, only 9 reserved (6 SC + 3 ST) out of 43 vacancies, leaving 34 unreserved; petitioner at 36th/37th in unreserved merit not entitled to appointment.",
    "relief_granted": "none",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "after the judgment of this Court in Devadasans case there is no carry forward rule at all",
      "speaker": "court",
      "significance": "Core holding on non-existence of carry forward rule"
    },
    {
      "text": "The petitioner however was 36th on the unreserved quota and therefore even on the basis of there being no carry forward rule only 34 candidates would be appointed from the unreserved quota and the petitioner being 36th on his own showing can not claim appointment.",
      "speaker": "court",
      "significance": "Reason petitioner fails despite no carry forward"
    },
    {
      "text": "The petition therefore fails.",
      "speaker": "court",
      "significance": "Final disposition"
    }
  ],
  "_case_id": "1964_207",
  "_label": 0,
  "_text_length": 15389,
  "_extracted_at": "2026-02-10T19:45:36.382585"
}