{
  "metadata": {
    "case_name": "Ram Krissen Singh v. State of West Bengal",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Ayyangar J."
    ],
    "case_number": "Civil Appeals Nos. 781 to 784 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The Zamindar of Simlapal entered into a contract with the appellant Ram Krissen Singh by a document dated September 3, 1946, granting him the right to cut trees in certain demarcated areas of forests of the Zamindari on payment of Rs. 7,131/8/-, with the period ending on April 14, 1955.",
      "type": "background",
      "date": "1946-09-03",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant started cutting operations but only for the first few years, after which Forest Officers of the State prevented further cutting under powers vested by the West Bengal Private Forests Act, 1948.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The appellant filed a petition under Art. 226 of the Constitution for a writ of certiorari to quash orders passed against him and for an injunction restraining Forest Officers from taking possession, cutting, and disposing of the forests covered by his agreement.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "By the time the writ petition was filed, the West Bengal Estates Acquisition Act, 1953 (Act 1 of 1954) had been passed; counter-affidavit relied on its provisions stating the estate and all rights to trees vested in the State under S. 5 by notification under S. 4.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Calcutta High Court decisions held that S. 5 did not include rights to cut trees granted to third persons by intermediary before vesting.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "West Bengal Legislature amended S. 5 by inserting S. 5(aa) with retrospective effect from commencement of principal Act via West Bengal Act 25 of 1957.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "S. 5(aa): Upon due publication of notification under S. 4, on and from date of vesting, all lands in any estate comprised in a forest together with all rights to the trees therein or to the produce thereof and held by an intermediary or any other person shall, notwithstanding anything to the contrary contained in any judgment, decree or order of any court or Tribunal, vest in the State.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Petitioner amended writ petition adding allegations regarding construction of S. 5(aa) and its constitutional validity.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Single Judge of Calcutta High Court discharged the rule by judgment dated December 24, 1958, following earlier decisions.",
      "type": "procedural",
      "date": "1958-12-24",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeal to Division Bench under Letters Patent dismissed; certificate granted under Art. 133(1)(c).",
      "type": "procedural",
      "date": "1961-03-17",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Facts in other appeals (C.As. Nos. 782-784/63) are analogous and raise the same question.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the terms of S. 5(aa) of the West Bengal Estates Acquisition Act, 1953 (as amended) are sufficient to vest in the State the right to cut trees when such right belonged on the date of vesting not to the intermediary but to a third person to whom it was granted under contract.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the enactment is unconstitutional for lack of provision for compensation to persons like the appellant whose rights vested in the State.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "S. 5(aa) vests only land held by intermediary and rights integral to it; 'together with' implies necessity for integrality between land and right to cut trees; where severed, only land vests, not tree rights.",
      "supporting_facts": [
        "f1",
        "f7"
      ],
      "legal_basis": "S. 5(aa) of West Bengal Estates Acquisition Act, 1953"
    },
    {
      "id": "pa2",
      "text": "Words 'held by an intermediary or any other person' require both land and tree rights to inhere in intermediary or single person; does not cover severed rights to third person.",
      "supporting_facts": [
        "f1",
        "f7"
      ],
      "legal_basis": "S. 5(aa) of West Bengal Estates Acquisition Act, 1953"
    },
    {
      "id": "pa3",
      "text": "Scheme of Act provides compensation for every interest acquired; no provision for compensating third-party tree-cutting rights, so such interests not within vesting provision.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": "West Bengal Estates Acquisition Act, 1953"
    },
    {
      "id": "pa4",
      "text": "No compensation provided for appellant's rights, rendering S. 5(aa) unconstitutional.",
      "supporting_facts": [
        "f1",
        "f7"
      ],
      "legal_basis": "Constitution of India"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Estate belonging to Zamindar including all rights to trees vested in State under S. 5 via notification under S. 4.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "S. 4 and S. 5 of West Bengal Estates Acquisition Act, 1953"
    },
    {
      "id": "ra2",
      "text": "Compensation provided under the Act.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "West Bengal Estates Acquisition Act, 1953"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "'Together with' denotes enumeration of items vesting in State (lands, rights to trees, produce), not requiring common ownership or integrality; means 'as well as'; disjunctive 'or to the produce thereof' confirms independent vesting.",
      "addresses_issue": "i1",
      "key_observation": "Expression 'together with' imports no condition of common ownership."
    },
    {
      "id": "cr2",
      "text": "'Held by an intermediary or any other person' covers third persons holding only tree rights without land rights; applies where land with intermediary and trees/produce with another.",
      "addresses_issue": "i1",
      "key_observation": "Legislature intended to cover persons like appellant."
    },
    {
      "id": "cr3",
      "text": "Amendment via S. 5(aa) necessitated by Calcutta HC decisions holding original S. 5 did not affect third-party tree rights; plain words overcome those decisions.",
      "addresses_issue": "i1",
      "key_observation": "Amendment achieves its purpose on plain reading."
    },
    {
      "id": "cr4",
      "text": "Absence of compensation does not affect clear construction of S. 5(aa); might raise constitutionality, but does not limit vesting.",
      "addresses_issue": "i1",
      "key_observation": "Plain words prevail over compensation scheme argument."
    },
    {
      "id": "cr5",
      "text": "Constitutional validity not pressed post-17th Amendment including Act in Ninth Schedule.",
      "addresses_issue": "i2",
      "key_observation": "Issue does not fall for consideration."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S. 5(aa) vests in the State all lands in estate comprised in forest together with rights to trees or produce held by intermediary or any other person, including severed third-party rights to cut trees.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Certain decisions of Calcutta High Court",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Held original S. 5 did not affect third-party tree-cutting rights granted before vesting; amendment overcomes these."
    }
  ],
  "statutes_cited": [
    {
      "name": "West Bengal Estates Acquisition Act, 1953 (West Bengal Act 1 of 1954)",
      "sections": [
        "S. 4",
        "S. 5",
        "S. 5(aa)"
      ],
      "relevance": "Vesting of estates, forests, tree rights in State; amendment retrospectively includes third-party rights."
    },
    {
      "name": "West Bengal Act 25 of 1957",
      "sections": [],
      "relevance": "Amends West Bengal Estates Acquisition Act by inserting S. 5(aa) with retrospective effect."
    },
    {
      "name": "West Bengal Private Forests Act, 1948",
      "sections": [],
      "relevance": "Powers of Forest Officers to prevent cutting."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226",
        "Art. 133(1)(c)"
      ],
      "relevance": "Writ petition; certificate for appeal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals challenging the construction and validity of S. 5(aa) were dismissed, upholding vesting of third-party tree-cutting rights in the State under the amended Act; constitutional challenge not pursued post-17th Amendment.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'Together with' ... is obviously used to denote not the necessity for integrality between the land and the right to cut trees by way of common ownership but as merely an enumeration of the items of property which vest in the State.",
      "speaker": "court",
      "significance": "Rejects petitioner's integrality argument on plain construction."
    },
    {
      "text": "By the use of the expression 'or any other person' therefore the legislature could obviously have intended only a person like the appellant who might not have any right to the lands ... but has a right to the trees in that land.",
      "speaker": "court",
      "significance": "Confirms coverage of third-party rights."
    },
    {
      "text": "The amendment effected ... was admittedly necessitated by certain decisions of the High Court of Calcutta which held that ... the rights so conferred were unaffected by the vesting provision in s. 5 ...",
      "speaker": "court",
      "significance": "Context for legislative intent."
    }
  ],
  "_case_id": "1964_52",
  "_label": 0,
  "_text_length": 11279,
  "_extracted_at": "2026-02-10T19:43:32.545505"
}