{
  "metadata": {
    "case_name": "Income-tax Officer, Cuddapah v. Thimmayya and Venkatanarsu",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Krishnappa and his two sons - Thimmayya and Venkatanarsu - constituted a Hindu undivided family carrying on business in mining in the name and style of Krishnappa and Sons.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The family was disrupted in 1946, and all its properties were divided among the members of the family.",
      "type": "material",
      "date": "1946",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The business of Krishnappa and Sons was taken over by a firm whose partners were Krishnappa and his two sons.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "A private limited Company styled Krishnappa Asbestos and Barytes Private Ltd. took over the business of the firm on May 21, 1947 for Rs. 2,04,000.",
      "type": "material",
      "date": "1947-05-21",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Thimmayya obtained employment under the Company as mines superintendent at a monthly salary of Rs. 400 and Venkatanarsu as General Manager at a monthly salary of Rs. 500.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Proceedings for assessment of tax due by the Hindu undivided family for the years 1941-42, 1942-43, 1944-45, 1945-46 and 1946-47 were pending at the time when the Hindu undivided family was disrupted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On May 20, 1946, Venkatanarsu claimed before the Additional Income-tax Officer, Cuddapah that the property of the Hindu undivided family had been partitioned among the members in definite portions.",
      "type": "procedural",
      "date": "1946-05-20",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "This claim was not disposed of till June 30, 1952.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Assessments for the five years in question were made by the Income-tax Officer on diverse dates between September 30, 1948 and November 30, 1950, resulting in a tax liability of Rs. 65,750 in the aggregate for the five years.",
      "type": "procedural",
      "date": "1948-09-30 to 1950-11-30",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appeals preferred against the orders of assessment to the Appellate Assistant Commissioner and the Income-tax Appellate Tribunal proved unsuccessful.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "It was contended in the appeals that in making the orders of assessment, without disposing of the claim that the family was disrupted in 1946, the Income-tax Officer had acted illegally.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "On June 30, 1952 the Income-tax Officer, Special Circle, Madras, made an order under section 25-A(1) recording that the property of the Hindu undivided family of Krishnappa and his sons was partitioned on November 2, 1946.",
      "type": "procedural",
      "date": "1952-06-30",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "As the tax due was not paid the Income-tax Officer made an order under section 46(5) of the Indian Income-tax Act, 1922 on June 25, 1958 calling upon the Managing Director to withhold the amount of tax due from the salaries payable to the defaulters Thimmayya and Venkatanarsu and to show the same to the credit of the Government of India.",
      "type": "procedural",
      "date": "1958-06-25",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Thimmayya and Venkatanarsu lodged petitions under Art. 226 of the Constitution in the High Court of Andhra Pradesh at Hyderabad, praying that writs of certiorari or other appropriate writs be issued quashing the order dated June 25, 1958 of the Income-tax Officer under section 46(5).",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Grounds of petitions: (i) after the Income-tax Officer recorded an order on June 30, 1952 under section 25-A(1) that the family has disrupted with effect from November 2, 1946, steps taken for recovery of the amount of tax assessed without an appropriate order under section 25-A(2) were invalid; (ii) arrears of tax due by the erstwhile Hindu undivided family could not be recovered from remuneration earned by them as employees of the Company.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "The petitions were decided by Seshachelapati J. in favour of the two petitioners, and the decision was confirmed in appeal by a Division Bench of the High Court of Andhra Pradesh.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "The High Court held that the order on the claim made under section 25-A(1) on June 30, 1952 was given a clear retrospective operation, and the Income-tax Officer was bound to give effect to that order recognising the partition and to follow up the consequences which flowed from the order. The petitioners were entitled to insist upon an order for apportionment under section 25-A(2) and without such an order, proceedings for collection of tax could not be commenced against them under the proviso to sub-section (2) of section 25-A.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Against the order of the High Court, with certificate of fitness, these two appeals have been preferred by the Income-tax Officer, Cuddapah.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether after recording an order under section 25-A(1) subsequent to assessments, the Income-tax Officer can recover tax from members personally without an order under section 25-A(2).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether arrears of tax due by the erstwhile Hindu undivided family could be recovered from remuneration earned by members as employees of the Company.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Effect of failure to dispose of partition claim before assessment and subsequent order under section 25-A(1).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The second paragraph of sub-section (2) of section 25-A, which is in the form of a proviso, is in substance a substantive provision imposing joint and several liability for tax assessed on the total income received by or on behalf of the joint family against all members of the family once partition is effected, whether recorded or not under sub-section (1).",
      "supporting_facts": [
        "f2",
        "f12"
      ],
      "legal_basis": "Section 25-A(2) proviso, Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "After the Income-tax Officer recorded an order on June 30, 1952 under section 25-A(1) that the family has disrupted with effect from November 2, 1946, steps taken for recovery of the amount of tax assessed without an appropriate order under section 25-A(2) were invalid.",
      "supporting_facts": [
        "f12",
        "f13",
        "f15"
      ],
      "legal_basis": "Section 25-A(1) and (2), Indian Income-tax Act, 1922"
    },
    {
      "id": "ra2",
      "text": "Arrears of tax due by the erstwhile Hindu undivided family could not be recovered from remuneration earned by them as employees of the Company.",
      "supporting_facts": [
        "f5",
        "f13",
        "f15"
      ],
      "legal_basis": "Section 46(5), Indian Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "A Hindu undivided family hitherto assessed as undivided continues to be assessed in that status notwithstanding partition unless an order under section 25-A(1) is passed recording partition. Assessments were made without disposing of the claim, appeals failed, and subsequent order under section 25-A(1) cannot re-open final assessments.",
      "addresses_issue": "i3",
      "key_observation": "Failure to make an order on the claim does not affect jurisdiction to assess the family as undivided."
    },
    {
      "id": "cr2",
      "text": "Liability to pay tax rests upon the property of the Hindu undivided family in absence of order under section 25-A(1) and consequent proceedings under sub-section (2); cannot be enforced against members personally.",
      "addresses_issue": "i1",
      "key_observation": "Proviso to section 25-A(2) transforms liability into personal liability of members only after order under sub-section (1) and apportionment."
    },
    {
      "id": "cr3",
      "text": "Income-tax Officer incompetent to attach remuneration earned by Thimmayya and Venkatanarsu as employees under section 46(5) without personal liability arising under proviso to section 25-A(2).",
      "addresses_issue": "i2",
      "key_observation": "No personal liability arises against members without order under sub-section (1)."
    },
    {
      "id": "cr4",
      "text": "High Court erred in holding assessments could be re-opened under section 25-A(2) by subsequent order under 25-A(1), but appeals still fail as no personal liability without proper orders at time of assessment.",
      "addresses_issue": "i1",
      "key_observation": "Remedy is to proceed against family property, not personal income."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Order under section 25-A(1) made after assessments cannot re-open final assessments; tax liability remains on family property, not personally on members without section 25-A(2) proceedings.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Recovery under section 46(5) from salaries invalid as no personal liability on members.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 3",
        "Section 14(1)",
        "Section 23",
        "Section 25-A(1)",
        "Section 25-A(2)",
        "Section 46(5)"
      ],
      "relevance": "Governs assessment of HUF post-partition, requirement of order recording partition before personal liability, and recovery from salaries."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for writ petitions in High Court to quash recovery order."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals filed by the Income-tax Officer are dismissed, but not for the reasons given by the High Court. The order recording partition subsequent to assessments is ignored, tax liability rests on family property, and personal recovery from salaries is invalid. High Court order confirmed.",
    "relief_granted": "Writs upheld quashing order under section 46(5); no personal recovery.",
    "costs": "Appeals dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "Liability which so long as an order was not recorded under section 25-A(1) was restricted to the assets of the Hindu undivided family is by virtue of the proviso to sub-section (2) transformed when the order is recorded, into personal liability of the members for the amount of tax due by the family.",
      "speaker": "court",
      "significance": "Explains transformation of tax liability post-partition order."
    },
    {
      "id": "kq2",
      "text": "The Income-tax Officer may assess the income of the Hindu family hitherto assessed as undivided notwithstanding partition, if no claim in that behalf has been made to him or if he is not satisfied about the truth of the claim that the joint family property has been partitioned in definite portions, or if on account of some error or inadvertence he fails to dispose of the claim.",
      "speaker": "court",
      "significance": "Clarifies jurisdiction to assess despite undisposed partition claim."
    },
    {
      "text": "In the absence of an order under sub-section (1), however, such a liability does not arise against the members of the Hindu undivided family, even if the family is disrupted.",
      "speaker": "court",
      "significance": "Core holding on no personal liability without s.25A(1) order."
    }
  ],
  "_case_id": "1964_292",
  "_label": 0,
  "_text_length": 17966,
  "_extracted_at": "2026-02-10T19:46:18.971527"
}