{
  "metadata": {
    "case_name": "Indore Malwa United Mills Ltd. v. Respondents",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao J."
    ],
    "case_number": "Civil Appeal No. 1013 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant, Indore Malwa United Mills Ltd., is a public limited company incorporated and registered under the Indore Companies Act, 1914. Since the incorporation it has been carrying on business of manufacturing cloth.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Under the Memorandum of Association of the said company, for the purpose of the textile business it was authorized to raise or borrow money from time to time and to invest its funds, inter alia, in loans to others.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The appellant-company originally appointed Ms. Karimbhai Ibrahim Co. Ltd. as its Managing Agents.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On June 8, 1926, the Board of Directors of the appellant-company passed a resolution: Resolved that Surplus Fund of the company be invested with the agents in current account with the company at the same rate of interest viz., 6.",
      "type": "material",
      "date": "1926-06-08",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On November 28, 1929, the appellant-company entered into an agreement with Ms. Karimbhai Ibrahim Sons Ltd. whereunder they were appointed as the Managing Agents of the appellant-company in place of Ms. Karimbhai Ibrahim Co. Ltd.",
      "type": "material",
      "date": "1929-11-28",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On July 19, 1932, the Board of Directors reaffirmed the resolution of June 8, 1926.",
      "type": "material",
      "date": "1932-07-19",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Pursuant to the power conferred on the Managing Agents under the said agency agreement and the said resolution, Karimbhai Ibrahim Sons Ltd. borrowed large sums of money from outsiders, entered them in the appellant-company's accounts and invested large sums with themselves in current account with the company in terms of the said resolution and utilised the same for their own purposes.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Before the Annual General Body Meeting they used to bring large amounts into the accounts of the company and show that they had paid off their debts. After satisfying the General Body they would again withdraw large sums for their purposes.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The General Body was also aware of the loans and indeed it approved the said transactions.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In the year 1933 the Managing Agency company went into liquidation.",
      "type": "material",
      "date": "1933",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "For the assessment year 1941, the appellant-company submitted its return of income and claimed thereunder a deduction, among other items, a sum of Rs. 49,13,316 under the head of bad debt and trading loss written off in the profits and loss account of the appellant-company.",
      "type": "procedural",
      "date": "1941",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The Assessing Authority allowed only Rs. 6,41,913-2-0 as bad debt and disallowed the amount due from Karimbhai Ibrahim Sons Ltd. on the ground that the said borrowings were not made for the purpose of the business of the company.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "On appeal the Appellate Authority also took the same view.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "On further appeal, the High Court confirmed the finding of the Appellate Authority on the ground that the losses incurred by the company were really dehors the business of the company, though they might involve fraudulent conduct of the Managing Agents.",
      "type": "procedural",
      "date": "1960-11-09",
      "source": "high_court"
    },
    {
      "id": "f15",
      "text": "Appeal by certificate against the order of the High Court of Madhya Pradesh, Indore Bench.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether an item of Rs. 42,63,090-14-7 should have been allowed as a trading loss in computing the profits of the appellant-company under S. 3 of the Indore Industrial Tax Rules, 1927.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the loss claimed was a trading loss which is deductible in computing the profits of the company.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The employment of the Managing Agents was incidental to the carrying on of the appellants business, that, as the Managing Agents had the power to borrow funds for the appellant-company and invest the surplus in loans to themselves the loss caused by such investment was also incidental to the carrying on of the appellants business and, therefore, the said loss was deductible in arriving at the trading profits of the appellant-company.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The assessment in question was made under the Indore Industrial Tax Rules, 1927, that under the said Rules tax was payable only in respect of the profits or gains of any cotton mill industry and that profits or loss pertaining to the money-lending activity of the appellant-company could not possibly be subject to tax or deduction under the said Rules.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Indore Industrial Tax Rules, 1927"
    },
    {
      "id": "ra2",
      "text": "The debt due by the Managing Agents was not a trading debt inasmuch as the Managing Agents borrowed moneys not necessary for the business of the appellant-company and lent to themselves the said amount and, therefore, it was a loss incurred by the appellant dehors the business of the company.",
      "supporting_facts": [
        "f7",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The first question raised by Mr. Sen is based upon the distinction between the Indore Industrial Tax Rules and the corresponding provisions of the Indian Income-tax Act... We cannot allow a question which at its best is a mixed question of fact and law to be raised for the first time before us. We shall proceed with the appeal on the basis that for the purpose of deducting trading losses in computing trading profits there is no difference between the Income-tax Act and the relevant Indore Industrial Tax Rules.",
      "addresses_issue": "i1",
      "key_observation": "First contention not raised earlier, not entertained."
    },
    {
      "id": "cr2",
      "text": "The relevant principle of law has been laid down by this Court in Badridas Daga v. Commissioner of Income-tax... The result is that when a claim is made for a deduction for which there is no specific provision in S. 10, whether it is admissible or not will depend on whether, having regard to accepted commercial practice and trading principles, it can be said to arise out of the carrying on of the business and to be incidental to it.",
      "addresses_issue": "i2",
      "key_observation": "Test for deductibility of trading loss."
    },
    {
      "id": "cr3",
      "text": "Where an agent employed by the appellant for the purpose of carrying on his business in exercise of the powers conferred on him operated on the bank accounts, withdrew moneys from it and used them for discharging his personal debts, this Court in the said decision found no difficulty in holding that the amount misappropriated and found irrecoverable was an allowable deduction under the Income-tax Act.",
      "addresses_issue": "i2",
      "key_observation": "Misappropriation by agent is incidental."
    },
    {
      "id": "cr4",
      "text": "The only difference between that case and the present one is that the Agent misappropriated the amount in that case, whereas in the present case the Managing Agents in exercise of the powers conferred by the appellant borrowed the moneys, but failed to return the same. If embezzlement of moneys entrusted to an agent is incidental to a business, by the same token moneys legally utilized by the agent must more appropriately be incidental to the business.",
      "addresses_issue": "i2",
      "key_observation": "Legal borrowing and failure to return even more incidental."
    },
    {
      "id": "cr5",
      "text": "In a recent decision in The Commissioner of Income-tax, U.P. v. Ms. Nainital Bank Ltd. this Court held that an amount lost to the bank by dacoity was a loss incidental to the business of banking.",
      "addresses_issue": "i2",
      "key_observation": "Dacoity loss incidental to banking."
    },
    {
      "id": "cr6",
      "text": "If the creditors had filed a suit against the company, could it have resisted the suit on the ground that the Managing Agents had no power to borrow the amounts for the reason that at the time they borrowed, the amounts were in excess of the requirements of the business? Decidedly not.",
      "addresses_issue": "i2",
      "key_observation": "Money became company's after borrowing."
    },
    {
      "id": "cr7",
      "text": "There was no question of fraud in this case, for the profit and loss account and the balance-sheet placed before the General Body Meeting of the Company every year brought to its notice the total amount the company borrowed through the Managing Agents and the General Body approved of it.",
      "addresses_issue": "i2",
      "key_observation": "General body approved transactions."
    },
    {
      "id": "cr8",
      "text": "The next step is the borrowing of money by the Managing Agents from the company. Under the memorandum of association as well as under the express power conferred by the said resolution, the company, through the Managing Agents, could invest its funds by way of loans... The money lent would be a debit item in the accounts of the company in accordance with the accepted commercial practice and if the amount was realized it would be a credit item. Both would be proper items of accounts for ascertaining the profit and loss of the company. If the debt became irrecoverable, it would be a bad debt.",
      "addresses_issue": "i2",
      "key_observation": "Borrowing and lending created legal obligations incidental to business per commercial practice."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The said debt which had become irrecoverable was a trading loss deductible in computing the profit of the appellant-company in the assessment year. It was a loss incidental to the appellants business and is certainly sanctioned by commercial practice and trading principles.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "The High Court went wrong in holding that the said amount represented loss incurred by the appellant dehors its business.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Badridas Daga v. Commissioner of Income-tax",
      "citation": "1959 S.C.R. 690",
      "treatment": "followed",
      "relevance": "Laid down test for deductibility of trading loss: arises out of business and incidental per commercial practice."
    },
    {
      "case_name": "Commissioner of Income-tax, U.P. v. Ms. Nainital Bank Ltd.",
      "citation": "1965 1 S.C.R. 340",
      "treatment": "followed",
      "relevance": "Loss by dacoity incidental to banking business."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indore Industrial Tax Rules, 1927",
      "sections": [
        "S. 3"
      ],
      "relevance": "Loss claimed deductible in computing profits under this provision."
    },
    {
      "name": "Indore Companies Act, 1914",
      "sections": [],
      "relevance": "Company incorporated under this Act; memorandum authorized borrowing and investing in loans."
    },
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "S. 10"
      ],
      "relevance": "Test for deduction compared; assumed no difference for trading losses with Indore Rules."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed. The High Court's order disallowing the deduction of the loss as trading loss is set aside.",
    "relief_granted": "Deduction of the loss allowed as trading loss in computing profits.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The result is that when a claim is made for a deduction for which there is no specific provision in S. 10, whether it is admissible or not will depend on whether, having regard to accepted commercial practice and trading principles, it can be said to arise out of the carrying on of the business and to be incidental to it.\"",
      "speaker": "court",
      "significance": "Core test for trading loss deductibility from Badridas Daga."
    },
    {
      "text": "If embezzlement of moneys entrusted to an agent is incidental to a business, by the same token moneys legally utilized by the agent must more appropriately be incidental to the business.",
      "speaker": "court",
      "significance": "Distinguishes present case favorably from misappropriation."
    },
    {
      "text": "We, therefore, find no difficulty in holding that the said debt which had become irrecoverable was a trading loss deductible in computing the profit of the appellant-company.",
      "speaker": "court",
      "significance": "Direct holding on deductibility."
    }
  ],
  "_case_id": "1964_142",
  "_label": 1,
  "_text_length": 11488,
  "_extracted_at": "2026-02-10T19:44:07.380378"
}