{
  "metadata": {
    "case_name": "Appellant v. State",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": "Criminal Appeal No. 49 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is being prosecuted under s. 420, Indian Penal Code and under s. 7 of the Essential Commodities Act, 1955 for contravention of cls. 4 and 5 of the Iron and Steel Control Order.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Prosecution commenced by the Inspector of Police, Crime Branch, C.I.D., Hyderabad by filing a charge-sheet under s. 173 of the Code of Criminal Procedure in respect of the offence of cheating which was intended to serve also as a report in writing of a public servant as required by s. 11 of the Essential Commodities Act, 1955.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Learned City Magistrate of Secunderabad framed a charge against the appellant under s. 251A(3) of the Code of Criminal Procedure in respect of both the offences.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Appellant raised preliminary objection that as the commodity was obtained and disposed of at Bombay, the Court at Secunderabad had no jurisdiction to try him. This objection not raised before Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Appellant raised second preliminary objection that as the police had filed a report under s. 11 of the Essential Commodities Act, trial of offence under s. 7 could not be under s. 251A but under s. 252 of the Code of Criminal Procedure, and asked that the charge be quashed.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Magistrate rejected the second objection.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellant moved Sessions Judge in revision, who declined to interfere.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Appellant filed second revision in High Court of Andhra Pradesh, dismissed by order dated September 3, 1963 in Criminal Revision Case No. 132 of 1963 and Cr. R. Petition No. 118 of 1963.",
      "type": "procedural",
      "date": "1963-09-03",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Commodity obtained and disposed of at Bombay.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Police officer investigated under s. 156(1) CrPC an offence under s. 420 IPC based on same facts as offence under s. 7 ECA, investigated latter along with former and joined in charge-sheet.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the trial of the offence under s. 7 of the Essential Commodities Act should be under s. 251A or s. 252 of the CrPC, given the police report under s. 11 ECA serving also as charge-sheet under s. 173 CrPC.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the report under s. 11 ECA by a police officer qualifies as a 'police report' under s. 251A CrPC or only as a complaint under s. 190(1)(a) CrPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "By the words 'police report' in s. 251A CrPC is meant the report under s. 173 CrPC for cognizable offences; report under s. 11 ECA is not a charge-sheet under s. 173, so equates to complaint under s. 190(1)(a), requiring s. 252 procedure for s. 7 ECA offence.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "s. 251A, 252, 173, 190 CrPC; s. 11 ECA"
    },
    {
      "id": "pa2",
      "text": "Procedure under s. 251A does not afford accused chance of second cross-examination as in s. 252, causing prejudice for s. 7 ECA trial; charges should be split or both tried under s. 252.",
      "supporting_facts": [
        "f3",
        "f5"
      ],
      "legal_basis": "s. 251A, 252, 253 CrPC"
    },
    {
      "id": "pa3",
      "text": "Prosecution under s. 251A can only commence on report under s. 173 CrPC; report under s. 11 not a charge-sheet.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "Premchand Khetry v. The State"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The report satisfies s. 11 ECA as made by public servant (police officer); procedure under s. 251A applies as it is a police report.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "s. 11 ECA; s. 21 IPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Meaning sought by appellant for 'police report' is incorrect; distinction in s. 190 is between classes starting prosecution; report by police officer falls under s. 190(1)(b), attracting s. 251A.",
      "addresses_issue": "i2",
      "key_observation": "'Police report' includes any report in writing by police officer under s. 190(1)(b), not limited to s. 173 charge-sheet."
    },
    {
      "id": "cr2",
      "text": "Report under s. 11 ECA by police officer is not a 'complaint' as defined in s. 4(1)(h) CrPC, which excludes police reports; thus s. 252 does not apply.",
      "addresses_issue": "i1",
      "key_observation": "s. 252 applies only to cases instituted otherwise than on police report."
    },
    {
      "id": "cr3",
      "text": "Police investigated s. 420 IPC (cognizable) under s. 156(1) and joined s. 7 ECA offence based on same facts; competent under s. 156(2) even if non-cognizable.",
      "addresses_issue": "i1",
      "key_observation": "Police can investigate and include non-cognizable offence with cognizable one from same facts."
    },
    {
      "id": "cr4",
      "text": "In Bhagwati Saran, s. 11 report eliminates private complaints, requires public servant; police officer qualifies.",
      "addresses_issue": "i2",
      "key_observation": "s. 11 purpose not to make it charge-sheet but to restrict initiation to public servant."
    },
    {
      "id": "cr5",
      "text": "Premchand Khetry distinguished; where law requires public servant report, it satisfies as police report for s. 251A if by police officer.",
      "addresses_issue": "i1",
      "key_observation": "Fiction in such provisions makes report equivalent for s. 190(1)(b) and thus s. 251A."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Trial of offence under s. 7 ECA can proceed under s. 251A CrPC when initiated by police report under s. 11 ECA that also serves as s. 173 charge-sheet for cognate IPC offence.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Police report under s. 190(1)(b) includes reports by police officers beyond just s. 173 charge-sheets; s. 11 ECA report by police qualifies.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bhagwati Saran v. State of U.P.",
      "citation": "(1961) 3 SCR 563",
      "treatment": "followed",
      "relevance": "Explained nature of report under s. 11 of Essential Supplies Act (similar to ECA); eliminates private prosecutions, requires public servant."
    },
    {
      "case_name": "Ram Krishna Dalmia v. State",
      "citation": "A.T.R. 1958 Punj. 172",
      "treatment": "followed",
      "relevance": "Police can investigate and include non-cognizable offence with cognizable one from same facts."
    },
    {
      "case_name": "Premchand Khetry v. The State",
      "citation": "A.I.R. 1958 Cal. 213",
      "treatment": "distinguished",
      "relevance": "Held 'police report' confined to s. 173 charge-sheet, but distinguished as here report by police officer satisfies for s. 251A."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "s. 420",
        "s. 21"
      ],
      "relevance": "Offence of cheating; definition of public servant."
    },
    {
      "name": "Essential Commodities Act, 1955",
      "sections": [
        "s. 7",
        "s. 11"
      ],
      "relevance": "Offence for contravention of Control Order; cognizance only on public servant's written report."
    },
    {
      "name": "Iron and Steel Control Order",
      "sections": [
        "cls. 4",
        "cls. 5"
      ],
      "relevance": "Contravention forming basis of s. 7 ECA offence."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "s. 173",
        "s. 251A",
        "s. 252",
        "s. 253",
        "s. 190",
        "s. 156",
        "s. 155",
        "s. 4(1)(h)"
      ],
      "relevance": "Police report and trial procedures; investigation powers; definition of complaint."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, upholding the High Court's refusal to interfere in revision. The trial under s. 251A CrPC for both offences was held proper, as the police report qualified under that procedure.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "In our judgment the meaning which is sought to be given to a police report is not correct.",
      "speaker": "court",
      "significance": "Rejects appellant's narrow interpretation of 'police report'."
    },
    {
      "text": "The term complaint in this connection has been defined by the Code of Criminal Procedure and it means the allegation made orally or in writing to a Magistrate... but it does not include the report of a police officer.",
      "speaker": "court",
      "significance": "Clarifies why s. 11 report is not a complaint under s. 252."
    },
    {
      "text": "We dismiss the appeal. The appellant has succeeded in delaying this trial for a considerable time.",
      "speaker": "court",
      "significance": "Final disposition noting delay caused by appellant."
    }
  ],
  "_case_id": "1964_130",
  "_label": 0,
  "_text_length": 15037,
  "_extracted_at": "2026-02-10T19:44:08.793337"
}