{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. Anant Rao B. Kamat",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "SIKRI, J."
    ],
    "case_number": "Civil Appeal Nos. 687-688 of 1963",
    "date_of_judgment": "1964-05-08"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee received dividends in the previous years 1950-51 and 1951-52 from Associated Stone Industries Kotah Ltd. and Rajputana Mining Agencies Ltd.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For assessment years 1951-52 and 1952-53, the assessee claimed before the Income Tax Officer that the dividends should be grossed up under s.16(2) of the Act without taking into consideration the rebate allowed to the companies under the Part B States Taxation Concessions Order, 1950.",
      "type": "procedural",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f3",
      "text": "The Income Tax Officer disallowed grossing up at the Indian rate but allowed it at the State rate defined by paragraph 3(v) of the Concession Order.",
      "type": "procedural",
      "date": null,
      "source": "income_tax_officer"
    },
    {
      "id": "f4",
      "text": "The Appellate Assistant Commissioner upheld the order of the Income Tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "appellate_assistant_commissioner"
    },
    {
      "id": "f5",
      "text": "The assessee succeeded before the Income Tax Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f6",
      "text": "On application of the Commissioner of Income Tax, the Tribunal referred the question to the Rajasthan High Court under s.66(1) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f7",
      "text": "The Rajasthan High Court, after asking for a supplementary statement, answered the question in the affirmative in favour of the assessee on February 3, 1962.",
      "type": "procedural",
      "date": "1962-02-03",
      "source": "high_court"
    },
    {
      "id": "f8",
      "text": "The High Court granted certificate under s.66A(2) of the Act, leading to these appeals.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appropriate portion of dividend received by the assessee from the said two companies in the financial year 1950-51/1951-52 is to be increased at the rate applicable to the total income of the respective companies for the financial year 1950-51/1951-52 and without regard to and benefit conferred by the T.C.O. Order 1950 that the companies would get in the matter of payment of tax by them on their profits accruing or arising to them in a Part B State and assessable for the assessment year 1950-51/1951-52?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The rate applicable to total income of the companies was the rate as finally applied after taking into consideration the effect of the Concession Order.",
      "supporting_facts": [],
      "legal_basis": "Concession Order"
    },
    {
      "id": "pa2",
      "text": "The word 'rebate' occurring in s.16(2) does not include the relief given under the Concession Order as it is concerned with determination of tax payable, not granting rebate.",
      "supporting_facts": [],
      "legal_basis": "s.60A of the Act; Rajputana Agencies Ltd. v. Commissioner of Income Tax"
    },
    {
      "id": "pa3",
      "text": "S.60A enables exemption, reduction in rate or other modification but not grant of rebate.",
      "supporting_facts": [],
      "legal_basis": "s.60A of the Act"
    },
    {
      "id": "pa4",
      "text": "The word 'rebate' in s.16(2) only relates to rebate granted under the Indian Finance Act, not under Concession Order.",
      "supporting_facts": [],
      "legal_basis": "r.14 of Indian Income Tax Rules"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Supported the judgment of the High Court, controverting the appellant's arguments.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The scheme of s.16(2) and s.18(5): dividends grossed up under s.16(2), increase treated as payment of tax on behalf of shareholder under s.18(5). Grossing up at rate applicable to company's total income without taking into account any rebate allowed.",
      "addresses_issue": "i1",
      "key_observation": "Words 'without taking into account any rebate allowed' in s.16(2) must be given effect; rate is that of year dividend paid, mechanical test."
    },
    {
      "id": "cr2",
      "text": "Distinguished Rajputana Agencies Ltd. v. CIT as that lacked the words 'without taking into account any rebate allowed'.",
      "addresses_issue": "i1",
      "key_observation": "Effect must be given to specific words in s.16(2)."
    },
    {
      "id": "cr3",
      "text": "Benefit under Concession Order is a rebate; Order uses word 'rebate' in paras 5,6,6A; para 6A expressly allows rebate.",
      "addresses_issue": "i1",
      "key_observation": "Concession Order remits tax otherwise leviable; s.60A wide enough for rebate."
    },
    {
      "id": "cr4",
      "text": "'Rebate' in s.16(2) not limited to Finance Act rebates; wide enough for statutory orders like Concession Order. Rule 14 certificate form does not change meaning.",
      "addresses_issue": "i1",
      "key_observation": "Word 'rebate' unqualified."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Grossing up under s.16(2) at rate applicable to company's total income without taking into account rebate under Concession Order; answer to question in affirmative.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rajputana Agencies Ltd. v. Commissioner of Income Tax",
      "citation": "1959 Supp. 1 S.C.R. 142",
      "treatment": "distinguished",
      "relevance": "Expression 'rate applicable to total income' interpreted differently due to absence of 'without taking into account any rebate' phrase."
    },
    {
      "case_name": "M s. Maganlal Sankalchand v. The Commissioner of Income Tax, New Delhi",
      "citation": "Civil Appeal No. 703 of 1963",
      "treatment": "referred",
      "relevance": "Connected appeal where additional arguments raised during hearing."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act, 1922",
      "sections": [
        "s.16(2)",
        "s.18(5)",
        "s.60A",
        "s.66(1)",
        "s.66A(2)"
      ],
      "relevance": "Governing grossing up of dividends, treatment as tax payment, power for concessions, references."
    },
    {
      "name": "Part B States Taxation Concessions Order, 1950",
      "sections": [
        "Para 3(iii)",
        "Para 3(v)",
        "Para 6",
        "Para 6A"
      ],
      "relevance": "Defined Indian and State rates; provided for computation of tax with rebates for Part B States income."
    },
    {
      "name": "Indian Finance Act",
      "sections": [],
      "relevance": "Prescribed rates for total income."
    },
    {
      "name": "Indian Income Tax Rules",
      "sections": [
        "r.14"
      ],
      "relevance": "Certificate by company officer mentioning rates."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals by the Commissioner of Income Tax fail; question answered in affirmative in favour of assessee; appeals dismissed with costs.",
    "relief_granted": "None to appellant; confirmation of High Court judgment for assessee.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"the words without taking into account any rebate allowed or additional income-tax charged occur in s. 16(2) and not in the said sub-clause, and effect must be given to these words.\"",
      "speaker": "court",
      "significance": "Key to distinguishing precedent and interpreting s.16(2)."
    },
    {
      "text": "\"The word rebate is an apt word to use in respect of a remission.\"",
      "speaker": "court",
      "significance": "Holds Concession Order benefit as rebate under s.16(2)."
    },
    {
      "text": "\"the rate applicable is the rate which is actually applied, rebate if any allowed to a company, has not to be, as directed by s. 16(2), taken into account.\"",
      "speaker": "court",
      "significance": "Core holding on grossing up rate."
    }
  ],
  "_case_id": "1964_226",
  "_label": 0,
  "_text_length": 15492,
  "_extracted_at": "2026-02-10T19:45:33.344923"
}