{
  "metadata": {
    "case_name": "Appellants (Manufacturers of Medicines) v. State of Andhra Pradesh",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellants manufacture medicines in which they have to use alcohol.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Before Parliament passed the Medicinal and Toilet Preparations Excise Duties Act, No. 16 of 1955 (the Act), the appellants were working under licences granted under the Hyderabad Abkari Act, No. 1 of 1316-F.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Under the Hyderabad Abkari Act, certain rules called the Medical Preparations and Spirituous Rules, 1345-F were framed and r. 36 thereof provided that the expenses of the establishment for the supervision of the work shall be borne by the pharmaceutical laboratory licensee as per the decision of the Commissioner Excise.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "For the manufacture of medicines, the appellants used to be supplied with alcohol. The State Government posted on the bonded manufacturies of the appellants certain supervisory excise staff.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "After the Act came into force from April 1, 1957, the appellants who were manufacturing medicinal preparations were governed by it and the Rules framed thereunder and took licences under the Act.",
      "type": "procedural",
      "date": "1957-04-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellants contended that as the Act had repealed all previous provisions with respect to medicinal preparations, they were no longer bound to pay the charges prescribed under r. 36 of 1345-F Rules.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The appellants filed writ petitions in the High Court of Andhra Pradesh challenging the levy of these charges.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The State contended that r. 36 of the 1345-F Rules continued and was not repealed by the Act and the Rules framed thereunder.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The High Court held that r. 36 could not be said to have been repealed by the Act and the Rules framed thereunder and was still good law. The writ petitions were dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The appellants applied for certificates to appeal to this Court, which were granted.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Rules were framed under the Act in 1956 and came into force along with the Act. Rule 143 of these Rules provides that all rules made under any law corresponding to the Act in force in any State are hereby repealed except as respects things done or omitted to be done before such repeal.",
      "type": "background",
      "date": "1956",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether after the coming into force of the Act and the Rules, r. 36 of the 1345-F Rules can still be said to survive.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Act had repealed all previous provisions with respect to medicinal preparations, including r. 36 of 1345-F Rules along with such provisions of the Hyderabad Abkari Act which concerned medicinal preparations. The State Government could therefore no longer ask them to pay the costs of the establishment posted at their bonded manufacturies for supervision.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5",
        "f6"
      ],
      "legal_basis": "Medicinal and Toilet Preparations Excise Duties Act, 1955"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Even though the Act and the Rules framed thereunder had come into force from April 1, 1957, r. 36 of the 1345-F Rules continued and was not repealed by the Act and the Rules framed thereunder, and the State was entitled to the expenses of the supervisory staff.",
      "supporting_facts": [
        "f3",
        "f4",
        "f8"
      ],
      "legal_basis": "Hyderabad Abkari Act, No. 1 of 1316-F; r. 36 of Medical Preparations and Spirituous Rules, 1345-F; proviso to s. 21 of the Act"
    },
    {
      "id": "ra2",
      "text": "r. 36 remains good because it is meant to carry out the general purpose of the Hyderabad Abkari Act, namely to see that unauthorised sale of alcohol is not made for human consumption by the laboratory to which it is supplied for purposes of manufacture of medicinal preparations.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Hyderabad Abkari Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Medicinal and toilet preparations came under entry 84, List I of the Seventh Schedule to the Constitution. No charge could thereafter be levied on the manufacture of medicinal preparations except by the Union. Under Art. 277, pre-Constitution levies continued until Parliament made law otherwise, which the Act did from April 1, 1957.",
      "addresses_issue": "i1",
      "key_observation": "The Act is a law made otherwise by Parliament within the meaning of Art. 277."
    },
    {
      "id": "cr2",
      "text": "s. 21 of the Act provides that if, immediately before the commencement of this Act, there is in force in any State any law corresponding to this Act, that law is hereby repealed. The Hyderabad Abkari Act must be deemed to have been repealed to that extent only as it applied to the use of alcohol in the manufacture of medicinal and toilet preparations.",
      "addresses_issue": "i1",
      "key_observation": "s. 21 repeals corresponding laws."
    },
    {
      "id": "cr3",
      "text": "The proviso to s. 21 does not save r. 36 because Rule 143 of the 1956 Rules repeals all rules made under any law corresponding to the Act.",
      "addresses_issue": "i1",
      "key_observation": "r. 143 of 1956 Rules repeals old rules like r. 36."
    },
    {
      "id": "cr4",
      "text": "r. 36 is concerned with supervision of manufacture of medicinal preparations, a field completely covered by the 1956 Rules (e.g., rr. 20, 42, 141, 45), which provide for supervisory staff without charging expenses to licensees.",
      "addresses_issue": "i1",
      "key_observation": "Purpose of r. 36 covered by new Rules; no provision in Act or Rules for such charge."
    },
    {
      "id": "cr5",
      "text": "The supervisory staff's incidental role in preventing misuse of alcohol does not make r. 36 good under the general Hyderabad Abkari Act, as its main object is supervision of medicinal manufacture.",
      "addresses_issue": "i1",
      "key_observation": "Field covered by new regime."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "r. 36 of 1345-F Rules must be held to have been repealed after the coming into force of the Act and the Rules framed thereunder.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Medicinal and Toilet Preparations (Excise Duties) Act, 1955",
      "sections": [
        "s. 21",
        "Rule 143",
        "Rule 20",
        "Rule 42",
        "Rule 141",
        "Rule 45"
      ],
      "relevance": "Repeals previous laws and rules corresponding to it; provides for supervision without charging expenses to licensees."
    },
    {
      "name": "Hyderabad Abkari Act, No. 1 of 1316-F",
      "sections": [
        "Medical Preparations and Spirituous Rules, 1345-F, r. 36"
      ],
      "relevance": "General excise law; r. 36 held repealed insofar as it applies to medicinal preparations."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 277",
        "Entry 84, List I, Seventh Schedule"
      ],
      "relevance": "Union control over medicinal preparations containing alcohol; pre-Constitution levies continue until Parliament provides otherwise."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeals are allowed, the orders of the High Court are set aside, and writs are directed to be issued as prayed for.",
    "relief_granted": "Writs issued declaring r. 36 inapplicable; no levy of supervision charges.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Rule 143 of these Rules provides that all rules made under any law corresponding to the Act in force in any State are hereby repealed except as respects things done or omitted to be done before such repeal.",
      "speaker": "court",
      "significance": "Key to repeal of old rules including r. 36."
    },
    {
      "text": "We are therefore of opinion that reading s. 21 of the Act and r. 143 of the Rules framed thereunder, r. 36 of 1345-F Rules must be held to have been repealed and that it is not saved by the proviso to s. 21.",
      "speaker": "court",
      "significance": "Core holding on repeal."
    }
  ],
  "_case_id": "1964_26",
  "_label": 1,
  "_text_length": 14318,
  "_extracted_at": "2026-02-10T19:42:10.714614"
}