{
  "metadata": {
    "case_name": "Bhopal Sugar Industries Ltd. v. State of Madhya Pradesh",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 491 of 1963",
    "date_of_judgment": "1964-02-19"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Bhopal Sugar Industries Ltd. (the Company) was incorporated under the Companies Act of the former Indian State of Bhopal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1953 the State of Bhopal enacted The Bhopal State Agricultural Income-tax Act, IX of 1953 providing for imposition and levy of tax on agricultural income. The Act was applied to the territory of the entire State of Bhopal and was brought into force on July 15, 1953.",
      "type": "material",
      "date": "1953-07-15",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "By the States Reorganisation Act, 1956, territory of the Part C State of Bhopal was incorporated with effect from November 1, 1956, into the newly formed State of Madhya Pradesh.",
      "type": "material",
      "date": "1956-11-01",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Section 119 of the States Reorganisation Act, 1956, provided that no change in the laws in force immediately before November 1, 1956, was effected, and territorial references be construed as meaning the territories within that State immediately before November 1, 1956.",
      "type": "material",
      "date": "1956-11-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "By the Madhya Pradesh Adaptation of Laws (State and Concurrent Subjects) Order, 1956, the Bhopal Act IX of 1953 continued to remain applicable in the territory of the former Bhopal State in the new State of Madhya Pradesh.",
      "type": "material",
      "date": "1956",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The Legislature of Madhya Pradesh enacted the Madhya Pradesh Extension of Laws Act, 1958, extending several Acts to the entire territory, but no alteration was made in the territorial operation of Bhopal Act IX of 1953.",
      "type": "material",
      "date": "1958",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "It is common ground that in the remaining territory of the State of Madhya Pradesh there was no law providing for levy of tax on agricultural income.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Company paid and continued to pay tax assessed under the Bhopal State Agricultural Income-tax Act, 1953, till some time in 1960.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On August 4, 1960, the Company presented a petition under Art. 226 of the Constitution in the High Court of Madhya Pradesh at Jabalpur (Misc. Petition No. 226 of 1960) for a writ declaring that Bhopal Act IX of 1953 was unconstitutional and void as being discriminatory and restraining the State from giving effect to the Act.",
      "type": "procedural",
      "date": "1960-08-04",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "The High Court upheld the plea of the Company and issued a writ restraining the State of Madhya Pradesh from enforcing the provisions of Bhopal Act IX of 1953, observing that the Act was in clear contravention of the petitioner's right under Art. 14.",
      "type": "procedural",
      "date": "1961-01-17",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appeal filed in Supreme Court from the judgment and order dated January 17, 1961 of the Madhya Pradesh High Court.",
      "type": "procedural",
      "date": "1961-01-17",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Bhopal State Agricultural Income-tax Act, 1953 violates Article 14 of the Constitution as it levies agricultural income-tax only in the territory of former Bhopal State and not in the rest of Madhya Pradesh, amounting to discriminatory treatment.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the continuance of the Bhopal Act post States Reorganisation Act, 1956, under Section 119 and MP Adaptation Order, remains valid under Article 14 or has become discriminatory due to passage of time without uniform application.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Bhopal Act IX of 1953 deprived residents of Bhopal territory of protection of Art. 14 as it imposed tax on agricultural income only in Bhopal region, not in rest of Madhya Pradesh, without reasonable basis for classification.",
      "supporting_facts": [
        "f7",
        "f9"
      ],
      "legal_basis": "Article 14 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "After incorporation into Madhya Pradesh, the State ought to have modified the Act to apply uniformly, and failure to do so violated Art. 14.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6"
      ],
      "legal_basis": "Article 14 of the Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Defended on basis that historical reasons justified differential treatment post-reorganisation, and if not discriminatory at reorganisation, it cannot become so later.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "Section 119 of States Reorganisation Act, 1956; precedents on historical classification"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Authority of Bhopal to enact the Act originally not disputed; Section 119 and Adaptation Order competent. Plea of Art. 14 infringement solely on ground of levy only in Bhopal region post-reorganisation.",
      "addresses_issue": "i1",
      "key_observation": "Prima facie differential treatment exists but not necessarily invalid if reasonable classification."
    },
    {
      "id": "cr2",
      "text": "Art. 14 permits classification with reasonable relation to object; geographical classification for historical reasons upheld in precedents.",
      "addresses_issue": "i1",
      "key_observation": "Post-reorganisation, continuance of regional laws under s.119 valid temporarily for necessity and expediency."
    },
    {
      "id": "cr3",
      "text": "Temporary provisions justified initially but cannot be permanent without rational basis; needs enquiry into whether grounds persist.",
      "addresses_issue": "i2",
      "key_observation": "No definite time-limit; full enquiry into tax burden patterns required."
    },
    {
      "id": "cr4",
      "text": "High Court erred in declaring void without investigating overall tax burden on agricultural land/income across regions to check if discrimination exists.",
      "addresses_issue": "i2",
      "key_observation": "Petition deficient in particulars; State failed to file affidavit or evidence."
    },
    {
      "id": "cr5",
      "text": "To establish Art.14 violation, must show differential treatment of similarly circumstanced persons without reasonable basis.",
      "addresses_issue": "i1",
      "key_observation": "Mere existence of unequal laws insufficient."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Initial geographical classification post-reorganisation valid under Art.14 for historical reasons; continuance requires enquiry into rational basis and overall tax incidence.",
      "resolves_issue": "i1",
      "in_favor_of": "partial"
    },
    {
      "id": "h2",
      "text": "High Court must investigate structure of tax burden on agricultural land/income across regions before concluding discrimination.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bhaiyalal Shukla v. State of Madhya Pradesh",
      "citation": "1962 Suppl. 2 S.C.R. 257",
      "treatment": "followed",
      "relevance": "Geographical classification for historical reasons upheld."
    },
    {
      "case_name": "State of Madhya Pradesh v. Gwalior Sugar Co. Ltd.",
      "citation": "1962 2 S.C.R. 619",
      "treatment": "followed",
      "relevance": "Historical reasons justify unequal laws; observations on taxation clarified."
    },
    {
      "case_name": "Maharaj Kumar Prithvi Rai v. State of Rajasthan",
      "citation": "AIR 1963 S.C. 853",
      "treatment": "followed",
      "relevance": "Geographical classification for historical reasons upheld."
    },
    {
      "case_name": "Anand Prasad Lakshminiwas Ganeriwal v. State of Andhra Pradesh",
      "citation": null,
      "treatment": "followed",
      "relevance": "Geographical classification for historical reasons upheld."
    },
    {
      "case_name": "State of Rajasthan v. Rao Manohar Singhji",
      "citation": "1954 S.C.R. 996",
      "treatment": "distinguished",
      "relevance": "Historical reasons may justify but differentiation must have rational basis; not contrary to others."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bhopal State Agricultural Income-tax Act, 1953",
      "sections": [
        "IX of 1953"
      ],
      "relevance": "Law continued in Bhopal region post-reorganisation; challenged as discriminatory under Art.14."
    },
    {
      "name": "States Reorganisation Act, 1956",
      "sections": [
        "Section 119"
      ],
      "relevance": "Continued pre-existing laws in reorganized states temporarily."
    },
    {
      "name": "Madhya Pradesh Adaptation of Laws (State and Concurrent Subjects) Order, 1956",
      "sections": [],
      "relevance": "Continued Bhopal Act in MP."
    },
    {
      "name": "Madhya Pradesh Extension of Laws Act, 1958",
      "sections": [],
      "relevance": "Extended other laws uniformly but not Bhopal Act."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 14",
        "Article 226"
      ],
      "relevance": "Art.14 equal protection; Art.226 writ petition."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Appeal allowed, High Court order set aside, case remanded for retrial with opportunity to amend pleadings, file affidavits, lead evidence on tax burden and Art.14 violation.",
    "relief_granted": "Remand to High Court for fresh adjudication after pleadings and evidence.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Differential treatment becomes unlawful only when it is arbitrary or not supported by a rational relation with the object of the statute.",
      "speaker": "court",
      "significance": "Core test for Art.14 classification."
    },
    {
      "text": "A purely temporary provision which because of compelling forces justified differential treatment when the Reorganisation Act was enacted cannot obviously be permitted to assume permanency.",
      "speaker": "court",
      "significance": "Limits on continuance of regional laws post-reorganisation."
    },
    {
      "text": "To make out a case of denial of the equal protection of the laws under Art. 14 of the Constitution, a plea of differential treatment is by itself not sufficient.",
      "speaker": "court",
      "significance": "Burden on petitioner to prove lack of reasonable basis."
    }
  ],
  "_case_id": "1964_6",
  "_label": 1,
  "_text_length": 21669,
  "_extracted_at": "2026-02-10T19:42:13.611219"
}