{
  "metadata": {
    "case_name": "Commissioner of Sales Tax, U.P. v. Bijli Cotton Mills",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J"
    ],
    "case_number": "Civil Appeal No. 546 of 1962",
    "date_of_judgment": "1964-03-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Bijli Cotton Mills is a manufacturer of cotton yarn and is registered as a dealer under the U.P. Sales Tax Act 15 of 1948.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "U.P. Sales Tax Act 15 of 1948 came into force on April 1, 1948, with sales-tax payable on sales including cotton yarn at a uniform rate of three pies in a rupee.",
      "type": "background",
      "date": "1948-04-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "By Act 25 of 1948, s. 3-A was incorporated conferring power on Provincial Government to declare by notification single point taxation.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Under s. 7 as amended by Act 25 of 1948, dealer had option to submit return on turnover of previous year or current year.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondent opted to be assessed on basis of turnover of previous year ending March 31, 1948 for assessment year 1948-49.",
      "type": "admitted",
      "date": "1948-03-31",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Government of U.P. issued notification under s. 3-A declaring that from June 9, 1948, proceeds of sale of cotton yarn shall be included in turnover only at single point (sale by importer or manufacturer), at rate of six pies per rupee.",
      "type": "material",
      "date": "1948-06-09",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Sales-tax Officer, Hathras assessed respondent for 1948-49: three pies per rupee for first 69 days, six pies for remaining part, notwithstanding option under s.7.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Judge (Appeals) Sales Tax, Meerut modified to uniform rate of three pies per rupee.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Judge (Revisions) Sales Tax, U.P. reversed appellate order, restored STO order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Judge (Revisions) referred question to Allahabad High Court: Whether assessee electing previous year liable to pay tax in assessment year 1948-49 according to rates prevailing during the year.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Allahabad High Court answered question negatively, following Modi Food Products Ltd. v. Commissioner of Sales Tax, U.P., holding all sales in previous year taxed at flat 3 pies per rupee.",
      "type": "procedural",
      "date": "1958-12-17",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Special leave granted, Commissioner appealed to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Allahabad High Court judgment in Modi Food Products confirmed by Supreme Court in Commissioner of Sales Tax, U.P. v. Modi Sugar Mills Ltd.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "U.P. Legislature enacted Act III of 1963 adding s.31 retrospectively from April 1, 1948, providing that opted assessee liable at rates prevalent in assessment year, proportionately if altered; validates prior assessments notwithstanding judgments.",
      "type": "material",
      "date": "1948-04-01",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether assessee who elected previous year turnover under s.7 is liable to pay tax for assessment year 1948-49 at rates prevalent during that year proportionately.",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Whether Supreme Court in reference appeal must apply law as at reference date or retrospectively amended law.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Assessee opting previous year liable at rates prevalent during assessment year 1948-49 proportionately.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": "U.P. Sales Tax Act s.3-A notification; s.7"
    },
    {
      "id": "pa2",
      "text": "Court must apply retrospectively amended law including validating Act III of 1963 s.31.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Act III of 1963 s.31"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Rates crystalised at flat 3 pies on first day of assessment year; subsequent changes inapplicable.",
      "supporting_facts": [
        "f5",
        "f2"
      ],
      "legal_basis": "Modi Sugar Mills Ltd.; s.7"
    },
    {
      "id": "ra2",
      "text": "Court bound by law at reference date, cannot consider subsequent amendment.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Chatturam Horilram Ltd.; advisory jurisdiction in reference"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Previous view in Modi Sugar Mills that rates as on first day of assessment year apply is modified by retrospective validating legislation Act III of 1963 s.31 deeming altered rates in force proportionately in previous year.",
      "addresses_issue": "i1",
      "key_observation": "Turnover of previous year treated as fictional turnover of assessment year, taxed at rates prevalent therein."
    },
    {
      "id": "cr2",
      "text": "In reference appeals, court applies retrospectively amended law if it covers transaction; not bound to law at reference date if amendment retroactive.",
      "addresses_issue": "i2",
      "key_observation": "Duty to apply legislative intent via retroactive provision without needing fresh facts."
    },
    {
      "id": "cr3",
      "text": "Distinguishes precedents like Chatturam and Rampur Distillery as not prohibiting application of retroactive law to referred question.",
      "addresses_issue": "i2",
      "key_observation": "High Court/Tribunal applies law applicable to transaction, including subsequent retroactive amendments."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Assessee opting previous year liable to tax at rates prevalent during assessment year proportionately as per s.31 Act III of 1963.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Court in sales tax reference appeal applies retrospectively amended law to question referred.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Modi Food Products Ltd. v. Commissioner of Sales Tax, U.P.",
      "citation": "A.I.R. 1956 All. 35",
      "treatment": "followed",
      "relevance": "Allahabad HC decision followed by respondent's HC, taxing at flat rate."
    },
    {
      "case_name": "Commissioner of Sales Tax, U.P. v. Modi Sugar Mills Ltd.",
      "citation": "1961 2 S.C.R. 189",
      "treatment": "followed",
      "relevance": "SC confirmed assessee's contention of rate on first day of assessment year; now modified by legislation."
    },
    {
      "case_name": "Messrs Chatturam Horilram Ltd. v. Commissioner of Income-tax, Bihar and Orissa",
      "citation": "1955 2 S.C.R. 290",
      "treatment": "distinguished",
      "relevance": "Doubt on taking notice of subsequent legislation for different question; does not bar retroactive law application."
    },
    {
      "case_name": "M/s Rampur Distillery Chemical Works Ltd. v. Commissioner of Income-tax",
      "citation": "I.T. Reference No. 362 of 1958 decided on Jan. 17, 1964",
      "treatment": "distinguished",
      "relevance": "Amendment lacked retrospective effect; observation on discovering past law today does not apply to retroactive amendments."
    }
  ],
  "statutes_cited": [
    {
      "name": "U.P. Sales Tax Act 15 of 1948",
      "sections": [
        "s. 3-A",
        "s. 7"
      ],
      "relevance": "Basis for uniform tax, single point notification, option for previous year turnover."
    },
    {
      "name": "U.P. Act 25 of 1948",
      "sections": [
        "s. 3-A",
        "s. 7"
      ],
      "relevance": "Amended Act 15 of 1948 adding single point power and option provision."
    },
    {
      "name": "U.P. Act XIX of 1956",
      "sections": [
        "s. 2",
        "s. 7"
      ],
      "relevance": "Amended definitions and s.7; referenced in validating act."
    },
    {
      "name": "U.P. Bikri Kar Sanshodhan Adhiniyam, 1962 (Act III of 1963)",
      "sections": [
        "s. 7 (new s.31)"
      ],
      "relevance": "Validates assessments retrospectively from 1948-04-01; mandates proportionate rates in assessment year for opted previous year turnover."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; question referred by Judge (Revisions) Sales Tax answered in affirmative: assessee liable at rates prevalent during 1948-49 proportionately per retrospective s.31.",
    "relief_granted": "Order of Allahabad High Court set aside; STO/Revisions order upheld via validating act.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Where any dealer has... opted to be assessed to tax on the basis of his turnover of the previous year, he shall be assessed to tax at such rates as are prevalent during the year for which the assessment is being made...\"",
      "speaker": "court",
      "significance": "Verbatim from new s.31, core of retrospective validation."
    },
    {
      "text": "\"This Court in giving its opinion on the question in the light of the amending Act is seeking to apply a legislative provision which was, by express enactment, in force at the time when the liability arose.\"",
      "speaker": "court",
      "significance": "Justifies application of retroactive law in reference appeal."
    },
    {
      "text": "\"The High Courts jurisdiction was only to answer the particular question that was referred to it... and it is extremely doubtful whether they could have taken notice of a subsequent legislation and answered a different question.\"",
      "speaker": "court",
      "significance": "Quote from Chatturam distinguished; clarifies no bar to retroactive law."
    }
  ],
  "_case_id": "1964_106",
  "_label": 1,
  "_text_length": 17610,
  "_extracted_at": "2026-02-10T19:44:06.865265"
}