{
  "metadata": {
    "case_name": "Municipal Corporation of Greater Bombay & Ors. v. Tenants of Dhobi Chawls",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar J."
    ],
    "case_number": "Civil Appeal No. 134 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plaintiffs are some of the tenants occupying different rooms in a group of buildings known as Dhobi Chawls and also known as the Colaba Land Mill Chawls situate on Lala Nigam Road, Colaba, Bombay. There are a large number of other tenants who reside or carry on business in these Chawls and the plaintiffs instituted a suit in a representative capacity on behalf of all the tenants.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The first defendant to the suit is the Municipal Corporation of Greater Bombay and the remaining defendants 2 to 4 are landlords of the plaintiffs. The buildings and the land on which they stand belong to the Colaba Land Mill Co., Ltd., Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Under an agreement dated May 16, 1956 called the Demolition Agreement defendants 2 to 4 undertook for a certain consideration to demolish the buildings which are admittedly in a dilapidated condition after taking the permission of the Rent Controller, Bombay. Under cl. 7 of that agreement defendants 2 to 4 were to be put in possession of the buildings and land on which they stand, with leave and licence of the Company and were liable to pay Rs. 20,221-8-0 p.a. to the Company till the demolition of the buildings and thereafter they were to hold the land as tenants at will of the Company. Until the demolition of the buildings, defendants 2 to 4 were entitled to the rents payable by the tenants occupying the buildings and were liable to pay monthly taxes, insurance premia and other dues payable in respect of the buildings. After the demolition of the buildings defendants 2 to 4 were entitled to all the materials and debris but had to pay Rs. 40,000 as the price thereof to the Company. Out of this amount these defendants had to pay and had actually paid Rs. 10,000 at the time of the agreement.",
      "type": "material",
      "date": "1956-05-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The buildings were in a dilapidated condition for a number of years and between August 1951 and May 1956 as many as 138 notices were served on the Company for effecting repairs to the buildings but they took no action whatsoever in this regard.",
      "type": "admitted",
      "date": "1951-08 to 1956-05",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Between November 1956 and January 29, 1960, eleven notices were served on defendants 2 to 4 for the same purpose but no action was taken by them either on those notices.",
      "type": "admitted",
      "date": "1956-11 to 1960-01-29",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The Company and defendants 2 to 4 were prosecuted 71 times for not complying with the notices but even these prosecutions proved ineffective.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The Company as also defendants 2 to 4 deliberately refrained from carrying out the repairs because they wanted to demolish the buildings and in order to facilitate the attainment of this object they invited various notices issued by the Corporation and the prosecutions launched by it.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The Corporation, in exercise of the powers conferred by S. 354R of the Bombay Municipal Corporation Act, 1888 have declared the area in which the buildings stand as a clearance area and under s. 354RA of that Act made a clearance order which has been duly confirmed by the State Government.",
      "type": "admitted",
      "date": "1959-05-07 clearance order; 1960-01-23 confirmation",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The trial court dismissed the suit mainly upon the ground that it was not maintainable.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "An appeal was taken by the plaintiffs to the High Court which was dismissed summarily by Datar J., on August 25, 1961.",
      "type": "procedural",
      "date": "1961-08-25",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "On the same day the plaintiffs preferred an appeal under the letters patent which went up before a Division Bench consisting of Patel and Palekar JJ. The learned Judges permitted the plaintiffs to amend the plaint overruling the objections of the defendants.",
      "type": "procedural",
      "date": "1961-08-25",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "In their judgment the learned Judges held that the suit was not barred. Then they proceeded to consider the question of mala fides... Eventually, the learned Judges remitted the case to the City Civil Court for recording additional evidence and directed that Court to certify the evidence and its findings by the end of November, 1962.",
      "type": "procedural",
      "date": "1962-09-28",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "After the grant of special leave to the appellants the proceedings before the City Civil Court have been stayed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The landlords had constructed some chawls at Kurla and had offered to house the tenants of the Dhobi Chawls in the Kurla Chawls temporarily. The landlords had agreed to construct, after the demolition work was over, new buildings in which the present tenants would be afforded accommodation at standard rents.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Letter dated September 3, 1959 by City Engineer to Tenants Association stating landlords agreed to construct building consisting of single room tenements at standard rents and taking responsibility for alternative accommodation or phased programme.",
      "type": "material",
      "date": "1959-09-03",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Letter dated September 11, 1959 by Commissioner to Improvements Committee mentioning tenants' representation to construct near clearance area instead of Kurla.",
      "type": "material",
      "date": "1959-09-11",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Letter dated April 1, 1960 by City Engineer to Tenants Association reaffirming landlord's responsibility for alternative accommodation on plot No.7 at same site, no undertaking for phased demolition, tenants to shift to Kurla if needed.",
      "type": "material",
      "date": "1960-04-01",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Two reports of architects stating repairs would cost Rs. 2 lacs whereas new buildings Rs. 3 lacs.",
      "type": "material",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the suit instituted by the plaintiffs in the City Civil Court, Bombay, was maintainable.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether ss. 354R and 354RA of the Bombay Municipal Corporation Act, 1888 are ultra vires Arts. 19(1)(f) and (g) of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the clearance order was made mala fide or obtained by fraud.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether the High Court was justified in permitting amendment to the plaint adding para 8A alleging fraud by landlords and mistake of fact.",
      "framed_by": "court"
    },
    {
      "id": "i5",
      "text": "Whether the High Court was justified in remitting the case to trial court for additional evidence and virtual retrial under O. XLI r. 27 CPC.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The suit is maintainable; sections 354R and 354RA are ultra vires as they confer untrammelled discretion, violate Art 19(1)(f)(g), no opportunity to tenants; action mala fide/abuse as no hearing given; landlords fraudulently induced Corporation (via amendment).",
      "supporting_facts": [
        "f1",
        "f4",
        "f5",
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "Arts. 19(1)(f), (g); Bombay Rents Act s.12"
    },
    {
      "id": "pa2",
      "text": "Tenants have interest in property as tenants, cannot be evicted without hearing; clearance order affects tenancy rights under Bombay Rents Act; not 'person aggrieved' under Sch GG cl 2 so no bar.",
      "supporting_facts": [
        "f1",
        "f8"
      ],
      "legal_basis": "Bombay Rents Act ss.12, 13(1)(hh); Art.19(1)(f)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Suit barred by cl. 2 Schedule GG and time-barred; sections valid; no mala fides; amendment introduces new case of fraud not pleaded originally.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "Bombay Municipal Corporation Act ss.354R, 354RA, Sch GG cl.2"
    },
    {
      "id": "ra2",
      "text": "Tenants had opportunity to object via publication of notice and appeal under Sch GG cl.2; restrictions reasonable under Art.19(5).",
      "supporting_facts": [
        "f8",
        "f14",
        "f15",
        "f16",
        "f17"
      ],
      "legal_basis": "Bombay Municipal Corporation Act s.354RA(4), Sch GG cl.2; Art.19(5)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Amendment to plaint adding para 8A introduces entirely new case of fraud/wrongful inducement/mistake of fact not in original plaint; mere use of 'mala fide' insufficient basis; High Court erred in allowing as it changes case from constitutional challenge/abuse to fraud.",
      "addresses_issue": "i4",
      "key_observation": "Plaintiffs shifted ground; no basis in original plaint for fraud."
    },
    {
      "id": "cr2",
      "text": "High Court erred in remitting for additional evidence/virtual retrial; no lacuna in evidence under O.XLI r.27 CPC; documents on record do not prima facie support fraud/mala fides; not for pronouncing judgment in particular way; no issue omitted under r.25; not preliminary point for r.23.",
      "addresses_issue": "i5",
      "key_observation": "Documents (letters) reaffirm alternative accommodation, no fraud; architects' reports show no collusion."
    },
    {
      "id": "cr3",
      "text": "Ss.354R, 354RA valid; provide reasonable restrictions under Art.19(5); tenants 'persons aggrieved' entitled to object via s.354RA(4)(a) publication and appeal under Sch GG cl.2; natural meaning of 'person aggrieved' includes tenants affected.",
      "addresses_issue": "i2",
      "key_observation": "Publication invites objections from affected persons like tenants; wide appeal right."
    },
    {
      "id": "cr4",
      "text": "Suit not maintainable as alternative remedy of appeal under Sch GG cl.2 available after confirmation; finality post appeal.",
      "addresses_issue": "i1",
      "key_observation": "Plaintiffs could have appealed to City Civil Court Judge."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court erred in allowing amendment and remitting for retrial; set aside High Court judgment.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Ss. 354R and 354RA constitutional, impose reasonable restrictions; tenants have opportunity via notice publication and appeal.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Plaintiffs' suit not maintainable.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ex parte Sidebotham, In re Sidebotham",
      "citation": "(1880) 14 Ch.D. 458",
      "treatment": "referred",
      "relevance": "Meaning of 'person aggrieved' includes person whose interest affected."
    },
    {
      "case_name": "Sharifuddin v. R. P. Singh",
      "citation": "1956 I.L.R. 35 Pat. 920",
      "treatment": "followed",
      "relevance": "'Person aggrieved' has widest amplitude."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Municipal Corporation Act, 1888",
      "sections": [
        "S. 354R",
        "S. 354RA",
        "Schedule GG cl. 2"
      ],
      "relevance": "Empowers clearance orders; provides notice, objections, appeal; held valid reasonable restrictions."
    },
    {
      "name": "Bombay Rents, Hotel and Lodging House Rates Control Act, 1947",
      "sections": [
        "S. 12",
        "S. 13(1)(hh)"
      ],
      "relevance": "Protects tenants from eviction; right subject to clearance orders."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 19(1)(f)",
        "Art. 19(1)(g)",
        "Art. 19(5)"
      ],
      "relevance": "Tenants' property right subject to reasonable restrictions in public interest."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "O. XLI r. 27",
        "O. XLI r. 25",
        "O. XLI r. 23"
      ],
      "relevance": "Limits on additional evidence and remand in appeal."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal filed by the Municipal Corporation and landlords, set aside the Bombay High Court's judgment permitting amendment and remitting for retrial, held ss.354R and 354RA constitutional, and declared the plaintiffs' suit not maintainable as alternative remedy of appeal under Sch GG cl.2 was available.",
    "relief_granted": "Suit of plaintiffs dismissed as not maintainable",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The mere use of the word mala fide in the plaint cannot afford any basis for permitting an amendment.\"",
      "speaker": "court",
      "significance": "Rejects basis for amending plaint to introduce fraud allegation."
    },
    {
      "text": "\"It is only for removing a lacuna in the evidence that the appellate court is empowered to admit additional evidence.\"",
      "speaker": "court",
      "significance": "Limits High Court's power under O.XLI r.27 CPC; no lacuna found."
    },
    {
      "text": "\"The expression 'any person aggrieved' is sufficiently wide to include not only a tenant but also an occupant of a building who is likely to be dishoused.\"",
      "speaker": "court",
      "significance": "Interprets Sch GG cl.2 to include tenants for appeal remedy."
    }
  ],
  "_case_id": "1964_61",
  "_label": 1,
  "_text_length": 40068,
  "_extracted_at": "2026-02-10T19:43:42.458907"
}