{
  "metadata": {
    "case_name": "Ramchandra Narasimha Kulkarni v. State",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Das Gupta J.",
      "Subba Rao J.",
      "Raghubar Dayal J."
    ],
    "case_number": "Criminal Appeal No. 202 of 1962",
    "date_of_judgment": "1964-04-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was a registration clerk in the Haveri Post Office in the Mysore State.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 18th October 1955, a registered letter containing half portion of a ten-rupee currency note and petition on behalf of one Muppayyagonda asking for the said note to be exchanged for a fresh note was received at the Haveri Post Office at 4.30 p.m. from the Branch Post Office at Kabbur.",
      "type": "material",
      "date": "1955-10-18",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "The appellant detained the registered envelope instead of despatching it that very day as he should have done. He despatched it the next day.",
      "type": "material",
      "date": "1955-10-18",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Prosecution case: Appellant removed the half portion of the ten-rupee currency note from inside the envelope and to cover up his misconduct made alterations in the petition contained in the envelope and in the list of registered articles.",
      "type": "disputed",
      "date": "1955-10-18",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "All this was discovered when the Reserve Bank of India, to which this envelope was addressed, made enquiries on finding that currency note had not been enclosed with the petition.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Appellant admitted that the envelope was received at Haveri Post Office on October 18, 1955 and that he did not despatch it on that date. His case was that it was received at about 5.30 p.m. on the 18th and so it was too late for despatch on that date but that he despatched it duly on the 19th.",
      "type": "admitted",
      "date": "1955-10-18",
      "source": "appellant"
    },
    {
      "id": "f7",
      "text": "Sessions Judge, Dharwar, tried appellant on charges under s.52, s.53 and s.55 of Indian Post Office Act. Held charge under s.52 not established, acquitted. Found proved offences under s.53 (wilful detention) and s.55 (fraudulent alteration), convicted and sentenced to two months imprisonment on each, to run concurrently.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Mysore High Court in Criminal Appeal No. 213 of 1961, on appeal, set aside conviction under s.55 but maintained conviction under s.53, holding wilful detention proved but alterations not established. Judgment dated August 1, 1962.",
      "type": "procedural",
      "date": "1962-08-01",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "What is the meaning of 'wilfully detains or delays' in section 53 of the Indian Post Office Act? Specifically, does it require detention that is deliberate and for some purpose, or merely intentional and deliberate as opposed to accidental or negligent?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "As allegations of theft of the note or alterations in the list of registered articles not established, appellant did not commit any offence under s.53. Detention cannot be wilful unless shown he had some purpose; purpose alleged (theft and cover-up) not proved, so detention was without purpose, through inadvertence or carelessness, not wilful.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Section 53, Indian Post Office Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Wilful detention under s.53 proved, as detention was intentional and deliberate.",
      "supporting_facts": [
        "f2",
        "f3",
        "f6"
      ],
      "legal_basis": "Section 53, Indian Post Office Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Meaning of 'wilful' or 'wilfully' varies by context; in s.53 Indian Post Office Act, given scheme of Chapter X offences and comparative punishments (s.53 up to 2 years vs lighter for s.49-51), wilful detention means deliberate and for some purpose. Prosecution alleged purpose of theft/cover-up not proved; no other purpose suggested; detention result of inadvertence/carelessness/negligence, not wilful.",
      "addresses_issue": "i1",
      "key_observation": "Legislature prescribed heavy punishment for wilful detention indicating deliberate and purposeful act; contrasts with s.52 using 'for any purpose whatsoever'."
    },
    {
      "id": "cr2",
      "text": "Dissenting: Wilfully detains means intentional and deliberate, opposed to negligence/inadvertence. Detention contrary to duty and deliberate suffices; purpose not required beyond the act itself. Even if purpose required, appellant's detention deliberate to possibly remove contents, as he departed from duty without accepted excuse of late receipt.",
      "addresses_issue": "i1",
      "key_observation": "Sections 6, 48(c) distinguish wilful act/default from accidental neglect; s.53 protects against accidental/negligent acts by requiring wilfulness as deliberate violation of duty."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Wilful detention under s.53 requires detention that is deliberate and for some purpose; purpose not proved here, so no offence under s.53.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Re Young and Harston",
      "citation": "31 Ch. D. 174",
      "treatment": "referred",
      "relevance": "Wilful act as any intentional act."
    },
    {
      "case_name": "Wheeler v. New Merton Board Mills",
      "citation": "1933 2 K.B. 669",
      "treatment": "referred",
      "relevance": "Wilful suggests bad conduct but not necessarily blame; intentional act."
    },
    {
      "case_name": "United States of America v. Harry Murdock",
      "citation": "78 Law Ed. 389",
      "treatment": "referred",
      "relevance": "Wilful as done with bad purpose, without justifiable excuse, stubbornly."
    },
    {
      "case_name": "Hudson v. Official Liquidator",
      "citation": "A.I.R. 1929 All. 826",
      "treatment": "followed",
      "relevance": "Wilful default as result of deliberation, intent, or reckless omission."
    },
    {
      "case_name": "In re T.N.K. Govindarajulu Chetty",
      "citation": "1951 2 S.T.C. 27; I.L.R. 1949 Madras 121",
      "treatment": "referred",
      "relevance": "Wilful submission of false return requires deliberate knowledge."
    },
    {
      "case_name": "In re Jayarama Chettiar",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Wilful omission even under impression item not taxable."
    },
    {
      "case_name": "Taylor v. Vergette",
      "citation": "1861 30 L.J. Ex. 400",
      "treatment": "followed",
      "relevance": "Wilful delay means intentional delay, deliberately and mind goes with it."
    },
    {
      "case_name": "Reg. v. Senior",
      "citation": "1889 1 Q.B. 283",
      "treatment": "referred",
      "relevance": "Approved in Tamboli case for wilful neglect."
    },
    {
      "case_name": "Tamboli v. Great Indian Peninsular Railway Company",
      "citation": "L.R. 55 I.A. 67; I.L.R. 52 Bom. 169",
      "treatment": "referred",
      "relevance": "Wilful neglect construed per Reg. v. Senior."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Post Office Act, 1898",
      "sections": [
        "52",
        "53",
        "55",
        "49",
        "50",
        "51",
        "54",
        "56",
        "60",
        "61",
        "62",
        "66",
        "67",
        "68",
        "69",
        "6",
        "48",
        "21",
        "22",
        "23",
        "26",
        "27B",
        "37"
      ],
      "relevance": "Chapter X offences; s.53 punishes wilful detention/delay contrary to duty up to 2 years; compared punishments indicate wilful means deliberate/purposeful; distinguished from fraudulently/knowingly/intent in other sections."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed by majority; High Court conviction and sentence under s.53 set aside; appellant acquitted of the charge.",
    "relief_granted": "Acquittal",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the word wilful was used by the legislature to mean only such detention which was deliberate and for some purpose.\"",
      "speaker": "court",
      "significance": "Majority holding on interpretation of s.53."
    },
    {
      "text": "\"wilfully in s. 53 to mean intentionally and deliberately and not accidentally or negligently\"",
      "speaker": "court",
      "significance": "Dissenting interpretation of wilfully."
    },
    {
      "text": "\"Every intentional and deliberate act must be with some purpose or object.\"",
      "speaker": "court",
      "significance": "Dissent on sufficiency of deliberation implying purpose."
    }
  ],
  "_case_id": "1964_334",
  "_label": 1,
  "_text_length": 26250,
  "_extracted_at": "2026-02-10T19:46:57.671719"
}