{
  "metadata": {
    "case_name": "Appellant Company v. Respondents",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeal No. 136 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant carried on business not only in India but also outside India, i.e. Ceylon, the former States of Kolhapur and Kapurthala and other places.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On July 9, 1954, the appellant wrote a letter to the Income Tax Officer, Companies Circle, Bombay, stating that for the assessment year 1949-50, it was entitled to refund on the income taxed in Kapurthala State. It attached an original certificate for tax showing payment of Rs. 37,828/11/-, and requested that a refund order be passed at an early date.",
      "type": "material",
      "date": "1954-07-09",
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "On June 27, 1956, the Income Tax Officer rejected the claim on the ground that the claim filed by the appellant was not within the time limit of four years laid down in r. 5 of Income-Tax Double Taxation Relief (Indian States) Rules 1939.",
      "type": "procedural",
      "date": "1956-06-27",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "On December 18, 1956, the appellant filed a revision under s. 33A of the Act against the said order before the Commissioner of Income-Tax, Bombay. The appellant stated that the company's assessment for the year was completed on 31-3-1954, being the last date on which claim for double income-tax relief should have been lodged, but in absence of assessment order received, it was not physically practicable to lodge claim, and time under Section 50 had expired.",
      "type": "procedural",
      "date": "1956-12-18",
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "The Commissioner made enquiries. Appellant replied on June 30, 1958 that no provisional claim for double income-tax relief was made within time prescribed, reiterating physical impracticability.",
      "type": "procedural",
      "date": "1958-06-30",
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "The Commissioner rejected the revision petition, observing that assessment in Kapurthala was on 20-3-1950, much before Bombay assessment, nothing prevented filing provisional claim before limitation, at least at time of assessment; no provision under Section 50 for condonation.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Central Board of Revenue by letter dated December 31, 1958 declined to interfere.",
      "type": "procedural",
      "date": "1958-12-31",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Appellant did not apply to High Court under Art. 226 for quashing orders of Commissioner or Central Board.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On August 28, 1959, Income-Tax Officer issued three notices of demand under s. 29 for assessment years 1949-50, 1950-51 and 1951-52.",
      "type": "procedural",
      "date": "1959-08-28",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "On September 4, 1959, appellant wrote requesting Income-Tax Officer to set off refunds entitled under Income-Tax Double Taxation Relief (Ceylon) Rules 1942 read with ss. 49A and 48 for 1942-43, 1943-44, 1944-45 (Ceylon), and 1947-48, 1949-50 (Kolhapur and Kapurthala) against demands.",
      "type": "material",
      "date": "1959-09-04",
      "source": "appellant"
    },
    {
      "id": "f11",
      "text": "Appellant approached Central Board of Revenue urging similar points for set off.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f12",
      "text": "Central Board of Revenue by letter dated June 24, 1960 declined to interfere.",
      "type": "procedural",
      "date": "1960-06-24",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "On October 7, 1960, appellant filed petition under Art. 226 praying for writ of mandamus directing set off of refunds against tax for 1955-56, and writ of prohibition preventing recovery without set off. Petitioner had paid tax for 1949-50 and 1950-51; demands for 1951-52 and part of 1955-56 kept in abeyance.",
      "type": "procedural",
      "date": "1960-10-07",
      "source": "appellant"
    },
    {
      "id": "f14",
      "text": "Bombay High Court dismissed petition on February 24, 1961.",
      "type": "procedural",
      "date": "1961-02-24",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Appeal to Supreme Court on certificate granted by High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Construction of S. 49E of the Indian Income-Tax Act, 1922: whether Income-tax Officer may set off refund against tax payable without prior adjudication that refund is due, and despite claim being time-barred under r. 5 of Indian States Rules and final rejection thereof.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Compliance with r. 5 of Indian States Rules physically impossible, so r. 5 did not apply and refund due notwithstanding r. 5.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "r. 5 Income-Tax Double Taxation Relief (Indian States) Rules 1939"
    },
    {
      "id": "pa2",
      "text": "No prior adjudication necessary for set off under s. 49E; Income-Tax Officer can decide if refund due when application made; appellant entitled to refund under r. 3 of Indian States Rules, ITO only to calculate and set off.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "s. 49E Indian Income-Tax Act 1922; r. 3 Indian States Rules"
    },
    {
      "id": "pa3",
      "text": "Not challenging prior rejection of refund claims but only rejection of set off application.",
      "supporting_facts": [
        "f10",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Orders of Commissioner and Central Board final; no obligation on ITO to pay refund; condition precedent to s. 49E is obligation to make payment; 'in lieu of payment of the refund' indicates such obligation.",
      "supporting_facts": [
        "f6",
        "f7",
        "f12"
      ],
      "legal_basis": "s. 49E Indian Income-Tax Act 1922"
    },
    {
      "id": "ra2",
      "text": "Refund not due under Act but under Rules, so s. 49E does not apply.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "s. 49E Indian Income-Tax Act 1922"
    },
    {
      "id": "ra3",
      "text": "'Found to be due' means prior adjudication whereunder amount found due by way of refund.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "s. 49E Indian Income-Tax Act 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Cannot go into whether r. 5 rightly applied as prior orders of Commissioner (Aug 23, 1958) and CBR (Dec 31, 1958) not challenged and final; proceed on basis they validly passed.",
      "addresses_issue": "i1",
      "key_observation": "Prior orders rejecting refund on time-bar final and not assailable."
    },
    {
      "id": "cr2",
      "text": "Refund if due under Rules is due under Act as s. 59(5) provides rules have effect as if enacted in Act.",
      "addresses_issue": "i1",
      "key_observation": "Indian States Rules part of Act for s. 49E."
    },
    {
      "id": "cr3",
      "text": "No prior adjudication necessary under s. 49E; ITO not debarred from determining if refund due on application; 'found to be due' does not require prior adjudication.",
      "addresses_issue": "i1",
      "key_observation": "ITO can adjudicate refund on set-off claim."
    },
    {
      "id": "cr4",
      "text": "However, s. 49E requires subsisting obligation to pay refund; 'in lieu of payment' connotes outstanding payment obligation; if claim barred by final order, no subsisting obligation.",
      "addresses_issue": "i1",
      "key_observation": "Cited Stubbs v. Director of Public Prosecutions: liability in lieu of B requires binding obligation on B."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S. 49E allows set off where refund found due under Act (including rules), no prior adjudication needed as ITO can determine, but requires subsisting obligation to pay refund which must not be barred by final order.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No subsisting obligation here due to final rejections on time-bar; s. 49E of no assistance to appellant.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Stubbs v. Director of Public Prosecutions",
      "citation": "24 Q.B.D. 577",
      "treatment": "followed",
      "relevance": "Construes 'in lieu of': where liability discharged by A in lieu of B, binding obligation on B required."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-Tax Act, 1922",
      "sections": [
        "49E",
        "33A",
        "29",
        "49A",
        "48",
        "50",
        "59(5)"
      ],
      "relevance": "s.49E power to set off refunds against tax payable; s.33A revision; s.29 demand notice; ss.49A,48 double taxation relief; s.50 time limit; s.59(5) rules have effect as enacted in Act."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "226"
      ],
      "relevance": "Writ petition filed under Art. 226 for mandamus and prohibition."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court agreed with Bombay High Court that s. 49E does not assist appellant as no subsisting obligation to pay refunds due to time-bar upheld by final prior orders of Commissioner and CBR; petition rightly dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"We are of the opinion that it is not necessary that there should be a prior adjudication before a claim can be allowed under s. 49E.\"",
      "speaker": "court",
      "significance": "Court holds no prior adjudication required under s.49E."
    },
    {
      "text": "\"The expression 'in lieu of payment' clearly indicates that the Income-Tax Officer must be under an obligation to make a payment.\"",
      "speaker": "court",
      "significance": "Key to holding: requires subsisting obligation to pay refund."
    },
    {
      "text": "\"If a claim to refund is barred by a final order, it cannot be said that there is a subsisting obligation to make a payment.\"",
      "speaker": "court",
      "significance": "Explains why s.49E inapplicable here."
    }
  ],
  "_case_id": "1964_156",
  "_label": 0,
  "_text_length": 12715,
  "_extracted_at": "2026-02-10T19:44:55.122282"
}