{
  "metadata": {
    "case_name": "Appellant v. Bhooralal",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "AYYANGAR, J."
    ],
    "case_number": "Civil Appeal No. 583 of 1961",
    "date_of_judgment": "1964-04-22"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent Bhooralal brought Civil Suit No. 20 of 1954 in the Court of the Subordinate Judge, First Class, Kekri against the appellant claiming possession of certain property described in the plaint and for mesne profits.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Allegation in the plaint: plaintiff was the absolute owner of the said property of which the defendant was in wrongful possession and that in spite of demands he had failed to vacate the same and was therefore liable to pay the mesne profits claimed.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "In the plaint, reference to a previous suit C.S. 28 of 1950 filed by plaintiff and his mother against the defendant for recovery of mesne profits in regard to the same property for the period ending with February 10, 1950, and that mesne profits had been decreed in the said suit.",
      "type": "background",
      "date": "1950-02-10",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "In the Written Statement filed by the appellant, besides disputing the claim on merits, raised technical plea: O. 2. r. 2, Civil Procedure Code is a bar to the suit. When the suit referred to in paragraph 2 of the plaint was filed the plaintiff had a cause of action for the reliefs also. He having omitted to sue for possession in that suit, is now barred from claiming relief of possession. No second suit for recovery of mesne profits is maintainable in law.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f5",
      "text": "Learned Subordinate Judge framed 5 issues, including 4th issue: Whether O. 2. r. 2, Civil Procedure Code is a bar? Treated as preliminary issue, found suit barred, directed dismissal of the suit.",
      "type": "procedural",
      "date": "1959-08-12",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Plaintiff (respondent) preferred appeal to Additional District Judge, who held: pleadings in earlier suit C.S. 28/1950 not filed and not part of record, so plea of bar under O. 2. r. 2 not entertainable. Obiter: cause of action for mesne profits different from possession. Set aside dismissal, remanded for decision on merits.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appellant preferred second appeal to Rajasthan High Court, learned Single Judge dismissed the appeal.",
      "type": "procedural",
      "date": "1959-08-12",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellant obtained special leave, filed Civil Appeal No. 583 of 1961 in Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Pleadings in C.S. 28 of 1950 were not filed by appellant as evidence in support of plea under O. 2. r. 2 CPC.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Plaint in present suit was in Hindi, 'mesne profits' is English translation of some expression used in original.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether O. 2. r. 2, Civil Procedure Code is a bar to the suit for possession and mesne profits, given previous suit for mesne profits, i.e., whether suits for possession of immovable property and recovery of mesne profits from same property are based on same cause of action.",
      "framed_by": "appellant"
    },
    {
      "id": "i2",
      "text": "Whether plea of bar under O. 2. r. 2 CPC can be entertained without pleadings of previous suit being on record.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "O. 2. r. 2 CPC bars the suit as plaintiff omitted to sue for possession in previous suit CS 28/1950 where cause of action was same (wrongful possession), supported by Allahabad High Court view that basis of mesne profits and possession is same wrongful possession.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "O. 2. r. 2 CPC; Allahabad High Court decisions"
    },
    {
      "id": "pa2",
      "text": "From reference in plaint to previous suit for mesne profits, infer that previous suit alleged wrongful possession, so same cause of action; parties consented to records of earlier suit being considered.",
      "supporting_facts": [
        "f3",
        "f9"
      ],
      "legal_basis": "O. 41. r. 27 CPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Pleadings of earlier suit not on record, so plea of bar under O. 2. r. 2 not maintainable; cause of action for mesne profits different from possession, supported by Madras High Court view reading O. 2. r. 4.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "O. 2. r. 2 CPC; O. 2. r. 4 CPC; Madras High Court decisions"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "To succeed on plea of bar under O. 2. r. 2 CPC, defendant must establish: (1) second suit in respect of same cause of action as previous suit; (2) plaintiff entitled to more than one relief therein; (3) omitted to sue for relief in second suit without leave. Requires proof of precise cause of action in previous suit by filing pleadings.",
      "addresses_issue": "i2",
      "key_observation": "Plea is technical bar, cannot be presumed on inferential reasoning; must file pleadings of previous suit."
    },
    {
      "id": "cr2",
      "text": "Pleadings in CS 28/1950 not filed or part of record; trial judge inferred cause of action without them, which is impermissible. No consent or admission under O. 41 r. 27 to make them part of record.",
      "addresses_issue": "i2",
      "key_observation": "Cannot speculate or infer cause of action from mere reference or use of 'mesne profits'; plaint in Hindi, translation accuracy unverified."
    },
    {
      "id": "cr3",
      "text": "Like res judicata, plea under O. 2. r. 2 requires production of previous plaint to prove identity of cause of action, which is facts alleged in previous plaint.",
      "addresses_issue": "i2",
      "key_observation": "Mere characterisation as 'mesne profits' does not necessarily imply allegation of wrongful possession."
    },
    {
      "id": "cr4",
      "text": "No need to resolve conflict between High Courts (Madras vs Allahabad) as no material for plea.",
      "addresses_issue": "i1",
      "key_observation": "District Judge right in rejecting plea for lack of material."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Plea of bar under O. 2. r. 2 CPC cannot be established without filing pleadings of previous suit to prove identity of cause of action.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Madras High Court decisions",
      "citation": null,
      "treatment": "followed",
      "relevance": "Cause of action for possession and mesne profits distinct, reading O. 2. r. 4 with O. 2. r. 2."
    },
    {
      "case_name": "Allahabad High Court decisions",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Cause of action same (wrongful possession) for possession and mesne profits."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order 2 Rule 2",
        "Order 2 Rule 4",
        "Order 41 Rule 27"
      ],
      "relevance": "O.2 r.2 bars subsequent suit for omitted relief based on same cause of action; O.2 r.4 permits joinder or treats mesne profits separately; O.41 r.27 on additional evidence in appeal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed. Order of remand by Additional District Judge, confirmed by Rajasthan High Court, affirmed. Suit remanded to trial court for decision on merits.",
    "relief_granted": "None to appellant; suit to proceed on merits",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "In order that a plea of a bar under O. 2. r. 2, Civil Procedure Code should succeed the defendant who raises the plea must make out (1) that the second suit was in respect of the same cause of action as that on which the previous suit was based, (2) that in respect of that cause of action the plaintiff was entitled to more than one relief, (3) that being thus entitled to more than one relief the plaintiff, without leave obtained from the Court, omitted to sue for the relief for which the second suit had been filed.",
      "speaker": "court",
      "significance": "Defines requirements for O.2 r.2 bar"
    },
    {
      "text": "a plea of a bar under O. 2. r. 2, Civil Procedure Code can be established only if the defendant files in evidence the pleadings in the previous suit and thereby proves to the Court the identity of the cause of action in the two suits.",
      "speaker": "court",
      "significance": "Core holding on proof required for plea"
    },
    {
      "text": "The appeal fails and is dismissed.",
      "speaker": "court",
      "significance": "Final disposition"
    }
  ],
  "_case_id": "1964_300",
  "_label": 0,
  "_text_length": 14557,
  "_extracted_at": "2026-02-10T19:46:20.079526"
}