{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Assessee (Textile Mill Company)",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "This appeal was filed in this court after obtaining a certificate under section 66A(2) of the Income-tax Act, 1922, and is directed against the judgment and order of the High Court of Madhya Pradesh, dated August 10, 1961.",
      "type": "procedural",
      "date": "1961-08-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The High Court followed its decision in the case of Swadeshi Cotton and Flour Mills v. Commissioner of Income-tax.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The question which was referred to the High Court was: Whether, on the facts and in the circumstances of the case, Rs. 2,57,000 being bonus for the calendar year 1947 is allowable against the profits of calendar year 1949, the previous year for assessment year 1950-51?",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "This question arose out of the assessment year 1950-51 (previous calendar year 1949).",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The assessee is a limited company which owns a textile mill.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "It had paid Rs. 2,57,000 as bonus to its workers in respect of the calendar year 1947, and claimed it as a deduction in respect of the assessment year 1950-51.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "A dispute had arisen between the workmen and the assessee and it was settled by an award made in January, 1949, by the tribunal under the Industrial Disputes Act.",
      "type": "material",
      "date": "1949-01",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts and in the circumstances of the case, Rs. 2,57,000 being bonus for the calendar year 1947 is allowable against the profits of calendar year 1949, the previous year for assessment year 1950-51?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The point involved in this appeal is the same as in Commissioner of Income-tax v. Swadeshi Cotton and Flour Mills, in which we have just delivered judgment.",
      "addresses_issue": "i1",
      "key_observation": "The issues are identical to the companion case."
    },
    {
      "id": "cr2",
      "text": "Following our decision and the reasoning in Commissioner of Income-tax v. Swadeshi Cotton and Flour Mills, we hold that the High Court was right in answering the question in the affirmative.",
      "addresses_issue": "i1",
      "key_observation": "High Court correctly allowed the deduction."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rs. 2,57,000 being bonus for the calendar year 1947 is allowable against the profits of calendar year 1949, the previous year for assessment year 1950-51.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax v. Swadeshi Cotton and Flour Mills",
      "citation": null,
      "treatment": "followed",
      "relevance": "Same point involved; reasoning adopted to hold High Court correct."
    },
    {
      "case_name": "Swadeshi Cotton and Flour Mills v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "High Court decision followed by the Madhya Pradesh High Court in this case."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "66A(2)"
      ],
      "relevance": "Certificate obtained for appeal to Supreme Court."
    },
    {
      "name": "Industrial Disputes Act",
      "sections": [],
      "relevance": "Tribunal award under this Act settled the bonus dispute in January 1949."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court followed its judgment in the companion case of Commissioner of Income-tax v. Swadeshi Cotton and Flour Mills and held that the High Court of Madhya Pradesh was right in answering the referred question in the affirmative, allowing the bonus deduction.",
    "relief_granted": "Deduction of Rs. 2,57,000 bonus allowed for assessment year 1950-51.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The point involved in this appeal is the same as in Commissioner of Income-tax v. Swadeshi Cotton and Flour Mills, in which we have just delivered judgment.",
      "speaker": "court",
      "significance": "Establishes identicality with companion case."
    },
    {
      "text": "Following our decision and the reasoning in Commissioner of Income-tax v. Swadeshi Cotton and Flour Mills, we hold that the High Court was right in answering the question in the affirmative.",
      "speaker": "court",
      "significance": "Core holding affirming High Court's decision."
    }
  ],
  "_case_id": "1964_38",
  "_label": 0,
  "_text_length": 1451,
  "_extracted_at": "2026-02-10T19:43:23.842466"
}