{
  "metadata": {
    "case_name": "Laxmi Prasad alias Laxmi Narain and Ors. v. State",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, C.J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Forty persons charged with offences including principal charge under section 302 read with s. 149 IPC, and others under s. 307/149, 201/149, 511, 395, 396/149, 449 IPC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Trial by First Additional Sessions Judge at Jhansi; convicted 35 out of 40 accused; acquitted 5; sentenced 10 to death and 25 to life imprisonment for s. 302/149; other sentences for remaining offences.",
      "type": "procedural",
      "date": "1962-12-31",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "35 convicted accused appealed to Allahabad High Court; death sentences of 10 referred for confirmation.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "High Court acquitted 7 out of 35 appellants; confirmed convictions and sentences for remaining 28; confirmed death sentences for 10.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Five appeals by special leave to Supreme Court by 16 accused persons.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Incident on 29th November 1961 at about 8 a.m. in village Bilati Khet, Jhansi; rivalry between two factions: one led by Gayadin, other by Laxmi Prasad alias Laxmi Narain.",
      "type": "background",
      "date": "1961-11-29",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Criminal proceedings continued between parties for several years.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Laxmi Prasad elected Pradhan of village Panchayat, defeating Gayadin's candidate.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "On 28th November 1961, boundary dispute between fields of Gayadin and Laxmi Prasad; arbitration failed; Laxmi Prasad's group threatened to settle next day.",
      "type": "background",
      "date": "1961-11-28",
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Early morning 29th November 1961, Bahoran (son of Gayadin) met Laxmi Prasad in field; Laxmi attacked with lathi; Bahoran retaliated with pharsa, injuring Laxmi's nose.",
      "type": "material",
      "date": "1961-11-29",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Infuriated Laxmi Prasad collected crowd from his faction, armed with guns, spears, swords, gandasas, lathis; proceeded to Gayadin's house to kill family members.",
      "type": "material",
      "date": "1961-11-29",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Ram Prasad and Dayaram informed Gayadin's group; they rushed towards house; Laxmi Prasad fired gun near house; Bhagwati instigated to fire at those by fire north of house.",
      "type": "material",
      "date": "1961-11-29",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Gayadin's group rushed into house, closed doors; assailants broke doors, entered sehan; pursued and killed Gayadin on upper storey; shot dead Brindaban, Radha Saran, Dayaram in rooms.",
      "type": "material",
      "date": "1961-11-29",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Bahoran and Shiroman Singh (sons of Gayadin) escaped via roof to Harbans' cattleshed; Shiroman hid in godown, Bahoran in chaff room.",
      "type": "material",
      "date": "1961-11-29",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Assailants dragged bodies out; Gori Dulaiya (Gayadin's wife) implored, struck with stick; bodies dragged to Harbans' cattleshed; injured Harbans, killed Shiroman Singh.",
      "type": "material",
      "date": "1961-11-29",
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Five bodies (Gayadin, Brindaban, Radha Saran, Dayaram, Shiroman Singh) taken to Bhagwati's field; placed on piles of cowdung cakes; kerosene sprinkled, set on fire.",
      "type": "material",
      "date": "1961-11-29",
      "source": "prosecution"
    },
    {
      "id": "f17",
      "text": "Bahoran lodged FIR at 11 a.m. at Police Station Krichh, naming 35 assailants; later 5 more added by committal order on 14th May 1962.",
      "type": "procedural",
      "date": "1961-11-29",
      "source": "prosecution"
    },
    {
      "id": "f18",
      "text": "Police extinguished fire, recovered half-burnt bodies, sent for post-mortem; injured (Harbans, Ram Prasad, Mansa Ram, Gori Dulaiya) for medical exam.",
      "type": "procedural",
      "date": "1961-11-29",
      "source": "prosecution"
    },
    {
      "id": "f19",
      "text": "Prosecution case by 12 eye-witnesses: Bahoran PW1, Basanti Lal PW2, Rameshwar Dayal PW3, Prabhu Dayal PW5, Pancham PW6, Swarup Singh PW14, Kasturi PW15, Thakur Das PW16, Shyamlal PW17, Harbans PW18, Dropadi PW19, Kishori Lal PW20.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f20",
      "text": "Accused denied involvement; contended false case by hostile witnesses.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f21",
      "text": "High Court discarded evidence of Bahoran and Prabhu Dayal due to infirmities; accepted remaining 10 as true; noted partisan nature and uniform account without specific overt acts except for Laxmi Prasad.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "High Court convicted where 4 or more witnesses consistent; acquitted 7.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "Prosecution failed to tender Ram Prasad, Mansa Ram (won over), Rani Dulhan (mental shock); trial court rejected defence applications under s.540 CrPC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f24",
      "text": "Accused Nos. 9 Ram Saran (18 years), 11 Asha Ram (23 years), 16 Deo Prasad (24 years) young sons/influenced by elders.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether High Court properly discharged duty in confirming convictions and death sentences under s.374 CrPC.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether evidence of partisan witnesses reliable despite uniform pattern and lack of specific overt acts.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether failure to examine three material witnesses (Ram Prasad, Mansa Ram, Rani Dulhan) vitiates trial.",
      "framed_by": "petitioner"
    },
    {
      "id": "i4",
      "text": "Whether appellants members of unlawful assembly without specific overt acts, per Baladin precedent.",
      "framed_by": "petitioner"
    },
    {
      "id": "i5",
      "text": "Whether death sentence justifiable under s.302/149 IPC for those not personally committing murders.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court failed to independently consider entire evidence as required by s.374 CrPC for death sentence confirmation.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "Jumman v. State of Punjab; s.374, 375 CrPC"
    },
    {
      "id": "pa2",
      "text": "Evidence of partisan faction witnesses unreliable; should be discarded.",
      "supporting_facts": [
        "f6",
        "f19",
        "f21"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Uniform evidence without specific overt acts except Laxmi Prasad; mechanical test of 4 witnesses arbitrary.",
      "supporting_facts": [
        "f21",
        "f22"
      ],
      "legal_basis": "Indian Evidence Act"
    },
    {
      "id": "pa4",
      "text": "Prosecution suppressed three material witnesses; trial court erred in not summoning under s.540 CrPC.",
      "supporting_facts": [
        "f23"
      ],
      "legal_basis": "s.540 CrPC"
    },
    {
      "id": "pa5",
      "text": "Mere presence does not make member of unlawful assembly without overt act.",
      "supporting_facts": [
        "f20"
      ],
      "legal_basis": "Baladin v. State of Uttar Pradesh; s.141,142,149 IPC"
    },
    {
      "id": "pa6",
      "text": "Death sentence mechanical for 10 armed with guns; only if personally committed murder.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Dalip Singh v. State of Punjab"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Accused denied involvement but prosecution evidence reliable.",
      "supporting_facts": [
        "f19"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court carefully examined evidence, arguments, infirmities; applied safe test of 4 consistent witnesses; criticism not well-founded.",
      "addresses_issue": "i1",
      "key_observation": "High Court judgment shows due care; no need to re-examine evidence."
    },
    {
      "id": "cr2",
      "text": "Partisan evidence not to be mechanically rejected; must weigh carefully; common in faction cases.",
      "addresses_issue": "i2",
      "key_observation": "Rejection solely on partisanship leads to failure of justice."
    },
    {
      "id": "cr3",
      "text": "Prosecutor not bound to tender won-over/terrorised witnesses; defence could examine or court under s.540; trial court finding they not essential upheld.",
      "addresses_issue": "i3",
      "key_observation": "No oblique motive; reasonable not to insist."
    },
    {
      "id": "cr4",
      "text": "Baladin observation contextual; membership if aware and intentionally joins with common object; no need for overt act; s.149 vicarious.",
      "addresses_issue": "i4",
      "key_observation": "Armed group from one faction with common object to exterminate."
    },
    {
      "id": "cr5",
      "text": "Death sentence not mechanical; justified for 10 with firearms in gruesome case to suppress criminal conduct; discretion proper.",
      "addresses_issue": "i5",
      "key_observation": "Facts warrant; not limited to personal act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court properly confirmed convictions and sentences.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Partisan evidence can be relied on after scrutiny.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "No error in not examining three witnesses.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Appellants members of unlawful assembly with common object; liable u/s 149 IPC without personal overt act.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    },
    {
      "id": "h5",
      "text": "Death sentence proper for 10 with firearms; modified to life for 3 young accused (Nos. 9,11,16).",
      "resolves_issue": "i5",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Jumman Ors. v. The State of Punjab",
      "citation": null,
      "treatment": "followed",
      "relevance": "High Court must independently consider evidence in death sentence confirmation u/s 374 CrPC."
    },
    {
      "case_name": "Baladin v. State of Uttar Pradesh",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Mere presence not membership; but contextual to passive witnesses; not general rule requiring overt act."
    },
    {
      "case_name": "Dalip Singh v. State of Punjab",
      "citation": "1954 S.C.R. 145",
      "treatment": "distinguished",
      "relevance": "Power to enhance to death rarely; irrelevant as no enhancement here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302/149",
        "307/149",
        "201/149",
        "511",
        "395",
        "396/149",
        "449",
        "141",
        "142"
      ],
      "relevance": "Principal offence murder with common object by unlawful assembly; membership and vicarious liability."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "374",
        "375",
        "540"
      ],
      "relevance": "Confirmation of death sentence requires independent consideration; power to call witnesses."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court dismissed appeals, confirmed convictions and sentences against all appellants except modified death sentences of accused Nos. 9 Ram Saran, 11 Asha Ram, and 16 Deo Prasad to life imprisonment, considering their young age and influence of elders.",
    "relief_granted": "Sentences altered to life imprisonment for three accused.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the sentence of death imposed by the Court of Sessions is not effective until and unless it is confirmed by the High Court.\"",
      "speaker": "court",
      "significance": "Emphasises solemnity of confirmation proceedings u/s 374 CrPC."
    },
    {
      "text": "\"mere presence in an assembly does not make a person... a member of an unlawful assembly unless it is shown that he had done something or omitted to do something...\"",
      "speaker": "court",
      "significance": "Distinguishes Baladin; clarifies no general overt act requirement."
    },
    {
      "text": "\"it would be unreasonable to contend that evidence given by witnesses should be discarded only on the ground that it is evidence of partisan or interested witnesses.\"",
      "speaker": "court",
      "significance": "Approach to factional/partisan testimony."
    }
  ],
  "_case_id": "1964_40",
  "_label": 0,
  "_text_length": 38681,
  "_extracted_at": "2026-02-10T19:43:35.224452"
}