{
  "metadata": {
    "case_name": "Associated Cement Companies Ltd. v. P. N. Sharma and State of Punjab",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR C.J.",
      "M. HIDAYATULLAH",
      "SHAH",
      "SIKRI",
      "BACHAWAT J."
    ],
    "case_number": "Civil Appeal No. 44 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a company with its Head Office in Bombay and it runs 14 cement factories, 2 collieries and one fire-brick works in 8 States of the Union of India. One such Cement Works is the Bhupendra Cement Works, Surajpur within the territorial limits of respondent No. 2.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Under the provisions of the Factories Act, 1948 read with the provisions of the Rules, the appellant was required to appoint one Welfare Officer and to notify his appointment and qualification to the Chief Inspector of Factories.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent No. 1 was appointed such a Welfare Officer. The letter of appointment issued to him on March 2, 1956, stated that he would be liable to be transferred from one unit of the appellant to another and that his services could be terminated by the appellant by one month's notice or with one month's pay in lieu thereof.",
      "type": "material",
      "date": "1956-03-02",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent No. 1 was first posted at Lakheri Cement Works, Lakheri in Rajasthan, where he joined duty on March 14, 1956. Thereafter, he was transferred from one place to another according to the requirements of service and the working of the appellants factories.",
      "type": "background",
      "date": "1956-03-14",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On June 26, 1960, he was posted at the Bhupendra Cement Works. He was working at these Works until September 26, 1961, when his services were terminated.",
      "type": "material",
      "date": "1960-06-26",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant transferred respondent No. 1 from Bhupendra Cement Works to Kymore Works which is near Katni in Madhya Pradesh, but apparently, respondent No. 1 was not prepared to go to Kymore Works, and after long and protracted correspondence between the parties, the appellant wrote to him on September 26, 1961, that since he had not proceeded to Kymore on transfer as directed, he had ceased to be in the employment of the appellant, and his name had been struck off from the Company's roll.",
      "type": "material",
      "date": "1961-09-26",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondent No. 1 then filed an appeal before respondent No. 2 as the appellate authority under R. 6(6) of the Rules.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On receiving notice of the said appeal, the appellant filed its written statement and disputed the validity of the grievance made by respondent No. 1 in respect of the termination of his services.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Respondent No. 2 then passed the impugned order on July 4, 1962. This order was issued in the name of the Governor of Punjab in exercise of the powers conferred by R. 6(6) of the Rules, and it directed that the Governor of Punjab was pleased to reinstate respondent No. 1 as Labour Welfare Officer in the service of the appellant. However, nothing in this order shall be construed to prevent the management from taking action against Mr. P. N. Sharma in accordance with the provisions of the Rules for such acts and commissions on his part as may have come to their notice.",
      "type": "material",
      "date": "1962-07-04",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The Rules were framed by respondent No. 2 in 1952 and have been published in the Punjab Government Gazette on March 26, 1952, and they came into force from September 30, 1952.",
      "type": "background",
      "date": "1952-03-26",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether respondent No. 2, the State of Punjab, exercising its appellate jurisdiction under Rule 6(6) of the Punjab Welfare Officers Recruitment and Conditions of Service Rules, 1952 hereinafter called the Rules is a Tribunal within the meaning of Art. 136(1) of the Constitution.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "whether the relevant Rule which requires the concurrence of the Labour Commissioner before the management can dismiss or terminate the services of a Welfare Officer, is invalid inasmuch as it is outside the scope of the authority conferred on the State Government by s. 49(2) of the Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "whether the appeal preferred by respondent No. 1 before respondent No. 2 was incompetent under r. 6(6).",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "the impugned appellate order is invalid and erroneous and must be set aside.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Art. 136(1)"
    },
    {
      "id": "pa2",
      "text": "the relevant Rule which requires the concurrence of the Labour Commissioner before the management can dismiss or terminate the services of a Welfare Officer, is invalid inasmuch as it is outside the scope of the authority conferred on the State Government by s. 49(2) of the Act.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Factories Act, 1948 s.49(2)"
    },
    {
      "id": "pa3",
      "text": "the appeal preferred by respondent No. 1 before respondent No. 2 was incompetent under r. 6(6) because termination was not a punishment but a simple discharge under terms of appointment.",
      "supporting_facts": [
        "f3",
        "f6",
        "f9"
      ],
      "legal_basis": "Rule 6(6); clause 4 of appointment letter dated March 2, 1956"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "special leave should not have been granted to the appellant, because the appeal is incompetent inasmuch as respondent No. 2 against whose appellate decision the appellant purports to have preferred the present appeal is not a tribunal under Art. 136(1).",
      "supporting_facts": [],
      "legal_basis": "Art. 136(1)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The basic and the fundamental feature which is common to both the courts and the tribunals is that they discharge judicial functions and exercise judicial powers which inherently vest in a sovereign State.",
      "addresses_issue": "i1",
      "key_observation": "Tribunals under Art.136(1) are constituted by the State and invested with judicial as distinguished from purely administrative or executive functions."
    },
    {
      "id": "cr2",
      "text": "The power which the State Government exercises under R. 6(5) and R. 6(6) is a part of the States judicial power. It has been conferred on the State Government by a statutory Rule and it can be exercised in respect of disputes between the management and its Welfare Officers. There is, in that sense, a lis; there is affirmation by one party and denial by another, and the dispute necessarily involves the rights and obligations of the parties to it.",
      "addresses_issue": "i1",
      "key_observation": "State Government under Rule 6(6) is a Tribunal within Art.136(1)."
    },
    {
      "id": "cr3",
      "text": "The words conditions of service used in s. 49(2) are wide enough to cover the proviso in question and sub-rules (4), (5) and (6) of Rule 6.",
      "addresses_issue": "i2",
      "key_observation": "Rule 6 is not ultra vires s.49(2)."
    },
    {
      "id": "cr4",
      "text": "In terminating the services of respondent No. 1 the appellant was merely exercising its right to put an end to respondent No. 1s services with one months salary in lieu of notice and such an order cannot be said to amount to any punishment at all; it is an order of discharge served by the employer on his employee strictly within the terms of the employees conditions of service.",
      "addresses_issue": "i3",
      "key_observation": "Termination was not punishment under Rule 6(3)(v); appeal incompetent."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "State Government exercising appellate jurisdiction under Rule 6(6) of the Punjab Welfare Officers Recruitment and Conditions of Service Rules, 1952 is a Tribunal within the meaning of Art. 136(1).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Rule 6 is within the rule-making power under s.49(2) of Factories Act.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Termination of services was a simple discharge, not punishment; appeal under Rule 6(6) incompetent.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Durga Shankar Mehta v. Thakur Raghuraj Singh",
      "citation": "1955 1 S.C.R. 267",
      "treatment": "followed",
      "relevance": "Tribunals share with courts the common characteristic that both are constituted by the State and invested with judicial functions."
    },
    {
      "case_name": "Province of Bombay v. Kusaldas S. Advani",
      "citation": "1950 S.C.R. 621",
      "treatment": "referred",
      "relevance": "Principles on when authority acts judicially."
    },
    {
      "case_name": "Ridge v. Baldwin",
      "citation": "L.R. 1964 A.C. 40",
      "treatment": "referred",
      "relevance": "Necessity to follow judicial procedure and natural justice flows from nature of decision."
    },
    {
      "case_name": "Nagendra Nath Bora v. Commissioner of Hills Division",
      "citation": "1958 S.C.R. 1240",
      "treatment": "followed",
      "relevance": "Appellate authority must hear judicially."
    },
    {
      "case_name": "Shivji Nathubhai v. Union of India",
      "citation": "1960 2 S.C.R. 775",
      "treatment": "referred",
      "relevance": "Central Government exercising review power acts judicially."
    },
    {
      "case_name": "Bharat Bank Ltd. v. Employees of Bharat Bank Ltd.",
      "citation": "1950 S.C.R. 459",
      "treatment": "followed",
      "relevance": "Industrial Tribunal is a tribunal under Art.136; condition precedent is constitution by State and investment with judicial functions."
    },
    {
      "case_name": "Harinagar Sugar Mills Ltd. v. Shyam Sundar Jhunjhunwala",
      "citation": "1962 2 S.C.R. 339",
      "treatment": "followed",
      "relevance": "Central Government under s.111(3) Companies Act acts as tribunal."
    },
    {
      "case_name": "Jaswant Sugar Mills Ltd. v. Lakshmichand",
      "citation": "1963 Supp. 1 S.C.R. 242",
      "treatment": "distinguished",
      "relevance": "Conciliation Officer not tribunal as not invested with judicial power."
    },
    {
      "case_name": "Engineering Mazdoor Sabha v. Hind Cycles Ltd.",
      "citation": "1963 Supp. 1 S.C.R. 625",
      "treatment": "referred",
      "relevance": "Arbitrator under s.10A not tribunal."
    },
    {
      "case_name": "Indo-China Steam Navigation Co. Ltd. v. Jasjit Singh",
      "citation": "1964 6 S.C.R. 594",
      "treatment": "followed",
      "relevance": "Central Board of Revenue and Central Government under Sea Customs Act are tribunals."
    },
    {
      "case_name": "Local Government Board v. Arlidge",
      "citation": "1915 A.C. 120",
      "treatment": "followed",
      "relevance": "Duty to act judicially when deciding appeal."
    }
  ],
  "statutes_cited": [
    {
      "name": "Factories Act, 1948",
      "sections": [
        "Section 49"
      ],
      "relevance": "Requires appointment of Welfare Officers; empowers State to prescribe duties, qualifications, conditions of service."
    },
    {
      "name": "Punjab Welfare Officers Recruitment and Conditions of Service Rules, 1952",
      "sections": [
        "Rule 6"
      ],
      "relevance": "Prescribes conditions of service including punishments, requirement of concurrence of Labour Commissioner, appeals to State Government."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 136"
      ],
      "relevance": "Supreme Court may grant special leave to appeal from any tribunal."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed, and the impugned order passed by respondent No. 2 is set aside on the ground that it has been passed without jurisdiction. Parties to bear their own costs.",
    "relief_granted": "Impugned order set aside",
    "costs": "Parties to bear their own costs"
  },
  "key_quotes": [
    {
      "text": "The basic and the fundamental feature which is common to both the courts and the tribunals is that they discharge judicial functions and exercise judicial powers which inherently vest in a sovereign State.",
      "speaker": "court",
      "significance": "Defines test for tribunal under Art.136(1)"
    },
    {
      "text": "the power which the State Government exercises under R. 6(5) and R. 6(6) is a part of the States judicial power.",
      "speaker": "court",
      "significance": "Holds State Government as tribunal"
    },
    {
      "text": "such an order cannot be said to amount to any punishment at all it is an order of discharge served by the employer on his employee strictly within the terms of the employees conditions of service.",
      "speaker": "court",
      "significance": "Reason for appeal being incompetent"
    }
  ],
  "_case_id": "1964_308",
  "_label": 1,
  "_text_length": 79029,
  "_extracted_at": "2026-02-10T19:46:20.344245"
}