{
  "metadata": {
    "case_name": "State of Bombay v. Respondents",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar C.J."
    ],
    "case_number": "Civil Appeal No. 269 of 1962",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The four respondents are the owners of certain agricultural lands in Deokhope in Taluka Palghar in Maharashtra.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On the 23rd June, 1951, a notice was served by the appellant, State of Bombay (now Maharashtra), inviting the attention of the respondents to the fact that the agricultural lands had remained fallow since 1948-49, and intimating that the State would resume management under s.65 unless respondents took steps to cultivate.",
      "type": "procedural",
      "date": "1951-06-23",
      "source": "appellant"
    },
    {
      "id": "f3",
      "text": "Later, an enquiry was made under the orders of the Dy. Collector.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On the 30th December, 1951, the Dy. Collector passed an order under s.65 directing that the lands should be resumed by the Government for cultivation.",
      "type": "procedural",
      "date": "1951-12-30",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Thereafter, representations were made by the respondents to the Dy. Collector as a result of which about 8 acres and 30 gunthas of land were released on the ground that the owners had taken steps to cultivate that portion.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The order passed by the Dy. Collector in respect of other lands remained unaffected.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondent No. 1 approached the Collector by application dated 24th March, 1952, which was rejected.",
      "type": "procedural",
      "date": "1952-03-24",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The respondents moved the Revenue Department, but that effort also failed.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "The respondents filed suit on 23rd December, 1953 for declaration that the Dy. Collector's order was illegal and void, and for possession and mesne profits against the appellant.",
      "type": "procedural",
      "date": "1953-12-23",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Appellant disputed the claim, urged suit barred under s.63(I) and s.85, challenged correctness of allegations, stated enquiry proper, and civil court has no jurisdiction to consider propriety of Dy. Collector's conclusion.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f11",
      "text": "Trial Judge upheld appellant's contentions, held suit barred by ss.65(1) and 85, declaration not null and void, ss.65,66 not contravene Arts.19,31, grievance against enquiry not justified, dismissed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Respondents appealed to Bombay High Court in First Appeal No. 712 of 1955.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "High Court judgment and decree dated October 5, 1959, reversed trial court on ground that State could delegate power under s.65(1) but not duty to enquire under s.83, decreed respondents' suit with possession and mesne profits.",
      "type": "procedural",
      "date": "1959-10-05",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Appellant appealed to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f15",
      "text": "Enquiry under s.65 made by Talathi and Mamlatdar, reports submitted to Dy. Collector.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "What is the scope and effect of the provisions contained in section 65 read with s.83 of the Bombay Tenancy and Agricultural Lands Act, 1948? Specifically, can the State Government delegate its duty to make an enquiry incidental to the power to declare assumption of management of fallow lands?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Dy. Collector, as delegate, could direct subordinate officers (Talathi and Mamlatdar) to collect material for the enquiry, or does he have to hold the enquiry himself without sub-delegation?",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The view taken by the High Court that State can delegate power under s.65(1) but not duty to enquire is erroneous; s.83 authorizes delegation of all or any powers conferred, and power inseparable from incidental duty to enquire.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4",
        "f15"
      ],
      "legal_basis": "Sections 65(1), 83 Bombay Tenancy and Agricultural Lands Act, 1948"
    },
    {
      "id": "pa2",
      "text": "No sub-delegation by Dy. Collector; he directed subordinates to collect material (spot inspection, reports), then held enquiry himself on that material; form of enquiry discretionary.",
      "supporting_facts": [
        "f3",
        "f4",
        "f15"
      ],
      "legal_basis": "Section 65(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Before High Court: Lands not 'lands' as defined; condition of two years uncultivated not satisfied as delegation invalid; authority must hold enquiry itself, cannot delegate duty.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Sections 65(1), 83"
    },
    {
      "id": "ra2",
      "text": "Enquiry made by Talathi and Mamlatdar, not Dy. Collector; Dy. Collector cannot sub-delegate part of authority to hold enquiry.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": "Delegatus non potest delegare principle"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S.83 authorizes delegation of all or any powers; power under s.65(1) inseparable from duty to enquire as condition precedent; delegation of power necessarily includes incidental duties/functions; High Court view renders s.83 meaningless.",
      "addresses_issue": "i1",
      "key_observation": "Authority to delegate powers meaningless if duty to hold preliminary enquiry cannot be delegated."
    },
    {
      "id": "cr2",
      "text": "No opinion on appeal under s.86; but s.83 covers duties incidental and integrally connected with powers.",
      "addresses_issue": "i1",
      "key_observation": "Power coupled with duty, both delegable together."
    },
    {
      "id": "cr3",
      "text": "No sub-delegation; Dy. Collector collected relevant material via subordinates' reports (Talathi spot check to Mamlatdar to Dy. Collector), then held enquiry himself; form/mode of enquiry discretionary, no need for personal spot inspection.",
      "addresses_issue": "i2",
      "key_observation": "Mechanical collection of material by subordinates does not invoke delegatus non potest delegare."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "State Government can delegate under s.83 not only powers under s.65(1) but also incidental duties to hold enquiry.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Dy. Collector validly held enquiry by using material collected by subordinates; no invalid sub-delegation.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Edward Liso Mungoni v. Attorney-General of Northern Rhodesia",
      "citation": "1960 2 W.L.R. 389",
      "treatment": "followed",
      "relevance": "Power and duty interwoven under similar regulation; cannot split, delegate both together."
    },
    {
      "case_name": "Allingham and anr. v. Minister of Agriculture and Fisheries",
      "citation": "1948 1 All E.R. 780",
      "treatment": "distinguished",
      "relevance": "Delegatus non potest delegare applied to sub-committee delegation, but inapplicable here as no delegation to hold enquiry, only material collection."
    },
    {
      "case_name": "Nathubhai Gandabhai Desai v. The State of Bombay and Ors.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Similar contention on sub-delegation rejected by High Court."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Tenancy and Agricultural Lands Act, 1948 (No. 67 of 1948)",
      "sections": [
        "65",
        "65(1)",
        "66",
        "83",
        "63(I)",
        "85",
        "86"
      ],
      "relevance": "S.65(1) empowers declaration of assumption of management after enquiry if land uncultivated two years; s.83 allows delegation of powers (and held, incidental duties); bars to civil suit; amendment clarified delegation of duties."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "19",
        "31"
      ],
      "relevance": "Trial court rejected challenge that ss.65,66 contravene Arts.19,31."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the State's appeal, reversed High Court decree, upheld trial court's dismissal of respondents' suit; held delegation under s.83 valid including incidental enquiry duty, and no invalid sub-delegation by Dy. Collector.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the authority to delegate all or any of the powers which is expressly conferred on the State Government by s.83 would be rendered almost meaningless if the duty to hold an enquiry as a condition precedent for the exercise of the said authority cannot be delegated.\"",
      "speaker": "court",
      "significance": "Core reasoning on inseparability of power and duty."
    },
    {
      "text": "\"the power which can be delegated is inseparable from the enquiry which must precede the exercise of the power\"",
      "speaker": "court",
      "significance": "Explains why delegation includes duty."
    },
    {
      "text": "\"All that the Dy. Collector has done in the present case is to collect the relevant material, so that he can enquire into the question as to whether the lands are lying fallow or not. This procedure does not, in our opinion, involve the question of any delegation at all.\"",
      "speaker": "court",
      "significance": "Rejects sub-delegation argument."
    }
  ],
  "_case_id": "1964_188",
  "_label": 1,
  "_text_length": 18875,
  "_extracted_at": "2026-02-10T19:44:51.391610"
}