{
  "metadata": {
    "case_name": "Appellant Company v. Sales Tax Officer, Kanpur",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 830 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellants, a public limited company with registered office at Calcutta, was appointed sole agent for sale of goods manufactured by the Swadeshi Cotton Mills Company Ltd. with effect from October 5, 1946.",
      "type": "background",
      "date": "1946-10-05",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On March 20, 1952, the Sales Tax Officer, Kanpur issued a notice under s. 21 of the U.P. Sales Tax Act, 1948 calling upon the appellant Company to file a return of its turnover for the assessment year 1948-49 on the ground that the turnover had escaped assessment.",
      "type": "procedural",
      "date": "1952-03-20",
      "source": "sales tax officer"
    },
    {
      "id": "f3",
      "text": "On March 31, 1952, the Sales Tax Officer made a best judgment assessment and determined the taxable turnover of the appellant Company at Rs. 50 lakhs for the year 1948-49 and determined the appropriate tax liability.",
      "type": "procedural",
      "date": "1952-03-31",
      "source": "sales tax officer"
    },
    {
      "id": "f4",
      "text": "In the appeal to the Judge (Appeals) Sales Tax, the order passed by the Sales Tax Officer was set aside, that authority holding that the appellant Company was not a dealer within the meaning of s. 2(c) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "By order dated March 28, 1955, the Judge (Revisions) Sales Tax set aside the order of the appellate authority and remanded the case to the Sales Tax Officer for fresh assessment, holding it necessary to determine the ownership of the goods at the time of their sale.",
      "type": "procedural",
      "date": "1955-03-28",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "The Sales Tax Officer then issued a notice calling upon the appellant Company to produce its books of account and other relevant documents on July 23, 1955 for the purpose of assessment for the year 1948-49.",
      "type": "procedural",
      "date": "1955-07-23",
      "source": "sales tax officer"
    },
    {
      "id": "f7",
      "text": "The appellant Company contended that as the original assessment under s. 21 had been set aside by the Judge (Revisions) Sales Tax, no proceeding in connection with that assessment was pending and re-assessment was barred because more than three years had elapsed since the end of the year of assessment.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "The Sales Tax Officer rejected the contention of the appellant Company and insisted that the books of account and other documents be produced as directed earlier.",
      "type": "procedural",
      "date": null,
      "source": "sales tax officer"
    },
    {
      "id": "f9",
      "text": "The appellant Company petitioned on September 2, 1955 to the High Court of Allahabad under Art. 226 of the Constitution for a writ in the nature of prohibition restraining the Sales Tax Officer, Kanpur, from proceeding with the assessment for 1948-49 and for a writ of certiorari quashing the order dated September 2, 1955 of the Sales Tax Officer and the proceedings taken for re-assessment.",
      "type": "procedural",
      "date": "1955-09-02",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Chaturvedi J. held that assessment sought to be made by the Sales Tax Officer pursuant to the order of the Judge (Revisions) Sales Tax was clearly barred by the law of limitation prescribed by s. 21 of the U.P. Sales Tax Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "The order passed by Chaturvedi J. was reversed in appeal by a Division Bench of the Allahabad High Court by judgment dated March 3, 1960, holding that the Sales Tax Officer was competent in view of the order of remand to commence fresh assessment proceedings and the period of limitation under s. 21 did not apply.",
      "type": "procedural",
      "date": "1960-03-03",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Against the order passed by the High Court, this appeal has been preferred with special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the period of limitation prescribed by s. 21 of the U.P. Sales Tax Act, 1948 applies to re-assessment proceedings initiated pursuant to a direction or remand order by the revisional authority under s. 10.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the amendment to s. 21 by U.P. Act 19 of 1956, which excludes limitation for assessments in consequence of orders under ss. 9, 10 or 11, applies retrospectively to the proceedings in question.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Re-assessment was barred by limitation under s. 21 as more than three years had elapsed since the end of the assessment year 1948-49, and no proceeding was pending after the appellate order set aside the original assessment.",
      "supporting_facts": [
        "f3",
        "f4",
        "f7"
      ],
      "legal_basis": "s. 21 U.P. Sales Tax Act, 1948 (original)"
    },
    {
      "id": "pa2",
      "text": "Even if s. 21 as amended applies, it only applies to proceedings pending at the date of amendment, but no proceeding was pending as the revisional order directing fresh assessment was itself invalid due to expiry of limitation.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "s. 21 U.P. Sales Tax Act as amended by Act 19 of 1956"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The Sales Tax Officer was competent to commence fresh assessment proceedings pursuant to the remand order of the Judge (Revisions) Sales Tax under ss. 9 and 10, and the period of limitation under s. 21 does not apply to such proceedings directed by superior authority.",
      "supporting_facts": [
        "f5",
        "f6",
        "f11"
      ],
      "legal_basis": "ss. 9, 10 U.P. Sales Tax Act, 1948"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s. 21 imposes a restriction on the power of the Sales Tax Officer to assess escaped turnover within three years, and this applies even when acting pursuant to directions of appellate or revisional authority, following the principle in Commissioner of Income-tax v. Khemchand Ramdas.",
      "addresses_issue": "i1",
      "key_observation": "The section does not expressly or impliedly limit the period only to suo motu actions."
    },
    {
      "id": "cr2",
      "text": "However, s. 21 was amended by Act 19 of 1956 with retrospective effect from the commencement of the principal Act, excluding limitation for assessments made in consequence of or to give effect to findings or directions in orders under ss. 9, 10 or 11.",
      "addresses_issue": "i2",
      "key_observation": "The amended s. 21(2) proviso explicitly states that nothing limiting time applies to such assessments."
    },
    {
      "id": "cr3",
      "text": "The revisional authority had jurisdiction under s. 10(3) to pass the remand order, and proceedings were pending before the Sales Tax Officer pursuant to that direction; under the retrospectively amended s. 21, there is no time bar.",
      "addresses_issue": "i2",
      "key_observation": "Even assuming error in the revisional order, it was valid unless set aside, and amendment deems the provision operative from the start."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under s. 21 of the U.P. Sales Tax Act as amended retrospectively by Act 19 of 1956, no period of limitation applies to assessment or re-assessment made in consequence of or to give effect to any finding or direction contained in an order under s. 9, 10 or 11.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The Sales Tax Officer is competent to proceed with fresh assessment for 1948-49 pursuant to the direction of the Judge (Revisions) Sales Tax, without bar of limitation.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Bombay Presidency and Aden v. Khemchand Ramdas",
      "citation": "1938 L.R. 65 I.A. 236",
      "treatment": "followed",
      "relevance": "Principle that limitation for re-assessment applies even pursuant to directions of superior authority; sections exhaustive as to circumstances and time for fresh assessments."
    }
  ],
  "statutes_cited": [
    {
      "name": "U.P. Sales Tax Act, 1948",
      "sections": [
        "s. 2(c)",
        "s. 9",
        "s. 10",
        "s. 21 (original and as amended)"
      ],
      "relevance": "Governs appeals, revisions, escaped assessments and limitation; amended s. 21 excludes time limit for assessments pursuant to orders under ss. 9, 10."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Basis for High Court writ petition seeking prohibition and certiorari."
    },
    {
      "name": "U.P. Sales Tax (Amendment) Act, 1956 (Act 19 of 1956)",
      "sections": [
        "s. 15"
      ],
      "relevance": "Substitutes s. 21 with retrospective effect, excluding limitation for certain reassessments."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed and the order of the High Court is confirmed. The Sales Tax Officer is entitled to proceed with fresh assessment for 1948-49 pursuant to the revisional remand order, as no limitation applies under the retrospectively amended s. 21.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In our view the High Court was in error in so limiting the operation of s. 21.\"",
      "speaker": "court",
      "significance": "Rejects High Court's view that s. 21 limitation only for suo motu actions."
    },
    {
      "text": "\"The Legislature has given a clear retrospective operation to the amended section as from the date on which the principal Act came into operation.\"",
      "speaker": "court",
      "significance": "Explains why amendment saves the reassessment proceedings."
    },
    {
      "text": "\"nothing contained in s. 21 which limits the time within which any assessment or re-assessment is to be made, shall apply to an assessment or re-assessment made in consequence of, or to give effect to, any finding or direction contained in an order under section 9, 10, or 11.\"",
      "speaker": "court",
      "significance": "Key proviso in amended s. 21 resolving the limitation issue."
    }
  ],
  "_case_id": "1964_143",
  "_label": 0,
  "_text_length": 15950,
  "_extracted_at": "2026-02-10T19:44:58.253365"
}