{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. R. D. Aggarwal & Co.",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeals Nos. 808 and 809 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "R. D. Aggarwal Company (assessees) are a registered firm having place of business at Amritsar, Punjab, carrying on business as importers and commission agents or non-resident exporters.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Assessees communicate orders canvassed by them from dealers in Amritsar to non-resident exporters for acceptance; if contract results and price paid by Amritsar dealer to non-resident exporter, assessees entitled to commission varying between 1 1/2 and 2 1/2% of the price.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Two non-resident exporters: Comptoirs Lainiers Osterieth s.a. Anvers Belgium and Filaturae Tessitura Di Tollengno Biella Italy, exporters and manufacturers of worsted woollen yarn.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "By letter dated March 24, 1951, assessees appointed sole agents for Italian Company for sale of worsted woollen yarns in Indian territories, terminable by one month's notice; to maintain existing customers, secure new conforming to general terms, receive 2 1/2 per cent commission on net cash amounts from accepted business concluded by mediation of assessees or directly by Italian Company.",
      "type": "material",
      "date": "1951-03-24",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Belgian Company appointed assessees their representatives for whole of India on condition that assessees did not represent any other Belgian Mill or yarn producer and did not sell Belgian yarn in India on their own account.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "In assessment year 1952-53, Income-tax Officer, C Ward, Amritsar computed income of assessees by adding Rs. 54,558 being 5% of net total value of yarn sold by non-resident companies to Indian merchants in previous year, due to business connections between non-residents and assessees.",
      "type": "procedural",
      "date": null,
      "source": "income-tax_officer"
    },
    {
      "id": "f7",
      "text": "Orders of Income-tax Officer confirmed in appeal by Appellate Assistant Commissioner and by Income-tax Appellate Tribunal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Income-tax Appellate Tribunal submitted statement of case to Punjab High Court on two questions: (1) Whether relationship between assessee and non-resident fell within 'business connection' in S.42(1); (2) If yes, whether profits accrued or arose or deemed to accrue/arise to non-resident due to business connection during previous year.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "Punjab High Court answered first question in negative, declined to answer second; judgment dated October 5, 1960.",
      "type": "procedural",
      "date": "1960-10-05",
      "source": "high_court"
    },
    {
      "id": "f10",
      "text": "Commissioner of Income-tax appealed to Supreme Court with special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Contracts for sale of goods took place outside taxable territories, price received by non-residents outside, delivery given outside taxable territories.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "No operations such as procuring raw materials, manufacture, sale or delivery against price took place within taxable territories; assessees merely procured orders from Amritsar merchants for purchase from non-residents.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Orders procured by assessees were offers which assessees had no authority to accept on behalf of non-residents.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the relationship between the assessee and the non-resident fell within the meaning of the expression 'business connection' as used in S. 42(1) of the Indian Income-tax Act?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "If yes to i1, whether on the facts any profits or gains accrued or arose or could be deemed to have accrued or arisen to the non-resident on account of the business connection with the assessee during the previous year under consideration.",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "There subsisted business connections between the non-resident exporters and the assessees, justifying addition of 5% of net total value of yarn sold to Indian merchants as income.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Section 42(1) of Indian Income-tax Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No business connection existed between assessees and non-residents, as assessees merely procured orders which were offers not accepted by them, with all contracts, payments and deliveries outside taxable territories.",
      "supporting_facts": [
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Business connection means something more than business; involves relation between business of non-resident yielding profits and activity in taxable territories contributing directly or indirectly to earning those profits; predicates element of continuity; stray/isolated transaction normally not business connection.",
      "addresses_issue": "i1",
      "key_observation": "Relation must be real and intimate, through or from which income accrues or arises directly or indirectly to non-resident."
    },
    {
      "id": "cr2",
      "text": "Reviewed precedents: Remington (connection via goodwill transfer, sales); Currimbhoy (isolated loan not connection); Bangalore Woollen (continuous purchases/sales by agents in territories); Abdullabhai (commission agency with continuity); Anglo-French (purchases by constituted agent); Hira Mills (mere order canvassing, sales outside, no connection).",
      "addresses_issue": "i1",
      "key_observation": "Distinction: mere canvassing offers vs. actual purchases/sales/operations in territories."
    },
    {
      "id": "cr3",
      "text": "On facts, assessees' activity of procuring orders resulted in offers to non-residents, not accepted by assessees; no operations in territories; no real/intimate relation contributing to non-resident's profits.",
      "addresses_issue": "i1",
      "key_observation": "Activity not as agents for sale or procuring materials; absent intimate trading relation."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "No business connection between non-resident companies and assessees within meaning of S.42(1); second question does not arise.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax v. Remington Typewriters Co. Bombay Ltd.",
      "citation": "L.R. 58 I.A. 42",
      "treatment": "followed",
      "relevance": "Business connection existed via goodwill transfer, shares, dividends, machines sent for sale."
    },
    {
      "case_name": "Commissioner of Income-tax Bombay Presidency and Aden v. Currimbhoy Ebrahim and Sons Ltd.",
      "citation": null,
      "treatment": "followed",
      "relevance": "Isolated loan transaction not business connection."
    },
    {
      "case_name": "Bangalore Woollen, Cotton and Silk Mills Co. Ltd. v. Commissioner of Income-tax, Madras",
      "citation": "1950 18 I.T.R. 423",
      "treatment": "followed",
      "relevance": "Managing agents' continuous purchases in territories, collections, banking constituted business connection."
    },
    {
      "case_name": "Abdullabhai Abdul Kadar v. Commissioner of Income-tax Bombay City",
      "citation": "1952 22 I.T.R. 241",
      "treatment": "followed",
      "relevance": "Commission agency with continuity is business connection; not requiring exclusivity; element of continuity needed."
    },
    {
      "case_name": "Anglo-French Textile Company Ltd. v. Commissioner of Income-tax, Madras",
      "citation": "1953 S.C.R 454",
      "treatment": "followed",
      "relevance": "Constituted agent's purchases of cotton in territories created business connection."
    },
    {
      "case_name": "Hira Mills Ltd., Cawnpore v. Income-tax Officer, Cawnpore",
      "citation": "1946 14 I.T.R. 417",
      "treatment": "followed",
      "relevance": "Mere canvassing orders by brokers, sales/contracts outside territories, no business connection."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "Section 42(1)",
        "Section 40(2)",
        "Section 43(1)",
        "Section 4(1)"
      ],
      "relevance": "S.42(1) deems income from business connection in taxable territories taxable; S.40(2) machinery for taxing agent; S.43 appoints statutory agent; S.4 charges income accruing/arising in territories."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court held no business connection under S.42(1) between assessees and non-resident exporters; appeals by Commissioner of Income-tax dismissed.",
    "relief_granted": "None; High Court opinion upheld.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"The expression business connection undoubtedly means something more than business. A business connection in S. 42 involves a relation between a business carried on by a non-resident which yields profits or gains and some activity in the taxable territories which contributes directly or indirectly to the earning of those profits or gains.\"",
      "speaker": "court",
      "significance": "Defines 'business connection' under S.42(1)"
    },
    {
      "text": "\"It predicates an element of continuity between the business of the non-resident and the activity in the taxable territories a stray or isolated transaction is normally not to be regarded as a business connection.\"",
      "speaker": "court",
      "significance": "Emphasizes continuity requirement"
    },
    {
      "text": "\"A relation to be a business connection must be real and intimate, and through or from which income must accrue or arise whether directly or indirectly to the non-resident.\"",
      "speaker": "court",
      "significance": "Sets threshold for business connection"
    }
  ],
  "_case_id": "1964_289",
  "_label": 0,
  "_text_length": 22383,
  "_extracted_at": "2026-02-10T19:46:20.773342"
}