{
  "metadata": {
    "case_name": "Appellant (Tea Estate Owner) v. State of Travancore-Cochin",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar C.J.",
      "Wanchoo J.",
      "Rajagopala Ayyangar J.",
      "Sikri J.",
      "Shah J."
    ],
    "case_number": "Civil Appeals Nos. 678 and 679 of 1963",
    "date_of_judgment": "1964-03-20"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant owns several estates wherein inter alia tea is grown and was assessed to sales-tax in respect of the tea sold by it during the years 1954-55 and 1955-56, by the Sales Tax Officer, First Circle, Quilon in the State of Travancore-Cochin by his order dated December 23, 1956.",
      "type": "procedural",
      "date": "1956-12-23",
      "source": "lower_court"
    },
    {
      "id": "f2",
      "text": "In the taxable turnover on which sales tax was computed by the assessing authority were included two items which are the subject of complaint in these two appeals which relate to these two years of assessment.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant claimed that certain sales of its tea which were conducted by auction at Fort Cochin-a place which at the relevant date was in the Madras State, were sales outside the Travancore-Cochin State and consequently these sales were exempted from taxation by the State of Travancore-Cochin under Art. 286(1)(a) of the Constitution.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Sales Tax Officer rejected this contention and included the sum involved in these sales in the taxable turnover.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Appeal to the Appellate Assistant Commissioner failed, this authority holding that as the tea sold was, at the date of the auction, admittedly in godowns in Willingdon Island in the State of Travancore-Cochin, the sales must be deemed to have taken place within taxing State by virtue of a provision in the State Sales Tax Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Further appeal to the Sales Tax Appellate Tribunal which upheld the appellants contention and set aside the assessment in so far as it included the turnover relating to the auction sales of tea held at Fort Cochin, this turnover amounting to Rs. 56,43,184/11/ in regard to the assessment year 1954-55 and Rs. 62,13,604/3/ in regard to the assessment year 1955-56 and remanded the case for fresh disposal by excluding these sums from the computation of the taxable turnover.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Revision petition filed before the High Court by the State under s. 15(b) of the General Sales Tax Act of Travancore-Cochin dated April 4, 1961, and the learned Judges allowed the Revision and upheld the order of the assessing officer and the Appellate Commissioner holding the turnover represented by these auction sales to be validly taxable under the State law relating to sales tax.",
      "type": "procedural",
      "date": "1961-04-04",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The sales of teas were concluded at Fort Cochin and the goods were stocked in godowns situated in the Travancore Cochin State. The deliveries of the goods were also made to the buyers from the godowns in Willingdon island in the Travancore Cochin State.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellate Tribunal recorded a finding that the property in the goods sold passed at Fort Cochin on the fall of the hammer at the auction.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "High Court proceeded on the basis that the property in the goods passed at Fort Cochin.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "In the revision application to High Court, question whether property passed at Fort Cochin was raised but argument proceeded on basis of Tribunal's finding that property passed on fall of hammer at Fort Cochin.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the auction sales of tea at Fort Cochin (Madras State), where property passed on fall of hammer, but goods were physically in godowns in Travancore-Cochin State at time of contract, constitute 'outside sales' under Art. 286(1)(a) and are exempt from tax by Travancore-Cochin.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Explanation 2 to s.2(j) of General Sales Tax Act deeming sale to take place in State if goods actually in State at time of contract overrides Art. 286(1)(a).",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sales by auction at Fort Cochin are outside the Travancore-Cochin State as property passed at Fort Cochin in Madras State, exempted under Art. 286(1)(a).",
      "supporting_facts": [
        "f3",
        "f9"
      ],
      "legal_basis": "Art. 286(1)(a); general law of sale of goods (property passes on fall of hammer)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sales deemed to take place in Travancore-Cochin as tea was in godowns in Willingdon Island at date of auction, per Explanation 2 to s.2(j) of State Sales Tax Act.",
      "supporting_facts": [
        "f5",
        "f8"
      ],
      "legal_basis": "General Sales Tax Act s.2(j) Explanation 2; Deputy Commissioner v. A.V. Thomas Co."
    },
    {
      "id": "ra2",
      "text": "Property in goods sold by auction at Fort Cochin did not pass at Fort Cochin but at Willingdon Island when delivered.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Though cl.(a) to Explanation 2 to s.2(j) deems sale to take place in State if goods in State at time of contract, s.26 and Art. 286(1)(a) prohibit tax on sales outside State. Situs determined by passing of property under general sales law.",
      "addresses_issue": "i2",
      "key_observation": "State cannot tax sale outside State even if goods physically present."
    },
    {
      "id": "cr2",
      "text": "Following India Copper Corp and A.V. Thomas (reversing Kerala HC), where Explanation inapplicable, passing of property determines if sale inside or outside State. Property passed at Fort Cochin, so outside sale quoad Travancore-Cochin.",
      "addresses_issue": "i1",
      "key_observation": "Title passed at Fort Cochin, not disputed; goods delivered not for consumption in Travancore-Cochin."
    },
    {
      "id": "cr3",
      "text": "Declined to allow respondent to challenge Tribunal's finding on passing of property as not urged before High Court.",
      "addresses_issue": "i1",
      "key_observation": "Point not argued before High Court."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Auction sales at Fort Cochin where property passes there are outside sales under Art. 286(1)(a) notwithstanding goods physically in Travancore-Cochin and state deeming provision.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "State cannot tax non-Explanation sales where property passes outside State.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "India Copper Corporation Ltd. v. State of Bihar",
      "citation": "1961 2 S.C.R. 276",
      "treatment": "followed",
      "relevance": "Passing of property determines situs of sale for Art. 286(1)(a); only State where property passes can tax non-Explanation sale."
    },
    {
      "case_name": "A.V. Thomas & Co. Ltd. v. Deputy Commissioner of Agricultural Income-tax and Sales-tax, Trivandrum",
      "citation": "1963 Supp. 2 S.C.R. 608",
      "treatment": "followed",
      "relevance": "Reversed Kerala HC; identical facts, title passed at Fort Cochin makes sale outside Travancore-Cochin."
    },
    {
      "case_name": "Deputy Commissioner of Agricultural Income-tax and Sales-tax, Trivandrum v. A.V. Thomas & Co.",
      "citation": "I.L.R. 1960 Kerala 1395",
      "treatment": "overruled",
      "relevance": "Kerala HC view that physical presence deems situs upheld state tax; reversed by SC."
    },
    {
      "case_name": "Burmah Shell Oil Storage and Distributing Co. of India Ltd. v. Commercial Tax Officer",
      "citation": null,
      "treatment": "referred",
      "relevance": "Principle that passing of property fastened on for situs."
    },
    {
      "case_name": "Poppat Lal Shah v. State of Madras",
      "citation": "1953 S.C.R. 677",
      "treatment": "referred",
      "relevance": "Territorial nexus under 1935 Act allowed tax on incomplete sales."
    },
    {
      "case_name": "Tata Iron & Steel Co. Ltd. v. State of Bihar",
      "citation": "1958 S.C.R. 1356",
      "relevance": "Territorial nexus under 1935 Act."
    }
  ],
  "statutes_cited": [
    {
      "name": "General Sales Tax Act (Travancore-Cochin) Act XI of 1125 M.E. 1950",
      "sections": [
        "s. 2(j)",
        "s. 15(b)",
        "s. 26"
      ],
      "relevance": "Defines 'sale'; Expl. 2 deems situs based on goods location; s.26 incorporates Art. 286(1); revision under s.15(b)."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 286(1)(a) and Explanation"
      ],
      "relevance": "Prohibits state tax on outside sales; Explanation deems delivery State for consumption; inapplicable here."
    },
    {
      "name": "Sale of Goods Act",
      "sections": [],
      "relevance": "Determines passing of property (on fall of hammer for ascertained goods)."
    },
    {
      "name": "Central Sales Tax Act 74 of 1956",
      "sections": [
        "s. 4(2)"
      ],
      "relevance": "Post-6th Amendment, deems situs if goods in State at contract time; recognizes territorial nexus."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed; judgment and order of Kerala High Court reversed; order of Sales Tax Appellate Tribunal restored excluding auction turnover from taxable turnover.",
    "relief_granted": "Exclusion of Rs. 56,43,184/11/ (1954-55) and Rs. 62,13,604/3/ (1955-56) from taxable turnover; remand for fresh assessment.",
    "costs": "Appellant entitled to costs in Supreme Court and High Court (one hearing fee)."
  },
  "key_quotes": [
    {
      "text": "\"the passing of property within the State that is intended to be fastened on, for the purpose of determining, whether the sale in question is inside or outside the State\"",
      "speaker": "court",
      "significance": "Core principle from India Copper Corp adopted for Art. 286(1)(a) situs."
    },
    {
      "text": "\"It has been found-and it has not been disputed that the title to the goods in the present case passed at Fort Cochin\"",
      "speaker": "court",
      "significance": "From A.V. Thomas case; admits factual basis for outside sale."
    },
    {
      "text": "\"the State other than a delivery-cum-consumption State which could tax a non-explanation sale could only be that State in which the property in the goods passes.\"",
      "speaker": "court",
      "significance": "Explains tax power limited to property-passing State."
    }
  ],
  "_case_id": "1964_104",
  "_label": 1,
  "_text_length": 25388,
  "_extracted_at": "2026-02-10T19:44:23.824281"
}