{
  "metadata": {
    "case_name": "Writ Petition No. 175 of 1963 (Petitioner v. State of Rajasthan)",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "WANCHOO, J."
    ],
    "case_number": "Writ Petition No. 175 of 1963",
    "date_of_judgment": "1964-03-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petitioner was a head-constable in the former State of Ajmer and was duly included in the approved list of head-constables to be promoted to the rank of Sub-Inspectors of Police in 1955 and was appointed on July 14, 1956 as officiating Sub-Inspector of Police.",
      "type": "background",
      "date": "1955-07-14",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "On November 1, 1956, the former State of Ajmer merged in the State of Rajasthan under the States Reorganisation Act. The petitioner was absorbed in the police service of the State of Rajasthan and a fresh order posting him as officiating Sub-Inspector in Rajasthan was passed on November 1, 1956.",
      "type": "background",
      "date": "1956-11-01",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The petitioner was reverted in April 1957 when a permanent Sub Inspector returned to the range as he was the juniormost approved head-constable in the Ajmer range, though in other ranges there were many approved head-constables who were junior to him but they continued to officiate as Sub-Inspectors.",
      "type": "material",
      "date": "1957-04",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The whole police force of the State is generally under the administrative control of the Inspector General of Police, who is assisted by six Deputy Inspectors General of Police, each Deputy Inspector General of Police being in-charge of administration in one of the six ranges into which the whole State has been divided for administrative convenience.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Sub-Inspectors in different ranges belong to one cadre and one service and are governed by the same rules and regulations and the same conditions of service as regards pay, leave, pension, promotion, disciplinary action etc. The Sub-Inspectors of Police are also transferable from one range to another.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Practice in Rajasthan: treating the members of police force serving at a particular point of time in each range as a separate and distinct unit for purposes of making promotions and reversions. If a vacancy in the cadre of Sub-Inspectors of Police arose in one range, only the seniormost head-constables in that range were considered for promotion to that vacancy.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "The entire area of the State is divided into four ranges each under one Deputy Inspector General of Police. Besides these four ranges there are two other units of the force which are separate administrative units: 1) Criminal Intelligence Department and Intelligence Branch, and 2) Railway and Crime Branch.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Initial recruitment to the police force is made within a district in the rank of constable. These constables are posted in their respective districts after training.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Promotion from constable to head-constable is districtwise by the Superintendent of Police. Promotion from head-constable to Sub-Inspector is by the Deputy Inspector General of Police, considering all head-constables in the range as one group, preparing an approved list on seniority-cum-merit.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Promotion from Sub-Inspector to Inspector is on a State-wise basis made by the Inspector General of Police.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Transfers from one district to another or from one range to another are rare, policy is to minimize transfers of subordinate staff drawing less than Rs. 250/- p.m. outside home districts, preferably confine to division. Government Order issued in March 1955.",
      "type": "disputed",
      "date": "1955-03",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "There are about 20,000 constables, 3,000 head-constables and 1,000 Sub-Inspectors of Police in the whole of the State.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "Under s. 2 of the Police Act, No. 5 of 1861, the entire police establishment under a State Government is for the purposes of the Act, deemed to be one police force.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the system prevailing in the State of Rajasthan for promotion of head-constables to the post of Sub-Inspectors of Police on a rangewise basis is violative of Arts. 14 and 16 of the Constitution.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether frequent inter-range transfers make the rangewise promotion system result in denial of equal opportunity and equality before the law.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sub-Inspectors in different ranges belong to one cadre and one service, transferable inter-range, similarly situated; rangewise promotions deny equal opportunity under Arts. 14 and 16.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Arts. 14 and 16 of the Constitution"
    },
    {
      "id": "pa2",
      "text": "Free and frequent inter-range transfers (3-4 per day) produce inequalities in promotions and reversions, haphazard seniority.",
      "supporting_facts": [
        "f3",
        "f11"
      ],
      "legal_basis": "Arts. 14 and 16 of the Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Three-tier promotion system (districtwise constable to head-constable, rangewise head-constable to SI, statewide SI to Inspector) evolved for administrative efficiency and local knowledge.",
      "supporting_facts": [
        "f7",
        "f8",
        "f9",
        "f10",
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Transfers are rare per government policy (March 1955 order), not frequent; system does not deny equality.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Police Act s.2 deems one force, but organization into ranges/districts necessary for efficiency; local knowledge conducive to efficiency for lower ranks dealing directly with public.",
      "addresses_issue": "i1",
      "key_observation": "Three-tier system valid for administrative efficiency and local knowledge."
    },
    {
      "id": "cr2",
      "text": "Cannot strike down system because occasionally junior may promote before senior across ranges; balances efficiency considerations.",
      "addresses_issue": "i1",
      "key_observation": "System not violative of Arts. 14/16 despite possible hardships."
    },
    {
      "id": "cr3",
      "text": "System not to be struck down on supposition of abuse via transfers; abuse can be challenged separately.",
      "addresses_issue": "i2",
      "key_observation": "Transfers possible for exigencies, not illegal."
    },
    {
      "id": "cr4",
      "text": "No evidence of free/frequent transfers; government policy restricts them, especially for low-paid staff.",
      "addresses_issue": "i2",
      "key_observation": "Petitioner's allegation of routine transfers denied and unsupported."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rangewise promotion system for head-constables to Sub-Inspectors does not deny equality before the law or equality of opportunity in employment under Arts. 14 and 16.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "No policy of free and frequent inter-range transfers exists, insufficient material to hold system results in inequalities.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32",
        "Article 14",
        "Article 16"
      ],
      "relevance": "Petition under Art. 32 challenging rangewise promotions as violative of Arts. 14 and 16"
    },
    {
      "name": "States Reorganisation Act",
      "sections": [],
      "relevance": "Merger of Ajmer into Rajasthan on Nov 1, 1956"
    },
    {
      "name": "Police Act, 1861",
      "sections": [
        "Section 2"
      ],
      "relevance": "Deems entire police establishment as one police force, but allows sub-division for administration"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The petition challenging the rangewise promotion system in Rajasthan police as violative of Arts. 14 and 16 is dismissed, as the system is justified for administrative efficiency and local knowledge, with no evidence of frequent transfers causing inequality.",
    "relief_granted": "None",
    "costs": "No order as to costs"
  },
  "key_quotes": [
    {
      "text": "If the State has evolved the three tier system of giving promotion from constables to head-constables, from head-constables to Sub-Inspectors and from Sub-Inspectors to Inspectors, which is done in the interest of administrative efficiency of the police force, it cannot in our opinion be said that such a system should be struck down",
      "speaker": "court",
      "significance": "Core reasoning upholding the promotion system"
    },
    {
      "text": "A system like this cannot be struck down on the ground that it may be abused. In case of abuse in this wholesale manner a case may arise for striking down the abuse and not the system.",
      "speaker": "court",
      "significance": "Rejects hypothetical abuse argument"
    }
  ],
  "_case_id": "1964_24",
  "_label": 0,
  "_text_length": 19654,
  "_extracted_at": "2026-02-10T19:42:14.745113"
}