{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Assessee-firm (Managing Agents of Palani Andavar Mills Ltd.)",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Civil Appeals Nos. 1099-1101 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee-firm was originally constituted by a deed of partnership dated June 1, 1934 with six partners: G. Venkataswami Naidu (2 annas), G. T. Narayanaswamy Naidu (2 annas), G. T. Krishnaswamy Naidu (2 annas), M. A. Palaniappa Chettiar (5 annas), R. Guruswamy Naidu (2 1/2 annas), K. Venkatasubba Naidu (2 1/2 annas).",
      "type": "background",
      "date": "1934-06-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Share of G. Venkataswami Naidu transferred to his son Vidyasagar; share of M. A. Palaniappa Chettiar purchased by R. Guruswamy Naidu, resulting in Guruswamy Naidu having 7 1/2 annas share.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Guruswamy Naidu and Venkatasubba Naidu belonged to a Hindu undivided family (HUF); beneficial interest in their shares belonged to the HUF, and the family was assessed on income from those shares.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On August 24, 1950, the HUF was divided; partition deed divided 10 annas share as: R. Guruswamy Naidu (2 annas), Rudrappa (minor son of No.1) (1 anna), Venkataramana (minor son of No.1) (1 anna), Subba Naidu (2 annas), Venkatasubba Naidu (1-4 annas), Rudrappa Naidu (1-4 annas), Jagannatha Naidu (1-4 annas).",
      "type": "material",
      "date": "1950-08-24",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On November 30, 1950, new partnership deed executed allotting shares: R. Guruswamy Naidu (7 1/2 annas), R. Venkatasubba Naidu (2 1/2 annas), G. T. Narayanaswamy Naidu (2 annas), G. T. Krishnaswamy Naidu (2 annas), Vidyasagar (2 annas).",
      "type": "material",
      "date": "1950-11-30",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Beneficial interest in 10 annas share originally belonged to HUF; before partition, beneficial interest in undivided family; after partition, in divided members including Guruswamy and Venkatasubba.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Assessee-firm presented partnership deed dated November 30, 1950 to Income-tax Officer for registration for assessment years 1952-53, 1953-54, 1954-55; duly registered under s. 26A of Indian Income-tax Act, 1922.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Guruswamy Naidu and Venkatasubba Naidu assessed as partners on shares shown in partnership deed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Income-tax Appellate Tribunal held in respect of two assessments that Guruswamy and Venkatasubba liable only on shares in partition deed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Commissioner of Income-tax under s. 33B cancelled registration on ground that partnership deed did not show correct shares of partners.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellate Tribunal confirmed Commissioner's order for 3 assessment years.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Questions referred to Madras High Court: (1) Whether order of Commissioner under s. 33B cancelling registration lawful? (2) If yes, whether firm registrable under s. 26A?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Madras High Court held partnership genuine, partition affected accountability to family members but not relationship qua partnership; answered first question negative, second affirmative.",
      "type": "procedural",
      "date": "1961-01-24",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the order of the Commissioner under s. 33B cancelling the registration of the firm for the three years 1952-53, 1953-54 and 1954-55 is lawful.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "If the answer to the above question is in the affirmative, whether the firm is registrable under s. 26A for the aforesaid assessment years.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Partnership deed did not specify correct shares of Guruswamy Naidu and Venkatasubba Naidu; they were entitled only to 2 annas and 1 anna 4 pies share per partition deed, but shown as 7 1/2 annas and 2 1/2 annas respectively; thus not registrable under s. 26A.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": "s. 26A of the Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Partition of family's beneficial interest in partnership business has no relevance to registration under the Act; authorities concerned only with validity and genuineness of partnership deed executed by partners, not dealings of partner with third parties.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Held in Commissioner of Income-tax, Ahmedabad v. Ms. A. Abdul Rahim Co. that ITO can reject registration if firm not genuine or valid or application not complied with rules.",
      "addresses_issue": "i1",
      "key_observation": "Here admittedly a genuine partnership; cannot be suggested invalid."
    },
    {
      "id": "cr2",
      "text": "Distinction between partnership (contract regulating rights/liabilities of partners), joint family (status under Hindu law), and income-tax assessment; contract of partnership has no concern with obligations of partners to others re shares.",
      "addresses_issue": "i1",
      "key_observation": "Partner may be karta, trustee, sub-partner, representative, benamidar; functions personally qua partnership, representatively qua third parties."
    },
    {
      "id": "cr3",
      "text": "Guruswamy could enter partnership taking 10 annas share though only 2 annas as per family; answerable to family but does not affect validity/genuineness.",
      "addresses_issue": "i1",
      "key_observation": "Same if two members represent divided family."
    },
    {
      "id": "cr4",
      "text": "Shares in partnership deed correct per its terms; cites Charandas Haridas v. CIT: partition affects family under Hindu law but not partner position under partnership law.",
      "addresses_issue": "i1",
      "key_observation": "Division does not change position vis-a-vis other partners."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Partnership deed genuine; shares of Guruswamy Naidu and Venkatasubba Naidu correct per deed; partition irrelevant to registration under s. 26A; High Court gave correct answers.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Cancellation under s. 33B not lawful; firm registrable under s. 26A.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Ahmedabad v. Ms. A. Abdul Rahim Co.",
      "citation": "1965 2 S.C.R. 12",
      "treatment": "followed",
      "relevance": "ITO can reject registration if firm not genuine/valid or non-compliance; applied here as partnership genuine."
    },
    {
      "case_name": "Charandas Haridas v. Commissioner of Income-tax, Bombay",
      "citation": "1960 3 S.C.R. 296",
      "treatment": "followed",
      "relevance": "Partition under Hindu law affects family but not partner's position qua partnership; supports that family division does not impact partnership shares."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 26A",
        "s. 33B"
      ],
      "relevance": "s. 26A for registration of firm; s. 33B for cancellation by Commissioner if deed does not show correct shares."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals dismissed; High Court's answers upheld that cancellation under s. 33B not lawful and firm registrable under s. 26A.",
    "relief_granted": "Registration upheld",
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "\"A contract of partnership has no concern with the obligation of the partners to others in respect of their shares of profit in the partnership. It only regulates the rights and liabilities of the partners.\"",
      "speaker": "court",
      "significance": "Core reasoning distinguishing partnership from internal family obligations."
    },
    {
      "text": "\"The fact of a partition in the Hindu law may have no effect upon the position of the partner, insofar as the law of partnership is concerned, but it has full effect upon the family insofar as the Hindu law is concerned.\"",
      "speaker": "court",
      "significance": "From Charandas Haridas; supports irrelevance of partition to partnership registration."
    }
  ],
  "_case_id": "1964_146",
  "_label": 0,
  "_text_length": 12910,
  "_extracted_at": "2026-02-10T19:44:56.047478"
}