{
  "metadata": {
    "case_name": "Ram Sewak Yadav v. Hussain Kamil Kidwai",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 1064 of 1963",
    "date_of_judgment": "1964-01-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "At the general elections held in February 1962, five candidates contested the election to the House of the People from the Barabanki single-member constituency.",
      "type": "background",
      "date": "1962-02",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant Ram Sewak Yadav was at the counting of votes found to have secured the highest number of votes and he was declared elected.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Hussain Kamil Kidwai submitted a petition on April 6, 1962, to the Election Commission for an order declaring the election of Yadav void and for an order that he Kidwai be declared duly elected.",
      "type": "procedural",
      "date": "1962-04-06",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "The Election Tribunal, Lucknow, to which the petition was referred for trial dismissed the petition.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "In appeal to the High Court of Allahabad Lucknow Bench in First Civil Appeal No. 11 of 1963, the order passed by the Election Tribunal was reversed and the proceedings were remanded for trial with a direction, among others, that the Tribunal do give reasonable opportunity to both the parties to inspect the ballot papers and other connected papers. Judgment dated July 23, 1963.",
      "type": "procedural",
      "date": "1963-07-23",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "With special leave, Yadav has appealed against the order of the High Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Principal grounds set up by Kidwai: 1. improper reception, refusal and rejection of votes at the time of counting, in consequence thereof the election was materially affected; 2. discrepancies between the total number of votes mentioned in Form 16 and Form 20; 3. tendered votes were wrongly rejected by the returning officer and on that account the election was materially affected; 4. at polling station No. 29, Majgawan in Bhitauli Unit and Kursi polling station in Kursi Assembly Unit, the polling officers did not give ballot papers to the voters; 5. counting of votes of Bhitauli Assembly Unit continued till 8-30 p.m. in insufficient light notwithstanding the protest lodged by the petitioner; 6. on a true count he Kidwai would have received a majority of valid votes and entitled to be declared duly elected.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "These allegations were denied by Yadav.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "At the trial before the Tribunal the parties led no oral evidence. In respect of pleas 3, 4 and 5 the burden of proof lay upon Kidwai and as no evidence was led to substantiate the same, those pleas failed.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Kidwai could not discharge the burden of proof to establish discrepancies between the original and certified copies of Forms 16 and 20, as originals were not called for.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Kidwai claimed he would establish case on pleas 1 and 6 from ballot papers and applied for inspection. Tribunal rejected holding ballot papers may be inspected only if necessary in interest of justice and facts must make out prima facie case of errors in reception, refusal or rejection of votes.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Ballot papers had been called for from Returning Officer and lodged before Tribunal in sealed boxes.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "High Court held ballot papers were before Tribunal, nothing in CPC prevented inspection, Tribunal rejected without adequate reasons.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "In paragraph 6H of petition: numerous ballot papers cast in favour of petitioner were wrongly included in bundles of respondents.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "In paragraph 6K: due to deficiency in supply of sealing ink, marks on some ballot papers though not quite clear yet clearly indicating intention, wrongly rejected.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "In paragraph 12: confident that if votes actually cast for petitioner counted as his, improperly accepted votes taken out, correctly sorted counted bundled, respondent No.1 would have less votes; result materially affected by improper acceptance/refusal, incorrect sorting counting bundling.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Election Tribunal erred in declining to grant an order for inspection of the ballot papers which had been lodged before it in sealed boxes by the Returning Officer.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Allegations denied.",
      "supporting_facts": [],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Mere production of sealed boxes does not make ballot papers part of record liable to inspection unless necessary in interests of justice.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Representation of the People Act, 1951; Conduct of Election Rules, 1961"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Tribunal bound to grant inspection as sealed boxes tendered in evidence and part of record.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Would establish improper reception refusal rejection from ballot papers; on true count would get majority.",
      "supporting_facts": [
        "f7",
        "f11",
        "f14",
        "f15",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Mere absence of particulars no ground to decline inspection; entitled to establish from ballot papers inspection that void votes counted for successful candidate. Cited Bhim Sen v. Gopali.",
      "supporting_facts": [],
      "legal_basis": "Bhim Sen v. Gopali"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Election petition must contain concise statement of material facts. Tribunal has power to order inspection if necessary in interests of justice, but not as matter of course; requires prima facie case disclosing errors in reception refusal rejection of votes; cannot fish for evidence on vague pleas.",
      "addresses_issue": "i1",
      "key_observation": "Two conditions: adequate statement of material facts in petition; Tribunal prima facie satisfied inspection necessary to decide dispute and do complete justice."
    },
    {
      "id": "cr2",
      "text": "Power implicit in ss.100(1)(d)(iii),101,102 and r.93; subject to secrecy under ss.94,128(1). Returning Officer not party, so not under O.11 CPC.",
      "addresses_issue": "i1",
      "key_observation": "Elaborate rules provide opportunity at counting for candidates/agents to watch, inspect rejected papers, demand recount."
    },
    {
      "id": "cr3",
      "text": "Averments in paras 6H,6K,12 vague, do not comply with s.83(1)(a); no prima facie case made out.",
      "addresses_issue": "i1",
      "key_observation": "Petitioner must set out case with precision supported by material facts deemed within knowledge."
    },
    {
      "id": "cr4",
      "text": "Bhim Sen case not general principle allowing inspection without material facts; there inspection already done, issue was amendment.",
      "addresses_issue": "i1",
      "key_observation": "Cannot claim inspection without specific allegations and prima facie case."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Order for inspection of ballot papers cannot be granted as matter of course; justified only if petition contains adequate material facts and prima facie case made out that inspection necessary in interests of justice; not to support vague pleas or fish for evidence.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Tribunal justified in declining inspection as no prima facie case; averments vague.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bhim Sen v. Gopali and others",
      "citation": "22 E.L.R. 288",
      "treatment": "distinguished",
      "relevance": "Does not lay down general principle that inspection can be claimed without material facts to fish for evidence; concerned with amendment after inspection already done."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "Section 80",
        "Section 83(1)",
        "Section 90(1)",
        "Section 92",
        "Section 94",
        "Section 100(1)(d)(iii)",
        "Section 101",
        "Section 102",
        "Section 128(1)",
        "Section 63(1)"
      ],
      "relevance": "Governs election petitions, procedure, powers of Tribunal including inspection, secrecy of ballot, grounds for void election."
    },
    {
      "name": "Conduct of Election Rules, 1961",
      "sections": [
        "Rule 53",
        "Rule 55",
        "Rule 56",
        "Rule 57",
        "Rule 60",
        "Rule 63",
        "Rule 64",
        "Rule 93"
      ],
      "relevance": "Regulates counting, scrutiny, rejection of ballot papers, inspection only under court order, opportunities for agents to watch and demand recount."
    },
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order II rule 15",
        "Order II rule 18"
      ],
      "relevance": "Powers of discovery and inspection applicable to Tribunal as nearly as may be; limited to documents referred in pleadings etc."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The Supreme Court held that the Election Tribunal was justified in refusing inspection of ballot papers due to absence of prima facie case and vague pleadings, thereby upholding the Tribunal's order and setting aside the High Court's remand direction.",
    "relief_granted": "Appeal allowed; High Court order reversed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "an order for inspection of ballot papers cannot be granted to support vague pleas made in the petition not supported by material facts or to fish out evidence to support such pleas.",
      "speaker": "court",
      "significance": "Core principle limiting inspection to prevent fishing expeditions."
    },
    {
      "text": "the Court would be justified in granting an order for inspection provided two conditions are fulfilled: (1) that the petition for setting aside an election contains an adequate statement of the material facts on which the petitioner relies in support of his case and (2) the Tribunal is prima facie satisfied that in order to decide the dispute and to do complete justice between the parties inspection of the ballot papers is necessary.",
      "speaker": "court",
      "significance": "Defines the two conditions for ordering ballot paper inspection."
    },
    {
      "text": "a mere allegation that the petitioner suspects or believes that there has been an improper reception, refusal or rejection of votes will not be sufficient to support an order for inspection.",
      "speaker": "court",
      "significance": "Emphasizes need for precise material facts, not mere suspicion."
    }
  ],
  "_case_id": "1964_347",
  "_label": 1,
  "_text_length": 24860,
  "_extracted_at": "2026-02-10T19:47:01.447851"
}