{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. Respondent Firm (K. N. Damodara Mudaliar and others)",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "SHAH, J."
    ],
    "case_number": "Civil Appeal No. 250 of 1963",
    "date_of_judgment": "1964-04-16"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents are a firm constituted under a deed dated December 12, 1947, originally consisting of three partners: K. N. Damodara Mudaliar, A. Krishnaswami Mudaliar and V. Thangaraja Mudaliar.",
      "type": "background",
      "date": "1947-12-12",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The firm acquired for Rs. 1,00,000/- the exploitation rights for four years in the cinematograph film 'Apoorva Chinthamani' for North Arcot, South Arcot, Chingleput districts and Pondicherry.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "For the period December 25, 1947 to August 2, 1948 (previous year corresponding to assessment year 1949-50), the firm filed a voluntary return declaring Rs. 28,643/- as profits earned by exploitation of the film. Total receipts Rs. 1,46,849/-, debited expenses Rs. 13,206/- and Rs. 1,00,000/- for acquiring rights, but no credit for value of unexpired exploitation rights at end of previous year.",
      "type": "material",
      "date": "1947-12-25 to 1948-08-02",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "On August 15, 1948, a deed of dissolution of the partnership was executed. Damodara Mudaliar sold his half interest in assets with effect from August 6, 1948, to Krishnaswami Mudaliar for Rs. 2,000/- and retired.",
      "type": "material",
      "date": "1948-08-15",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On August 27, 1948, trial balance-sheet showed cash balance Rs. 190/12/4, debit against Krishnaswami Mudaliar Rs. 2,641/8/8, credits to Damodara Mudaliar Rs. 1,888/2/11 and Thangaraja Mudaliar Rs. 944/2/1.",
      "type": "material",
      "date": "1948-08-27",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Thereafter, Krishnaswami Mudaliar, Thangaraja Mudaliar and V. S. Lakshmanan (outsider) formed new partnership to exploit the film for unexpired period.",
      "type": "material",
      "date": "1948-08-27 after",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Krishnaswami Mudaliar retired from new partnership on February 22, 1949, agreeing to receive Rs. 12,000/- for his six sixteenth share in assets.",
      "type": "material",
      "date": "1949-02-22",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Second Additional Income-tax Officer, Vellore, for AY 1949-50, declined to accept net profit of Rs. 28,643/-, noted no stock valuation of picture, estimated value of unexpired rights on August 2, 1948 at Rs. 65,000/-, computed net profits Rs. 93,642/- for unregistered firm.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "In appeal to Appellate Assistant Commissioner, firm challenged valuation at Rs. 65,000/-, submitted Rs. 4,000/- true value based on Damodara's relinquishment for Rs. 2,000/- half share. AAC rejected, held valuation in dissolution deed dictated by extra-commercial considerations, confirmed Rs. 65,000/-.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "In appeal to Income-tax Appellate Tribunal, Madras, firm contended valuation excessive. Tribunal reduced to Rs. 40,000/- as on August 2, 1948, directed modification of assessment.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Pursuant to High Court of Madras order under s. 66(2), Tribunal referred question: Whether on the facts and circumstances the Tribunal was justified in applying proviso to s. 13 and confirming assessment on mercantile basis.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Madras High Court held assessee adopted cash system, Tribunal erred in discarding without reasons, answered question in negative. Judgment dated February 2, 1960.",
      "type": "procedural",
      "date": "1960-02-02",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appeal to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in computation of income under head 'Profits and gains of business', Income-tax Officer bound by method of accounting where cost of acquisition of film exploitation rights debited at commencement but value at end of year ignored.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Tribunal justified in applying proviso to s. 13 of Income-tax Act, 1922, and confirming assessment on mercantile basis.",
      "framed_by": "high_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Profits cannot properly be deduced without valuing unexpired exploitation rights (closing stock). ITO entitled under proviso to s.13 to compute on basis where profits properly deduced, including stock valuation.",
      "supporting_facts": [
        "f3",
        "f8",
        "f10"
      ],
      "legal_basis": "Section 13 proviso, Income-tax Act 1922; Section 10"
    },
    {
      "id": "pa2",
      "text": "Question referred did not arise from Tribunal order as no challenge to applicability of proviso to s.13 or mercantile basis before lower authorities.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "s.66(1) Income-tax Act"
    },
    {
      "id": "pa3",
      "text": "In trading with wasting asset (film rights as stock-in-trade), true profits require opening/closing stock valuation at cost or market price whichever lower, regardless of cash or mercantile system.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Ordinary principles of commercial accounting; precedents like Whimster, Cock Russell"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Assessee adopted cash system of accounting, recognized method; no power under proviso to s.13 to force mercantile or hybrid system with closing stock valuation.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Section 13, Income-tax Act 1922"
    },
    {
      "id": "ra2",
      "text": "Value of unexpired rights Rs. 4,000/- based on Damodara Mudaliar relinquishing half share for Rs. 2,000/-; higher valuations excessive.",
      "supporting_facts": [
        "f4",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "ITO implicitly held profits cannot properly be deduced without stock valuation; AAC and Tribunal agreed. No challenge to this before Tribunal.",
      "addresses_issue": "i1",
      "key_observation": "Implicit in ITO order that without valuation of unexpired rights, profits could not be computed."
    },
    {
      "id": "cr2",
      "text": "Question of proviso to s.13 applicability did not arise from Tribunal order, but merits addressed as important principle.",
      "addresses_issue": "i2",
      "key_observation": "Grounds of appeal before AAC/Tribunal only challenged quantum of valuation, not method."
    },
    {
      "id": "cr3",
      "text": "s.13 requires computation per regularly employed method if profits properly deductible; proviso allows ITO to determine basis if not. Duty to examine method.",
      "addresses_issue": "i1",
      "key_observation": "Even if cash system regular, stock valuation essential for trading profits."
    },
    {
      "id": "cr4",
      "text": "In trading, true profits impossible without opening/closing stock-in-trade valuation at cost/market lower. Ignoring closing stock while debiting opening defers profits, treats as capital.",
      "addresses_issue": "i1",
      "key_observation": "Film rights are stock-in-trade, wasting asset; annual levy requires accurate yearly profits."
    },
    {
      "id": "cr5",
      "text": "HC erred in holding ITO bound by cash system without stock adjustment; proviso permits computation including closing stock for proper deduction of profits.",
      "addresses_issue": "i1",
      "key_observation": "Not forcing mercantile system, but ensuring proper basis per proviso."
    },
    {
      "id": "cr6",
      "text": "Commercial accounting principles require stock valuation; supported by English and Indian precedents.",
      "addresses_issue": "i1",
      "key_observation": "Profits = receipts - expenditure, with stock adjustments."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Income-tax Officer entitled under proviso to s.13 to compute profits including value of closing stock (unexpired film rights) even if assessee used cash system without it.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Answer to referred question in affirmative: Tribunal justified in applying proviso to s.13.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Secretary, Board of Revenue, Madras v. Arunachalam Chettiar",
      "citation": "L.R. 65 I.A. 1",
      "treatment": "referred",
      "relevance": "View that income means actually or constructively received superseded by s.13 enactment."
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay v. Sarangpur Cotton Manufacturing Company Ltd.",
      "citation": "33 I.T.R. 182",
      "treatment": "followed",
      "relevance": "s.13 relates to assessee's regular method; compulsory unless profits not properly deductible."
    },
    {
      "case_name": "Commissioner of Income-tax v. Mcmillan Co.",
      "citation": null,
      "treatment": "followed",
      "relevance": "ITO's opinion under proviso imposes statutory duty to examine method."
    },
    {
      "case_name": "Commissioner of Inland Revenue v. Cock Russell and Co. Ltd.",
      "citation": "29 T.C. 387",
      "treatment": "followed",
      "relevance": "Stock valuation essential for profits; ordinary commercial principles apply."
    },
    {
      "case_name": "Whimster & Co. v. Commissioner of Inland Revenue",
      "citation": "T.C. 813",
      "treatment": "followed",
      "relevance": "Profits computation per commercial accounting, including stock at cost/market lower."
    },
    {
      "case_name": "Commissioner of Income-tax v. Messrs. Chari and Ram",
      "citation": "17 I.T.R. 1",
      "treatment": "followed",
      "relevance": "Stock-in-trade essential for profits computation."
    },
    {
      "case_name": "Spanish Prospecting Company Ltd., In re",
      "citation": "1911 1 Ch. 92",
      "treatment": "referred",
      "relevance": "Profits by comparing assets at two dates."
    },
    {
      "case_name": "Naval Colliery Co. Ltd. v. Commissioner of Inland Revenue",
      "citation": "12 T.C. 1017",
      "treatment": "distinguished",
      "relevance": "Principle of valuing at beginning/end needs modification for special cases like mining, but not eliminating stock valuation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 10",
        "Section 13 (proviso)",
        "Section 66(2)",
        "Section 4(1)",
        "Section 2(15)"
      ],
      "relevance": "Computation of business profits per regular accounting method unless profits not properly deductible, then per ITO determination; reference to HC."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, set aside Madras High Court order, answered the referred question in the affirmative holding that revenue authorities were justified under proviso to s.13 in including valuation of closing stock for proper computation of profits.",
    "relief_granted": "Appeal allowed; question answered affirmatively.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"in all trading cases the true profits cannot be deduced from any system of maintaining accounts whether cash or mercantile, unless the opening and closing stocks are brought into the picture at cost or market price whichever is lower\"",
      "speaker": "court",
      "significance": "Core principle that stock valuation mandatory for trading profits."
    },
    {
      "text": "\"It would be fantastic not to do it it would be utterly impossible accurately to assess profits and gains merely on a statement of receipts and payments\"",
      "speaker": "court",
      "significance": "Cites Cock Russell on necessity of stock valuation (Croom-Johnson J.)."
    },
    {
      "text": "\"the Income-tax Officer had no power under the proviso to s. 13 to force a different system on the assessee either the mercantile system or a hybrid system of cash plus valuation of closing stock.\"",
      "speaker": "high_court",
      "significance": "HC view reversed by SC."
    }
  ],
  "_case_id": "1964_299",
  "_label": 1,
  "_text_length": 32387,
  "_extracted_at": "2026-02-10T19:46:24.151578"
}