{
  "metadata": {
    "case_name": "Chitturi Subbanna v. Kudapa Subbanna",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal J.",
      "Sikri J.",
      "Mudholkar J."
    ],
    "case_number": "Civil Appeal No. 598 of 1961",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Suit for possession and mesne profits instituted in the year 1926.",
      "type": "background",
      "date": "1926",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "High Court of Madras passed preliminary decree on March 7, 1938 in favour of second plaintiff (Kudapa Subbanna, respondent No.1), directing enquiry into mesne profits from date of institution of suit up to date of delivery of possession.",
      "type": "material",
      "date": "1938-03-07",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "No appeal filed against preliminary decree by judgment-debtor.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Possession over properties in Schedules A and C delivered to decree-holder on February 17, 18 and 20, 1943.",
      "type": "material",
      "date": "1943-02-17",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "I.A. 429 of 1940 for ascertainment of future profits struck off on September 25, 1944.",
      "type": "procedural",
      "date": "1944-09-25",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Decree-holder filed I.A. 558 of 1949 on June 23, 1945 to revive and continue earlier I.A. 429 of 1940.",
      "type": "procedural",
      "date": "1945-06-23",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Subordinate Judge on July 28, 1948 decreed mesne profits and interest for A and C schedule properties from 1926-27 to 1942-43 amounting to Rs. 17,883-8-3 including Rs. 10,790 for mesne profits; also decreed mesne profits for B-schedule up to 1946.",
      "type": "material",
      "date": "1948-07-28",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Chitturi Subbanna (1st defendant, appellant) appealed to High Court on April 22, 1949.",
      "type": "procedural",
      "date": "1949-04-22",
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Decree-holder filed cross-objections claiming Rs. 19,000 more, confining claim to that though actual due about Rs. 45,000.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Commissioner conducted enquiry from August 29, 1946 to December 4, 1947.",
      "type": "procedural",
      "date": "1946-08-29",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court on September 13, 1958 dismissed appeal, allowed cross-objection, increased mesne profits for A and C to Rs. 17,242-12-0.",
      "type": "material",
      "date": "1958-09-13",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appellant applied to High Court for permission to raise additional ground that trial court not entitled to grant mesne profits for more than 3 years from High Court decree; High Court disallowed.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "High Court granted certificate for appeal to Supreme Court as decree was one of variance over Rs. 10,000.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "It was conceded before Commissioner and trial court that accounts could be taken up to 1943 for A and C schedules and 1946 for B schedule.",
      "type": "admitted",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court erred in not allowing the appellant to raise the additional ground that mesne profits could not be granted for more than 3 years from the date of the preliminary decree under O.20 r.12 CPC.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether mesne profits could be awarded for period subsequent to expiry of three years from the preliminary decree dated March 7, 1938 (i.e., beyond March 7, 1941).",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the High Court erred in enhancing the quantum of mesne profits arbitrarily.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in disallowing additional ground of appeal based on O.20 r.12 CPC as it is a pure question of law, not dependent on facts, and can be raised at any stage.",
      "supporting_facts": [
        "f12",
        "f14"
      ],
      "legal_basis": "O.20 r.12 CPC; Wilson v. United Counties Bank Ltd.; Yeswant Deorao Deshmukh v. Walchand Ramchand Kothari; Connecticut Fire Insurance Co. v. Kavanagh"
    },
    {
      "id": "pa2",
      "text": "Mesne profits cannot be awarded beyond three years from preliminary decree dated March 7, 1938; decree must be construed in accordance with O.20 r.12 CPC limiting to three years if possession not delivered earlier.",
      "supporting_facts": [
        "f2",
        "f4",
        "f7"
      ],
      "legal_basis": "O.20 r.12 CPC; Girish Chunder Lahiri v. Shoshi Shikhareswar Roy"
    },
    {
      "id": "pa3",
      "text": "High Court arbitrarily enhanced mesne profits without reasons, ignoring depression period, exceeding claims, etc.",
      "supporting_facts": [
        "f11",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant conceded before Commissioner and trial court to accounts up to 1943; elected to have profits determined up to delivery; raising new point now would allow separate suit which is time-barred.",
      "supporting_facts": [
        "f14",
        "f10"
      ],
      "legal_basis": "O.20 r.12 CPC"
    },
    {
      "id": "ra2",
      "text": "Preliminary decree directed enquiry up to delivery of possession; cannot be ignored; judgment-debtor estopped by conduct.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "S.97 CPC"
    },
    {
      "id": "ra3",
      "text": "High Court enhanced after considering material; presumption in its favor.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court erred in disallowing pure question of law under O.20 r.12 CPC; appellant's conduct did not amount to concession or waiver as no dispute arose earlier.",
      "addresses_issue": "i1",
      "key_observation": "Pure questions of law can be raised at later stages; High Court's reasons not good."
    },
    {
      "id": "cr2",
      "text": "Preliminary decree directing enquiry up to delivery must be construed in accordance with O.20 r.12(1)(c) CPC limiting to three years from decree if possession later; court has no power beyond that.",
      "addresses_issue": "i2",
      "key_observation": "Direction is exercise of discretionary power under rule, not adjudication; S.97 CPC inapplicable."
    },
    {
      "id": "cr3",
      "text": "High Court arbitrarily enhanced rates without reasons, overlooked depression period 1931-1940, exceeded claims, inconsistent findings.",
      "addresses_issue": "i3",
      "key_observation": "High Court did not come to grips with quantum."
    },
    {
      "id": "cr4",
      "text": "Dissent: High Court right to refuse new ground as waived by conduct; preliminary decree final under S.97 CPC; direction clear, not ambiguous, binding even if erroneous.",
      "addresses_issue": "i1",
      "key_observation": "New grounds discouraged; direction not vague."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Pure question of law under O.20 r.12 CPC can be raised in first appellate court even if not in memo.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Decree directing mesne profits enquiry up to delivery of possession must be construed as limited to three years from decree date under O.20 r.12(1)(c) CPC.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "High Court erred in enhancing quantum without proper reasons.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Wilson v. United Counties Bank Ltd.",
      "citation": "L.R. 1920 A.C. 102,106",
      "treatment": "followed",
      "relevance": "New grounds by substantive application; practice to discourage new contentions."
    },
    {
      "case_name": "Yeswant Deorao Deshmukh v. Walchand Ramchand Kothari",
      "citation": "1950 S.C.R. 852",
      "treatment": "followed",
      "relevance": "Pure question of law can be raised in final court of appeal."
    },
    {
      "case_name": "Connecticut Fire Insurance Co. v. Kavanagh",
      "citation": "1892 A.C. 473",
      "treatment": "followed",
      "relevance": "Question of law on admitted facts expedient to entertain in last resort."
    },
    {
      "case_name": "M. K. Ranganathan v. Government of Madras",
      "citation": "1955 1 S.C.R. 374, 381",
      "treatment": "referred",
      "relevance": "Pure question of law allowed at late stage."
    },
    {
      "case_name": "Ittyavira Mathai v. Varkey Varkey",
      "citation": "A.I.R.1964 S.C. 907",
      "treatment": "distinguished",
      "relevance": "Mixed question of law and fact not allowed if not raised earlier."
    },
    {
      "case_name": "Rehmat-un-Nissa Begam v. Price",
      "citation": "L.R. 45 I.A. 61",
      "treatment": "referred",
      "relevance": "Discretionary order disturbed if capricious."
    },
    {
      "case_name": "London, Chatham and Dover Railway Co. v. South-Eastern Railway Co.",
      "citation": "L.R. 1889 40 Ch.D. 100",
      "treatment": "distinguished",
      "relevance": "Waiver if not insisting on jurisdiction earlier."
    },
    {
      "case_name": "Girish Chunder Lahiri v. Shoshi Shikhareswar Roy",
      "citation": "L.R. 27 I.A. 110",
      "treatment": "followed",
      "relevance": "Decree construed to limit mesne profits to 3 years."
    },
    {
      "case_name": "Fakharuddin Mahomed Ahsan Chowdhry v. Official Trustee of Bengal",
      "citation": "L.R. 11 I.A.197",
      "treatment": "referred",
      "relevance": "Decree construed to award up to possession under old law."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "Order 20 Rule 12",
        "Section 97"
      ],
      "relevance": "Limits mesne profits enquiry to 3 years or delivery; preliminary decree final if no appeal."
    },
    {
      "name": "Code of Civil Procedure, 1882",
      "sections": [
        "Section 211"
      ],
      "relevance": "Limited mesne profits to 3 years or delivery, whichever earlier."
    },
    {
      "name": "Code of Civil Procedure, 1859",
      "sections": [
        "Sections 196, 197"
      ],
      "relevance": "Allowed mesne profits up to delivery without 3-year limit."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Appeal allowed with costs; High Court decree set aside; case remanded to High Court to determine afresh quantum of mesne profits up to March 7, 1941 and dispose of appeal according to law.",
    "relief_granted": "Remand for fresh determination of mesne profits quantum limited to 3 years from preliminary decree.",
    "costs": "Costs of this Court to appellant."
  },
  "key_quotes": [
    {
      "text": "When a question of law is raised for the first time in a court of last resort upon the construction of a document or upon facts either admitted or proved beyond controversy, it is not only competent but expedient in the interests of justice to entertain the plea.",
      "speaker": "court",
      "significance": "Justifies allowing pure question of law at appellate stage (Connecticut Fire Insurance)."
    },
    {
      "text": "A decree under r. 12, O.20, C.P.C. directing enquiry into the mesne profits, however expressed, must be construed to be a decree directing the enquiry into the mesne profits in conformity with the requirements of r. 12 (1) (c) of O.20.",
      "speaker": "court",
      "significance": "Core holding on construction of preliminary decree."
    },
    {
      "text": "The object of indicating in detail the grounds of appeal... is that the respondent parties may be accurately and precisely informed of the case which they have to meet.",
      "speaker": "court",
      "significance": "Explains why new grounds discouraged (Wilson v. United Counties)."
    }
  ],
  "_case_id": "1964_153",
  "_label": 1,
  "_text_length": 73463,
  "_extracted_at": "2026-02-10T19:44:56.260417"
}