{
  "metadata": {
    "case_name": "Appellant (Swatantra Party candidate) v. Respondent No. 1",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar J."
    ],
    "case_number": "Civil Appeal No. 506 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Election to the Assembly seat contested by three candidates: appellant (Swatantra Party, symbol star), respondent No. 1 and respondent No. 2.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant secured 20,062 votes, respondent No. 1 secured 15,190 votes, respondent No. 2 secured 7,093 votes; appellant declared elected on February 26, 1962.",
      "type": "material",
      "date": "1962-02-26",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondent No. 1 filed election petition challenging appellant's election on five grounds: (1) respondent No. 2 had not completed 25 years on date of scrutiny of nomination papers, acceptance improper, materially affected result; (2) appellant guilty of corrupt practices (bribery, undue influence); (3) appellant procured bus No. GTA 7673 for taking voters from village Sodpur to polling booths; (4) appellant issued leaflets describing star symbol as Dhruva star to appeal to religion; (5) notifications by Governor and Election Commission not in compliance with law.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Election Tribunal rejected all corrupt practice allegations including leaflets, rejected notifications issue, but held respondent No. 2's nomination improperly accepted due to under age, set aside appellant's election.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Gujarat High Court reversed Tribunal on respondent No. 2's age (attained 25 years on January 6, 1962, prior to scrutiny), but held appellant and Swatantra Party guilty of corrupt practice under s.123(3) by appealing on grounds of religion using Dhruva star, set aside election.",
      "type": "procedural",
      "date": "1963-03-11",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Election Commission allotted star as symbol to Swatantra Party.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In leaflets and pamphlets by appellant or agents, election symbol star described as Dhruva star or Pole Star; qualities set out: Dhruva means eternal, firm, guide, determined, one devoted to religion.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In Exhibit 63 (translation of appellant's election manifesto): 'for free religion, free agriculture and free commerce, vote for none else but the Dhruvano Taro that is Swatantra Party'.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "No pamphlet or leaflet with direct appeal to religious sentiments of voters.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Respondent No. 1's counsel in High Court argued only on corrupt practice point, did not press others.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "School certificates showed respondent No. 2's date of birth such that he completed 25 years on January 6, 1962.",
      "type": "material",
      "date": "1962-01-06",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant could be said to be guilty of corrupt practice under sub-s. 3 of S. 123 of the Representation of the People Act, 1951 by describing election symbol star as Dhruva star and setting out its qualities in pamphlets.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the nomination of respondent No. 2 was improperly accepted because he had not attained 25 years at date of scrutiny.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether respondent No. 1 competent to challenge High Court's finding on respondent No. 2's age without filing separate appeal.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Describing star as Dhruva star and listing attributes does not amount to use of or appeal to religious symbol under s.123(3); Dhruva has no religious significance as deity; no direct appeal to religion.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8",
        "f9"
      ],
      "legal_basis": "Section 123(3) Representation of the People Act, 1951; Jagdev Singh Sidhanti v. Pratap Singh Daulta"
    },
    {
      "id": "pa2",
      "text": "Respondent No. 1 not competent to support High Court judgment on grounds decided against him without appealing.",
      "supporting_facts": [
        "f4",
        "f5",
        "f10"
      ],
      "legal_basis": "Vashist Narain Sharma v. Dev Chandra; Sri Baru Ram v. Shrimati Prasanni"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Dhruva star is a religious symbol of Hindu religion; describing symbol as Dhruva star with qualities like devoted to religion appeals to religious sentiments.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Section 123(3) Representation of the People Act, 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Dhruva star not a religious symbol; Dhruva mythological figure of devotion, not deity or Godhead; qualities eternal, firm etc. are noble but not peculiar to Hindu religion; no tendency to arouse religious sentiment.",
      "addresses_issue": "i1",
      "key_observation": "Object of s.123(3) is to prevent stirring religious sentiment; mere association with devotee insufficient."
    },
    {
      "id": "cr2",
      "text": "No particular object symbol of Hindu religion per its concepts; examples like lotus, cobra not religious symbols per se unless used to solicit votes in name of deity.",
      "addresses_issue": "i1",
      "key_observation": "Symbol allotted by EC; describing as Dhruva does not convert to religious symbol."
    },
    {
      "id": "cr3",
      "text": "Election literature to be construed fairly, not reading more than face value; hyperbole common.",
      "addresses_issue": "i1",
      "key_observation": "High Court read too much into pamphlets."
    },
    {
      "id": "cr4",
      "text": "Respondent No. 1 can support decree on grounds negatived below; SC has power in appeals under Art.136 to permit; disapproves Vashist Narain Sharma.",
      "addresses_issue": "i3",
      "key_observation": "Justice requires allowing support on alternative grounds."
    },
    {
      "id": "cr5",
      "text": "High Court correctly held respondent No. 2 attained 25 years based on school certificates.",
      "addresses_issue": "i2",
      "key_observation": "Rejected police register entries."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Use of Dhruva star description and qualities not corrupt practice under s.123(3) RP Act.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Respondent No. 2's nomination properly accepted as he attained 25 years before scrutiny.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Respondent entitled to support judgment on negatived grounds without separate appeal.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Vashist Narain Sharma v. Dev Chandra Ors.",
      "citation": "1955 1 S.C.R. 509, 519",
      "treatment": "disapproved",
      "relevance": "Disapproved narrow view on respondent supporting on negatived grounds in SC appeals."
    },
    {
      "case_name": "Sri Baru Ram v. Shrimati Prasanni and others",
      "citation": "1959 S.C.R. 1403",
      "treatment": "referred",
      "relevance": "Referred on whether respondent needs separate appeal."
    },
    {
      "case_name": "Jagdev Singh Sidhanti v. Pratap Singh Daulta Ors.",
      "citation": "A.I.R. 1965 S.C. 183",
      "treatment": "followed",
      "relevance": "Use of Aum not religious symbol; examine special religious significance and use."
    },
    {
      "case_name": "Shubnath Deogram v. Ram Narain Prasad Ors.",
      "citation": "1960 1 S.C.R. 953",
      "treatment": "distinguished",
      "relevance": "Cock symbol appeal held corrupt due to nature of appeal threatening miseries if not voted."
    },
    {
      "case_name": "Kultar Singh v. Mukhtiar Singh",
      "citation": "A.I.R. 1965 S.C. 141",
      "treatment": "followed",
      "relevance": "Construe election literature fairly, not literally; allowance for hyperbole."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "123(3)"
      ],
      "relevance": "Defines corrupt practice as appeal on ground of religion or use/appeal to religious symbols."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, reversed High Court's finding of corrupt practice, upheld validity of respondent No. 2's nomination, restored appellant's election as no grounds to set aside.",
    "relief_granted": "Appellant's election upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The object underlying the prohibition is stirring up religious sentiment by use of or appeal to a religious symbol. If what is done does not tend to arouse religious sentiment, S. 123(3) would not be transgressed.",
      "speaker": "court",
      "significance": "Core test for corrupt practice under s.123(3)"
    },
    {
      "text": "A distinction must... be drawn between canvassing on grounds of religion and seeking of votes in graphic or picturesque language with analogies from religious lore to illustrate.",
      "speaker": "court",
      "significance": "Quoting Subba Rao J. on what constitutes appeal to religious sentiment."
    },
    {
      "text": "Courts should not be astute to read into the words used in the appeal anything more than can be attributed to them on its fair and reasonable construction.",
      "speaker": "court",
      "significance": "Approach to interpreting election material."
    }
  ],
  "_case_id": "1964_140",
  "_label": 1,
  "_text_length": 30260,
  "_extracted_at": "2026-02-10T19:44:15.955439"
}