{
  "metadata": {
    "case_name": "Board of Revenue v. Respondent (Executant of Deed)",
    "case_year": 1962,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeal No. 526 of 1962",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is one of the executants of the deed dated December 15, 1952.",
      "type": "background",
      "date": "1952-12-15",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The executants, hereinafter referred to as the vendors, were lessees of two plots of land and on these plots they had constructed an oil mill, known as Sri Govind Oil Mills, an Ice and Cold Storage Factory, and buildings in which the factories stood.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The Ice and Cold Storage factory was being run by the vendors in partnership with Shyam Sunder Gupta and Satya Prakash Gupta.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The vendors had equitably mortgaged these properties with the Chartered Bank of India, and a sum of Rs. 10,00,000 was due to the Bank.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In order to pay off the debt, the vendors entered into a contract with Messrs Oil Corporation of India Ltd., hereinafter referred to as the vendees, for the sale of the lands, buildings, plants, machinery and stores and goodwill of the Govind Oil Mills and Ice Cold Storage Factory for a sum of Rs. 5,55,000, made up as follows: Rs. 1,12,000 for the plant and machinery and goodwill of the Ice and Cold Storage Factory, Rs. 3,00,000 for the machinery of Sri Govind Oil Mills, Rs. 25,000 for stores, Rs. 18,000 for goodwill, and Rs. 1,00,000 for the buildings and the lessee right, in the plots.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Out of this Rs. 66,000 was payable to Messrs Shyam Sunder Gupta and Satya Parkash Gupta in respect of their share in the Kanpur Ice and Cold Storage Factory, and the remainder to the vendors.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Chartered Bank agreed to release from its charge the properties to be conveyed to the vendees provided a sum of Rs. 5,00,000 was paid to it.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The vendees agreed to pay the said Bank a sum of Rs. 4,89,000, while the vendors agreed to pay Rs. 11,000 to the Bank to make up the balance.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In pursuance of this agreement, the vendors handed over the possession of plant and machinery of the two factories to the vendees, who paid before December 15, 1952, Rs. 3,89,000 to the said Bank.",
      "type": "procedural",
      "date": "1952-12-15",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On December 15, 1952, the sale-deed in respect of the buildings and the lessee rights was executed.",
      "type": "material",
      "date": "1952-12-15",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Clause 2 of the deed provided that the vendees hereby declare that the properties hereby conveyed are free from all encumbrances except the charge in favour of the Chartered Bank of India, Australia and China, The Mall, Kanpur, which would be paid off so far as the properties hereby conveyed are concerned in the manner set forth above.",
      "type": "material",
      "date": "1952-12-15",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On December 15, 1952, the date when the deed was executed, Rs. 3,89,000 had already been paid by the vendees to the Bank.",
      "type": "material",
      "date": "1952-12-15",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The payment of Rs. 3,89,000 to the Bank left outstanding Rs. 1,11,000 as mortgage money.",
      "type": "material",
      "date": "1952-12-15",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Rs. 1,00,000 is expressed to be the consideration for the conveyance of the immovable property.",
      "type": "material",
      "date": "1952-12-15",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the document is a sale-deed for a consideration of Rs. 1,00,000 as contended by the executants.",
      "framed_by": "board_of_revenue"
    },
    {
      "id": "i2",
      "text": "Whether in view of the provisions of Section 24 of the Stamp Act, the sale consideration shall be deemed to be Rs. 5,55,000 and duty liable to be paid thereon as held by the Board.",
      "framed_by": "board_of_revenue"
    },
    {
      "id": "i3",
      "text": "Whether the consideration of the sale will be deemed to be Rs. Ten Lakhs, i.e., the entire amount due to the mortgagee Bank, and duty is payable thereon.",
      "framed_by": "board_of_revenue"
    },
    {
      "id": "i4",
      "text": "On what amount is the additional stamp duty under section 107 of the Kanpur Development Act, 1945, leviable.",
      "framed_by": "board_of_revenue"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "On a true interpretation of s. 24 of the Indian Stamp Act, 1899, the consideration for the purpose of calculating ad valorem duty is either Rs. 10,00,000, or Rs. 5,55,000 or at least Rs. 1,11,000.",
      "supporting_facts": [
        "f4",
        "f5",
        "f7",
        "f8",
        "f9",
        "f12",
        "f13"
      ],
      "legal_basis": "Section 24, Indian Stamp Act, 1899"
    },
    {
      "id": "pa2",
      "text": "Rs. 3,89,000 paid by vendees to Bank should be included because it was consideration moving from the vendees and stamp duty cannot be avoided by paying money before conveyance is executed.",
      "supporting_facts": [
        "f9",
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Till the date of sale the sum of Rs. 11,000 had not been paid and there was a charge on the property in respect of that amount, but the vendors themselves had taken liability for that amount and had agreed to pay it. It had been expressly provided in the sale deed that the property was being sold free from the charge. The vendees were in no way liable for the amount and had not undertaken to pay it. In these circumstances the property cannot be said to have been sold subject to the charge of Rs. 11,000.",
      "supporting_facts": [
        "f8",
        "f11",
        "f13",
        "f14"
      ],
      "legal_basis": "Explanation to Section 24, Indian Stamp Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The underlying object of Section 24 is to adopt a simple test for valuing the property taken by the vendees: any unpaid mortgage money or money charged, together with interest due, shall be deemed to be part of the consideration for the sale.",
      "addresses_issue": "i1",
      "key_observation": "Legislature adopted simple test to prevent defeating the tax by understating consideration when property subject to mortgage."
    },
    {
      "id": "cr2",
      "text": "The phrase 'sale of property subject to a mortgage' means that mortgaged property is sold subject to the mortgage, not merely that mortgaged property is sold.",
      "addresses_issue": "i2",
      "key_observation": "Phrase qualifies 'sale' not 'property'; agrees with Calcutta and Bombay High Courts."
    },
    {
      "id": "cr3",
      "text": "It is only the unpaid mortgage money that is deemed part of consideration; if paid off before conveyance, not added under explanation.",
      "addresses_issue": "i3",
      "key_observation": "Rs. 3,89,000 paid before deed for other items (plant, machinery), not for immovable property conveyed."
    },
    {
      "id": "cr4",
      "text": "Rs. 1,00,000 expressed for immovable property falls under Art. 23; Rs. 11,000 not includible as property sold free from charge, vendors liable.",
      "addresses_issue": "i1",
      "key_observation": "Vendees not liable for Rs. 11,000; part of price for other items."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The document is a sale deed for a consideration of Rs. 1,00,000 only and stamp duty payable calculated on that amount, not on higher amount.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Explanation to Section 24 does not deem consideration as Rs. 5,55,000 or Rs. 10,00,000.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Rs. 11,000 not included as property not sold subject to that charge.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "U.K. Janardhana Rao v. Secretary of State",
      "citation": "1931 I.L.R. 58 Cal. 33",
      "treatment": "followed",
      "relevance": "Phrase 'subject to a mortgage' qualifies 'sale' not 'property'"
    },
    {
      "case_name": "Waman Martand Bhalerao v. The Commissioner Central Division",
      "citation": "1925 I.L.R. 49 Bom. 73",
      "treatment": "followed",
      "relevance": "Phrase 'subject to a mortgage' qualifies 'sale' not 'property'"
    },
    {
      "case_name": "Commissioners of Inland Revenue v. Liquidators of City of Glasgow Bank",
      "citation": "1881 8 Ct. of Sess. cases, 4th S. 389",
      "treatment": "referred",
      "relevance": "Explains underlying reason to prevent defeating stamp duty by understating consideration on mortgaged property"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Stamp Act, 1899",
      "sections": [
        "Section 24",
        "Section 57",
        "Article 23 Schedule I"
      ],
      "relevance": "Determines stamp duty on conveyance; deems certain debts part of consideration if property sold subject to mortgage"
    },
    {
      "name": "Kanpur Development Act, 1945",
      "sections": [
        "Section 107"
      ],
      "relevance": "Additional stamp duty; not subject of appeal"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court agreed with the Allahabad High Court that the stamp duty is to be calculated only on the sum of Rs. 1,00,000, dismissing the appeal by the Board of Revenue challenging the High Court's answers to the first three questions referred under Section 57 of the Stamp Act.",
    "relief_granted": "Stamp duty payable only on Rs. 1,00,000",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The phrase subject to a mortgage or other encumbrance in the explanation to s. 24 qualifies the word sale and not the word property.\"",
      "speaker": "court",
      "significance": "Core interpretation rejecting appellant's broad reading of Section 24"
    },
    {
      "text": "\"In the result, we agree with the High Court that the stamp duty is to be calculated only on the sum of Rs. 1,00,000.\"",
      "speaker": "court",
      "significance": "Final holding affirming High Court decision"
    },
    {
      "text": "\"Stamp duty cannot be avoided by the simple device of paying money before a conveyance is executed.\"",
      "speaker": "court",
      "significance": "Acknowledges appellant's concern but finds payments not for conveyed property"
    }
  ],
  "_case_id": "1964_76",
  "_label": 0,
  "_text_length": 13150,
  "_extracted_at": "2026-02-10T19:43:34.223015"
}