{
  "metadata": {
    "case_name": "Kashiram Agarwala v. Union of India",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar C.J."
    ],
    "case_number": "Civil Appeal No. 22 of 1964 and Civil Appeal No. 261 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Kashiram Agarwala filed two writ petitions in Punjab High Court, Circuit Bench at Delhi (Civil Writ Nos. 258-D and 257-D of 1963) challenging validity of two orders passed by Central Board of Revenue under s.127(1) of Income-Tax Act, 1961.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Central Board of Revenue passed two orders on 18th January, 1963, directing transfer of income-tax proceedings pending against appellant from Income Tax Officer D Ward District IV(1), Calcutta and F Ward District IV(2), Calcutta to Income Tax Officer F Ward Companies District III, Calcutta.",
      "type": "material",
      "date": "1963-01-18",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Impugned orders do not record any reasons for transfer.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Transfers were from one Income-tax Officer to another whose offices are situated in the same city, locality or place (Calcutta).",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Punjab High Court dismissed writ petitions summarily by judgment and order dated April 10, 1963.",
      "type": "procedural",
      "date": "1963-04-10",
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "Appellant came to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "What is the effect of the proviso to s.127(1) of the Income-Tax Act, 1961? Specifically, whether the requirement to record reasons for transfer applies even when transfer is from one Income-tax Officer to another in the same city, locality or place.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Impugned orders invalid because Board failed to comply with mandatory requirement under s.127(1) to record reasons for transfer, even though proviso dispensed with opportunity of hearing.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "s.127(1) of Income-Tax Act, 1961"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Proviso to s.127(1) dispenses with requirement of giving opportunity where transfer is within same city/locality, and recording reasons is not required for such administrative transfers.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Proviso to s.127(1); s.124(3) of Income-Tax Act, 1961"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Opportunity of hearing under s.127(1) is not obligatory (wherever possible), but recording reasons is mandatory except under proviso. Proviso emphatically dispenses with opportunity for same locality transfers, and recording reasons flows as corollary of opportunity requirement, hence also dispensed with.",
      "addresses_issue": "i1",
      "key_observation": "Such transfers are purely administrative for departmental convenience, no prejudice to assessee."
    },
    {
      "id": "cr2",
      "text": "s.124(3) shows both officers competent; transfers within same locality merely substitute one competent officer for another.",
      "addresses_issue": "i1",
      "key_observation": "No occasion to record reasons as transfers on administrative convenience."
    },
    {
      "id": "cr3",
      "text": "Background from Pannalal Binjraj: observations on opportunity and reasons applied to inter-place transfers, not intra-locality.",
      "addresses_issue": "i1",
      "key_observation": "Legislature incorporated suggestions for significant transfers."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Impugned orders cannot be challenged for not recording reasons, as proviso to s.127(1) dispenses with both opportunity and recording reasons for transfers within same locality.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pannalal Binjraj v. Union of India",
      "citation": "1957 S.C.R. 233",
      "treatment": "followed | referred",
      "relevance": "Validity of transfer provision s.5(7A) of 1922 Act upheld; observations on giving opportunity and recording reasons led to s.127(1) of 1961 Act, but applied to inter-place transfers."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-Tax Act, 1961 (No. 43 of 1961)",
      "sections": [
        "s.127(1)",
        "s.127(2)",
        "s.124(3)"
      ],
      "relevance": "Governs transfer of cases by Commissioner or Board; proviso exempts same locality transfers from opportunity; reasons not required as corollary."
    },
    {
      "name": "Income-tax Act, 1922 (No. 11 of 1922)",
      "sections": [
        "s.5(7A)",
        "s.64(1) and (2)"
      ],
      "relevance": "Predecessor provisions; s.64 fixed assessment place, s.5(7A) allowed transfers upheld in Pannalal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court held that recording of reasons not required for transfers under proviso to s.127(1) within same locality; impugned orders valid; appeals dismissed.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the requirement as to the recording of reasons flows as a natural consequence and corollary of the requirement that a reasonable opportunity should be given to the assessee.\"",
      "speaker": "court",
      "significance": "Explains why reasons dispensed with under proviso."
    },
    {
      "text": "\"Such an order is purely in the nature of an administrative order passed for considerations of convenience of the department and no possible prejudice can be involved in such a transfer.\"",
      "speaker": "court",
      "significance": "Justifies no need for reasons in intra-locality transfers."
    },
    {
      "id": "kq3",
      "text": "\"We would accordingly hold the impugned orders cannot be challenged on the ground that Board has not recorded reasons in directing the transfer.\"",
      "speaker": "court",
      "significance": "Core holding on validity of orders."
    }
  ],
  "_case_id": "1964_69",
  "_label": 0,
  "_text_length": 13474,
  "_extracted_at": "2026-02-10T19:43:21.566782"
}