{
  "metadata": {
    "case_name": "Income-tax Officer, B-III Ward, Bombay v. M/s Lal and Company",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 322 of 1963",
    "date_of_judgment": "1964-04-30"
  },
  "facts": [
    {
      "id": "f1",
      "text": "M/s Lal and Company (assessee) carry on business in Bombay as commission agents.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In the course of assessment proceedings for the year 1954-55 the assessee's books of account were examined by the Income-tax Officer and it was noticed that the assessee had business connections with certain non-resident parties.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On March 12, 1957, the Income-tax Officer issued a notice calling upon the assessee to show cause why in respect of the assessment year 1954-55 the assessee should not be treated under s. 43 of the Indian Income-tax Act, 1922, as an agent in respect of twenty-five non-resident parties named in the notice.",
      "type": "procedural",
      "date": "1957-03-12",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The assessee denied that he had direct dealings with any non-resident party and that in any event the proposed action was barred because the period prescribed for initiation of proceeding had expired, and requested the Income-tax Officer to drop the proceeding.",
      "type": "disputed",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f5",
      "text": "The Income-tax Officer B-III Ward, Bombay issued on March 27, 1957, a notice under s. 34 of the Indian Income-tax Act for assessment of the assessee as an agent of the twenty-five named non-resident parties.",
      "type": "procedural",
      "date": "1957-03-27",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The assessee submitted a return showing his income as nil.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Income-tax Officer held that the transactions disclosed from the books of account of the assessee clearly showed that the assessee had regular business connection with non-resident parties, that through the assessee those non-resident parties were receiving income, profits and gains, and s. 43 was clearly applicable to the assessee there being definite business connection between the assessee and the named non-residents.",
      "type": "material",
      "date": null,
      "source": "income_tax_officer"
    },
    {
      "id": "f8",
      "text": "The Income-tax Officer treated the assessee as agent of the non-resident parties, under s. 43 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Income-tax Officer rejected the contention of the assessee that action under s. 34 was barred at the date of the notice issued to the assessee. Relying upon the first proviso to s. 34(1)(b)(iii) inserted by the Finance Act, 1956, the Income-tax Officer held that the Legislature had by amendment extended the time-limit in clear and express terms so as to cover action under s. 34 against a person on whom the assessment or reassessment is to be made as an agent of a non-resident person under s. 43 of the Act for the assessment year 1954-55.",
      "type": "disputed",
      "date": null,
      "source": "income_tax_officer"
    },
    {
      "id": "f10",
      "text": "The Income-tax Officer assessed the income of the assessee at Rs. 60,684, estimating the income of the parties residing outside the taxable territories, in the absence of accounts to be Rs. 50,000.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The assessee filed a petition under Art. 226 of the Constitution in the High Court of Judicature at Bombay praying that a writ in the nature of mandamus or prohibition do issue restraining and prohibiting the Income-tax Officer from giving effect to or taking any steps or proceedings by way of recovery or otherwise in pursuance of the orders of assessment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The assessee pleaded, inter alia, that the proceedings for assessment under s. 34 of the Act commenced by the Income-tax Officer after the expiry of one year from the end of the assessment year 1954-55 were without the authority of law.",
      "type": "disputed",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f13",
      "text": "The High Court of Bombay, following its earlier judgment in S. C. Prashar v. Vasantsen Dwarkadas, held that at the date when the notice was issued, by reason of the proviso which was in operation under s. 34(1) in respect of the assessment year 1954-55 the notice was out of time and that the period provided thereby could not be extended by the Finance Act of 1956 so as to authorise the Income-tax Officer to issue a notice for assessment or reassessment of the assessee as statutory agent of a party, residing outside the taxable territory.",
      "type": "procedural",
      "date": "1958-04-01",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "In the view of the High Court the notice dated March 27, 1957, was invalid, and a valid notice being a condition precedent to the exercise of jurisdiction under s. 34, the proceeding under s. 34 was not maintainable.",
      "type": "holdings",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Against the order of the High Court issuing writs prayed for by the assessee, with certificate of fitness this appeal is preferred by the Income-tax Officer, Bombay.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The period under the unamended s.34 proviso (iii) for notice against agent u/s 43 expired on March 31, 1956.",
      "type": "background",
      "date": "1956-03-31",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Finance Act, 1956 s.18 amended s.34 extending period to two years from end of assessment year for agents u/s 43.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Income-tax Officer may issue a notice of assessment to a person as an agent of a non-resident party under the amended provision of s.34 (by Finance Act 1956) when the period prescribed for such a notice had before the amended Act came into force expired?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The amendment by Finance Act 1956 s.18 extends the time-limit expressly to cover action under s.34 against agent u/s 43 for 1954-55.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Finance Act 1956 s.18; first proviso to s.34(1)(b)(iii)"
    },
    {
      "id": "pa2",
      "text": "At no time was the Income-tax Officer bereft of authority to issue notice u/s 34; till midnight March 31, 1956 under unamended, thereafter under amended; no fractions of day considered per General Clauses Act s.5(3).",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "General Clauses Act s.5(3); Tomlinson v. Bullock; English v. Cliff"
    },
    {
      "id": "pa3",
      "text": "Amending Act continues old statute with modifications; new statute construed as continuation.",
      "supporting_facts": [],
      "legal_basis": "Bear Lake River... v. William Garland; Pacific Mail S.S. Co. v. Joliffe"
    },
    {
      "id": "pa4",
      "text": "S.34 lays down rule of limitation; law of limitation in force at date of institution governs; period is procedural bar not vested right.",
      "supporting_facts": [],
      "legal_basis": "Baleswar v. Latafat"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Assessee had no direct dealings with non-residents.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Action under s.34 barred as notice after expiry of one year from end of 1954-55.",
      "supporting_facts": [
        "f4",
        "f12"
      ],
      "legal_basis": "s.34 Indian Income-tax Act 1922 (unamended)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Power to issue notice under unamended Act ended on March 31, 1956; no notice could thereafter be issued under that Act. Amendment subject to principle that unless otherwise provided if right to act under earlier statute has come to an end, it could not be revived by subsequent amendment which extended period.",
      "addresses_issue": "i1",
      "key_observation": "Right to issue notice under earlier Act came to an end before new Act came into force."
    },
    {
      "id": "cr2",
      "text": "No determinable point of time between expiry and commencement affects the rule; no overlapping period.",
      "addresses_issue": "i1",
      "key_observation": "Legislature must expressly give power notwithstanding expiry or provide overlapping."
    },
    {
      "id": "cr3",
      "text": "Tomlinson and English cases inapplicable.",
      "addresses_issue": "i1",
      "key_observation": "Distinguished as not applying to revival after expiry."
    },
    {
      "id": "cr4",
      "text": "US cases on continuation inapplicable; not re-enactment; limited retrospective operation to April 1, 1956.",
      "addresses_issue": "i1",
      "key_observation": "No intention to give greater retrospectivity."
    },
    {
      "id": "cr5",
      "text": "Period under s.34 is not mere limitation but fetter on power to assess escaped income; creates bar against machinery, not exemption or absolution.",
      "addresses_issue": "i1",
      "key_observation": "Quoted Ahmedabad Mfg... : periods create bar against machinery; liability enforceable if bar removed expressly."
    },
    {
      "id": "cr6",
      "text": "Calcutta Discount case distinguished: there amending Act deemed in force before expiry; here expiry before amendment.",
      "addresses_issue": "i1",
      "key_observation": "No revival of lapsed right."
    },
    {
      "id": "cr7",
      "text": "Proceeding for assessment not a suit; ITO administrative authority, not judicial.",
      "addresses_issue": "i1",
      "key_observation": "Cited Commissioner of Inland Revenue v. Sneath; Shell Co."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Authority of ITO under Act before amendment having come to an end on March 31, 1956, amending provision does not assist to commence proceeding even if within new period; notice invalid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "S. C. Prashar v. Vasantsen Dwarkadas",
      "citation": null,
      "treatment": "followed",
      "relevance": "High Court followed this to hold notice out of time"
    },
    {
      "case_name": "Tomlinson v. Bullock",
      "citation": "1879 4 Q.B.D. 230",
      "treatment": "distinguished",
      "relevance": "Counsel relied on fractions of day; court held inapplicable"
    },
    {
      "case_name": "English v. Cliff",
      "citation": "1914 2 Ch. D. 376",
      "treatment": "distinguished",
      "relevance": "Counsel relied on; court held inapplicable"
    },
    {
      "case_name": "Bear Lake River Water Works... v. William Garland",
      "citation": "164 U.S. 1",
      "treatment": "distinguished",
      "relevance": "US rule on continuation; inapplicable to Indian statutes and facts"
    },
    {
      "case_name": "Pacific Mail S. S. Co. v. Joliffe",
      "citation": "69 U.S. (2 Wall) 459",
      "treatment": "distinguished",
      "relevance": "US rule on substitution; inapplicable"
    },
    {
      "case_name": "Baleswar v. Latafat",
      "citation": "I.L.R. 24 Pat. 249",
      "treatment": "referred",
      "relevance": "Counsel relied on limitation as procedure; authority weakened"
    },
    {
      "case_name": "Ahmedabad Manufacturing and Calico Printing Co. Ltd. v. S. C. Mehta",
      "citation": "1963 SUPP. 2 S.C.R. 92",
      "treatment": "followed",
      "relevance": "s.34 periods create bar against machinery, not absolution"
    },
    {
      "case_name": "Income-tax Officer... v. Calcutta Discount Company Ltd.",
      "citation": "23 I.T.R. 471",
      "treatment": "distinguished",
      "relevance": "Amendment deemed in force before expiry; unlike here"
    },
    {
      "case_name": "Commissioner of Inland Revenue v. Sneath",
      "citation": "17 T.C. 149",
      "treatment": "followed",
      "relevance": "Assessment not judicial proceeding"
    },
    {
      "case_name": "Shell Company of Australia Ltd. v. Federal Commissioner of Taxation",
      "citation": "1931 A.C. 275",
      "treatment": "followed",
      "relevance": "Assessment administrative"
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 34",
        "s. 43",
        "s. 22(2)",
        "s. 35"
      ],
      "relevance": "Notice u/s 34 for reassessment as agent u/s 43; time limits in proviso to s.34(1)(b)(iii)"
    },
    {
      "name": "Finance Act, 1956",
      "sections": [
        "s. 18"
      ],
      "relevance": "Amended s.34 extending time from 1 to 2 years for agents u/s 43; limited retrospective to April 1, 1956"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "Petition for writ of mandamus/prohibition against ITO"
    },
    {
      "name": "General Clauses Act",
      "sections": [
        "s. 5(3)"
      ],
      "relevance": "Act comes into operation immediately on expiration of preceding day; relied by counsel"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Bombay High Court's order quashing the notice u/s 34 dated March 27, 1957, as the period under unamended s.34 had expired on March 31, 1956, and the Finance Act 1956 amendment does not revive the lapsed right to issue notice.",
    "relief_granted": "Writs of mandamus or prohibition restraining ITO from proceeding with assessment upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"unless otherwise provided if the right to act under the earlier statute has come to an end, it could not be revived by the subsequent amendment which extended the period of limitation.\"",
      "speaker": "court",
      "significance": "Core principle rejecting revival of lapsed limitation period"
    },
    {
      "text": "\"The period prescribed by s. 34 for assessment or re-assessment is not a period of limitation. The section in terms imposes a fetter upon the power of the Income-tax Officer to bring to tax escaped income.\"",
      "speaker": "court",
      "significance": "Distinguishes s.34 time bar from ordinary limitation"
    },
    {
      "text": "\"these periods of time... merely create a bar... against the machinery set up by the Income-tax Act... They do not create an exemption in favour of the assessee or grant an absolution on the expiry of the period.\"",
      "speaker": "court",
      "significance": "Explains nature of time bars in Income-tax Act"
    }
  ],
  "_case_id": "1964_222",
  "_label": 0,
  "_text_length": 24425,
  "_extracted_at": "2026-02-10T19:45:50.289768"
}