{
  "metadata": {
    "case_name": "Appellant (Grandson of Ramdhan's uncle) v. Sitabai and others",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Civil Appeal No. 758 of 1963",
    "date_of_judgment": "1964-02-17"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Ramdhan alleged to have executed will on May 23, 1947 at Hyderabad, bequeathing almost entire property (16 fields assessed at Rs. 425/- land revenue, five houses, a shop, movables: 800 tolas gold, 1000 tolas silver, Rs. 50,000 cash, Rs. 15,000 due from debtors, cattle, implements, utensils) to appellant, grandson of one of Ramdhan's predeceased uncles; widow Sitabai given maintenance of Rs. 40/- per month; three married daughters practically excluded.",
      "type": "material",
      "date": "1947-05-23",
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Strained relations between Ramdhan and Sitabai in his last days; appellant claims Ramdhan suspected Sitabai of trying to poison him.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Ramdhan died on October 31, 1948; Sitabai came into possession of property; appellant did not disturb her possession initially, allowed her to manage on his behalf.",
      "type": "material",
      "date": "1948-10-31",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Sitabai later gave away portions of property to daughters and strangers despite knowing of will.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Ramdhan resident of Peepalgaon, Parbhani district; all property located there.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant instituted suit in District Court, Parbhani for possession based on will.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Sitabai denied execution of will, denied appellant's relationship with Ramdhan; claimed exclusive possession as helpless widow without male issue; challenged some movables.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Madanlal joined as party claiming adoption by Ramdhan in Chait Samvat 1999 per Udaipur custom; challenged will.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Sitabai died during suit; daughters Champabai, Rambhabai, Rajubai and son-in-law Ram Pershad brought on record as LRs.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Trial Court (District Court Parbhani): held appellant related to Ramdhan as claimed, will genuine, negatived Madanlal's adoption; decreed suit for appellant.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court (Bombay): will not genuine; dismissed suit.",
      "type": "procedural",
      "date": "February [year not specified, prior to 1964]",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appellant's witnesses: himself, scribe Venkat Rajaram (layman, Jagirdari profession), attesting witnesses Raja Kaniahprasad, Rasheeduddin Ahmed, Wamanlal; some for entrustment to Sitabai.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Respondents' evidence: Ramdhan at village 300 miles from Hyderabad till afternoon previous day (May 22, 1947); could not reach Hyderabad by noon May 23.",
      "type": "disputed",
      "date": "1947-05-22",
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Will executed at appellant's house in Hyderabad where he resides and practices as medical practitioner; no reason for execution there not Peepalgaon.",
      "type": "disputed",
      "date": "1947-05-23",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Ghanegaon (where Ramdhan was May 22 afternoon) 8 miles from Peepalgaon, nearest rail 20 miles; highly improbable Ramdhan in Hyderabad by noon.",
      "type": "disputed",
      "date": "1947-05-22",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "No particular reason for will execution; Ramdhan in good health.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Scribe and attesting witnesses not Ramdhan's friends but appellant's friends/neighbours.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Will on flimsy paper, high-flown Urdu (Ramdhan spoke Urdu but illiterate in it; signature in Modi script); reverse side shows cramming suggesting signature pre-existed.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Will unnatural: no residence for widow, only Rs.40/pm maintenance; paltry to daughters despite no male issue; entire to distant relative not brought up by or caring for Ramdhan.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Despite strained relations, Ramdhan lived with Sitabai till death; no alternate arrangement for valuables; food cooked by her.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f21",
      "text": "Appellant took active part: will at his house, his associates involved.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "No registration of will; not produced immediately after death; Sitabai continued possession of movables long after, no demand or list taken.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the will alleged to have been executed by Ramdhan on May 23, 1947 is genuine or a fabrication.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the approach of the High Court to evidence was erroneous by first considering circumstances then judging witness credibility.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court wrongly first considered suspicious circumstances then judged witness credibility with suspicious eye.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Kristo Gopal v. Baidya Nath (AIR 1939 Cal 87); Chotey Narain Singh v. Mt. Ratan Koer"
    },
    {
      "id": "pa2",
      "text": "Attesting witnesses gave clear consistent testimony; requires strong circumstances to repel; suspicion must be inherent, not from conflict.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Kristo Gopal v. Baidya Nath"
    },
    {
      "id": "pa3",
      "text": "No motive enquiry relevant if execution proved.",
      "supporting_facts": [],
      "legal_basis": "Kristo Gopal v. Baidya Nath"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Will prepared under highly suspicious circumstances; propounder's evidence unsatisfactory; indicates fabrication without Ramdhan's knowledge.",
      "supporting_facts": [
        "f13",
        "f14",
        "f15",
        "f16",
        "f17",
        "f18",
        "f19",
        "f20",
        "f21"
      ],
      "legal_basis": "Sarat Kumari Bibi v. Sakhi Chand (1928 LR 56 IA 62)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Court can consider surrounding circumstances and probabilities along with witness testimony to judge credibility; not confined to demeanour.",
      "addresses_issue": "i2",
      "key_observation": "Evidence cannot be considered separately from circumstances."
    },
    {
      "id": "cr2",
      "text": "Proof of wills requires satisfaction of prudent mind; suspicious circumstances (unnatural disposition, propounder active role, etc.) require propounder to remove suspicion completely.",
      "addresses_issue": "i1",
      "key_observation": "Initial onus heavier; propounder must satisfy court's conscience."
    },
    {
      "id": "cr3",
      "text": "Suspicious circumstances not removed: improbable presence, execution at appellant's house with his associates, flimsy paper, language mismatch, cramming suggesting pre-existing signature, unnatural provisions, no safeguards despite distrust, no registration/immediate production.",
      "addresses_issue": "i1",
      "key_observation": "Appellant's evidence incredible; allowed Sitabai possession without precautions."
    },
    {
      "id": "cr4",
      "text": "High Court rightly rejected evidence after analysis; no reason to differ.",
      "addresses_issue": "i1",
      "key_observation": "Suspicion not removed by iota of evidence."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Will not genuine; High Court right in rejecting evidence of execution and attestation.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court's approach to evidence correct; circumstances properly considered with testimony.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sarat Kumari Bibi v. Sakhi Chand",
      "citation": "1928 L.R. 56 I.A. 62",
      "treatment": "followed",
      "relevance": "Proof required where suspicion aroused; propounder must remove suspicion."
    },
    {
      "case_name": "Kristo Gopal v. Baidya Nath",
      "citation": "A.I.R. 1939 Cal 87",
      "treatment": "referred",
      "relevance": "Court should not prejudge will false then view witnesses suspiciously; strong circumstances needed against consistent testimony."
    },
    {
      "case_name": "Chotey Narain Singh v. Mt. Ratan Koer",
      "citation": "22 A. 12",
      "treatment": "referred",
      "relevance": "Improbability must be clear, approaching impossibility to prevail against evidence."
    },
    {
      "case_name": "H. Venkatachala Iyengar v. B. N. Thimmajamma",
      "citation": "1959 S.C.R. Supp. 1, 426",
      "treatment": "followed",
      "relevance": "Mode of proof of wills; suspicious circumstances require complete removal; propounder's active role suspicious."
    },
    {
      "case_name": "Shashi Kumar Banerjee v. Subodh Kumar Banerjee",
      "citation": "Civil Appeal No. 295 of 1960, decided September 13, 1963",
      "treatment": "referred",
      "relevance": "Onus on propounder to explain suspicions; examples of suspicious circumstances."
    },
    {
      "case_name": "Tyrrell v. Painton",
      "citation": "1894 P. 151",
      "treatment": "referred",
      "relevance": "Where suspicion excites, propounder must prove testator knew and approved contents."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Succession Act",
      "sections": [
        "Section 63"
      ],
      "relevance": "Special requirement of attestation for wills."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court's dismissal of appellant's suit, holding the alleged will not genuine based on suspicious circumstances not removed by propounder's evidence.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "in all cases in which a will is prepared under circumstances which arouse the suspicion of the Court that it does not express the mind of the testator, it is for the propounder of the will to remove that suspicion.",
      "speaker": "court",
      "significance": "States standard of proof from Sarat Kumari Bibi."
    },
    {
      "text": "the propounder must satisfy the conscience of the Court that the document upon which he relies is the last will and testament of the testator.",
      "speaker": "court",
      "significance": "Core holding on onus in suspicious cases from Venkatachala Iyengar."
    },
    {
      "text": "There is not an iota of evidence in this regard, and we are not satisfied that the suspicion created by the circumstances referred to by us has been removed.",
      "speaker": "court",
      "significance": "Court's conclusion on failure to discharge onus."
    }
  ],
  "_case_id": "1964_212",
  "_label": 0,
  "_text_length": 25260,
  "_extracted_at": "2026-02-10T19:45:42.866836"
}