{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. Kumbakonam Mutual Benefit Fund Ltd.",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "SIKRI J."
    ],
    "case_number": "Civil Appeals Nos. 6376 and 6377 of 1963",
    "date_of_judgment": "1964-05-07"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, the Kumbakonam Mutual Benefit Fund Ltd., hereinafter referred to as the assessee, is a company incorporated under the Indian Companies Act, 1882, limited by shares. Since 1938, the nominal capital of the assessee is Rs. 33,00,000 divided into shares of Re. 1 each.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "It carries on banking business restricted to its shareholders, i.e., the shareholders are entitled to participate in the various recurring deposit schemes of the assessee or to obtain loans on security.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Recurring deposits are obtained from members for fixed amounts to be contributed monthly by them for a fixed number of months as stipulated at the end of which a fixed amount is returned to them according to published tables. The amount so returned will cover the compound interest of the period.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "These recurring deposits constitute the main source of funds of the assessee for advancing loans. Such loans are restricted only to members who have, however, to offer substantial security, therefor, by way of either the paid up value of their recurring deposits, if any, or immovable properties within the Tanjore district.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Out of the interest realised by the assessee on the loans which constitute its main income, interest on the recurring deposits aforesaid are paid as also all the other outgoings and expenses of management and the balance is divided among the members pro rata according to their shareholdings after making provision for reserves, etc., as required by the Memorandum of Articles aforesaid.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The shareholders who are thus entitled to participate in the profits need not have either taken loans or have made recurring deposits.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Income-Tax Officer assessed the entire profits for eight years from 1946-47 to 1953-54.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In a detailed and closely reasoned order, dated February 29, 1952, which is part of the statement of the case, passed in respect of the assessment year 1947-48, the Income Tax Officer held that New York Life Assurance Company v. Styles did not apply to the facts of this case.",
      "type": "procedural",
      "date": "1952-02-29",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The Income Tax Officer distinguished Styles case thus: Whereas the New York Life Assurance Company paid to its members what it had saved, the assessee fund pays to its members what it has earned. A shareholder in the New York Life Assurance Company did not get back anything more than what he contributed, a shareholder of the Kumbakonam Mutual Benefit Fund does on the other hand get more than what he contributes.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "A fixed depositor gets back on maturity of the deposit not only the amount he deposited but also the interest thereon. A recurring depositor who pays, say a rupee each month for eighty-six months does not get back Rs. 86 only, or something less, but Rs. 100, the balance of Rs. 14 representing the interest on his deposit.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "From the point of view of the individual member, an investment in the assessee fund is just like any other lucrative investment and his primary object in investing his money with the fund is the income, which comes to him in the guise of interest or dividend.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Relying on Rowlatt, J.'s observations in Thomas v. Richard Evans Co. Ltd., that it does not come back to them as purchasers or customers it comes back to them as shareholders upon their shares, the Income Tax Officer held that the profits made by the fund belong to them as shareholders and not as borrowers from the fund or in the capacity of individuals who have in any way utilised the facilities afforded by the fund.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "There should firstly be a common fund and then it must be proved that the contributors to this common fund and the participators in the surplus are one and the same. As far as I can see, there is no common fund in this case.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "The income of the assessee is derived from interest on loans lent to its members, interest on Government securities, rents from property, etc., and it is distributed to the members either in the shape of guaranteed interest or dividends or both.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "As far as the allegedly mutual transactions of the assessee are concerned, the contributors to the income of the company are those members who have borrowed from the assessee and paid interest on their borrowings. If the requirement of the complete identity between contributors and participators were to be satisfied, then the above contributors should also be entitled to participate in the profits.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "A shareholder may not hold any deposit with the fund and may not utilise the borrowing facilities afforded by the fund but may be content to receive such dividend as is declared.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "The Appellate Assistant Commissioner, on appeal, upheld the order of the Income Tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "It was urged before him, inter alia, that the decision in the case of Board of Revenue Madras v. The Mylapore Hindu Permanent Fund Ltd., applied to the facts because the capital was also fluctuating in this case. He, however, held that it was not a case of fluctuating capital but only a steady increase of capital.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "A shareholder need not be a subscriber to the fixed or recurring deposits, and a shareholder may not participate in the interest earnings if no dividend is declared.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "On further appeal, the Income Tax Appellate Tribunal held that the funds claim that it is in reality a mutual benefit society is untenable. The cardinal requirement is that all the contributors to the common fund must be able to participate in the surplus and that all the participators in the surplus must be contributors to the common fund. In other words, complete identity between the contributors and the participators is essential.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "Firstly, there is no common fund. Secondly, the shareholders may or may not receive a dividend. But those shareholders who contribute to the recurring deposits of various duration receive guaranteed interest. The persons who contribute to the income of the company are those shareholders who borrow from the appellant and pay interest on their borrowings.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f22",
      "text": "Out of the income so derived, the guaranteed interest to the shareholders who make monthly deposits, receive guaranteed interest but the shareholders who do not contribute monthly deposits may or may not receive any dividend. Thus, the complete identity between contributors and participators does not exist.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f23",
      "text": "The nature of the business of the appellant is that of ordinary banking though the business is restricted to its members or shareholders only. This restriction does not in the least take the income of the appellant out of the purview of the charging sections of the Act.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f24",
      "text": "The Appellate Tribunal stated a consolidated case in respect of the assessment years, 1946-47 to 1953-54, and referred the following questions to the High Court: Whether there were materials for the Tribunal to hold that the assessee is a banking concern assessable under Section 10 for all the assessment years and not exempt.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f25",
      "text": "The High Court answered the question in the negative, and awarded costs Rs. 250. It further ordered the refund to the assessee of the institution fee of Rs. 100 for each of the references as part of the costs to which as successful assessee it will be entitled to.",
      "type": "procedural",
      "date": "1960-10-20",
      "source": "lower_court"
    },
    {
      "id": "f26",
      "text": "The High Court, after a review of the cases cited before it, came to the conclusion that the assessee satisfied the conditions necessary for the applicability of Styles case. According to it, the facts that the benefits of the association are available only to members thereof and no non-member can participate in the benefits, and that the profits that arise from this mutual trading are the result of the interest collected from members who take advantage of the loans offered by the fund and also of the default interest paid by members who delay payment of recurring deposits, and that the profit after payment of interest to depositors and after meeting the other expenses of administration of the fund are available for distribution among the entire body of the members, showed that there was complete mutuality.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f27",
      "text": "What is accordingly required is that both the right to contribute and the right to participate must be available to an identical body and it is not necessary that every member should contribute before he can be allowed to participate.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f28",
      "text": "The High Court certified the cases as being fit for appeal to this Court, under s. 66A of the Indian Income Tax Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether there were materials for the Tribunal to hold that the assessee is a banking concern assessable under Section 10 for all the assessment years and not exempt.",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "Whether the Styles case covers the facts of this case. In other words, has the cardinal requirement, namely, that all the contributors to the common fund must be entitled to participate in the surplus and that all the participators in the surplus must be contributors to the common fund in other words, there must be complete identity between the contributors and the participators, been satisfied?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "New York Life Assurance Company v. Styles does not apply; assessee pays what it earned, not saved; shareholders get more than contributed; investment like lucrative investment for income as interest or dividend.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": "Thomas v. Richard Evans Co. Ltd."
    },
    {
      "id": "pa2",
      "text": "Profits belong to shareholders as such, not as borrowers or users of facilities.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "No common fund; contributors (borrowers paying interest) not identical to participators; shareholder may not deposit or borrow but receive dividend.",
      "supporting_facts": [
        "f13",
        "f14",
        "f15",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "High Court's test unsound: not that all participators entitled to contribute, but all must be contributors; essence of mutuality is return of what one contributed.",
      "supporting_facts": [
        "f27"
      ],
      "legal_basis": "Styles case; Municipal Mutual Insurance Limited v. Hills; Royal Western Indian Turf Club Ltd."
    },
    {
      "id": "pa5",
      "text": "Shareholder entitled to participate in profits without contributing by taking loans; entitled to dividend as long as holds share, no other condition; position not different from shareholder in banking company.",
      "supporting_facts": [
        "f6",
        "f21"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Assessee satisfies conditions for applicability of Styles case; benefits only to members, no non-member participation; profits from interest from members' loans and default interest on deposits; profits after expenses distributed to entire body of members = complete mutuality.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5",
        "f26"
      ],
      "legal_basis": "Styles case"
    },
    {
      "id": "ra2",
      "text": "Both right to contribute and right to participate available to identical body; not necessary every member contribute before participate.",
      "supporting_facts": [
        "f27"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Decision in Board of Revenue Madras v. The Mylapore Hindu Permanent Fund Ltd. applies as capital fluctuating.",
      "supporting_facts": [
        "f18"
      ],
      "legal_basis": "Board of Revenue Madras v. The Mylapore Hindu Permanent Fund Ltd."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Most of the cases reviewed in Commissioner of Income Tax v. Royal Western Indian Turf Club Ltd.; companies limited by shares on different footing from those by guarantee.",
      "addresses_issue": "i2",
      "key_observation": "Principle that no one can make profit out of himself may lead to confusion; company can make profit out of members; profit belongs to members qua shareholders, not as contributors."
    },
    {
      "id": "cr2",
      "text": "In Dibrugarh District Club Ltd., Calcutta High Court distinguished Styles; if profits distributed to shareholders as shareholders, mutuality not satisfied.",
      "addresses_issue": "i2",
      "key_observation": "Rowlatt J. in Thomas v. Richard Evans: company can make profit out of members as customers; profit belongs qua shareholders, comes back as shareholders."
    },
    {
      "id": "cr3",
      "text": "Test applied by High Court not sound, not consistent with true decision in Styles as understood by this Court; Lord Macmillan: all participators must be contributors, not merely entitled to contribute.",
      "addresses_issue": "i2",
      "key_observation": "Essence of mutuality: return of what one contributed to common fund."
    },
    {
      "id": "cr4",
      "text": "National Association case for unincorporated association; property belongs to members; different for company.",
      "addresses_issue": "i2",
      "key_observation": "In company, must look if subscribers and participants same."
    },
    {
      "id": "cr5",
      "text": "Madras cases like Mylapore, Sivaganga, Tanjore not correctly based on Styles; point of shareholders participating as shareholders not raised or considered.",
      "addresses_issue": "i2",
      "key_observation": "Difficult to hold Styles applies; assessee like ordinary bank restricted to shareholders."
    },
    {
      "id": "cr6",
      "text": "Assessee's income from business within S.10; restriction to shareholders does not exempt.",
      "addresses_issue": "i1",
      "key_observation": "Answer to question should be affirmative."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The assessee is a banking concern assessable under Section 10 for all the assessment years and not exempt.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Styles case does not apply; no complete identity between contributors and participators as shareholders can receive profits without contributing via deposits or loans.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "New York Life Assurance Company v. Styles",
      "citation": "2 T.C. 460",
      "treatment": "distinguished",
      "relevance": "Does not apply as assessee pays earnings, shareholders get more than contributed; no common fund with complete identity."
    },
    {
      "case_name": "Thomas v. Richard Evans Co. Ltd.",
      "citation": "12 T.C. 790",
      "treatment": "followed",
      "relevance": "Profits to shareholders qua shareholders, not as customers or contributors."
    },
    {
      "case_name": "Board of Revenue Madras v. The Mylapore Hindu Permanent Fund Ltd.",
      "citation": "1924 I.L.R. 47 Mad. 1",
      "treatment": "distinguished",
      "relevance": "Not correctly based on Styles; capital steady increase not fluctuating; shareholders participate as such."
    },
    {
      "case_name": "Commissioner of Income Tax v. Royal Western Indian Turf Club Ltd.",
      "citation": "1954 S.C.R. 289",
      "treatment": "followed",
      "relevance": "Reviews mutuality cases; company can profit from members qua shareholders; identity in character of contributors and participators essential."
    },
    {
      "case_name": "Municipal Mutual Insurance Limited v. Hills",
      "citation": "16 T.C. 430",
      "treatment": "referred",
      "relevance": "Cardinal requirement of complete identity between contributors and participators."
    },
    {
      "case_name": "Dibrugarh District Club Ltd. v. The Commissioner of Income Tax, Assam",
      "citation": "2 I.T.C. 521",
      "treatment": "followed",
      "relevance": "Profits to shareholders as such negate mutuality."
    },
    {
      "case_name": "The National Association of Local Government Officers v. Watkins",
      "citation": "18 T.C. 499",
      "treatment": "distinguished",
      "relevance": "For unincorporated association; property of members."
    },
    {
      "case_name": "Ismailia Grain Merchants Association v. Commissioner of Income Tax",
      "citation": "A.I.R. 1958 Bom. 32",
      "treatment": "distinguished",
      "relevance": "Failed to notice separate entity difference."
    },
    {
      "case_name": "The Madura Hindu Permanent Fund Ltd. v. The Commissioner of Income Tax",
      "citation": "A I.T.C 326",
      "treatment": "referred",
      "relevance": "Mylapore not rightly based on Styles."
    },
    {
      "case_name": "The Sivaganga Shri Meenakshi Swadeshi Saswatha Nidhi Ltd. v. The Commissioner of Income Tax",
      "citation": "8 I.T.C 83",
      "treatment": "distinguished",
      "relevance": "Applied Mylapore without reasons."
    },
    {
      "case_name": "Tanjore Permanent Fund v. Commissioner of Income Tax",
      "citation": "5 I.T.R. 160",
      "treatment": "distinguished",
      "relevance": "Refused to disturb practice but noted not proper shareholders."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act",
      "sections": [
        "Section 10",
        "s. 66A"
      ],
      "relevance": "Assessee assessable as banking concern under S.10; reference under s.66A."
    },
    {
      "name": "Indian Companies Act, 1882",
      "sections": [],
      "relevance": "Assessee incorporated as company limited by shares."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeals are accepted; answer to the question referred is in the affirmative that assessee is banking concern assessable under S.10 and not exempt.",
    "relief_granted": "None to assessee; High Court decision reversed.",
    "costs": "No costs, in view of Mylapore Fund case holding field in Madras since 1923."
  },
  "key_quotes": [
    {
      "text": "\"the cardinal requirement, namely, that all the contributors to the common fund must be entitled to participate in the surplus and that all the participators in the surplus must be contributors to the common fund in other words, there must be complete identity between the contributors and the participators\"",
      "speaker": "court",
      "significance": "Defines test for mutuality."
    },
    {
      "text": "\"There is nothing per se to prevent a company from making a profit out of its own members... but that profit belongs to the members as shareholders and does not come back to them as persons who had contributed them.\"",
      "speaker": "court",
      "significance": "From Royal Western Turf Club; clarifies companies can profit from members qua shareholders."
    },
    {
      "text": "\"it comes back to them as shareholders, upon their shares.\"",
      "speaker": "court",
      "significance": "From Thomas v. Richard Evans; profits as shareholders negate mutuality."
    },
    {
      "text": "\"A shareholder in the assessee company is entitled to participate in the profits without contributing to the funds of the company by taking loans. He is entitled to receive his dividend as long as he holds a share.\"",
      "speaker": "court",
      "significance": "No complete identity; fails mutuality test."
    }
  ],
  "_case_id": "1964_120",
  "_label": 1,
  "_text_length": 20756,
  "_extracted_at": "2026-02-10T19:44:23.627957"
}