{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Patna v. Rani Bhuwaneshwari Kuer",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 620 of 1963",
    "date_of_judgment": "1964-04-28"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Rani Bhuwaneshwari Kuer (assessee) was proprietor of seven-sixteenth share in Tekari Raj, inherited from parents, later acquired major portion of remaining nine-sixteenth share by purchase.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Estate heavily encumbered; assessee executed indenture of trust dated January 20, 1941, conveying Tekari Raj and certain zamindari properties to named trustees to liquidate debts.",
      "type": "material",
      "date": "1941-01-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Principal beneficiaries under deed: assessee, her husband, and five sons, after payment of debts.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Clause 23: Trustees to divide surplus net rents, issues, profits in proportions set out.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Clauses 24 and 25: Devolution of beneficial interest on death of beneficiaries.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Clause 41: After payment of debts in Sch. D, settlor entitled to make permanent trust for Tekari Forts maintenance, Durga Puja, etc.; if settlor dies before, trustees to set apart property yielding Rs. 20,000 net income for those purposes.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Clause 42: Trust terminates after payment of Sch. D debts or death of last son, whichever last occurs.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Clause 43: Challenge to 1939 Indenture forfeits beneficiary rights; breach excludes beneficiary; settlor may revoke or vary during life, but not before Sch. D debts paid.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Deed modified by rectification dated December 22, 1941: Assessee has power to revoke or vary during lifetime, but not affecting Sch. D debts.",
      "type": "material",
      "date": "1941-12-22",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Deed of amendment dated January 12, 1942: Cancelled/amended various clauses; para 23: surplus divided in seven equal shares; para 24: on son's death, share to heirs; para 42 modified: terminates after debts or extinguishment of Thicca leases to Maharajadhiraj of Darbhanga or Capt. Maharaj Kumar Gopal Saran Narain Singh, whichever last; para 42a: then partition; para 45: settlement permanent, unalterable, irrevocable re interests created, until debts discharged and leases effective.",
      "type": "material",
      "date": "1942-01-12",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Thicca lease to Maharajadhiraj of Darbhanga till 1965; to Capt. Maharaj Kumar Gopal Saran Narain Singh till 1954.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Assessment year 1947-48: ITO rejected assessee's contention, taxed trust income as assessee's under s.16(1)(c); confirmed by AAC.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Tribunal reversed: not revocable trust under s.16(1)(c).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Patna High Court under s.66(2): Referred questions on revocability and taxability; held revocable but third proviso applies, income to other beneficiaries not taxable as assessee's till revocation power arises; assessee taxable on her beneficiary share.",
      "type": "procedural",
      "date": "1961-09-09",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Commissioner appealed to SC with special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the trust created by the assessee is a revocable trust within the meaning of s.16(1)(c) of the Income-tax Act?",
      "framed_by": "high_court"
    },
    {
      "id": "i2",
      "text": "Whether the income from the trust property can be deemed income of the assessee under s.16(1)(c)?",
      "framed_by": "high_court"
    },
    {
      "id": "i3",
      "text": "Applicability of third proviso to s.16(1)(c): whether income to other beneficiaries exempt if not revocable for >6 years and settlor derives no direct/indirect benefit.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Trust revocable within six years as in fact revoked (citing 1946 deed), or per terms revocable within six years.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": "s.16(1)(c) third proviso"
    },
    {
      "id": "pa2",
      "text": "Third proviso does not apply as assessee derives direct benefit as beneficiary.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "s.16(1)(c) third proviso"
    },
    {
      "id": "pa3",
      "text": "Third proviso applies only to actual settlements under principal clause, not deemed revocable under first proviso.",
      "supporting_facts": [],
      "legal_basis": "s.16(1)(c) provisos"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No revocation within six years; power not exercisable till debts paid and Thicca leases expired (post-1954/1965).",
      "supporting_facts": [
        "f8",
        "f10",
        "f11"
      ],
      "legal_basis": "s.16(1)(c)"
    },
    {
      "id": "ra2",
      "text": "Third proviso excludes income to other beneficiaries; settlor's own share taxable separately.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "s.16(1)(c) third proviso"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Plea of actual revocation within six years not raised earlier, unsustainable; recitals in 1946 deed do not indicate revocation.",
      "addresses_issue": "i1",
      "key_observation": "New ground not entertainable."
    },
    {
      "id": "cr2",
      "text": "Per cl.45 (1942 amendment), irrevocable till debts discharged and Thicca leases effective (till 1954/1965); not revocable within six years.",
      "addresses_issue": "i1",
      "key_observation": "Revocation power not exercisable within six years."
    },
    {
      "id": "cr3",
      "text": "Third proviso has two conditions: not revocable >6 years, and settlor no direct/indirect benefit from that income; applies to exclude other beneficiaries' income, not settlor's own.",
      "addresses_issue": "i3",
      "key_observation": "Proviso excludes only income to 'any person' other than settlor."
    },
    {
      "id": "cr4",
      "text": "Third proviso applies even to settlements deemed revocable under first proviso; scheme per Kania J. in Ramji Keshavji.",
      "addresses_issue": "i3",
      "key_observation": "Provisos explanatory; third proviso operates post first."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Trust not revocable within six years per s.16(1)(c); third proviso applies to exempt income to other beneficiaries from inclusion in assessee's income.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Assessee liable to tax on her own beneficiary share.",
      "resolves_issue": "i2",
      "in_favor_of": "partial"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ramji Keshavji v. Commissioner of Income-tax, Bombay",
      "citation": "13 I.T.R. 105",
      "treatment": "followed",
      "relevance": "Scheme of s.16(1)(c) provisos explained by Kania J."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s.16(1)(c)",
        "s.66(2)"
      ],
      "relevance": "Deems settlor's income from revocable settlements; third proviso exempts income to others if not revocable >6 years and no settlor benefit."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upholds Patna High Court: trust income to beneficiaries other than assessee not includible in her income under third proviso to s.16(1)(c); assessee taxable on her share.",
    "relief_granted": "Income of other beneficiaries excluded from assessee's total income.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the third proviso to s. 16(1)(c) does not operate to exclude the income which the settlor receives as a beneficiary, from liability to income-tax it merely excludes that part of the income which is under the deed of settlement given to another person\"",
      "speaker": "court",
      "significance": "Clarifies scope of third proviso."
    },
    {
      "text": "\"By cl. 45 of the deed of amendment the right of revocation was not exercisable till the Thicca leases... remained good and effective\"",
      "speaker": "court",
      "key_observation": "Determines non-revocation within six years."
    }
  ],
  "_case_id": "1964_116",
  "_label": 0,
  "_text_length": 21181,
  "_extracted_at": "2026-02-10T19:44:06.557006"
}