{
  "metadata": {
    "case_name": "Appellants (Tea Estates/Manufacturers) v. State of Kerala",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar C.J.",
      "Shah J.",
      "Sikri J.",
      "Wanchoo J.",
      "Ayyangar J."
    ],
    "case_number": "Civil Appeals Nos. 396-413 of 1963",
    "date_of_judgment": "1964-04-10"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Sales-tax Officer, Special Circle Ernakulam assessed the appellants under the Travancore-Cochin General Sales Tax Act XI of 1125 M.E., to pay sales-tax on transactions of sale of tea chests at the auctions held at Fort Cochin in the years 1956-57 to 1958-59.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellants contended that the sales were exempted from tax by virtue of Art. 286(1)(b) of the Constitution.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Appellants petitioned the High Court of Kerala for writs of certiorari quashing the assessment orders and writs of prohibition restraining collection of tax; Vaidialingam J. rejected the petitions, confirmed by Division Bench.",
      "type": "procedural",
      "date": "1961-10-26",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Tea is a controlled commodity; Parliament enacted Tea Act 19 of 1953 for control of tea industry, including export control, establishing Tea Board.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Under Tea Act: s.3(f) defines export; s.3(g) export allotment; s.17 embargo on export without licence; s.18 no consignment shipped without licence/permit; s.19 Central Govt declares export allotments; s.20 tea estate right to export quota; s.21 right to licences for unexhausted quota, transferable.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Trade in tea in Kerala: Manufacturer obtains export quota rights from Tea Board, sends manufactured tea chests to M/s. T. Stanes & Co. Ltd. for warehousing at Willingdon Island; sold by public auction through brokers at Fort Cochin with export quota rights.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "At auction, bids for tea chests with export quota rights given by agents/intermediaries in Cochin of foreign buyers; delivery to purchasers by T. Stanes; purchasers obtain export licences using quota rights and export.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Sellers know bids are by agents of foreign buyers for purpose of export; tea cannot be exported otherwise than under licence issued to manufacturer or purchaser of quota.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In petitions, appellants set out manner of sales; in some, no affidavits by State; in others, State contended export by purchasers did not affect character of sales.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "No finding by Sales-tax authorities that purchasers were agents of foreign buyers, but case argued on that footing before High Court.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "High Court (Vaidialingam J.): sales complete on acceptance of bids, sellers no concern with export by purchasers.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Division Bench: ban under Art. 286(1)(b) requires intimate connection; sale must be integral part, no obligation to export.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appellants are 18 tea estates growing and manufacturing tea.",
      "type": "background",
      "date": null,
      "source": "dissent"
    },
    {
      "id": "f14",
      "text": "Assessees obtained export quotas; sales at Fort Cochin with transfer of export quota rights to purchasers; purchasers (agents of foreign principals) obtained licences and exported.",
      "type": "material",
      "date": null,
      "source": "dissent"
    },
    {
      "id": "f15",
      "text": "Assessing authorities accepted appellants' statements as correct, no evidence led.",
      "type": "procedural",
      "date": null,
      "source": "dissent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sale by auction of tea chests with export quota rights at Fort Cochin to agents of foreign buyers is a sale in the course of export out of the territory of India within the meaning of Art. 286(1)(b) of the Constitution, exempt from State sales tax.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sales are in the course of export as they occasion export; integral connection with export; sellers know purpose is export by foreign agents.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8",
        "f14"
      ],
      "legal_basis": "Art. 286(1)(b); Tea Act 1953"
    },
    {
      "id": "pa2",
      "text": "Export quota rights transferred with sale; purchasers bound to export as agents fulfilling contractual duty to principals.",
      "supporting_facts": [
        "f7",
        "f14",
        "f15"
      ],
      "legal_basis": "s.21 Tea Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sales complete on acceptance of bids; sellers have no concern with actual export by purchasers; no obligation to export imposed by contract or statute.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "Art. 286(1)(b)"
    },
    {
      "id": "ra2",
      "text": "Tea Act enables but does not compel export; purchasers free to divert to local consumption.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Tea Act ss.17,21"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "To constitute sale in course of export: common intention to export + actual export insufficient; requires series of integrated activities from agreement with foreign buyer to delivery to common carrier; connection so integrated cannot be interrupted without breach.",
      "addresses_issue": "i1",
      "key_observation": "Sale occasions export if bond links contract to exportation inextricably."
    },
    {
      "id": "cr2",
      "text": "Here, knowledge of export intent and sale with quota rights imputes knowledge but no bond; no statutory/contractual obligation to export; sellers lose control post-sale; sales for export, not in course of.",
      "addresses_issue": "i1",
      "key_observation": "No direct connection making sale and export parts of single transaction."
    },
    {
      "id": "cr3",
      "text": "Distinguishes prior cases: sales preceding export sale taxable unless property passes in export stream.",
      "addresses_issue": "i1",
      "key_observation": "Single sale to agent not necessarily in course of export without integral link."
    },
    {
      "id": "cr4",
      "text": "Dissent: Sales to agents of foreign buyers with quota transfer; implicit understanding to export; economic factors compel; integral with export.",
      "addresses_issue": "i1",
      "key_observation": "Real intention and circumstances create obligation; sales occasion export."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Sale in course of export requires integrated activities with inextricable bond between sale and export; mere knowledge/intent to export and sale with quota rights insufficient without obligation linking them.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Transactions here are sales for export, not in course of export; taxable by State.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Travancore-Cochin v. Bombay Co. Ltd.",
      "citation": "1952 S.C.R. 1112",
      "treatment": "followed",
      "relevance": "Sales which occasion export exempt; integrated activities from sale agreement to export."
    },
    {
      "case_name": "State of Travancore-Cochin v. Shanmugha Vilas Cashew Nut Factory",
      "citation": "1954 S.C.R. 53",
      "treatment": "followed",
      "relevance": "'In the course of' implies connected relation; purchases preparatory to export not exempt."
    },
    {
      "case_name": "State of Madras v. Gurviah Naidu & Co. Ltd.",
      "citation": "A.I.R. 1956 S.C. 158",
      "treatment": "followed",
      "relevance": "Purchases after securing foreign orders not occasion export."
    },
    {
      "case_name": "State of Mysore v. Mysore Shipping & Manufacturing Co. Ltd.",
      "citation": "A.I.R. 1958 S.C. 1002",
      "treatment": "followed",
      "relevance": "Sale to licensed exporter who resells for export not in course of export."
    },
    {
      "case_name": "East India Tobacco Co. v. State of Andhra Pradesh",
      "citation": "1963 1 S.C.R. 404",
      "treatment": "followed",
      "relevance": "Only sale under which export made protected; prior purchases not."
    },
    {
      "case_name": "B.K. Wadeyar v. Daulatram Rameshwarlal",
      "citation": "1961 1 S.C.R. 924",
      "treatment": "followed",
      "relevance": "Sales where property passes in export stream exempt even if prior sale."
    },
    {
      "case_name": "State of Madras v. Madura Tanned Leather Co. (Madras High Court)",
      "citation": "13 S.T.C. 629",
      "treatment": "distinguished",
      "relevance": "Sale to agent of foreign buyer may occasion export if privity and integral."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 286(1)(b)"
      ],
      "relevance": "Exempts sales in course of export from State tax; defines via Central Sales Tax Act."
    },
    {
      "name": "Tea Act, 1953",
      "sections": [
        "s.3(f)",
        "s.3(g)",
        "s.17",
        "s.18",
        "s.19",
        "s.20",
        "s.21"
      ],
      "relevance": "Controls tea export; quotas transferable; enables but does not compel export."
    },
    {
      "name": "Central Sales Tax Act, 1956",
      "sections": [
        "s.5"
      ],
      "relevance": "Deems sale in course of export if occasions export or transfer of title after customs frontier."
    },
    {
      "name": "Travancore-Cochin General Sales Tax Act, XI of 1125 M.E.",
      "sections": [],
      "relevance": "Under which assessments made."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "By majority (Shah J. for Gajendragadkar C.J., Shah, Sikri JJ.), appeals dismissed holding sales not in course of export; dissenting (Ayyangar J. for Wanchoo, Ayyangar JJ.) would allow. In accordance with majority, appeals dismissed.",
    "relief_granted": "None",
    "costs": "Dismissed with costs. One hearing fee."
  },
  "key_quotes": [
    {
      "text": "\"A sale in the course of export predicates a connection between the sale and export, the two activities being so integrated that the connection between the two cannot be voluntarily interrupted, without a breach of the contract or the compulsion arising from the nature of the transaction.\"",
      "speaker": "court",
      "significance": "Defines test for 'in the course of export' under Art. 286(1)(b)."
    },
    {
      "text": "\"The sales were therefore for export, and not in the course of export.\"",
      "speaker": "court",
      "significance": "Majority holding on facts."
    },
    {
      "text": "\"The word 'course' etymologically denotes movement from one point to another, and the expression 'in the course of' not only implies a period of time during which the movement is in progress but postulates also a connected relation.\"",
      "speaker": "court",
      "significance": "From Shanmugha Vilas, adopted in reasoning."
    }
  ],
  "_case_id": "1964_221",
  "_label": 0,
  "_text_length": 43160,
  "_extracted_at": "2026-02-10T19:45:37.799251"
}