{
  "metadata": {
    "case_name": "Murarilal v. Dev Karan",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, C.J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Mortgage executed on 19th March 1919 by mortgagor Mangal Ram in favour of mortgagee Gangadhar for Rs. 6,500. Mortgaged property: a shop delivered into possession of mortgagee.",
      "type": "material",
      "date": "1919-03-19",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Mortgage deed stipulated repayment within 15 years, failing which mortgagee becomes owner. Relevant clause: 'After the expiry of the stipulated period of 15 years, this shop would be deemed as an absolute transfer Mala Kalam for this very amount. Till the mortgage money is paid, I shall have no concern with the shop.'",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Mortgagor Mangal Ram died; respondent Dev Karan is heir and legal representative.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "Original mortgagee Gangadhar died; appellant Murarilal is heir and legal representative.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondent filed redemption suit claiming transaction was mortgage, right to redeem alive despite expiry of 15 years as stipulation is clog on equity of redemption. Sought decree for redemption on payment of Rs. 6,500.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Appellant resisted: after 15 years, property absolute property of mortgagee; transaction in substance a sale, not mortgage.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f7",
      "text": "Trial Judge held claim for redemption unsustainable post 15 years; dismissed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Rajasthan High Court: stipulation is clog on equity of redemption, cannot bar suit; on character of transaction, clause not clearly making mortgagee absolute owner; reversed trial decree, remanded suit.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appeal to Supreme Court by special leave against High Court order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Pending Supreme Court appeal, both appellant and respondent died; heirs brought on record.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Amount due under mortgage not paid within 15 years.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Transfer of Property Act did not apply to Alwar at time of mortgage execution or expiry of 15 years period.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the relevant clause in mortgage deed makes mortgagee absolute owner of property after expiry of 15 years.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether stipulation barring redemption after 15 years is enforceable or amounts to clog on equity of redemption, particularly since Transfer of Property Act did not apply to Alwar.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Relevant clause makes mortgagee absolute owner after 15 years; transaction in substance a sale, not mortgage; suit barred.",
      "supporting_facts": [
        "f2",
        "f11"
      ],
      "legal_basis": "Terms of mortgage deed; ancient Hindu law; Privy Council decisions in Pattabhiramier v. Vencatarow Naicken (1870) 13 MIA 560 and Thumbusawmy Moodelly v. Hossain Rowthen ILR 1 Mad 1"
    },
    {
      "id": "pa2",
      "text": "Equitable doctrine of clog on equity of redemption not applicable where TPA does not apply; no legislative enactment or established practice in Alwar to contrary.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Pattabhiramier and Thumbusawmy cases; Hindu law texts emphasizing keeping promises"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Transaction in substance a mortgage, not sale; stipulation as to 15-year period is clog on equity of redemption, cannot bar suit for redemption.",
      "supporting_facts": [
        "f1",
        "f5"
      ],
      "legal_basis": "Doctrine of clog on equity of redemption"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Clause clearly intends mortgagee to become absolute owner after 15 years if unpaid; words 'Mala Kalam' mean no scope for mortgagor to say anything, implying loss of title.",
      "addresses_issue": "i1",
      "key_observation": "If terms prevail, suit barred."
    },
    {
      "id": "cr2",
      "text": "Stipulation is clog on equity of redemption; equitable doctrine applies via justice, equity, good conscience even without TPA, as per tradition in Indian courts, High Courts, and Rajasthan precedents.",
      "addresses_issue": "i2",
      "key_observation": "Courts administer justice, equity where no specific law; Rajasthan High Court applied principle in similar cases."
    },
    {
      "id": "cr3",
      "text": "Privy Council cases require legislation or practice to modify ancient law, but High Courts consistently applied equity; no material shows Alwar courts differed.",
      "addresses_issue": "i2",
      "key_observation": "Traditional judicial approach enforces equity against oppressive stipulations."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Relevant stipulation creates clog on equity of redemption and cannot be enforced to bar redemption suit.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Equitable principles of justice, equity, good conscience apply to mortgage transactions even where TPA not in force.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Pattabhiramier v. Vencatarow Naicken",
      "citation": "1870 13 Moores I.A. 560",
      "treatment": "referred",
      "relevance": "Held mortgagee becomes absolute owner after stipulated period under ancient law if no legislation or practice to contrary."
    },
    {
      "case_name": "Thumbusawmy Moodelly v. Hossain Rowthen Ors",
      "citation": "I.L.R. 1 Mad. 1",
      "treatment": "referred",
      "relevance": "Mortgage by conditional sale enforced according to letter unless modified by legislation or practice; criticized High Courts for applying equity."
    },
    {
      "case_name": "Kader Moideen v. Nepean",
      "citation": "25 I.A. 241",
      "treatment": "referred",
      "relevance": "Equity applied in Burma per statutory direction to follow justice, equity, good conscience."
    },
    {
      "case_name": "Mehrban Khan v. Makhna",
      "citation": "57 I.A. 168",
      "treatment": "followed",
      "relevance": "Provisions conferring interest on mortgagee post-redemption void as clog."
    },
    {
      "case_name": "Namdeo Lokman Lodhi v. Narmadabai",
      "citation": "1953 S.C.R. 1009",
      "treatment": "followed",
      "relevance": "Courts must apply justice, equity, good conscience even if TPA not applicable."
    },
    {
      "case_name": "Amba Lal v. Amba Lal",
      "citation": "I.L.R. 1957 Raj. 964",
      "treatment": "followed",
      "relevance": "S.60 TPA principle applicable via equity even where Act not in force."
    },
    {
      "case_name": "Seleh Raj v. Chandan Mal",
      "citation": "I.L.R. 1960 Raj. 88",
      "treatment": "followed",
      "relevance": "Principle of s.60 enforceable per equity, justice, good conscience."
    },
    {
      "case_name": "Venkata Reddi v. Parvati Ammal",
      "citation": "1 Mad. H.C. Rep. 460",
      "treatment": "referred",
      "relevance": "Early application of equity against clogs."
    },
    {
      "case_name": "Ramji bin Tukaram v. Chinto Sakharam",
      "citation": "1 Bom. H.C. Rep. 199 (1864)",
      "treatment": "followed",
      "relevance": "Refused to enforce clogs; uniformly followed in Bombay."
    },
    {
      "case_name": "Bapuji Apaji v. Sonavaraji Marvati",
      "citation": "I.L.R. 11 Bom. 231",
      "treatment": "referred",
      "relevance": "Adhered to equity despite Privy Council."
    },
    {
      "case_name": "Ramasami Sastrigal v. Samivappanayakan",
      "citation": "I.L.R. 4 Mad. 179",
      "treatment": "referred",
      "relevance": "Redemption allowed post-term in Madras post-1858."
    }
  ],
  "statutes_cited": [
    {
      "name": "Transfer of Property Act",
      "sections": [
        "Section 60"
      ],
      "relevance": "Embodies general principle against clogs on equity of redemption, applicable via equity even where Act not in force."
    },
    {
      "name": "Bengal Regulation III of 1793",
      "sections": [
        "Section 21"
      ],
      "relevance": "Directs judges to act per justice, equity, good conscience where no specific rule."
    },
    {
      "name": "Madras Regulation II of 1802",
      "sections": [
        "Section 17"
      ],
      "relevance": "Similar provision for justice, equity, good conscience."
    },
    {
      "name": "Bengal Civil Courts Act, 1887",
      "sections": [
        "Section 37"
      ],
      "relevance": "Justice, equity, good conscience."
    },
    {
      "name": "Madras Civil Courts Act, 1873",
      "sections": [
        "Section 16"
      ],
      "relevance": "Justice, equity, good conscience."
    },
    {
      "name": "Bombay Regulation IV of 1827",
      "sections": [
        "Section 26"
      ],
      "relevance": "Equity and good conscience in absence of law/usage."
    },
    {
      "name": "Regulation No. VII (North-West Frontier)",
      "sections": [
        "Section 28"
      ],
      "relevance": "Decide per justice, equity, good conscience."
    },
    {
      "name": "Madras Regulation XXXIV of 1802",
      "sections": [
        "Section 8"
      ],
      "relevance": "Mentioned in Pattabhiramier case."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Rajasthan High Court's view that the 15-year stipulation is a clog on equity of redemption and cannot bar the redemption suit; no interference with High Court's remand order.",
    "relief_granted": "None specified; appeal dismissed, High Court order stands.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"After the expiry of the stipulated period of 15 years, this shop would be deemed as an absolute transfer Mala Kalam for this very amount.\"",
      "speaker": "court",
      "significance": "Relevant clause interpreted as making mortgagee absolute owner if enforced."
    },
    {
      "text": "\"The fact that a stipulation of the kind with which we are concerned in the present case amounts to a clog on the equity of redemption, is not and cannot be disputed.\"",
      "speaker": "court",
      "significance": "Acknowledges stipulation as clog."
    },
    {
      "text": "\"It is axiomatic that the courts must apply the principles of justice, equity and good conscience to transactions which come before them for determination even though the statutory provisions of the Transfer of Property Act are not made applicable.\"",
      "speaker": "court",
      "significance": "From Namdeo case; core holding on applicability of equity."
    }
  ],
  "_case_id": "1964_121",
  "_label": 0,
  "_text_length": 26769,
  "_extracted_at": "2026-02-10T19:44:10.516802"
}