{
  "metadata": {
    "case_name": "J. K. Cotton Spinning and Weaving Mills Company Ltd. v. Sales Tax Officer",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeal No. 857 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Messrs J. K. Cotton Spinning and Weaving Mills Company Ltd. is a public limited Company having its registered office at Kanpur. The Company manufactures for sale cotton textiles, tiles and other commodities.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The Company applied on June 21, 1957, requesting the Sales Tax Officer, Sector II, Kanpur, to register it as a dealer under S. 7(1) of the Central Sales Tax Act, 1956, and prayed that specified goods ordinarily purchased in the course of inter-State trade be included in the certificate: Cotton staple fibre, yarn, wastes, coal, petrol, machinery, electricals, spares, hardwares, dyes and colours, chemicals, auxiliaries, oils, lubricants, tallows, starches, woollen clothings, gums, clays, salt, beltings, bobbins, shuttles, wooden accessories and other mill stores for manufacturing cloth, yarn, tiles and paints etc.",
      "type": "procedural",
      "date": "1957-06-21",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The Sales Tax Officer granted the certificate as prayed.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "The certificate of registration was later modified and additional categories specified: Industrial gases, drawing instruments, photographic materials, packing materials including wood, paper, straw and card-boards etc. and building materials including iron, steel, cement, lime, fire bricks and refractories.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "By notice dated July 19, 1961, the Sales Tax Officer cancelled the specification in respect of coal and called upon the Company to show cause why the certificate be amended to exclude drawing instruments, photographic materials, building materials including iron, steel, cement and lime and certain goods covered under electricals.",
      "type": "procedural",
      "date": "1961-07-19",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The Company showed cause against the notice and contended that all articles specified were required in the manufacture and processing of goods for sale.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "By order dated August 9, 1962 the Sales Tax Officer directed deletion from the registration certificate of: Drawing material, photographic material, building material including lime and cement except cement used in manufacture of tiles for re-sale, electricals, iron and steel and coal, and called upon the Company to surrender the certificate within three days.",
      "type": "procedural",
      "date": "1962-08-09",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The Company applied to the Allahabad High Court for writ of certiorari in Civil Misc. Writ Petition No. 2367 of 1962 to quash the STO order dated August 9, 1962.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "At trial in High Court, counsel for Company did not press petition in respect of iron, steel and coal.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "High Court by judgment and order dated April 27, 1964 dismissed the petition, holding that drawing instruments, photographic materials, colours, chemicals, electricals, machinery and building materials such as cement, lime are not comprehended in S. 8(3)(b) read with Rule 13.",
      "type": "procedural",
      "date": "1964-04-27",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Company appealed to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether drawing instruments, photographic materials, electricals and building materials (including lime and cement except for tiles) qualify as goods intended for use in the manufacture or processing of goods for sale under S. 8(3)(b) read with Rule 13 of the Central Sales Tax Act, 1956, for inclusion in the registration certificate.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Sales Tax Officer had jurisdiction to amend the certificate of registration after due enquiry.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "All articles specified in the certificate were required in the manufacture and processing of goods for sale and covered by S. 8(3)(b) read with Rule 13.",
      "supporting_facts": [
        "f2",
        "f4",
        "f6"
      ],
      "legal_basis": "S. 8(3)(b) read with Rule 13, Central Sales Tax Act, 1956"
    },
    {
      "id": "pa2",
      "text": "Sales Tax Officer acted without jurisdiction in seeking to amend the certificate issued after due enquiry.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Central Sales Tax Act, 1956"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Drawing instruments and photographic materials are required merely in preparation of designs, which is distinct from manufacture or processing of goods.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "S. 8(3)(b) read with Rule 13"
    },
    {
      "id": "ra2",
      "text": "Building materials including lime and cement (except for tiles), electricals, etc., do not fall within the expression 'in the manufacture or processing of goods for sale'.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "S. 8(3)(b) read with Rule 13"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Sales Tax Officer has jurisdiction under S. 7(4) to cancel or amend certificate for sufficient reason, such as erroneous inclusion of items not falling within S. 8(3)(b) read with Rule 13.",
      "addresses_issue": "i2",
      "key_observation": "Error in specifying articles not within S. 8(3)(b) r/w R.13 is sufficient reason under S.7(4)."
    },
    {
      "id": "cr2",
      "text": "High Court exceeded scope by dealing with items not deleted by STO, such as machinery, colours, chemicals.",
      "addresses_issue": "i1",
      "key_observation": "High Court not open to expand scope beyond STO order."
    },
    {
      "id": "cr3",
      "text": "Expression 'in the manufacture of goods' encompasses entire process converting raw materials into finished goods; includes integrally connected processes without which manufacture commercially inexpedient.",
      "addresses_issue": "i1",
      "key_observation": "Designing is integrally connected to manufacture; drawing and photographic materials qualify as equipment under Rule 13."
    },
    {
      "id": "cr4",
      "text": "Rule 13 does not require goods to be ingredients or directly needed for creation; includes equipment, tools, stores if process integrally related.",
      "addresses_issue": "i1",
      "key_observation": "Goods for designing qualify as without them commercial production inexpedient."
    },
    {
      "id": "cr5",
      "text": "Building materials like lime and cement not used as raw materials, processing materials or plant in manufacture; used for construction of factory.",
      "addresses_issue": "i1",
      "key_observation": "Do not qualify under Rule 13."
    },
    {
      "id": "cr6",
      "text": "'Electricals' include equipment like lighting, humidifiers, exhaust fans necessary in normal industry conditions for manufacturing process.",
      "addresses_issue": "i1",
      "key_observation": "Not limited to ingredients; office equipment excluded."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Drawing instruments and photographic materials are goods intended for use as equipment in the process of designing, which is part of manufacture under S.8(3)(b) r/w Rule 13.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Electricals qualify if necessary for manufacturing process under normal industry conditions.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Building materials including lime and cement (except for tiles) do not qualify under Rule 13.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "STO has jurisdiction to amend certificate under S.7(4) for sufficient reason.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Indian Copper Corporation Ltd. v. Commissioner of Commercial Taxes, Bihar and Ors.",
      "citation": "C.A. No. 1021 of 1963 decided on Oct. 19, 1964",
      "treatment": "followed",
      "relevance": "Vehicles for transporting ore and finished goods, and their spare parts/accessories, fall within Rule 13 as integrally related to manufacture/mining."
    }
  ],
  "statutes_cited": [
    {
      "name": "Central Sales Tax Act, 1956",
      "sections": [
        "Section 6",
        "Section 7(1)",
        "Section 7(4)",
        "Section 8(1)",
        "Section 8(2)",
        "Section 8(3)(b)",
        "Section 13"
      ],
      "relevance": "Charging section (S.6); registration (S.7); rates and specification of goods for lower tax (S.8); rules (S.13 and Rule 13 enumerating goods for use in manufacture/processing)."
    }
  ],
  "outcome": {
    "disposition": "partially_accepted",
    "summary": "Supreme Court set aside High Court order; directed modification of STO order dated August 9, 1962 by deleting deletions of drawing materials, photographic materials and electricals; rest of STO order stands. Company substantially succeeded.",
    "relief_granted": "Restoration of drawing materials, photographic materials and electricals in registration certificate.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Where any particular process is so integrally connected with the ultimate production of goods that but for that process, manufacture or processing of goods would be commercially inexpedient, goods required in that process would... fall within the expression in the manufacture of goods.\"",
      "speaker": "court",
      "significance": "Defines scope of 'in the manufacture of goods' under Rule 13."
    },
    {
      "text": "\"Goods used as equipment, as tools, as stores, as spare parts, or as accessories... need not... be ingredients or commodities used in the processes, nor must they be directly and actually needed for turning out or the creation of goods.\"",
      "speaker": "court",
      "significance": "Rejects narrow interpretation; broadens Rule 13 coverage."
    },
    {
      "text": "We therefore set aside the order passed by the High Court and direct that the order passed by the Sales Tax Officer be modified by deleting... drawing materials, photographic materials and electricals.",
      "speaker": "court",
      "significance": "Final directive on relief."
    }
  ],
  "_case_id": "1964_305",
  "_label": 1,
  "_text_length": 18080,
  "_extracted_at": "2026-02-10T19:46:16.120161"
}