{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Andhra Chamber of Commerce",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Shah J."
    ],
    "case_number": "Civil Appeals Nos. 941-946 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is the Andhra Chamber of Commerce, a company incorporated under the Indian Companies Act 7 of 1913, permitted under S. 26 to omit the word 'Limited' from its name by order of the Government of Madras.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Principal objects of the Memorandum of Association: To promote and protect trade, commerce and industries of India, in the Province of Madras and in particular in the Andhra country; to aid, stimulate and promote the development of trade, commerce and industries in India or any part thereof with capital principally provided by Indians or under the management of Indians; to watch over and protect the general commercial interests of India or any part thereof and the interests of the Andhras in particular engaged in trade, commerce or manufacture in India and in particular the Andhra Desa; to do all such other things as may be conducive to the preservation and extension of trade, commerce, industries and manufactures or incidental to the attainment of the above objects.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Clauses d to x are incidental to the principal objects.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "By cl. 4 of the Memorandum of Association, the income and property of the assessee shall be applied solely towards the promotion of its objects and no portion thereof shall be paid or transferred by way of dividends, bonuses or otherwise by way of profit to its members.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On December 2, 1944, the assessee purchased a building and made substantial alterations, additions and improvements therein.",
      "type": "material",
      "date": "1944-12-02",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The assessee moved its offices into that building on May 14, 1947 and let out to tenants the portion not required for its use.",
      "type": "material",
      "date": "1947-05-14",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Income of the assessee is obtained from subscriptions and donations collected from its members and rent received from the building.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Net annual value of the property less statutory deductions under S. 9 of the Income-tax Act, 1922 and net excess of expenditure over income other than rental income for assessment years: 1948-49 (Rs. 3,400 net value, Rs. 7,431 excess); 1949-50 (Rs. 6,154, Rs. 7,139); 1950-51 (Rs. 6,928, Rs. 5,266); 1951-52 (Rs. 5,740, Rs. 10,173); 1953-54 (Rs. 8,072, Rs. 13,672); 1954-55 (Rs. 8,072, Rs. 17,397).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In assessment proceedings before the Second Additional Income-tax Officer, City Circle 1, Madras, assessee contended that annual value of building not assessable as assessee was charitable institution under s. 4(3)(i); alternatively, excess expenditure over income to be set off against such income.",
      "type": "procedural",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f10",
      "text": "Income-tax Officer rejected contentions and assessed income from property on net annual value without set-off for six assessment years.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Assessee appealed to Appellate Assistant Commissioner, who held assessee not charitable, income not exempt under s. 4(3)(i), and rejected alternative contention as no specific profit-making activity.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appeals to Income-tax Appellate Tribunal; Tribunal held assessee not exempt under s. 4(3)(i) as activities for benefit primarily of members and collective action on behalf of members, not trade/business/vocation.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "At instance of assessee, Tribunal referred questions to High Court: (1) Whether income from property exempt under S. 4(3)(i) for six years? (2) If not, whether activities amount to trade or business assessable under S. 10?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Madras High Court answered first question in affirmative, did not answer second formally. Judgment dated February 22, 1961 in Case Referred No. 121 of 1956.",
      "type": "procedural",
      "date": "1961-02-22",
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Commissioner of Income-tax preferred appeals to Supreme Court with certificate under S. 66A(2) of Indian Income-tax Act. Concerned with assessments 1948-49 to 1954-55 omitting 1952-53.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "S. 4(3)(i) before amendment by Act 25 of 1953 (eff. April 1, 1952): Income from property held under trust wholly for charitable purposes exempt; charitable purpose includes advancement of any other object of general public utility.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Amendment by Act 25 of 1953 amalgamated cls. (i) and (i-a), no material bearing on case.",
      "type": "background",
      "date": "1953-04-01",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "Membership under Articles: Not limited to Telugu speakers in Andhra Desa; includes Chambers/Associations, Companies/Corporations, Partners/Firms/Joint Families/Sole Proprietors in Andhra Desa, individuals anywhere in India connected with trade if mother tongue Telugu or can speak/write Telugu.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Cl. 3(g) of MoA: To urge or oppose legislative measures affecting trade, commerce or manufactures, procure change of law, remove grievances affecting merchants.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the income from property owned by the assessee is exempt under S. 4(3)(i) of the Income-tax Act, 1922 for the assessment years 1948-49 to 1954-55 (omitting 1952-53)?",
      "framed_by": "lower_court"
    },
    {
      "id": "i2",
      "text": "If not exempt under S. 4(3)(i), whether the activities of the assessee amount to a trade or business, the profit or loss from which is assessable under S. 10?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Assessee not a charitable institution under s. 4(3)(i); objects primarily benefit members, not general public utility; purposes vague and indefinite, court would decline to administer; benefit to members to carry on business profitably; cl. 3(g) makes objects political.",
      "supporting_facts": [
        "f2",
        "f4",
        "f19"
      ],
      "legal_basis": "S. 4(3)(i) Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "No trust, mere legal obligation under MoA cl.4 and govt permission insufficient.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Income from property exempt under s. 4(3)(i) as property held under legal obligation wholly for charitable purposes (advancement of objects of general public utility); alternatively, excess expenditure set off against rental income.",
      "supporting_facts": [
        "f4",
        "f8",
        "f9"
      ],
      "legal_basis": "S. 4(3)(i), S. 9, S. 10 Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Building held under legal obligation by cl.4 MoA to apply income to specified objects; objects are advancement of general public utility as promotion/protection of trade, commerce, industry benefits entire community, not merely members.",
      "addresses_issue": "i1",
      "key_observation": "Advancement or promotion of trade, commerce and industry leading to economic prosperity enures for the benefit of the entire community."
    },
    {
      "id": "cr2",
      "text": "Incidental benefits to members do not prevent charitable status; cites Yorkshire Agricultural Society, Institution of Civil Engineers.",
      "addresses_issue": "i1",
      "key_observation": "An association may benefit its members in the course of carrying out its main charitable purpose."
    },
    {
      "id": "cr3",
      "text": "Object of general public utility not restricted to whole mankind; sufficient to benefit section of public distinguished from specified individuals; Andhras/traders identifiable by common quality.",
      "addresses_issue": "i1",
      "key_observation": "It is sufficient if the intention be to benefit a section of the public as distinguished from specified individuals."
    },
    {
      "id": "cr4",
      "text": "Objects not vague; court can administer without specifying modus operandi.",
      "addresses_issue": "i1",
      "key_observation": "An object of general public utility such as promotion, protection, aiding and stimulation of trade, commerce and industries need not specify the modus."
    },
    {
      "id": "cr5",
      "text": "Cl. 3(g) incidental to primary objects, not political dominant purpose; primary purpose charitable even if incidental political activity (urging legislation).",
      "addresses_issue": "i1",
      "key_observation": "If the primary purpose be advancement of objects of general public utility, it would remain charitable even if an incidental entry into the political domain is contemplated."
    },
    {
      "id": "cr6",
      "text": "Membership not restricted to Telugu speakers in Andhra; diverse eligibility.",
      "addresses_issue": "i1",
      "key_observation": "There is no geographical limitation upon the membership qualification, nor is there limitation about the capacity to speak or write Telugu."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Income from property exempt under S. 4(3)(i) as assessee's objects constitute advancement of objects of general public utility, a charitable purpose.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioners of Inland Revenue v. Yorkshire Agricultural Society",
      "citation": "1928 1 K.B. 611",
      "treatment": "followed",
      "relevance": "Society for promotion of agriculture charitable despite incidental member benefits."
    },
    {
      "case_name": "The Institution of Civil Engineers v. The Commissioners of Inland Revenue",
      "citation": "16 T.C. 158",
      "treatment": "followed",
      "relevance": "Advancement of mechanical science/civil engineering charitable; member benefits incidental."
    },
    {
      "case_name": "Commissioner of Income-tax Bombay Presidency, Sind and Baluchistan v. The Grain Merchants Association of Bombay",
      "citation": "6 I.T.R. 427",
      "treatment": "distinguished",
      "relevance": "Objects benefiting section of public (merchants) can be general public utility."
    },
    {
      "case_name": "Runchordas Vandravandas v. Parvati Bhai",
      "citation": "L.R. 26 I.A. 71",
      "treatment": "distinguished",
      "relevance": "Dharam too vague; unlike specific trade promotion objects."
    },
    {
      "case_name": "Commissioners of Inland Revenue v. National Anti-Vivisection Society",
      "citation": "28 T.C. 311",
      "treatment": "distinguished",
      "relevance": "Political objects void; vagueness not issue here."
    },
    {
      "case_name": "Baddeley v. Commissioners of Inland Revenue",
      "citation": "35 T.C. 661",
      "treatment": "distinguished",
      "relevance": "Trusts too wide, not charitable; no bearing on assessee's objects."
    },
    {
      "case_name": "In re The Trustees of the Tribune",
      "citation": "7 I.T.R. 415",
      "treatment": "followed",
      "relevance": "Newspaper for public opinion organ of general public utility despite incidental politics."
    },
    {
      "case_name": "All India Spinners Association v. Commissioner of Income-tax, Bombay",
      "citation": "12 I.T.R. 482",
      "treatment": "followed",
      "relevance": "Village industry promotion charitable (relief of poor/general public utility); independent of politics."
    },
    {
      "case_name": "Pemsel v. Commissioners for Special Purposes of Income-Tax",
      "citation": "1891 A.C. 531",
      "treatment": "referred",
      "relevance": "Influenced definition but Indian s.4(3)(i) uses 'general public utility' not 'beneficial to community'."
    },
    {
      "case_name": "Rex v. Special Commissioners of Income-tax ex-parte Headmasters Conference",
      "citation": "10 T.C. 73",
      "treatment": "distinguished",
      "relevance": "Political objects (legislation) dominant, not charitable."
    },
    {
      "case_name": "Rex v. Special Commissioners of Income Tax ex-parte Incorporated Association of Preparatory School",
      "citation": "10 T.C. 73",
      "treatment": "distinguished",
      "relevance": "Similar to Headmasters; political dominant."
    },
    {
      "case_name": "Commissioners of Inland Revenue v. Temperance Council of the Christian Churches",
      "citation": "10 T.C. 748",
      "treatment": "distinguished",
      "relevance": "Legislative reform dominant political purpose."
    },
    {
      "case_name": "Bowman v. Secular Society Ltd.",
      "citation": "1917 A.C. 406",
      "treatment": "referred",
      "relevance": "Political objects invalid as court cannot judge public benefit."
    },
    {
      "case_name": "Laxman Balwant Bhopatkar v. Charity Commissioner, Bombay",
      "citation": "1963 2 S.C.R. 625",
      "treatment": "distinguished",
      "relevance": "Political education dominant; here trade promotion primary."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "S. 4(3)(i)",
        "S. 9",
        "S. 10",
        "S. 66A(2)"
      ],
      "relevance": "Exemption for income from property held for charitable purposes; net annual value; trade/business; reference to HC."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [
        "S. 26"
      ],
      "relevance": "Permission to omit 'Limited'; legal obligation via MoA."
    },
    {
      "name": "Income-tax Amendment Act, 1953",
      "sections": [
        "S. 3"
      ],
      "relevance": "Amended S. 4(3)(i) but no material change."
    },
    {
      "name": "Bombay Public Trusts Act, 1950",
      "sections": [
        "S. 9(4)"
      ],
      "relevance": "Similar definition of charitable purpose."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals by Commissioner of Income-tax dismissed; High Court order upheld that assessee's income from property exempt under S. 4(3)(i) as objects charitable (general public utility).",
    "relief_granted": "Exemption from tax on income from property confirmed.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "Advancement or promotion of trade, commerce and industry leading to economic prosperity enures for the benefit of the entire community.",
      "speaker": "court",
      "significance": "Core reasoning for charitable status."
    },
    {
      "text": "An association or institution may benefit its members in the course of carrying out its main charitable purpose and this alone will not prevent it from being a charity.",
      "speaker": "court",
      "significance": "Explains incidental member benefits ok."
    },
    {
      "text": "The expression object of general public utility however is not restricted to objects beneficial to the whole mankind. An object beneficial to a section of the public is an object of general public utility.",
      "speaker": "court",
      "significance": "Broadens scope of public utility."
    },
    {
      "text": "The appeals therefore fail and are dismissed with costs.",
      "speaker": "court",
      "significance": "Final disposition."
    }
  ],
  "_case_id": "1964_136",
  "_label": 0,
  "_text_length": 34927,
  "_extracted_at": "2026-02-10T19:44:16.571740"
}