{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Ajax Products Ltd.",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao J."
    ],
    "case_number": "Civil Appeal No. 1098 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent-assessee, The Ajax Products Ltd., now under liquidation, was a public limited company incorporated in 1939 to carry on business in the manufacture and sale of steel and abrasives products.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On October 30, 1954, the company, at an extraordinary general body meeting, made a resolution to go into voluntary liquidation and the Liquidator appointed by the said resolution carried on the business till the middle of December 1954 when the business was completely closed down.",
      "type": "material",
      "date": "1954-10-30",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On March 10, 1955, the Liquidator executed a sale deed to Carborundum Universal Limited transferring to the latter the plant, machinery and buildings for a sum of Rs. 10,00,000 (Rs. 1,00,000 land, Rs. 1,31,732 buildings, Rs. 7,68,268 plant and machinery).",
      "type": "material",
      "date": "1955-03-10",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The books of the assessee-company showed that the original cost of the buildings was Rs. 3,46,034, written down value Rs. 1,08,321; cost of machinery Rs. 3,90,148, written down value Rs. 90,098. Total depreciation allowed in past for both: Rs. 5,36,034.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Sale resulted in excess realisation of Rs. 23,411 over WDV of buildings; for machinery, excess over (cost - WDV) was Rs. 3,00,050.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Relevant assessment year 1956-57, corresponding accounting year calendar year 1955.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Income-tax Officer held sale result of collusion, treated Rs. 5,36,034 (past depreciation) as profits under second proviso to S. 10(2)(vii) of Indian Income-tax Act, 1922.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Appellate Assistant Commissioner held valuation genuine, determined profits Rs. 3,23,461, rejected applicability of second proviso to assessee.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Tribunal estimated buildings value at Rs. 2,32,963 (profit Rs. 1,25,000), accepted Rs. 3,00,050 for machinery, total Rs. 4,25,050 liable under proviso, rejected assessee's contention on applicability.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Tribunal rejected AAC's acceptance of Chartered Engineer's valuation on grounds: certificate for vendee's flotation/prospectus; useless buildings left out.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Tribunal assumed building cost up steadily since 1939, surmised 1955 value Rs. 2,32,963.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "On assessee's application, Tribunal referred to High Court: (1) Whether properly assessed on Rs. 4,25,050 under proviso; (2) Materials for Tribunal's estimate of buildings Rs. 2,32,963.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Madras High Court (judgment Dec 7, 1960, T.C. No. 74 of 1959): Tribunal's estimate no material, substituted Rs. 3,23,461; profits not taxable under proviso as machinery/buildings not used for business during accounting year.",
      "type": "procedural",
      "date": "1960-12-07",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court had jurisdiction to set aside the Tribunal's finding of fact on profit from sale of buildings (Rs. 1,25,000).",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether, under second proviso to S. 10(2)(vii) after amendment by Act 67 of 1949, surplus on sale of buildings/machinery after cessation of business is taxable even if not used for business during previous year.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether assessee properly assessed on Rs. 4,25,050 as profits under second proviso to S. 10(2)(vii).",
      "framed_by": "tribunal"
    },
    {
      "id": "i4",
      "text": "Whether materials for Tribunal estimating sale value of buildings at Rs. 2,32,963.",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court had no jurisdiction to set aside Tribunal's finding of fact that profit on sale of buildings was Rs. 1,25,000.",
      "supporting_facts": [
        "f9",
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Second proviso to S. 10(2)(vii) after amendment by Act 67 of 1949 brings to charge deemed profits irrespective of whether buildings/machinery used for business in previous year; proviso is substantive charging section; fiction deems business continued and assets used.",
      "supporting_facts": [
        "f2",
        "f3",
        "f6"
      ],
      "legal_basis": "Second proviso to S. 10(2)(vii), Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Tribunal's estimate of buildings value based on surmises, no material; High Court entitled to interfere as finding not based on evidence.",
      "supporting_facts": [
        "f10",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Amendment only removes condition that sale not after cessation of business; still requires business carried on during previous year and assets used therein.",
      "supporting_facts": [
        "f2",
        "f3",
        "f6"
      ],
      "legal_basis": "Second proviso to S. 10(2)(vii); Liquidators of Pursa Ltd. v. CIT; CIT v. Express Newspapers Ltd."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Tribunal's reasons for rejecting valuation certificate and estimating buildings at Rs. 2,32,963 based on surmises, no material on record; High Court entitled to interfere as finding not based on evidence.",
      "addresses_issue": "i1",
      "key_observation": "Both reasons and conclusion of Tribunal based on surmises; pure guess unrelated to material."
    },
    {
      "id": "cr2",
      "text": "Words 'such building' refer to buildings/machinery used for business during accounting year (per Express Newspapers); amendment adds 'whether during continuance or after cessation' removing only sale timing condition; requires business carried on and assets used in previous year.",
      "addresses_issue": "i2",
      "key_observation": "Natural meaning: surplus exigible only if assessee did business during previous year and assets used therein."
    },
    {
      "id": "cr3",
      "text": "Proviso is not independent charging section but qualifies main enactment; fiction limited - surplus deemed profits of previous year, but s.10(1) requires profits of business carried on.",
      "addresses_issue": "i2",
      "key_observation": "Fiction cannot be stretched; earlier decisions' construction holds except for removed condition."
    },
    {
      "id": "cr4",
      "text": "Accepting Revenue's view leads to anomalies: no time limit for assessment, deems business/user even long after cessation.",
      "addresses_issue": "i2",
      "key_observation": "Legislature's intention otherwise."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court justified in setting aside Tribunal's unsupported finding on buildings value.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Second proviso post-amendment requires: (1) business carried on during previous year or part; (2) assets used in business; (3) sale anytime (during/after cessation); surplus not taxable otherwise.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Assessee not properly assessed under proviso as assets not used during accounting year.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Liquidators of Pursa Limited v. Commissioner of Income-tax, Bihar",
      "citation": "1954 S.C.R. 767",
      "treatment": "followed",
      "relevance": "Surplus on sale after cessation and not used in year not taxable pre-amendment."
    },
    {
      "case_name": "Commissioner of Income-tax, Madras v. Express Newspapers, Ltd.",
      "citation": "1964 53 I.T.R. 250",
      "treatment": "followed",
      "relevance": "Three conditions for proviso: business carried on; machinery used; sold during business not winding up; 'such' refers to used assets."
    },
    {
      "case_name": "Cape Brandy Syndicate v. I.R.C.",
      "citation": "1921 1 K.B. 64",
      "treatment": "followed",
      "relevance": "Taxing statutes: look merely at what is clearly said; no intendment, equity, presumption."
    },
    {
      "case_name": "Commissioner of Income-tax, Mysore etc. v. Indo-Mercantile Bank Ltd.",
      "citation": "1959 36 I.T.R. 1; 1959 Supp. 2 S.C.R. 256",
      "treatment": "followed",
      "relevance": "Proviso qualifies main enactment; construed harmoniously; not substantive unless clear."
    },
    {
      "case_name": "Additional Income-Officer, Circle 1, Salem v. Alfred",
      "citation": "1962 Supp. 1 S.C.R. 143",
      "treatment": "distinguished",
      "relevance": "Fiction fully worked out within purpose; here limited."
    },
    {
      "case_name": "Commissioner of Income-tax Bombay City 1 v. Amarchand N. Shroff",
      "citation": "1963 Supp. 1 S.C.R. 699",
      "treatment": "followed",
      "relevance": "Fictions limited to purpose; not stretched."
    },
    {
      "case_name": "Dhandhania Kedia Co. v. CIT",
      "citation": "1959 Supp. 1 S.C.R. 204",
      "treatment": "referred",
      "relevance": "Previous year related to assessment year unless context otherwise."
    },
    {
      "case_name": "CIT v. Srinivasan and K. Gopalan",
      "citation": null,
      "treatment": "approved",
      "relevance": "Previous year not always wedded to assessment year."
    },
    {
      "case_name": "Bengal Immunity Co. Ltd. v. State of Bihar",
      "citation": null,
      "treatment": "referred",
      "relevance": "Legal fictions limited to purpose."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "S. 10(1)",
        "S. 10(2)(vii) second proviso",
        "S. 2(11)(b)",
        "S. 24-B",
        "S. 46(1)"
      ],
      "relevance": "Tax on profits of business carried on; allowance for depreciation; surplus on sale of depreciated assets deemed profits if conditions met; previous year definition."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court's decision: Tribunal's estimate of buildings value lacked material; second proviso does not tax surplus where assets not used for business during previous year, despite amendment allowing sale after cessation.",
    "relief_granted": "Questions answered in favour of assessee; no tax on disputed profits.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"In a Taxing Act one has to look merely at what is clearly said. There is no room for any intendment. There is no equity about a tax. There is no presumption as to a tax.\"",
      "speaker": "court",
      "significance": "Rule of construction for taxing statutes (citing Cape Brandy)."
    },
    {
      "text": "\"The words 'such building' have already been given an authoritative interpretation by this Court... refer back to clauses (iv), (v), (vi) and (vii) of S. 10(2)... only apply to... used for the purpose of the business during the accounting year.\"",
      "speaker": "court",
      "significance": "Limits scope of 'such building/machinery' to those used in previous year."
    },
    {
      "text": "\"By giving the natural meaning to every expression used in the proviso, we reach the result namely that the surplus... is not exigible to tax unless the assessee did business during the accounting year preceding the assessment year and unless such buildings or machinery... were used for the business in the said year.\"",
      "speaker": "court",
      "significance": "Core holding on applicability post-amendment."
    }
  ],
  "_case_id": "1964_62",
  "_label": 0,
  "_text_length": 25493,
  "_extracted_at": "2026-02-10T19:43:28.203556"
}