{
  "metadata": {
    "case_name": "Shri Jagadguru Kari Basava Rajendraswami of Gavi Mutt v. Commissioner of Hindu Religious and Charitable Endowments",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR, C. J."
    ],
    "case_number": "Civil Appeal No. 745 of 1963",
    "date_of_judgment": "1964-05-08"
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is the Matadhipati of Sri Gavi Mutt, a religious institution dedicated to the propagation and promotion of the tenets of the Veera Saiva cult of Hinduism, situated at Uravakonda in the district of Anantapur.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 6th September 1939, the Board of Hindu Religious Endowments constituted under Madras Act 11 of 1927 framed a scheme under s. 63 of the said Act for the proper administration of the said Mutt and its endowments.",
      "type": "material",
      "date": "1939-09-06",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Predecessor-in-office of the appellant filed suit No. 21 of 1939 before the District Judge, Anantapur, to set aside the scheme; suit substantially failed, District Court made minor modifications and confirmed the scheme.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Decision appealed to High Court of Madras as A.S. No. 269 of 1945; during pendency, appellant's predecessor died, appellant brought on record as legal representative; appeal withdrawn and dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "No effective step taken to implement the scheme; management continued as before; appointment of Executive Officer made no difference.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On 5th April 1952, appellant served with memorandum asking him to hand over charge of all properties of the Mutt to the Executive Officer.",
      "type": "material",
      "date": "1952-04-05",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On 16th April 1952, notice issued by Executive Officer informing appellant that Executive Officer would take over possession.",
      "type": "material",
      "date": "1952-04-16",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Sirur Mutt case decided by Madras High Court; appellant refused to hand over possession citing scheme invalid as contravening fundamental rights under Constitution effective from 26th January 1950.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "In 1951, Madras Hindu Religious and Charitable Endowments Act XIX of 1951 repealed and replaced Madras Act 11 of 1927.",
      "type": "background",
      "date": "1951",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On 28th April 1952, appellant filed writ petition in Madras High Court praying for writ quashing notice by Executive Officer.",
      "type": "procedural",
      "date": "1952-04-28",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Single Judge of Madras High Court allowed writ petition, held some provisions of scheme contravened Art. 19(1)(f), quashed scheme; rejected alternative remedy plea.",
      "type": "procedural",
      "date": "1952",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Respondent Commissioner appealed in Writ Appeal No. 71 of 1957; Division Bench reversed single Judge, held scheme framed in 1939 under valid earlier Act cannot be challenged under Art. 19; dismissed writ petition.",
      "type": "procedural",
      "date": "1961-02-06",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Appellant came to Supreme Court with certificate from High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Scheme consists of 15 clauses: entrusts administration to hereditary trustee (Matadhipati) and two non-hereditary trustees appointed by Board (removable for good cause); Board appoints Executive Officer on Rs.60/month salary, security Rs.500; EO in charge of day-to-day administration, answerable to trustees; trustees meet monthly, supervise EO; Board issues directions.",
      "type": "material",
      "date": "1939-09-06",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Scheme not implemented till 1952 due to lack of effective steps or legal challenges; status quo continued during proceedings.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the scheme framed in 1939 under the earlier Act (Madras Act 11/1927) can be challenged on the ground that it contravenes fundamental rights under Art. 19(1)(f) of the Constitution, despite being valid when framed and not retrospectively invalid.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether s.103(d) of the latter Act (Madras Act XIX/1951) deems the scheme settled under the new Act requiring examination of its consistency with provisions of the latter Act.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether non-implementation of the scheme before 26th January 1950 allows challenge to its validity under Art. 19(1)(f) when enforcement attempted in 1952.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Earlier Act repealed by latter Act XIX of 1951; s.103(d) deems scheme settled under latter Act, necessitating check if provisions consistent with latter Act; inconsistent provisions must be modified.",
      "supporting_facts": [
        "f2",
        "f9",
        "f14"
      ],
      "legal_basis": "Madras Act XIX of 1951, s.103(d); East End Dwellings Co. Ltd. v. Finsbury Borough Council"
    },
    {
      "id": "pa2",
      "text": "Though scheme valid when framed and fundamental rights not retrospective, since not actually enforced before 26th January 1950, deprivation of property rights first occurs in 1952, allowing challenge under Art. 19(1)(f).",
      "supporting_facts": [
        "f5",
        "f6",
        "f7",
        "f15"
      ],
      "legal_basis": "Art. 19(1)(f); S. Seth Shanti Sarup v. Union of India"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Scheme framed in 1939 under valid earlier Act; cannot be challenged post-Constitution under Art. 19 as valid when enacted.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Appellant had alternative remedy under latter Act, writ not entertainable.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Madras Act XIX of 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.103(d) deems schemes settled under earlier Act as settled under latter Act without requiring examination of consistency; continuity automatic unless modified under s.62(3); other sub-clauses of s.103 show intent where consistency required.",
      "addresses_issue": "i2",
      "key_observation": "Deeming provision does not necessitate re-examination for consistency."
    },
    {
      "id": "cr2",
      "text": "Fundamental rights not retrospective; scheme validly framed in 1939, challenge failed in courts; non-implementation due to appellant's obstructions does not alter legal position that rights taken away pre-Constitution.",
      "addresses_issue": "i3",
      "key_observation": "Scheme not open to Art.19 challenge merely because implementation delayed."
    },
    {
      "id": "cr3",
      "text": "Distinguishes Shanti Sarup case: there, orders invalid under relevant Acts; here, scheme valid under valid law pre-Constitution.",
      "addresses_issue": "i3",
      "key_observation": "Observations in Shanti Sarup not unqualified proposition making rights retrospective."
    },
    {
      "id": "cr4",
      "text": "Scheme similar to patterns in subsequent legislation/judicial decisions for public charitable institutions.",
      "addresses_issue": "i1",
      "key_observation": "No need to consider further contentions on inconsistency as writ not maintainable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Scheme framed under earlier Act in 1939 valid when made; s.103(d) deems it continued under latter Act without consistency check; modifiable under s.62(3); not challengeable under Art.19(1)(f).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Writ petition not maintainable to challenge scheme's consistency with latter Act.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "East End Dwellings Co. Ltd. v. Finsbury Borough Council",
      "citation": "1952 A.C. 109",
      "treatment": "referred",
      "relevance": "Observations on deeming provisions and imagining consequences."
    },
    {
      "case_name": "S. Seth Shanti Sarup v. Union of India",
      "citation": "A.I.R. 1955 S.C. 624",
      "treatment": "distinguished",
      "relevance": "On challenge to post-Constitution enforcement of pre-Constitution orders; distinguished as orders there invalid."
    },
    {
      "case_name": "Sirur Mutt case",
      "citation": null,
      "treatment": "referred",
      "relevance": "Decided by Madras High Court; prompted appellant's refusal to hand over."
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Hindu Religious Endowments Act 11 of 1927",
      "sections": [
        "s. 63"
      ],
      "relevance": "Scheme framed under this Act; valid when enacted."
    },
    {
      "name": "Madras Hindu Religious and Charitable Endowments Act XIX of 1951",
      "sections": [
        "s. 103(d)",
        "s. 62(3)",
        "s. 103(a)",
        "s. 103(b)",
        "s. 103(f)",
        "s. 103(g)",
        "s. 103(h)"
      ],
      "relevance": "Repealed earlier Act; s.103(d) deems old schemes continued; s.62(3) for modification."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 19(1)(f)",
        "Art. 13(1)",
        "Art. 32"
      ],
      "relevance": "Alleged contravention by scheme; rights not retrospective."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The Division Bench's decision reversing the single Judge and dismissing the writ petition is upheld. The scheme is deemed valid and continued under s.103(d) of the 1951 Act.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "where the fundamental right is clearly infringed, it is the duty of the Court to interfere in favour of the citizen, unless there are reasons of policy which make it inexpedient to do so.",
      "speaker": "lower_court",
      "significance": "Single Judge's observation rejected implicitly."
    },
    {
      "text": "if you are bidden to treat an imaginary state of affairs as real, you must surely, unless prohibited from doing so, also imagine as real the consequences and incidents which... must inevitably have flowed from or accompanied it.",
      "speaker": "petitioner_counsel",
      "significance": "Cited for s.103(d) interpretation; rejected by Court."
    },
    {
      "text": "the order effecting the deprivation which continued from day to day must be held to have come into conflict with the fundamental rights of the petitioner as soon as the Constitution came into force.",
      "speaker": "petitioner_counsel",
      "significance": "From Shanti Sarup; distinguished by Court."
    },
    {
      "text": "Fundamental rights are not retrospective in their operation.",
      "speaker": "court",
      "significance": "Core holding rejecting Art.19 challenge."
    }
  ],
  "_case_id": "1964_227",
  "_label": 0,
  "_text_length": 21058,
  "_extracted_at": "2026-02-10T19:45:38.161127"
}