{
  "metadata": {
    "case_name": "M/s. Kasturilal Ralia Ram Jain v. State of Uttar Pradesh",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar C. J."
    ],
    "case_number": "Civil Appeal No. 105 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a firm dealing in bullion and other goods at Amritsar, duly registered under the Indian Partnership Act. Ralia Ram was one of its partners.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 20th September 1947, Ralia Ram arrived at Meerut by Frontier Mail about midnight to sell gold, silver and other goods in Meerut market. While passing through Chaupla Bazar, taken into custody by three police constables, belongings searched, taken to Kotwali Police Station, detained in lock-up.",
      "type": "material",
      "date": "1947-09-20",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Gold weighing 103 tolas 6 mashas and 1 ratti, and silver weighing 2 maunds and 6 1/2 seers seized from Ralia Ram and kept in police custody.",
      "type": "material",
      "date": "1947-09-20",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "On 21st September 1947, Ralia Ram released on bail. Silver seized returned to him some time thereafter.",
      "type": "procedural",
      "date": "1947-09-21",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Ralia Ram made repeated demands for return of gold, not returned, filed suit against respondent for return of gold or alternatively its value Rs. 11,075-10-0 plus Rs. 355 interest by way of damages and future interest.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Gold taken into custody by Head Constable Mohammad Amir, kept in police Malkhana under his charge. Mohd. Amir misappropriated gold and fled to Pakistan on 17th October 1947. Also misappropriated other cash and articles from Malkhana.",
      "type": "disputed",
      "date": "1947-10-17",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Case under section 409 IPC and s. 29 Police Act registered against Mohd. Amir, but nothing effective could be done as he could not be apprehended from Pakistan.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Trial Court found in favour of appellant on issues of negligence and state's liability, decreed Rs. 11,430-10-0 as gold could not be returned.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Allahabad High Court in First Appeal No. 67 of 1950, judgment dated March 18, 1960, reversed trial court: no negligence established, and even if negligent, state not liable.",
      "type": "procedural",
      "date": "1960-03-18",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellant obtained certificate from High Court and appealed to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Ganga Prasad (Class II Officer, Meerut Kotwali): Mohammad Amir fled to Pakistan without delivering keys or permission. Malkhana checked, considerable properties missing including appellant's gold. Silver returned 26th October 1947. No list forwarded, valuables kept in wooden box with key by officer-in-charge, not kept in Treasury.",
      "type": "evidence",
      "date": "1947-10-26",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Mohd. Umar (Sub-Inspector II, Kotwali Sept 1947): Seized gold/silver in his presence, left in charge of Head Constable instructed to keep in Malkhana. No list prepared, unable to say if proper precautions taken.",
      "type": "evidence",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Agha Badarul Hasan (Station Officer Sept 1947): Routine daily inspection of Malkhana by Sub-Inspector. Articles not weighed or kept in Malkhana in his presence. Checked contents but no note in Diary. Valuables not sent to Treasury without orders.",
      "type": "evidence",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the police officers were guilty of negligence in the matter of taking care of the gold seized from Ralia Ram.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the respondent State of Uttar Pradesh is liable to compensate the appellant for the loss caused by the negligence of the police officers employed by the respondent.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in finding no negligence by police officers.",
      "supporting_facts": [
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": "U.P. Police Regulations 165 and 166; CrPC ss. 51, 54(iv), 550, 523"
    },
    {
      "id": "pa2",
      "text": "Once negligence established, state liable vicariously; extend principle from State of Rajasthan v. Mst. Vidhyawati.",
      "supporting_facts": [
        "f1",
        "f2",
        "f3",
        "f6"
      ],
      "legal_basis": "State of Rajasthan v. Mst. Vidhyawati; Art. 300 Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No negligence by police officers.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Even if negligence, state not liable for loss resulting from negligence of police officers.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "Acts in exercise of sovereign powers"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Police negligent: property not kept in Treasury as required by Regulation 166 U.P. Police Regulations (gold/silver of equal value to cash >Rs.100 to be kept in treasury); no list made, not weighed, gross negligence in Malkhana custody.",
      "addresses_issue": "i1",
      "key_observation": "High Court misconstrued Regulations 165(5) and 166; oral evidence shows negligence."
    },
    {
      "id": "cr2",
      "text": "State not liable: negligence in custody of seized property during exercise of statutory powers to arrest, search, seize under CrPC ss.51,54(iv),550 which are sovereign powers delegated to police.",
      "addresses_issue": "i2",
      "key_observation": "Distinction between sovereign powers (no liability) and non-sovereign (liability); follows Peninsular and Oriental Steam Navigation Co. v. Secretary of State."
    },
    {
      "id": "cr3",
      "text": "Vidhyawati case distinguished: jeep driving to Collector's residence not sovereign power activity.",
      "addresses_issue": "i2",
      "key_observation": "Employment there non-sovereign; here, police functions sovereign."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Police officers negligent in dealing with seized property.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "State not vicariously liable for tortious/negligent acts of public servants committed in exercise of sovereign powers.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Rajasthan v. Mst. Vidhyawati",
      "citation": "1962 Supp. 2 S.C.R. 989",
      "treatment": "distinguished",
      "relevance": "Liability for non-sovereign tort (jeep negligence); not applicable to sovereign police functions."
    },
    {
      "case_name": "Peninsular and Oriental Steam Navigation Company v. The Secretary of State for India",
      "citation": "5 B.H.C.R. Appendix A, p. 1",
      "treatment": "followed",
      "relevance": "Distinction between sovereign powers (no liability) and non-sovereign acts (liability)."
    },
    {
      "case_name": "Secretary of State for India in Council v. Moment",
      "citation": "40 I.A. 48",
      "treatment": "followed",
      "relevance": "Approved Peninsular principles."
    },
    {
      "case_name": "Shivabhajan Durgaprasad v. Secretary of State for India",
      "citation": "I.L.R. 28 Bom. 314",
      "treatment": "followed",
      "relevance": "No liability for constable's negligence in statutory seizure."
    },
    {
      "case_name": "Secretary of State for India in Council v. A. Cockcraft",
      "citation": "I.L.R. 39 Mad. 351",
      "treatment": "followed",
      "relevance": "Road maintenance sovereign function."
    },
    {
      "case_name": "Secretary of State for India in Council v. Shreegobinda Chaudhuri",
      "citation": "I.L.R. 59 Cal. 1289",
      "treatment": "followed",
      "relevance": "No tort liability for Court of Wards acts (sovereign)."
    },
    {
      "case_name": "Mohammad Murad Ibrahim Khan v. Governor of United Provinces",
      "citation": "I.L.R. 1957 1 All. 94",
      "treatment": "followed",
      "relevance": "Similar sovereign powers."
    },
    {
      "case_name": "Uma Parshad v. Secretary of State",
      "citation": "I.L.R. 18 Lah. 380",
      "treatment": "followed",
      "relevance": "No liability for Malkhana misappropriation under CrPC."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "51",
        "54(iv)",
        "550",
        "523"
      ],
      "relevance": "Powers of arrest, search, seizure, custody of seized property; referable to sovereign powers."
    },
    {
      "name": "U.P. Police Regulations",
      "sections": [
        "165",
        "166"
      ],
      "relevance": "Procedure for custody/disposal of seized property; valuables like gold/silver to be kept in Treasury; violation shows negligence."
    },
    {
      "name": "Indian Penal Code",
      "sections": [
        "409"
      ],
      "relevance": "Case against Mohd. Amir for misappropriation."
    },
    {
      "name": "Police Act",
      "sections": [
        "29"
      ],
      "relevance": "Case against Mohd. Amir."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "300(1)"
      ],
      "relevance": "Suits against State analogous to pre-Constitution against Provinces."
    },
    {
      "name": "Government of India Act, 1858",
      "sections": [
        "65"
      ],
      "relevance": "Basis for liability analogous to East India Company."
    },
    {
      "name": "Government of India Act, 1915",
      "sections": [
        "32"
      ],
      "relevance": "Predecessor provision."
    },
    {
      "name": "Government of India Act, 1935",
      "sections": [
        "176"
      ],
      "relevance": "Predecessor provision."
    },
    {
      "name": "Indian Partnership Act",
      "sections": [],
      "relevance": "Appellant firm registered."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed. Supreme Court held police negligent but State not liable as acts in exercise of sovereign powers. High Court judgment upheld.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "there is a great and clear distinction between acts done in the exercise of what are usually termed sovereign powers, and acts done in the conduct of undertakings which might be carried on by private individuals without having such powers delegated to them.",
      "speaker": "court",
      "significance": "Core principle distinguishing state liability."
    },
    {
      "text": "the power to arrest a person, to search him, and to seize property found with him, are powers conferred on the specified officers by statute and in the last analysis, they are powers which can be properly characterised as sovereign powers",
      "speaker": "court",
      "significance": "Applies distinction to police functions, no state liability."
    },
    {
      "text": "it is time that the Legislatures in India seriously consider whether they should not pass legislative enactments to regulate and control their claim of immunity in cases like this on the same lines as has been done in England by the Crown Proceedings Act, 1947.",
      "speaker": "court",
      "significance": "Suggests legislative reform for sovereign immunity."
    }
  ],
  "_case_id": "1964_191",
  "_label": 0,
  "_text_length": 44584,
  "_extracted_at": "2026-02-10T19:45:34.479995"
}