{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. Assessee (Holder of Impartible Estate, Ajmer)",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao J."
    ],
    "case_number": "Civil Appeal No. 954 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee was a holder of an impartible estate in the district of Ajmer.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On March 25, 1944, the Income-tax Officer assessed the assessee to income-tax for the assessment year 1942-43.",
      "type": "procedural",
      "date": "1944-03-25",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On April 5, 1945, on the ground that forest income and interest income were not included in the original assessment, a notice under s. 34 of the Indian Income-tax Act, 1922 was issued to the assessee.",
      "type": "procedural",
      "date": "1945-04-05",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In response to the notice, the assessee filed a return disclosing fully the particulars of his interest income, but raised the plea that his forest income was not taxable.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "By order dated July 12, 1945, the Income-tax Officer made a revised assessment including both forest and interest incomes.",
      "type": "procedural",
      "date": "1945-07-12",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The assessee appealed to the Income-tax Appellate Tribunal, which by order dated April 25, 1949, held that the Income-tax Officer had no jurisdiction to initiate proceedings under s. 34 for forest income as he had knowledge of it when making the original assessment. By inadvertence or mistake, the Tribunal set aside the entire reassessment order and restored the original assessment.",
      "type": "procedural",
      "date": "1949-04-25",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Income-tax Department did not rectify the mistake under s. 35 or seek reference to the High Court, allowing the Tribunal's order to become final.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On January 3, 1950, the Income-tax Officer, after obtaining sanction of the Commissioner, initiated proceedings under s. 34 with respect to the interest income.",
      "type": "procedural",
      "date": "1950-01-03",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On January 19, 1950, the Income-tax Officer issued a fresh notice under s. 34 to the assessee.",
      "type": "procedural",
      "date": "1950-01-19",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On September 25, 1950, a revised assessment order was made including the interest income.",
      "type": "procedural",
      "date": "1950-09-25",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On appeal, the Appellate Assistant Commissioner confirmed the order.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On further appeal, the Income-tax Appellate Tribunal held that interest income escaped assessment due to assessee's failure to disclose in original return under s. 22, attracting s. 34(1)(a).",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On application by assessee, Tribunal referred question to High Court under s. 66(1): 'Whether on the facts and in the circumstances of this case the provisions of s. 34(1) were applicable in respect of the assessment year 1942-43 on 19th January, 1950, when the notice under that provision was issued for the purpose of assessing the escaped interest income.'",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Allahabad High Court, by judgment dated March 9, 1964, answered the question in the negative, holding Tribunal's 1949 order final and invalidating entire s. 34 proceedings.",
      "type": "procedural",
      "date": "1964-03-09",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Income-tax Officer could initiate fresh proceedings under s. 34 of the Act on January 19, 1950, for assessing the escaped interest income after the Tribunal's final order dated April 25, 1949, setting aside the entire reassessment.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The interest income had escaped assessment and therefore the Income-tax Officer was competent to initiate proceedings under s. 34(1)(a) of the Act for assessing the same.",
      "supporting_facts": [
        "f4",
        "f12"
      ],
      "legal_basis": "s. 34(1)(a) as amended in 1948"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The assessment made pursuant to notice under s. 34 was in its entirety set aside by the Tribunal on the ground that there was no discovery within the meaning of s. 34, and that order had become final; therefore, the Income-tax Officer could not initiate fresh proceedings under that section on the principle of res judicata.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Finality of Tribunal orders under s. 33(6), res judicata"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Tribunal's order dated April 25, 1949, only discussed forest income but set aside the entire reassessment order, restoring the original; this order became final as no rectification under s. 35 or reference under s. 66 was pursued.",
      "addresses_issue": "i1",
      "key_observation": "The legal effect was that reassessment of entire income, including interest, was set aside for lack of discovery under s. 34."
    },
    {
      "id": "cr2",
      "text": "The Income-tax Act creates a hierarchy with finality to Tribunal orders under s. 33(6), subject to s. 66; final assessments cannot be reopened except under ss. 34 or 35 within time limits.",
      "addresses_issue": "i1",
      "key_observation": "Tribunal's finding that ITO had no definite information/discovery binds subsequent action."
    },
    {
      "id": "cr3",
      "text": "Amended s. 34(1)(a) does not permit reopening final decisions against Revenue; Tribunal's finding implies no reason to believe omission led to escape, binding on ITO.",
      "addresses_issue": "i1",
      "key_observation": "Reopening on same facts would circumvent final order and grant unrestricted review power."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Income-tax Officer cannot initiate fresh proceedings under s. 34 after the final Tribunal order holding no discovery under s. 34 for the reassessment.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Bombay Aden v. Khemchand Ramdas",
      "citation": "1938 6 I.T.R. 414, 424, 426",
      "treatment": "followed",
      "relevance": "Final assessments cannot be reopened except under ss. 34 and 35 within time limits; provisions exhaustive."
    },
    {
      "case_name": "Commissioner of Income-tax, West Punjab v. The Tribune Trust, Lahore",
      "citation": "1941 16 I.T.R. 214",
      "treatment": "followed",
      "relevance": "Assessments once made valid until set aside as per Act; if not, final."
    },
    {
      "case_name": "K. Das Co. v. Commissioner of Income-tax, West Bengal",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Dealt with validity of notice under s. 34 without sanction, not applicable here."
    },
    {
      "case_name": "Commissioner of Income-tax, Bihar Orissa v. Maharaja Pratapsingh Bahadur of Gidhaur",
      "citation": null,
      "treatment": "referred",
      "relevance": "Notice under s. 34(1) without sanction makes entire proceedings illegal."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 34",
        "s. 35",
        "s. 31",
        "s. 33",
        "s. 66",
        "s. 22",
        "s. 23",
        "s. 29",
        "s. 66(1)",
        "s. 33(6)",
        "s. 34(1)(a)"
      ],
      "relevance": "Governs initiation of reassessment proceedings, finality of Tribunal orders, rectification of mistakes, and references to High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's view that the Tribunal's 1949 order, which became final, invalidated the entire s. 34 reassessment proceedings, preventing fresh initiation for interest income.",
    "relief_granted": "Appeal dismissed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"We are, therefore, of the opinion that proceedings under s. 34 could not be initiated against the assessee for the four assessment years under reference.\"",
      "speaker": "court",
      "significance": "Tribunal's finding on lack of jurisdiction under s. 34."
    },
    {
      "text": "\"The finding of the Tribunal is, therefore, binding on the Income Officer and he cannot, in the circumstances of the case, reopen the assessment and initiate proceedings over again.\"",
      "speaker": "court",
      "significance": "Core holding on finality and binding nature of Tribunal's decision."
    },
    {
      "text": "\"If that was not the legal position, we would be placing an unrestricted power of review in the hands of an Income-tax Officer to go behind the findings given by a hierarchy of tribunals.\"",
      "speaker": "court",
      "significance": "Explains policy against allowing ITO to circumvent final orders."
    }
  ],
  "_case_id": "1964_139",
  "_label": 0,
  "_text_length": 15760,
  "_extracted_at": "2026-02-10T19:44:08.999831"
}