{
  "metadata": {
    "case_name": "Mallappa Basappa Desai & Ors. v. Respondents",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar C.J."
    ],
    "case_number": "Civil Appeal No. 553 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Sangappa Gadigappa Desai was the last male holder of the Desgast properties.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Sangappa's widow Kashibai came into possession of the properties after his death.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In 1929, Collector held appellant's father as nearest male reversioner to Sangappa's estate.",
      "type": "background",
      "date": "1929",
      "source": "appellant"
    },
    {
      "id": "f4",
      "text": "Appellant's father died in 1943.",
      "type": "background",
      "date": "1943",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "In 1946, enquiry held and appellant found to be eldest male member of eldest branch entitled to succeed.",
      "type": "background",
      "date": "1946",
      "source": "appellant"
    },
    {
      "id": "f6",
      "text": "Kashibai continued in uninterrupted and exclusive possession until her death on 1st January 1958.",
      "type": "admitted",
      "date": "1958-01-01",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On 7th January 1958, appellant filed application before Mamlatdar for entry of his name in Record of Rights for lands of Jainapur Desgast estate.",
      "type": "procedural",
      "date": "1958-01-07",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent No.1 filed Application No.1 of 1958 under s.192 Indian Succession Act on 8th January 1958; same day applied for Commissioner, ex parte order appointing Mr. Managoli as Commissioner who made inventory, later confirmed.",
      "type": "procedural",
      "date": "1958-01-08",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On 9th January 1958, Respondent No.2 filed Application No.2 under Bombay Regulation VIII of 1827.",
      "type": "procedural",
      "date": "1958-01-09",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On 5th February 1958, Respondents 3 and 4 filed Application No.4/1958 under Rules 9 and 10 of Regulation.",
      "type": "procedural",
      "date": "1958-02-05",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On 6th February 1958, Respondent No.2 filed Application No.5/1958 under s.192 Indian Succession Act.",
      "type": "procedural",
      "date": "1958-02-06",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On 10th February 1958, Respondent No.6 filed Application No.6/1958 under Regulation VIII of 1827.",
      "type": "procedural",
      "date": "1958-02-10",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On 27th February 1958, Tehsildar ordered appellant's name as superior holder in Record of Rights for Desgast lands.",
      "type": "procedural",
      "date": "1958-02-27",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Respondents 1-4 appealed to Assistant Commissioner Bijapur; appeals dismissed, Tehsildar order confirmed on 17th May 1958.",
      "type": "procedural",
      "date": "1958-05-17",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Respondents moved Mysore Revenue Appellate Tribunal in revision; Tribunal allowed revisions on 5th December 1958, directed names of respondents entered as superior holders along with appellant.",
      "type": "procedural",
      "date": "1958-12-05",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Appellant moved Mysore High Court under Art.227; application allowed on 7th December 1959, Tribunal order set aside, Assistant Commissioner order confirmed.",
      "type": "procedural",
      "date": "1959-12-07",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "On 18th January 1960, Additional District Judge held case made out for appointment of Administrator under r.9, appointed Dy. Commissioner of Bijapur as Administrator for estate of deceased Kashibai including scheduled property until succession determined.",
      "type": "procedural",
      "date": "1960-01-18",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "Appellant challenged Additional District Judge order in Mysore High Court under s.115 CPC; High Court dismissed on 27th February 1963, holding possession question of fact, no ground to interfere.",
      "type": "procedural",
      "date": "1963-02-27",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Additional District Judge found dispute as to succession to Kashibai's estate, several persons applied with claims; no person amongst parties had taken possession of estate.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f20",
      "text": "Appellant claimed possession of substantial immovable agricultural lands via rent notes from tenants; Judge held rent notes post-commencement of proceedings, not helpful, affected by lis pendens.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f21",
      "text": "Movable property in custody of Court; Commissioner appointed, inventory made, properties taken into Court possession.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f22",
      "text": "Mutation, revenue orders, rent notes all subsequent to commencement of proceedings.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Construction of Rule 9 of Bombay Regulation VIII of 1827: relevant date for determining if none of the claimants has taken possession is date of commencement of proceedings, not date of order.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Impugned order not justified by terms of r.9; appellant in possession at date of appointment order (bulk of properties), produced rent notes from tenants; relevant date is date of order.",
      "supporting_facts": [
        "f20",
        "f22"
      ],
      "legal_basis": "Rule 9, Bombay Regulation VIII of 1827"
    },
    {
      "id": "pa2",
      "text": "Rent notes executed after commencement not affected by lis pendens; bare question of possession favours appellant.",
      "supporting_facts": [
        "f20"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Appellant not in possession at commencement of proceedings; question of possession is factual.",
      "supporting_facts": [
        "f19",
        "f22"
      ],
      "legal_basis": "Section 115 CPC"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Relevant date for possession under r.9 clause 'where the right of succession is disputed between two or more claimants, none of whom has taken possession' is date of commencement of proceedings, not date of order.",
      "addresses_issue": "i1",
      "key_observation": "Proceedings commence on application by claimant or suo motu; possession after commencement irrelevant to satisfy r.9 requirement."
    },
    {
      "id": "cr2",
      "text": "Appellant's construction leads to anomalous results, e.g., possession obtained during appeal would invalidate order.",
      "addresses_issue": "i1",
      "key_observation": "r.9 ensures smooth, peaceful devolution; appointment of administrator pendente lite does not prejudice claims."
    },
    {
      "id": "cr3",
      "text": "Preamble to Regulation supports appointment where no one entitled/willing or dispute with none in possession.",
      "addresses_issue": "i1",
      "key_observation": "Summary proceedings under Regulation do not bar civil suit for title."
    },
    {
      "id": "cr4",
      "text": "Courts below right: no possession at commencement, dispute exists, r.9 satisfied.",
      "addresses_issue": "i1",
      "key_observation": "Lower courts' factual findings on possession not interferable."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under r.9 Bombay Regulation VIII of 1827, where succession disputed between claimants none of whom in possession at commencement of proceedings, court may appoint administrator until succession determined.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bombay Regulation VIII of 1827",
      "sections": [
        "Rule 9",
        "Rule 1",
        "Rule 2",
        "Rules 3 to 6",
        "Rule 8",
        "Rule 10"
      ],
      "relevance": "Governs appointment of administrator when succession disputed and none of claimants in possession at commencement of proceedings; summary recognition of heirs etc."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 115"
      ],
      "relevance": "Revisional jurisdiction invoked by appellant against Additional District Judge order"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 227"
      ],
      "relevance": "Appellant invoked against Revenue Tribunal order"
    },
    {
      "name": "Indian Succession Act, 1925",
      "sections": [
        "Section 192"
      ],
      "relevance": "Applications filed by respondents for commissioner/inventory"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal by special leave, upholding the Mysore High Court and Additional District Judge orders appointing Deputy Commissioner as administrator of Kashibai's estate under r.9 until succession determined.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Whenever there is no person on the spot entitled and willing to take charge of the property of a person deceased, where the right of succession is disputed between two or more claimants, none of whom has taken possession... the Judge... may appoint an administrator.\"",
      "speaker": "court",
      "significance": "Verbatim text of Rule 9 central to dispute"
    },
    {
      "text": "What the Court has to consider... is was any of the claimants in possession... at the date of the commencement of the proceedings under this Regulation?",
      "speaker": "court",
      "significance": "Defines key temporal requirement for r.9 application"
    },
    {
      "text": "The appointment of the administrator does not prejudice the claim of any person who has set up a title to succession.",
      "speaker": "court",
      "significance": "Explains purpose and non-prejudicial nature of administrator"
    }
  ],
  "_case_id": "1964_51",
  "_label": 0,
  "_text_length": 16944,
  "_extracted_at": "2026-02-10T19:43:24.825003"
}