{
  "metadata": {
    "case_name": "Haricharan Kurmi and Jogia Hajam v. State",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "GAJENDRAGADKAR C.J."
    ],
    "case_number": "Criminal Appeals Nos. 208 and 209 of 1963",
    "date_of_judgment": "1964-02-03"
  },
  "facts": [
    {
      "id": "f1",
      "text": "During the night intervening 24th and 25th March 1960, dacoity committed in house of Deokinandan Jaiswal, and murder of his wife Damyanti Devi.",
      "type": "material",
      "date": "1960-03-24",
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Deokinandan Jaiswal received Rs. 15,000 in currency notes from partner Nathan Mary on 24th March 1960, in presence of minims Achheylal and Ram Bachan; added Rs. 2,000 from iron safe, bundled with slip containing signature and date, handed to wife Damyanti Devi who put it in iron safe on first floor.",
      "type": "background",
      "date": "1960-03-24",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Jaiswal slept at Dharamshala due to late function; Damyanti Devi alone on first floor with child Mina (3.5 years old); on ground floor sleeping: Achheylal, Ram Bachan, Joginder Singh; Ram Surat on leave; Batahu (cook) in verandah attached to motor garage.",
      "type": "background",
      "date": "1960-03-24",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "Next day, Batahu awakened by Achheylal; found door of hall open; on first floor, Damyanti Devi dead in pool of blood with cut injuries on neck; Mina asleep; bundles of currency notes removed.",
      "type": "material",
      "date": "1960-03-25",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Jaiswal informed, reported to police; investigation led to charge against six accused: Haricharan Kurmi, Jogia Hajam, Ram Bachan Ram, Joginder Singh, Ram Surat Choudhury, Achheylal Choudhury under s.396 IPC.",
      "type": "procedural",
      "date": "1960-03-25",
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Sessions Judge, Muzaffarpur, convicted all six, sentenced to imprisonment for life.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Patna High Court: Confirmed conviction for five (except Joginder Singh acquitted); discharged enhancement rule for Joginder, Ram Bachan, Ram Surat, Achheylal (life sentence confirmed); enhanced to death for Haricharan Kurmi and Jogia Hajam.",
      "type": "procedural",
      "date": "1963-08-17",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Confessions made by Ram Surat, Achheylal, Ram Bachan; courts below found Ram Surat's confession voluntary and true.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellants are co-villagers of Joginder Singh.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Achheylal and Ram Bachan served as minims under Jaiswal; Joginder Singh as sepoy; Ram Surat as personal servant.",
      "type": "background",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "Appellants arrested next day after offence on suspicion by Jaiswal.",
      "type": "procedural",
      "date": "1960-03-26",
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "On 26th March 1960 at 3.30 p.m., investigation officer found blood stains in lane between southern wall of Jaiswal's godown and northern wall of east-facing room of Haricharan; later bloodstained shirt found; pieces of earth with blood stains and shirt sent to Chemical Analyser.",
      "type": "material",
      "date": "1960-03-26",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Blood on shirt seized from Haricharan: traces of human blood; nails of Haricharan's hands showed traces of blood, cut and sent; too small for serological test; origin of blood on earth undetermined.",
      "type": "material",
      "date": "1960-03-26",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "From Jogia's house, red-coloured check gamcha with blood-like stains recovered from top of earthen granary at 6 a.m. on 27th March 1960; sent to Chemical Analyser: human blood stains; not found during search on 26th March.",
      "type": "material",
      "date": "1960-03-27",
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "No direct evidence; prosecution relies on confessions of three accused, recovery of stolen property, bloodstained clothes of appellants, blood stains in Haricharan's house.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Confessions attribute major part to appellants, including fatal injuries.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court erred in law in treating the confession made by co-accused Ram Surat Choudhury as substantive evidence against the appellants, inconsistent with s.30 of the Indian Evidence Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Correct scope and effect of s.30 Evidence Act: whether confession of co-accused can be considered as substantive evidence or only for assurance after other evidence is found satisfactory.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in treating confession of co-accused Ram Surat as substantive evidence against appellants; course adopted inconsistent with consensus of judicial opinion on true scope of s.30 Evidence Act.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Section 30 of Indian Evidence Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Blood stains on clothes of appellants and in Haricharan's house corroborate confession of Ram Surat; sufficient to prove case; approach justified per Ram Prakash v. State of Punjab.",
      "supporting_facts": [
        "f12",
        "f13",
        "f14"
      ],
      "legal_basis": "Ram Prakash v. State of Punjab (1959 S.C.R. 1219/1291); Section 30 Evidence Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S.30 allows court to take confession of co-accused into consideration against others, but it is not substantive evidence under s.3 Evidence Act; must first consider other evidence; if satisfactory, confession can provide assurance.",
      "addresses_issue": "i1",
      "key_observation": "Confession not evidence as defined; weaker than accomplice evidence; cannot start with confession."
    },
    {
      "id": "cr2",
      "text": "Other evidence (blood stains) insufficient to prove charge; discoveries made hours/days after, blood origin undetermined in parts, no link to offence.",
      "addresses_issue": "i1",
      "key_observation": "Circumstantial evidence entirely insufficient."
    },
    {
      "id": "cr3",
      "text": "Ram Prakash observations misinterpreted; did not equate co-accused confession to accomplice evidence requiring corroboration as substantive.",
      "addresses_issue": "i2",
      "key_observation": "Clarifies Ram Prakash does not depart from established principles."
    },
    {
      "id": "cr4",
      "text": "Suspicion from detailed confession cannot replace proof; presumption of innocence requires acquittal if other evidence unsatisfactory.",
      "addresses_issue": "i1",
      "key_observation": "No scope for moral conviction or grave suspicion in criminal law."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Confession of co-accused under s.30 is not substantive evidence; court must begin with other evidence and use confession only for assurance if other evidence satisfactory.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "High Court erred in confirming conviction based primarily on co-accused confessions corroborated by weak blood stain evidence.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ram Prakash v. State of Punjab",
      "citation": "1959 S.C.R. 1219 / 1291",
      "treatment": "doubted",
      "relevance": "High Court relied on it to treat confession as substantive needing corroboration; Court clarifies misinterpretation, affirms other evidence was strong there."
    },
    {
      "case_name": "Emperor v. Lalit Mohan Chuckerbutty",
      "citation": "1911 I.L.R. 38 Cal. 559",
      "treatment": "followed",
      "relevance": "Confession can only lend assurance to other evidence."
    },
    {
      "case_name": "In re. Peryaswami Noopan",
      "citation": "1913 I.L.R. 54 Mad. 75",
      "treatment": "followed",
      "relevance": "Confession under s.30 thrown into scale as additional reason if other evidence sufficient."
    },
    {
      "case_name": "Bhuboni Sahu v. King",
      "citation": "1949 76 I.A. 147",
      "treatment": "followed",
      "relevance": "Confession weak evidence, not proof; must be other evidence; only element in consideration."
    },
    {
      "case_name": "Kashmira Singh v. State of Madhya Pradesh",
      "citation": "1951 S.C.R. 526",
      "treatment": "followed",
      "relevance": "Affirms Bhuboni Sahu; proper approach: other evidence first, then confession for assurance."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "396"
      ],
      "relevance": "Offence of dacoity with murder charged against all accused."
    },
    {
      "name": "Indian Evidence Act",
      "sections": [
        "30",
        "3",
        "133",
        "114"
      ],
      "relevance": "S.30: Scope of co-accused confession; distinguished from substantive evidence and accomplice testimony."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeals, set aside the convictions and death sentences imposed by Patna High Court on Haricharan Kurmi and Jogia Hajam under s.396 IPC, and acquitted them, holding other evidence insufficient and co-accused confession not substantive evidence.",
    "relief_granted": "Acquittal of appellants",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "a confession cannot be treated as evidence which is substantive evidence against a co-accused person.",
      "speaker": "court",
      "significance": "Core holding on s.30 Evidence Act."
    },
    {
      "text": "the proper approach to adopt is to consider the other evidence against such an accused person, and if the said evidence appears to be satisfactory... the court turns to the confession with a view to assure itself that the conclusion... is right.",
      "speaker": "court",
      "significance": "Defines correct methodology for using co-accused confession."
    },
    {
      "text": "In criminal trials, there is no scope for applying the principle of moral conviction or grave suspicion.",
      "speaker": "court",
      "significance": "Emphasizes proof beyond reasonable doubt."
    }
  ],
  "_case_id": "1964_93",
  "_label": 1,
  "_text_length": 28065,
  "_extracted_at": "2026-02-10T19:44:09.031468"
}