{
  "metadata": {
    "case_name": "Appellant v. Respondents (Jealgora Govindpur Colliery sub-lease dispute)",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "MUDHOLKAR, J."
    ],
    "case_number": "Civil Appeal No. 46 of 1961",
    "date_of_judgment": "1964-04-01"
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant holds permanent lease-hold rights over Jealgora Govindpur Colliery and had worked the colliery himself for some time.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On January 31, 1949, appellant granted a sub-lease of the colliery to respondent No. 4 for a term of five years.",
      "type": "material",
      "date": "1949-01-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "At the time of sub-lease, 2803 tons of slack and rubble coal was lying in the colliery; under separate agreement, respondent No. 4 liable to pay Rs. 10/- per ton after selling it.",
      "type": "material",
      "date": "1949-01-31",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "According to appellant, respondent No. 4 sold the coal but did not pay its price amounting to Rs. 28,030/-.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Royalty and commission due to appellant from respondents in respect of coal extracted by them from the colliery.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Rs. 1,355-8-3 loan taken by respondents from appellant on February 17, 1949.",
      "type": "disputed",
      "date": "1949-02-17",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Total claim tentatively valued at Rs. 57,000/-; suit instituted against respondents.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Respondents 1, 2, 4 and 5 formed partnership firm Saurashtra Coal Concern (defendant No. 5, now respondent No. 3); appellant claimed respondent No. 4 was benamidar for the firm.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Respondents 4 and 5 (father and son) admitted lease obtained by respondent No. 4 on behalf of partnership but claimed surrender of lease-hold interest to appellant on November 1, 1950, accepted by him.",
      "type": "admitted",
      "date": "1950-11-01",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "According to respondents 4 and 5, coal stock not actually weighed (2803 tons rough estimate); on surrender date, stock exceeded 2803 tons including soft coal left by appellant; appellant took possession promising adjustment towards dues; disclaimed liability for coal price and denied loan.",
      "type": "disputed",
      "source": "respondent"
    },
    {
      "id": "f11",
      "text": "Respondents 1 and 2 denied claim totally; respondent No. 4 took sub-lease in personal capacity, not on behalf of others; no privity of contract with appellant.",
      "type": "disputed",
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "According to respondents 1 and 2, respondent No. 4 gave managing agency of colliery to Saurashtra Coal Concern (first respondent financing partner, second working partner); concern never sub-lessee.",
      "type": "disputed",
      "source": "respondent"
    },
    {
      "id": "f13",
      "text": "No separate written statement filed by respondent No. 3.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Trial court negatived loan claim; decreed Rs. 28,030/- as coal price and commission thereon against all respondents; passed preliminary decree for royalty and commission (minimum Rs. 26,000/-).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Respondents 1 to 3 appealed to Patna High Court, which accepted appeal; decree stands only against respondents 4 and 5, set aside against 1 to 3.",
      "type": "procedural",
      "date": "1958-07-17",
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Both courts below concurrently found sub-lease taken by respondent No. 4 alone.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "Even according to respondents 1 to 3, they came into possession of colliery immediately after sub-lease execution.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether respondent No. 4 being a partner in Saurashtra Coal Concern, all partners of the firm are liable under the sub-lease as the firm admittedly came into possession of the colliery.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Respondent No. 4 was benamidar for the partnership firm; all respondents liable for claim.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Respondent No. 4 partner, firm in possession; even per respondents 1-3, possession immediate after sub-lease, infer partnership pre-existed before lease obtained.",
      "supporting_facts": [
        "f16",
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Relied on Karmali Abdulla Allarakia v. Vora Karimji Jiwanji; Gouthwaite v. Duckworth; Mathura Nath Choudhury v. Sreejukta Bageswari Rani; Pandiri Veeranna v. Grandi Veerabhadraswami; Lakshmishankar Devshankar v. Motiram Vishnuram.",
      "supporting_facts": [],
      "legal_basis": "Cited precedents"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Sub-lease taken by respondent No. 4 alone, not on behalf of firm; no privity of contract with appellant.",
      "supporting_facts": [
        "f11",
        "f12",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Surrendered lease on November 1, 1950, accepted; coal stock exceeded estimate, appellant took possession promising adjustment; no liability for coal price post-surrender; denied loan.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appellant's new case (partnership pre-existed and liable via possession) not put forward in courts below; only case was benamidar, which respondents met; not proper to permit new case at this stage.",
      "addresses_issue": "i1",
      "key_observation": "This, however, has never been the case of the appellant in the courts below."
    },
    {
      "id": "cr2",
      "text": "Section 22 of Indian Partnership Act, 1932: To bind firm, act/instrument by partner must be in name of firm or expressing/implying intention to bind firm. Sub-lease not executed in firm name; courts below found respondent No. 4 did not act on behalf of firm.",
      "addresses_issue": "i1",
      "key_observation": "In substance means that in obtaining the sub-lease, the parties to it did not intend to bind the firm by that transaction."
    },
    {
      "id": "cr3",
      "text": "Distinguished Karmali Abdulla (hundi in partnership transaction); Mathura Nath (liability on partnership business contract); Pandiri Veeranna (authority from circumstances for acknowledgment); Lakshmishankar (money borrowed in firm name applied to firm debts). Here, sub-lease not on behalf of partnership.",
      "addresses_issue": "i1",
      "key_observation": "That decision, however, does not help the appellant, because while the transaction... was admittedly a partnership transaction, in the case before us, it has been found that the transaction... was not on behalf of the partnership."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Partners not liable under sub-lease taken solely by respondent No. 4; no intention to bind firm per s.22 Partnership Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Karmali Abdulla Allarakia v. Vora Karimji Jiwanji",
      "citation": "ILR 39 Bom. 261",
      "treatment": "distinguished",
      "relevance": "Hundi drawn by one partner binds other if partnership transaction, unlike here where sub-lease not on behalf of firm."
    },
    {
      "case_name": "Gouthwaite v. Duckworth",
      "citation": "1810 12 East 421",
      "treatment": "referred",
      "relevance": "Followed in Karmali Abdulla for partner liability on hundi."
    },
    {
      "case_name": "Mathura Nath Choudhury v. Sreejukta Bageswari Rani",
      "citation": "46 CLJ 362",
      "treatment": "distinguished",
      "relevance": "Firm liable for money borrowed by partner in partnership business; unlike here."
    },
    {
      "case_name": "Pandiri Veeranna v. Grandi Veerabhadraswami",
      "citation": "ILR 41 Mad. 427 (Full Bench)",
      "treatment": "distinguished",
      "relevance": "Authority of partner inferred from circumstances for acknowledgment; not applicable."
    },
    {
      "case_name": "Lakshmishankar Devshankar v. Motiram Vishnuram",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Firm liable for money borrowed in firm name applied to firm debts; sub-lease not in firm name here."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 133(1)(a)"
      ],
      "relevance": "Certificate granted by Patna High Court for appeal to Supreme Court."
    },
    {
      "name": "Indian Partnership Act, 1932",
      "sections": [
        "Section 22"
      ],
      "relevance": "Requires act/instrument by partner to be in firm name or implying intention to bind firm; not satisfied here."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; decree of trial court stands only against respondents 4 and 5, set aside against respondents 1 to 3 as upheld by High Court.",
    "relief_granted": "None to appellant against respondents 1-3.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"s. 22 of the Indian Partnership Act, 1932, clearly provides that in order to bind a firm by an act or an instrument executed by a partner on behalf of the firm, the act should be done or the instrument should be executed in the name of the firm, or in any other manner expressing or implying an intention to bind the firm.\"",
      "speaker": "court",
      "significance": "Core legal basis for holding partners not liable."
    },
    {
      "text": "\"It would not be proper to permit the appellant to make out an entirely new case at this stage.\"",
      "speaker": "court",
      "significance": "Rejects appellant's shifted argument on partnership liability via possession."
    }
  ],
  "_case_id": "1964_181",
  "_label": 0,
  "_text_length": 9462,
  "_extracted_at": "2026-02-10T19:44:49.768910"
}