{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Nainital Bank Limited",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao J."
    ],
    "case_number": "Civil Appeal No. 938 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee is the Nainital Bank Limited, a public limited company which carries on the business of banking with various branches including one at Ramnagar.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In the usual course of its business large amounts were kept in various safes in the premises of the Ramnagar branch of the Bank.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On June 11, 1951, at about 7 P.M. there was a dacoity in the Ramnagar branch of the Bank and the dacoits carried away cash amounting to Rs. 1,06,000 and some ornaments etc. pledged with the Bank.",
      "type": "material",
      "date": "1951-06-11",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "For the assessment year 1952-53 the Bank claimed the said amount as a deduction in computing its income from the banking business on the ground that it was a trading loss.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "The Income-tax Officer disallowed the claim on the ground that it was not a loss incidental to the banking business.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "On appeal, the Appellate Assistant Commissioner of Income-tax, and on further appeal, the Income-tax Appellate Tribunal, confirmed the ITO's finding.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On a reference to the High Court of Judicature at Allahabad, a Division Bench held that the loss by dacoity was incidental to the banking business and was a trading loss, entitling the assessee to deduction under S. 10(1) of the Act.",
      "type": "procedural",
      "date": "1960-12-19",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether loss of cash by dacoity is an admissible deduction under S. 10(1) of the Indian Income-tax Act, 1922, in computing the assessee's income in a banking business.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The Bank lost the money by burglary not in its capacity as a bank but only just like any other citizen, that the risk of burglary was not incidental to the business of banking and that, therefore, the amount burgled could not be deducted as a trading loss.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Badridas Daga v. Commissioner of Income-tax (illustration of thief breaking into money-lender's premises)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The money lost by burglary was the stock in-trade of the banking business, that it was kept in the Bank in the usual course of its business and that the risk of its loss was incidental to the carrying on of the said business and, therefore, the amount lost was a trading loss liable to be deducted under S. 10(1) of the Act.",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "S. 10(1) of the Indian Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Cash is the stock-in-trade of a banking company. Banking business consists mainly in receiving deposits, making advances, realizing them and making fresh advances. It is a continuous process which requires maintenance of ready cash in the bank premises.",
      "addresses_issue": "i1",
      "key_observation": "The Ramnagar branch of the Bank had kept large amounts in the Bank premises in the usual course of its business in order to meet the demands of its constituents."
    },
    {
      "id": "cr2",
      "text": "Loss of stock-in-trade is deductible under S. 10(1). Examples include irrecoverable loans in money-lending, destruction by fire, enemy invasion, white-ants.",
      "addresses_issue": "i1",
      "key_observation": "Cash is stock-in-trade of banking business and its loss in the course of business under varying circumstances is deductible as trading loss."
    },
    {
      "id": "cr3",
      "text": "Every loss of stock-in-trade is not deductible unless incurred in the course of business and incidental to it. Principle from Badridas Daga: deduction if arises out of carrying on of business and incidental to it.",
      "addresses_issue": "i1",
      "key_observation": "Distinguishes the illustration in Badridas Daga (money-lender) from banking company where deposits form part of circulating capital and stock-in-trade."
    },
    {
      "id": "cr4",
      "text": "In Motipur Sugar Factory case, loss by robbery of cash entrusted to employee for disbursement was incidental to business.",
      "addresses_issue": "i1",
      "key_observation": "If robbery from employee incidental, then dacoity from bank premises equally so, as funds lodged for disbursement to constituents."
    },
    {
      "id": "cr5",
      "text": "Australian and New Zealand cases support: loss by robbery incidental if connected to operations producing income, regardless of frequency.",
      "addresses_issue": "i1",
      "key_observation": "Retention of money in bank premises carries risk of dacoity, incidental to banking operations."
    },
    {
      "id": "cr6",
      "text": "Under S. 10(1) trading loss deductible if incurred in carrying out operation of business and incidental. In banking, keeping cash to meet demands is integral, risk of theft/dacoity incidental.",
      "addresses_issue": "i1",
      "key_observation": "Loss by dacoity incidental to carrying on business of banking."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Loss incurred by dacoity in the bank premises is incidental to the carrying on of the business of banking and is a trading loss deductible under S. 10(1) of the Indian Income-tax Act, 1922.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Arunachalam Chettiar v. Commissioner of Income-tax Madras",
      "citation": "1936 4 I.T.R. 173 (P.C.)",
      "treatment": "followed",
      "relevance": "Cash is stock-in-trade of banker or money-lender."
    },
    {
      "case_name": "Commissioner of Income-tax, Madras v. Subramanya Pillai",
      "citation": "1950 18 I.T.R. 85",
      "treatment": "followed",
      "relevance": "Bad debts in money-lending represent loss of stock-in-trade."
    },
    {
      "case_name": "Ramaswami Chettiar v. Commissioner of Income-tax, Madras",
      "citation": "I.L.R. 1930 53 Mad. 904 (Full Bench)",
      "treatment": "doubted",
      "relevance": "Majority held theft loss not deductible if not by employee; dissent preferred."
    },
    {
      "case_name": "Motipur Sugar Factory Ltd. v. Commissioner of Income-tax, Bihar Orissa",
      "citation": "1955 28 I.T.R. 128",
      "treatment": "followed",
      "relevance": "Robbery of cash from employee incidental to business."
    },
    {
      "case_name": "Badridas Daga v. Commissioner of Income-tax",
      "citation": "1959 S.C.R. 690",
      "treatment": "followed but distinguished",
      "relevance": "Principle: loss deductible if incidental to business; illustration of thief from money-lender distinguished from bank."
    },
    {
      "case_name": "Green v. J. Gliksten and Son Ltd.",
      "citation": "1928-29 14 T.C. 364",
      "treatment": "followed",
      "relevance": "Insurance receipt for stock destroyed by fire is trading receipt."
    },
    {
      "case_name": "Raghuvanshi Mills Ltd. v. Commissioner of Income-tax, Bombay City",
      "citation": "1953 S.C.R. 177",
      "treatment": "followed",
      "relevance": "Insurance for stock loss is trading receipt."
    },
    {
      "case_name": "Pohoomal Bros. v. Commissioner of Income-tax, Bombay City",
      "citation": "1958 34 I.T.R. 64",
      "treatment": "followed",
      "relevance": "Loss by enemy invasion is trading loss."
    },
    {
      "case_name": "Hira Lal Phoolchand v. Commissioner of Income-tax, C.P., U.P. and Berar",
      "citation": "1947 15 I.T.R. 205",
      "treatment": "followed",
      "relevance": "Loss by white-ants to stock-in-trade is trading loss."
    },
    {
      "case_name": "Venkatachalapathy Iyer v. Commissioner of Income-tax",
      "citation": "1951 20 I.T.R. 363",
      "treatment": "followed",
      "relevance": "Agreed with in Badridas Daga."
    },
    {
      "case_name": "Lords Dairy Farm Ltd. v. Commissioner of Income-tax",
      "citation": "1955 27 I.T.R. 700",
      "treatment": "followed",
      "relevance": "Agreed with in Badridas Daga."
    },
    {
      "case_name": "Charles Moore and Co. (W.A.) Pvt. Ltd. v. Federal Commissioner of Taxation",
      "citation": "1956-57 95 C.L.R. 344",
      "treatment": "followed",
      "relevance": "Robbery of takings en route to bank incidental to business."
    },
    {
      "case_name": "Gold Band Services Limited v. Commissioner of Inland Revenue",
      "citation": "1961 N.Z.L.R. 467",
      "treatment": "followed",
      "relevance": "Armed robbery at service station premises deductible."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "S. 10(1)"
      ],
      "relevance": "Trading losses incidental to business deductible in computing profits."
    },
    {
      "name": "Banking Companies Act, 1949",
      "sections": [
        "S. 5(1)(b)",
        "S. 5(1)(c)",
        "S. 5(1)(cc)",
        "S. 6(1)"
      ],
      "relevance": "Defines banking, banking company, branch; business involves receiving deposits, cashing cheques, lending money."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal by the Revenue is dismissed. The Allahabad High Court correctly held that the loss by dacoity is a trading loss incidental to banking business, deductible under S. 10(1) of the Indian Income-tax Act, 1922.",
    "relief_granted": "Assessee entitled to deduction of Rs. 1,06,000 as trading loss.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Cash is the stock-in-trade of a banking company.\"",
      "speaker": "court",
      "significance": "Establishes foundational premise for deductibility."
    },
    {
      "text": "\"The retention of money in the bank premises carries with it the ordinary risk of its being subject of embezzlement, theft, dacoity or destruction by fire and such other things. Such risk of loss is incidental to the carrying on of the operations of the business of banking.\"",
      "speaker": "court",
      "significance": "Core holding on why dacoity loss is incidental."
    },
    {
      "text": "\"If employment of agents is incidental to the carrying on of business, it must logically follow that losses which are incidental to such employment are also incidental to the carrying on of the business.\"",
      "speaker": "court",
      "significance": "From Badridas Daga, principle applied."
    }
  ],
  "_case_id": "1964_232",
  "_label": 0,
  "_text_length": 22096,
  "_extracted_at": "2026-02-10T19:45:35.640110"
}