{
  "metadata": {
    "case_name": "Appellant (public limited company) v. Commercial Tax Officer and Commissioner of Commercial Taxes, West Bengal",
    "case_year": 1954,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Civil Appeal No. 94 of 1954",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a public limited company registered as a dealer under the Bengal Finance Sales Tax Act, 1941, having its registered place of business at Calcutta.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In respect of the accounting year ending 31st December 1954, the assessee showed gross turnover at Rs. 70,99,928-10-0 and claimed exemption under s.5(2)(a)(i) Rs. 1,33,730-6-6 and under s.5(2)(a)(ii) Rs. 69,65,979-9-6, showing taxable turnover at Rs. 218-9-0 and depositing tax of Rs. 9-12-6.",
      "type": "material",
      "date": "1954-12-31",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Commercial Tax Officer by notice dated April 22, 1955, fixed August 4, 1955, for hearing the assessee in respect of its return.",
      "type": "procedural",
      "date": "1955-04-22",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "In the second week of January 1957, the assessee found that its file containing 147 declaration forms received from its dealers was missing.",
      "type": "material",
      "date": "1957-01",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "The assessee made attempts to get duplicate forms from dealers but could not due to circumstances beyond control and unhelpful attitude of Commercial Tax Officer.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "On August 8, 1957, assessee applied to Commercial Tax Officer under s.21A for summoning dealers to produce documents, but officer did not issue summons.",
      "type": "procedural",
      "date": "1957-08-08",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Assessee applied to Commissioner of Commercial Taxes for directions to issue duplicate declaration forms, but application rejected.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Revision to Revenue Board dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "On November 21, 1957, Commercial Tax Officer made assessment order disallowing exemption for sales amounting to Rs. 22,46,006-0-6 and levied additional tax of Rs. 1,49,778-4-6.",
      "type": "material",
      "date": "1957-11-21",
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "Assessee filed petition under Art. 226 in Calcutta High Court against respondents to quash assessment order; dismissed by Sinha, J., confirmed by Division Bench on August 17, 1951.",
      "type": "procedural",
      "date": "1951-08-17",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appeal to Supreme Court on certificate granted by High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether under s. 5(2)(a)(ii) of the Bengal Finance Sales Tax Act, 1941, the furnishing of declaration forms issued by purchasing dealers is a condition for claiming the exemption thereunder.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The proviso to s.5(2)(a)(ii) prescribes the declaration form as best evidence to prove sales were for purposes mentioned, but is directory; dealer not precluded from producing other relevant evidence if proviso cannot be strictly complied with.",
      "supporting_facts": [
        "f2",
        "f4",
        "f5"
      ],
      "legal_basis": "s.5(2)(a)(ii); r.27A ('on demand' indicates not obligatory)"
    },
    {
      "id": "pa2",
      "text": "Department responsible for preventing furnishing of duplicates and failed to summon dealers under s.21A.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "s.21A"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Dealer can claim exemption under s.5(2)(a)(ii) only by strict compliance with conditions, including furnishing prescribed declaration form; proviso qualifies substantive clause and is mandatory.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "s.5(2)(a)(ii) proviso; strict construction of exemptions"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Proviso to s.5(2)(a)(ii) imposes condition that declaration form must be furnished; exemption provisions strictly construed; effect of proviso qualifies substantive clause.",
      "addresses_issue": "i1",
      "key_observation": "Furnishing declaration is mandatory condition precedent; 'on demand' in r.27A fixes time of production, not optional."
    },
    {
      "id": "cr2",
      "text": "s.21A does not enable ignoring statutory condition; rules prevent misuse but do not provide for duplicates for selling dealer.",
      "addresses_issue": "i1",
      "key_observation": "Hardship to honest dealer possible, but legislature to amend; stringency prevents fraud and collusion, aids administration."
    },
    {
      "id": "cr3",
      "text": "State of Orissa v. M.A. Tulloch distinguished as Orissa Act lacked similar proviso; rule there held directory to reconcile conflict.",
      "addresses_issue": "i1",
      "key_observation": "Proviso here makes all difference."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under s.5(2)(a)(ii), exemption subject to furnishing prescribed declaration form by selling dealer; mandatory condition, not directory.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Orissa v. M.A. Tulloch and Co. Ltd.",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Similar section but no proviso; rule held directory, unlike here where proviso imposes condition."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bengal Finance (Sales Tax) Act, 1941",
      "sections": [
        "s.5(2)(a)(ii)",
        "s.21A"
      ],
      "relevance": "s.5(2)(a)(ii) exempts sales to registered dealers subject to proviso requiring declaration; s.21A empowers summoning evidence but does not override condition."
    },
    {
      "name": "Bengal Sales Tax Rules, 1941",
      "sections": [
        "r.27A"
      ],
      "relevance": "'On demand' fixes time for producing declaration; sub-rules prevent misuse."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art.226"
      ],
      "relevance": "Basis for writ petition in High Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; court holds furnishing of declaration forms under s.5(2)(a)(ii) is mandatory condition for exemption; does not examine departmental lapses as construction of section resolves matter.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The only question, therefore, that arises is whether under s. 5(2)(a)(ii) of the Act the furnishing of the declaration forms issued by the purchasing dealers was a condition for claiming the exemption thereunder.",
      "speaker": "court",
      "significance": "Frames core legal issue."
    },
    {
      "text": "A dealer cannot get the exemption unless he furnishes the declaration in the prescribed form.",
      "speaker": "court",
      "significance": "Key holding on mandatory nature of proviso."
    },
    {
      "text": "We realise that the section and the rules as they stand may conceivably cause unmerited hardship to an honest dealer... But it is for the Legislature... to intervene to soften the rigour of the provisions.",
      "speaker": "court",
      "significance": "Acknowledges hardship but upholds strict construction."
    }
  ],
  "_case_id": "1965_275",
  "_label": 0,
  "_text_length": 12913,
  "_extracted_at": "2026-02-10T19:27:33.380872"
}