{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. Straw Products Ltd.",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeals Nos. 893 and 894 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent, Ms Straw Products Ltd., Bhopal, is a public limited company incorporated in the erstwhile State of Bhopal in 1939 and was given the certificate of commencement of business on May 30, 1939.",
      "type": "background",
      "date": "1939-05-30",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On September 20, 1938, the assessee entered into an agreement with the Government of Bhopal under which it obtained concessions including exclusive licence to manufacture cardboard articles, land on lease on favourable terms, and exemption from payment of customs and other duties.",
      "type": "background",
      "date": "1938-09-20",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Clause 8 of the agreement provided that during the period of 10 years from the date on which the Company takes over the land for its business purposes the Company shall not be liable to pay any sum by way of taxation to the State.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The agreement was acted upon and for a period of 10 years the assessee was not called upon to submit any returns of income and no assessment was made under the Bhopal Income Tax Act. This period expired on October 31, 1948.",
      "type": "admitted",
      "date": "1948-10-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On August 1, 1949, Bhopal merged in India and was formed into a Chief Commissioners Province.",
      "type": "background",
      "date": "1949-08-01",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "For the assessment year 1949-50, the assessee was assessed under the Indian Income Tax Act, 1922, on the total income of the period November 1, 1948 to December 12, 1948.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "For assessment years 1952-53 (previous year 1951) and 1953-54 (previous year 1952), the Income Tax Officer by orders dated November 27, 1952 and September 30, 1953 allowed depreciation on machinery, buildings and assets on the basis of original cost paid in 1939.",
      "type": "procedural",
      "date": "1952-11-27",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Noticing a report in Times of India dated March 15, 1957 on Bombay High Court judgment in Dhrangadhra Chemical Works Ltd., the ITO initiated action under s.34 of the Act for these two years.",
      "type": "procedural",
      "date": "1957-03-15",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "ITO by order dated March 4, 1958 held WDV as on 1-1-1951 to be redetermined: first WDV as on 1-11-1948 under Bhopal IT Act, deduct all depreciation actually allowed till 31-12-1950. Reduced depreciation for 1952-53 from Rs.2,71,961 to Rs.1,29,883 and for 1953-54 from Rs.2,87,285 to Rs.1,72,673.",
      "type": "procedural",
      "date": "1958-03-04",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Appellate Assistant Commissioner on appeal held no excess depreciation allowed in original assessment, no basis for s.34 proceedings, expression 'actually allowed' could not imply depreciation allowed by mental phenomenon.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellate Tribunal upheld AAC order and directed computation on that basis.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court by judgment dated August 22, 1961 answered question in favour of AAC: correct basis is one adopted by AAC.",
      "type": "procedural",
      "date": "1961-08-22",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "On August 20, 1962, Central Govt made Taxation Laws (Merged States) Removal of Difficulties (Amendment) Order, 1962 inserting Explanation to para 2 of 1949 Order deeming 'all depreciation actually allowed' to mean, in cases of exemption under agreement with Ruler, the depreciation that would have been allowed had income not been exempted.",
      "type": "background",
      "date": "1962-08-20",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts of the case and having regard to the provisions of paragraph 2 of the Taxation Laws (Merged States) Removal of Difficulties Order, 1949, and clause 8 of the Agreement made on 20th September, 1938, between the assessee and the State of Bhopal, the correct basis for computing the written down value of the depreciable assets as at 1-11-1948 is the one which is adopted by the Income Tax Officer or the one adopted by the Appellate Assistant Commissioner?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The expression 'all depreciation actually allowed under any laws or rules of a merged State' in para 2 of 1949 Order meant allowable under the provisions; if income exempted, assessee deemed to have claimed and been allowed depreciation according to those provisions to bring at par with others.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Paragraph 2, Taxation Laws (Merged States) Removal of Difficulties Order, 1949"
    },
    {
      "id": "pa2",
      "text": "Alternatively, 1962 Order retrospectively explains 'actually allowed' to mean depreciation that would have been allowed had income not exempted under agreement with Ruler.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Taxation Laws (Merged States) Removal of Difficulties (Amendment) Order, 1962"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Expression 'actually allowed' is unambiguous and connotes allowance actually given effect to; not deeming if not actually allowed.",
      "supporting_facts": [
        "f4",
        "f10"
      ],
      "legal_basis": "Paragraph 2, Taxation Laws (Merged States) Removal of Difficulties Order, 1949"
    },
    {
      "id": "ra2",
      "text": "1962 Order not to be considered as appeal by special leave from reference; ultra vires; does not apply as income not 'exempted from tax' but not liable due to agreement; not retrospective; question not of sufficient amplitude.",
      "supporting_facts": [
        "f3",
        "f12",
        "f13"
      ],
      "legal_basis": "Bhopal Income Tax Act, 1936; 1962 Order"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Agree with High Court that 'actually allowed' unambiguous, means actually given effect to; no artificial deeming without provision.",
      "addresses_issue": "i1",
      "key_observation": "If intended to include not actually allowed, deeming provision would be added as in s.10(5) Explanation."
    },
    {
      "id": "cr2",
      "text": "1962 Order can be considered per Bijli Cotton Mills as retrospective amendment applicable even post-reference if question wide enough and no fresh facts.",
      "addresses_issue": "i1",
      "key_observation": "Duty to apply amended law with retrospective operation."
    },
    {
      "id": "cr3",
      "text": "1962 Order not ultra vires per Venkataraman; applies as order amends IT Act for merged states; assessee covered as would have been liable but for agreement.",
      "addresses_issue": "i1",
      "key_observation": "Definition of assessee includes those liable but exempted by agreement."
    },
    {
      "id": "cr4",
      "text": "1962 Order retrospective by 'deemed always to have meant'; question wide enough including para 2 as amended.",
      "addresses_issue": "i1",
      "key_observation": "Applies to assessments 1952-53, 1953-54."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Correct basis for computing written down value of depreciable assets as on 1-11-1948 is the one adopted by Income Tax Officer.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dhrangadhra Chemical Works Ltd.",
      "citation": "Income Tax Reference No. 60 of 1956, judgment dated February 14, 1957 (Bombay High Court)",
      "treatment": "followed",
      "relevance": "Held WDV on opening day under Indian IT Act at actual cost less depreciation which would have been claimed under Indian IT Act 1922."
    },
    {
      "case_name": "Commissioner of Sales Tax, U.P. v. Bijli Cotton Mills, Hathras",
      "citation": "1964 7 S.C.R. 383; A.I.R. 1964 S.C. 1594",
      "treatment": "followed",
      "relevance": "Court must apply retrospectively amended law to reference if question of sufficient amplitude and no fresh facts."
    },
    {
      "case_name": "K.S. Venkataraman v. State of Madras",
      "citation": "1966 2 S.C.R. 229",
      "treatment": "followed",
      "relevance": "Challenges to validity of orders under removal of difficulties powers not entertainable in tax proceedings."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act, 1922",
      "sections": [
        "s.10(2)(c)",
        "s.10(5)(b)",
        "s.34",
        "s.66(1)"
      ],
      "relevance": "Basis for assessment, depreciation computation, reopening, reference."
    },
    {
      "name": "Bhopal Income Tax Act, 1936",
      "sections": [
        "Definition of assessee",
        "Charging section"
      ],
      "relevance": "No assessment due to agreement; would have allowed depreciation but for exemption."
    },
    {
      "name": "Taxation Laws (Merged States) Removal of Difficulties Order, 1949",
      "sections": [
        "Paragraph 2"
      ],
      "relevance": "Depreciation actually allowed under merged state laws to be taken into account for WDV."
    },
    {
      "name": "Taxation Laws (Merged States) Removal of Difficulties (Amendment) Order, 1962",
      "sections": [
        "Explanation to Paragraph 2"
      ],
      "relevance": "Deems 'actually allowed' in exemption cases to mean what would have been allowed absent exemption; retrospective."
    },
    {
      "name": "Taxation Laws (Extension to Merged States and Amendment) Act, 1949",
      "sections": [
        "s.3",
        "s.6",
        "s.34"
      ],
      "relevance": "Extended IT Act to merged states; power to remove difficulties."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeals allowed, judgment of Madhya Pradesh High Court dated August 22, 1961 set aside, question answered that correct basis for computing WDV as on 1-11-1948 is one adopted by Income Tax Officer.",
    "relief_granted": "Revenue's computation of depreciation upheld via 1962 Order.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the expression actually allowed is unambiguous and connotes the idea that the allowance was actually given effect to.\"",
      "speaker": "court",
      "significance": "Rejects deeming of unclaimed depreciation under plain meaning."
    },
    {
      "text": "\"For the purpose of this paragraph, expression all depreciation actually allowed under any laws or rules of a Merged State means and shall be deemed always to have meant... the depreciation that would have been allowed had the income not been so exempted.\"",
      "speaker": "court",
      "significance": "Key retrospective deeming provision applied to case."
    },
    {
      "text": "\"the correct basis for computing the written down value of the depreciable assets as on November 1, 1948, is the one which was adopted by the Income Tax Officer.\"",
      "speaker": "court",
      "significance": "Final answer to referred question."
    }
  ],
  "_case_id": "1965_85",
  "_label": 1,
  "_text_length": 19472,
  "_extracted_at": "2026-02-10T19:25:41.820760"
}