{
  "metadata": {
    "case_name": "Hindu Undivided Family v. Commissioner of Income-tax",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 308 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a Hindu undivided family and carries on business as a dealer in iron scrap and hardware.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Messrs Hoare Miller and Company Ltd. (the Company) were owners of a jute pressing factory installed on a piece of land belonging to the Company. Adjacent to that land were two pieces of land: one leasehold, and the other held by the Company as a licensee from the Government of West Bengal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On January 21, 1941 the Company leased out to one Ramnath Bajoria the jute pressing factory together with the machinery standing on the land owned by the Company for ten months commencing from January 10, 1941.",
      "type": "material",
      "date": "1941-01-21",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Ramnath Bajoria failed to vacate and deliver up possession of the premises demised to him after the expiry of the period of the lease, and the Company instituted a suit in ejectment against him.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "By an agreement dated October 31, 1942 the appellant agreed to purchase all the rights of the Company in the factory and the appurtenant premises for Rs. 2,45,000.",
      "type": "material",
      "date": "1942-10-31",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On November 14, 1942 the Company delivered to the appellant possession of the property agreed to be sold, save and except the factory demised under the lease to Ramnath Bajoria and the machinery included in the lease.",
      "type": "material",
      "date": "1942-11-14",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On February 26, 1943 the Company executed a conveyance in favour of the appellant conveying the factory and the appurtenant premises.",
      "type": "material",
      "date": "1943-02-26",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On June 12, 1943 the appellant agreed to sell to one Ranada Prasad Saha the property purchased from the Company for Rs. 4,73,364/3/6 free from all encumbrances.",
      "type": "material",
      "date": "1943-06-12",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On August 10, 1943 the appellant was substituted as a plaintiff in the suit filed by the Company against Ramnath Bajoria, and obtained possession of the factory premises.",
      "type": "material",
      "date": "1943-08-10",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "By a deed of conveyance dated September 30, 1943 the appellant conveyed to Ranada Prasad Saha the factory and the appurtenant premises and delivered possession thereof.",
      "type": "material",
      "date": "1943-09-30",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "In the deed of conveyance the property sold was described in three separate Schedules: Schedule I (Press House, office, residential buildings and three warehouses on land owned by the Company); Schedule II (leasehold land together with a warehouse known as Kalibari godown); Schedule III (two warehouses on land held as licensee by the Company from the Government of West Bengal).",
      "type": "material",
      "date": "1943-09-30",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The Income-tax Officer, District II, Calcutta, brought to tax in the hands of the appellant Rs. 2,24,864 being the profit arising out of the sale of the property to Ranada Prasad Saha.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The Income-tax Appellate Tribunal partially modified the order and reduced the total income by Rs. 7,000.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The Tribunal referred the question to the High Court: Whether on the facts and in the circumstances of the case, the Tribunal was right in holding that the surplus of Rs. 2,35,211 received by the assessee as a result of the sale of the jute press referred to in the Appellate order arose out of an adventure in the nature of trade and was therefore rightly assessed to tax?",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f15",
      "text": "The High Court answered the question in the affirmative on September 10, 1962.",
      "type": "procedural",
      "date": "1962-09-10",
      "source": "high_court"
    },
    {
      "id": "f16",
      "text": "At the material time, capital gains were not taxable.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The appellant was carrying on business in iron scrap and hardware and never carried on any business in jute or in pressing jute.",
      "type": "admitted",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f18",
      "text": "At the material time when the purchase of the Jute Press was made, the appellant had, because of abnormal conditions prevailing in the town of Calcutta, closed its business in iron scrap and hardware.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f19",
      "text": "The appellant purchased the jute press and the premises appurtenant thereto subject to litigation pending in the High Court, effected certain repairs and kept the factory in running condition, but made no attempt to start or organise the business of pressing jute.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f20",
      "text": "The appellant's plea that he was not able to secure labour for working the press was not true.",
      "type": "disputed",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f21",
      "text": "Soon after he bought the factory, the appellant received an offer from Ranada Prasad Saha to buy the factory and he immediately accepted the offer to sell it to him.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f22",
      "text": "The appellant had put the factory in a working condition, but had not organized a jute pressing business, had not obtained a licence for working the factory, had not attempted to secure orders for pressing jute, and had not employed labourers.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f23",
      "text": "In the deed of conveyance dated September 30, 1943 there is a reference to delivery of joists, girders, fabricated steel, C.I. roofs, bolts, nuts, hooks and ceiling planks, being portions of the materials of the godowns and structures standing on the land described in the third schedule.",
      "type": "material",
      "date": "1943-09-30",
      "source": "court"
    },
    {
      "id": "f24",
      "text": "After purchasing the factory and the appurtenant premises the appellant demolished certain godowns in Sch. III land and sold the material as scrap.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f25",
      "text": "Ranada Prasad Saha on coming to learn that the factory was for sale approached the Company after the sale deed was executed in favour of the appellant and he was informed that it had already been sold to the appellant. Thereafter Saha contacted the appellant and agreed to purchase the property.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f26",
      "text": "Absence of advertisement inviting offers for purchasing the property, and absence of brokers in the negotiations for sale between the appellant and Ranada Prasad Saha.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the surplus of Rs. 2,35,211 received by the assessee as a result of the sale of the jute press arose out of an adventure in the nature of trade and was therefore rightly assessed to tax under s. 10 of the Indian Income-tax Act, 1922.",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The transaction of purchase and sale of the factory and appurtenant premises was an isolated venture not related to the business of the appellant which was in iron scrap and hardware.",
      "supporting_facts": [
        "f1",
        "f17"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The appellant purchased the property with intention to use it, effected repairs, kept in running condition; inability to secure labour prevented starting business.",
      "supporting_facts": [
        "f19",
        "f20",
        "f22"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "After purchasing, demolished certain godowns and sold materials as scrap, similar to normal business.",
      "supporting_facts": [
        "f24"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Profit motive alone is not decisive; accretion to capital not taxable merely because acquired with expectation of profit.",
      "supporting_facts": [],
      "legal_basis": "s. 10 of the Indian Income-tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The appellant purchased the jute press subject to litigation with the sole object of reselling at profit at the earliest opportunity; soon after purchase received and accepted offer from Saha.",
      "supporting_facts": [
        "f5",
        "f8",
        "f21"
      ],
      "legal_basis": "s. 10 and s. 2(4) of the Indian Income-tax Act, 1922"
    },
    {
      "id": "ra2",
      "text": "Appellant's plea that he was not able to secure labour was not true; no attempt to start business.",
      "supporting_facts": [
        "f20",
        "f22"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The transaction was an isolated venture; purchase of land/capital asset like jute press cannot be assumed to be a venture in the nature of trade without more; profit motive not decisive.",
      "addresses_issue": "i1",
      "key_observation": "No evidence of intention to trade beyond expectation of profit; property capable of being used or let out."
    },
    {
      "id": "cr2",
      "text": "Appellant never carried on jute business; business closed due to conditions; no organization of business despite repairs; agreement to sell before obtaining possession of leased part.",
      "addresses_issue": "i1",
      "key_observation": "Sequence of events does not compel inference of trading intention."
    },
    {
      "id": "cr3",
      "text": "Demolition of godowns: No evidence how many originally; materials delivered as part of sale; cannot infer entire purchase for scrap.",
      "addresses_issue": "i1",
      "key_observation": "Not decisive of trading venture."
    },
    {
      "id": "cr4",
      "text": "No advertisement, no brokers; Saha approached after learning of sale; property not such that trading must be inferred.",
      "addresses_issue": "i1",
      "key_observation": "Circumstances lead to no positive inference of trade."
    },
    {
      "id": "cr5",
      "text": "Question whether profit arose from adventure in nature of trade is mixed question of law and fact; revenue to establish.",
      "addresses_issue": "i1",
      "key_observation": "Depends on collective effect of all relevant materials; no single fact decisive."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The transaction was not an adventure in the nature of trade; profit not taxable under s. 10 of the Indian Income-tax Act, 1922.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "G. Venkataswami Naidu & Co. v. Commissioner of Income-tax",
      "citation": "1959 Supp. 1 S.C.R. 640",
      "treatment": "followed",
      "relevance": "Expression 'adventure in the nature of trade' postulates elements investing character of trade; mixed question of law and fact."
    },
    {
      "case_name": "Saroj Kumar Mazumdar v. Commissioner of Income-tax, West Bengal",
      "citation": "37 I.T.R. 242",
      "treatment": "followed",
      "relevance": "Mixed question of law and fact; purchase of land under requisition and sale not trading venture."
    },
    {
      "case_name": "Martin v. Lowry",
      "citation": "11 T.C. 297",
      "treatment": "referred",
      "relevance": "Purchase of large quantity of aeroplane linen, subdivided and sold with trading organization indicates trading venture."
    },
    {
      "case_name": "Rutledge v. Commissioner of Inland Revenue",
      "citation": "14 T.C. 490",
      "treatment": "referred",
      "relevance": "Purchase and quick sale of vast quantity of toilet paper indicates trading."
    },
    {
      "case_name": "Commissioners of Inland Revenue v. Fraser",
      "citation": "24 T.C. 498",
      "treatment": "referred",
      "relevance": "Purchase and sale of large quantity of whisky without delivery indicates trading."
    },
    {
      "case_name": "Commissioners of Inland Revenue v. Reinhold",
      "citation": "34 T.C. 389",
      "treatment": "distinguished",
      "relevance": "Director purchasing houses for resale not trading."
    },
    {
      "case_name": "Leeming v. Jones",
      "citation": "15 T.C. 333",
      "treatment": "distinguished",
      "relevance": "Syndicate acquiring and selling estates not trading."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s. 10",
        "s. 2(4)",
        "s. 66(1)"
      ],
      "relevance": "Profits of business (including adventure in nature of trade) taxable under s.10; definition of business; reference to High Court."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "The appeal is allowed; the answer given by the High Court is discharged and a negative answer is recorded to the question whether the surplus arose from an adventure in the nature of trade.",
    "relief_granted": "Profit not taxable under s.10",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"It is for the revenue to establish that the profit earned in a transaction is within the taxing provision and is on that account liable to be taxed as income.\"",
      "speaker": "court",
      "significance": "Burden of proof on revenue."
    },
    {
      "text": "\"No single fact has decisive significance, and the question whether a transaction is an adventure in the nature of trade must depend upon the collective effect of all the relevant materials brought on the record.\"",
      "speaker": "court",
      "significance": "Holistic approach to determining trading nature."
    },
    {
      "text": "\"A profit motive in entering a transaction is not decisive, for, an accretion to capital does not become taxable income, merely because an asset was acquired in the expectation that it may be sold at profit.\"",
      "speaker": "court",
      "significance": "Profit expectation insufficient for taxability."
    }
  ],
  "_case_id": "1965_182",
  "_label": 1,
  "_text_length": 17274,
  "_extracted_at": "2026-02-10T19:26:31.367814"
}