{
  "metadata": {
    "case_name": "Bundelkhand Motor Transport Company v. Behari Lal Chaurasia",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 51 of 65",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In 1957 the Regional Transport Authority, Jabalpur granted to Messrs. Bundelkhand Motor Transport Company, Nowgaon (appellants) permit under the Motor Vehicles Act, 1939 to ply stage carriages on an inter-regional route-Jabalpur to Chhatarpur-in the State of Madhya Pradesh, and the permit was countersigned by the Regional Transport Authority, Rewa within whose jurisdiction a part of the route lay.",
      "type": "background",
      "date": "1957",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The permit was renewed in 1960 for a period of three years expiring on August 9, 1963 by the Regional Transport Authority, Jabalpur, and it was countersigned by the Regional Transport Authority, Rewa.",
      "type": "background",
      "date": "1960-08-09",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On June 7, 1963 the appellant applied to the Regional Transport Authority, Jabalpur for renewal of the permit.",
      "type": "procedural",
      "date": "1963-06-07",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "By order dated December 6, 1963 the permit was renewed for the period ending February 9, 1966 by the Regional Transport Authority, Jabalpur.",
      "type": "procedural",
      "date": "1963-12-06",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "By its application dated December 7, 1963 the appellant requested the Regional Transport Authority, Rewa to countersign the permit so renewed.",
      "type": "procedural",
      "date": "1963-12-07",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "This application was published as required by s. 57 read with s. 63(3) of the Act on January 2, 1964.",
      "type": "procedural",
      "date": "1964-01-02",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Three motor transport operators, amongst whom was the first respondent Behari Lal Chaurasia, objected to the grant of countersignature to the permit, inter alia, on the ground that the application was barred by the law of limitation prescribed by s. 58(2) proviso one.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "The Regional Transport Authority, Rewa overruled the objection, and by order dated March 17, 1964 granted countersignature of the permit.",
      "type": "procedural",
      "date": "1964-03-17",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The first respondent then applied to the High Court of Madhya Pradesh under Arts. 226/227 of the Constitution for a writ quashing the order dated March 17, 1964 passed by the Regional Transport Authority, Rewa.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f10",
      "text": "High Court of Madhya Pradesh by judgment and order dated November 11, 1964 quashed the order dated March 17, 1964 holding that application for renewal of countersignature was barred by s.58(2) and Rewa had no jurisdiction.",
      "type": "procedural",
      "date": "1964-11-11",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "With certificate granted by the High Court under Art. 133(1)(c) of the Constitution, the appellant appealed to this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "An application for countersignature of renewal of the permit was made to the Regional Transport Authority, Jabalpur, and it was rejected.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether an application for renewal of countersignature must be made not less than sixty days before the date of expiry of the permit as prescribed by s.58(2) of the Motor Vehicles Act, 1939, and whether Regional Transport Authority, Rewa had power to countersign after expiry.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Interpretation of rules 61, 62, 63 of the Central Provinces and Berar Motor Vehicles Rules, 1940 regarding renewal and countersignature of inter-regional permits.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "By s. 63(3) the provisions contained in Ch. IV relating to grant, revocation and suspension of permits are made applicable to grant of countersignatures of permits, and to the application for countersignature of an inter-regional permit the provisions relating to renewal contained in s. 58 have no application.",
      "supporting_facts": [
        "f1",
        "f2",
        "f4",
        "f5"
      ],
      "legal_basis": "Motor Vehicles Act, 1939 s.63(3)"
    },
    {
      "id": "pa2",
      "text": "State Government had no power to frame rule 63.",
      "supporting_facts": [],
      "legal_basis": "Motor Vehicles Act, 1939 s.68"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "A permit granted by an Authority competent under s. 45 of the Act is an integrated permit in respect of a unitary route, and until the permit is countersigned by the Authority in the other region, it is wholly ineffective.",
      "supporting_facts": [
        "f1",
        "f5",
        "f7"
      ],
      "legal_basis": "Motor Vehicles Act, 1939 s.45, s.58(2)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The provisions of Ch. IV relating to the grant, revocation and suspension of permits shall apply to the grant, revocation and suspension of countersignatures of permits as per s.63(3).",
      "addresses_issue": "i1",
      "key_observation": "Procedure for renewal assimilated to fresh permit but with timeline to avoid hiatus."
    },
    {
      "id": "cr2",
      "text": "By r.63(a), the authority by which a permit is renewed may renew any countersignature unless directed otherwise by the countersigning authority.",
      "addresses_issue": "i2",
      "key_observation": "RTA Jabalpur competent to countersign under r.63, and declined to do so."
    },
    {
      "id": "cr3",
      "text": "Even an inter-regional permit when granted is valid for the region over which the Authority granting the permit has jurisdiction, and when countersigned becomes valid for entire route.",
      "addresses_issue": "i1",
      "key_observation": "Permit renewed by Jabalpur only operative up to entry into Rewa region, as Jabalpur declined countersignature under r.63."
    },
    {
      "id": "cr4",
      "text": "One RTA not competent to sit in judgment over discretion of another RTA.",
      "addresses_issue": "i2",
      "key_observation": "Rewa's order granting countersignature invalid as it overrode Jabalpur's refusal."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rule 63 prevails over statutory direction in s.63, allowing issuing authority (Jabalpur) to countersign unless otherwise directed; Jabalpur's refusal means Rewa cannot override.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Permit granted/renewed by Jabalpur valid only for Jabalpur region portion, not inter-regional without countersignature.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Motor Vehicles Act, 1939",
      "sections": [
        "45",
        "47",
        "48",
        "57",
        "58",
        "63",
        "68"
      ],
      "relevance": "Governs grant, renewal, countersignature of inter-regional stage carriage permits; s.58(2) prescribes 60-day limit for renewal applications; s.63 requires countersignature for validity in other region; subject to rules under s.68."
    },
    {
      "name": "Central Provinces and Berar Motor Vehicles Rules, 1940",
      "sections": [
        "61",
        "62",
        "63"
      ],
      "relevance": "r.61: Renewal application timelines mirroring s.58; r.62: Countersignature renewal within r.61 periods; r.63: Issuing authority may renew countersignature unless directed otherwise."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "226",
        "227",
        "133(1)(c)"
      ],
      "relevance": "Basis for High Court writ petition and certificate for appeal to Supreme Court."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court confirmed the order of the High Court quashing the countersignature granted by Regional Transport Authority, Rewa on March 17, 1964, but for different reasons based on rules 61-63, holding that Jabalpur RTA's refusal to countersign under r.63 precluded Rewa from doing so; clarified that the permit remains valid for the Jabalpur region portion of the route.",
    "relief_granted": "Validity of permit for Jabalpur to point of entry into Rewa region preserved; Rewa countersignature quashed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The Regional Transport Authority, Jabalpur renewed the permit for the Jabalpur region, but declined to countersign the permit in exercise of the power conferred by r. 63...\"",
      "speaker": "court",
      "significance": "Explains why Rewa lacked power to countersign after Jabalpur's refusal."
    },
    {
      "text": "\"We therefore confirm the order of the High Court, but for different reasons.\"",
      "speaker": "court",
      "significance": "Affirms HC outcome on grounds of rules overriding statutory interpretation."
    },
    {
      "text": "\"our order does not affect the validity of the permit granted by the Regional Transport Authority, Jabalpur, insofar as it relates to the route between Jabalpur and the point of entry of the route into the Rewa region.\"",
      "speaker": "court",
      "significance": "Limits scope of quashing to Rewa portion only."
    }
  ],
  "_case_id": "1965_202",
  "_label": 0,
  "_text_length": 17429,
  "_extracted_at": "2026-02-10T19:27:02.212441"
}