{
  "metadata": {
    "case_name": "Petitioner v. Administrator, Union Territory of Delhi",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Writ Petition No. 43 of 1965",
    "date_of_judgment": "1965-05-18"
  },
  "facts": [
    {
      "id": "f1",
      "text": "District Magistrate, Delhi ordered detention of petitioner in Central Jail, New Delhi under Rule 30(1) of Defence of India Rules, 1962, dated September 5, 1964.",
      "type": "procedural",
      "date": "1964-09-05",
      "source": "respondent"
    },
    {
      "id": "f2",
      "text": "On September 11, 1964, District Magistrate informed petitioner that Administrator, Union Territory of Delhi reviewed and confirmed the detention order dated September 5, 1964.",
      "type": "procedural",
      "date": "1964-09-11",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Petitioner moved Supreme Court on April 12, 1965 for writ under Art. 32 setting aside detention and for release.",
      "type": "procedural",
      "date": "1965-04-12",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "District Magistrate's affidavit: Carefully considered materials, satisfied petitioner indulging in anti-social activities prejudicial to public order, necessary to detain; detention forthwith reported to Administrator; Administrator confirmed order; reviewed within six months on February 24, 1965 and decided to continue detention.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Petition directed to be heard during vacation on April 28, 1965; heard on May 18, 1965.",
      "type": "procedural",
      "date": "1965-05-18",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Petitioner filed rejoinder affidavit on May 18, 1965, argumentative without controverting facts.",
      "type": "procedural",
      "date": "1965-05-18",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Counsel for Delhi Administration showed original confirmation order by Administrator, which prima facie suffered from no defect.",
      "type": "procedural",
      "date": "1965-05-18",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Administrator's order dated February 24, 1965 reviewed detention order dated September 5, 1964 confirming detention and decided to continue.",
      "type": "procedural",
      "date": "1965-02-24",
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Administrator confirmed the detention order after taking into account all the circumstances of the case as required by Rule 30-A(6)(b) of Defence of India Rules, 1962.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the review of the detention order by the Administrator under Rule 30-A(8) is quasi-judicial requiring an opportunity to the detenu to make a representation.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether the Administrator reviewed the confirmation order instead of the detention order.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "District Magistrate made order for collateral purpose; no record of forthwith report to Administrator or proper review; detention after six months unauthorised without proper review under Rule 30-A(8).",
      "supporting_facts": [
        "f2",
        "f3"
      ],
      "legal_basis": "Rule 30(1), Rule 30-A(8) of Defence of India Rules, 1962"
    },
    {
      "id": "pa2",
      "text": "Administrator confirmed order without taking into account all circumstances; reviewed without affording opportunity to petitioner to show grounds no longer exist.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Rule 30-A(6)(b), Rule 30-A(8)"
    },
    {
      "id": "pa3",
      "text": "Review under Rule 30-A(8) is quasi-judicial; must afford opportunity to detenu to make representation; use of 'decide' implies lis and judicial approach.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Rule 30-A(8); principles of natural justice; Ridge v. Baldwin"
    },
    {
      "id": "pa4",
      "text": "Administrator reviewed confirmation order, not detention order.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Rule 30-A(8)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Carefully considered materials; satisfied of anti-social activities prejudicial to public order; necessary to detain; forthwith reported to Administrator; confirmed; reviewed on Feb 24, 1965 to continue; all procedural requirements complied.",
      "supporting_facts": [
        "f1",
        "f4",
        "f7",
        "f8"
      ],
      "legal_basis": "Rule 30(1), Rule 30-A(5), (6), (8)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Confirmation order shown prima facie valid, no defect; petitioner did not pursue further.",
      "addresses_issue": "i1",
      "key_observation": "Order of confirmation handed up and suffered from no defect."
    },
    {
      "id": "cr2",
      "text": "Detention under Rule 30(1) is executive act based on subjective satisfaction; not subject to judicial review on merits, only procedural compliance, mala fides etc.; review under Rule 30-A(8) also executive, not quasi-judicial; no duty to act judicially or afford hearing.",
      "addresses_issue": "i2",
      "key_observation": "Satisfaction upon review is executive determination, not subject to judicial review."
    },
    {
      "id": "cr3",
      "text": "No statutory safeguard for representation in review; writ of certiorari does not lie for administrative acts; distinguished Ridge v. Baldwin as not supporting broad proposition for all executive acts affecting rights.",
      "addresses_issue": "i2",
      "key_observation": "Duty to act judicially depends on statute scheme, not every order affecting rights."
    },
    {
      "id": "cr4",
      "text": "Word 'decide' in Rule 30-A(8) neutral, does not import judicial approach; review considers original circumstances, subsequent developments, representations if any, but executive.",
      "addresses_issue": "i2",
      "key_observation": "'Decision' can refer to executive acts."
    },
    {
      "id": "cr5",
      "text": "Review order refers to detention order dated Sept 5, 1964 confirmed; cannot divorce detention from confirmation; review is of confirmed detention order.",
      "addresses_issue": "i3",
      "key_observation": "Detention order confirmed has legal sustenance; review pursuant to that."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Confirmation of detention order under Rule 30-A(6)(b) valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Review under Rule 30-A(8) is executive, not quasi-judicial; no requirement to afford opportunity to detenu for representation.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Administrator reviewed the detention order as required.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Province of Bombay v. Kusaldas S. Advani",
      "citation": "1950 S.C.R. 621",
      "treatment": "followed",
      "relevance": "Writ of certiorari does not lie for administrative acts; word 'decision' neutral; no duty to act judicially unless statute requires."
    },
    {
      "case_name": "Ridge v. Baldwin",
      "citation": "L.R. 1964 A.C. 40",
      "treatment": "distinguished",
      "relevance": "Does not support broad proposition that all public authority orders affecting rights require natural justice; specific to statutory dismissal requiring it."
    },
    {
      "case_name": "Nakkuda Ali v. M.F. De S. Jayaratne",
      "citation": "1951 A.C. 66",
      "treatment": "followed",
      "relevance": "Controller cancelling licence not acting judicially despite affecting rights; depends on statute scheme."
    },
    {
      "case_name": "Rex v. Electricity Commissioners, Ex parte London Electricity Joint Committee Co.",
      "citation": "1924 1 K.B. 171",
      "treatment": "referred",
      "relevance": "Test for duty to act judicially for certiorari."
    },
    {
      "case_name": "Rex v. Legislative Committee of the Church Assembly, Ex parte Haynes-Smith",
      "citation": "1928 1 K.B. 411",
      "treatment": "referred",
      "relevance": "Criticized interpretation but affirmed need for duty to act judicially."
    }
  ],
  "statutes_cited": [
    {
      "name": "Defence of India Act, 1962",
      "sections": [
        "Section 3"
      ],
      "relevance": "Empowers Central Government to make rules for defence, public order etc."
    },
    {
      "name": "Defence of India Rules, 1962",
      "sections": [
        "Rule 30(1)",
        "Rule 30-A(2)",
        "Rule 30-A(5)",
        "Rule 30-A(6)(b)",
        "Rule 30-A(8)"
      ],
      "relevance": "Authorizes detention orders, reporting, confirmation, and review by Administrator; court held compliance and executive nature."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Basis for writ petition for enforcement of fundamental rights."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Court rejected all challenges to the detention order, confirmation, and review; upheld validity as executive acts with procedural compliance; no quasi-judicial requirement for review.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The subjective satisfaction of the detaining authority is a condition of the making of the order, and if that condition is shown to exist, the courts have no power to enquire into the sufficiency of materials on which the order is made.",
      "speaker": "court",
      "significance": "Defines scope of judicial review limited to procedure, not merits."
    },
    {
      "text": "If jurisdiction of the Court to enter upon a judicial review of the order of detention and its confirmation is excluded, it is difficult to appreciate the grounds on which it may legitimately be urged that the decision to continue detention upon review may still be regarded as subject to judicial review.",
      "speaker": "court",
      "significance": "Review under Rule 30-A(8) is executive like original order."
    },
    {
      "text": "The word decision in common parlance is more or less a neutral expression and it can be used with reference to purely executive acts as well as judicial orders.",
      "speaker": "court",
      "significance": "Rejects argument that 'decide' in Rule 30-A(8) implies quasi-judicial process."
    }
  ],
  "_case_id": "1965_324",
  "_label": 0,
  "_text_length": 26125,
  "_extracted_at": "2026-02-10T19:28:09.492994"
}