{
  "metadata": {
    "case_name": "Carona Sahu Co. Ltd. v. State of Bombay",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami, J."
    ],
    "case_number": "Civil Appeal No. 275 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant is a manufacturer of footwear in Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "During the assessment year April 1, 1954 to March 31, 1955, the appellant purchased rubber from certain dealers residing in the State of Cochin.",
      "type": "material",
      "date": "1954-04-01 to 1955-03-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "These purchases were assessed to purchase tax by the Sales Tax Officer under S.10(a) of the Bombay Sales Tax Act, 1953 as they were made from a person who is not a registered dealer.",
      "type": "procedural",
      "date": "1956-03-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Cochin sellers had their agents in Bombay who received orders on behalf of the appellant.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The orders of the appellant were accepted by the agents in Bombay and the goods were shipped by the sellers from Cochin to Bombay.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "After the goods were shipped, the demand drafts were forwarded along with the Bills of Lading by the vendors to their bankers in Bombay.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The bankers endorsed the bill of lading in Bombay and handed it over to purchasers in Bombay in exchange for the price. The price was also paid in Bombay.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "In the Bills of Lading the sellers in Cochin were described as both consignors and consignees.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "After the goods were shipped, an invoice was drawn on the appellant in which were printed the following words: 'Shipped per S.S from Cochin to Bombay on account and risk of Messrs Carona Sahu Co. Ltd., 15-A, Elphinstone Circle, Fort, Bombay.'",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The insurance charges were borne by the appellant who also paid freight and other charges.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "For the period April 1, 1954 to March 31, 1955, the appellant was assessed to purchase tax by the Sales Tax Officer, Licence Circle, Bombay by his assessment order dated March 31, 1956, under cl. (a) of s. 10 of the Act.",
      "type": "procedural",
      "date": "1956-03-31",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The appellant preferred an appeal under s. 30 of the Act to the Assistant Collector of Sales Tax, Appeals 11, Bombay Circle, Bombay but it was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "A revision application to the Additional Collector of Sales Tax was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The appellant thereafter moved the Sales Tax Appellate Tribunal at Bombay for revision of the order passed by the Additional Collector of Sales Tax. By its judgment dated September 4, 1959 the Bombay Sales Tax Tribunal dismissed the revision application and confirmed the order made by the Sales Tax authorities.",
      "type": "procedural",
      "date": "1959-09-04",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "At the instance of the appellant, the Sales Tax Tribunal referred the following questions of law for decision of the Bombay High Court under s. 34(1) of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "By its judgment dated April 23, 1962 the Bombay High Court answered both the questions of law in favour of the State and against the appellant.",
      "type": "procedural",
      "date": "1962-04-23",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and circumstances of the case, the property in the rubber consignments passed to the applicant in Cochin i.e. outside the State of Bombay?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether the purchase tax under s. 10(a) is leviable in respect of the purchases in dispute?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The property in the rubber consignments had passed to the appellant in Cochin.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": "Goods shipped on account and at the risk of the buyer"
    },
    {
      "id": "pa2",
      "text": "The term 'person' in s. 10(a) should be read as meaning a dealer who carries on business in Bombay but who is not registered under the Act.",
      "supporting_facts": [],
      "legal_basis": "S. 2(6) of the Bombay Sales Tax Act, 1953"
    },
    {
      "id": "pa3",
      "text": "The provisions of S. 10(a) cannot apply to transactions of purchase where the purchased goods have been brought from outside the State of Bombay for consumption in that State because s. 10-C of the Act would apply to such transactions.",
      "supporting_facts": [
        "f2",
        "f5"
      ],
      "legal_basis": "S. 10(a) and S. 10-C of the Bombay Sales Tax Act, 1953"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The property was intended by the parties to pass in Bombay and the endorsement in the invoice that the goods were being shipped on account of and at the risk of the buyers did not mean anything more than that the insurance charges were to be paid by the buyers.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6",
        "f7",
        "f8",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In the case of a contract for sale of unascertained goods the property does not pass to the purchaser unless there is unconditional appropriation, of the goods in a deliverable state to the contract. Delivery to common carrier vs. shipment under bill of lading: bill of lading to seller's order reserves right of disposal even with term shipped on account and risk of buyer.",
      "addresses_issue": "i1",
      "key_observation": "The bill of lading is the symbol of property, and by taking it to his own order the seller keeps the right of dealing with property shipped."
    },
    {
      "id": "cr2",
      "text": "The endorsement in the invoice merely indicated that the insurance charges were to be paid by the appellant and the clause has no bearing on the question of the passing of title.",
      "addresses_issue": "i1",
      "key_observation": "High Court rightly held that the property in the rubber consignment passed to the appellant in the State of Bombay."
    },
    {
      "id": "cr3",
      "text": "There is no reason for placing any limitation or qualification on the term 'person' which occurs in s. 10(a). The section plainly states that purchases made by a dealer from a person who is not a registered dealer will be subject to purchase tax.",
      "addresses_issue": "i2",
      "key_observation": "The appellant is a dealer and it has made the purchases in question from the sellers who are not registered dealers. The provisions of s. 10(a) of the Act are satisfied."
    },
    {
      "id": "cr4",
      "text": "S. 10-C reproduces the Explanation to Art. 286(1)(a) of the Constitution and applies where under general law the sale takes place outside the State but the goods are delivered as a direct result of the sale for consumption within the State. Scope of 10(a) and 10-C are different.",
      "addresses_issue": "i2",
      "key_observation": "S. 10(a) includes all purchases made from persons other than registered dealers."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The property in the rubber consignments passed to the appellant in the State of Bombay.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The purchase tax under s. 10(a) is leviable in respect of the purchases in dispute.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gabarron v. Kreeft",
      "citation": "1875 L.R. 10 Ex. 274",
      "treatment": "followed",
      "relevance": "Principle that appropriation would not pass property if no intention to pass it; seller taking bill of lading to own order reserves jus disponendi."
    },
    {
      "case_name": "Shepherd v. Harrison",
      "citation": "1871 L.R. 5 H.L. 116",
      "treatment": "followed",
      "relevance": "Goods shipped on account and risk of buyer but bill of lading to shipper's order; property does not pass until conditions fulfilled; entry on invoice not conclusive."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Sales Tax Act, 1953",
      "sections": [
        "S. 2(6)",
        "S. 2(11)",
        "S. 2(13)",
        "S. 6",
        "S. 10(a)",
        "S. 10-C",
        "S. 11",
        "S. 12-B",
        "S. 18-B",
        "S. 30",
        "S. 34(1)"
      ],
      "relevance": "Levy of purchase tax on purchases from non-registered dealers; definitions of dealer, registered dealer, sale; charging sections; reference to High Court."
    },
    {
      "name": "Indian Sale of Goods Act",
      "sections": [
        "S. 23",
        "S. 25"
      ],
      "relevance": "Passing of property in unascertained goods; seller may reserve right of disposal until conditions fulfilled; bill of lading to seller's order prima facie reserves right."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 286(1)(a)"
      ],
      "relevance": "Explanation reproduced in S.10-C for tax on goods brought from outside State for consumption."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal by special leave against the Bombay High Court judgment dated April 23, 1962, confirming the levy of purchase tax under S.10(a) on purchases of rubber from non-registered dealers in Cochin, holding that property passed in Bombay.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The bill of lading is the symbol of property, and by so taking the bill of lading the seller keeps to himself the right of dealing with property shipped and also the right of demanding possession from the captain.\"",
      "speaker": "court",
      "significance": "Explains why property does not pass despite shipment on account and risk of buyer."
    },
    {
      "text": "\"It is perfectly well settled that, in that state of things, the entry upon the invoice, stating that the goods are to be shipped on account and at the risk of the consignee, is not conclusive but may be overruled by the circumstance of the jus disponendi being reserved by the shipper through the medium of the bill of lading.\"",
      "speaker": "court",
      "significance": "From Shepherd v. Harrison, key to rejecting petitioner's argument on invoice endorsement."
    },
    {
      "text": "That section plainly states that purchases made by a dealer from a person who is not a registered dealer will be subject to purchase tax.",
      "speaker": "court",
      "significance": "Interprets plain meaning of 'person' in S.10(a)."
    }
  ],
  "_case_id": "1965_294",
  "_label": 0,
  "_text_length": 16986,
  "_extracted_at": "2026-02-10T19:28:20.478049"
}