{
  "metadata": {
    "case_name": "Appellant v. State",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Criminal Appeal No. 263 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant had quarrelled with Mangali, PW 1, as Mangali reprimanded him over the grazing of his cattle in Mangali's field and damaging his crops.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The appellant threatened Mangali that he would exterminate the latter's family.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On February 25, 1957 at about 3-00 p.m. Babu Ram son of Mangali, aged about 7 or 8 years, Ram Ratia, aged about 2 years, daughter of Mangali's brother and Punna, son of Baijnath, brother of Mangali and Dulli, daughter of one Ladda Kewat, aged about 10 or 11 years and some other children were playing in the village near the hut of Hiralal, P.W. 3.",
      "type": "material",
      "date": "1957-02-25",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The appellant came there armed with a sickle and rushed at the children. He first struck a blow on Babu Ram, who fled away and started crying.",
      "type": "material",
      "date": "1957-02-25",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Mangali's one year old daughter Lachhminia was also there at that time and the appellant ripped open that child's chest with the sickle as a result of which she died almost immediately.",
      "type": "material",
      "date": "1957-02-25",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant then struck blows on Ram Ratia and also on Punna.",
      "type": "material",
      "date": "1957-02-25",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Hiralal, the brother of the appellant who was sleeping in his hut was awakened by the cries of children and rushed out to save them. Thereupon the appellant struck a blow on Hiralal as well.",
      "type": "material",
      "date": "1957-02-25",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Hearing the cries of children a number of villagers rushed to the spot but the appellant escaped from their clutches by running towards the river Ganges which is at a distance of about 75 paces from the place of the incident, jumped into the water and swam to the other shore and absconded.",
      "type": "material",
      "date": "1957-02-25",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On October 11, 1957 proceedings under ss. 87 and 88 of the Code of Criminal Procedure were started against him and he was eventually proceeded against as an absconder.",
      "type": "procedural",
      "date": "1957-10-11",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "It was only on February 1, 1963 that he was arrested and thereafter sent up for trial.",
      "type": "procedural",
      "date": "1963-02-01",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "At that trial he was convicted and sentenced for offences under ss. 302, 307 and 324, Indian Penal Code, with sentence of death for s.302.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Allahabad High Court affirmed the conviction and sentences by judgment dated July 2, 1964 in Criminal Appeal No. 356 of 1964 and Ref. No. 15 of 1964.",
      "type": "procedural",
      "date": "1964-07-02",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "In his examination under s. 342 of the Code of Criminal Procedure the appellant did not plead the defence of insanity.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Dulli, P.W. 6, and Hiralal P.W. 3 referred to the appellant as pagalwa and Dulli stated that the appellant was insane when he attacked the children.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Up to the time of occurrence the appellant had been doing his cultivation. There is no evidence to prove the characteristic of his habit from which it could be concluded that he was acting like an insane man.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Few months before the occurrence the accused admittedly picked up quarrel with Mangali and Bhaiya Lal and had given threat to make their family extinct.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "On the date of occurrence many children were playing including her own cousin sister. But first of all he gave a sickle blow only to Babu Ram and other children of the family of Mangali and Bhaiya Lal and not to any other children.",
      "type": "material",
      "date": "1957-02-25",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "He beat Hira Lal only when he tried to stop the act of beating of the children of Mangali and Bhaiya Lal's family with whom he had picked up quarrel previously.",
      "type": "material",
      "date": "1957-02-25",
      "source": "lower_court"
    },
    {
      "id": "f19",
      "text": "A sense of fear prevailed in him and that is why he acted like a sane man by running and then escaping by jumping into the Ganges river.",
      "type": "material",
      "date": "1957-02-25",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant was a person of unsound mind and was not in a position to know or realise the nature of the acts which he was committing, so as to bring the case within s.84 IPC and negate mens rea for offences under ss.302, 307 and 324 IPC.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Mens rea being an essential ingredient of all the offences with which the appellant was charged his conviction cannot be sustained as no intention to cause death or to cause any injury could possibly be attributed to a person who was insane when he committed the acts.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Section 84 IPC; Dahyabhai Chhaganbhai Thakkar v. State of Gujarat"
    },
    {
      "id": "pa2",
      "text": "No man in his senses will go on attacking children indiscriminately and go to the length of ripping open the chest of one year old child.",
      "supporting_facts": [
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Evidence on record from statements of Dulli PW6 and Hiralal PW3 referring to appellant as pagalwa and stating he was insane.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "Sessions Judge's observations indicate doubt about sanity, benefit of doubt must be given.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The burden of proving the existence of circumstances bringing the case within s.84 IPC lies upon the accused under s.105 Evidence Act. Prosecution must prove mens rea, which is inferred from circumstances like deliberately striking with deadly weapon.",
      "addresses_issue": "i1",
      "key_observation": "Everyone is presumed to know the natural consequences of his act and the law."
    },
    {
      "id": "cr2",
      "text": "Dahyabhai case does not shift burden; prosecution proves mens rea, presumption of sanity arises, accused must rebut.",
      "addresses_issue": "i1",
      "key_observation": "If prosecution evidence raises reasonable doubt on mens rea, accused acquitted, but here no such doubt."
    },
    {
      "id": "cr3",
      "text": "Indiscriminate attack on children shows brutality, not unsound mind. References to pagalwa by interested witnesses Hiralal (brother) and Dulli (family) unreliable, first time in cross-examination, witnesses turned hostile.",
      "addresses_issue": "i1",
      "key_observation": "Sessions Judge disbelieved evidence suggesting unsound mind."
    },
    {
      "id": "cr4",
      "text": "Sessions Judge's observation on burden not indicating doubt but emphasizing accused must prove insanity, not merely create doubt.",
      "addresses_issue": "i1",
      "key_observation": "Appellant's pre-incident conduct (quarrel, threat), selective attack on Mangali's family children, escape showing fear, all indicate sanity and motive."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The case of the appellant does not fall under the exception created by s.84 of the Indian Penal Code.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dahyabhai Chhaganbhai Thakkar v. State of Gujarat",
      "citation": "1964 7 S.C.R. 361",
      "treatment": "followed",
      "relevance": "Clarifies burden of proof on insanity plea: prosecution proves mens rea, accused rebuts presumption of sanity."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "302",
        "307",
        "324",
        "84"
      ],
      "relevance": "Offences convicted under 302,307,324; s.84 exception for unsound mind rejected."
    },
    {
      "name": "Indian Evidence Act, 1872",
      "sections": [
        "105"
      ],
      "relevance": "Burden on accused to prove exception like insanity."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "87",
        "88",
        "342"
      ],
      "relevance": "Proceedings against absconder; examination of accused."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal, affirmed the Allahabad High Court's judgment upholding conviction under ss.302,307,324 IPC and death sentence for s.302.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Nothing is an offence which is done by a person who, at the time of doing it, by reason of unsoundness of mind, is incapable of knowing the nature of the act, or that he is doing what is either wrong or contrary to law.\"",
      "speaker": "court",
      "significance": "Quotes s.84 IPC, central to insanity defence."
    },
    {
      "text": "The prosecution must prove beyond reasonable doubt that the accused had committed the offence with the requisite mens rea and the burden of proving that always rests on the prosecution from the beginning to the end of the trial.",
      "speaker": "court",
      "significance": "Explains burden from Dahyabhai, key to rejecting shifted burden argument."
    },
    {
      "text": "\"all these circumstances lead to one conclusion that he was not insane and had acted like a sane man and with some motive.\"",
      "speaker": "court",
      "significance": "Court agrees with Sessions Judge on sanity based on conduct."
    }
  ],
  "_case_id": "1965_6",
  "_label": 0,
  "_text_length": 15061,
  "_extracted_at": "2026-02-10T19:24:19.773787"
}