{
  "metadata": {
    "case_name": "Salem Erode Electricity Distribution Co., Ltd. v. Employees",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, C.J."
    ],
    "case_number": "C.A. No. 305 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant is a licensee under the Indian Electricity Act, 1910, buying electrical energy in bulk from the State Electricity Board of Madras and selling it to consumers in Salem and Erode and certain rural districts.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant has an industrial establishment at Salem.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In or about 1940, when the number of appellant's consumers was about 3,000 and workmen about 45, appellant framed terms and conditions of employment including leave and holidays.",
      "type": "background",
      "date": "1940",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After Industrial Employment (Standing Orders) Act, 1946 came into force, provisions as to leave and holidays were embodied in appellant's Standing Orders certified in or about 1947.",
      "type": "background",
      "date": "1947",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Standing Order 5(b): The number of holidays to be granted to the workmen and the days which shall be observed as holidays by the Establishment shall be regulated in accordance with the Factories Act, 1948 or other relevant law for the time being in force and the custom or usage of the Establishment, viz., holidays under the Negotiable Instruments Act, 1881 and festival holidays peculiar to this locality which are being given.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Standing Order 10(a): Leave will be given in accordance with the law and existing practice provided the leave facilities now available to the workers are not curtailed in any manner.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant applied on 6th October, 1960, before the Certifying Officer, Madras, for amendment of certified Standing Orders 5(b) and 10(a).",
      "type": "procedural",
      "date": "1960-10-06",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Proposed amendment to Standing Order 5(b): For all workmen who have joined service prior to [date] holidays under the Negotiable Instruments Act, 1881, and festival holidays of one day per year which day may be chosen by the workmen shall be given. For all workmen who have joined on and after [date] holidays under the Madras Industrial Establishments (National and Festival holidays) Act, 1958 shall be given.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Proposed amendment to Standing Order 10(a): Leave will be given to all employees who are appointed on and after [date] in accordance with the provisions of the Madras Shops and Establishments Act, 1947 or any statutory modification thereof irrespective of whether this Act applies or not to any category of employee or employees. Provided, however, that for all employees who have been confirmed prior to the above said date, viz the leave facilities now available are not curtailed in any manner.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Appellant believed urgent need for increased production and supply of electrical energy could be met by modifying Standing Orders 5(b) and 10(a).",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Appellant introduced revised rules on 1st October, 1960, embodied in contracts of new entrants who joined from that date and agreed to them.",
      "type": "material",
      "date": "1960-10-01",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Application made to regularise steps taken for new entrants.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Respondents' Union resisted proposed changes as unfair, unreasonable, introducing discrimination between employees, causing industrial unrest and disharmony.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Certifying Officer upheld respondents' pleas and negatived proposed amendments.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Appellant appealed to Labour Court, Coimbatore, in C.S.O. Appeal No. 1 of 1962.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "Labour Court agreed with Certifying Officer and dismissed appeal on 9th April, 1963.",
      "type": "procedural",
      "date": "1963-04-09",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Appellant came to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether it is permissible under the Industrial Employment (Standing Orders) Act, 1946 for an industrial establishment to have two sets of Standing Orders to govern the relevant terms and conditions of its employees, one for existing employees and one for future entrants.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The change in Standing Orders 5(b) and 10(a) is fair and reasonable on merits.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Appellant showed bona fides by applying changes only to future entrants without affecting existing employees' rights.",
      "supporting_facts": [
        "f8",
        "f9",
        "f11"
      ],
      "legal_basis": "Industrial Employment (Standing Orders) Act, 1946"
    },
    {
      "id": "pa3",
      "text": "Certifying Officer and appellate authority erred in law in not certifying the changed Standing Orders.",
      "supporting_facts": [
        "f14",
        "f16"
      ],
      "legal_basis": "Industrial Employment (Standing Orders) Act, 1946"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Proposed change is unfair and unreasonable.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Proposed change introduces discrimination between one set of employees and another working under the same employer.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Proposed change would cause industrial unrest and disharmony.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Main object of the Act is to require employers to define formally terms and conditions of employment, known to employees before acceptance, introducing uniformity for workmen in same category doing same/similar work.",
      "addresses_issue": "i1",
      "key_observation": "Act intends uniformity of terms and conditions."
    },
    {
      "id": "cr2",
      "text": "Standing Orders must cover matters in Schedule, certified uniformly applicable to all workmen; no scope for two sets as matters like classification, holidays, leave etc. require uniformity.",
      "addresses_issue": "i1",
      "key_observation": "Two sets would lead to confusion, dissatisfaction, anomalous results over time."
    },
    {
      "id": "cr3",
      "text": "Act provides self-contained code: certification considers fairness/reasonableness (post-1956), appeals, modification by employer/workmen, interpretation via s.13A.",
      "addresses_issue": "i1",
      "key_observation": "No need for dual Standing Orders."
    },
    {
      "id": "cr4",
      "text": "Distinguished precedents: Rai Bahadur Diwan Badri Das (industrial dispute, not Standing Orders Act); Associated Cement (wages/hours/holidays comprehensively); Guest Keen Williams (prior employees' rights in dispute).",
      "addresses_issue": "i1",
      "key_observation": "Present case under Standing Orders Act scheme."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "It is not permissible under the scheme of the Industrial Employment (Standing Orders) Act, 1946 to certify two different sets of Standing Orders in regard to any of the matters covered by the Schedule.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rai Bahadur Diwan Badri Das v. The Industrial Tribunal, Punjab",
      "citation": "1963 3 S.C.R. 930",
      "treatment": "distinguished",
      "relevance": "Dealt with industrial dispute under Industrial Disputes Act, not Standing Orders Act; no general principle allowing dual terms."
    },
    {
      "case_name": "Associated Cement Staff Union and Another v. Associated Cement Company and Others",
      "citation": "1963 3 S.C.R. 348 / 1964 1 L.L.J. 12",
      "treatment": "distinguished",
      "relevance": "Industrial adjudication on wages, hours, holidays comprehensively; not applicable to certifying dual Standing Orders."
    },
    {
      "case_name": "Guest, Keen, Williams Private Ltd. v. P. J. Sterling and Others",
      "citation": "1960 1 S.C.R. 348",
      "treatment": "distinguished",
      "relevance": "Certified Standing Order's effect on prior employees in industrial dispute; did not consider dual Standing Orders."
    }
  ],
  "statutes_cited": [
    {
      "name": "Industrial Employment (Standing Orders) Act, 1946",
      "sections": [
        "s.2(g)",
        "s.3",
        "s.4",
        "s.5",
        "s.6",
        "s.7",
        "s.10(2)",
        "s.13A",
        "s.15",
        "Schedule"
      ],
      "relevance": "Governs certification, modification, uniformity of Standing Orders; fairness/reasonableness post-1956 amendment."
    },
    {
      "name": "Indian Electricity Act, 1910",
      "sections": [],
      "relevance": "Appellant is licensee thereunder."
    },
    {
      "name": "Factories Act, 1948",
      "sections": [
        "s.79"
      ],
      "relevance": "Regulates holidays/leave in original Standing Order."
    },
    {
      "name": "Negotiable Instruments Act, 1881",
      "sections": [],
      "relevance": "Holidays thereunder in original Standing Order."
    },
    {
      "name": "Madras Industrial Establishments (National and Festival Holidays) Act, 1958",
      "sections": [],
      "relevance": "Proposed for new entrants' holidays."
    },
    {
      "name": "Madras Shops and Establishments Act, 1947",
      "sections": [],
      "relevance": "Proposed for new entrants' leave."
    },
    {
      "name": "Industrial Disputes Act, 1947",
      "sections": [
        "s.10(1)"
      ],
      "relevance": "Mentioned for potential disputes post-Standing Orders."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, holding that under the Industrial Employment (Standing Orders) Act, 1946, it is not permissible to certify two sets of Standing Orders for existing and new employees, upholding the Certifying Officer and Labour Court orders refusing amendment.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "Prima facie, this argument appears to be attractive but if we examine the scheme of the relevant Provisions of the Act in the light of the matters specified in the schedule in respect of which Standing Orders are required to be made, it appears that two sets of Standing Orders cannot be made under the Act.",
      "speaker": "court",
      "significance": "Rejects petitioner's core argument on dual Standing Orders."
    },
    {
      "text": "On principle, it seems expedient and desirable that matters specified in the Schedule to the Act should be covered by uniform Standing Orders applicable to all workmen employed in an industrial establishment.",
      "speaker": "court",
      "significance": "Articulates the key principle of uniformity."
    },
    {
      "text": "The result, therefore, appears to be that in regard to the certification of the Standing Orders, the Act provides for a self-contained Code.",
      "speaker": "court",
      "significance": "Explains comprehensive nature of the Act."
    }
  ],
  "_case_id": "1965_290",
  "_label": 0,
  "_text_length": 30214,
  "_extracted_at": "2026-02-10T19:28:08.728306"
}