{
  "metadata": {
    "case_name": "Bahrein Petroleum Co. Ltd. v. Plaintiff",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Bachawat, J."
    ],
    "case_number": "Civil Appeal No. 432 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The plaintiff was a typist clerk in the employ of the second defendant, the Bahrein Petroleum Co. Ltd.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The first defendant was the recruiting agent of the Company at Bombay.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The contract of service was signed at Bombay.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The zone of operation under the contract of service was Bahrein Island outside India.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The plaintiff instituted a suit for recovery of gratuity and arrears of salary against the Company and its recruiting agent in the Court of the Subordinate Judge of Cochin.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Both defendants applied to the Cochin Court for stay of the suit under s. 34 of the Indian Arbitration Act, 1940.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Cochin Court refused to stay the suit.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "An appeal from this order to the District Court of Ernakulam was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "A revision petition to the High Court was dismissed in limine.",
      "type": "procedural",
      "date": "1964-10-19",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "In the meantime, the Cochin Court passed an order declaring that the suit should proceed ex parte.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On an application by the defendants, this order was set aside, and the defendants were allowed to file their written statement.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "In their written statement, the defendants pleaded on the merits and also disputed the territorial jurisdiction of the Cochin Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On the application of the defendants, the Cochin Court tried the preliminary issue as to jurisdiction.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The Cochin Court held that it had no territorial jurisdiction to try the suit, and directed the return of the plaint for presentation to the proper Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f15",
      "text": "An appeal to the District Judge of Ernakulam was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "On revision, the High Court of Kerala held that the defendants had waived the objection as to the territorial jurisdiction of the trial Court, set aside the orders of the lower Courts, and directed the Cochin Court to try the suit on the merits.",
      "type": "procedural",
      "date": "1964-10-19",
      "source": "court"
    },
    {
      "id": "f17",
      "text": "The second defendant appeals to this Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f18",
      "text": "The defendants neither resided nor carried on business, nor did any part of the cause of action arise within the local limits of the jurisdiction of the Cochin Court.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Cochin Court had territorial jurisdiction under s. 20 of the Code of Civil Procedure, 1908, and whether the defendants waived the objection to territorial jurisdiction.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The defendants did not waive the objection to territorial jurisdiction; they protested at the earliest opportunity in the stay application under s. 34 Arbitration Act, persisted throughout, and filing written statement after permission does not constitute waiver.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8",
        "f9",
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": "s. 21 Code of Civil Procedure, 1908; Seth Hira Lal Patni v. Sri Kali Nath"
    },
    {
      "id": "pa2",
      "text": "Filing application under s. 34 Arbitration Act and appeal under s. 39 does not concede jurisdiction, as application must be made to the court where suit is pending regardless of jurisdiction.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "ss. 2(c), 34, 39 Indian Arbitration Act, 1940"
    },
    {
      "id": "pa3",
      "text": "No failure of justice condition under s. 21 CPC applies yet, as suit not tried on merits.",
      "supporting_facts": [
        "f14",
        "f15",
        "f16"
      ],
      "legal_basis": "s. 21 Code of Civil Procedure, 1908; Kiran Singh v. Chaman Paswan"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "It was open to the defendants to waive the objection to place of suing, and they did so by their conduct.",
      "supporting_facts": [
        "f11",
        "f12"
      ],
      "legal_basis": "s. 21 Code of Civil Procedure, 1908"
    },
    {
      "id": "ra2",
      "text": "By filing appeal under s. 39 Arbitration Act against refusal of stay, defendants conceded that Cochin Court had jurisdiction.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8"
      ],
      "legal_basis": "ss. 2(c), 34, 39 Indian Arbitration Act, 1940"
    },
    {
      "id": "ra3",
      "text": "Defendants having neither alleged nor proved failure of justice, precluded by s. 21 CPC from raising objection.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "s. 21 Code of Civil Procedure, 1908"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "As a general rule, consent or waiver cannot confer jurisdiction upon a Court otherwise incompetent, but s. 21 CPC provides exception for defect as to place of suing under ss. 15-20, which may be waived.",
      "addresses_issue": "i1",
      "key_observation": "Waiver under s. 21 limited to objections in appellate/revisional courts; independently, defendant may waive."
    },
    {
      "id": "cr2",
      "text": "Defendants' conduct does not amount to waiver: applied for stay at earliest, protested jurisdiction in petition, fought up to higher courts, filed WS only after permission while objecting to jurisdiction throughout.",
      "addresses_issue": "i1",
      "key_observation": "No conduct waiving or abandoning objection."
    },
    {
      "id": "cr3",
      "text": "Filing s.34 application and s.39 appeal does not concede jurisdiction; application under s.34 must be to court where suit pending, irrespective of its jurisdiction to try merits.",
      "addresses_issue": "i1",
      "key_observation": "s.2(c) definition not imported into s.34 for this purpose."
    },
    {
      "id": "cr4",
      "text": "No failure of justice yet, as suit not tried on merits; s.21 condition implies trial on merits already done when objection raised in appellate court.",
      "addresses_issue": "i1",
      "key_observation": "Policy of ss.21,99 CPC and s.11 Suits Valuation Act treats territorial objections as technical unless prejudice on merits."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The defendants did not waive their objection as to the territorial jurisdiction of the Cochin Court; Cochin Court had no territorial jurisdiction under s.20 CPC.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Seth Hira Lal Patni v. Sri Kali Nath",
      "citation": "1962 2 S.C.R. 747, 751-752",
      "treatment": "followed",
      "relevance": "Defendant may waive objection to place of suing independently of s.21 CPC and be precluded subsequently."
    },
    {
      "case_name": "Kiran Singh and others v. Chaman Paswan and others",
      "citation": "1955 1 S.C.R. 117, 122",
      "treatment": "followed",
      "relevance": "Explains policy of ss.21,99 CPC: territorial objections technical, not open unless failure of justice after trial on merits."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Civil Procedure, 1908",
      "sections": [
        "s. 15",
        "s. 20",
        "s. 21"
      ],
      "relevance": "Territorial jurisdiction under s.20; objection to place of suing waivable under s.21 unless failure of justice."
    },
    {
      "name": "Indian Arbitration Act, 1940",
      "sections": [
        "s. 2(c)",
        "s. 34",
        "s. 39"
      ],
      "relevance": "Stay application under s.34 to court where suit pending; appeal under s.39; does not concede jurisdiction."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; judgment of Kerala High Court set aside; orders of trial court (Cochin Court) and District Court restored, holding no waiver of territorial jurisdiction objection and Cochin Court lacks jurisdiction.",
    "relief_granted": "Restoration of orders directing return of plaint for presentation to proper court",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "As a general rule, neither consent nor waiver nor acquiescence can confer jurisdiction upon a Court, otherwise incompetent to try the suit. But s. 21 of the Code provides an exception...",
      "speaker": "court",
      "significance": "Distinguishes general rule from statutory exception for place of suing."
    },
    {
      "text": "The policy underlying sections 21 and 99 of the Civil Procedure Code... is... that when a case had been tried by a Court on the merits and judgment rendered, it should not be liable to be reversed purely on technical grounds, unless it had resulted in a failure of justice...",
      "speaker": "court",
      "significance": "Core policy on treating jurisdiction objections as technical post-merits trial."
    }
  ],
  "_case_id": "1965_279",
  "_label": 1,
  "_text_length": 9253,
  "_extracted_at": "2026-02-10T19:28:06.112292"
}