{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. E. Francescanto",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "One S. P. Gallini was doing business in art-silk in the name and style of Rayon Yarns Import Company.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Under an agreement dated May 30, 1948, Gallini appointed E. Francescanto, the respondent (assessee), as his manager.",
      "type": "material",
      "date": "1948-05-30",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Paragraph 9(b) of the agreement: If services not discontinued on or before 31st January, 1949, entitled to commission 1/2 (half of one per cent.) upon the value of all sales resulted on or after 1st June, 1948, and up to 31st January, 1949, except direct sales.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "For assessment year 1949-50, Gallini claimed deduction of Rs. 2,45,557 commission paid to respondent from his taxable income.",
      "type": "procedural",
      "date": "1949-50",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Income-tax Officer rejected Gallini's claim, holding payment of commission was a way to reduce income and tax liability; profits divided between employer and employee to evade tax; included amount in Gallini's taxable income.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "After assessing amount in Gallini's hands for AY 1949-50, department sought to assess same income in hands of assessee as commission received.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Assessee claimed exemption on basis of Notification No. 878F dated March 21, 1922, as amended by Notification No. 8 dated March 24, 1928.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Income-tax Officer rejected assessee's exemption claim.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "On appeal, Appellate Assistant Commissioner agreed with Income-tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "On further appeal, Appellate Tribunal, Bombay held conditions of notification fulfilled; assessee entitled to exemption.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "At instance of revenue, question referred to High Court of Bombay under section 66(1) of Indian Income-tax Act, 1922: Whether, on facts and circumstances, commission of Rs. 2,45,557 exempt in hands of assessee by virtue of Notification No. 878F dated March 21,1922, as amended.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "High Court agreed with Tribunal, answered question in affirmative.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Revenue preferred appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Income-tax Officer added commission of Rs. 2,45,557 to profits disclosed by employer, assessed total Rs. 7,74,454; found commission paid out of profits to evade tax.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Nature of Gallini's business: trading assets are forward contracts with foreign contractors, transferred to local merchants at profit of 2 to 5%; hardly required capital investment.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether, on the facts and in the circumstances of the case, the commission of Rs. 2,45,557 was exempt in the hands of the assessee by virtue of the Notification No. 878F dated March 21,1922, as amended by Notification No. 8 dated March 24, 1928?",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Assessee had to fulfill conditions laid down in notification to qualify for exemption; he had not fulfilled any one of them.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": "Notification No. 878F dated March 21,1922, as amended"
    },
    {
      "id": "pa2",
      "text": "Under agreement, commission was first charge before profits arrived at, calculated on turnover, not out of profits.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Employer assessed on same income not assessed in employee's hands, as division of profits sham; income continued to be employer's; revenue cannot assess again as it never became assessee's income.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "In any event, assessee entitled to exemption under notification as conditions fully complied with.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": "Notification No. 878F dated March 21,1922, as amended"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "First argument of respondent not available: proceedings assumed commission was assessee's income but exempt under notification; question referred only on exemption; cannot raise new point that it was not his income.",
      "addresses_issue": "i1",
      "key_observation": "Question not referred on whether income of assessee."
    },
    {
      "id": "cr2",
      "text": "Notification exempts commission if three cumulative conditions satisfied: (i) paid out of or determined with reference to profits of business; (ii) not allowed as deduction but included in profits; (iii) income-tax assessed and charged on profits including such income under head 'business'. Object: prevent double taxation.",
      "addresses_issue": "i1",
      "key_observation": "All three conditions cumulative."
    },
    {
      "id": "cr3",
      "text": "Third condition satisfied: commission disallowed in Gallini's assessment, included and assessed under business head.",
      "addresses_issue": "i1",
      "key_observation": "Admitted."
    },
    {
      "id": "cr4",
      "text": "First condition: Agreement prima facie on turnover, not profits. High Court reasoning flawed: incomings not entirely profits; capital and overheads exist. But in fact, commission paid out of profits: ITO finding (added to profits, assessed total Rs. 7,74,454) accepted by Tribunal; no reason to disturb.",
      "addresses_issue": "i1",
      "key_observation": "Factually paid out of profits despite agreement."
    },
    {
      "id": "cr5",
      "text": "Second condition satisfied: employer claimed deduction but disallowed by ITO, included in profits and assessed.",
      "addresses_issue": "i1",
      "key_observation": "Not allowed as deduction."
    },
    {
      "id": "cr6",
      "text": "All three conditions complied with; assessee entitled to exemption.",
      "addresses_issue": "i1",
      "key_observation": "Agree with High Court though on different grounds."
    },
    {
      "id": "cr7",
      "text": "Precedents: Each case fact-specific; whether paid out of profits depends on facts. Balakrishnan directly in point.",
      "addresses_issue": "i1",
      "key_observation": "No universal principle."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Commission exempt under notification as all three conditions satisfied.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "M. K. Kirtikar v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Commission computed as % of turnover, not out of profits."
    },
    {
      "case_name": "Commissioner of Income-tax v. Mulraj Karsondas",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Salary deducted before profits; not out of profits."
    },
    {
      "case_name": "Ramanlal C. Parekh v. Krishnamachari, Commissioner of Income-tax",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Salary deducted before profits; not out of profits."
    },
    {
      "case_name": "V. Narayanaswami Iyer v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Turned on third condition; commission disallowed under section 10(2)(xv)."
    },
    {
      "case_name": "Balakrishnan v. Commissioner of Income-tax",
      "citation": null,
      "treatment": "followed",
      "relevance": "Similar facts; commission paid out of profits."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "66(1)",
        "10(2)(xv)"
      ],
      "relevance": "Reference to High Court; disallowance of commission."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal by revenue dismissed; agreed with High Court that assessee entitled to exemption from tax on commission of Rs. 2,45,557 under the notification, as all conditions satisfied, though on different grounds.",
    "relief_granted": "Exemption upheld for assessee.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The three conditions are cumulative and unless all the three conditions are satisfied no exemption can be given.",
      "speaker": "court",
      "significance": "Defines requirements for exemption under notification."
    },
    {
      "text": "The object of the notification is self-evident it is to prevent imposition of tax on the same income twice over.",
      "speaker": "court",
      "significance": "Explains purpose of notification."
    },
    {
      "text": "Whether the commission was paid out of the profits or determined with reference to the profits has to be decided on the facts of each case.",
      "speaker": "court",
      "significance": "Principle for applying first condition."
    }
  ],
  "_case_id": "1965_313",
  "_label": 0,
  "_text_length": 11786,
  "_extracted_at": "2026-02-10T19:28:14.662258"
}