{
  "metadata": {
    "case_name": "Plaintiff (Appellant) v. Kontaru Naiko (Defendant No. 1) & Ors.",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Civil Appeal No. 167 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Plaintiff obtained a registration certificate under s. 5 and r. 5 of the Orissa Money-Lenders Act, 1939 on March 31, 1952.",
      "type": "background",
      "date": "1952-03-31",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Defendants contended that the maximum capital for which the 1952 registration certificate was required was Rs. 2,000.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "Plaintiff obtained another registration certificate in 1955 stating maximum capital of Rs. 8,000.",
      "type": "background",
      "date": "1955",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Plaintiff advanced loan of Rs. 6,000 to defendant No. 1 on May 19, 1954.",
      "type": "material",
      "date": "1954-05-19",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Plaintiff sued for recovery of Rs. 8,216 due on the promissory note executed by defendant No. 1.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Trial Court (Subordinate Judge, Berhampur) decreed the suit against defendants, holding defendants Nos. 2 and 3 liable only to the extent of assets of defendant No. 1.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Orissa High Court in First Appeal No. 61 of 1959 reversed trial court decree and dismissed the suit on April 11, 1962.",
      "type": "procedural",
      "date": "1962-04-11",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the registration of the appellant as a registered money-lender in March 1952 became void when he advanced a loan in excess of Rs. 2,000 in 1954.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the appellant could not have advanced the loan in excess of the maximum capital for which the registration certificate was granted.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Retrospective operation of registration certificates of higher denomination obtained during the currency of a prior certificate.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court erred in holding that registration became void upon advancing loan exceeding Rs. 2,000 and that appellant could not advance loan exceeding maximum capital in certificate.",
      "supporting_facts": [
        "f1",
        "f2",
        "f4"
      ],
      "legal_basis": "Orissa Money-Lenders Act, 1939 and rules"
    },
    {
      "id": "pa2",
      "text": "Raised point on retrospective operation of 1955 higher denomination certificate.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Suit not maintainable as plaintiff advanced loan exceeding maximum capital of Rs. 2,000 in 1952 certificate, making registration void; thus even suit for Rs. 2,000 not maintainable.",
      "supporting_facts": [
        "f1",
        "f2",
        "f4"
      ],
      "legal_basis": "Orissa Money-Lenders Act, 1939 and rules"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Question same as in Sant Saranlal v. Parsuram Sahu; relevant provisions of Orissa Act analogous to Bihar Acts; no specific provision in Act fixing maximum capital or voiding registration if exceeded.",
      "addresses_issue": "i1",
      "key_observation": "Rules requiring mention of maximum capital do not imply registration becomes void if exceeded."
    },
    {
      "id": "cr2",
      "text": "Rules on application, fees, and higher certificates do not lead to conclusion that exceeding limit voids registration.",
      "addresses_issue": "i2",
      "key_observation": "Absence of specific provision in Act; not open to State Government to frame rule voiding registration."
    },
    {
      "id": "cr3",
      "text": "Not necessary to decide retrospective operation of higher certificate.",
      "addresses_issue": "i3",
      "key_observation": "Issue not reached."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "In absence of specific provision in Act providing for fixing maximum capital, not open to State to frame rule; rules do not make registration void if maximum capital exceeded.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Money-lender can advance loans exceeding maximum capital stated in registration certificate without voiding registration.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Sant Saranlal v. Parsuram Sahu",
      "citation": null,
      "treatment": "followed",
      "relevance": "Same question decided; provisions analogous to Bihar Money-Lenders Acts"
    }
  ],
  "statutes_cited": [
    {
      "name": "Orissa Money-Lenders Act, 1939 (Act III of 1939)",
      "sections": [
        "s. 2(c)",
        "s. 2(m)",
        "s. 5",
        "s. 6",
        "s. 7",
        "s. 8",
        "s. 9",
        "s. 18"
      ],
      "relevance": "Registration of money-lenders, validity for suits to recover loans, definitions of capital and registered money-lender, accounts, interest rates"
    },
    {
      "name": "Orissa Money-Lenders Rules, 1939",
      "sections": [
        "r. 1(c)",
        "r. 3(iii)",
        "r. 4",
        "r. 5"
      ],
      "relevance": "Definition of maximum capital, application requirements, fees, form and higher denomination certificates"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court held in favor of appellant, ruling that registration not voided by exceeding maximum capital; reversed High Court dismissal of suit.",
    "relief_granted": "Suit for recovery held maintainable",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the registration of the money-lender will become void if he exceeds the limit of the maximum capital laid down in the registration certificate.\"",
      "speaker": "court",
      "significance": "Court rejects this conclusion of High Court"
    },
    {
      "text": "\"Suit for recovery of loan maintainable by registered money-lenders only - A money-lender shall not be entitled to institute a suit for the recovery of a loan advanced by him after the date on which this section comes into force unless he was registered under this Act at the time when such loan was advanced\"",
      "speaker": "court",
      "significance": "Key provision s. 8 on suit maintainability"
    },
    {
      "text": "\"in the absence of any specific provision in the Act ... it was not open to the State Government to frame a rule in that regard\"",
      "speaker": "court",
      "significance": "Core holding on limits of rules vs. Act"
    }
  ],
  "_case_id": "1965_51",
  "_label": 1,
  "_text_length": 7201,
  "_extracted_at": "2026-02-10T19:24:59.461824"
}