{
  "metadata": {
    "case_name": "President of Bhusaval Borough Municipality v. Collector of Jalgaon & Ors.",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao J."
    ],
    "case_number": "Civil Appeal No. 481 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The last general election of the members of the Bhusaval Borough Municipality was held under the provisions of the Bombay Municipal Borough Act, 1925 in the year 1960.",
      "type": "background",
      "date": "1960",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The first general meeting thereafter was held on February 18, 1961.",
      "type": "background",
      "date": "1961-02-18",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Under s. 25 of the Act, in the normal course the life of the Municipality would have expired on February 17, 1965.",
      "type": "material",
      "date": "1965-02-17",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Under s. 3 of the Maharashtra Municipalities (Postponement of General Elections Pending Unification of Municipal Laws) Act, 1964, the term of the Councillors of the Municipality was, by fiction, extended to and inclusive of December 31, 1965.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On July 18, 1964, the appellant was elected the President of the Municipality.",
      "type": "material",
      "date": "1964-07-18",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On the same day, the Municipality passed a resolution to the effect that the term of the office of the President shall be the residue of the term of office of the Municipality.",
      "type": "material",
      "date": "1964-07-18",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On the assumption that the term of the President expired on February 17, 1965, the Collector of Jalgaon issued a notice on March 2, 1965, calling for a meeting of the Municipality on March 15, 1965, for electing a new President.",
      "type": "procedural",
      "date": "1965-03-02",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The appellant filed an application under Arts. 226 and 227 of the Constitution in the High Court of Maharashtra for the issue of an appropriate order setting aside the notice issued by the Collector.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "A Division Bench of the High Court rejected the contention that the appellant was entitled to continue in office till December 31, 1965 and dismissed the petition by judgment and order dated April 30, 1965.",
      "type": "procedural",
      "date": "1965-04-30",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appeal to Supreme Court by certificate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On or about July 18, 1964, when the term of the President was extended, the Municipality passed a resolution recommending that the term of the Municipality be extended beyond 4 years.",
      "type": "background",
      "date": "1964-07-18",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the expression 'the residue of the Municipality' in the resolution of the Municipality, dated July 18, 1964, means the residue of the term that would have been if the Maharashtra Act had not been passed or whether it should be interpreted in the context of the extended term provided by the Maharashtra Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "True construction of the provisions of ss. 19 and 25 of the Bombay Municipal Borough Act, 1925 read with s. 3 of the Maharashtra Municipalities (Postponement of General Elections Pending Unification of Municipal Laws) Act, 1964.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The appellant would get the extended term provided in the Maharashtra Act, because in effect it was an extension under the Act within the meaning of the second proviso to s. 19 of the Act.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": "Second proviso to s. 19 of Bombay Municipal Borough Act, 1925; s. 3 Maharashtra Act"
    },
    {
      "id": "pa2",
      "text": "In any event he got the benefit because the Maharashtra Act in effect amended s. 25 of the Act, with the result the residue of the term was extended to December 31, 1965.",
      "supporting_facts": [
        "f3",
        "f4",
        "f6"
      ],
      "legal_basis": "s. 25 Bombay Municipal Borough Act, 1925; s. 3 Maharashtra Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The second proviso to s. 19 of the Act had no application, for it dealt only with an extension by notification or otherwise under the provisions of the Act and the statutory extension given by the Maharashtra Act could not possibly be an extension under the Act.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "Second proviso to s. 19; s. 25 Bombay Municipal Borough Act, 1925"
    },
    {
      "id": "ra2",
      "text": "Even if the Maharashtra Act had the effect of amending s. 25 of the Act with the result that the life of the members of the Municipality was extended by the amendment of the Act itself, it would not help the appellant as the scope of the resolution passed by the Municipality should be construed on the basis of the circumstances existing at the time the resolution was passed, i.e., previous to the election of the President, and at that time the Councillors of the Municipality could have only passed the resolution fixing the term of the President during the residue of the life the Municipality had at that time.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s. 19 Bombay Municipal Borough Act, 1925"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The combined effect of the two Acts: Under s. 25 of the Act the term of the Councillors is 4 years, extensible by State Government to not exceeding five years. If extended under s.25, second proviso to s.19 extends President's term automatically. But s.3 Maharashtra Act extends term beyond that, without order under s.25, so second proviso not attracted.",
      "addresses_issue": "i2",
      "key_observation": "Leave out second proviso; approach on fiction that term under s.25 extended to Dec 31, 1965."
    },
    {
      "id": "cr2",
      "text": "Intention of Municipality in resolution: Gathered from circumstances at time passed and express terms. S.19 allows fixing term 1-4 years or residue if less than 1 year. Second proviso contemplates extension under Act. With knowledge of possible extension, using 'residue' elastic expression means not just then-available term but synchronized with existing or extended life.",
      "addresses_issue": "i1",
      "key_observation": "Councillors contemplated extension; passed resolution recommending extension; Statement of Objects showed postponement under consideration since 1963."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The expression 'residue of the term of the Municipality' in the resolution includes the extension under Maharashtra Act; term of President synchronizes with extended life of Municipality till December 31, 1965.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Bombay Municipal Borough Act, 1925 (Bom. Act 18 of 1925)",
      "sections": [
        "s. 19",
        "s. 25"
      ],
      "relevance": "Governs term of President (linked to residue of Municipality term) and term of Councillors (4 years, extendable to 5 years by Govt. order)."
    },
    {
      "name": "Maharashtra Municipalities (Postponement of General Elections Pending Unification of Municipal Laws) Act, 1964",
      "sections": [
        "s. 3"
      ],
      "relevance": "Deemed extension of term of Councillors whose term would expire before Dec 31, 1965 to that date."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Arts. 226",
        "227"
      ],
      "relevance": "Basis for High Court petition."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; order of High Court set aside; writ issued prohibiting Collector from holding election of President till December 31, 1965.",
    "relief_granted": "Writ prohibiting election of new President till December 31, 1965.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'the term of the President should synchronize with the life of the Municipality existing or extended, as the case may be.'",
      "speaker": "court",
      "significance": "Core holding on interpretation of 'residue'."
    },
    {
      "text": "In our view, therefore, the order of the High Court is not correct and the same is set aside.",
      "speaker": "court",
      "significance": "Declares appeal successful."
    }
  ],
  "_case_id": "1965_57",
  "_label": 1,
  "_text_length": 12210,
  "_extracted_at": "2026-02-10T19:24:54.698958"
}