{
  "metadata": {
    "case_name": "Gurcharan Dass Chadha v. State of Rajasthan",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Transfer Petition No. 7 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Petition under S.527 CrPC for transfer of criminal case No. 2 of 1964 (State v. Gurcharan Dass Chadha) pending in Court of Special Judge, Bharatpur, Rajasthan, to another criminal court of equal or superior jurisdiction subordinate to High Court other than Rajasthan High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Petitioner is accused, tried under Ss.120B/161 IPC and S.5(1)(d) and 5(2) Prevention of Corruption Act; prosecution sanctioned by Government of India.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In December 1962, petitioner serving as Superintendent of Police, selected as Commandant of 8th Battalion Rajasthan Armed Constabulary; took over on January 7, 1963 but placed under suspension same day; case registered January 12, 1963 leading to present prosecution.",
      "type": "background",
      "date": "1962-12",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Petitioner apprehends unfair trial in Rajasthan due to hostility and influence of then Law Minister (also incharge Home Department), Additional Inspector General of Police (Anti-Corruption), and Deputy Inspector General of Police (Ajmer Range); supported by incidents, documents, and affidavit.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "State Government opposes transfer strenuously, questions jurisdiction of Supreme Court to transfer case assigned to Special Judge under Criminal Law Amendment Act, 1952; disputes facts and merits.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "While petition pending, State served petitioner notice and charge-sheet for breach of Rule 8 All India Services (Conduct) Rules, 1954, for communicating official documents/information to counsel (R.K. Rastogi, D.P. Gupta) and others in writ petition No. 794/1964 in Rajasthan High Court (withdrawn December 23, 1964); signed by Vishnu Dutt Sharma, Special Secretary; appendices list 31 and 16 documents.",
      "type": "procedural",
      "date": "1964-12-23",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Petitioner filed petition for contempt against Sharma and Rajasthan Government; Court considered issuing notices but Advocate General offered action; replies filed by Chief Secretary and Sharma denying malice; justification abandoned, unconditional apology tendered and accepted by Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Petitioner's allegations of hostility: State Government downgraded his Commandant post (lower pay); suspension/prosecution timed to prevent joining new post; five instances crossing Home Minister Mathura Dass Mathur's path; differences with DIG Hanuman Prasad Sharma on three occasions; hostility from DIG Sultan Singh.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Supreme Court has jurisdiction under S.527 CrPC to transfer a case pending before Special Judge appointed under Criminal Law Amendment Act, 1952, to Special Judge subordinate to another High Court.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether transfer warranted on merits due to reasonable apprehension of unfair trial in Rajasthan.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Transfer necessary as petitioner entertains apprehension of unfair trial due to hostility of Law/Home Minister, Addl IG Police (Anti-Corruption), DIG Police (Ajmer Range), and State Government; supported by specific past incidents.",
      "supporting_facts": [
        "f3",
        "f4",
        "f8"
      ],
      "legal_basis": "S.527 CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Supreme Court lacks jurisdiction to transfer case assigned by State Government to Special Judge under Criminal Law Amendment Act, 1952 (self-contained special law); Ss.7(1),(2) mandate trial only by designated Special Judge in area of offence.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": "Criminal Law Amendment Act, 1952 Ss.6,7"
    },
    {
      "id": "ra2",
      "text": "Disputes facts alleged; apprehension not reasonable; no merit in transfer claim.",
      "supporting_facts": [
        "f4",
        "f8"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Court has jurisdiction under S.527 CrPC to transfer to another Special Judge subordinate to different High Court; no inconsistency with CLA Act Ss.7(2) (territorial) as S.8(3) preserves CrPC provisions not inconsistent; analogous to territorial transfers under CrPC; S.7(1) satisfied by Special Judge trial.",
      "addresses_issue": "i1",
      "key_observation": "Territorial condition in S.7(2) yields to transfer powers; creates jurisdiction in transferee court."
    },
    {
      "id": "cr2",
      "text": "Transfer on merits denied; apprehension must be reasonable, not mere allegation; past hostilities insufficient without material showing interference with investigation/trial; nothing against Special Judge Bharatpur.",
      "addresses_issue": "i2",
      "key_observation": "General feeling of hostility not enough; must infer likely interference with justice."
    },
    {
      "id": "cr3",
      "text": "Charge-sheet under Conduct Rules during petition was indirect pressure, deprecated; but apology accepted, contempt petition closed.",
      "addresses_issue": null,
      "key_observation": "Action should wait till proceedings terminate."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Supreme Court can transfer case from one Special Judge (subordinate to one High Court) to another Special Judge (subordinate to another High Court) under S.527 CrPC.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "No reasonable apprehension of failure of justice; transfer petition dismissed.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ramchandra Prasad v. State of Bihar",
      "citation": "1962 2 S.C.R. 50",
      "treatment": "followed",
      "relevance": "Upheld High Court transfer of case to Special Judge outside territorial jurisdiction, relying on S.8(3) CLA Act preserving CrPC."
    }
  ],
  "statutes_cited": [
    {
      "name": "Code of Criminal Procedure, 1898",
      "sections": [
        "S.527",
        "S.526"
      ],
      "relevance": "Confers power on Supreme Court to transfer cases for ends of justice; preserved by CLA Act S.8(3) unless inconsistent."
    },
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "S.120B",
        "S.161",
        "S.162",
        "S.163",
        "S.164",
        "S.165",
        "S.165A"
      ],
      "relevance": "Offences triable by Special Judges under CLA Act S.6(1); petitioner charged under 120B/161."
    },
    {
      "name": "Prevention of Corruption Act, 1947",
      "sections": [
        "S.5(1)(d)",
        "S.5(2)",
        "S.5(2)"
      ],
      "relevance": "Offences triable by Special Judges under CLA Act S.6(1); petitioner charged under these."
    },
    {
      "name": "Criminal Law Amendment Act, 1952",
      "sections": [
        "S.6",
        "S.7",
        "S.8"
      ],
      "relevance": "Appoints Special Judges (S.6); mandates trial only by Special Judge in area (S.7); procedure per CrPC unless inconsistent (S.8(3)); does not bar transfer."
    },
    {
      "name": "All India Services (Conduct) Rules, 1954",
      "sections": [
        "Rule 8"
      ],
      "relevance": "Basis of charge-sheet against petitioner for unauthorized communication of documents."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Transfer petition dismissed for lack of reasonable apprehension of unfair trial despite affirmed jurisdiction; contempt petition against State and officer closed after unconditional apology accepted.",
    "relief_granted": "None",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A case is transferred if there is a reasonable apprehension on the part of a party to a case that justice will not be done. A petitioner is not required to demonstrate that justice will inevitably fail.",
      "speaker": "court",
      "significance": "States settled law on transfer for apprehension of bias."
    },
    {
      "text": "The condition that an offence specified in s.6(1) shall be tried by a special Judge for the area within which it is committed merely specifies which of several special Judges... shall try it.",
      "speaker": "court",
      "significance": "Explains why S.7(2) CLA Act does not bar transfer under S.527 CrPC."
    },
    {
      "text": "justice should not only be done but it should be seen to be done.",
      "speaker": "court",
      "significance": "Principle underpinning transfer jurisdiction."
    }
  ],
  "_case_id": "1965_75",
  "_label": 0,
  "_text_length": 20285,
  "_extracted_at": "2026-02-10T19:25:11.204586"
}