{
  "metadata": {
    "case_name": "Appellants v. Respondents",
    "case_year": 1952,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal J.",
      "Bachawat J.",
      "Ramaswami J.",
      "Mudholkar J."
    ],
    "case_number": "Civil Appeal No. 638 of 1952",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellants carrying on business at Raha in Nowgong District had dealings with respondents carrying on business at Gauhati, resulting in appellants indebted to respondents in Rs. 9,447-4-9.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellants sent cheque for Rs. 9,461-4-0 dated August 31, 1948 to respondents; cheque drawn by Messrs. Nathuram Jaidayal of Sibsagar on Tripura Modern Bank, Sibsagar Branch, in favour of appellants, endorsed to respondents.",
      "type": "material",
      "date": "1948-08-31",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On September 4, 1948, respondents sent cheque to their bankers, Calcutta Commercial Bank, Gauhati for collection.",
      "type": "procedural",
      "date": "1948-09-04",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Calcutta Commercial Bank, Gauhati sent cheque to Tripura Modern Bank, Sibsagar for encashment on same day.",
      "type": "procedural",
      "date": "1948-09-04",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Tripura Modern Bank, Sibsagar debited accounts of Messrs. Nathuram Jaidayal with Rs. 9,461-4-0, deducted Rs. 6-4-0 commission, sent draft for Rs. 9,435/- dated September 14, 1948 to Calcutta Commercial Bank, Gauhati; draft drawn on Calcutta Head Office, current for three months.",
      "type": "material",
      "date": "1948-09-14",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Calcutta Commercial Bank, Gauhati sent draft to Head Office at Calcutta for collection but never presented it; no attempts to collect.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Respondents wrote to appellants that cash payment for cheque not received; appellants replied on September 18, 1948 asking respondents to get back the cheque, but cheque never returned.",
      "type": "procedural",
      "date": "1948-09-18",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Calcutta Commercial Bank closed business on September 17, 1948, later wound up.",
      "type": "material",
      "date": "1948-09-17",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Tripura Modern Bank closed business on October 16, 1948, entered scheme of arrangement with creditors.",
      "type": "material",
      "date": "1948-10-16",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On November 19, 1948, respondents requested Tripura Modern Bank to pay draft amount to them, not Calcutta Commercial Bank; no payment made.",
      "type": "material",
      "date": "1948-11-19",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Respondents instituted suit on March 8, 1949 claiming dues from appellants as cheque was conditional payment and not cashed.",
      "type": "procedural",
      "date": "1949-03-08",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Subordinate Judge, Lower Assam District dismissed suit.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "High Court in First Appeal No. 7 of 1962 reversed trial court, decreed suit, judgment dated May 21, 1957.",
      "type": "procedural",
      "date": "1957-05-21",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "P.W. 3 (employee of Calcutta Commercial Bank) stated draft sent by registered post to head office, returned undelivered as head office closed; draft would have been paid if presented before October 16, 1948.",
      "type": "admitted",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Appellants wrote letter dated September 10, 1949 to respondents acknowledging non-receipt and asking to get cheque back.",
      "type": "disputed",
      "date": "1949-09-10",
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the cheque was received as conditional payment, and if the original debt revived due to non-payment, or if laches in collecting the draft discharged the appellants.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether acceptance of the draft by respondents' bank constituted absolute payment of the cheque.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Respondents accepted cheque as conditional payment but failed to present draft for payment within reasonable time, causing prejudice to appellants due to bank closures; laches discharge the debt.",
      "supporting_facts": [
        "f2",
        "f5",
        "f6",
        "f8",
        "f9",
        "f14"
      ],
      "legal_basis": "Chitty on Contracts 22nd Edn. Art. 1079; Addisons Treatise on Contracts 11th Edn. p.156; Hopkins v. Ware; Chamberlain v. Delarive"
    },
    {
      "id": "pa2",
      "text": "Respondents' bank accepted demand draft on September 14, 1948 as absolute payment of the cheque, discharging appellants' liability.",
      "supporting_facts": [
        "f5",
        "f10"
      ],
      "legal_basis": "Chalmers on Bills of Exchange p.301 12th ed.; strong presumption in favour of conditional payment unless accepted as absolute"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Cheque was conditional payment; non-cashing revives original claim; failure to obtain payment of draft not due to their laches.",
      "supporting_facts": [
        "f2",
        "f11"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Appellants' letter dated September 10, 1949 admits liability on cheque.",
      "supporting_facts": [
        "f15"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court rightly held cheque conditional, but respondents' laches in collecting draft (kept without presentation, no attempts despite 3-month validity) prejudiced appellants as draft payable before bank closure; deemed retained as absolute payment, debt discharged.",
      "addresses_issue": "i1",
      "key_observation": "Duty to present within reasonable time; failure alters debtor's position for worse."
    },
    {
      "id": "cr2",
      "text": "Respondents through agents received draft instead of cash; acceptance in course of collection equivalent to direct acceptance as conditional; failure to present caused prejudice.",
      "addresses_issue": "i1",
      "key_observation": "Draft payable before October 16, 1948; P.W.3 evidence confirms payment would have been made."
    },
    {
      "id": "cr3",
      "text": "High Court erred in assuming Tripura Modern Bank closed September 16 (fact October 16) and no prejudice to appellants.",
      "addresses_issue": "i1",
      "key_observation": "Contrary to evidence."
    },
    {
      "id": "cr4",
      "text": "Separate by Mudholkar J.: Respondents accepted draft as absolute payment; letter Nov 19, 1948 confirms; cheque honoured by debit, draft issued at instance; rights shift to draft, not original debt.",
      "addresses_issue": "i2",
      "key_observation": "Presumption conditional overcome by acceptance of draft; appellants' letter in ignorance."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Cheque treated as duly paid via draft retention due to laches; original debt discharged.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Acceptance of demand draft deemed absolute payment.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hopkins v. Ware",
      "citation": "L.R. 1869 4 Ex. 268",
      "treatment": "followed",
      "relevance": "Creditor taking third-party cheque must present within reasonable time or debtor discharged if prejudiced."
    },
    {
      "case_name": "Chamberlain v. Delarive",
      "citation": "2 Wils. K.B. 353 95 E.R. 854",
      "treatment": "followed",
      "relevance": "Creditor holding draft unreasonable time before demand, drawer insolvent: creditor's loss."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court judgment and decree set aside, trial court judgment and decree restored. Respondents pay costs in Supreme Court; parties bear own costs below.",
    "relief_granted": "Dismissal of respondents' suit restored",
    "costs": "Respondents pay costs in this Court; parties pay and bear own costs in courts below."
  },
  "key_quotes": [
    {
      "text": "\"the respondents must be deemed to have retained the draft as absolute payment of the cheque, and on the payment of the cheque, the original debt stood discharged.\"",
      "speaker": "court",
      "significance": "Core holding on laches and discharge of debt."
    },
    {
      "text": "\"Where a negotiable instrument... is accepted by the creditor as conditional payment, he is bound to do all that a holder... may do in order to get payment... if he fails... the creditor is guilty of laches and makes the cheque his own.\"",
      "speaker": "court",
      "significance": "States legal principle from Chitty applied."
    },
    {
      "text": "\"the respondents by accepting the demand draft... must be deemed to have accepted that draft as a legal tender or as absolute payment.\"",
      "speaker": "court",
      "significance": "Mudholkar J.'s reasoning on absolute payment."
    }
  ],
  "_case_id": "1965_108",
  "_label": 1,
  "_text_length": 16154,
  "_extracted_at": "2026-02-10T19:25:34.305531"
}