{
  "metadata": {
    "case_name": "Sahib Singh Dugal & Jagdev Kumar Gupta v. Union of India",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Wanchoo, J."
    ],
    "case_number": "Writ Petition Nos. 55 and 56 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Sahib Singh Dugal employed in the Posts and Telegraph Directorate of the Central Government.",
      "type": "background",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f2",
      "text": "Sahib Singh Dugal arrested on December 8, 1964 and put in jail as an under trial prisoner for an offence under S. 3 of the Official Secrets Act.",
      "type": "material",
      "date": "1964-12-08",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Various remands taken up to March 11, 1965 in connection with the criminal case.",
      "type": "procedural",
      "date": "1965-03-11",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "Eight other persons involved in the case under S. 3 of the Official Secrets Act, including Jagdev Kumar Gupta (petitioner in Writ Petition No. 56), arrested on December 6, 1964.",
      "type": "background",
      "date": "1964-12-06",
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "On March 11, 1965, Deputy Superintendent of Police made a report to the court that all nine persons might be discharged as sufficient evidence for conviction could not be discovered.",
      "type": "procedural",
      "date": "1965-03-11",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Magistrate discharged all nine persons including petitioners; released from jail that evening.",
      "type": "procedural",
      "date": "1965-03-11",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Immediately after release, Sahib Singh Dugal served with detention order under R. 30(1)(b) of Defence of India Rules passed by Government of India to prevent acting in manner prejudicial to defence of India, public safety and India's relations with foreign powers.",
      "type": "material",
      "date": "1965-03-11",
      "source": "petitioner"
    },
    {
      "id": "f8",
      "text": "Dugal arrested and detained in Central Jail, Tihar, New Delhi under further order under R. 30(4) of the Rules.",
      "type": "procedural",
      "date": "1965-03-11",
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Material in respect of activities of petitioners ranged over a period of two years before date of detention.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the orders of detention are illegal in view of the decision in Rameshwar Shaw v. District Magistrate, Burdwan.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the orders of detention are mala fide.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "In view of Rameshwar Shaw v. District Magistrate, Burdwan, order of detention and service thereof are illegal as petitioners were in jail in connection with criminal case.",
      "supporting_facts": [
        "f2",
        "f3",
        "f7",
        "f8"
      ],
      "legal_basis": "Rameshwar Shaw v. District Magistrate, Burdwan (1964 S.C.R. 921)"
    },
    {
      "id": "pa2",
      "text": "Order of detention is mala fide as authorities dropped criminal proceedings under S.3 Official Secrets Act due to insufficient evidence and immediately ordered detention.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Rameshwar Shaw case has no application to present cases.",
      "supporting_facts": [
        "f5",
        "f6",
        "f7",
        "f9"
      ],
      "legal_basis": "Rameshwar Shaw v. District Magistrate, Burdwan (1964 S.C.R. 921); Smt. Godavari Shamrao v. State of Maharashtra (A.I.R. 1964 C. 1128)"
    },
    {
      "id": "ra2",
      "text": "No mala fide intention in making orders of detention; dropping criminal case does not imply mala fides as detention based on wider past activities over two years.",
      "supporting_facts": [
        "f5",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Facts differ from Rameshwar Shaw: petitioners in jail for about three months, but executive decided criminal case could not succeed, applied for discharge on March 11, 1965, passed detention order same day, served immediately after release; past activities proximate (two years).",
      "addresses_issue": "i1",
      "key_observation": "Ratio of Rameshwar Shaw does not apply as authorities deliberately dropped criminal case and then detained."
    },
    {
      "id": "cr2",
      "text": "Dropping criminal proceedings due to insufficient evidence for conviction under Official Secrets Act does not make detention mala fide; authorities may still detain based on wider past activities watched over two years.",
      "addresses_issue": "i2",
      "key_observation": "Cannot infer mala fides merely from dropping prosecution and ordering detention."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rameshwar Shaw case does not apply; detention orders valid.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Detention orders not mala fide.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Rameshwar Shaw v. District Magistrate, Burdwan",
      "citation": "1964 S.C.R. 921",
      "treatment": "distinguished",
      "relevance": "Distinguished as in that case detenu in jail for indefinite period on pending criminal case; here criminal case dropped deliberately before detention."
    },
    {
      "case_name": "Smt. Godavari Shamrao v. State of Maharashtra",
      "citation": "A.I.R. 1964 C. 1128",
      "treatment": "followed",
      "relevance": "Second detention order valid even if served in jail, distinguishing Rameshwar Shaw."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 32"
      ],
      "relevance": "Basis for writ petitions for habeas corpus."
    },
    {
      "name": "Official Secrets Act",
      "sections": [
        "Section 3"
      ],
      "relevance": "Offence for which petitioners arrested and later discharged."
    },
    {
      "name": "Defence of India Rules",
      "sections": [
        "Rule 30(1)(b)",
        "Rule 30(4)"
      ],
      "relevance": "Basis for detention orders to prevent prejudicial acts."
    },
    {
      "name": "Preventive Detention Act",
      "sections": [],
      "relevance": "Mentioned in context of Rameshwar Shaw case."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Writ petitions dismissed; detention orders upheld as Rameshwar Shaw case distinguished and no mala fides found.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "where a person was already in jail for an indefinite length of time in connection with a criminal case pending against him it would not be possible for the authority to come to the conclusion that such a person's detention is necessary",
      "speaker": "court",
      "significance": "Explains ratio of Rameshwar Shaw case."
    },
    {
      "text": "it may not be possible to obtain a conviction for a particular offence but the authorities may still be justified in ordering detention of a person in view of his past activities which will be of a wider range",
      "speaker": "court",
      "significance": "Rejects mala fides argument."
    }
  ],
  "_case_id": "1965_338",
  "_label": 0,
  "_text_length": 11286,
  "_extracted_at": "2026-02-10T19:28:47.372021"
}