{
  "metadata": {
    "case_name": "India Cements Limited v. Commissioner of Income Tax",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeal No. 1106 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee, India Cements Limited, a public limited company, obtained a loan of 40 lakhs of rupees from the Industrial Finance Corporation of India during the accounting year April 1, 1949 to March 31, 1950 (assessment year 1950-51). The loan was secured by a charge on the fixed assets of the company.",
      "type": "material",
      "date": "1949-04-01 to 1950-03-31",
      "source": "tribunal"
    },
    {
      "id": "f2",
      "text": "Proceeds of the loan were utilised to pay off a prior debt of 25 lakhs due to Messrs A. F. Harvey Limited and Madurai Mills, Limited.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f3",
      "text": "The balance of 15 lakhs was utilised towards working funds, as stated by the directors while reporting on the accounts for the year ended 31-3-1949 on 4-10-1949.",
      "type": "material",
      "date": "1949-10-04",
      "source": "tribunal"
    },
    {
      "id": "f4",
      "text": "Expenditure of Rs. 84,633/- in connection with this loan comprised: Stamps Rs. 60,023; Registration Fee Rs. 16,067; Charges for certified copy of mortgage deed Rs. 28; Indemnity deed by Essen and Company, Limited Rs. 15; Vakils fee for drafting deed Rs. 7,500; Legal fees Rs. 1,000.",
      "type": "material",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f5",
      "text": "The assessee did not charge this expenditure in the profit and loss account for that year. It was shown in the Balance Sheet as mortgage loan expenses and continued to be so shown till March 31, 1952. In the accounts for March 31, 1953, this was written off by appropriation against the profits of that year.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f6",
      "text": "Income Tax Officer refused to allow deduction of Rs. 84,633/-. Observed that Rs. 25 lakhs of the loan was to pay A.F. Harvey and Madurai Mills in discharge of amount borrowed from them and utilised on capital assets. Held expenditure incurred in obtaining capital, not admissible under S. 10(2)(iii), excluded by S. 10(2)(xi) as capital expenditure. Relied on Nagpur Electric Light and Power Co. v. CIT.",
      "type": "procedural",
      "date": null,
      "source": "income_tax_officer"
    },
    {
      "id": "f7",
      "text": "Appellate Assistant Commissioner agreed with Income Tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "aac"
    },
    {
      "id": "f8",
      "text": "Appellate Tribunal distinguished Nagpur Electric case, held paid-up capital sufficient to cover capital outlay, borrowal for augmenting working funds, whole loan for working capital, expenditure allowable.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f9",
      "text": "Madras High Court answered question in favour of respondent (revenue), preferred ITO findings, held Tribunal's conclusion based on inference from balance-sheet without investigating utilisation of prior Rs.25 lakhs, expenditure for bringing into existence asset of borrowing Rs.40 lakhs, enduring benefit, capital expenditure.",
      "type": "procedural",
      "date": "1961-10-31",
      "source": "high_court"
    },
    {
      "id": "f10",
      "text": "Appeal by special leave to Supreme Court against High Court judgment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts and in the circumstances of the case, the Tribunal was right in law in holding that the sum of rupees 84,633/- expended by the assessee in obtaining the loan or any part thereof is an allowable expenditure?",
      "framed_by": "high_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Expenditure admissible as deduction under S.10(2)(xv). High Court erred in holding it was made to acquire asset or advantage of enduring nature per Viscount Cave test in Assam Bengal Cement. Money expended in raising loan by mortgage not capital expenditure. Expended wholly and exclusively for business.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": "S.10(2)(xv); Assam Bengal Cement Co. Ltd. v. CIT"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "High Court right in preferring ITO findings over Tribunal as Tribunal finding based on surmises, ignored material. Question wide enough to include material for Tribunal finding. On merits, expenditure takes colour from purpose: to obtain capital, hence capital expenditure. Borrowed money enduring asset.",
      "supporting_facts": [
        "f2",
        "f6"
      ],
      "legal_basis": "S.10(2)(xi); Viscount Cave test"
    },
    {
      "id": "ra2",
      "text": "Distinction between interest on loan and expenditure to obtain loan justified. Borrowing not incidental to business.",
      "supporting_facts": [],
      "legal_basis": "CIT v. Malayalam Plantations"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court must accept Tribunal findings of fact unless challenged u/s 66(1). Not necessary to decide but findings not vitiated.",
      "addresses_issue": "i1",
      "key_observation": "High Court erred in preferring ITO over Tribunal without proper challenge."
    },
    {
      "id": "cr2",
      "text": "Loan not asset or advantage of enduring nature. Expenditure for securing use of money for period, revenue not capital. Irrelevant object/purpose of loan.",
      "addresses_issue": "i1",
      "key_observation": "No distinction in India between interest and expenditure to obtain loan; both procure use of money for profit."
    },
    {
      "id": "cr3",
      "text": "Expenditure laid out wholly and exclusively for business purpose; wide scope includes commercial expediency.",
      "addresses_issue": "i1",
      "key_observation": "Borrowing money incidental to carrying on business."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Expenditure of Rs.84,633/- not in nature of capital expenditure, laid out wholly and exclusively for assessee's business, allowable u/s 10(2)(xv).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Nagpur Electric Light and Power Co. v. Commissioner of Income-tax",
      "citation": "6 I.T.C. 28",
      "treatment": "distinguished",
      "relevance": "Tribunal distinguished as here loan for working funds not capital; SC holds wrongly decided."
    },
    {
      "case_name": "Assam Bengal Cement Co. Ltd. v. Commissioner of Income Tax",
      "citation": "1955 1 S.C.R. 972, 27 I.T.R. 34",
      "treatment": "followed",
      "relevance": "Approved Viscount Cave test for capital vs revenue; applied to hold interest revenue."
    },
    {
      "case_name": "State of Madras v. G. J. Coelho",
      "citation": "1964 8 S.C.R. 601, 53 I.T.R. 186",
      "treatment": "followed",
      "relevance": "Interest on loan for purchase revenue expenditure, no enduring benefit."
    },
    {
      "case_name": "Atherton v. British Insulated and Helsby Cables Ltd.",
      "citation": "10 T.C. 155",
      "treatment": "followed",
      "relevance": "Viscount Cave test for enduring advantage."
    },
    {
      "case_name": "Scottish North American Trust v. Farmer",
      "citation": "5 T.C. 693",
      "treatment": "referred",
      "relevance": "Interest as outgoing for use of money deductible."
    },
    {
      "case_name": "Bombay Steam Navigation Co. Ltd. v. CIT",
      "citation": "1965 1 S.C.R. 770, 56 I.T.R. 52",
      "treatment": "followed",
      "relevance": "Test for revenue expenditure: integral to profit-earning, not permanent asset."
    },
    {
      "case_name": "In re Tata Iron and Steel Company Ltd.",
      "citation": "1 I.T.C. 125",
      "treatment": "distinguished",
      "relevance": "Expenses for shares capital; different from loan."
    },
    {
      "case_name": "Texas Land and Mortgage Company v. William Holtham",
      "citation": "3 T.C. 255",
      "treatment": "distinguished",
      "relevance": "English case on debentures as capital; not applicable to Indian Act."
    },
    {
      "case_name": "Western India Plywood Ltd. v. CIT, Madras",
      "citation": "38 I.T.R. 533",
      "treatment": "overruled",
      "relevance": "Wrongly held loan expenses capital based on English distinction."
    },
    {
      "case_name": "Sri Annapurna Cotton Mills Ltd. v. CIT",
      "citation": "54 I.T.R. 592",
      "treatment": "distinguished",
      "relevance": "Erroneous to treat loan as enduring asset."
    },
    {
      "case_name": "CIT v. Malayalam Plantations",
      "citation": "1964 7 S.C.R. 693, 53 I.T.R. 140",
      "treatment": "followed",
      "relevance": "Wide scope of 'for purpose of business'."
    },
    {
      "case_name": "Eastern Investments Ltd. v. CIT",
      "citation": "1961 3 S.C.R. 359, 42 I.T.R. 7",
      "treatment": "followed",
      "relevance": "Borrowing on debentures for commercial expediency."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act",
      "sections": [
        "10(2)(iii)",
        "10(2)(xi)",
        "10(2)(xv)",
        "66(1)"
      ],
      "relevance": "S.10(2)(xv) allows revenue expenditure wholly for business; excludes capital u/s 10(2)(xi); interest u/s 10(2)(iii)."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed, judgment of Madras High Court dated October 31, 1961 set aside, question referred answered in affirmative (expenditure allowable).",
    "relief_granted": "Deduction of Rs.84,633/- allowed as revenue expenditure.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the loan obtained is not an asset or advantage of an enduring nature; that the expenditure was made for securing the use of money for a certain period; and that it is irrelevant to consider the object with which the loan was obtained.\"",
      "speaker": "court",
      "significance": "Core holding distinguishing loan expenses from capital expenditure."
    },
    {
      "text": "\"Expenditure incurred was part of circulating or floating capital of the assessee.\"",
      "speaker": "court",
      "significance": "From Coelho case, applied to loan expenses as revenue."
    },
    {
      "text": "\"the expression 'for the purpose of the business' is wider in scope than the expression 'for the purpose of earning profits'.\"",
      "speaker": "court",
      "significance": "Establishes broad test for business purpose including borrowing."
    }
  ],
  "_case_id": "1965_161",
  "_label": 1,
  "_text_length": 31665,
  "_extracted_at": "2026-02-10T19:26:25.878178"
}