{
  "metadata": {
    "case_name": "Gurbinder Singh and Balbinder Singh v. Lal Singh and Pratap Singh",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Civil Appeal No. 431 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Mst. Raj Kaur was in possession of 851 kanals 18 marlas of land situate in village Dhaipai in the former State of Faridkot. Out of this land 481 kanals 7 marlas was in her possession as occupancy tenant, the landlord being the Raja of Faridkot while the remaining land was held by Smt. Raj Kaur as Adna Malik, the Aala malik again being the said Raja of Faridkot.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In Samvat 1953 (A.D.1896) Smt. Raj Kaur who had two daughters Prem Kaur and Mahan Kaur, adopted the formers son Bakshi Singh and put him in possession of the whole of the land.",
      "type": "background",
      "date": "1896",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Bakshi Singh transferred part of the land to Pratap Singh, second son of Mahan Kaur, who is respondent No. 2 in the appeal. Mahan Kaur had one more son Lal Singh and he is respondent No. 1 in this appeal.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In the year 1915 the Raja of Faridkot filed a suit against Bakshi Singh and Raj Kaur in the court of Sub-Judge, Faridkot for a declaration that the adoption of Bakshi Singh was invalid. This suit was decreed on February 9, 1916.",
      "type": "material",
      "date": "1916-02-09",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Raj Kaur died on August 14, 1930.",
      "type": "material",
      "date": "1930-08-14",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On February 19, 1934 the Raja filed two suits against Bakshi Singh and Pratap Singh for possession of the aforementioned lands, one pertaining to the land of which Raj Kaur was occupancy tenant and the other for that of the land of which she was Adna malik. These suits were decreed on March 12, 1938 and in execution of the decrees obtained in these suits the Raja took possession of the entire land in October 1938.",
      "type": "material",
      "date": "1938-10",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Mahan Kaur died on July 13, 1938.",
      "type": "background",
      "date": "1938-07-13",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On April 7, 1948 he sold the entire land along with some other land to one Kehar Singh for Rs. 84,357-5-0.",
      "type": "material",
      "date": "1948-04-07",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Thereupon Gurbinder Singh and Balbinder Singh, who are the appellants before us, filed a suit for pre-emption of the land against Kehar Singh and obtained a decree in their favour. In execution of that decree they got possession of the land on June 22, 1950.",
      "type": "material",
      "date": "1950-06-22",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On October 20, 1948 Mst. Prem Kaur instituted a suit for possession of the entire land on the ground that she was the legal heir of Raj Kaur against Kehar Singh and the Raja of Faridkot. Later she impleaded the appellants as defendants to that suit and discharged the Raja of Faridkot.",
      "type": "procedural",
      "date": "1948-10-20",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On February 17, 1950, Lal Singh, respondent No. 1, filed a suit for possession of the entire land against the Raja of Faridkot and Kehar Singh. To that suit he joined Prem Kaur and Pratap Singh as defendants. Later, however, Pratap Singh was transposed as a plaintiff.",
      "type": "procedural",
      "date": "1950-02-17",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Both the suits were consolidated and were tried together. The suit of Prem Kaur was dismissed by the trial court but that of the respondents was decreed to the extent of half share in the property.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Prem Kaur and the appellants preferred appeals before the District Court but that court dismissed both the appeals.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "A second appeal was taken by the appellants as well as by Prem Kaur to the High Court and cross-objections were preferred by the respondents. The High Court dismissed these appeals as well as the cross-objections.",
      "type": "procedural",
      "date": "1958-05-21",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appeal by certificate from the High Court of Punjab in Civil Regular Second Appeal No. 263-P of 1952.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the suit for possession instituted by the respondents Lal Singh and Pratap Singh is within time, specifically whether governed by art. 141, 142 or 144 of the Limitation Act, 1908 and barred by time.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The suit is governed by art. 141 of the Limitation Act, 1908 as held by the High Court but either by art. 142 or by art. 144 and is on that basis barred by time.",
      "supporting_facts": [
        "f5",
        "f6",
        "f9",
        "f11"
      ],
      "legal_basis": "Articles 141, 142, 144 of Limitation Act, 1908"
    },
    {
      "id": "pa2",
      "text": "Adverse possession of Bakshi Singh and Pratap Singh from death of Raj Kaur can be tacked on to adverse possession of Raja and those claiming through him (Kehar Singh, appellants), making total over 12 years.",
      "supporting_facts": [
        "f2",
        "f3",
        "f5",
        "f6",
        "f8",
        "f9"
      ],
      "legal_basis": "Ramayya v. Kotamma"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The suit is not governed by art. 141 or art. 142 but by art. 144 and is within time.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Article 144 of Limitation Act, 1908"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Art. 142 not attracted as plaintiffs (respondents) were never in possession as heirs of Raj Kaur; Pratap Singh's prior possession was under different title.",
      "addresses_issue": "i1",
      "key_observation": "Plaintiffs never in possession as heirs, so art. 142 inapplicable."
    },
    {
      "id": "cr2",
      "text": "Under art. 144, possession of defendant becomes adverse to plaintiff from October 1938 (Raja's possession); total adverse possession by Raja, Kehar Singh, appellants less than 12 years to suit date.",
      "addresses_issue": "i1",
      "key_observation": "Starting point October 1938, less than 12 years."
    },
    {
      "id": "cr3",
      "text": "Cannot tack adverse possession of Bakshi Singh and Pratap Singh (independent trespassers) to that of Raja et al.; Raja sued them as trespassers, one trespasser against another, no jural relationship.",
      "addresses_issue": "i1",
      "key_observation": "Independent trespassers' possessions cannot be tacked; defendant can only use possession through whom he claims."
    },
    {
      "id": "cr4",
      "text": "Ramayya v. Kotamma distinguished as it applied to art. 142, not 144; involved continuity via heir, not independent trespassers.",
      "addresses_issue": "i1",
      "key_observation": "Not applicable to art. 144."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Suit governed by art. 144 Limitation Act; not barred by time as adverse possession less than 12 years and no tacking of independent trespassers' possession.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Ramayya v. Kotamma",
      "citation": "1921 I.L.R. 45 Mad. 370",
      "treatment": "distinguished",
      "relevance": "Distinguished as applied to art. 142 with continuity via heir, not independent trespassers under art. 144."
    },
    {
      "case_name": "Mohendra Nath v. Shamsunnessa",
      "citation": "1941 21 C.L.J. 757",
      "treatment": "followed",
      "relevance": "Time runs against last full owner; not arrested by succession."
    },
    {
      "case_name": "Agency Co. v. Short",
      "citation": "1888 13 A.C. 793",
      "treatment": "referred",
      "relevance": "Principle against tacking successive independent trespassers; abandonment resets possession."
    },
    {
      "case_name": "Willis v. Earl Howe",
      "citation": "1893 2 Ch. 545",
      "treatment": "followed",
      "relevance": "Supports no tacking of successive trespassers."
    },
    {
      "case_name": "Rajagopala Naidu v. Ramasubramania Ayyar",
      "citation": "A.I.R. 1935 Mad. 449",
      "treatment": "followed",
      "relevance": "Doctrine of independent trespassers applies when second trespasses on first or first abandons."
    }
  ],
  "statutes_cited": [
    {
      "name": "Limitation Act, 1908",
      "sections": [
        "Article 141",
        "Article 142",
        "Article 144",
        "Section 2 (definition of defendant)"
      ],
      "relevance": "Determines limitation period for suit for possession; art. 144 applies, starting when defendant's possession adverse."
    },
    {
      "name": "Dastur ul amal",
      "sections": [],
      "relevance": "Rules of succession applied; daughters entitled on Raj Kaur's death."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed; respondents' suit for half share held within time under art. 144 Limitation Act, as adverse possession from October 1938 less than 12 years and prior possessions of independent trespassers not tacked.",
    "relief_granted": "Respondents' decree for half share confirmed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "In order that art. 142 is attracted the plaintiff must initially have been in possession of the property and should have been dispossessed by the defendant or someone through whom the defendants claim or alternatively the plaintiff should have discontinued possession.",
      "speaker": "court",
      "significance": "Explains why art. 142 inapplicable."
    },
    {
      "text": "There can be no jural relationship between two independent trespassers. Therefore, where a defendant in possession of property is sued by a person who has title to it but is out of possession what he has to show in defence is that he or anyone through whom he claims has been in possession for more than the statutory period.",
      "speaker": "court",
      "significance": "Core reason no tacking of independent trespassers under art. 144."
    },
    {
      "text": "The possession of the intruder, ineffectual for the purpose of transferring title, ceases upon its abandonment to be effectual for any purpose.",
      "speaker": "court",
      "significance": "Quotes Agency Co. v. Short on independent trespassers."
    }
  ],
  "_case_id": "1965_104",
  "_label": 0,
  "_text_length": 18539,
  "_extracted_at": "2026-02-10T19:25:41.828263"
}