{
  "metadata": {
    "case_name": "Trustees of H.E.H. the Nizams Religious Endowment Trust v. Commissioner of Income-tax",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Civil Appeal Nos. 491, 492 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "By an indenture dated September 14, 1950, H.E.H. the Nizam of Hyderabad created a trust known as H.E.H. the Nizams Religious Endowment Trust, settling securities of the face value of Rs. 40 lakhs.",
      "type": "background",
      "date": "1950-09-14",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Under the Trust deed, three trustees were appointed, including the settlor.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Clause 3 of Trust deed: Trustees to hold Trust Fund upon trust to manage it and recover interest/income; during settlor's lifetime, balance of income accumulated and added to corpus.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "After settlor's death, Trustees to spend income on one or more of four religious/charitable objects in their absolute discretion: (a) annual religious offerings to sacred Muslim places outside India (Hedjaz, Iraq, Iran, Baghdad, Basra); (b) help to Khuddam/servants of shrines and pious people there; (c) upkeep of sacred buildings constructed in settlor's lifetime (masjids, Azakhana, Askurkhanas, Maqbaras listed in Second Schedule); (d) annual expenditure during Moharram, Safer etc., including offerings to shrines at Ajmer and Gulbarga.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Settlor's desire: income spent equally on the four objects as far as possible; surplus for other religious/charitable objects for Sunni Mohamedans or accumulated for later use.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Clause 4: Trustees' decisions by majority; if tied, by settlor during lifetime, then senior trustee.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "No power conferred on trustees during settlor's lifetime to set apart/allocate accumulated income for any objects; only after settlor's death.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Settlor still alive.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Two objects within taxable territories, two outside.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "For assessment years 1952-53 and 1953-54, Trustees assessed to income-tax on income from Trust property.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Trustees claimed exemption under S. 4(3)(ii) of the Act [noted as error, context S.4(3)(i)].",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Income-tax Officer, Appellate Assistant Commissioner, Income-tax Appellate Tribunal held no exemption.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Tribunal referred question to High Court u/s 66(1): Whether income from property settled under deed dated 14-9-1950 or any part exempt u/s 4(3) of 1922 Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Andhra Pradesh High Court (Seshachelapati and Venkatesam, JJ) held no exemption u/s 4(3)(i). Judgment dated September 14, 1962.",
      "type": "procedural",
      "date": "1962-09-14",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "True construction of S. 4(3)(i) of the Indian Income-tax Act, 1922: Whether income derived from property held under trust wholly for religious or charitable purposes, accumulated during settlor's lifetime without setting apart, is exempt insofar as such purposes relate to within taxable territories.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the income arising from property settled upon trust under the deed dated 14-9-1950, or any part thereof, is exempt from tax under Section 4(3) of the Indian Income-tax Act, 1922.",
      "framed_by": "lower_court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Proviso (a) to S. 4(3)(i) attracted only when Trustees exercise option to apply income to purposes without taxable territories; here no option exercised, so substantive part of cl. (i) applies.",
      "supporting_facts": [
        "f3",
        "f7",
        "f8"
      ],
      "legal_basis": "S. 4(3)(i), proviso (a), Indian Income-tax Act, 1922"
    },
    {
      "id": "pa2",
      "text": "Income accumulated without setting apart for any purpose; since two purposes within taxable territories, accumulation deemed for those; if later applied outside, proviso would apply then.",
      "supporting_facts": [
        "f4",
        "f9"
      ],
      "legal_basis": "S. 4(3)(i)"
    },
    {
      "id": "pa3",
      "text": "Clause 3(d)(v) of Trust deed shows income set apart for purposes within taxable territories.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Exemption under S. 4(3)(i) only if income specifically accumulated for religious/charitable purposes within taxable territories; here no setting apart done.",
      "supporting_facts": [
        "f3",
        "f7",
        "f8"
      ],
      "legal_basis": "S. 4(3)(i), Indian Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S. 4(3)(i) exempts income from property held wholly under trust for religious/charitable purposes only if applied or accumulated for application to such purposes within taxable territories; 'accumulated for application' means finally set apart.",
      "addresses_issue": "i1",
      "key_observation": "'Applied or accumulated for application' in first part means applied or finally set apart, same as second part."
    },
    {
      "id": "cr2",
      "text": "Accumulation involves conscious act to set apart income for specific purpose; here no such setting apart during settlor's life.",
      "addresses_issue": "i1",
      "key_observation": "Income kept in suspense with option to trustees; not accumulated for within territories till selection."
    },
    {
      "id": "cr3",
      "text": "History: Pre-1953 amendment exempted regardless of territory; post-amendment limits to within territories to protect revenue.",
      "addresses_issue": "i1",
      "key_observation": "Proviso excepts income applied outside; confirms application/accumulation required."
    },
    {
      "id": "cr4",
      "text": "Mixed purposes with option; cannot predicate accumulation for within territories till trustees select and set apart.",
      "addresses_issue": "i1",
      "key_observation": "Settlor's desire in cl. 3(d)(v) not setting apart by trustees."
    },
    {
      "id": "cr5",
      "text": "Principle from Mohammad Ibrahim Riza: Where trust for mixed purposes with trustee option, no identification till selection.",
      "addresses_issue": "i1",
      "key_observation": "Applies here: option for in/out territories."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Income not exempt under S. 4(3)(i) as not applied or finally set apart/accumulated for religious/charitable purposes within taxable territories.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "High Court answer to referred question correct.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Mohammad Ibrahim Riza v. Income-tax Commissioner, Nagpur",
      "citation": "(1930) L.R. 57 I.A. 260",
      "treatment": "followed",
      "relevance": "Principle: Trust for mixed purposes with trustee option to select; income not identifiable as for religious/charitable till selection."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "S. 4(3)(i)",
        "S. 4(3)(i) proviso (a)",
        "S. 16(1)(c)",
        "S. 66(1)"
      ],
      "relevance": "Provision for exemption of trust income applied/accumulated for religious/charitable purposes within taxable territories; reference to High Court."
    },
    {
      "name": "Income-tax (Amendment) Act, 1953",
      "sections": [
        "25 of 1953"
      ],
      "relevance": "Amended S. 4(3)(i) w.e.f. April 1, 1952, limiting exemption to purposes within taxable territories."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals by special leave against the Andhra Pradesh High Court judgment holding no exemption under S. 4(3)(i) fail; High Court answer correct; appeals dismissed with costs.",
    "relief_granted": null,
    "costs": "Dismissed with costs"
  },
  "key_quotes": [
    {
      "text": "The words applied and accumulated, therefore, must mean applied or finally set apart. Applied means that the income is actually applied for the said purposes in the taxable territories and accumulated means that the income is set apart during the year for future spending on the said purposes.",
      "speaker": "court",
      "significance": "Core interpretation of 'applied or accumulated for application' under S. 4(3)(i)"
    },
    {
      "text": "Till the Trustees set apart the accumulation for the purposes within the taxable territories, it cannot be said that the purposes are within the taxable territories.",
      "speaker": "court",
      "significance": "Rejects claim of deemed accumulation for within territories due to option."
    },
    {
      "text": "The expression accumulated for a purpose involves a conscious act in present and posits a clear indication on the part of the trustee to set apart the income for that purpose.",
      "speaker": "court",
      "significance": "Defines requirement for accumulation to qualify for exemption."
    }
  ],
  "_case_id": "1965_358",
  "_label": 0,
  "_text_length": 17450,
  "_extracted_at": "2026-02-10T19:28:56.803828"
}