{
  "metadata": {
    "case_name": "State v. Respondent",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Criminal Appeal No. 60 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondent obtained permits under the Iron and Steel Control Order, 1956 for about 28 tons of iron, including 6 tons of rods, 15.5 tons of joints and 2 tons of G.C. Sheets.",
      "type": "material",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f2",
      "text": "Respondent purchased the iron articles on the basis of the permits between July 1957 and March 1958.",
      "type": "material",
      "date": "1957-07 to 1958-03",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "Permits obtained on three applications: first dated May 23, 1957 to Provincial Iron and Steel Controller, Kanpur through District Magistrate, Deoria, stating he was political sufferer constructing public temple, requiring 5 tons M.S. Round and 8 tons Girder; not available at Deoria.",
      "type": "background",
      "date": "1957-05-23",
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "First application forwarded by District Supply Officer, Deoria, duly recommended, permit given by Controller.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Second application dated September 7, 1957, stating political sufferer constructing public temple and dharamshala, requirements not available at Deoria.",
      "type": "background",
      "date": "1957-09-07",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Second application recommended and forwarded, permit given.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Third application dated January 2, 1958 (Ex. Ka 9), permit given by District Supply Officer.",
      "type": "background",
      "date": "1958-01-02",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Original permits not in record, exact conditions unknown.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Prosecution case: Respondent did not construct any temple or dharamshala at Barhaj Bazar or anywhere after obtaining materials.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f10",
      "text": "Barhaj Bazar is where respondent lives, mentioned in applications.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Respondent's reply before Magistrate: Used iron in temple at mauza Tinbari, P.S. Madhuban, district Azamgarh, his place of residence.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "Before Magistrate, respondent admitted purchasing about 17 tons of iron; Magistrate held proved purchase of at least 1 ton more from Mishri Lal, P.W.7, total 18 tons.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Magistrate held only 3/4 ton rods utilised in building constructed at Tinbari between 1943-52; no portion of procured iron used for stated purpose; disposed wrongfully at Kanpur, not brought to Barhaj or Tinbari.",
      "type": "material",
      "date": "1943-1952",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Magistrate held contravention of cl.7 of Control Order.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Sessions Judge held barring small quantity, remaining iron not utilised in temple/dharmashala at Tinbari; no proof sold at Kanpur; possibility of retaining elsewhere not excluded.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f16",
      "text": "Sessions Judge: No condition in cl.7 or permits for use at particular place or within time; purpose was construction of temple/dharamshala, place not significant; acquitted.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "High Court (Srivastava, J.) dismissed State appeal: No contravention of cl.7; essentials: iron used, and otherwise than per conditions; no proof of use at all, so first not fulfilled; if unutilised, no contravention.",
      "type": "procedural",
      "date": "1962-08-24",
      "source": "lower_court"
    },
    {
      "id": "f18",
      "text": "High Court: Permit condition only 'materials used for purpose asked for and given'; cannot refer to application unless incorporated.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether respondent contravened clause 7 of the Iron and Steel Control Order, 1956 by not using the iron for the stated purpose.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Meaning of 'use' in clause 7: does it include mere non-use or storing for other purpose?",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether conditions in the permit can be ascertained by referring to the application for the permit.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether permits specified construction at a particular place like Deoria district.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "On facts found, cl.7 contravened; 'use' includes kept for eventual use for another purpose; storing is using; wide construction per Maxwell on Interpretation of Statutes.",
      "supporting_facts": [
        "f15",
        "f17"
      ],
      "legal_basis": "Cl.7 Iron and Steel Control Order, 1956; Maxwell on Interpretation of Statutes, 11th Ed., p.266"
    },
    {
      "id": "pa2",
      "text": "Permit condition 'purpose for which it was asked for' refers back to application; applications imply construction in Deoria district.",
      "supporting_facts": [
        "f3",
        "f5",
        "f10"
      ],
      "legal_basis": "Permit conditions"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Iron used in temple at Tinbari, Azamgarh.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "No provision requiring utilisation within specified time; if 'use' included keeping/storing, there would be time limit; building takes time.",
      "addresses_issue": "i2",
      "key_observation": "'Use' takes colour from context; suggests positive action like utilisation or disposal; mere non-use not included."
    },
    {
      "id": "cr2",
      "text": "Maxwell passage does not warrant meaning apart from context; no legislative intent to prohibit mere non-user.",
      "addresses_issue": "i2",
      "key_observation": "Control Order intent is utilisation per conditions, but no clause prohibits non-user."
    },
    {
      "id": "cr3",
      "text": "London County Council v. Wood not applicable.",
      "addresses_issue": "i2",
      "key_observation": "Different context."
    },
    {
      "id": "cr4",
      "text": "Permissible to refer to application and order to find purpose; but applications only mention construction of temple/dharamshala, no specific place.",
      "addresses_issue": "i3",
      "key_observation": "Sentence 'requirements not available at Deoria' does not limit to Deoria; no orders on District Magistrate jurisdiction shown."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Not established that respondent used iron in contravention of cl.7.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "'Use' in cl.7 does not include mere non-use or storing.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Permit conditions include purpose from application, but no specific place required.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h4",
      "text": "Applications do not limit construction to Deoria district.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "London County Council v. Wood",
      "citation": "1897 2 QB 482",
      "treatment": "distinguished",
      "relevance": "State relied on for wide meaning of 'used'; court found context different, object to protect highways."
    }
  ],
  "statutes_cited": [
    {
      "name": "Iron and Steel (Control) Order, 1956",
      "sections": [
        "Clause 5",
        "Clause 7"
      ],
      "relevance": "Cl.7: No use otherwise than per conditions in acquisition document. Cl.5: No disposal except per Controller's order. Court interpreted 'use' strictly."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the State's appeal by special leave against Allahabad High Court order upholding Sessions Judge's acquittal of respondent, holding no contravention of cl.7 of Iron and Steel Control Order, 1956 established.",
    "relief_granted": "Acquittal upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'Use' must take its colour from the context in which it is used. In cl.7 the expression 'use in accordance with the conditions contained' suggests something done positively, e.g. utilisation or disposal. Mere non-use, in our opinion, is not included in the word 'use'.",
      "speaker": "court",
      "significance": "Core interpretation rejecting State's broad construction of 'use'."
    },
    {
      "text": "There is no provision in the Control Order requiring that iron or steel acquired under the Control Order should be utilised within a specified time.",
      "speaker": "court",
      "significance": "Explains why non-use not punishable."
    },
    {
      "text": "The condition in the various permits granted to the appellant was simply this that he should utilise the iron in erecting a temple or dharamshala in the town of Barhaj.",
      "speaker": "sessions_judge",
      "significance": "Lower court view on lack of place/time specificity, referenced."
    }
  ],
  "_case_id": "1965_270",
  "_label": 0,
  "_text_length": 14876,
  "_extracted_at": "2026-02-10T19:27:42.539442"
}