{
  "metadata": {
    "case_name": "State of Rajasthan v. Respondent",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Civil Appeal No. 21 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent obtained the mining lease for extracting sandstone from certain area from the Government of Rajasthan in 1956 as a result of auction. The period of the lease was from April 1, 1956 to July 31, 1959.",
      "type": "material",
      "date": "1956-04-01",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent applied for extension of the period upto two years in view of the mandatory nature of the main provision of r. 30 and simultaneously also applied for the renewal of the lease for a further period in accordance with the provisions of the proviso to r. 30.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "The first prayer was refused and the State Government extended the period of the lease at first by six months and later by another two months.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The respondent thereafter filed a writ petition under Art. 226 of the Constitution in the High Court and prayed for issue of a writ of mandamus directing the striking down of the order of the Government renewing the lease for 8 months and directing the State of Rajasthan further to extend the lease in the first instance for two years from July 30, 1959 to bring it in conformity with the period of lease specified in r. 30 and to renew, after the expiry of such extended period, for a further period of 5 years under r. 30 of the rules.",
      "type": "procedural",
      "date": "1960",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "The State of Rajasthan contested the petition on the ground that the provisions of Chapter IV of the rules did not apply to the grant of mining leases by auction or tender provided for by Chapter V of the rules and that in any case the initial period short of 5 years must be deemed to have been at the desire of the respondent and that any further extension of the period of the lease under the proviso was in the discretion of the Government.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "The High Court held that the provisions of Chapter IV of the rules were applicable as far as possible to the grant of mining leases by auction under Chapter V, that though the State Government had to give a lease for 5 years in view of r. 30, yet the shorter period of the lease in favour of the respondent must, in the circumstances, be deemed to have been at his request and that the respondent was entitled to an extension of the lease by a further period of 5 years in accordance with the provisions of the proviso. It therefore directed the State Government to renew the lease for a period of 5 years from the expiry of the original lease with option of further renewal, if so desired, by another period of 5 years subject to the conditions mentioned in r. 30.",
      "type": "procedural",
      "date": "1961-08-01",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "This appeal, on certificate granted by the Rajasthan High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the provisions of Chapter IV of the rules (including r. 30) govern the grant of mining leases by auction under Chapter V of the rules.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the proviso to r. 30 gives discretion to the State Government to extend the period of the lease for any period not exceeding 5 years or is it mandatory that the State Government must extend the lease by a period of 5 years.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The provisions of Chapter IV of the rules do not govern the grant of mining leases by auction under the provisions of Chapter V of the rules.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Rajasthan Minor Mineral Concession Rules, 1955, Chapter IV and Chapter V"
    },
    {
      "id": "pa2",
      "text": "The proviso to r. 30 gives discretion to the State Government to extend the period of the lease for any period not exceeding 5 years; it is not mandatory that the State Government must extend the lease by a period of 5 years.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Rajasthan Minor Mineral Concession Rules, 1955, r. 30 proviso"
    },
    {
      "id": "pa3",
      "text": "The initial period short of 5 years must be deemed to have been at the desire of the respondent.",
      "supporting_facts": [
        "f1",
        "f5"
      ],
      "legal_basis": null
    },
    {
      "id": "pa4",
      "text": "The High Court granted relief to the respondent in excess of what he had prayed, as the respondent had not prayed for any direction with respect to the option for a second extension of the lease.",
      "supporting_facts": [
        "f4",
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The provisions of Chapter IV of the rules were applicable as far as possible to the grant of mining leases by auction under Chapter V.",
      "supporting_facts": [
        "f1",
        "f4"
      ],
      "legal_basis": "Rajasthan Minor Mineral Concession Rules, 1955, Chapter IV"
    },
    {
      "id": "ra2",
      "text": "Entitled to extension of the lease by a further period of 5 years in accordance with the provisions of the proviso to r. 30, and renewal after expiry.",
      "supporting_facts": [
        "f2",
        "f4"
      ],
      "legal_basis": "Rajasthan Minor Mineral Concession Rules, 1955, r. 30"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "A comparison of the provisions of rules in Chapter IV and those in Chapter V shows that all the incidents of a grant of a mining lease contemplated and provided for in Chapter IV are not provided for by Chapter V. This leads to the irresistible conclusion that matters not provided for by rules in Chapter V with regard to mining leases will be governed by provisions relating to those matters in Chapter IV.",
      "addresses_issue": "i1",
      "key_observation": "Provisions of Chapter IV apply as far as possible to leases under Chapter V."
    },
    {
      "id": "cr2",
      "text": "Rules 19, 26, 27, 29, 30, 31 (with modifications), 32 by their nature must apply to leases granted under Chapter V as they are expressed in general terms and can apply to all mining leases.",
      "addresses_issue": "i1",
      "key_observation": "No express provision excluding Chapter IV from Chapter V grants; legislature would have made one if intended."
    },
    {
      "id": "cr3",
      "text": "The word 'may' in the main provision of r. 30 must mean 'shall' and make the provision mandatory. The period of the lease therefore can be shorter than five years only when the applicant desires and not when the Government desires. Government must fix the period of the lease at 5 years in the absence of any expression of desire by the applicant for taking the lease for a shorter period.",
      "addresses_issue": "i2",
      "key_observation": "Main provision of r. 30 is mandatory for 5-year period unless applicant desires shorter."
    },
    {
      "id": "cr4",
      "text": "The word 'may' in the proviso in regard to the extension of the period by Government should also be construed as 'shall' so as to make it incumbent on Government to extend the period of the lease if the lessee desires extension. The first extension has to be for five years. Government has no option in that regard.",
      "addresses_issue": "i2",
      "key_observation": "Proviso to r. 30 mandatory for 5-year extension if lessee desires, with option for further equivalent period upon guarantee."
    },
    {
      "id": "cr5",
      "text": "The respondents taking the lease for a period upto July 31, 1959 must amount to his expressing a desire for having a lease for that period. If he did not so desire, he need not have bid and taken the lease for the period for which it was to be given by auction.",
      "addresses_issue": "i2",
      "key_observation": "Shorter initial period deemed at respondent's request."
    },
    {
      "id": "cr6",
      "text": "The prayer for renewal under r. 30 includes the option as per proviso; even if not explicit, High Court competent to direct in accordance.",
      "addresses_issue": "i2",
      "key_observation": "Relief not in excess of prayer."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The provisions of Chapter IV of the rules apply so far as applicable to mining leases granted under Chapter V.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Rule 30 is mandatory: mining lease to be for 5 years unless applicant desires shorter; first extension mandatory for 5 years if lessee desires, with option for further equivalent period upon guarantee of investment.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Mines and Minerals (Regulation and Development) Act, 1948",
      "sections": [
        "Section 5"
      ],
      "relevance": "Empowered Central Government to make rules for regulating grant of mining leases."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226"
      ],
      "relevance": "Basis for writ petition in High Court."
    },
    {
      "name": "Mineral Concession Rules, 1949",
      "sections": [
        "Rule 3",
        "Rule 4"
      ],
      "relevance": "Defined minor minerals; state rules for minor minerals under r.4."
    },
    {
      "name": "Rajasthan Minor Mineral Concession Rules, 1955",
      "sections": [
        "Chapter IV (rr. 19-32)",
        "Chapter V (rr. 33-42)",
        "r. 30",
        "r. 31",
        "r. 32",
        "r. 33",
        "r. 37",
        "r. 38",
        "r. 39",
        "r. 41",
        "r. 42"
      ],
      "relevance": "Governed grant, period, extension, renewal of mining leases; Chapter IV applies to Chapter V grants where applicable."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the High Court's order, agreeing that Chapter IV provisions including r. 30 apply to auction grants under Chapter V, that r. 30 is mandatory for 5-year periods/extensions unless applicant desires shorter, the initial short period was at respondent's desire, and respondent entitled to 5-year renewal from expiry of original lease with option for further 5 years subject to r. 30 conditions.",
    "relief_granted": "Direction to State Government to renew the lease for 5 years from expiry of original lease with option of further renewal for another 5 years subject to conditions in r. 30 upheld.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "We are of opinion that the High Court has come to a right conclusion on these two points.",
      "speaker": "court",
      "significance": "Supreme Court affirms High Court on both issues."
    },
    {
      "text": "The word may in the main provision of the rule must mean shall and make the provision mandatory.",
      "speaker": "court",
      "significance": "Key interpretation making r. 30( main) mandatory for 5-year lease."
    },
    {
      "text": "The provisions of Chapter IV of the rules were applicable as far as possible to the grant of mining leases by auction under Chapter V.",
      "speaker": "court",
      "significance": "Holds Chapter IV applies to Chapter V grants."
    }
  ],
  "_case_id": "1965_237",
  "_label": 0,
  "_text_length": 22059,
  "_extracted_at": "2026-02-10T19:26:58.898978"
}