{
  "metadata": {
    "case_name": "Deputy Tahsildar v. Government of Madras",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Bachawat J."
    ],
    "case_number": "Civil Appeal No. 232 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The appellant held the post of Deputy Tahsildar in the Revenue Department of the Government of Madras.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Disciplinary proceedings were started against him on twelve charges of acceptance of illegal gratification during his office as Special Loans Deputy Tahsildar, Cuddalore, South Arcot District.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Disciplinary proceedings were started against three of his subordinates also on similar charges.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On May 20, 1949, he was placed under suspension and relieved of his duties.",
      "type": "procedural",
      "date": "1949-05-20",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The Disciplinary Proceedings Tribunal directed the consolidation and common hearing of the enquiries against the appellant and the other three civil servants.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The appellant asked for permission to engage a counsel at the enquiry. By an order dated May 31, 1949, the Tribunal refused to give the permission.",
      "type": "procedural",
      "date": "1949-05-31",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The enquiry was held on June 13, 14 and 15.",
      "type": "procedural",
      "date": "1949-06-13",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "At the hearing, the other three civil servants were represented by counsel, Sri. Kalyanasundaram.",
      "type": "procedural",
      "date": "1949-06-13",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "On June 13, the appellant prayed for an adjournment. The Tribunal declined to grant the adjournment and told the appellant that he was at liberty to engage Sri. Kalyanasundaram as his counsel.",
      "type": "procedural",
      "date": "1949-06-13",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "The appellant thereupon availed himself of the services of Sri. Kalyanasundaram, and was represented by him throughout the enquiry.",
      "type": "procedural",
      "date": "1949-06-13",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On June 30, the Tribunal submitted a report stating that the charges against the appellant were proved and recommending his dismissal.",
      "type": "procedural",
      "date": "1949-06-30",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On September 16, the Government issued a notice to him asking him to show cause why he should be dismissed from service.",
      "type": "procedural",
      "date": "1949-09-16",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "On November 12, 1949, he submitted his written representation.",
      "type": "procedural",
      "date": "1949-11-12",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "On October 17, 1950, the Government directed that he be dismissed from service with effect from May 20, 1949.",
      "type": "procedural",
      "date": "1950-10-17",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "The appellant instituted the suit asking for a declaration that the order dated October 17, 1950 dismissing him from service is illegal and void.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The trial Court dismissed the suit.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f17",
      "text": "This decree was affirmed on appeal by the High Court of Madras on October 23, 1960 in Appeal No. 237 of 1958.",
      "type": "procedural",
      "date": "1960-10-23",
      "source": "court"
    },
    {
      "id": "f18",
      "text": "The appellant appeals to this Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Even in his written representation dated November 12, 1949, the appellant did not allege that he was prejudiced in his defence.",
      "type": "admitted",
      "date": "1949-11-12",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in view of the refusal of the appellant's prayer for engaging a counsel of his own choice and his prayer for adjournment of the hearing on June 13, 1949, the appellant had been denied a reasonable opportunity to defend himself against the charges.",
      "framed_by": "petitioner"
    },
    {
      "id": "i2",
      "text": "Whether the order of dismissal dated October 17, 1950 having been passed with retrospective effect is illegal and inoperative.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "In view of the refusal of the appellant's prayer for engaging a counsel of his own choice and his prayer for adjournment of the hearing on June 13, 1949, the appellant had been denied a reasonable opportunity to defend himself against the charges.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "The order of dismissal dated October 17, 1950 having been passed with retrospective effect is illegal and inoperative.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The order of dismissal with retrospective effect as from the date of the suspension is valid in its entirety.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "In any event, the order is valid and effective as from October 17, 1950.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "There was no conflict of interests between him and the other three civil servants. Counsel representing the other three civil servants was allowed by the Tribunal also to represent him. The enquiry continued for three days. It is not proved that counsel was unable to conduct the defence properly. Even in his written representation dated November 12, 1949, the appellant did not allege that he was prejudiced in his defence. We are satisfied that the appellant had reasonable opportunity to defend himself against the charges.",
      "addresses_issue": "i1",
      "key_observation": "The appellant had reasonable opportunity to defend himself against the charges."
    },
    {
      "id": "cr2",
      "text": "The second contention of the respondent is sound, and in this view of the matter, we decline to express any opinion on the first contention.",
      "addresses_issue": "i2",
      "key_observation": "The order dated October 17, 1950 directed that the appellant be dismissed from service with effect from the date of his suspension, that is to say, from May 20, 1949. In substance, this order directed that (1) the appellant be dismissed, and (2) the dismissal do operate retrospectively as from May 20, 1949. The two parts of this composite order are separable. The first part of the order operates as a dismissal of the appellant as from October 17, 1950. The invalidity of the second part of the order, assuming this part to be invalid, does not affect the first part of the order. The order of dismissal as from October 17, 1950 is valid and effective."
    },
    {
      "id": "cr3",
      "text": "Counsel for the appellant conceded that if the respondent's second contention is accepted, the appeal must fail.",
      "addresses_issue": "i2",
      "key_observation": "The appellant has been lawfully dismissed, and he is not entitled to claim that he is still in service."
    },
    {
      "id": "cr4",
      "text": "An order of dismissal with retrospective effect is, in substance, an order of dismissal as from the date of the order with the superadded direction that the order should operate retrospectively as from an anterior date. The two parts of the order are clearly severable. Assuming that the second part of the order is invalid, there is no reason why the first part of the order should not be given the fullest effect. The Court cannot pass a new order of dismissal, but surely it can give effect to the valid and severable part of the order.",
      "addresses_issue": "i2",
      "key_observation": "Disagreement with the reasoning in Abdul Hamid v. The District School Board and Sudhir Ranjan Haldar v. State of West Bengal that such orders must stand or fall in toto."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The appellant had reasonable opportunity to defend himself against the charges.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The order of dismissal as from October 17, 1950 is valid and effective. The two parts of the composite order are separable.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Hemanta Kumar v. S. N. Mukherjee",
      "citation": "1953 58 C.W.N. 1",
      "treatment": "followed",
      "relevance": "Holding that order of suspension was valid and effective as from the date of the order even if retrospective part invalid supports severability."
    },
    {
      "case_name": "Abdul Hamid v. The District School Board, 24-Parganas",
      "citation": "1957 61 C.W.N. 880; A.I.R. 1961 Cal. 626",
      "treatment": "distinguished",
      "relevance": "Court disagreed with view that order must stand or fall in toto; held parts severable."
    },
    {
      "case_name": "Sudhir Ranjan Haldar v. State of West Bengal",
      "citation": "A.I.R. 1961 Cal. 626,630",
      "treatment": "distinguished",
      "relevance": "Similar observations to Abdul Hamid that order cannot be maintained in modified form; court disagreed."
    }
  ],
  "statutes_cited": [],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The order of dismissal dated October 17, 1950 is held valid and effective as from that date, even if the retrospective effect from May 20, 1949 is invalid, as the parts are separable.",
    "relief_granted": null,
    "costs": "There will be no order as to costs."
  },
  "key_quotes": [
    {
      "text": "We are satisfied that the appellant had reasonable opportunity to defend himself against the charges.",
      "speaker": "court",
      "significance": "Rejects argument on denial of reasonable opportunity due to counsel issue."
    },
    {
      "text": "The two parts of this composite order are separable. The first part of the order operates as a dismissal of the appellant as from October 17, 1950.",
      "speaker": "court",
      "significance": "Core holding on severability of retrospective dismissal order."
    },
    {
      "text": "An order of dismissal with retrospective effect is, in substance, an order of dismissal as from the date of the order with the superadded direction that the order should operate retrospectively as from an anterior date. The two parts of the order are clearly severable.",
      "speaker": "court",
      "significance": "Explains reasoning why retrospective orders have severable parts."
    }
  ],
  "_case_id": "1965_146",
  "_label": 0,
  "_text_length": 7543,
  "_extracted_at": "2026-02-10T19:26:20.067114"
}