{
  "metadata": {
    "case_name": "Mst. Radha Rani v. Alienees",
    "case_year": 1961,
    "court": "Supreme Court of India",
    "judges": [
      "Bachawat, J."
    ],
    "case_number": "Civil Appeal No. 579 of 1961",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "One Kalyan Singh died sonless in the year 1918 leaving him surviving his widow, Mst. Bhagwati and two daughters, Mst. Indrawati and Mst. Radha Rani.",
      "type": "background",
      "date": "1918",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "By a deed, dated October 10, 1919, Mst. Bhagwati alienated her husbands estate in favour of certain alienees.",
      "type": "material",
      "date": "1919-10-10",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On October 23, 1931, Mst. Indrawati suing in a representative capacity on behalf of the reversioners to the estate of Kalyan Singh, instituted the suit in the Court of the Additional Civil Judge of Mathura, impleading the alienees as also Mst. Bhagwati and Mst. Radha Rani as defendants and claiming a declaration that the alienation was null and void against the subsequent heirs of Kalyan Singh and that on the death of Mst. Bhagwati, his next heirs would be entitled to get possession of the alienated properties.",
      "type": "procedural",
      "date": "1931-10-23",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On August 12, 1941, the trial Judge decreed the suit and granted a declaration that the alienation is void beyond the lifetime of Mst Bhagwati and does not bind the reversioners, who would be entitled after the death of Mst. Bhagwati to possession over the assets of Babu Kalyan Singh.",
      "type": "procedural",
      "date": "1941-08-12",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "On February 12, 1942, some of the alienees preferred an appeal to the Allahabad High Court impleading Mst. Bhagwati, Mst. Indrawati and Mst. Radha Rani as respondents to the appeal. Three sons of Mst. Indrawati and two sons of Mst. Radha Rani were also impleaded as respondent Nos. 8 to 12, but by an order dated March 11, 1942, the High Court directed that those persons would not be allowed to be impleaded as respondents.",
      "type": "procedural",
      "date": "1942-02-12",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "During the pendency of the appeal in the High Court, Mst. Indrawati died.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "By an order, dated May 11, 1950, the High Court directed that Mst. Radha Rani would continue to be on the record in place of her deceased sister, Mst. Indrawati, and as the next reversioner to the estate of Kalyan Singh.",
      "type": "procedural",
      "date": "1950-05-11",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "During the pendency of the appeal, on June 17, 1956, the Hindu Succession Act, 1956 came into force.",
      "type": "background",
      "date": "1956-06-17",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "At the hearing of the appeal before the High Court, the alienees raised the preliminary contention that after the coming into force of the Hindu Succession Act, 1956, there are no reversioners and no reversionary rights, and a suit for a declaration that the alienation is not binding on the reversioners is no longer maintainable. The High Court accepted this contention, allowed the appeal and dismissed the suit on September 25, 1957.",
      "type": "procedural",
      "date": "1957-09-25",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "On January 2, 1958, Mst. Radha Rani applied to the High Court for grant of a certificate under Art. 133 of the Constitution of India.",
      "type": "procedural",
      "date": "1958-01-02",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "On August 8, 1958, the High Court granted the certificate.",
      "type": "procedural",
      "date": "1958-08-08",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "On February 27, 1959, the High Court declared the appeal admitted.",
      "type": "procedural",
      "date": "1959-02-27",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "On May 29, 1961, Mst. Bhagwati died.",
      "type": "material",
      "date": "1961-05-29",
      "source": "court"
    },
    {
      "id": "f14",
      "text": "On or about November 13, 1961, the High Court despatched the records to this Court. No order of the High Court under O.XVI, r.12 of the Supreme Court Rules substituting the heirs of Mst. Bhagwati in her place was obtained, and the appeal abated against her.",
      "type": "procedural",
      "date": "1961-11-13",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "On March 26, 1962, Mst. Radha Rani filed the petition of appeal in this Court. In this petition of appeal, Mst. Bhagwati and also the above-mentioned three sons of Mst. Indrawati and two sons of Mst. Radha Rani were impleaded as respondents.",
      "type": "procedural",
      "date": "1962-03-26",
      "source": "petitioner"
    },
    {
      "id": "f16",
      "text": "On August 24, 1964, respondents Nos. 1 to 3 filed Civil Miscellaneous Petition No. 2219 of 1964 raising certain preliminary objections, and praying that the appeal be dismissed.",
      "type": "procedural",
      "date": "1964-08-24",
      "source": "respondent"
    },
    {
      "id": "f17",
      "text": "Mst. Indrawati left three sons (respondents 10,11,12 and another son Lallu also known as Ram Prasad) and two daughters (Ram Dulari and Vimla).",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether after the coming into force of the Hindu Succession Act, 1956, there are no reversioners and no reversionary rights, and a suit for a declaration that the alienation made by a Hindu widow is not binding on the reversioners is no longer maintainable.",
      "framed_by": "respondent"
    },
    {
      "id": "i2",
      "text": "Whether the three sons of Mst. Indrawati and the two sons of Mst. Radha Rani are improperly joined as respondents Nos. 8 to 12 in the petition of appeal.",
      "framed_by": "respondent"
    },
    {
      "id": "i3",
      "text": "Whether the petition of appeal is a nullity as Mst. Bhagwati, a dead person was impleaded as a party respondent therein.",
      "framed_by": "respondent"
    },
    {
      "id": "i4",
      "text": "Whether the appeal is defectively constituted and not maintainable in the absence of the heirs of Mst. Bhagwati.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The suit by reversioners for declaration that alienation by Hindu widow without legal necessity is not binding on them remains maintainable post Hindu Succession Act, 1956, as s.14 does not apply to properties already alienated.",
      "supporting_facts": [
        "f2",
        "f3",
        "f8"
      ],
      "legal_basis": "Gummalapura Taggina Mattada Kotturuswami v. Serta Veeravya; Brahmadeo Singh v. Deomani Missir"
    },
    {
      "id": "pa2",
      "text": "The widow is not a necessary party to the declaratory suit by reversioners, and upon her death during pendency, her heirs are not necessary parties.",
      "supporting_facts": [
        "f13"
      ],
      "legal_basis": "Bijoy Gopal Mukherji v. Krishna Mahishi Debi; Illustration e to S. 42 Specific Relief Act, 1877"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "After the coming into force of the Hindu Succession Act, 1956, there are no reversioners and no reversionary rights, and the suit is not maintainable.",
      "supporting_facts": [
        "f8",
        "f9"
      ],
      "legal_basis": "ss. 14, 15 and 16 of the Hindu Succession Act, 1956"
    },
    {
      "id": "ra2",
      "text": "The three sons of Mst. Indrawati and two sons of Mst. Radha Rani are improperly joined as respondents Nos. 8 to 12; they were not parties before HC and no order for joinder.",
      "supporting_facts": [
        "f5",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "ra3",
      "text": "Petition of appeal is a nullity as Mst. Bhagwati was dead when filed.",
      "supporting_facts": [
        "f13",
        "f15"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Appeal defectively constituted without heirs of Mst. Bhagwati; all her heirs (Mst. Radha Rani and sons/daughters of Mst. Indrawati) not parties.",
      "supporting_facts": [
        "f13",
        "f14",
        "f15",
        "f17"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S.14 of Hindu Succession Act does not apply to property already alienated by Hindu female before the Act; reversioners can maintain suit for declaration alienation not binding.",
      "addresses_issue": "i1",
      "key_observation": "Approved view in Gummalapura and Brahmadeo Singh; High Court erred."
    },
    {
      "id": "cr2",
      "text": "Names of respondents Nos. 8 to 12 struck off as improperly joined.",
      "addresses_issue": "i2",
      "key_observation": "Appellant does not object."
    },
    {
      "id": "cr3",
      "text": "Appeal may proceed against other respondents despite Mst. Bhagwati being dead and impleaded; not a nullity.",
      "addresses_issue": "i3",
      "key_observation": "Proceed on footing she is not a party."
    },
    {
      "id": "cr4",
      "text": "Heirs of widow not necessary parties to declaratory suit or appeal; reversioners can get effective relief against alienees in their absence; appeal not defectively constituted.",
      "addresses_issue": "i4",
      "key_observation": "Reversioners need not sue widow's heirs; can treat alienation as nullity post widow's death."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Suit by reversioner for declaration that alienation by Hindu widow limited owner before Hindu Succession Act, 1956 was without legal necessity and not binding on reversioners is maintainable.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Names of respondents Nos. 8 to 12 struck off; appeal proceeds without them.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Impleading dead Mst. Bhagwati does not make appeal a nullity; proceeds against other respondents.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h4",
      "text": "Heirs of widow are not necessary parties to the appeal; appeal not defectively constituted.",
      "resolves_issue": "i4",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gummalapura Taggina Mattada Kotturuswami v. Serta Veeravya and others",
      "citation": "1959 Supp. I S.C.R. 968, 975-976",
      "treatment": "followed",
      "relevance": "S.14 does not apply to properties in possession of alienees under pre-Act alienation; reversionary rights survive."
    },
    {
      "case_name": "Brahmadeo Singh and another v. Deomani Missir and others",
      "citation": "Civil Appeal No. 130 of 1960 decided on October 15, 1962",
      "treatment": "followed",
      "relevance": "Reversioners' suit for declaration against widow's alienation maintainable post-1956 Act."
    },
    {
      "case_name": "Ramsaroop Singh and others v. Hiralal Singh and others",
      "citation": "A.I.R. 1958 Patna 319",
      "treatment": "distinguished",
      "relevance": "Incorrect view that s.14 abolishes reversionary suits; overruled in effect."
    },
    {
      "case_name": "Hanuman Prasad v. Indrawati",
      "citation": "A.I.R. 1958 All. 304",
      "treatment": "distinguished",
      "relevance": "Allahabad HC view under appeal held incorrect."
    },
    {
      "case_name": "Bijoy Gopal Mukherji v. Krishna Mahishi Debi",
      "citation": "1907 I.L.R. 34 Cal. 329, 333 P.C.",
      "treatment": "followed",
      "relevance": "Reversioners can wait till widow's death and sue alienee for possession without joining widow's heirs."
    }
  ],
  "statutes_cited": [
    {
      "name": "Hindu Succession Act, 1956",
      "sections": [
        "14",
        "15",
        "16"
      ],
      "relevance": "Does not abolish reversionary rights in respect of properties alienated by Hindu widow before Act came into force."
    },
    {
      "name": "Specific Relief Act, 1877",
      "sections": [
        "42"
      ],
      "relevance": "Declaratory suit maintainable by next reversioner; proviso does not bar; Illustration e supports widow not necessary party."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "133"
      ],
      "relevance": "Certificate granted for appeal to Supreme Court."
    },
    {
      "name": "Supreme Court Rules",
      "sections": [
        "O.XVI, r.12"
      ],
      "relevance": "No order obtained for substitution of heirs of Mst. Bhagwati."
    }
  ],
  "outcome": {
    "disposition": "remanded",
    "summary": "Appeal allowed; judgment and decree dated September 25, 1957 of Allahabad High Court set aside; First Appeal No. 232 of 1942 remitted to High Court for hearing on merits. CMP No. 2219 of 1964 dismissed except striking off respondents 8-12.",
    "relief_granted": "Remand to High Court for decision on merits of alienation (whether with legal necessity); names of respondents 8-12 struck off.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"S. 14 of the Hindu Succession Act, 1956 did not extend to property already alienated by a Hindu female.\"",
      "speaker": "court",
      "significance": "Core holding rejecting High Court's view on abolition of reversionary rights."
    },
    {
      "text": "\"The heirs of the widow were not necessary parties to a suit against the alienee either for a declaration that the alienation is void beyond her lifetime or for possession.\"",
      "speaker": "court",
      "significance": "Resolves preliminary objection on defective constitution of appeal."
    }
  ],
  "_case_id": "1965_33",
  "_label": 1,
  "_text_length": 14731,
  "_extracted_at": "2026-02-10T19:25:02.961797"
}