{
  "metadata": {
    "case_name": "Lala Shri Bhagwan and Shrimati Gopal Devi v. Ram Chand and Kailash Chand",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, C.J."
    ],
    "case_number": "Civil Appeal No. 764 of 1954",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Respondents are tenants of premises bearing municipal No. 863 at Jumna Kinara Road, Agra, commonly known as Putaria Mahal. Predecessors let into possession by appellants on monthly rent of Rs. 58-4-0 from Sudi 1 to Badi 15 of Hindi month.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellants applied to Rent Controller and Eviction Officer under s.3 of the Act for permission to file ejectment suit. Permission granted on September 1, 1951.",
      "type": "procedural",
      "date": "1951-09-01",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Respondents appealed to Additional District Magistrate (authorised by District Magistrate). Appellate authority remanded case to Officer for fresh hearing.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Officer on re-hearing rejected appellants' application on August 9, 1952.",
      "type": "procedural",
      "date": "1952-08-09",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Appellants appealed again to appellate authority, which granted permission on December 9, 1952.",
      "type": "procedural",
      "date": "1952-12-09",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondents filed revision before Commissioner of Agra, who allowed it and set aside appellate order on February 4, 1953.",
      "type": "procedural",
      "date": "1953-02-04",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellants moved State Government under s.7-F. State Government directed Commissioner to revise order on May 7, 1953, finding appellants' need genuine.",
      "type": "procedural",
      "date": "1953-05-07",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Commissioner, pursuant to direction, cancelled previous order and confirmed appellate authority's permission on July 28, 1953.",
      "type": "procedural",
      "date": "1953-07-28",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellants filed ejectment suit in Civil Judge, Agra. Trial court framed issues including validity of permission, found in favour of appellants, decreed ejectment on August 31, 1957.",
      "type": "procedural",
      "date": "1957-08-31",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Respondents appealed to First Additional Civil Judge, Agra. Appeal dismissed on May 30, 1959, confirming all findings.",
      "type": "procedural",
      "date": "1959-05-30",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Respondents filed second appeal to Allahabad High Court. Single Judge held permission invalid as State Government under s.7-F did not hear respondents, allowed appeal, dismissed suit. Parties to bear own costs.",
      "type": "procedural",
      "date": "1963-05-09",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the revisional order passed by the State Government under s.7-F of the Uttar Pradesh Temporary Control of Rent and Eviction Act, 1947, is invalid for not hearing the respondents affected by it.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the jurisdiction under s.7-F is quasi-judicial requiring principles of natural justice, or purely administrative.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Revisional order under s.7-F by State Government is purely administrative, not quasi-judicial; no obligation to hear parties. Relied on prior Allahabad High Court Division Bench decisions holding it administrative.",
      "supporting_facts": [
        "f7",
        "f8",
        "f11"
      ],
      "legal_basis": "s.7-F of the Act; prior Allahabad HC decisions"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "State Government under s.7-F exercised quasi-judicial authority, bound to follow principles of natural justice by giving opportunity to be heard before passing order.",
      "supporting_facts": [
        "f7",
        "f8"
      ],
      "legal_basis": "Principles of natural justice; s.7-F of the Act; Laxman Purshottam Pimputkar v. State of Bombay"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Examined scheme of Act: s.3 protects tenants from eviction except on specified grounds or with District Magistrate permission. Permission takes case outside s.3(1) clauses.",
      "addresses_issue": "i2",
      "key_observation": "District Magistrate's power affects tenants' statutory rights."
    },
    {
      "id": "cr2",
      "text": "District Magistrate must indicate reasons for order to enable Commissioner's revision under s.3(3); must hear parties to weigh pros and cons.",
      "addresses_issue": "i2",
      "key_observation": "Proceedings before DM and Commissioner are quasi-judicial."
    },
    {
      "id": "cr3",
      "text": "s.3(3) requires Commissioner to hear application and decide on correctness, legality, propriety; revisional power for ends of justice.",
      "addresses_issue": "i2",
      "key_observation": "Confirms quasi-judicial nature."
    },
    {
      "id": "cr4",
      "text": "State Government under s.7-F must also act quasi-judicially as proceedings partake same character; must give opportunity to parties for ends of justice.",
      "addresses_issue": "i1",
      "key_observation": "Power determines rights affecting citizens; natural justice applies."
    },
    {
      "id": "cr5",
      "text": "Act's policy protects tenants; permission deprives statutory right not to be evicted except on grounds in s.3(1).",
      "addresses_issue": "i2",
      "key_observation": "Authorities must act judicially."
    },
    {
      "id": "cr6",
      "text": "Disagrees with Allahabad HC Division Benches (Narettam Saran, Murlidhar); partly relies on Laxman but notes scheme differences.",
      "addresses_issue": "i2",
      "key_observation": "Prior HC view erroneous."
    },
    {
      "id": "cr7",
      "text": "Single Judge should have referred to larger Bench instead of reconsidering Division Bench views himself.",
      "addresses_issue": "i1",
      "key_observation": "Judicial propriety requires reference."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Proceedings before District Magistrate under s.3(2), Commissioner under s.3(3), and State Government under s.7-F are quasi-judicial; must follow principles of natural justice including hearing parties.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Revisional order under s.7-F invalid without opportunity to respondents to be heard; permission invalid, suit incompetent.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Laxman Purshottam Pimputkar v. State of Bombay",
      "citation": "1964 1 S.C.R. 200",
      "treatment": "followed",
      "relevance": "Revisional jurisdiction under similar Act quasi-judicial, requires natural justice."
    },
    {
      "case_name": "Associated Cement Companies Ltd., Bhupendra Cement Works, Surajpur v. P.N. Sharma",
      "citation": "1965 2 S.C.R. 366",
      "treatment": "followed",
      "relevance": "Test for when principles of natural justice apply depends on nature of jurisdiction and power."
    },
    {
      "case_name": "Ridge v. Baldwin",
      "citation": "L.R. 1964 A.C. 40",
      "treatment": "followed",
      "relevance": "Extent of natural justice depends on nature of jurisdiction."
    },
    {
      "case_name": "Narettam Saran v. State of U.P.",
      "citation": "A.I.R. 1954 All. 232",
      "treatment": "distinguished",
      "relevance": "Held powers under ss.3 and 7-F administrative; SC disagrees."
    },
    {
      "case_name": "Murlidhar v. State of U.P.",
      "citation": "1964 All. 148",
      "treatment": "overruled",
      "relevance": "Re-affirmed earlier view that powers administrative; SC disagrees."
    }
  ],
  "statutes_cited": [
    {
      "name": "Uttar Pradesh Temporary Control of Rent and Eviction Act, 1947",
      "sections": [
        "s.3",
        "s.3(1)",
        "s.3(2)",
        "s.3(3)",
        "s.3(4)",
        "s.7-F",
        "s.7",
        "s.7-A",
        "s.14",
        "s.15"
      ],
      "relevance": "Controls eviction; permission under s.3(2) exception to grounds in s.3(1); revision chain to Commissioner and State Govt under s.7-F; quasi-judicial throughout."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld Allahabad High Court's single Judge decision that State Government's revisional order under s.7-F was invalid for violating natural justice by not hearing respondents; permission to sue invalid; appellants' suit dismissed.",
    "relief_granted": "Suit dismissed; parties bear own costs throughout.",
    "costs": "Parties to bear their own costs."
  },
  "key_quotes": [
    {
      "text": "The short question of law which arises in this appeal by special leave is whether the revisional order passed by the State Government of Uttar Pradesh under s. 7-F ... is rendered invalid by reason of the fact that before passing the said order, the State Government did not hear the two respondents...",
      "speaker": "court",
      "significance": "Frames the core issue."
    },
    {
      "text": "If it appears that the authority or body has been given power to determine questions affecting the rights of citizens, the very nature of the power would inevitably impose the limitation that the power should be exercised in conformity with the principles of natural justice.",
      "speaker": "court",
      "significance": "Key principle applied to hold quasi-judicial nature."
    },
    {
      "text": "We are satisfied that when the District Magistrate exercises his authority under s.3(2) and the Commissioner exercises his revisional power under s.3(3), they must act according to the principles of natural justice.",
      "speaker": "court",
      "significance": "Extends to State Government under s.7-F."
    }
  ],
  "_case_id": "1965_16",
  "_label": 0,
  "_text_length": 27758,
  "_extracted_at": "2026-02-10T19:24:27.125282"
}