{
  "metadata": {
    "case_name": "Commissioner of Agricultural Income-tax v. The Company",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Satyanarayana Raju, J."
    ],
    "case_number": "Appeal by special leave against High Court of Kerala in Income-tax Reference Case No. 48/62",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent is a company which owned a rubber estate purchased by it along with the plantation thereon. The estate included rubber trees which, at the time of purchase, were in a condition of producing latex.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The rubber trees were sold by the company after they ceased to yield latex any further.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "In computing its agricultural income for the accounting year ending February 28, 1959, relevant to the assessment year 1959-60, for the purposes of the Kerala Agricultural Income-tax Act, 1950, the Assistant Commissioner of Agricultural Income-tax, by his order dated February 2, 1962, included the sum of Rs. 8,532.50 representing the sale proceeds of rubber trees which were cut down and sold after they became useless.",
      "type": "procedural",
      "date": "1959-02-28",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The respondent appealed to the Deputy Commissioner of Agricultural Income-tax and Sales Tax, Quilon, objecting, inter alia, to the inclusion of the amount in computing its agricultural income. By order dated November 30, 1960, the Deputy Commissioner rejected the contention of the respondent.",
      "type": "procedural",
      "date": "1960-11-30",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The respondent thereupon preferred a second appeal to the Agricultural Income-tax Appellate Tribunal, Trivandrum. By its order dated August 18, 1962, the Tribunal accepted the contention of the respondent and held that the sum of Rs. 8,532.50 representing the sale proceeds of rubber trees cut down and sold after they had become useless was not taxable as income, but was merely a capital receipt.",
      "type": "procedural",
      "date": "1962-08-18",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On the application of the appellant, the Tribunal stated a case to the Kerala High Court and referred the following two questions of law for its opinion.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The learned judges of the Division Bench of the High Court by their judgment dated August 2, 1963, answered the two questions in the affirmative and in favour of the respondent.",
      "type": "procedural",
      "date": "1963-08-02",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The appellant thereupon obtained special leave to appeal to this Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "There was enough evidence in the record justifying the High Court's conclusion that the rubber trees formed part of the capital assets of the respondent. Admittedly, the respondent did not grow the rubber trees for the purpose of selling them. It was getting income from these rubber trees in the shape of latex. In course of time the rubber trees became old and unyielding. When the trees were no longer productive of latex, the respondent felled them and sold them.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the sale proceeds of old and unyielding rubber trees grown and used for obtaining income as latex therefrom are capital receipts?",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether the sale proceeds of unyielding trees purchased many years back as yielding trees are capital receipts?",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The appellant's contention mainly is that the sum of Rs. 8,532.50 was in the nature of a revenue receipt and had to be included in computing the agricultural income.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The contention of the respondent is that the sale proceeds of the rubber trees which have been planted for the purpose of yielding latex, but were cut down and sold after they had ceased to yield any further, could not be in the nature of revenue receipts.",
      "supporting_facts": [
        "f1",
        "f2",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The definition of agricultural income in section 2(a) of the Kerala Agricultural Income-tax Act, 1950, hereinafter called the Act, defines agricultural income as (1) any rent or revenue derived from land which is used for agricultural purposes (2) any income derived from such land in the State by (i) agriculture, or (ii) the performance by a cultivator or a receiver of rent-in-kind to render the produce raised or received by him fit to be taken to market, or (iii) the sale by a cultivator or receiver of rent-in-kind of the produce raised or received by him, in respect of which no process has been performed other than a process of the nature described in sub-clause (ii).",
      "addresses_issue": "i1",
      "key_observation": "The definition of agricultural income in section 2 does not include proceeds from the sale of rubber trees in an estate which were utilised for the purpose of deriving income in the shape of latex."
    },
    {
      "id": "cr2",
      "text": "There was enough evidence in the record justifying the High Court's conclusion that the rubber trees formed part of the capital assets of the respondent. Admittedly, the respondent did not grow the rubber trees for the purpose of selling them. It was getting income from these rubber trees in the shape of latex. In course of time the rubber trees became old and unyielding. When the trees were no longer productive of latex, the respondent felled them and sold them.",
      "addresses_issue": "i1",
      "key_observation": "The rubber trees formed part of the capital assets of the respondent."
    },
    {
      "id": "cr3",
      "text": "The Appellate Tribunal and the High Court were, therefore, right in holding that the sale proceeds of these trees should be treated as capital receipt and not taxable as agricultural income.",
      "addresses_issue": "i1",
      "key_observation": "Sale proceeds are capital receipts."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The sale proceeds of old and unyielding rubber trees grown and used for obtaining income as latex therefrom are capital receipts and not taxable as agricultural income.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The sale proceeds of unyielding trees purchased many years back as yielding trees are capital receipts and not taxable as agricultural income.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Kerala Agricultural Income-tax Act, 1950 (XXII of 1950)",
      "sections": [
        "Section 2(a)"
      ],
      "relevance": "Defines agricultural income, which does not include proceeds from the sale of rubber trees utilised for deriving income in the shape of latex; sale proceeds treated as capital receipts."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Kerala High Court and Tribunal, holding that the sale proceeds of Rs. 8,532.50 from old and unyielding rubber trees are capital receipts and not taxable as agricultural income under the Kerala Agricultural Income-tax Act, 1950.",
    "relief_granted": "Appeal dismissed in favour of respondent; no inclusion of sale proceeds in agricultural income.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The definition of agricultural income in section 2 does not include proceeds from the sale of rubber trees in an estate which were utilised for the purpose of deriving income in the shape of latex.",
      "speaker": "court",
      "significance": "Core reasoning on why sale proceeds are not agricultural income."
    },
    {
      "text": "There was enough evidence in the record justifying the High Court's conclusion that the rubber trees formed part of the capital assets of the respondent.",
      "speaker": "court",
      "significance": "Justifies treatment as capital receipt."
    },
    {
      "text": "The Appellate Tribunal and the High Court were, therefore, right in holding that the sale proceeds of these trees should be treated as capital receipt and not taxable as agricultural income.",
      "speaker": "court",
      "significance": "Affirms lower courts' decisions."
    }
  ],
  "_case_id": "1965_221",
  "_label": 0,
  "_text_length": 4346,
  "_extracted_at": "2026-02-10T19:26:56.823686"
}