{
  "metadata": {
    "case_name": "Revenue v. Assessee-company",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Civil Appeal No. 150 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "By a registered lease deed dated March 31, 1950, the assessee-company leased out Panbari Tea Estate (320 acres) and Barchola Tea Estate (305 acres), along with machinery and buildings, to Messrs. Hiralal Ramdas for 10 years commencing January 1, 1950.",
      "type": "material",
      "date": "1950-03-31",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Lease consideration: premium of Rs. 2,25,000/- (Rs. 45,000/- lump sum at execution; balance Rs. 1,80,000/- in 16 half-yearly instalments of Rs. 11,250/- on or before January 31 and July 31 each year) and annual rent of Rs. 54,000/- (Rs. 1,000/- monthly totalling Rs. 12,000/- yearly; balance Rs. 42,000/- by December 31).",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On February 25, 1957, for assessment year 1952-53, Income-tax Officer assessed instalment of Rs. 11,250/- paid towards premium as revenue receipt.",
      "type": "procedural",
      "date": "1957-02-25",
      "source": "lower_court"
    },
    {
      "id": "f4",
      "text": "Appellate Assistant Commissioner confirmed ITO's order on appeal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Income-tax Appellate Tribunal held premium was really rent, chargeable to income-tax.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "At instance of assessee, Tribunal referred question to Assam High Court under s. 66 of Income-tax Act, 1922: 'Whether on the facts and in the circumstances of the case and upon the construction of the terms of the lease, dated 31st March 1950, the sum of Rs. 11,250/- received by the assessee during the year of account is revenue or capital receipt.'",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Assam High Court, by judgment dated March 22, 1960, in Income-tax Reference No. 7 of 1959, held Rs. 11,250/- was capital receipt.",
      "type": "procedural",
      "date": "1960-03-22",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Revenue filed appeal to Supreme Court on certificate issued by High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Clause 8 of lease deed provides for lessor's right to re-enter upon default in instalments of premium or rent, without prejudice to rights to recover balance of unpaid instalment of premium or rent.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Published accounts of assessee-company show profits before and after lease: e.g., year ended 31-3-1950: profit Rs. 47,734, net Rs. 29,866; 31-3-1952: net Rs. 17,686 (adjusted to Rs. 45,809 after adding back expenditures).",
      "type": "background",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the amount described as premium in the lease deed (Rs. 11,250/- instalment) is really rent and therefore a revenue receipt, or a capital receipt.",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Premium was really rent payable under the lease deed.",
      "supporting_facts": [
        "f2",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Clause 8 entitles lessor only to recover balance of unpaid instalment of premium upon re-entry, not entire balance, indicating premium is rent.",
      "supporting_facts": [
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Income received post-lease (premium instalments + rent) not higher than pre-lease profits, indicating split of rent into premium for tax avoidance.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Distinction between premium (capital, single payment or instalments for right to enjoy lease benefits) and rent (revenue, periodical for continuous enjoyment), per Judicial Committee in Raja Bahadur Kamakshya Narain Singh v. CIT.",
      "addresses_issue": "i1",
      "key_observation": "Salami/premium is consideration for being let into possession, capital receipt."
    },
    {
      "id": "cr2",
      "text": "Tests for salami: single/non-recurring character, payment prior to tenancy creation; can be in instalments; per Sindhurani Chaudhurani and Chintamani Saran Nath Sah Deo.",
      "addresses_issue": "i1",
      "key_observation": "Real test is whether amount is consideration for being let into possession."
    },
    {
      "id": "cr3",
      "text": "S. 105 Transfer of Property Act distinguishes premium (price for transfer of right) from rent (periodical payments).",
      "addresses_issue": "i1",
      "key_observation": "Substance over form; nomenclature helps ascertain intention."
    },
    {
      "id": "cr4",
      "text": "Lease transfers substantive interest for 10 years; premium Rs. 2,25,000/- for transfer, rent Rs. 54,000/- annual for use; parties used terms deliberately; instalments accommodate lessee.",
      "addresses_issue": "i1",
      "key_observation": "No camouflage; premium spread over 10 years Rs. 22,500/- p.a., reasonable."
    },
    {
      "id": "cr5",
      "text": "Clause 8 default provision saves all rights including recovery of premium instalments; does not override main terms.",
      "addresses_issue": "i1",
      "key_observation": "Poor drafting does not change substance."
    },
    {
      "id": "cr6",
      "text": "Profit comparison lacks material to conclude camouflage; circumstances confirm premium description.",
      "addresses_issue": "i1",
      "key_observation": "No direct or circumstantial material to displace lease description."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Rs. 11,250/- received towards premium is capital receipt, not revenue.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Raja Bahadur Kamakshya Narain Singh of Ramgarh v. Commissioner of Income-tax, Bihar Orissa",
      "citation": "(1943) 11 I.T.R. 513",
      "treatment": "followed",
      "relevance": "Distinction between salami (capital) and royalties (revenue); salami for acquisition of lessee's right."
    },
    {
      "case_name": "Member for the Board of Agriculture Income-tax, Assam v. Sindhurani Chaudhurani",
      "citation": "(1957) 32 I.T.R. 169",
      "treatment": "followed",
      "relevance": "Indicia of salami: single/non-recurring, prior to tenancy; capital receipt."
    },
    {
      "case_name": "Chintamani Saran Nath Sah Deo v. Commissioner of Income-tax, Bihar Orissa",
      "citation": null,
      "treatment": "followed",
      "relevance": "Salami as consideration for new tenancy/right to capital asset."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act, 1922",
      "sections": [
        "s. 66(1)"
      ],
      "relevance": "Reference of question to High Court by Tribunal."
    },
    {
      "name": "Transfer of Property Act",
      "sections": [
        "s. 105"
      ],
      "relevance": "Defines lease, distinguishes premium (price for transfer of right) from rent (periodical payments)."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the Revenue's appeal, holding that the High Court correctly answered the reference question in favour of the assessee, confirming Rs. 11,250/- as capital receipt.",
    "relief_granted": "Assessee's position upheld; premium not taxable as revenue.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'Salami is a single payment made for the acquisition of the right of the lessee to enjoy the benefits granted to them by the lease. That general right may properly be regarded as a capital asset...'",
      "speaker": "court",
      "significance": "Defines premium/salami as capital from Judicial Committee precedent."
    },
    {
      "text": "'The real test is whether the said amount paid in a lump sum or in instalments is the consideration paid by the tenant for being let into possession.'",
      "speaker": "court",
      "significance": "Core test applied to distinguish premium from rent."
    },
    {
      "text": "'It is not the form but the substance of the transaction that matters.'",
      "speaker": "court",
      "significance": "Emphasizes substance over nomenclature in tax characterization."
    }
  ],
  "_case_id": "1965_302",
  "_label": 0,
  "_text_length": 13592,
  "_extracted_at": "2026-02-10T19:28:11.215774"
}