{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Trivikram Narain Singh (HUF)",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeal No. 68 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Assessee is a Hindu undivided family headed by Sri Trivikram Narain Singh, descendant of Sri Babu Ausan Singh, original founder and owner of Ausanganj State in district of Benaras.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "District of Benaras was part of Oudh territory; by Treaty in 1775 between East India Company and Nawab Asfuddaula, province ceded to British Government.",
      "type": "background",
      "date": "1775",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "British Government granted sanad of Raj to Raja Chet Singh, who gave Jagir of Parganas Seyedpore and Bhittery in perpetuity to Babu Ausan Singh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In 1796, disputes between Babu Ausan Singh and Zamindars referred to Board of Revenue in Calcutta.",
      "type": "background",
      "date": "1796",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Disputes ended in 1837 by agreement between British Government and then Jagirdar Hat Narain Singh; Government granted pension of Rs. 36,322/8/- to Babu Hat Narain Singh and heirs in perpetuity, calculated on basis of 1/4th of revenue of Jagir.",
      "type": "material",
      "date": "1837-07-07",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Letter dated 7th July 1837 from H. Elliot, Secretary Sadar Board of Revenue, determining pension amount.",
      "type": "material",
      "date": "1837-07-07",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "By arrangement, revenue or land collections of Jagir payable by Zamindars direct to Government; Jagirdar no longer proprietor but entitled to pension.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Pension paid regularly from year to year by Government to Babu Har Narain Singh and his heirs.",
      "type": "admitted",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "During previous year of assessment year 1949-50, assessee received Rs. 36,396/- on account of the pension.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Income-tax Officer held sum is regular annual income, not agricultural income, arising from statutory obligation of Government.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Assessee appealed to Appellate Assistant Commissioner, who held it is agricultural income under Section 2(1) of Income-tax Act.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Income-tax Officer appealed to Income-tax Appellate Tribunal, which held sum chargeable to tax, not agricultural income; source is Government's liability for extinguishing proprietary rights.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Allahabad High Court in Income-tax Reference No. 307 of 1957 answered question in negative on 27th July 1959.",
      "type": "procedural",
      "date": "1959-07-27",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "High Court held letter of 1837 conferred right to share of one-fourth in net land revenue collections; amount varied year to year.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "Certificate granted by Allahabad High Court under s.66A of Income-tax Act for appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on true interpretation of clause (viii) of sub-section (3) of section 4 of the Indian Income-tax Act, the sum of Rs. 36,396/- received by assessee as allowance during previous year of assessment year 1949-50 is revenue income liable to tax under Indian Income-tax Act, 1922?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the pension/allowance is agricultural income under s.2(1)(a) of the Act.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the allowance is taxable income or a capital receipt.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "According to true interpretation of letter dated July 7, 1837, no right in land revenue granted to assessee; relies on State of Uttar Pradesh v. Kunwar Sri Trivikram Narain Singh.",
      "supporting_facts": [
        "f5",
        "f6",
        "f13"
      ],
      "legal_basis": "State of Uttar Pradesh v. Kunwar Sri Trivikram Narain Singh (1962) 3 S.C.R. 213"
    },
    {
      "id": "pa2",
      "text": "Pension arises from statutory obligation of Government; immediate source is Government's obligation, not land.",
      "supporting_facts": [
        "f7",
        "f10"
      ],
      "legal_basis": "C.I.T. v. Raja Bahadur Kamakhaya Narain Singh, 16 I.T.R. 325"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Letter dated July 7, 1837 shows arrangement for sharing collections; right to one-fourth of land revenue collections granted in perpetuity.",
      "supporting_facts": [
        "f5",
        "f6",
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Allowance is capital receipt, being compensation for relinquishing title to lands; quality of income, not periodicity, matters; disregard word 'pension'.",
      "supporting_facts": [
        "f5",
        "f7"
      ],
      "legal_basis": "Commissioner of Inland Revenue v. Wesleyan and General Assurance Society; Perrin v. Dickson"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Adopts reasoning in State of Uttar Pradesh v. Kunwar Sri Trivikram Narain Singh: no interest in land or land revenue acquired; allowance fixed as percentage of land revenue but merely a measure.",
      "addresses_issue": "i1",
      "key_observation": "Under arrangement, entire land revenue collected by Government; Jagirdar had no interest or obligation."
    },
    {
      "id": "cr2",
      "text": "Source of income is 1837 arrangement extinguishing proprietary rights, not land or revenue; immediate and effective source not land.",
      "addresses_issue": "i2",
      "key_observation": "Word 'derived' demands enquiry into genealogy but stops at effective source."
    },
    {
      "id": "cr3",
      "text": "Pension not agricultural income as not rent or revenue derived from land used for agricultural purposes.",
      "addresses_issue": "i2",
      "key_observation": "Follows Privy Council and SC precedents: e.g., annual payment under contract not agricultural even if secured by land charge."
    },
    {
      "id": "cr4",
      "text": "Allowance is taxable income: exchange of capital asset (estate) for perpetual annuity is ordinarily taxable; not instalments of capital sum.",
      "addresses_issue": "i3",
      "key_observation": "No material shows it is payment in instalments of value of title in 1837; real character is income payment."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Assessee acquired no interest in land or land revenue under 1837 arrangement.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Pension/allowance not agricultural income under s.2(1)(a) as source is 1837 arrangement, not land.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Allowance is taxable revenue income, not capital receipt.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "State of Uttar Pradesh v. Kunwar Sri Trivikram Narain Singh",
      "citation": "1962 3 S.C.R. 213",
      "treatment": "followed",
      "relevance": "Interpreted 1837 letter: no interest in land or revenue; allowance related but not derived from land revenue."
    },
    {
      "case_name": "C.I.T. v. Raja Bahadur Kamakhaya Narain Singh",
      "citation": "16 I.T.R. 325",
      "treatment": "followed",
      "relevance": "Genealogy of income: immediate source is Government obligation, not land."
    },
    {
      "case_name": "Maharajkumar Gopal Saran Narain Singh v. Commissioner of Income-tax, Bihar and Orissa",
      "citation": "3 I.T.R. 237",
      "treatment": "followed",
      "relevance": "Annual payment under contract not agricultural income though secured by land charge."
    },
    {
      "case_name": "Mrs. Bacha Guzdar v. Commissioner of Income-tax, Bombay",
      "citation": "27 I.T.R. 1",
      "treatment": "followed",
      "relevance": "Agricultural income refers to revenue by direct association with land, not indirect."
    },
    {
      "case_name": "Maharajadhiraja Sir Kameshwar Singh v. Commissioner of Income-tax, Bihar and Orissa",
      "citation": "41 I.T.R. 169",
      "treatment": "followed",
      "relevance": "Source of right determines if agricultural; remuneration as % of income not agricultural."
    },
    {
      "case_name": "Commissioner of Inland Revenue v. Wesleyan and General Assurance Society",
      "citation": "30 T.C. 11",
      "treatment": "referred",
      "relevance": "Real character of payment matters, not name; substance over form rejected."
    },
    {
      "case_name": "Duke of Westminster v. Commissioner of Inland Revenue",
      "citation": "19 T.C. 490",
      "treatment": "referred",
      "relevance": "Doctrine of substance exploded; form matters unless true construction differs."
    },
    {
      "case_name": "Perrin v. Dickson",
      "citation": null,
      "treatment": "distinguished",
      "relevance": "Annuity not always taxable, but here no evidence of capital instalments."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s.66A",
        "s.4(3)(viii)",
        "s.2(1)(a)"
      ],
      "relevance": "Reference under Act; question if allowance is agricultural income exempt under s.4(3)(viii); defined in s.2(1)(a) as rent/revenue from agricultural land."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeal, holding the pension/allowance received by assessee is not agricultural income and is taxable as revenue income, not capital receipt, reversing High Court.",
    "relief_granted": "Appeal allowed in favor of Revenue.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Because the annual allowance is equal to a fourth share of the net revenue of the mahals, the right of the respondent does not acquire the character of an interest in land or in land revenue.\"",
      "speaker": "court",
      "significance": "From adopted SC precedent; crux that no proprietary interest remains."
    },
    {
      "text": "\"The word 'derived' is not a term of art. Its use in the definition indeed demands an enquiry into the genealogy of the product. But the enquiry should stop as soon as the effective source is discovered.\"",
      "speaker": "court",
      "significance": "Test for agricultural income: immediate source, not remote."
    },
    {
      "text": "\"It seems to us that in this case the source of income is clearly the arrangement arrived at in 1837 and, therefore, it is not agricultural income as defined in the Act.\"",
      "speaker": "court",
      "significance": "Direct holding on exemption."
    }
  ],
  "_case_id": "1965_348",
  "_label": 1,
  "_text_length": 15862,
  "_extracted_at": "2026-02-10T19:29:01.504220"
}