{
  "metadata": {
    "case_name": "Bhaiyalal v. Harikishan Singh",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, C.J."
    ],
    "case_number": "Civil Appeal No. 765 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appeal by special leave from judgment and order dated April 23, 1963, of Madhya Pradesh High Court in First Appeal No. 24 of 1963.",
      "type": "procedural",
      "date": "1963-04-23",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Election held in February 1962 for reserved seat in Berasia Constituency, district of Sehore, Madhya Pradesh.",
      "type": "background",
      "date": "1962-02",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Appellant Bhaiyalal, respondent No. 1 Harikishan Singh, and three others were candidates.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellant declared duly elected on 26th February 1962, having polled highest votes; respondent No. 1 was next rival.",
      "type": "material",
      "date": "1962-02-26",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Respondent No. 1 filed election petition challenging validity of appellant's election on ground that appellant belonged to Dohar caste, not Chamar scheduled caste.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Appellant filed nomination paper on 19th January 1962 before Returning Officer at Sehore, declaring himself member of Chamar scheduled caste of Madhya Pradesh in relation to Sehore district; declaration accepted by Returning Officer.",
      "type": "material",
      "date": "1962-01-19",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Respondent No. 1 contended Dohar caste not recognised as scheduled caste for Sehore and Raisen districts; Returning Officer improperly accepted declaration.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Appellant contended election petition not maintainable as respondent No. 1 did not deposit security of Rs. 2,000 as prescribed.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f9",
      "text": "Election Tribunal framed issues: first four on validity of nomination as Chamar; fifth on competence of petition.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Both parties led oral and documentary evidence; Tribunal found for respondent No. 1 on caste issue and against appellant on security deposit; allowed petition, declared election invalid.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Appellant appealed to Madhya Pradesh High Court; High Court confirmed Tribunal's findings on both points, dismissed appeal on 23rd April 1963.",
      "type": "procedural",
      "date": "1963-04-23",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Appellant's case: Dohar Chamar is sub-caste of Chamar scheduled caste, also called Mochi.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f13",
      "text": "Respondent No. 1 examined 13 witnesses from appellant's caste asserting Dohar different from Chamar; no intercaste marriage or dining; lived in different mohallas.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "Kishanlal (P.W. 4), Secretary of Dohar Samaj started by appellant (appellant was Sarpanch), stated Dohar and Chamar entirely different; no inter-dining/marriage; Dohars not Mochis; Chamars do leather work.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Respondent produced documents Exts. P.2 to P.5 (1956, signed by appellant describing himself as Dohar, not Chamar); other documents P.8, P.10 etc. similar.",
      "type": "material",
      "date": "1956",
      "source": "respondent"
    },
    {
      "id": "f16",
      "text": "Appellant examined himself and witnesses claiming Dohar same as Mochi, sub-caste of Chamar; produced 22 documents, some accepted by High Court but insufficient to prove sub-caste.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f17",
      "text": "Constitution (Scheduled Castes) Order, 1950 specifies Chamar, Jatav or Mochi for relevant area.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether appellant belonged to Chamar scheduled caste entitling him to contest reserved seat.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether election petition maintainable due to security deposit.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Whether plea that Dohar is sub-caste of Chamar permissible under Article 341.",
      "framed_by": "court"
    },
    {
      "id": "i4",
      "text": "Whether President can specify Scheduled Castes by reference to districts or sub-areas.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellant is Dohar Chamar, sub-caste of Chamar scheduled caste, also called Mochi.",
      "supporting_facts": [
        "f12",
        "f16"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Election petition not maintainable, no security deposit of Rs. 2000.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "statutory rules"
    },
    {
      "id": "pa3",
      "text": "President cannot specify lists of Scheduled Castes by reference to districts/sub-areas; must be for entire State.",
      "supporting_facts": [],
      "legal_basis": "Article 341(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Dohar caste distinct from Chamar; not recognised as scheduled caste for Sehore/Raisen; no intercaste relations.",
      "supporting_facts": [
        "f5",
        "f7",
        "f13",
        "f14",
        "f15"
      ],
      "legal_basis": "Constitution (Scheduled Castes) Order, 1950"
    },
    {
      "id": "ra2",
      "text": "Security deposit made in accordance with statutory requirements.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "statutory rules"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Concurrent findings of fact by Tribunal and High Court on caste against appellant; no reason to interfere.",
      "addresses_issue": "i1",
      "key_observation": "Both courts considered oral and documentary evidence; respondent's evidence including Kishanlal (P.W.4) and documents compelling."
    },
    {
      "id": "cr2",
      "text": "Plea that Dohar is sub-caste of Chamar not permissible under Article 341; must look only to Presidential notification listing Chamar, Jatav or Mochi.",
      "addresses_issue": "i3",
      "key_observation": "No modification by evidence; normal rule against showing sub-castes included."
    },
    {
      "id": "cr3",
      "text": "Election petition valid; security deposit compliant.",
      "addresses_issue": "i2",
      "key_observation": "High Court confirmed Tribunal."
    },
    {
      "id": "cr4",
      "text": "President authorised under Article 341(1) to specify by districts/areas based on backwardness varying regionally.",
      "addresses_issue": "i4",
      "key_observation": "Object to provide protection considering local backwardness."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant does not belong to Chamar caste; not qualified for reserved seat.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Sub-caste plea not entertainable under Article 341; determination by Presidential Order only.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "President can specify Scheduled Castes by reference to areas/districts.",
      "resolves_issue": "i4",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "B. Basavalingappa v. Munichinnappa",
      "citation": "1965 1 S.C.R. 316",
      "treatment": "referred",
      "relevance": "Similar question on whether enquiry into caste equivalence permissible; normal rule against modification by evidence of sub-castes."
    }
  ],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 341",
        "Article 341(1)",
        "Article 341(2)"
      ],
      "relevance": "Defines Scheduled Castes via Presidential Order; no variation except by Parliament; allows specification by parts/groups/areas."
    },
    {
      "name": "Constitution (Scheduled Castes) Order, 1950",
      "sections": [
        "Entry specifying Chamar, Jatav or Mochi for relevant districts"
      ],
      "relevance": "Determines scheduled castes for Sehore; Dohar not included."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, confirming High Court and Tribunal; held appellant not belonging to Chamar scheduled caste, election invalid.",
    "relief_granted": "Election petition allowed; appellant's election declared invalid.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "in order to determine whether or not a particular caste is a scheduled caste within the meaning of Art. 341, one has to look at the public notification issued by the President in that behalf.",
      "speaker": "court",
      "significance": "Core holding on interpretation of Article 341."
    },
    {
      "text": "it may be accepted that it is not open to make any modification in the Order by producing evidence to show... that though caste A alone is mentioned in the Order, caste B is also a part of caste A.",
      "speaker": "court",
      "significance": "Rejects sub-caste plea based on precedent."
    },
    {
      "text": "the Dohar and the Chamar castes are entirely different. The Chamars... take off skins from dead animals, prepare shoes and do leather work the Dohar... is not the sub-caste of Chamar caste.",
      "speaker": "respondent_counsel",
      "significance": "Key witness evidence relied upon by court."
    }
  ],
  "_case_id": "1965_229",
  "_label": 0,
  "_text_length": 16020,
  "_extracted_at": "2026-02-10T19:26:59.550324"
}