{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. M/s Jaipuria China Clay Mines P. Ltd.",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "C. A. No. 307 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Income Tax Officer assessed the assessee, M/s Jaipuria China Clay Mines P. Ltd., for the year 1952-53, computing total income at Rs. 14,041/- before charging depreciation.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "From Rs. 14,041/-, ITO deducted depreciation for the year amounting to Rs. 5,360/-, computing profit of Rs. 8,681/-.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "From Rs. 8,681/- profit, ITO deducted equivalent amount Rs. 8,681/- in respect of losses during 1947-48, working out business income as nil.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "ITO computed dividend income at Rs. 2,01,130/- and determined total income at this figure, levying tax on it.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Assessee had unabsorbed depreciation aggregating to Rs. 76,857/- from past years, contended it should be deducted from dividend income, reducing total income to Rs. 1,32,955/-.",
      "type": "disputed",
      "date": null,
      "source": "assessee"
    },
    {
      "id": "f6",
      "text": "Income Tax Officer refused to allow deduction of unabsorbed depreciation from dividend income.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appellant Assistant Commissioner upheld the order of the Income Tax Officer.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Assessee's appeal to the Appellate Tribunal was dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellate Tribunal referred the question to Calcutta High Court under s. 66 of the Indian Income Tax Act, 1922, at instance of assessee.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Calcutta High Court, by judgment dated 6th February 1962 in Income Tax Reference No. 72 of 1957, accepted assessee's contention and answered the question in favour of the assessee.",
      "type": "procedural",
      "date": "1962-02-06",
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "High Court granted certificate for appeal to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in the facts and circumstances of the case, the unabsorbed depreciation of the past years should be added to the depreciation of the current year and the aggregate of the unabsorbed depreciation and the current years depreciation be deducted from the total income of the previous year relevant for the assessment year 1952-53.",
      "framed_by": "appellate_tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Depreciation, although a permissible allowance under s. 10(2) of the Act, serves to compensate an assessee for the capital loss suffered by way of depreciation of his assets and is a charge on the profits of a business.",
      "supporting_facts": [],
      "legal_basis": "Sections 10(2), 24(1)"
    },
    {
      "id": "pa2",
      "text": "The expression 'loss of profits and gains' in s. 24(1) does not include any deficiency resulting from depreciation, so assessee is not entitled to set off depreciation against income under other heads such as dividends.",
      "supporting_facts": [],
      "legal_basis": "Sections 24(1)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Relies on the history of the legislation and a number of authorities to support that unabsorbed depreciation can be set off against other income.",
      "supporting_facts": [
        "f5"
      ],
      "legal_basis": "Proviso (b) to s. 10(2)(vi), s. 24"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The scheme of the Act is to assess the total income of an assessee by pooling income from business with income or loss under other heads; no express distinction between various allowances in s. 10(2), including depreciation.",
      "addresses_issue": "i1",
      "key_observation": "Depreciation is treated like other allowances and can result in a loss if profits insufficient."
    },
    {
      "id": "cr2",
      "text": "Proviso (b) to s. 10(2)(vi) assumes effect can be given to depreciation allowance in assessment of partners by setting it off against other heads of income.",
      "addresses_issue": "i1",
      "key_observation": "'No profits or gains chargeable for that year' not confined to business profits under s. 10."
    },
    {
      "id": "cr3",
      "text": "Legislature accepted interpretation by High Courts pre-1953 amendment allowing set off of unabsorbed depreciation against other income.",
      "addresses_issue": "i1",
      "key_observation": "Proviso (b) to s. 24(2) gives preference to ordinary losses over depreciation losses for set-off."
    },
    {
      "id": "cr4",
      "text": "Disagrees with Madras High Court in C.I.T. v. B. Nagi Reddy that depreciation is only charge on profits and cannot create a loss.",
      "addresses_issue": "i1",
      "key_observation": "Carry forward of depreciation under s. 10 distinct from losses under s. 24."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Unabsorbed depreciation can be carried forward under proviso (b) to s. 10(2)(vi) and set off against income from other sources, as part of total income computation.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Messrs Karam Ilahi Muhammad Shafi v. Commissioner of Income Tax, Delhi",
      "citation": "1 Income Tax Cases 456; I.L.R. 11 Lahore 38",
      "treatment": "followed",
      "relevance": "Depreciation on buildings and machinery can be set off against gains from other sources like rental income."
    },
    {
      "case_name": "A. Suppan Chettiar Co. v. Commissioner of Income-Tax, Madras",
      "citation": "4 Income Tax Cases 211; I.L.R. 53 Madras",
      "treatment": "followed",
      "relevance": "Excess depreciation over business profits can be set off against profits from other businesses or sources."
    },
    {
      "case_name": "Ballarpur Collieries v. Commissioner of Income Tax, Central Provinces",
      "citation": "4 Income Tax Cases 255; A.I.R. 1930 Nag.",
      "treatment": "followed",
      "relevance": "Partners of registered firm entitled to set off depreciation against other income under s. 24."
    },
    {
      "case_name": "Laxmichand Jaipuria Spinning and Weaving Mills, In re",
      "citation": "18 A.I.R. 919",
      "treatment": "followed",
      "relevance": "Proviso (b) to s. 24(2) gives preference to ordinary losses over depreciation for set-off."
    },
    {
      "case_name": "Ambika Silk Mills Co. Ltd. v. Commissioner of Income-Tax",
      "citation": "22 I.T.R. 58, 65",
      "treatment": "followed",
      "relevance": "Depreciation loss carried forward without time limit unlike business losses under s. 24."
    },
    {
      "case_name": "Commissioner of Income-Tax, Bombay City v. Ravi Industries Ltd.",
      "citation": "49 I.T.R. 145",
      "treatment": "followed",
      "relevance": "Post-amendment view allowing set off of unabsorbed depreciation."
    },
    {
      "case_name": "Commissioner of Income-Tax v. J. Girdharilal Harivallabhadas Mills Co. Ltd.",
      "citation": "51 I.T.R. 693",
      "treatment": "followed",
      "relevance": "Post-amendment view allowing set off of unabsorbed depreciation."
    },
    {
      "case_name": "Commissioner of Income Tax Madras v. B. Nagi Reddy",
      "citation": "51 I.T.R. 178",
      "treatment": "distinguished",
      "relevance": "Contrary view that depreciation only charge on profits, not creatable loss; court disagrees."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act, 1922",
      "sections": [
        "s. 6",
        "s. 10",
        "s. 10(2)(vi)",
        "Proviso (b) to s. 10(2)(vi)",
        "s. 24",
        "s. 24(1)",
        "s. 24(2)",
        "Proviso (b) to s. 24(2)",
        "s. 66"
      ],
      "relevance": "Governs computation of business profits including depreciation allowances, set off of losses, carry forward of unabsorbed depreciation against total income."
    },
    {
      "name": "Indian Income Tax (Amendment) Act, 1953 (25 of 1953)",
      "sections": [
        "s. 8"
      ],
      "relevance": "Inserted words in proviso (b) to s. 10(2)(vi) effective April 1, 1952."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court agrees with Calcutta High Court, answers the referred question in favour of the assessee, allowing unabsorbed depreciation to be set off against total income including dividend income.",
    "relief_granted": "Unabsorbed depreciation of Rs. 76,857/- allowed to be deducted from total income.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "the underlying idea of the Act is to assess the total income of an assessee. Prima facie, it would be unfair to compute the total income of an assessee carrying on business without pooling the income from business with the income or loss under other heads.",
      "speaker": "court",
      "significance": "Explains scheme of total income computation under the Act."
    },
    {
      "text": "the only distinction is that while the other allowances may be outgoings, depreciation is not an actual outgoing.",
      "speaker": "court",
      "significance": "No distinction between depreciation and other s. 10(2) allowances for set-off purposes."
    },
    {
      "text": "In conclusion, we agree with the High Court that the question referred to it should be answered in favour of the assessee.",
      "speaker": "court",
      "significance": "Final holding affirming High Court's decision."
    }
  ],
  "_case_id": "1965_352",
  "_label": 0,
  "_text_length": 16762,
  "_extracted_at": "2026-02-10T19:28:53.376754"
}