{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. R.B. Jodha Mal Kuthiala",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 95 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Hakam Mal Tani Mal a Hindu undivided family was assessed to tax under the Indian Income-tax Act, 1918, in respect of income from business, inter alia, in timber at Abdullapur.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "In 1934 there was a partition of the Hindu undivided family, and five members of that family entered into a partnership to carry on in the name of Ms Hakam Mal Tani Mal the business which was originally carried on by the undivided family.",
      "type": "material",
      "date": "1934",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Accounts of this firm were settled till March 31, 1939, and the firm was dissolved.",
      "type": "material",
      "date": "1939-03-31",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The timber business of the firm was taken over by two partners of the firm-Gajjan Mal and Jodha Mal, who entered into an agreement of partnership to carry on the business in the name of R. B. Jodha Mal Kuthiala-hereinafter called assessee.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "An instrument of partnership recording the terms of the partnership and reciting the dissolution of the earlier partnership was executed on June 29, 1939.",
      "type": "material",
      "date": "1939-06-29",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The assessee was dissolved in March 1943.",
      "type": "material",
      "date": "1943-03",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In assessment proceedings for 1943-44 the assessee contended that the firm Messrs Hakam Mal Tani Mal was dissolved on March 31, 1939, before the Income-tax Amendment Act 7 of 1939 had come into force and the first succession to the business after April 1, 1939 was in March 1943, when the assessee was dissolved and on that account the assessee was entitled to relief under S. 25(3), or in the alternative under s. 25(4) of the Indian Income-tax Act, 1922.",
      "type": "procedural",
      "date": "1943-44",
      "source": "assessee"
    },
    {
      "id": "f8",
      "text": "The Income-tax Officer completed the assessment without giving to the assessee the benefit of sub-ss. (3) or (4) of s. 25 of the Indian Income-tax Act, 1922.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "The Appellate Assistant Commissioner confirmed the order holding that succession to the family firm Messrs. Hakam Mal Tani Mal took place on April 1, 1939, and that firm alone was entitled to relief under s. 25(4) and to the second succession which took place on April 1, 1943, after Act 7 of 1939 was brought into force relief under s. 25(4) was not admissible.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The Income-tax Appellate Tribunal agreed with the view of the Appellate Assistant Commissioner.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Thereafter as directed by the High Court of Punjab under s. 66(2) of the Indian Income-tax Act, 1922, the Tribunal drew up a statement of the case and submitted the question of law.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "The High Court held that the assessee was carrying on business when Act 7 of 1939 was brought into operation and was on that account entitled to the benefit of s. 25(4) of the Act.",
      "type": "procedural",
      "date": "1961-04-14",
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "With certificate granted by the High Court, this appeal has been preferred.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "The instrument of partnership recites that accounts of Messrs. Hakam Mal Tani Mal were settled on March 31, 1939 and upto March 31, 1939, all partners have become separate from the 1st of April, 1939, and the business at Abdullapur in the name of firm Hakam Mal Tani Mal and R. B. Jodha Mal Kuthiala has fallen to our share to run which we have by means of an oral agreement constituted a separate partnership styled R. B. Jodha Mal Kuthiala, Abdullapur from the 1st of April, 1939.",
      "type": "material",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in the facts and the circumstances of the case, the Tribunal is correct in law in holding that the assessee firm R. B. Jodha Mal Kuthiala, Abdullapur Depot, Simla was not entitled to the benefit provided in Section 25(3) or 25(4) of the Income-tax Act, in relation to the assessment in question?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the assessee was carrying on business at the commencement of the Indian Income-tax Amendment Act, 1939 (VII of 1939) on April 1, 1939.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The assessee was not carrying on business at the commencement of the Indian Income-tax Amendment Act 7 of 1939, and that it succeeded to the business on April 1, 1943.",
      "supporting_facts": [
        "f3",
        "f6"
      ],
      "legal_basis": "Section 25(4) of Indian Income-tax Act, 1922; Income-tax Amendment Act 7 of 1939"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The firm Messrs Hakam Mal Tani Mal was dissolved on March 31, 1939, before the Income-tax Amendment Act 7 of 1939 had come into force and the first succession to the business after April 1, 1939 was in March 1943, when the assessee was dissolved.",
      "supporting_facts": [
        "f3",
        "f6",
        "f14"
      ],
      "legal_basis": "Section 25(3) or 25(4) of Indian Income-tax Act, 1922"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The Indian Income-tax Amendment Act 7 of 1939 was brought into force on April 1, 1939. Section 5(3) of the General Clauses Act provides that unless the contrary is expressed, a Central Act shall be construed as coming into operation immediately on the expiration of the day preceding its commencement. Act 7 of 1939 must therefore be deemed to have come into operation at a point of time immediately on the expiration of March 31, 1939.",
      "addresses_issue": "i2",
      "key_observation": "Act came into force immediately after midnight of March 31, 1939."
    },
    {
      "id": "cr2",
      "text": "The recitals in the instrument that the accounts were settled upto March 31, 1939, and that the partners had become separate, would imply that the firm of Messrs Hakam Mal Tani Mal did not do business after March 31, 1939.",
      "addresses_issue": "i2",
      "key_observation": "Dissolution effective end of March 31, 1939."
    },
    {
      "id": "cr3",
      "text": "The assessee was constituted to carry on the timber business allotted to it at the time of dissolution from April 1, 1939. The timber business was an old and a running business, and an intention to maintain continuity of the business and its transactions may reasonably be attributed to the assessee.",
      "addresses_issue": "i2",
      "key_observation": "Assessee commenced business immediately after dissolution."
    },
    {
      "id": "cr4",
      "text": "In the absence of other evidence, it may be held that the business of Messrs. Hakam Mal Tani Mal continued till the midnight of March 31, 1939, and immediately thereafter the business of the assessee commenced. The partnership therefore came into being at the precise point of time at which the Indian Income-tax Amendment Act 7 of 1939 came into force and it could not be said that the assessee was not carrying on business at the commencement of the Indian Income-tax Amendment Act 7 of 1939.",
      "addresses_issue": "i1",
      "key_observation": "Assessee carrying on business at commencement of Act."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The assessee was carrying on business at the commencement of the Indian Income-tax Amendment Act 7 of 1939 and was entitled on the dissolution of that firm in March 1943 to the benefit of s. 25(4) of the Indian Income-tax Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Income-tax Act, 1918",
      "sections": [],
      "relevance": "HUF assessed under this Act for timber business."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "Section 25(3)",
        "Section 25(4)",
        "Section 66(2)"
      ],
      "relevance": "Relief claimed under sub-sections (3) and (4) of Section 25; reference under Section 66(2)."
    },
    {
      "name": "Income-tax Amendment Act, 1939 (Act 7 of 1939)",
      "sections": [
        "Sub-section (4) inserted in Section 25"
      ],
      "relevance": "Inserted sub-section (4) in Section 25; commencement date critical for relief eligibility."
    },
    {
      "name": "General Clauses Act, 1897 (Act 10 of 1897)",
      "sections": [
        "Section 5(3)"
      ],
      "relevance": "Determines commencement of Act 7 of 1939 immediately after expiration of March 31, 1939."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Punjab High Court's decision that the assessee firm R.B. Jodha Mal Kuthiala was carrying on business at the commencement of the Income-tax Amendment Act 7 of 1939 and was entitled to the benefit of Section 25(4) of the Indian Income-tax Act, 1922 upon its dissolution in March 1943.",
    "relief_granted": "Benefit of Section 25(4) to assessee",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The partnership therefore came into being at the precise point of time at which the Indian Income-tax Amendment Act 7 of 1939 came into force and it could not be said that the assessee was not carrying on business at the commencement of the Indian Income-tax Amendment Act 7 of 1939.",
      "speaker": "court",
      "significance": "Core holding on timing of succession and eligibility for relief."
    },
    {
      "text": "Act 7 of 1939 must therefore be deemed to have come into operation at a point of time immediately on the expiration of March 31, 1939.",
      "speaker": "court",
      "significance": "Interpretation of commencement date using General Clauses Act."
    }
  ],
  "_case_id": "1965_289",
  "_label": 0,
  "_text_length": 9510,
  "_extracted_at": "2026-02-10T19:28:10.559649"
}