{
  "metadata": {
    "case_name": "State of Kerala v. Respondent (Dealer)",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao J."
    ],
    "case_number": "Civil Appeal Nos. 986 and 987 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The respondent has two offices in Kozhikode: head office at Court Road (retail business) and branch office at Big Bazaar (wholesale business), maintaining separate accounts. Goods sent from branch to head office entered as transfers.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "For assessment year 1955-56, initial assessment by Deputy Commercial Tax Officer on net turnover of Rs. 9,30,565-10-5.",
      "type": "procedural",
      "date": "1957-04-06",
      "source": "lower_court"
    },
    {
      "id": "f3",
      "text": "Surprise inspection of head office by Intelligence Officer, North Zone, Kozhikode; some books of accounts and records recovered.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On 1958-10-27, Sales Tax Officer issued notice proposing best judgment assessment of escaped turnover based on secret books.",
      "type": "procedural",
      "date": "1958-10-27",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "Respondent agreed to reassessment of head office based on secret books but objected to reassessment of branch office.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Sales Tax Officer reassessed: For head office, secret books showed transactions 135% of regular accounts turnover, added 135% to regular turnover. Applied same 135% addition to branch office regular turnover. Total turnover Rs. 19,71,805-13-5, tax Rs. 16,269.37.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Appeal to Appellate Assistant Commissioner dismissed; further appeal to Sales Tax Appellate Tribunal dismissed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Revision to High Court of Kerala in T.R.C. No. 52 of 1960.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "For assessment year 1956-57, Sales Tax Officer issued notice for best judgment based on secret accounts from head office inspection. Respondent no objection to head office but objected to branch.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Sales Tax Officer applied same principle: Head office - added 200% to general goods turnover, 500% to sugar turnover. Same additions to branch office. Total turnover Rs. 39,66,377-2-6 (head: Rs. 2,21,251-14-5; branch: Rs. 37,45,125-4-1).",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Respondent pursued up to High Court in T.R.C. No. 53 of 1960.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f12",
      "text": "High Court set aside Tribunal orders for both years, holding escaped assessment for branch office based on conjecture, an error of law. Rejected State's remand plea and dismissed revisions.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Branch office had transactions with other customers, names disclosed in accounts.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Sales Tax Officer's best judgment assessment of escaped turnover for the branch office, by applying the same percentage as found for the head office, was capricious and arbitrary, or reasonable.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the High Court had jurisdiction to interfere with the Tribunal's finding of fact.",
      "framed_by": "petitioner"
    },
    {
      "id": "i3",
      "text": "Scope of 'to the best of his judgment' under Section 12(2)(b) of the Travancore-Cochin General Sales Tax Act.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court wrong in holding best judgment assessment capricious. Branch office must have maintained corresponding secret accounts suppressed by respondent; Sales Tax Officer acted reasonably by using head office percentage.",
      "supporting_facts": [
        "f3",
        "f6",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "High Court had no jurisdiction to interfere with Tribunal's finding of fact.",
      "supporting_facts": [
        "f7",
        "f11"
      ],
      "legal_basis": "Section 15B"
    },
    {
      "id": "pa3",
      "text": "Matter should be remanded for fresh assessment.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "No basis for Sales Tax Officer to hold respondent maintained secret accounts for branch office; no material to sustain best judgment assessment, which was capricious and arbitrary.",
      "supporting_facts": [
        "f5",
        "f9"
      ],
      "legal_basis": "Section 12(2)(b)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court's jurisdiction under Section 15B confined to whether Tribunal erred or failed to decide question of law. Here, Sales Tax Officer acted capriciously, confirmed by Tribunal - error of law.",
      "addresses_issue": "i2",
      "key_observation": "Tribunal decided erroneously on question of law."
    },
    {
      "id": "cr2",
      "text": "'To the best of his judgment' requires honest guess-work based on relevant material, local knowledge, previous returns etc., not capricious or arbitrary. Element of guess-work must have reasonable nexus to available material.",
      "addresses_issue": "i3",
      "key_observation": "Judgment must be based on settled principles of justice, not wild guess."
    },
    {
      "id": "cr3",
      "text": "Discovery of secret accounts in head office does not necessarily mean corresponding secret accounts in branch; could be only one set to avoid detection. No material like customer accounts or circumstances used for branch.",
      "addresses_issue": "i1",
      "key_observation": "Applying ratio from head to branch was capricious surmise unsupported by relevant material."
    },
    {
      "id": "cr4",
      "text": "No remand: Department had opportunity but failed; persisted through tribunals; High Court rightly refused another chance.",
      "addresses_issue": "i1",
      "key_observation": "Sales tax authority did not base judgment on relevant material."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Best judgment assessment must be honest estimate based on relevant material with reasonable nexus, not capricious application of ratio from one office to another without evidence.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Impugned assessments for branch office arbitrary; High Court rightly set aside Tribunal orders.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax v. Laxminarayan Badridas",
      "citation": null,
      "treatment": "followed",
      "relevance": "Interpreted 'best of his judgment' as requiring honest guess-work based on relevant material like local knowledge, repute, previous returns; not dishonest, vindictive or capricious."
    },
    {
      "case_name": "Jagadish Prosad Pannalal v. Member, Board of Revenue, West Bengal",
      "citation": null,
      "treatment": "followed",
      "relevance": "Confirmed best judgment assessment where authorities considered all available materials and applied mind."
    },
    {
      "case_name": "Doma Sahu Kishun Lal Sao v. State of Bihar",
      "citation": null,
      "treatment": "followed",
      "relevance": "Upheld best judgment where relevant materials like shop situation, customer rush, stock, previous estimates considered."
    }
  ],
  "statutes_cited": [
    {
      "name": "Travancore-Cochin General Sales Tax Act, 1125 M.E. (XI of 1125)",
      "sections": [
        "Section 12(1)",
        "Section 12(2)(b)",
        "Section 15B"
      ],
      "relevance": "Section 12(2)(b) empowers best judgment assessment if return incorrect/incomplete, after opportunity; must not be capricious. Section 15B limits High Court revision to errors on questions of law by Tribunal."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals against High Court orders setting aside Tribunal's confirmation of Sales Tax Officer's best judgment assessments dismissed. High Court rightly held branch office assessments capricious due to lack of material.",
    "relief_granted": "None to appellant; respondent's position upheld.",
    "costs": "No costs awarded to respondent."
  },
  "key_quotes": [
    {
      "text": "\"He must make what he honestly believes to be a fair estimate of the proper figure of assessment... though there must necessarily be guess-work... it must be honest guess-work.\"",
      "speaker": "court",
      "significance": "Defines scope of 'best judgment' from Privy Council precedent."
    },
    {
      "text": "\"Judgment is a faculty to decide matters with wisdom truly and legally... Though there is an element of guess-work... it shall not be a wild one, but shall have a reasonable nexus to the available material.\"",
      "speaker": "court",
      "significance": "Court's holding on limits of best judgment power."
    },
    {
      "text": "\"From the discovery of secret accounts in the head office, it does not necessarily follow that a corresponding set of secret accounts were maintained in the branch office.\"",
      "speaker": "court",
      "significance": "Rejects basis for applying head office ratio to branch."
    }
  ],
  "_case_id": "1965_292",
  "_label": 0,
  "_text_length": 13846,
  "_extracted_at": "2026-02-10T19:28:16.935621"
}