{
  "metadata": {
    "case_name": "Jai Shanker v. State of Rajasthan",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah J."
    ],
    "case_number": "Civil Appeal No. 576 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant Jai Shanker was Head Warder, Central Jail, Jodhpur in 1950. Started service as Warder in April 1940, promoted Head Warder in 1944, permanent servant of the State.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On April 14, 1950, proceeded on leave for two months ending June 13, 1950.",
      "type": "material",
      "date": "1950-04-14",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Applied for extension of leave on medical grounds: 20 days, then 10 days, then by a month. Due to join on August 13, 1950.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "On August 14, 1950, told no more leave would be granted and transfer to Jaipur (made while ill at Hyderabad) would not be cancelled.",
      "type": "material",
      "date": "1950-08-14",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Returned to Jodhpur from Hyderabad on September 1, 1950 and applied for further leave. Made several applications.",
      "type": "material",
      "date": "1950-09-01",
      "source": "petitioner"
    },
    {
      "id": "f6",
      "text": "Last application sent by registered post with medical certificate on November 3, 1950 asking for leave till November 11, 1950. No reply to last and some earlier applications.",
      "type": "material",
      "date": "1950-11-03",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "On November 8, 1950, received communication dated 2/4-11-50 from Deputy Inspector General, Prisons (endorsed by Superintendent, Central Jail, Jodhpur) that discharged from service from August 13, 1950.",
      "type": "material",
      "date": "1950-11-08",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appeal to Inspector General of Prisons, Rajasthan dismissed on September 24, 1951.",
      "type": "procedural",
      "date": "1951-09-24",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appeal to Home Secretary, Rajasthan Government. Informed by letter dated December 17, 1953 that papers sent to Inspector General, Prisons for necessary action.",
      "type": "procedural",
      "date": "1953-12-17",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "Jai Shanker alleges called by Personal Assistant to Inspector General and offered reinstatement if undertook not to claim back salary, but declined.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Served notice under s. 80 CPC, filed suit for declaration that termination illegal (entitled to notice u/Art. 311), back salary Rs. 2369.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Subordinate Judge, Jodhpur: allegations of illness true, but discharge not illegal, suit dismissed, back salary disallowed.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "District Judge, Jodhpur: reversed trial court, entitled to declaration removal illegal, continued in employment, arrears of salary.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Rajasthan High Court (Dec 11, 1962, S.B. Civil Regulation Second Appeal No. 37 of 1961): set aside District Judge, restored Subordinate Judge, Jai Shanker to pay costs.",
      "type": "procedural",
      "date": "1962-12-11",
      "source": "court"
    },
    {
      "id": "f15",
      "text": "No charge framed against Jai Shanker, no opportunity to show cause given.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether Jai Shanker was entitled to an opportunity to show cause against the proposed punishment as required by cl. (2) of Art. 311.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether Regulation 13 of Jodhpur Service Regulations enables Government to remove without opportunity u/Art. 311, as it deems overstay as sacrificing appointment.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Termination of service illegal as entitled to notice to show cause u/Art. 311 of Constitution.",
      "supporting_facts": [
        "f7",
        "f11",
        "f15"
      ],
      "legal_basis": "Art. 311 Constitution"
    },
    {
      "id": "pa2",
      "text": "Allegations of illness true, made applications for leave extensions with medical certificates.",
      "supporting_facts": [
        "f3",
        "f5",
        "f6",
        "f10"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Government did not terminate service; Jai Shanker gave up employment by remaining absent. Not covered by Art. 311.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Regulation 13 Jodhpur Service Regulations"
    },
    {
      "id": "ra2",
      "text": "Regulation 13: absent without permission for one month or longer after leave end considered to have sacrificed appointment, reinstated only with sanction. Automatic, no removal.",
      "supporting_facts": [
        "f2",
        "f4",
        "f7"
      ],
      "legal_basis": "Regulations 7, 11, 12, 13 Jodhpur Service Regulations"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Discharge from service by way of punishment amounts to removal from service. Regulation 13 not sufficient to bypass Art. 311; constitutional protection cannot be taken away by side wind.",
      "addresses_issue": "i1",
      "key_observation": "Even if over-staying leave, must give opportunity to show cause why not removed."
    },
    {
      "id": "cr2",
      "text": "Regulation speaks of reinstatement but really means no reinstatement if discharged/removed. Question of reinstatement only after considering removal. Removal is punishment for overstay, requires opportunity u/Art. 311.",
      "addresses_issue": "i2",
      "key_observation": "A removal is removal and if punishment, opportunity must be given no matter how Regulation describes it."
    },
    {
      "id": "cr3",
      "text": "Jai Shanker entitled to opportunity against proposed removal for overstaying leave; none given, so removal illegal.",
      "addresses_issue": "i1",
      "key_observation": "To give no opportunity is against Art. 311."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Jai Shanker entitled to declaration that removal from service illegal for want of opportunity u/Art. 311(2).",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Regulation 13 does not enable removal without opportunity; overstay treated as automatic sacrifice does not oust Art. 311 protection.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Constitution of India",
      "sections": [
        "Article 311"
      ],
      "relevance": "Requires opportunity to show cause against proposed removal/punishment; applies even to overstay under service regulations."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 80"
      ],
      "relevance": "Notice served before filing suit."
    },
    {
      "name": "Jodhpur Service Regulations",
      "sections": [
        "Regulation 7",
        "Regulation 11",
        "Regulation 12",
        "Regulation 13"
      ],
      "relevance": "Regulate leave and absence; Reg 13 deems prolonged absence as sacrifice of appointment but does not override Art. 311."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed appeal, set aside High Court order dated Dec 11, 1962, restored District Judge's decree declaring removal illegal. Remitted to trial Judge (Civil Judge, Jodhpur) to determine back salary per rules. State to pay costs in Supreme Court, High Court, and two courts below.",
    "relief_granted": "Declaration of illegal removal; back salary to be determined; costs awarded.",
    "costs": "State Government to pay costs of Jai Shanker in this Court, High Court and two courts below. Appellant permitted to appeal in forma pauperis; State to pay Court Fee on memorandum."
  },
  "key_quotes": [
    {
      "text": "The constitutional protection can be taken away in this manner by a side wind.",
      "speaker": "court",
      "significance": "Rejects State's attempt to bypass Art. 311 via Regulation 13."
    },
    {
      "text": "A removal is removal and if it is punishment for over-staying ones Leave an opportunity must be given to the person against whom such an order is proposed, no matter how the Regulation describes it.",
      "speaker": "court",
      "significance": "Core holding on applicability of Art. 311 to regulatory 'automatic' removal."
    },
    {
      "text": "To give no opportunity is to go against Art. 311 and this is what has happened here.",
      "speaker": "court",
      "significance": "Directly applies to facts, declaring removal illegal."
    }
  ],
  "_case_id": "1965_308",
  "_label": 1,
  "_text_length": 10575,
  "_extracted_at": "2026-02-10T19:28:14.620749"
}