{
  "metadata": {
    "case_name": "Mahadeo v. Udai Pratap Singh",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, C.J."
    ],
    "case_number": "Civil Appeal No. 478 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "At the General Elections of 1962, for the U.P. Legislative Assembly seat in Constituency No. 133 in Mijhaura, District Faizabad, 6 persons offered themselves as candidates including appellant Mahadeo and respondent No. 1 Udai Pratap Singh.",
      "type": "background",
      "date": "1962",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant Mahadeo was duly declared elected with 17,688 votes, respondent No. 1 received 10,985 votes.",
      "type": "material",
      "date": "1962",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Election symbol of appellant was scales (Tarazu), of respondent No. 1 was lamp (Deepak).",
      "type": "background",
      "date": "1962",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent No. 1's real name is Udai Pratap Singh, recorded in electoral roll and nomination paper, but printed on ballot papers as Udai Bhan Pratap Singh.",
      "type": "material",
      "date": "1962",
      "source": "respondent"
    },
    {
      "id": "f5",
      "text": "Respondent No. 1 filed election petition before Election Tribunal, Lucknow, challenging validity of appellant's election.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "Respondent No. 1 alleged misprinting of name eliminated him from contest, opponents spread rumour he withdrew, many voters did not go to polling booth.",
      "type": "disputed",
      "date": "1962",
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Election Tribunal held rumour allegation not proved, but misprinting contravened Rule 56(2)(g), rendered election void under s.100(1)(d)(iv).",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Allahabad High Court, Lucknow Bench, judgment dated January 29, 1964 in First Appeal No. 4 of 1964, confirmed misprinting but reversed on Rule 56(2)(g) contravention, yet held election void under s.100(1)(d)(iv), dismissed appeal.",
      "type": "procedural",
      "date": "1964-01-29",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appellant denied rumour, contended misdescription known to all, no material effect.",
      "type": "admitted",
      "date": "1962",
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "10,985 voters voted for respondent No. 1 despite misprint; election agent admitted voting by symbol without reading name.",
      "type": "material",
      "date": "1962",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the misprinting of respondent No. 1's name on ballot papers (Udai Bhan Pratap Singh instead of Udai Pratap Singh) rendered appellant's election void under s.100(1)(d)(iv) of the Representation of the People Act, 1951.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Mistake in printing name amounted to no more than mis-description; everyone knew Udai Bhan Pratap Singh referred to respondent No. 1.",
      "supporting_facts": [
        "f4",
        "f9"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "Allegation of rumour spread by opponents that respondent withdrew was completely untrue; no voters stayed away due to rumour.",
      "supporting_facts": [
        "f6",
        "f9"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Misprinting of name as Udai Bhan Pratap Singh (grandfather's name) virtually eliminated him from contest; constituency did not know he was standing.",
      "supporting_facts": [
        "f4"
      ],
      "legal_basis": "s.100(1)(d)(iv) Representation of the People Act, 1951; Rule 56(2)(g) Conduct of Elections Rules, 1961"
    },
    {
      "id": "ra2",
      "text": "Opponents spread rumour he withdrew due to name infirmity; many supporters did not go to polling booth, materially affecting result.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": "s.100(1)(d)(iv) Representation of the People Act, 1951"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Legislative history of s.100: Pre-1956 treated improper acceptance/rejection alike requiring proof of material effect; post-amendment, improper rejection (cl.c) voids election automatically, improper acceptance/non-compliance (cl.d(iv)) still requires proof of material effect on result.",
      "addresses_issue": "i1",
      "key_observation": "Amendment separated cases; for non-compliance like misprinting, must prove material effect."
    },
    {
      "id": "cr2",
      "text": "Rumour allegation rejected by Tribunal and High Court, confirmed by Supreme Court; no evidence of material effect from misprint alone.",
      "addresses_issue": "i1",
      "key_observation": "10,985 votes received despite misprint; voters focus on symbols (lamp correctly shown)."
    },
    {
      "id": "cr3",
      "text": "Misprint is non-compliance with Rule 22 but mere misdescription; does not disguise candidacy given correct symbol and votes polled.",
      "addresses_issue": "i1",
      "key_observation": "No contravention of Rule 56(2)(g) as design/pattern intact, only content error."
    },
    {
      "id": "cr4",
      "text": "High Court erred in concluding misprint eliminated respondent; unreasonable inference without proof of material effect.",
      "addresses_issue": "i1",
      "key_observation": "Proof of non-compliance insufficient; material effect not proved."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under s.100(1)(d)(iv), non-compliance with rules (misprinting name) does not void election unless result materially affected, which must be proved; here not proved.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Surendra Nath Khosla and Anr. v. S. Dalip Singh and others",
      "citation": "1957 S.C.R. 19",
      "treatment": "referred",
      "relevance": "Improper rejection of nomination presumed to materially affect result."
    },
    {
      "case_name": "Vashist Narain Sharma v. Dev Chand Others",
      "citation": "10 E.L.R. 30",
      "treatment": "followed",
      "relevance": "For improper acceptance of nomination, material effect must be proved; no presumption if margin exceeds wasted votes."
    }
  ],
  "statutes_cited": [
    {
      "name": "Representation of the People Act, 1951",
      "sections": [
        "s.100(1)(d)(iv)"
      ],
      "relevance": "Election void if non-compliance materially affects result concerning returned candidate."
    },
    {
      "name": "Conduct of Elections Rules, 1961",
      "sections": [
        "Rule 22",
        "Rule 30",
        "Rule 56(2)(g)"
      ],
      "relevance": "Rule 22 requires correct name on ballot; Rule 30 form/design; Rule 56(2)(g) rejection for wrong serial/design, not misprint."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order set aside; election of appellant declared valid; respondent's election petition dismissed.",
    "relief_granted": "Election of Mahadeo upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The short question which arises in this appeal is whether the Election Tribunal, Lucknow, and the High Court... were right in holding that the election of the appellant Mahadeo was invalid under s.100(1)(d)(iv) of the Act.",
      "speaker": "court",
      "significance": "Frames the core issue."
    },
    {
      "text": "Misprinting of the name of respondent No. 1 on the ballot papers amounts to non-compliance with r.22 of the Rules but the proof of such non-compliance does not necessarily or automatically render the election of the appellant void.",
      "speaker": "court",
      "significance": "Key holding on requirement of material effect."
    },
    {
      "text": "From such misdescription it would be wholly unreasonable to infer that the voters must have come to the conclusion that respondent No. 1 was not a candidate at the election at all.",
      "speaker": "court",
      "significance": "Rejects inference of material prejudice."
    }
  ],
  "_case_id": "1965_258",
  "_label": 1,
  "_text_length": 20392,
  "_extracted_at": "2026-02-10T19:27:35.557640"
}