{
  "metadata": {
    "case_name": "Plaintiff-Appellant v. Defendants-Respondents",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Bachawat, J."
    ],
    "case_number": "Civil Appeal No. 270 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On April 19, 1951, the plaintiff-appellant instituted a suit in the Court of the Second Joint Civil Judge, Junior Division at Bagalkot, for possession of the suit properties on redemption of a mortgage and the taking of accounts.",
      "type": "background",
      "date": "1951-04-19",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Defendant No. 1 was the usufructuary mortgagee under a mortgage deed dated June 28, 1945 (Ex. 43).",
      "type": "disputed",
      "date": "1945-06-28",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "Defendants pleaded that the transaction of June 28, 1945 was an advance lease and not a mortgage, and they were protected tenants within the meaning of the Bombay Tenancy and Agricultural Lands Act, 1948.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f4",
      "text": "On March 4, 1953, the trial Court passed a decree holding that the deed Exhibit 43 is a composite document comprising of a mortgage and a lease; on taking accounts, plaintiff owed nothing to the defendants; mortgage stands fully redeemed; plaintiff at liberty to seek remedy for possession in Revenue Courts; plaintiff recovers half costs from defendants.",
      "type": "procedural",
      "date": "1953-03-04",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "On April 15, 1953, the plaintiff filed an appeal in the Court of the Assistant Judge at Bijapur, and the defendants filed cross-objections.",
      "type": "procedural",
      "date": "1953-04-15",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On July 5, 1955, the first appellate Court held that the Civil Court had no jurisdiction to determine whether defendant No. 1 was a mortgagee in possession or a tenant; confirmed nothing due under Ex. 43 and liberty to seek remedy in Revenue Court; set aside rest of decree and remanded record to Trial Court to give three months time to plaintiff for filing proceedings in Tenancy Court; if not, dismiss suit; if yes, await final decision.",
      "type": "procedural",
      "date": "1955-07-05",
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "On October 1, 1955, the plaintiff filed a second appeal in the High Court of Mysore.",
      "type": "procedural",
      "date": "1955-10-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On December 7, 1959, the High Court of Mysore dismissed the second appeal, set aside the finding on accounts, confirmed no jurisdiction to interpret Ex. 43 as mortgage or lease, directed record back to Trial Court to refer issue to Mamlatdar whether defendant is lessee under Ex. 43; if not tenant, decide suit on merits; if tenant, dismiss suit.",
      "type": "procedural",
      "date": "1959-12-07",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Subsequent petitions by the plaintiff for review of this decree and for leave to file a Letters Patent Appeal were dismissed on April 14, 1960.",
      "type": "procedural",
      "date": "1960-04-14",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "The plaintiff appeals to this Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The suit lands are agricultural lands within the meaning of the Bombay Tenancy and Agricultural Lands Act, 1948.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Civil Court has jurisdiction to try the suit for possession on redemption of mortgage of agricultural lands or whether it must refer the issue of whether the defendant is a tenant to the Mamlatdar.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the High Court in second appeal had jurisdiction to set aside the finding of the first appellate Court that nothing is due under the transaction Ex. 43.",
      "framed_by": "petitioner"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Jurisdiction of a Civil Court depends upon the allegations made in the plaint; Civil Court has full jurisdiction to try a suit for recovery of possession of agricultural lands on redemption of a mortgage; Mamlatdar has no jurisdiction to try such a suit; plea that defendants were protected tenants did not oust jurisdiction of Civil Court; Civil Court should have tried and decided the incidental issue whether defendants were mortgagees or protected tenants instead of referring to Mamlatdar.",
      "supporting_facts": [
        "f1",
        "f2"
      ],
      "legal_basis": null
    },
    {
      "id": "pa2",
      "text": "In the second appeal preferred by the plaintiff, the High Court had no jurisdiction to set aside the finding of the first appellate Court that nothing is due by the plaintiff to the defendants under Ex. 43.",
      "supporting_facts": [
        "f6"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Disputed petitioner's contentions; High Court rightly referred the issue for decision of the Mamlatdar.",
      "supporting_facts": [
        "f3",
        "f11"
      ],
      "legal_basis": "Bombay Tenancy and Agricultural Lands Act, 1948"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "The combined effect of ss. 29, 70, 85 and 85A of the Act: Mamlatdar has exclusive jurisdiction to entertain application by landlord for possession against tenant; Civil Court has no jurisdiction for such; but Civil Court has jurisdiction against trespasser or mortgagee on redemption, but if defendant pleads tenant status, must refer issue to Mamlatdar and stay suit.",
      "addresses_issue": "i1",
      "key_observation": "Mamlatdar has exclusive jurisdiction even for issues arising in Civil Court suits."
    },
    {
      "id": "cr2",
      "text": "Section 85A introduced in 1956, but before it, Bombay High Court in Dhondi Tukaram v. Hari Dadu held Civil Court must refer tenant plea to Mamlatdar; Legislature approved by enacting s. 85A.",
      "addresses_issue": "i1",
      "key_observation": "Courts below bound to refer issue to Mamlatdar independently of s. 85A."
    },
    {
      "id": "cr3",
      "text": "Distinguishes Mudugere Rangaiah v. M. Rangaiah under Mysore Act; no opinion on its correctness.",
      "addresses_issue": "i1",
      "key_observation": "Differences in scheme and history of Bombay Act vs. Mysore Act."
    },
    {
      "id": "cr4",
      "text": "No substance in contention that High Court had no jurisdiction in second appeal to set aside finding on accounts; first appellate Court recorded inconsistent findings.",
      "addresses_issue": "i2",
      "key_observation": "High Court could set aside inconsistent findings."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Under the law as it stood before s. 85A, courts below were bound to refer to the Mamlatdar the decision of the issue whether the defendant is a tenant.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dhondi Tukaram v. Hari Dadu",
      "citation": "I.L.R. 1953 Bom. 969",
      "treatment": "followed",
      "relevance": "Held Civil Court must refer tenant plea to Mamlatdar even in suits cognisable by Civil Court; approved by legislature via s. 85A."
    },
    {
      "case_name": "Mudugere Rangaiah v. M. Rangaiah",
      "citation": "I.L.R. 1959 Mysore 420",
      "treatment": "distinguished",
      "relevance": "Under Mysore Tenancy Act; differences in scheme; no opinion on correctness."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Tenancy and Agricultural Lands Act, 1948 (Bombay Act LXVII of 1948)",
      "sections": [
        "2(8)",
        "29",
        "70(b)",
        "85",
        "85A",
        "4",
        "4A"
      ],
      "relevance": "Defines land, tenants, protected tenants; Mamlatdar exclusive jurisdiction on tenant status; Civil Court no jurisdiction on such issues, must refer; bars Civil Court possession suits against tenants."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upholds High Court direction to refer the issue of tenancy to Mamlatdar; Civil Courts below correctly lacked jurisdiction to decide if defendant is tenant and must await Mamlatdar's decision before proceeding.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"the Civil Court shall stay the suit and refer such issues to such competent authority for determination.\"",
      "speaker": "court",
      "significance": "Quotes s. 85A on mandatory reference procedure."
    },
    {
      "text": "\"Mamlatdar has exclusive jurisdiction to decide those issues even though they arose for decision in a suit properly cognisable by a Civil Court.\"",
      "speaker": "court",
      "significance": "Core holding on jurisdiction ouster."
    }
  ],
  "_case_id": "1965_196",
  "_label": 0,
  "_text_length": 15371,
  "_extracted_at": "2026-02-10T19:26:58.602515"
}