{
  "metadata": {
    "case_name": "Appellant v. State Transport Corporation, Gujarat",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Satyanarayana Raju, J."
    ],
    "case_number": "Civil Appeal No. 757 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was a permanent employee of the State Transport Corporation, Gujarat, employed as a Writer in the Visnagar Depot of the Corporation in Mahasana District.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On January 15, 1962, the appellant applied to the Divisional Controller, State Transport, Mahasana, for leave for 15 days on the ground that he had to attend to his personal work.",
      "type": "procedural",
      "date": "1962-01-15",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On January 16, 1962, the appellant was transferred from Visnagar to Ambaji where there was a vacancy in the office of the Depot Manager.",
      "type": "procedural",
      "date": "1962-01-16",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On January 31, 1962, a formal order transferring the appellant from Visnagar to Ambaji was passed, and he was directed to join duty at Ambaji.",
      "type": "procedural",
      "date": "1962-01-31",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On January 31, 1962, the appellant applied for extension of leave on medical grounds but his request was refused by an order dated February 15, 1962. He was directed to report for duty at Ambaji within 48 hours of the receipt of notice failing which he would be removed from service.",
      "type": "procedural",
      "date": "1962-01-31",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On March 3, 1962, the appellant wrote a letter to the Divisional Controller intimating him of his inability to join duty as he was still not well. To this letter, he enclosed a medical certificate.",
      "type": "procedural",
      "date": "1962-03-03",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "By an order dated March 9, 1962, the services of the appellant were terminated with effect from January 16, 1962, on the ground of long absence.",
      "type": "material",
      "date": "1962-03-09",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The appellant made a representation to the Divisional Controller on March 17, 1962 and thereafter preferred an appeal to the General Manager of the Corporation. Both were rejected. A further appeal to the appellate Committee was also unsuccessful. The Committee held that the leave applications were made only with a view to evade joining duty at Ambaji.",
      "type": "procedural",
      "date": "1962-03-17",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appellant applied to the High Court of Gujarat under Arts. 226 and 227 of the Constitution, impleading the Divisional Controller as respondent, for writ of certiorari to quash the order of dismissal. Petition dismissed in limine on May 28, 1963.",
      "type": "procedural",
      "date": "1963-05-28",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On June 17, 1963, appellant applied for certificate to appeal to Supreme Court but refused. Special leave granted by Supreme Court.",
      "type": "procedural",
      "date": "1963-06-17",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Respondent is an autonomous statutory Corporation formed under Road Transport Corporations Act, 1950. Appellant could not invoke Art. 311.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f12",
      "text": "No charge was framed against appellant nor was he given opportunity to show cause.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the appellant was entitled to an opportunity to show cause against the proposed punishment as required by regulation No. 61 / cl. 4(b) of the Regulations which govern the service conditions of the employees of the Corporation.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Termination order contravenes cl. 4(b) of the Regulations and principles of natural justice as no charge framed and no opportunity to show cause given.",
      "supporting_facts": [
        "f7",
        "f12"
      ],
      "legal_basis": "Regulation No. 61, cl. 4(b) of Schedule A; Arts. 226, 227 Constitution"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Termination not by way of punishment; only right was two months pay in lieu of notice under Reg. 61.",
      "supporting_facts": [
        "f7"
      ],
      "legal_basis": "Regulation No. 61"
    },
    {
      "id": "ra2",
      "text": "Assuming termination was punishment, appellant given opportunity to show cause via correspondence and circumstances; compliance with natural justice in fact and substance.",
      "supporting_facts": [
        "f2",
        "f5",
        "f6",
        "f8"
      ],
      "legal_basis": "Principles of natural justice"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Irregular attendance, absence without leave/reasonable cause, failure to report for duty when leave refused are acts of misconduct under Regs. 38, 40 and Schedule A cls. 3(b), 40.",
      "addresses_issue": "i1",
      "key_observation": "Misconduct requires charge, statement of allegations, and reasonable opportunity to show cause under cl. 4(b)."
    },
    {
      "id": "cr2",
      "text": "Admittedly no charge framed, no enquiry conducted. Respondent cannot terminate for misconduct like absence without opportunity to deny guilt and establish innocence.",
      "addresses_issue": "i1",
      "key_observation": "Termination on ground of long absence is punishment for misconduct, requiring procedural safeguards."
    },
    {
      "id": "cr3",
      "text": "Order contravenes cl. 4(b) and natural justice principles.",
      "addresses_issue": "i1",
      "key_observation": "Appellant entitled to opportunity to show cause."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Appellant entitled to reasonable opportunity to show cause against proposed action; order of termination bad in law.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Road Transport Corporations Act, 1950",
      "sections": [],
      "relevance": "Forms the respondent as autonomous statutory Corporation"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Article 226",
        "Article 227",
        "Article 311"
      ],
      "relevance": "Art. 226/227 for writ petition; Art. 311 not invocable"
    },
    {
      "name": "State Transport Corporation Regulations",
      "sections": [
        "Regulation No. 61",
        "Regulation 38",
        "Regulation 40",
        "Schedule A cl. 3, 4(b)"
      ],
      "relevance": "Govern service conditions; require notice/pay for termination; define misconduct including absence; mandate charge and opportunity for misconduct enquiry"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order and termination order quashed via certiorari; respondent not precluded from fresh enquiry after giving reasonable opportunity under cl. 4(b).",
    "relief_granted": "Writ of certiorari quashing dismissal order",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "A person against whom action is proposed to be taken for any act of misconduct, shall be provided with a copy of the charge or charges as well as a statement of allegations that have been made against him...",
      "speaker": "court",
      "significance": "Quotes cl. 4(b) mandating procedural safeguard"
    },
    {
      "text": "The appellant is entitled to a reasonable opportunity to show cause which includes an opportunity to deny his guilt and establish his innocence which he can do, only when he knows what the charges levelled against him are...",
      "speaker": "court",
      "significance": "Explains essence of natural justice in context"
    },
    {
      "text": "In our judgment the appellant was entitled to an opportunity to show cause against the action proposed to be taken against him. The order of termination passed against the appellant is bad in law...",
      "speaker": "court",
      "significance": "Core holding on violation"
    }
  ],
  "_case_id": "1965_165",
  "_label": 1,
  "_text_length": 7515,
  "_extracted_at": "2026-02-10T19:26:15.156603"
}