{
  "metadata": {
    "case_name": "Commissioner of Income Tax v. Nandlal Agarwalla & Ors.",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeal No. 820 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Shri Kishanlal Agarwalla died intestate in December 1950, leaving his widow and two minors, Basanta and Ashok.",
      "type": "background",
      "date": "1950-12",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Prior to his death, Shri Kishanlal Agarwalla was assessed as an individual on the income arising from the business carried on in the name of Shri Krishan Rice Mills, Tezpur. He was governed by Mitakshara School of Hindu Law.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The widow died in 1952.",
      "type": "background",
      "date": "1952",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On the death of the widow, an application was made by Shri Nandlal Agarwalla to the Court of the District Judge, Gauhati, for being appointed as guardian of the person and properties of the two minors. The District Judge by order dated June 1, 1953, appointed him temporarily the guardian till disposal of the application and transferred the file to Subordinate Judge, L.A.D., Nowgong.",
      "type": "procedural",
      "date": "1953-06-01",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On December 15, 1953, the Sub-Judge appointed Shri Dwarka Prasad Agarwalla and Shri Nandlal Agarwalla guardians of the person and properties as per the schedule in the application of Basanta and Ashok. Guardians directed to render accounts half yearly by 31st March and 30th September each year until minors attained majority.",
      "type": "procedural",
      "date": "1953-12-15",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "For assessment year 1954-55 (accounting year 1953-54), a return was filed in the status of a Joint Hindu Family by the two guardians.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On March 25, 1958, the Sub-Judge, Nowgong, passed order: Account upto 30th September, 1957 filed. Guardians allowed to keep and submit separate accounts henceforward for each minor together with accounts of profit and loss and separate expenses.",
      "type": "procedural",
      "date": "1958-03-25",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Income Tax Officer by order dated October 19, 1957, assessed the guardians under s. 23(3) read with s. 41 of the Act.",
      "type": "procedural",
      "date": "1957-10-19",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Guardians appealed to Appellate Assistant Commissioner contending assessment bad in law. AAC by order dated May 16, 1956, set aside assessment, directed ITO to reassess after obtaining two separate returns and frame two separate individual assessments. Held separate guardians appointed with directions to separately account establishes they cannot form a HUF. Relied on Sub-Judge order of March 25, 1958. Directed two separate assessments in names of minors at hands of guardians as individuals.",
      "type": "procedural",
      "date": "1956-05-16",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "ITO appealed to Income Tax Appellate Tribunal. Tribunal set aside AAC order, restored ITO order with modification that status be described as H.U.F. Held status of two minors is that of H.U.F. as existed before curatorship, to continue till elder minor attains majority.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Guardians applied to Tribunal under s. 35 on December 8, 1958, complaining contention under Hindu Law shares specific and determinate, assess under s. 41 individually not dealt with. Tribunal replied it was academic.",
      "type": "procedural",
      "date": "1958-12-08",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Tribunal refused to state case under s. 66(1), but on direction by Assam High Court, referred question: whether Tribunal justified in assessing income of minors in hands of guardians as income of HUF.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Assam High Court answered question in negative. Held guardians received shares separately, separate accounts opened, liable on separate incomes of each minor, not as HUF.",
      "type": "procedural",
      "date": "1961-07-04",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in the circumstances of the case the Tribunal was justified in assessing the income of the minors in the hands of the guardians as the income of a Hindu undivided family.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Under s. 40 the guardians were liable to pay tax in like manner and to the same amount as it would be leviable upon and recoverable from the minors if of full age. If minors of full age, they would have been assessed as a H.U.F.",
      "supporting_facts": [
        "f2",
        "f10"
      ],
      "legal_basis": "Section 40 of Indian Income Tax Act, 1922"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Minors would not have been assessed as H.U.F. but individually on separate incomes. Under s. 7 of Guardians and Wards Act no guardian could be appointed in respect of undivided interest, so Court proceeded on basis properties divided. Order dated March 25, 1958 shows interests separate.",
      "supporting_facts": [
        "f5",
        "f7",
        "f9"
      ],
      "legal_basis": "Section 7 of Guardians and Wards Act; Hindu Law (Mitakshara)"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Appointment of guardians valid, proceed on that basis. Order March 25, 1958 post-assessment year, no effect. Orders of June 1, 1953 and Dec 15, 1953 do not effect partition. On death of Kishanlal, widow and minors constituted joint HUF, business joint property. No positive action for partition. Court under Guardianship Act no jurisdiction to partition. If guardian carries business on behalf of minors, s.40 applies. Guardians assessed treating minors as constituting H.U.F.",
      "addresses_issue": "i1",
      "key_observation": "Till some positive action taken to partition, property remains joint family property."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "S. 40 plainly applies; guardians to be assessed treating minors as constituting a H.U.F.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Bindaj Lusuman Triputikar v. Mathurabai",
      "citation": "I.L.R. 30 Bombay 152",
      "treatment": "followed",
      "relevance": "Authority that when all coparceners minors, guardian can be appointed for the whole."
    },
    {
      "case_name": "Saifudin Alimohammed v. Commissioner of Income Tax",
      "citation": "25 I.T.R. 237",
      "treatment": "referred",
      "relevance": "Explained in later case; on guardian carrying business."
    },
    {
      "case_name": "Commissioner of Income Tax v. Balwantrai Jethalal Vaidya",
      "citation": "34 I.T.R. 187",
      "treatment": "followed",
      "relevance": "Chagla C.J. explained observations in Saifudin; if guardian carries business on behalf of minors and receives income, s.40 applies."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Income Tax Act, 1922",
      "sections": [
        "s. 66A(2)",
        "s. 66(2)",
        "s. 66(1)",
        "s. 23(3)",
        "s. 41",
        "s. 40",
        "s. 35"
      ],
      "relevance": "Basis for reference, assessment of guardians, status as HUF under s.40"
    },
    {
      "name": "Guardians and Wards Act",
      "sections": [
        "s. 7"
      ],
      "relevance": "No guardian could be appointed for undivided interest of minor"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal accepted. Question referred answered in the affirmative. High Court judgment reversed; assessment as H.U.F. upheld.",
    "relief_granted": "Revenue's appeal allowed",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"Till some positive action was taken to have a partition of the property, it would remain joint family property.\"",
      "speaker": "court",
      "significance": "Core reasoning on continuation of HUF status"
    },
    {
      "text": "\"S. 40 plainly applies to the facts of this case and consequently the guardians have to be assessed, treating the minors as constituting a H.U.F.\"",
      "speaker": "court",
      "significance": "Direct holding on applicability of s.40"
    }
  ],
  "_case_id": "1965_259",
  "_label": 1,
  "_text_length": 10402,
  "_extracted_at": "2026-02-10T19:27:38.479147"
}