{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Central Calcutta v. Standard Vacuum Oil Company",
    "case_year": null,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": null,
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Income-tax Appellate Tribunal referred three questions to High Court of Calcutta under s. 19 of the Business Profits Act 21 of 1947.",
      "type": "procedural",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f2",
      "text": "High Court answered all three questions in the affirmative in favour of the assessee.",
      "type": "procedural",
      "date": null,
      "source": "high_court"
    },
    {
      "id": "f3",
      "text": "Commissioner of Income-tax appealed to Supreme Court with special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Assessee company incorporated in Delaware, USA, to take over assets of Socony Vacuum Oil Company and Standard Oil Company New Jersey.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Capital of assessee: 10,000,000 divided into 100,000 shares of 100 each.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Book value of assets acquired: Socony Vacuum Oil Company 97,715,701; Standard Oil Company New Jersey 46,767,397.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "In consideration: allotted 49,995 shares each and serial bonds of 13,093,000 to Socony; remaining 10 shares divided equally for cash at par.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Excess of net value of assets over par value of stock and serial bonds entered as Capital paid in Surplus: reduced to 117,561,317 and unchanged during relevant period.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Serial bonds to Socony redeemed later.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Net profits earned shown as Earned Surplus: end 1945: 29,557,597; end 1948: 73,766,592.",
      "type": "material",
      "date": "1945-12-31",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Income-tax Officer disallowed inclusion of Capital paid in Surplus (117,000,000) and Earned Surplus (29M,43M,56M,73M for respective years) in computation of taxable capital under Sch. II r. 2(1).",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Appellate Assistant Commissioner agreed with ITO.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Tribunal held Capital paid in Surplus is premium under r.3 Sch.II or reserve under r.2(1); Earned Surplus is reserve under r.2(1).",
      "type": "admitted",
      "date": null,
      "source": "tribunal"
    },
    {
      "id": "f14",
      "text": "Singer's affidavit: par value limited to reduce taxes; no need for more shares.",
      "type": "background",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Table of Earned Surplus: shows additions from earnings, appropriations, used for fixed assets.",
      "type": "material",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts found the Tribunal was right in holding that the sum of 117,000,000 appearing in the Balance Sheet of the assessee Company under the head Capital paid in Surplus and constituting the excess of the book value of the assets over the face value of the shares represented premium realised from the issue of the shares as contemplated by Rule 3 of Schedule II of the Business Profits Tax, 1947.",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether on facts and in the circumstances of the case the Tribunal was right in holding that the fact that the amount in question had been built up out of capital and not out of taxed profits would not prevent it from being reserve as contemplated by Sub-Rule (1) of Rule 2 of the Schedule II of the Business Profits Tax Act.",
      "framed_by": "tribunal"
    },
    {
      "id": "i3",
      "text": "Whether on the facts and in the circumstances of the case, the Tribunal was right in holding that the sum of 29,000,000 odd, 43,000,000 odd, 56,000,000 odd and 73,000,000 odd for the respective years appearing in the Balance Sheets of the assessee as Earned Surplus would be treated as a reserve within the meaning of Sub-Rule (1) of Rule 2 of the Schedule II of the Business Profits Tax Act.",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Capital paid in Surplus is not premium realised from issue of shares; shares issued for assets, not cash.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Rule 3 Sch. II Business Profits Tax Act"
    },
    {
      "id": "pa2",
      "text": "Reserves under r.2(1) only those built out of profits processed for taxation under Indian Income-tax Act.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Rule 2(1) Sch. II; CIT v. Century Spg. Mfg. Co. (20 ITR 260)"
    },
    {
      "id": "pa3",
      "text": "Reserve created by revaluation or increasing book asset excluded by Explanation to r.2.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Explanation to Rule 2 Sch. II"
    },
    {
      "id": "pa4",
      "text": "Earned Surplus not reserves unless specifically allocated; mere undistributed profits not reserves.",
      "supporting_facts": [
        "f10"
      ],
      "legal_basis": "Century Spg. Mfg. Co. Ltd. (1954 SCR 203)"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Excess of assets over par value is premium realised from issue of shares, retained in business.",
      "supporting_facts": [
        "f6",
        "f7",
        "f8",
        "f14"
      ],
      "legal_basis": "Rule 3 Sch. II; US accounting practices; Companies Act 1913"
    },
    {
      "id": "ra2",
      "text": "Even if not premium, it is reserve not allowed in computing profits under IT Act.",
      "supporting_facts": [
        "f8"
      ],
      "legal_basis": "Rule 2(1) Sch. II"
    },
    {
      "id": "ra3",
      "text": "Earned Surplus is accumulation of retained profits for business use, equivalent to general reserve under US accounting.",
      "supporting_facts": [
        "f10",
        "f15"
      ],
      "legal_basis": "Rule 2(1) Sch. II; Table showing appropriations"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In US practice, shares issued at par less than assets value; excess is paid-in surplus akin to premium.",
      "addresses_issue": "i1",
      "key_observation": "Difference regarded as premium under Indian law; no restriction in Delaware law."
    },
    {
      "id": "cr2",
      "text": "Premium can arise from non-cash consideration like assets; arrangement implicit.",
      "addresses_issue": "i1",
      "key_observation": "High Court right; premium under r.3 or reserve under r.2(1)."
    },
    {
      "id": "cr3",
      "text": "Reserves under r.2(1) not limited to those from taxed profits; Century case observations obiter.",
      "addresses_issue": "i2",
      "key_observation": "Explanation implies reserves from other sources included."
    },
    {
      "id": "cr4",
      "text": "Not created by revaluation; real assets received.",
      "addresses_issue": "i2",
      "key_observation": "Explanation inapplicable."
    },
    {
      "id": "cr5",
      "text": "US accounting: Earned Surplus is self-contained yearly; residue after allocations is surplus for business, like general reserve.",
      "addresses_issue": "i3",
      "key_observation": "Table shows specific account retained for business; differs from Indian practice and Century case."
    },
    {
      "id": "cr6",
      "text": "Century case: no specific appropriation before dividend recommendation; here, US system allocates to Earned Surplus yearly.",
      "addresses_issue": "i3",
      "key_observation": "Conditions for reserve fulfilled."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Capital paid in Surplus is premium under r.3 Sch.II or alternatively reserve under r.2(1).",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Source from capital not taxed profits does not exclude from reserve under r.2(1).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "Earned Surplus treated as reserve under r.2(1) Sch.II.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax v. Century Spg. Mfg. Company Ltd.",
      "citation": "20 I.T.R. 260",
      "treatment": "reversed",
      "relevance": "High Court held undistributed profits as reserves; SC reversed, but distinguished here."
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay City v. Century Spg. Mfg. Co. Ltd.",
      "citation": "1954 S.C.R. 203",
      "treatment": "followed but distinguished",
      "relevance": "Undistributed profits not reserves without specific appropriation; differs due to US accounting."
    },
    {
      "case_name": "First National City Bank v. Commissioner of Income-tax, Bombay",
      "citation": null,
      "treatment": "followed",
      "relevance": "US accounting: Undivided Profits part of capital reserves under r.2(1)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Business Profits Tax Act, 1947",
      "sections": [
        "s.4",
        "s.2(17)",
        "s.2(1)",
        "Sch. II r.2(1)",
        "Sch. II r.3",
        "Sch. II Explanation",
        "s.19"
      ],
      "relevance": "Computation of capital for abatement; premium and reserves included in capital."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [
        "s.9",
        "s.10(2)(vii)"
      ],
      "relevance": "Reserves not allowed in computing profits."
    },
    {
      "name": "Companies Act, 1913",
      "sections": [
        "s.78(3)",
        "s.105A",
        "Sch. I Table A Reg.99",
        "s.132",
        "Sch. III Form F"
      ],
      "relevance": "Shares issued at premium for property; reserves before dividends."
    },
    {
      "name": "Companies Act, 1956",
      "sections": [
        "s.78"
      ],
      "relevance": "Restrictions on premium use; recognizes premiums under 1913 Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeals by the Commissioner fail and are dismissed. The High Court was right in answering the questions in the affirmative in favour of the assessee.",
    "relief_granted": "Assessee's claim for inclusion of Capital paid in Surplus and Earned Surplus in capital computation upheld.",
    "costs": "Dismissed with costs."
  },
  "key_quotes": [
    {
      "text": "\"So much of the premium realised by a company from the issue of any of its shares as it retained in the business shall be regarded as forming part of its paid-up capital for the purposes of rule 2.\"",
      "speaker": "court",
      "significance": "Direct quote from Rule 3 Sch.II, central to holding on premium."
    },
    {
      "text": "\"A reserve in the sense in which it is used in Rule 2 can only mean profits earned by a company and not distributed as dividends to the shareholders but kept back by the Directors for any purpose to which it may be put in future.\"",
      "speaker": "petitioner_counsel",
      "significance": "Relied on from Century (Bom HC), but held obiter and distinguished."
    },
    {
      "text": "\"The High Court was therefore right in holding that the account Capital Surplus shown in the balance sheet represents premium realised from the issue of its shares within the meaning of r. 3, or in the alternative represents reserves not allowed in computing the profits of the company for the purpose of the Indian Income-tax Act, 1922.\"",
      "speaker": "court",
      "significance": "Core holding on first two issues."
    },
    {
      "text": "\"The amounts entered in the account Earned Surplus cannot therefore be regarded as mere unallocated profits at the end of the accounting year.\"",
      "speaker": "court",
      "significance": "Distinguishes US Earned Surplus as reserve."
    }
  ],
  "_case_id": "1965_309",
  "_label": 0,
  "_text_length": 36188,
  "_extracted_at": "2026-02-10T19:28:24.531663"
}