{
  "metadata": {
    "case_name": "Bhaurao Shankar Lokhande & Anr. v. State of Maharashtra",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Raghubar Dayal, J."
    ],
    "case_number": "Criminal Appeal No. 178 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Bhaurao Shankar Lokhande, appellant No. 1, was married to the complainant Indubai in about 1956.",
      "type": "background",
      "date": "1956",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Appellant No. 1 married Kamlabai in February 1962, during the lifetime of Indubai.",
      "type": "material",
      "date": "1962-02",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Deorao Shankar Lokhande, appellant No. 2, is the brother of appellant No. 1.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Appellants No. 1 and 2, together with Kamlabai, her father (accused No. 4) and accused No. 5 (a barber), were tried for offence under S. 494 I.P.C.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Kamlabai, her father and accused No. 5 were acquitted by the Magistrate.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellant No. 1 convicted under S. 494 I.P.C. and appellant No. 2 under S. 494 read with S. 114 I.P.C.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Appeal to Sessions Judge dismissed.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Revision to Bombay High Court in Criminal Revision Application No. 388 of 1963 dismissed on August 19, 1963.",
      "type": "procedural",
      "date": "1963-08-19",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "At the alleged second marriage: Wooden sheets brought, carpet spread, accused No. 1 sat on one sheet, accused No. 3 (Kamlabai) on another nearby. Accused No. 4 performed Puja with Tambya-pitcher, betel leaves and coconut. Two garlands exchanged between accused No. 1 and 3. They struck each other's forehead.",
      "type": "material",
      "date": "1962-02",
      "source": "prosecution"
    },
    {
      "id": "f11",
      "text": "No invocation before sacred fire or saptapadi performed.",
      "type": "disputed",
      "date": "1962-02",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "No Brahmin priest called, no Mangala Ashtakas chanted, no custom to blow pipe Sher.",
      "type": "material",
      "date": "1962-02",
      "source": "prosecution"
    },
    {
      "id": "f13",
      "text": "Marriage performed at 10 p.m., not at maternal uncle's house (Surpan village) as per custom not requiring it for Gandharva.",
      "type": "material",
      "date": "1962-02",
      "source": "prosecution"
    },
    {
      "id": "f14",
      "text": "Witness Sitaram (PW2): Custom does not require Brahmin priest or barber; father makes boy and girl touch foreheads to complete Gandharva.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Witness Bhagwan (PW3): No necessity for Brahmin priest or Mangala Ashtakas in their community for Gandharva.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f16",
      "text": "Witness Jeebhau (PW4): Witnessed two prior Gandharvas; for last 5-7 years, no Brahmin, barber, Thakur required; formerly essential; maternal uncle or other makes foreheads touch.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the alleged second marriage of appellant No. 1 with Kamlabai in 1962 was duly performed in accordance with the religious rites applicable, i.e., essential ceremonies for a valid marriage.",
      "framed_by": "appellants"
    },
    {
      "id": "i2",
      "text": "Whether for commission of offence under S. 494 I.P.C., the second marriage must be a valid/solemnized one, or any form of marriage during lifetime of first spouse suffices, even if void.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the marriage was in Gandharva form as per custom in the community, modifying essential ceremonies.",
      "framed_by": "respondent"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Essential ceremonies for a valid marriage were not performed during the proceedings when appellant No. 1 and Kamlabai married each other.",
      "supporting_facts": [
        "f11"
      ],
      "legal_basis": "Hindu law essential ceremonies: invocation before sacred fire and saptapadi"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Proceedings of the marriage were in accordance with custom prevalent in the community for Gandharva form of marriage, making it valid.",
      "supporting_facts": [
        "f10",
        "f12",
        "f13",
        "f14",
        "f15",
        "f16"
      ],
      "legal_basis": "Custom in community for Gandharva marriage; Mulla's Hindu Law"
    },
    {
      "id": "ra2",
      "text": "Not necessary for offence under S. 494 I.P.C. that second marriage be valid; any form of marriage during lifetime of first wife commits offence even if void.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "S. 494 I.P.C."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S. 494 I.P.C. requires 'marries' to mean valid marriage; if not valid, no marriage in eye of law, so not void by reason of first spouse living.",
      "addresses_issue": "i2",
      "key_observation": "Prima facie, whoever marries must mean whoever marries validly."
    },
    {
      "id": "cr2",
      "text": "Under Hindu law pre-1955, second marriage not void; post-HMA S.17, void only if solemnized after commencement and spouse living.",
      "addresses_issue": "i2",
      "key_observation": "Solemnize means celebrate with proper ceremonies and due form."
    },
    {
      "id": "cr3",
      "text": "Essential ceremonies: invocation before sacred fire and saptapadi; not performed; no evidence custom abrogated them.",
      "addresses_issue": "i1",
      "key_observation": "Prosecution failed to prove custom continuously observed obtaining force of law."
    },
    {
      "id": "cr4",
      "text": "Ceremonies performed (garlands, puja, forehead touching) insufficient without evidence they alone suffice per custom.",
      "addresses_issue": "i3",
      "key_observation": "Witness statements do not establish custom dispensing with essentials."
    },
    {
      "id": "cr5",
      "text": "Recent departure (5-7 years) not custom under S.3(a) HMA.",
      "addresses_issue": "i3",
      "key_observation": "Custom must be continuously and uniformly observed for long time."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Marriage not performed in accordance with customary rites u/s 7 HMA or essential requirements; not solemnized u/s 17 HMA; does not attract S.494 IPC.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "For S.494 IPC post-HMA, second marriage must be solemnized to be void u/s 17.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "Indian Penal Code, 1860",
      "sections": [
        "Section 494",
        "Section 495",
        "Section 114"
      ],
      "relevance": "Defines offence of marrying again during lifetime of spouse; applies if marriage void u/s 17 HMA"
    },
    {
      "name": "Hindu Marriage Act, 1955",
      "sections": [
        "Section 5",
        "Section 17",
        "Section 7",
        "Section 3"
      ],
      "relevance": "S.5 conditions for marriage; S.17 voids second marriage if solemnized with spouse living; S.7 requires customary rites; S.3 defines custom"
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; convictions of appellant No. 1 under S.494 IPC and appellant No. 2 under S.494 r/w S.114 IPC set aside; appellants acquitted. Bail bonds of appellant No. 1 discharged.",
    "relief_granted": "Acquittal",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "'Solemnize' means, in connection with a marriage, to celebrate the marriage with proper ceremonies and in due form.",
      "speaker": "court",
      "significance": "Defines key term for applicability of S.17 HMA and S.494 IPC"
    },
    {
      "text": "There are two ceremonies essential to the validity of a marriage... 1 invocation before the sacred fire, and 2 saptapadi.",
      "speaker": "court",
      "significance": "Identifies indispensable rites not performed"
    },
    {
      "text": "The expressions 'custom' and 'usage' signify any rule which, having been continuously and uniformly observed for a long time, has obtained the force of law.",
      "speaker": "court",
      "significance": "Explains why prosecution failed to prove custom"
    }
  ],
  "_case_id": "1965_176",
  "_label": 1,
  "_text_length": 14206,
  "_extracted_at": "2026-02-10T19:26:21.096536"
}