{
  "metadata": {
    "case_name": "Amritsar Sugar Mills Co. Ltd. v. Commissioner of Sales Tax, U.P.",
    "case_year": 1965,
    "court": "Supreme Court of India",
    "judges": [
      "Sikri, J."
    ],
    "case_number": "Civil Appeal Nos. 86 to 89 of 1965",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee mills carries on the business of manufacturing and selling sugar and is registered as a dealer under the Uttar Pradesh Sales Tax Act, 1948.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "During the previous year relevant to the Assessment Year 1948-49, the assessee sold sugar to parties who carried on business outside Uttar Pradesh and delivered the same outside Uttar Pradesh.",
      "type": "material",
      "date": "1948-1949",
      "source": "petitioner"
    },
    {
      "id": "f3",
      "text": "The assessee sold sugar to parties who carried on business inside Uttar Pradesh but despatched the sugar to stations outside Uttar Pradesh in compliance with instructions issued by the buyers.",
      "type": "material",
      "date": "1948-1949",
      "source": "petitioner"
    },
    {
      "id": "f4",
      "text": "The assessee submitted an application under s. 5 of the Act in Form VII claiming 50% rebate on sales of sugar delivered outside Uttar Pradesh.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f5",
      "text": "Sales Tax Officer allowed rebate for sales to parties outside UP but rejected for sales to parties inside UP, holding property passed in UP.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f6",
      "text": "There were four assessment orders for quarters of 1948-49, first from April 1948 to July 1948.",
      "type": "procedural",
      "date": "1948-1949",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Assessee filed four revision applications before Judge (Revisions), Sales Tax; disposed by orders dated February 1, 1950 and December 5, 1950.",
      "type": "procedural",
      "date": "1950-02-01",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Judge (Revisions) held rebate only if buyer and delivery taker are same, and sales were to Tandon Bros. (selling agents inside UP), goods despatched to others outside UP per their instructions.",
      "type": "disputed",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Assessee filed applications under s. 11, rejected; High Court directed reference; consolidated statement stated.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "Assessee mills were members of Indian Sugar Syndicate Ltd., entitled to send sugar under Syndicate orders through selling agents Tandon Bros.",
      "type": "background",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Sales made through Tandon Bros. to buyers outside UP; goods despatched outside UP under instructions from buyers through agents; delivery made outside UP.",
      "type": "material",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f12",
      "text": "Standard contract dated October 16, 1948 between Amritsar Sugar Mills Co. Ltd. (Seller) and Tandon Brothers (Buyer) for sale of sugar F.O.R. Factory Rohana Kalan; delivery deemed when tendered ex-factory or F.O.R. station.",
      "type": "admitted",
      "date": "1948-10-16",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Contract clauses require buyer to give despatching instructions within specified time; seller to despatch per instructions; no responsibility for railway delays.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f14",
      "text": "Allahabad High Court held delivery contracted ex-factory in UP, no condition to deliver outside UP; referred to Lord Krishna Sugar Mills case.",
      "type": "procedural",
      "date": "1963-10-17",
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether in law the revising authority was right in holding that the sales in dispute were not for delivery outside Uttar Pradesh and that the applicant was not entitled to a rebate under sec. 5 of the Act.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the word 'delivery' in s. 5 means actual delivery or constructive delivery.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the sales by the assessee were for actual delivery outside Uttar Pradesh, depending on whether despatch instructions were part of the contract.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Sales were for delivery outside UP as goods despatched outside per buyers' instructions through selling agents; despatch instructions formed part of the contract.",
      "supporting_facts": [
        "f3",
        "f11",
        "f12",
        "f13"
      ],
      "legal_basis": "Section 5, U.P. Sales Tax Act, 1948"
    },
    {
      "id": "pa2",
      "text": "Assessee entitled to rebate under s. 5 as delivery actually made outside UP.",
      "supporting_facts": [
        "f2",
        "f4",
        "f11"
      ],
      "legal_basis": "Section 5, Notification thereunder"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Property passed in UP (ex-factory delivery); buyer (Tandon Bros. inside UP) different from delivery taker outside UP; rebate only if same party buys and takes delivery.",
      "supporting_facts": [
        "f5",
        "f8",
        "f12"
      ],
      "legal_basis": "Section 5, U.P. Sales Tax Act, 1948"
    },
    {
      "id": "ra2",
      "text": "Despatch instructions not part of contract but mode of performance; no term in contract requiring delivery outside UP.",
      "supporting_facts": [
        "f8",
        "f14"
      ],
      "legal_basis": "Lord Krishna Sugar Mills v. Commissioner Sales Tax, U.P."
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Word 'delivery' in s. 5 means actual delivery, not constructive, to promote export of notified goods like sugar; constructive delivery ex-factory would defeat object.",
      "addresses_issue": "i2",
      "key_observation": "Object is to encourage export; actual delivery outside fulfils intention."
    },
    {
      "id": "cr2",
      "text": "Despatch instructions contemplated by contract clauses are part of contract formation, specifying place of actual delivery, not mere mode of performance.",
      "addresses_issue": "i3",
      "key_observation": "Contract to deliver at place to be communicated; communication completes term."
    },
    {
      "id": "cr3",
      "text": "High Court erred in holding delivery ex-factory only; contract evinces intention to export with actual delivery outside.",
      "addresses_issue": "i1",
      "key_observation": "Sales for actual delivery outside UP."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The revising authority was not right; sales were for delivery outside UP; assessee entitled to rebate under s. 5.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "'Delivery' in s. 5 means actual physical delivery.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h3",
      "text": "Despatch instructions form part of the contract.",
      "resolves_issue": "i3",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "India Coffee and Tea Distributing Co. Ltd. v. State of Madras",
      "citation": "10 S.T.C. 359",
      "treatment": "followed",
      "relevance": "'Delivery' means physical delivery, not constructive, to promote export."
    },
    {
      "case_name": "Lord Krishna Sugar Mills v. Commissioner Sales Tax, U.P.",
      "citation": "Sales Tax Reference No. 263 of 1954",
      "treatment": "distinguished",
      "relevance": "High Court relied on it to hold no rebate absent explicit contract term for outside delivery; SC disagreed on despatch instructions."
    }
  ],
  "statutes_cited": [
    {
      "name": "Uttar Pradesh Sales Tax Act, 1948",
      "sections": [
        "Section 5",
        "Section 11"
      ],
      "relevance": "Rebate of half tax on notified goods like sugar sold for actual delivery outside UP; reference procedure."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court allowed the appeals, set aside Allahabad High Court judgment, held assessee entitled to rebate under s. 5 as sales were for actual delivery outside UP.",
    "relief_granted": "Rebate under s. 5 of the Act",
    "costs": "Appellant to have costs in High Court and Supreme Court."
  },
  "key_quotes": [
    {
      "text": "'Delivery' in s. 5 means actual delivery... object underlying s. 5 is to encourage export of goods manufactured in Uttar Pradesh.",
      "speaker": "court",
      "significance": "Interprets 'delivery' as physical to fulfil legislative intent."
    },
    {
      "text": "Despatch instructions... were part of the contract... communication of the place where actual delivery is to be given relates to formation of the contract.",
      "speaker": "court",
      "significance": "Holds despatch instructions integral to contract terms."
    },
    {
      "text": "The revising authority was not right in holding that the sales in dispute were not for delivery outside Uttar Pradesh.",
      "speaker": "court",
      "significance": "Direct answer to referred question in favour of assessee."
    }
  ],
  "_case_id": "1965_332",
  "_label": 1,
  "_text_length": 19171,
  "_extracted_at": "2026-02-10T19:28:06.124941"
}