{
  "metadata": {
    "case_name": "Pandurang Dhondi Chougule & others v. Maruti Hari Jadhav & others",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Gajendragadkar, C.J."
    ],
    "case_number": "Civil Appeal No. 163 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Mortgage deed executed by respondents' grandfather in favour of appellants' grandfather on August 29, 1881, mortgaging six agricultural lands at Kapil in former State of Oundh for Rs. 575 with possession.",
      "type": "background",
      "date": "1881-08-29",
      "source": "respondents"
    },
    {
      "id": "f2",
      "text": "Respondents' predecessors-in-interest sued on the mortgage in Civil Suit No. 28 of 1908-09 in Court of Sub-Judge at Kapil, which was withdrawn with liberty to file fresh suit.",
      "type": "procedural",
      "date": null,
      "source": "respondents"
    },
    {
      "id": "f3",
      "text": "Respondents sued for redemption of the mortgage in Civil Suit No. 102 of 1932-33 in the same court; decree passed on September 2, 1936, directing payment of Rs. 3,677-12-6 within six months from date drawn, failing which plaintiffs deemed to have lost right of redemption for all time.",
      "type": "material",
      "date": "1936-09-02",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Decretal amount not paid; appellants in possession of mortgaged property not as mortgagees but as owners from 2nd March, 1937.",
      "type": "material",
      "date": "1937-03-02",
      "source": "lower_court"
    },
    {
      "id": "f5",
      "text": "State of Oundh merged in erstwhile State of Bombay; Bombay Agricultural Debtors Relief Act, 1939 extended to Oundh.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Appellants filed application for adjustment of debt due under decree in Suit No. 102/1932-33 on May 19, 1949, as a matter of precaution without prejudice to contention that equity of redemption extinguished.",
      "type": "procedural",
      "date": "1949-05-19",
      "source": "petitioner"
    },
    {
      "id": "f7",
      "text": "Respondents moved B.A.D.R. Court at Karad on May 26, 1949, for adjustment of debt under the mortgage, claiming decree was preliminary, debt subsisting, equity of redemption unextinguished.",
      "type": "procedural",
      "date": "1949-05-26",
      "source": "respondent"
    },
    {
      "id": "f8",
      "text": "Two applications consolidated by trial court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Trial court (Joint Civil Judge, Karad): rejected appellants' argument that mortgage extinguished, held equity of redemption vested in respondents, but respondents' application barred by time; dismissed respondents' application.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "District Court, North Satara (appeal): decree in Suit No. 102/1932-33 was final decree extinguishing right to redeem on failure to pay; application barred by limitation; dismissed appeal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Bombay High Court in Civil Revision Application No. 2131 of 1957: interlocutory judgment remanding to trial court to try if Code of Civil Procedure applied to Oundh at relevant time.",
      "type": "procedural",
      "date": "1960-10-31",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "On remand, trial court found Code of Civil Procedure made applicable to Oundh as far back as 1909-10.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "On remand, trial court found appellants in possession as owners from 2nd March, 1937.",
      "type": "material",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Bombay High Court final order dated October 31, 1960: decree did not extinguish right to redeem; application not barred by time (as for adjustment under decree); set aside lower courts' orders, remanded to trial court.",
      "type": "procedural",
      "date": "1960-10-31",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the decree in Civil Suit No. 102 of 1932-33 extinguished the respondents' right to redeem the mortgage.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the Bombay High Court was justified in interfering under s. 115 CPC with the District Court's finding on the effect of the decree.",
      "framed_by": "court"
    },
    {
      "id": "i3",
      "text": "Whether the respondents' application under the Bombay Agricultural Debtors Relief Act, 1939 was barred by time.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Mortgage extinguished by final decree in Suit No. 102/1932-33 due to non-payment within time; respondents not entitled to adjustment; their application barred by time.",
      "supporting_facts": [
        "f3",
        "f4",
        "f9"
      ],
      "legal_basis": "Decree terms"
    },
    {
      "id": "pa2",
      "text": "High Court exceeded jurisdiction under s. 115 CPC in reversing District Court's construction of decree as it was not a jurisdictional error; construction of decree is question of law not relating to jurisdiction.",
      "supporting_facts": [
        "f10",
        "f14"
      ],
      "legal_basis": "Section 115 CPC; precedents: Manindra Land, Vora Abbasbhai"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Decree was preliminary; appellants failed to apply for final decree; mortgage debt subsisting, equity of redemption unextinguished; entitled to adjustment under Act.",
      "supporting_facts": [
        "f3",
        "f7"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "High Court exceeded jurisdiction under s. 115 CPC; errors of law in construing decree do not relate to jurisdiction unless affecting assumption/failure/exercise of jurisdiction; construction of decree not jurisdictional.",
      "addresses_issue": "i2",
      "key_observation": "Plea going to root of jurisdiction (e.g., limitation, res judicata) can be reviewed, but not mere erroneous construction of decree in debt adjustment proceedings."
    },
    {
      "id": "cr2",
      "text": "District Court correctly held decree extinguished equity of redemption; High Court erred in interfering.",
      "addresses_issue": "i1",
      "key_observation": "Finding on subsistence of debt left to courts administering Act; error therein not jurisdictional."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court cannot correct subordinate court's erroneous construction of decree under s. 115 CPC unless it relates to jurisdiction.",
      "resolves_issue": "i2",
      "in_favor_of": "petitioner"
    },
    {
      "id": "h2",
      "text": "Decree in Suit No. 102/1932-33 extinguished respondents' equity of redemption.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Manindra Land and Building Corporation Ltd. v. Bhutnath Banerjee and Others",
      "citation": "A.I.R. 1964 S.C. 1336",
      "treatment": "followed",
      "relevance": "Distinction between errors of law relating to jurisdiction and those that do not for s.115 CPC."
    },
    {
      "case_name": "Vora Abbasbhai Alimahomed v. Haji Gulamnabi Haji Safibhai",
      "citation": "A.I.R. 1964 S.C. 1341",
      "treatment": "followed",
      "relevance": "Effect of decisions on revisional jurisdiction under s.115 CPC regarding errors of law and jurisdiction."
    }
  ],
  "statutes_cited": [
    {
      "name": "Bombay Agricultural Debtors Relief Act, 1939",
      "sections": [
        "No. 28 of 1939"
      ],
      "relevance": "Proceedings initiated for adjustment of debt under the Act extended to Oundh."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "Section 115"
      ],
      "relevance": "Limits on High Court's revisional jurisdiction; applied to Oundh since 1909-10."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Appeal allowed; High Court order set aside; District Court order restored dismissing respondents' application for debt adjustment.",
    "relief_granted": "Restoration of District Court decree in favor of appellants",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The plaintiffs should pay to defendants I and 2 Rs. 3,677-12-6 within six months from today and should recover possession of the suit property as the heirs of Gopala free from the mortgage. In case the plaintiffs do not pay the amount within the prescribed time, the plaintiffs shall be deemed to have lost the right of redemption for all time.\"",
      "speaker": "court",
      "significance": "Operative part of decree in Suit No. 102/1932-33 central to whether redemption right extinguished."
    },
    {
      "text": "\"While exercising its jurisdiction under s. 115, it is not competent to the High Court to correct errors of fact however gross they may, or even errors of law, unless the said errors have relation to the jurisdiction of the Court to try the dispute itself.\"",
      "speaker": "court",
      "significance": "Key principle limiting s.115 CPC revisional jurisdiction."
    }
  ],
  "_case_id": "1965_356",
  "_label": 1,
  "_text_length": 16144,
  "_extracted_at": "2026-02-10T19:28:50.154455"
}