{
  "metadata": {
    "case_name": "Rajeswar Prosad Misra v. Dabur Dr. S.K. Burman Private Ltd.",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Criminal Appeal No. 19 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was a traveling salesman of Messrs. Dabur Dr. S.K. Burman Private Ltd. operating in suburbs of Calcutta and Mill Area, duty to secure orders, effect delivery in company vans, receive payments from agents and deposit with cashier.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On 10th February 1958, appellant received Rs. 300 on behalf of company from Isaq and Son.",
      "type": "material",
      "date": "1958-02-10",
      "source": "prosecution"
    },
    {
      "id": "f3",
      "text": "On 19th February 1958, appellant received Rs. 240 on behalf of company from Isaq and Son.",
      "type": "material",
      "date": "1958-02-19",
      "source": "prosecution"
    },
    {
      "id": "f4",
      "text": "On 3rd May 1958, appellant received Rs. 1502 on behalf of company from Bombay Fancy Stores.",
      "type": "material",
      "date": "1958-05-03",
      "source": "prosecution"
    },
    {
      "id": "f5",
      "text": "Appellant failed to deposit the sums of Rs. 300, Rs. 240 and Rs. 1502 with the cashier.",
      "type": "disputed",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f6",
      "text": "Complaint filed against appellant on August 29, 1958 in Court of Chief Presidency Magistrate, Calcutta.",
      "type": "procedural",
      "date": "1958-08-29",
      "source": "prosecution"
    },
    {
      "id": "f7",
      "text": "Charges framed under s. 408 IPC on July 16, 1959.",
      "type": "procedural",
      "date": "1959-07-16",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Prosecution proved receipt of money by appellant and failure to deposit.",
      "type": "admitted",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f9",
      "text": "Defence: Appellant deposited amounts; case was counter-blast to dispute with V.D. Srivastava (sales supervisor) who took documents; appellant filed case against Srivastava, S.N. Mukerjea, R.C. Burman etc. before Police Magistrate, Alipore.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f10",
      "text": "On August 17, 1959, appellant served notice through counsel to produce documents: Sale Book Mill Area 1958, Collection Register Jan 2 to Jul 15 1958, Challans 1958 for specific agents, Agency Ledger 1958, Staff Security Deposit Register, commission register for 1957-58.",
      "type": "procedural",
      "date": "1959-08-17",
      "source": "petitioner"
    },
    {
      "id": "f11",
      "text": "Complainant's counsel replied objecting to production without particulars for some documents; offered to produce relevant parts on specifics.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f12",
      "text": "Documents not produced.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Suggestion in cross-examination that documents withheld as they would show deposit made.",
      "type": "disputed",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f14",
      "text": "A.C. Burman (PW7) stated documents not produced without particulars; 20 Sale Books in 1958; denied withholding to falsify complaint.",
      "type": "admitted",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f15",
      "text": "Appellant produced no evidence in rebuttal.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f16",
      "text": "Presidency Magistrate acquitted appellant on March 7, 1960, holding complainant failed to disprove deposit claim; benefit of doubt due to non-production of documents.",
      "type": "procedural",
      "date": "1960-03-07",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "Complainant obtained special leave under s.417(3) CrPC from Calcutta High Court to appeal acquittal; Criminal Appeal No. 295 of 1960.",
      "type": "procedural",
      "date": null,
      "source": "prosecution"
    },
    {
      "id": "f18",
      "text": "High Court (S.K. Sen and A.C. Roy JJ) on June 28, 1962 ordered production of agency ledgers for Md. Isaq and Sons and Bombay Fancy Stores, and Collection Book Part I 1958; directed Magistrate to prove documents and allow cross-examination.",
      "type": "procedural",
      "date": "1962-06-28",
      "source": "court"
    },
    {
      "id": "f19",
      "text": "Complainant produced documents, examined two witnesses; High Court allowed appeal, set aside acquittal, convicted under s.408 IPC on three counts, sentenced to RI 1 year aggregate and fine Rs.2000 (default 6 months RI); judgment September 5, 1962.",
      "type": "procedural",
      "date": "1962-09-05",
      "source": "court"
    },
    {
      "id": "f20",
      "text": "Appellant filed appeal by special leave to Supreme Court.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the High Court acted beyond jurisdiction conferred by s.428 CrPC in receiving additional evidence in appeal against acquittal, thereby improving prosecution case.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "High Court exceeded jurisdiction under s.428 CrPC by taking additional evidence available at trial but not produced despite demand; prosecution should not get second chance to fill gaps; relies on Abinash Chandra Bose v. Bimal Krishna Sen.",
      "supporting_facts": [
        "f10",
        "f11",
        "f12",
        "f16"
      ],
      "legal_basis": "s.428 CrPC; Abinash Chandra Bose v. Bimal Krishna Sen AIR 1963 SC 316"
    },
    {
      "id": "pa2",
      "text": "No essential difference between ordering retrial under s.423 or additional evidence under s.428; Magistrate presumed against complainant for non-production, High Court deprived appellant of benefit.",
      "supporting_facts": [
        "f16"
      ],
      "legal_basis": "s.423, s.428 CrPC"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Principles restated in Ukha Kolhe v. State of Maharashtra; additional evidence permissible if necessary; High Court has wide powers in appeals against acquittal per Sheo Swarup.",
      "supporting_facts": [
        "f18",
        "f19"
      ],
      "legal_basis": "s.417, 423, 428 CrPC; Ukha Kolhe v. State of Maharashtra AIR 1963 SC 1531"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Code does not differentiate powers in appeals from conviction vs acquittal except access; s.423 empowers High Court in acquittal appeal to reverse, direct inquiry/retrial/commit for trial or find guilty/pass sentence; s.428 allows additional evidence if necessary, reasons recorded.",
      "addresses_issue": "i1",
      "key_observation": "Powers under ss.417,418,423 same for both appeals; wide review power per Sheo Swarup, no limitation except proper weight to trial views, innocence presumption etc."
    },
    {
      "id": "cr2",
      "text": "Abinash Chandra Bose held retrial not justified to fill prosecution gaps; Ukha Kolhe listed exceptional retrial cases, suggested s.428 alternative; no exhaustive list, discretion guided by fair play.",
      "addresses_issue": "i1",
      "key_observation": "Additional evidence necessary not for impossibility of judgment but to avoid failure of justice; exercised sparingly, no prejudice to accused; not disguise for retrial."
    },
    {
      "id": "cr3",
      "text": "Here, documents demanded by accused but not produced due to lack of particulars; Magistrate acquitted solely on non-production; oral evidence showed no deposit; fair play required documents for accused to verify; High Court properly exercised discretion.",
      "addresses_issue": "i1",
      "key_observation": "Overwhelming evidence of receipt and non-deposit; additional evidence filled gap without second chance abuse as accused demanded it."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "High Court acted within powers conferred by s.428 CrPC in ordering and receiving additional evidence in appeal against acquittal.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Abinash Chandra Bose v. Bimal Krishna Sen",
      "citation": "AIR 1963 SC 316",
      "treatment": "referred",
      "relevance": "Retrial not justified to allow prosecution second chance to adduce available evidence."
    },
    {
      "case_name": "Ukha Kolhe v. State of Maharashtra",
      "citation": "AIR 1963 SC 1531",
      "treatment": "followed",
      "relevance": "Principles for retrial exceptional; s.428 alternative for additional evidence."
    },
    {
      "case_name": "Sheo Swarup v. King Emperor",
      "citation": "61 I.A. 398",
      "treatment": "followed",
      "relevance": "High Court full power to review evidence in acquittal appeal, no limitations except proper consideration of trial factors."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "408"
      ],
      "relevance": "Charges and conviction for criminal breach of trust by employee."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "417(3)",
        "418",
        "423",
        "428",
        "403"
      ],
      "relevance": "Appeal against acquittal, powers of appellate court to reverse acquittal, take additional evidence, no double jeopardy bar if conviction/acquittal set aside."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "20(2)"
      ],
      "relevance": "No person vexed twice for same offence, but protection lasts only while conviction/acquittal stands."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court dismissed the appeal, upholding High Court's order setting aside acquittal, conviction under s.408 IPC on three counts, and sentence of rigorous imprisonment for one year aggregate and fine of Rs. 2,000 (default 6 months RI).",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The power must be exercised sparingly and only in suitable cases. Once such action is justified, there is no restriction on the kind of evidence which may be received.\"",
      "speaker": "court",
      "significance": "Defines limits on s.428 CrPC additional evidence power."
    },
    {
      "text": "\"Additional evidence must be necessary not because it would be impossible to pronounce judgment but because there would be failure of justice without it.\"",
      "speaker": "court",
      "significance": "Criterion for admitting additional evidence."
    },
    {
      "text": "\"Sections 417, 418 and 423 of the Code give to the High Court full power to review at large the evidence upon which the order of acquittal was founded.\"",
      "speaker": "court",
      "significance": "Affirms broad appellate powers per Sheo Swarup."
    }
  ],
  "_case_id": "1965_277",
  "_label": 0,
  "_text_length": 23974,
  "_extracted_at": "2026-02-10T19:27:44.150067"
}