{
  "metadata": {
    "case_name": "Harbhajan Singh v. Respondents",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Ramaswami J."
    ],
    "case_number": "Civil Appeal No. 447 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "In the year 1955, consolidation proceedings under East Punjab Holdings Consolidation and Prevention of Fragmentation Act, 1948 were started in the village Bholpur of District Ludhiana.",
      "type": "background",
      "date": "1955",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "A scheme for consolidation of holdings was published on 29th March, 1956.",
      "type": "procedural",
      "date": "1956-03-29",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On 14th May, 1956 that scheme was confirmed under s. 20 of the Act.",
      "type": "procedural",
      "date": "1956-05-14",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Consolidation Officer accordingly re-allotted parcels of land to the appellant and respondents Nos. 1 and 8 in the village of Bholpur.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Being dissatisfied with the allotment, respondents 1 and 8 preferred appeals under s. 21(3) of the Act but these appeals were dismissed by the Settlement Officer.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondents 1 and 8 thereafter preferred further appeals under s. 21(4) of the Act to the Assistant Director, Consolidation of Holdings.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The Assistant Director partially allowed the appeal of respondent No. 1 by his order dated 29th October, 1957 but dismissed the appeal of respondent No. 8.",
      "type": "procedural",
      "date": "1957-10-29",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "On 10th February, 1958, the appellant moved the State Government under s. 42 of the Act for revision of the order passed by the Assistant Director in the appeal of respondent No. 1.",
      "type": "procedural",
      "date": "1958-02-10",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Harbhajan Singh had filed two copies of the application under s. 42 of the Act.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On one copy the Director of Consolidation of Holdings passed an order on 17th February, 1958 that the application should be put up with previous papers.",
      "type": "procedural",
      "date": "1958-02-17",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "On the second copy of the application the Director passed an order on 3rd April, 1958 to the following effect - The order of Assistant Director, Consolidation of Holdings, under s. 21(4) need not be amended. File Inform.",
      "type": "procedural",
      "date": "1958-04-03",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "On the copy of the application on which the order of 17th February, 1958 was passed, the Director heard the parties and passed his order on 29th August, 1958 by which he allowed the application of Harbhajan Singh and set aside the order of the Assistant Director.",
      "type": "procedural",
      "date": "1958-08-29",
      "source": "court"
    },
    {
      "id": "f13",
      "text": "The Director held that the original order made by the Assistant Director on 29th October, 1957 was contrary to the scheme and was based upon a mistake of fact.",
      "type": "material",
      "date": "1958-08-29",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Respondent No. 1 thereafter moved the Punjab High Court under Art. 226 of the Constitution for quashing the order of the Director, Consolidation of Holdings, made on 29th August, 1958.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "The application was allowed by the High Court on 11th January, 1960 on the ground that the Director, Consolidation of Holdings, was not competent to pass the order dated 29th August, 1958 in view of his previous order dated 3rd April, 1958 dismissing the application of Harbhajan Singh.",
      "type": "procedural",
      "date": "1960-01-11",
      "source": "court"
    },
    {
      "id": "f16",
      "text": "The appellant took the matter in appeal under Letters Patent but the appeal was dismissed on 19th April, 1960.",
      "type": "procedural",
      "date": "1960-04-19",
      "source": "lower_court"
    },
    {
      "id": "f17",
      "text": "This appeal is brought by Special Leave from the judgment and decree of the Punjab High Court dated 19th April, 1960 in Letters Patent Appeal No. 128 of 1960.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "whether the Director, Consolidation of Holdings, had power to review his previous order dated 3rd April, 1958 dismissing Harbhajan Singh's application, and whether his subsequent order made under s. 42 of the Act dated 29th August, 1958 is legally valid ?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [],
  "respondent_arguments": [],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "S. 42 of the Act states The State Government may at any time for the purpose of satisfying itself as to the legality or propriety of any order passed, scheme prepared or confirmed or repartition made by any officer under this Act call for and examine, the record of any case pending before or disposed of by such officer and may pass such order in reference thereto as it thinks fit Provided that no order, scheme or repartition shall be varied or reversed without giving the parties interested notice to appear and opportunity to be heard except in cases where the State Government is satisfied that the proceedings have been vitiated by unlawful consideration.",
      "addresses_issue": "i1",
      "key_observation": "There is no provision in the Act granting express power of review to the State Government with regard to an order made under s. 42 of the Act."
    },
    {
      "id": "cr2",
      "text": "In the absence of any such express power, it is manifest that the Director, Consolidation of Holdings, cannot review his previous order of 3rd April, 1958 dismissing the application of Harbhajan Singh under s. 42 of the Act.",
      "addresses_issue": "i1",
      "key_observation": "It follows therefore that the order of the Director dated 29th August, 1958 is ultra vires and without jurisdiction."
    },
    {
      "id": "cr3",
      "text": "Cites precedents like Drew v. Willis, Hession v. Jones, Anantharaju Shetty v. Appu Hegada, Baijnath Ram Goenka v. Nand Kumar Singh, and Patel Chunibhai Dajibhai etc. v. Narayanrao Khanderao Jambekar establishing that no court or authority has power to review unless given by statute.",
      "addresses_issue": "i1",
      "key_observation": "The same principle applies to the present case and the Director had no power to review his previous order."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The Director, Consolidation of Holdings had no power to review his previous order dated 3rd April, 1958 rejecting the application of Harbhajan Singh under s. 42 of the Act.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The subsequent order of the Director dated 29th August, 1958 allowing the application was ultra vires and illegal.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Drew v. Willis",
      "citation": "[1891] 1 Q.B. 450",
      "treatment": "followed",
      "relevance": "No court or authority has a power of setting aside an order which has been properly made, unless it is given by statute."
    },
    {
      "case_name": "Hession v. Jones",
      "citation": "[1914] 2 K.B. 421",
      "treatment": "followed",
      "relevance": "Court has no power to review an order deliberately made after argument."
    },
    {
      "case_name": "Anantharaju Shetty v. Appu Hegada",
      "citation": "A.I.R. 1919 Madras 244",
      "treatment": "followed",
      "relevance": "Power to review must be given by the statute."
    },
    {
      "case_name": "Baijnath Ram Goenka v. Nand Kumar Singh",
      "citation": "40 I.A. 54",
      "treatment": "followed",
      "relevance": "Commissioner had no power to review his final order annulling a sale."
    },
    {
      "case_name": "Patel Chunibhai Dajibhai etc. v. Narayanrao Khanderao Jambekar and Another",
      "citation": "1965 2 S.C.R. 328",
      "treatment": "followed",
      "relevance": "Collector had no power to review his previous decisions under s.76A in absence of review power."
    }
  ],
  "statutes_cited": [
    {
      "name": "East Punjab Holdings (Consolidation and Prevention of Fragmentation) Act, 1948",
      "sections": [
        "s. 20",
        "s. 21(3)",
        "s. 21(4)",
        "s. 42"
      ],
      "relevance": "Governs consolidation proceedings, appeals, and revision powers; no express review power under s.42."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226"
      ],
      "relevance": "High Court quashed Director's order under writ jurisdiction."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The appeal is dismissed. The Supreme Court holds that the Director had no power to review his earlier order and the High Court was right in quashing the Director's order dated 29th August, 1958.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"no court and I would add no authority has a power of setting aside an order which has been properly made, unless it is given by statute.\"",
      "speaker": "court",
      "significance": "Principle from Drew v. Willis adopted by the court."
    },
    {
      "text": "There is no provision in the Act granting express power of review to the State Government with regard to an order made under s. 42 of the Act.",
      "speaker": "court",
      "significance": "Core reasoning for holding the Director's order ultra vires."
    },
    {
      "text": "It follows therefore that the order of the Director dated 29th August, 1958 is ultra vires and without jurisdiction and the High Court was right in quashing that order.",
      "speaker": "court",
      "significance": "Conclusion affirming High Court's decision."
    }
  ],
  "_case_id": "1965_248",
  "_label": 0,
  "_text_length": 14613,
  "_extracted_at": "2026-02-10T19:27:38.187827"
}