{
  "metadata": {
    "case_name": "Appellant v. State",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Criminal Appeal No. 18 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant was shed clerk at Sainthia Railway Station alleged to have committed criminal breach of trust with respect to 8 bags of suji booked by rail at Murarai by Bhikam Chand Pipria, consignee firm of Lalchand Phusraj of Sainthia, in conspiracy with Ibrahim and Nepal Chandra Das.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Offence investigated, charge sheet submitted against appellant under s. 409 I.P.C. and two others by Officer-in-charge, Government Railway Police, Asansol.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Case distributed to Birbhum Special Court for trial by notification No. 4515-J dated May 8, 1959, Law Judicial Department, Government of West Bengal.",
      "type": "procedural",
      "date": "1959-05-08",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "First trial before Mr. N.C. Ganguly, Judge, Birbhum Special Court: prosecution examined 21 witnesses, charge framed against appellant under s. 409 I.P.C. on August 28, 1959, prosecution witnesses cross-examined, appellant examined under s. 342 CrPC.",
      "type": "procedural",
      "date": "1959-08-28",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "During arguments in first trial, Public Prosecutor placed High Court judgment in Criminal Appeal No. 377 of 1958 and A.P. Misra v. State holding Special Court cannot take cognizance on charge sheet post-amendment of s.5(1) West Bengal Criminal Law Amendment (Special Courts) Act, 1949 by Act 27 of 1956.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Mr. Ganguly acquitted appellant holding proceedings without jurisdiction as Special Court could not take cognizance on charge sheet; did not discuss merits.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f7",
      "text": "Formal complaint preferred by Public Prosecutor on May 16, 1960.",
      "type": "procedural",
      "date": "1960-05-16",
      "source": "prosecution"
    },
    {
      "id": "f8",
      "text": "Second trial before Mr. T. Bhattacharjee, successor Judge, Birbhum Special Court: took cognizance, framed charge under s. 409 I.P.C., convicted appellant to rigorous imprisonment for four years.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "High Court in Criminal Appeal No. 601 of 1960 maintained conviction but reduced sentence to rigorous imprisonment for two years, judgment dated September 24, 1962.",
      "type": "procedural",
      "date": "1962-09-24",
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the trial and conviction of the appellant for an offence under s. 409 I.P.C. were barred by s. 403 CrPC due to earlier acquittal by Mr. Ganguly.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Appellant was tried earlier by Mr. Ganguly on same facts and for same offence under s. 409 I.P.C. and acquitted, so cannot be tried again; proceedings completed as charge framed, witnesses examined, appellant examined under s.342; court competent as offence cognizable by Special Court; under s.494 CrPC, post-charge withdrawal leads only to acquittal.",
      "supporting_facts": [
        "f1",
        "f2",
        "f4",
        "f6"
      ],
      "legal_basis": "s.403 CrPC; s.494 CrPC; Ajit Kumar Palit v. State of West Bengal"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "First proceedings before Mr. Ganguly without jurisdiction as Special Court could not take cognizance on charge sheet per High Court decisions.",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "West Bengal Criminal Law Amendment (Special Courts) Act, 1949 s.5(1) as amended; High Court Cr App 377/1958; A.P. Misra v. State"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.403 CrPC bars retrial only if previous trial by court of competent jurisdiction ending in acquittal; competence requires proper cognizance under CrPC Chapter XV Part B; Mr. Ganguly erroneously held no jurisdiction to take cognizance, so acquittal nullity, no jeopardy.",
      "addresses_issue": "i1",
      "key_observation": "Order of acquittal by court lacking jurisdiction (or opining so) is nullity; no bar under s.403."
    },
    {
      "id": "cr2",
      "text": "Even though charge framed and evidence recorded, no valid trial without jurisdiction; s.494 assumes competent charge and court.",
      "addresses_issue": "i1",
      "key_observation": "Proceedings before incompetent court not a 'trial' under s.403."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Acquittal by court which erroneously believes it lacks jurisdiction to take cognizance is a nullity and does not bar fresh trial under s.403 CrPC.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "High Court judgment in Criminal Appeal No. 377 of 1958",
      "citation": null,
      "treatment": "followed",
      "relevance": "Special Court cannot take cognizance on charge sheet post s.5(1) amendment."
    },
    {
      "case_name": "A.P. Misra v. The State",
      "citation": "1958 Cr. L.J. 1386",
      "treatment": "followed",
      "relevance": "Proceedings without jurisdiction to take cognizance on charge sheet are invalid."
    },
    {
      "case_name": "Ajit Kumar Palit v. State of West Bengal",
      "citation": "1963 1 Supp. S.C.R. 953",
      "treatment": "referred",
      "relevance": "Special Court could properly take cognizance."
    },
    {
      "case_name": "Thomas Ewart Flower v. R.",
      "citation": "40 Cr. App. R. 189",
      "treatment": "followed",
      "relevance": "Auterfois acquit inapplicable where first court lacked jurisdiction."
    },
    {
      "case_name": "Yusofally Mulla Noorbhoy v. The King",
      "citation": "L.R. 76 I.A. 158",
      "treatment": "followed",
      "relevance": "Acquittal in proceedings without valid sanction/jurisdiction is nullity, no bar to retrial."
    },
    {
      "case_name": "Basdeo Agarwalla v. King Emperor",
      "citation": "1945 F.C.R. 93",
      "treatment": "followed",
      "relevance": "Prosecution without valid sanction invalid; no jeopardy unless lawful trial."
    }
  ],
  "statutes_cited": [
    {
      "name": "Indian Penal Code",
      "sections": [
        "409"
      ],
      "relevance": "Offence charged."
    },
    {
      "name": "Code of Criminal Procedure",
      "sections": [
        "403",
        "342",
        "236",
        "237",
        "251-A",
        "190(1)(c)",
        "191",
        "494"
      ],
      "relevance": "Bar to retrial; trial procedure; cognizance; withdrawal."
    },
    {
      "name": "West Bengal Criminal Law Amendment (Special Courts) Act, 1949",
      "sections": [
        "5(1)"
      ],
      "relevance": "Amended by Act 27 of 1956; Special Court cognizance procedure."
    },
    {
      "name": "Constitution of India",
      "sections": [
        "20"
      ],
      "relevance": "Incorporates double jeopardy principle."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; conviction and sentence under s.409 IPC by Special Court upheld as previous acquittal nullity without jurisdictional bar under s.403 CrPC.",
    "relief_granted": null,
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"A person who has once been tried by a Court of competent jurisdiction for an offence and convicted or acquitted of such offence shall... not be liable to be tried again for the same offence.\"",
      "speaker": "court",
      "significance": "Quotes s.403(1) CrPC central to issue."
    },
    {
      "text": "\"The defence of autrefois acquit, however, has no application where the accused person was not liable lawfully to be convicted at the first trial because the court lacked jurisdiction.\"",
      "speaker": "court",
      "significance": "Key principle applied to hold acquittal nullity."
    },
    {
      "text": "\"An order of acquittal made by it is in fact a nullity.\"",
      "speaker": "court",
      "significance": "Direct holding on first acquittal's effect."
    }
  ],
  "_case_id": "1965_185",
  "_label": 0,
  "_text_length": 16425,
  "_extracted_at": "2026-02-10T19:26:19.946892"
}