{
  "metadata": {
    "case_name": "Appellant v. Amardas & Ors.",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Mudholkar, J."
    ],
    "case_number": "Civil Appeal No. 471 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Appellant has a share of 1221/143 1/2 in the land in suit.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Occupancy tenant of the land is Akhara Nirbansar of Sultanwind Gate, Amritsar.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Second respondent Ram Saran Das was Mahant of Akhara till 1950, removed by civil court order in suit under s.92 CPC, confirmed in appeal on September 11, 1950.",
      "type": "background",
      "date": "1950-09-11",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "Respondent No.1 Amardas appointed as Mahant in place of respondent No.2 on December 29, 1953.",
      "type": "background",
      "date": "1953-12-29",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On September 15, 1939, appellant instituted suit in revenue court under ss.38 and 39 of Punjab Tenancy Act for possession of 141 kanals 8 marlas of land, alleging sub-lease for brick manufacture by digging earth contravened s.39.",
      "type": "procedural",
      "date": "1939-09-15",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Revenue Court decreed ejectment of second respondent only from portion dug up, decree dated June 3, 1940.",
      "type": "procedural",
      "date": "1940-06-03",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Second respondent's appeal dismissed by Collector on October 19, 1940; appellant obtained possession of that land.",
      "type": "procedural",
      "date": "1940-10-19",
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Appellant instituted second suit for ejectment from remaining land as sub-lessee continued digging.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Assistant Collector decreed ejectment of entire remaining land; Collector in appeal modified, excluding 29 kanals 14 marlas, order dated May 31, 1943; appellant obtained possession.",
      "type": "procedural",
      "date": "1943-05-31",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "On March 18, 1957, first respondent instituted suit against appellant and second respondent for possession.",
      "type": "procedural",
      "date": "1957-03-18",
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Suit decreed by trial court, upheld by second Additional District Judge, Amritsar in appeal; appellant's second appeal dismissed in limine by Punjab High Court on November 9, 1960.",
      "type": "procedural",
      "date": "1960-11-09",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Appellant in possession continuously for more than 12 years preceding suit as owner.",
      "type": "admitted",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f13",
      "text": "Land not attached to Akhara; second respondent was occupancy tenant; rights extinguished by revenue court decrees.",
      "type": "disputed",
      "date": null,
      "source": "appellant"
    },
    {
      "id": "f14",
      "text": "Akhara bound by actions of Mahant Ram Saran Das; actions tantamount to unauthorised alienation not for legal necessity or benefit of estate.",
      "type": "material",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f15",
      "text": "Property belongs to Akhara as occupancy tenant; second respondent not occupancy tenant.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the suit for possession instituted by plaintiff-respondent No.1 is within time.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Land never attached to Akhara; Mahant Ram Saran Das was occupancy tenant; sub-lessee dug up land rendering unfit for cultivation; entitled to eject by forfeiting lease; occupancy rights extinguished by revenue court decrees.",
      "supporting_facts": [
        "f2",
        "f5",
        "f6",
        "f7",
        "f9"
      ],
      "legal_basis": "ss.38, 39 Punjab Tenancy Act"
    },
    {
      "id": "pa2",
      "text": "In continuous possession as owner for more than 12 years preceding suit openly and to exclusion of others; suit barred by limitation.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": "Limitation Act (12 years possession)"
    },
    {
      "id": "pa3",
      "text": "Even if occupation as occupancy tenant, acquired proprietary rights by operation of statute.",
      "supporting_facts": [
        "f12"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Action of second respondent in leasing for digging earth was unauthorised transfer not for legal necessity or benefit of estate.",
      "supporting_facts": [
        "f14"
      ],
      "legal_basis": null
    },
    {
      "id": "ra2",
      "text": "Appellant's possession for 12 years makes no difference; land trust property; suit within 12 years from death/resignation/removal of manager.",
      "supporting_facts": [
        "f4",
        "f10"
      ],
      "legal_basis": "Limitation Act"
    },
    {
      "id": "ra3",
      "text": "Second respondent's act alienation; suit within 12 years of succession to office on Dec 29, 1953.",
      "supporting_facts": [
        "f4",
        "f10"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "Adverse possession against Akhara could not commence till respondent No.1 appointed Mahant; no competent person to sue during interval.",
      "supporting_facts": [
        "f3",
        "f4"
      ],
      "legal_basis": "Dwijendra Narain Roy v. Joges Chandra De; F. Lakshmi Reddy v. L. Lakshmi Reddy"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Upon eviction of respondent No.2 in 1940 and 1943, occupancy right merged in appellant's ownership; continuous physical possession with appellant to exclusion of occupancy tenant for more than 12 years before suit; right extinguished.",
      "addresses_issue": "i1",
      "key_observation": "Eviction was forfeiture of tenancy by landlord, not alienation."
    },
    {
      "id": "cr2",
      "text": "Not alienation (voluntary act); appellant not alienee from respondent No.2.",
      "addresses_issue": "i1",
      "key_observation": "Forfeiture, not voluntary transfer."
    },
    {
      "id": "cr3",
      "text": "Respondent No.2 as Mahant could institute suit on behalf of Akhara; Receiver during suit competent; adverse possession commenced from possession dates.",
      "addresses_issue": "i1",
      "key_observation": "Always person competent to sue; distinguishes cited cases."
    },
    {
      "id": "cr4",
      "text": "In execution sale of debutter property, adverse possession from effective possession date, not incumbent's death.",
      "addresses_issue": "i1",
      "key_observation": "Applies Privy Council rulings."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Suit barred by limitation due to appellant's continuous adverse possession for over 12 years extinguishing occupancy rights.",
      "resolves_issue": "i1",
      "in_favor_of": "petitioner"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Dwijendra Narain Roy v. Joges Chandra De",
      "citation": "A.I.R. 1924 Cal. 600",
      "treatment": "distinguished",
      "relevance": "Observations on cause of action accrual approved but facts different; time runs when competent person exists to sue."
    },
    {
      "case_name": "F. Lakshmi Reddy v. L. Lakshmi Reddy",
      "citation": "1957 S.C.R. 195",
      "treatment": "followed",
      "relevance": "Approved observations on cause of action; distinguished on facts."
    },
    {
      "case_name": "Sudarsan Das v. Ram Kirpal",
      "citation": null,
      "treatment": "followed",
      "relevance": "Adverse possession in execution sale from effective possession date."
    },
    {
      "case_name": "Subbaiya v. Mustapha",
      "citation": null,
      "treatment": "followed",
      "relevance": "Similar to Sudarsan Das on adverse possession computation."
    }
  ],
  "statutes_cited": [
    {
      "name": "Punjab Tenancy Act",
      "sections": [
        "s.38",
        "s.39"
      ],
      "relevance": "Basis for ejectment suits due to contravention by sub-lease for digging earth."
    },
    {
      "name": "Code of Civil Procedure",
      "sections": [
        "s.92"
      ],
      "relevance": "Suit removing Mahant Ram Saran Das."
    },
    {
      "name": "Limitation Act",
      "sections": [
        "art.144"
      ],
      "relevance": "12 years adverse possession extinguishes rights; suit timing for trust property."
    }
  ],
  "outcome": {
    "disposition": "accepted",
    "summary": "Supreme Court holds suit barred by limitation on view that appellant's possession since 1940/1943 exceeded 12 years, extinguishing occupancy rights via forfeiture, not alienation; other issues unnecessary to decide.",
    "relief_granted": "Appeal allowed implicitly by ruling on limitation in appellant's favor.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "The short point which falls to be considered in this appeal... is whether the suit for possession instituted by the plaintiff-respondent No. 1 is within time.",
      "speaker": "court",
      "significance": "Frames core issue."
    },
    {
      "text": "Upon the eviction of respondent No. 2 from a part of the land in the year 1940 and the rest of it in the year 1943 the occupancy right with respect to the land merged in the right of ownership of the appellant.",
      "speaker": "court",
      "significance": "Key finding on merger and extinguishment."
    },
    {
      "text": "What happened in this case was the forfeiture of the occupancy tenancy by the appellant as landlord. In no sense can this be regarded as, or even likened to alienation.",
      "speaker": "court",
      "significance": "Rejects respondent's alienation argument."
    },
    {
      "text": "The substance of the matter is that time runs when the cause of action accrues, and a cause of action accrues, when there is in existence a person who can sue and another who can be sued.",
      "speaker": "court",
      "significance": "Quoted from precedent, applied to reject no-competent-person argument."
    }
  ],
  "_case_id": "1965_119",
  "_label": 1,
  "_text_length": 14313,
  "_extracted_at": "2026-02-10T19:25:45.203125"
}