{
  "metadata": {
    "case_name": "State of Punjab v. Messrs. Jullunder Vegetables Syndicate",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Civil Appeal No. 588 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Messrs. Jullunder Vegetables Syndicate was a firm doing business in Jullunder from October 4, 1952 to July 11, 1953.",
      "type": "background",
      "date": "1952-10-04 to 1953-07-11",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The firm was dissolved on July 11, 1953. An intimation of the dissolution under S. 16 of the East Punjab General Sales Tax Act, 1948 was sent to the Department on July 18, 1953.",
      "type": "material",
      "date": "1953-07-11",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The firm was assessed to sales-tax on May 30, 1953 by the Sales-tax Officer for turnover from October 4, 1952 to March 31, 1953, but the assessment order was quashed on April 11, 1955 by the Financial Commissioner on ground of lack of jurisdiction.",
      "type": "procedural",
      "date": "1953-05-30",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On September 3, 1955, the Sales-tax Officer made a fresh assessment on the turnover of the firm, fixing taxable turnover at Rs. 15,04,091-11-3 and tax at Rs. 47,002-14-0.",
      "type": "procedural",
      "date": "1955-09-03",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Assumption that fresh proceedings were initiated after the Financial Commissioner's order quashing the original assessment.",
      "type": "disputed",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "On appeal, the Deputy Excise and Taxation Commissioner by order dated October 20, 1956 reduced turnover and tax to Rs. 30,049-12-0.",
      "type": "procedural",
      "date": "1956-10-20",
      "source": "court"
    },
    {
      "id": "f7",
      "text": "On revision, Financial Commissioner rejected contention that assessment could not be taken against dissolved firm and confirmed assessment.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "At instance of assessee, question referred to High Court under S. 22: Whether partnership firm ceased to be liable to assessment by mere dissolution before proceedings initiated.",
      "type": "procedural",
      "date": "1962-02-06",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Full Bench of Punjab High Court answered question in affirmative: firm separate assessable entity, no machinery for assessment after dissolution.",
      "type": "procedural",
      "date": "1962-02-06",
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "State of Punjab preferred appeal to Supreme Court on certificate by High Court.",
      "type": "procedural",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether a partnership firm which was in existence during the period for assessment can be assessed to sales-tax after dissolution before assessment proceedings initiated.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "A firm under the Act is not a separate legal entity; assessment can be made on the group of partners who constituted the firm before dissolution.",
      "supporting_facts": [],
      "legal_basis": "East Punjab General Sales Tax Act, 1948"
    },
    {
      "id": "pa2",
      "text": "Even if firm separate assessable unit, dissolution does not end liability till registration certificate cancelled.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "East Punjab General Sales Tax Act, 1948"
    },
    {
      "id": "pa3",
      "text": "Assessment proceedings started before dissolution were continued after quashing order; validly started proceedings can continue till registration cancelled.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Firm under Act is separate assessable legal entity like under Income-tax Act; no machinery provided for assessment after dissolution.",
      "supporting_facts": [
        "f2"
      ],
      "legal_basis": "East Punjab General Sales Tax Act, 1948; Indian Income-tax Act"
    },
    {
      "id": "ra2",
      "text": "High Court proceeded on assumption of de novo proceedings after quashing; no material on record to support continuation of earlier proceedings.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "In interpreting fiscal statute, court interprets as it stands, favorably to taxpayer if doubt; cannot strain language or make good deficiencies.",
      "addresses_issue": "i1",
      "key_observation": "C.A. Abraham v. Income-tax Officer, Kottayam"
    },
    {
      "id": "cr2",
      "text": "Firm is separate assessable entity under Act (definition of 'dealer' includes firm; treated independently like under Income-tax Act).",
      "addresses_issue": "i1",
      "key_observation": "Firm has same status as under Income-tax Act as distinct assessable entity."
    },
    {
      "id": "cr3",
      "text": "On dissolution, firm ceases to be legal entity; no statutory provision permitting assessment of dissolved firm.",
      "addresses_issue": "i1",
      "key_observation": "No distinction between proceedings initiated before or after dissolution."
    },
    {
      "id": "cr4",
      "text": "S.16 requires notice of discontinuation but does not imply continuity of firm or empower assessment post-dissolution.",
      "addresses_issue": "i1",
      "key_observation": "For administrative purposes only."
    },
    {
      "id": "cr5",
      "text": "Rule 40 imposes joint and several liability on dealer and partners for payment, not for assessment of dissolved firm.",
      "addresses_issue": "i1",
      "key_observation": "Does not provide for assessment post-dissolution."
    },
    {
      "id": "cr6",
      "text": "Provisions of Partnership Act irrelevant except if incorporated in Sales Tax Act.",
      "addresses_issue": "i1",
      "key_observation": "Deal with partners' relations, not assessment."
    },
    {
      "id": "cr7",
      "text": "Lacuna in Act filled by later amendment, not retrospective.",
      "addresses_issue": "i1",
      "key_observation": "Various High Court decisions rejected as they mix assessment power with partners' liability."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "A dissolved firm cannot be assessed to sales tax under the East Punjab General Sales Tax Act, 1948 in respect of pre-dissolution turnover, as it ceases to be an assessable entity and no provision empowers such assessment.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "C.A. Abraham v. Income-tax Officer, Kottayam",
      "citation": "1961 2 S.C.R. 765",
      "treatment": "followed",
      "relevance": "Fiscal statutes to be interpreted favorably to taxpayer; no straining language."
    },
    {
      "case_name": "Commissioner of Income-tax, Madras v. S. V. Angidi Chettiar",
      "citation": null,
      "treatment": "referred",
      "relevance": "S.44 Income-tax Act provides machinery for assessing discontinued firms."
    },
    {
      "case_name": "Jagat Bahari Tandon v. The Sales Tax Officer, Etawah",
      "citation": "1955 6 S.T.C. 125",
      "treatment": "distinguished",
      "relevance": "Held firm not separate entity; rejected by SC."
    },
    {
      "case_name": "Lalji v. The Assistant Commissioner, Salestax, Raipur",
      "citation": "1958 9 S.T.C. 571",
      "treatment": "distinguished",
      "relevance": "Relied on notice provision for continuity; rejected."
    },
    {
      "case_name": "R. D. Fernandes in re",
      "citation": "1957 8 S.T.C. 368",
      "treatment": "distinguished",
      "relevance": "Relied on Partnership Act; rejected."
    },
    {
      "case_name": "Khushi Ram Behari Lal Co. v. The Assessing Authority Sangrur",
      "citation": "1954 15 S.T.C. 165",
      "treatment": "distinguished",
      "relevance": "Distinguished Full Bench case; relied on S.16; post-amendment."
    },
    {
      "case_name": "R. Poonuswami Gramani v The Collector of Chingleput District",
      "citation": "1960 11 S.T.C. 80",
      "treatment": "distinguished",
      "relevance": "Followed earlier Madras decision without reasoning."
    },
    {
      "case_name": "Bankatlal Badruka v. The State of Bombay",
      "citation": "1961 12 S.T.C. 405",
      "treatment": "distinguished",
      "relevance": "Based on non-giving of notice."
    },
    {
      "case_name": "Commissioner of Sales-tax, Orissa v. Aurbinde Auto Service",
      "citation": "1963 14 S.T.C. 46",
      "treatment": "distinguished",
      "relevance": "Relied on notice and S.19(3) similar to I.T. Act S.44."
    }
  ],
  "statutes_cited": [
    {
      "name": "East Punjab General Sales Tax Act, 1948",
      "sections": [
        "Section 2(d)",
        "Section 4",
        "Section 7",
        "Section 11",
        "Section 16",
        "Section 17",
        "Section 22"
      ],
      "relevance": "Defines dealer including firm as assessable unit; requires registration, notice of discontinuation; no provision for assessing dissolved firm."
    },
    {
      "name": "East Punjab General Sales Tax Rules, 1949",
      "sections": [
        "Rule 40"
      ],
      "relevance": "Joint and several liability of dealer and partners for payment of tax."
    },
    {
      "name": "Indian Partnership Act",
      "sections": [],
      "relevance": "Regulates partners' relations; irrelevant to assessment unless incorporated."
    },
    {
      "name": "Indian Income-tax Act",
      "sections": [
        "Section 3",
        "Section 44"
      ],
      "relevance": "Treats firm as distinct assessable entity; S.44 expressly allows assessment of discontinued firms."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court dismissed the appeal preferred by the State of Punjab, affirming the Punjab High Court's Full Bench decision that a dissolved firm cannot be assessed to sales tax under the East Punjab General Sales Tax Act, 1948, as there is no statutory machinery for such assessment and the firm ceases to be an assessable entity upon dissolution.",
    "relief_granted": "Assessment orders quashed as invalid.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"a firm is an independent assessable unit for the purposes of the Act. Indeed, a firm has been given the same status under the Act as is given to it under the Income-tax Act.\"",
      "speaker": "court",
      "significance": "Establishes firm as separate legal entity for assessment."
    },
    {
      "text": "\"on dissolution, the firm ceases to be a legal entity. Thereafter, on principle, unless there is a statutory provision permitting the assessment of a dissolved firm, there is no longer any scope for assessing the firm.\"",
      "speaker": "court",
      "significance": "Core holding on why assessment invalid post-dissolution."
    },
    {
      "text": "\"It is a settled rule of construction that in interpreting a fiscal statute the court cannot proceed to make good the deficiencies... in case of doubt, it shall interpret it in a manner favourable to the tax payer.\"",
      "speaker": "court",
      "significance": "Guiding principle for statutory interpretation."
    }
  ],
  "_case_id": "1965_312",
  "_label": 0,
  "_text_length": 16894,
  "_extracted_at": "2026-02-10T19:28:17.409169"
}