{
  "metadata": {
    "case_name": "Hardwar Union Municipal Board v. Owners of Motor Vehicles (Respondents)",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Hidayatullah, J."
    ],
    "case_number": "Civil Appeals Nos. 311 to 366 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On October 29, 1941, the Hardwar Union Municipal Board issued notification No. 4188/XI-416-41 imposing a toll on motor vehicles and tongas entering or leaving the municipal limits with passengers, at the rate of 2 annas per passenger. Nine classes exempted, including persons travelling from Rishikesh. Purportedly under S. 128(1)(xiv) of U.P. Municipalities Act 1916.",
      "type": "material",
      "date": "1941-10-29",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "Notification accompanied by rules for levy and collection of the toll.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "Board established a toll-barrier on the Rishikesh-Hardwar road at Kharkhari within Hardwar municipal limits. Toll collected from vehicles entering or departing at 4 annas per passenger in motor car, tonga or rickshaw.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "On February 22, 1955, second notification No. 830/XXIII-16 C -53-54 issued under S. 128(1)(vii), increased toll to 4 annas per passenger, added rickshaws, removed exemption for persons from Rishikesh.",
      "type": "material",
      "date": "1955-02-22",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On September 18, 1957, third notification No. 2706B- a XI-C-57 issued under S. 128(1)(xiv), amended 1941 notification description to toll on motor vehicles, rickshaws and tongas entering or leaving limits at 4 annas per passenger, deleted Rishikesh exemption clause.",
      "type": "material",
      "date": "1957-09-18",
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Respondents, owners of motor vehicles plying between Rishikesh and Hardwar, filed petitions under Art. 226 challenging the toll.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Mehrotra J. on September 26, 1955 held no toll on vehicles going outside limits, issued writ to Board to desist from collecting toll on vehicles leaving; upheld on entering. Rejected other contentions.",
      "type": "procedural",
      "date": "1955-09-26",
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "Divisional Bench (Mootham J. and Shrivastava J.) in special appeal on December 6, 1957 maintained levy on leaving but not if already paid on entry; modified order accordingly. Dismissed other appeals, certified fit for SC appeal.",
      "type": "procedural",
      "date": "1957-12-06",
      "source": "lower_court"
    },
    {
      "id": "f9",
      "text": "Appeals from Allahabad High Court judgments dated December 6, 1957, December 16, 1958, January 29, 1959 in Special Appeals Nos. 343 and 381-416 of 1955, 548 of 1958, 49-55 and 57-67 of 1959.",
      "type": "background",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the Board can levy toll on vehicles leaving the municipal limits, in addition to or instead of on entry, under S. 128(1)(vii) or (xiv) of U.P. Municipalities Act 1916.",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether cl. (xiv) as residuary clause extends power under cl. (vii) to levy tolls on exit.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Local authorities act as agents of State Legislature; powers from statute. Relied on both cl. (vii) and (xiv) of S.128(1). Concept of tolls envisages collection on entry and departure. Cl. (xiv) residuary brings full legislative amplitude to aid cl. (vii).",
      "supporting_facts": [
        "f1",
        "f3",
        "f4",
        "f5"
      ],
      "legal_basis": "S. 128(1)(vii) and (xiv) U.P. Municipalities Act 1916; entries 52,53 GOI Act 1935; entries 56,59 Constitution State List"
    },
    {
      "id": "pa2",
      "text": "Distinction must continue as toll depends on number of passengers; vehicle may enter with few, leave with more.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "pa3",
      "text": "Tolls historically include toll-thorough, toll-traverse; levied on passage, could be on entry or exit.",
      "supporting_facts": [],
      "legal_basis": null
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Toll cannot be levied on vehicles leaving municipal limits (per single judge). Levy on exit if paid on entry invalid (per Div Bench).",
      "supporting_facts": [
        "f3",
        "f7",
        "f8"
      ],
      "legal_basis": "S. 128(1)(vii) limits to entering vehicles"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Local authorities do not act as legislatures but as agents; powers strictly from statute. S.128(1)(vii) expressly limits toll to vehicles entering municipality. Cl. (xiv) residuary for other taxes legislature can impose, equates Board powers to legislature but cannot extend specific limitation in cl. (vii).",
      "addresses_issue": "i1",
      "key_observation": "Legislature gave limited power under cl. (vii); no extension via cl. (xiv) even if tolls generally allow exit levy."
    },
    {
      "id": "cr2",
      "text": "In 1941, power from GOI Act 1935 entry 53 (Tolls); not entry 52 (dues on passengers). Post-Constitution, entry 59 (Tolls), not 56 (tax on passengers/goods by road). Levy on vehicles entering only.",
      "addresses_issue": "i1",
      "key_observation": "1955 and 1957 notifications also restricted; third after petitions irrelevant."
    },
    {
      "id": "cr3",
      "text": "Tolls historically for privilege of passage; collected once, typically at entry. No need to decide general toll nature as statute limits to entry.",
      "addresses_issue": "i2",
      "key_observation": "Power exhausted by cl. (vii); irrelevant passenger variation for exit levy."
    },
    {
      "id": "cr4",
      "text": "Div Bench distinction (no exit toll if entry paid) erroneous; single judge correct. But no cross-appeal by respondents.",
      "addresses_issue": "i1",
      "key_observation": "Dismiss appeals without modification."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Board has no power to levy toll on vehicles leaving municipal limits; power limited to entering vehicles under S.128(1)(vii); cl.(xiv) does not extend it.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "Residuary cl.(xiv) cannot enlarge specific limitation in cl.(vii).",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [],
  "statutes_cited": [
    {
      "name": "U.P. Municipalities Act 1916",
      "sections": [
        "S. 128(1)(vii)",
        "S. 128(1)(xiv)"
      ],
      "relevance": "Confers power to impose tolls limited to vehicles entering municipality under (vii); (xiv) residuary for other legislative taxes but does not extend (vii)"
    },
    {
      "name": "Constitution of India",
      "sections": [
        "Art. 226",
        "State List Entry 56",
        "State List Entry 59"
      ],
      "relevance": "Art.226 for High Court petitions; legislative powers for taxes on goods/passengers (56), tolls (59)"
    },
    {
      "name": "Government of India Act 1935",
      "sections": [
        "Provincial Legislative List Entry 52",
        "Provincial Legislative List Entry 53"
      ],
      "relevance": "Powers in 1941: dues on passengers/goods (52), tolls (53)"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeals by the Board dismissed; upheld High Court direction that no toll on vehicles leaving if paid on entry, but court holds no toll on exit at all; no modification as no cross-appeal; Board to bear costs.",
    "relief_granted": "Writ upheld prohibiting toll collection on vehicles leaving municipality",
    "costs": "Appellant Board shall bear the costs of these appeals"
  },
  "key_quotes": [
    {
      "text": "local authorities like the Board do not act as legislatures when they impose a tax but as the agent of the State Legislatures. Their powers and the extent of these powers must be found in the statute",
      "speaker": "court",
      "significance": "Core principle limiting municipal powers to statute"
    },
    {
      "text": "the Provincial Legislature expressly gave a limited power to levy toll on vehicles entering the municipality... no extension of that power could be contemplated under cl. xiv",
      "speaker": "court",
      "significance": "Rejects extension of toll to exit vehicles"
    },
    {
      "text": "toll as such can only be collected under the Municipalities Act from vehicles entering the municipal limits. This... exhausts all the power delegated",
      "speaker": "court",
      "significance": "Defines scope of delegated power"
    }
  ],
  "_case_id": "1965_169",
  "_label": 0,
  "_text_length": 14073,
  "_extracted_at": "2026-02-10T19:26:14.701601"
}