{
  "metadata": {
    "case_name": "State of Madras v. Respondent (Purchaser of Mothirambedu village)",
    "case_year": 1963,
    "court": "Supreme Court of India",
    "judges": [
      "Subba Rao, J."
    ],
    "case_number": "Civil Appeal No. 446 of 1963",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "Mothirambedu village is one of the shrotriem villages in the Chingleput district in the State of Madras.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The respondent purchased Mothirambedu village from P. Anathapadmanabacharlu under a sale deed dated July 10, 1946, for Rs. 26,000/-, and was in possession and enjoyment thereof.",
      "type": "material",
      "date": "1946-07-10",
      "source": "respondent"
    },
    {
      "id": "f3",
      "text": "On December 12, 1950, the Government of Madras issued a notification under s. 3 of the Madras Estates Abolition and Conversion into Ryotwari Act, 1948 (Madras Act XXVI of 1948), taking over the said village as a zamindari estate.",
      "type": "material",
      "date": "1950-12-12",
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The Government took possession of the village on January 3, 1951.",
      "type": "procedural",
      "date": "1951-01-03",
      "source": "court"
    },
    {
      "id": "f5",
      "text": "On March 15, 1954, the respondent filed O.S. No. 22 of 1954 in the Court of the Subordinate Judge, Chingleput, against the State of Madras for a declaration that the notification was illegal and void, claiming initially it was not an estate under Madras Estates Land Act, but later gave up that plea.",
      "type": "procedural",
      "date": "1954-03-15",
      "source": "respondent"
    },
    {
      "id": "f6",
      "text": "The State filed a written statement asserting that the village formed part of Tirumazhy Zamindari, separately registered in the office of the Collector, hence a zamindari estate.",
      "type": "disputed",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f7",
      "text": "Subordinate Judge, Chingleput, held the village was a zamin estate, notification legal.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f8",
      "text": "On appeal (Appeal Suit No. 85 of 1956), Madras High Court held it was not proved to be a zamin village but a whole inam village, granted declaration that notification was illegal and void, dated September 9, 1958.",
      "type": "procedural",
      "date": "1958-09-09",
      "source": "court"
    },
    {
      "id": "f9",
      "text": "Earliest document: Ex. A-7, certified copy of cowle granted by Mr. Lionel Place, Collector, to Rangasami Mudali (Nattuvar) dated December 10, 1796, conferring mirasi of Mothirambedu and another village permanently, subject to paying just dues.",
      "type": "background",
      "date": "1796-12-10",
      "source": "court"
    },
    {
      "id": "f10",
      "text": "At permanent settlement, shrotriem villages like Mothirambedu included in zamindari assets, reversionary interest transferred to zamindar, tenure continued as under-tenure.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "Prior suit in 1921 between zamindar and tenants, decided by Madras High Court Division Bench on November 23, 1927 (Ex. A-4), holding it not part of zamindari.",
      "type": "background",
      "date": "1927-11-23",
      "source": "court"
    },
    {
      "id": "f12",
      "text": "Village described variably in documents as miras mitta, zamin village, shrotriem, jari inam.",
      "type": "disputed",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the village of Mothirambedu is a zamindari estate under the Madras Estates Abolition and Conversion into Ryotwari Act, 1948.",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "The said village was included in the assets of the zamindari at the time of the permanent settlement, continued to be part of the said estate till abolished under the Act; formed part of Tirumazhy Zamindari, separately registered.",
      "supporting_facts": [
        "f6",
        "f7"
      ],
      "legal_basis": "Section 3(2)(a) and (b) of Madras Estates Land Act; definition of zamindari estate under s.2(16) of the Act"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The said village was granted as a shrotriem before the permanent settlement to a Nattuvar; pre-existing tenure not disturbed; held as under-tenure from the zamindar.",
      "supporting_facts": [
        "f2",
        "f5",
        "f9"
      ],
      "legal_basis": "Section 3(2)(e) of Madras Estates Land Act; under-tenure estate under s.2(15) of the Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Explained definitions under Madras Estates Land Act, 1908: estates categorized as zamin, under-tenure, inam; village held on permanent under-tenure excluded from zamin estate.",
      "addresses_issue": "i1",
      "key_observation": "A village physically part of zamindari but held on permanent under-tenure is under-tenure estate, not zamin."
    },
    {
      "id": "cr2",
      "text": "Shrotriem grant by Lionel Place in 1796 was permanent mirasi to Nattuvar; at permanent settlement, tenure continued as under-tenure under zamindar.",
      "addresses_issue": "i1",
      "key_observation": "Reversionary interest transferred to zamindar; shrotriem tenure subsisted."
    },
    {
      "id": "cr3",
      "text": "Documents like Ex. B-2 unsigned and undated, ignored; prior HC judgment in 1927 accepted; village falls under s.3(2)(e) Madras Estates Land Act, hence under-tenure estate.",
      "addresses_issue": "i1",
      "key_observation": "Notification treating as zamin estate void."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Mothirambedu is an under-tenure estate under s.3(2)(e) of Madras Estates Land Act, excluded from zamindari estate definition; notification under s.3 of 1948 Act void.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Gopisetti Veeraswami v. Sagiraju Seetharama Kantayya",
      "citation": "(1926) 51 M.L.J. 394",
      "treatment": "followed",
      "relevance": "Pre-settlement Mokhasa village included in zamindari assets held as permanent under-tenure under s.3(2)(e)"
    },
    {
      "case_name": "Narayanaswami Bahadur Boda Thammavva",
      "citation": "(1930) M.W.N. 945",
      "treatment": "followed",
      "relevance": "Similar holding on pre-settlement grants as under-tenure"
    },
    {
      "case_name": "Prior Madras High Court judgment in suit between zamindar and tenants",
      "citation": "Judgment dated November 23, 1927 (Ex. A-4)",
      "treatment": "followed",
      "relevance": "Held Mothirambedu not part of zamindari"
    }
  ],
  "statutes_cited": [
    {
      "name": "Madras Estates Abolition and Conversion into Ryotwari Act, 1948 (Madras Act XXVI of 1948)",
      "sections": [
        "s. 2(3)",
        "s. 2(7)",
        "s. 2(15)",
        "s. 2(16)",
        "s. 3",
        "ss. 27, 28, 31, 32, 35, 36, 37"
      ],
      "relevance": "Defines estate types; notification under s.3; compensation basis differs by type"
    },
    {
      "name": "Madras Estates Land Act, 1908",
      "sections": [
        "s. 3(2)(a)",
        "s. 3(2)(b)",
        "s. 3(2)(c)",
        "s. 3(2)(d)",
        "s. 3(2)(e)"
      ],
      "relevance": "Defines estates; key to classification as zamindari, inam, under-tenure"
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Appeal dismissed; High Court declaration upheld that notification taking over Mothirambedu as zamindari estate is illegal and void, as it is a whole inam village held under permanent under-tenure.",
    "relief_granted": "Declaration that notification illegal and void upheld",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "As the village is held under a permanent under-tenure, it falls squarely under the definition of s. 3 (2) (e) of the Madras Estates Land Act and is, therefore, an estate thereunder and hence it is an under-tenure estate.",
      "speaker": "court",
      "significance": "Core holding on classification"
    },
    {
      "text": "The result was that the shrotriem tenure in the hands of the Nattuvars continued after the permanent settlement as it existed prior to it.",
      "speaker": "court",
      "significance": "Explains effect of permanent settlement on pre-existing grants"
    }
  ],
  "_case_id": "1965_364",
  "_label": 0,
  "_text_length": 28507,
  "_extracted_at": "2026-02-10T19:28:49.385289"
}