{
  "metadata": {
    "case_name": "Commissioner of Income-tax v. Respondent (S. Raghbir Singh)",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeals Nos. 96 to 98 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "On April 10, 1953 the estate of the joint Hindu family of which the respondent was a member was partitioned, and the respondent was allotted, besides other properties, 400 shares of the Simbhaoli Sugar Mills Private Ltd., and was made liable to pay a business debt amounting to Rs. 3,91,875/- due by the family to R.B. Seth Jessa Ram Fateh Chand of Delhi.",
      "type": "material",
      "date": "1953-04-10",
      "source": "court"
    },
    {
      "id": "f2",
      "text": "On April 14, 1953 the respondent executed a deed of trust in respect of 300 out of the shares of the Simbhaoli Sugar Mills which fell to his share.",
      "type": "material",
      "date": "1953-04-14",
      "source": "court"
    },
    {
      "id": "f3",
      "text": "The deed of trust recited that on partition, the author was allotted 400 shares and fixed with liability for discharge of certain debts of the Joint Hindu Family; for discharge of the debts detailed in Schedule A, the author settled 300 shares on trust for benefit of creditors and other beneficiaries.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "The author divesting himself of all proprietary rights declared the 300 shares irrevocably held on trust by trustees to pay off debts in Schedule A first, then for maintenance and education of children and grandchildren, hospitals, schools, reading room, library, orphans, widows, poor people, scholarships, etc.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "Four trustees including respondent appointed; respondent Chairman for lifetime, shares to stand in name of Chairman, who operates bank accounts, votes, etc.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "Trustees entitled to mortgage/pledge shares for raising funds to pay debts, but not sell except after 10 years if unable to pay from income.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "Payment of debts top priority; no spending on other objects till debts paid; after 10 years if unpaid, sell shares; after debts, spend 80% on children/grandchildren maintenance/education, remaining 20% on other objects.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "Respondent claimed before Income-tax Officer that dividend on 300 shares is trust income, he divested ownership; alternatively, deduct Rs. 19,856/- interest to R.B. Seth Jessa Ram Fateh Chand.",
      "type": "procedural",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f9",
      "text": "Income-tax Officer rejected, holding trust fictitious.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "Appellate Assistant Commissioner held respondent had not irrevocably transferred shares, s.16(1)(c) proviso applies.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f11",
      "text": "Income-tax Appellate Tribunal upheld.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "Tribunal referred questions to High Court: (1) Whether dividend income of 300 shares transferred to trust was assessee's income liable to tax? (2) Entitled to deduct Rs.19,856/- interest?",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f13",
      "text": "Punjab High Court answered first question negative, declined second. Judgments dated September 22, 1960, and December 6, 1960 in Income-tax References Nos. 19 of 1958 and 6 of 1959.",
      "type": "procedural",
      "date": "1960-09-22",
      "source": "lower_court"
    },
    {
      "id": "f14",
      "text": "Commissioner of Income-tax appealed to Supreme Court by special leave.",
      "type": "procedural",
      "date": null,
      "source": "petitioner"
    },
    {
      "id": "f15",
      "text": "Genuineness of trust not in dispute.",
      "type": "admitted",
      "date": null,
      "source": "court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether the dividend income of 300 shares of the Simbhaoli Sugar Mills, Private Ltd. transferred by the assessee to S. Raghbir Singh Trust was the income of the assessee liable to tax?",
      "framed_by": "court"
    },
    {
      "id": "i2",
      "text": "Whether the assessee was entitled to claim deduction of Rs. 19,856/- paid as interest to R.B. Seth Jessa Ram Fateh Chand against the dividend income of the aforesaid 300 shares?",
      "framed_by": "court"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Trust was fictitious; respondent had not irrevocably transferred shares; s.16(1)(c) applies deeming income to settlor as assets remain property of settlor or revocable transfer.",
      "supporting_facts": [
        "f9",
        "f10"
      ],
      "legal_basis": "Income-tax Act, s.16(1)(c) and provisos"
    },
    {
      "id": "pa2",
      "text": "Direction for application of income to satisfy settlor's debts amounts to indirect retransfer or right to reassume power over income.",
      "supporting_facts": [
        "f4",
        "f7"
      ],
      "legal_basis": "s.16(1)(c) first proviso"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "Dividend received by trustees is income of Trust; respondent divested irrevocably of ownership; interest Rs.19,856/- deductible.",
      "supporting_facts": [
        "f2",
        "f3",
        "f4"
      ],
      "legal_basis": null
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "s.16(1)(c) deems income from settlement to be settlor's if assets remain property of settlor or revocable transfer; first proviso deems revocable if provision for retransfer directly/indirectly or right to reassume power directly/indirectly.",
      "addresses_issue": "i1",
      "key_observation": "Clause (c) protects genuine settlements but catches tax avoidance where control reserved."
    },
    {
      "id": "cr2",
      "text": "Trust genuine and irrevocable; shares stand in Chairman's name due to Companies Act s.33; primary purpose pay settlor's debts, but no provision for retransfer to settlor or reassume power; benefit to settlor indirect via debt discharge does not attract proviso.",
      "addresses_issue": "i1",
      "key_observation": "Proviso requires specific provision for retransfer or reassumption, not mere benefit."
    },
    {
      "id": "cr3",
      "text": "Income arises to trustees, impressed with trust obligations; not settlor's income.",
      "addresses_issue": "i1",
      "key_observation": "No attraction of s.16(1)(c)."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "Dividend income from 300 shares is not income of assessee under s.16(1)(c) as trust irrevocable without provision for retransfer or reassumption of power.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax, Bihar and Orissa v. Rani Bhuwaneswari Kuer",
      "citation": "53 I.T.R. 195",
      "treatment": "followed",
      "relevance": "Explains provisos to s.16(1)(c); settlements deemed revocable only if provision for retransfer or reassumption."
    },
    {
      "case_name": "Ramji Keshavji v. Commissioner of Income-tax, Bombay",
      "citation": null,
      "treatment": "followed",
      "relevance": "Trust to discharge obligation under consent decree for wife/maintenance not deemed settlor's income under s.16(1)(c)."
    },
    {
      "case_name": "D.R. Shahapure v. Commissioner of Income-tax, Bombay",
      "citation": null,
      "treatment": "followed",
      "relevance": "Irrevocable covenant to pay income to wife not attracting s.16(1)(c)."
    }
  ],
  "statutes_cited": [
    {
      "name": "Income-tax Act",
      "sections": [
        "s.2(15)",
        "s.4(1)",
        "s.16(1)(c)"
      ],
      "relevance": "Defines total income; deems certain settlement income to settlor if revocable or assets remain settlor's property."
    },
    {
      "name": "Indian Companies Act, 1913",
      "sections": [
        "s.33"
      ],
      "relevance": "Prevents notice of trust on company register, hence shares in Chairman's name."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "Supreme Court upheld High Court's answer that dividend income from trust shares is not assessee's income liable to tax; declined second question as in High Court.",
    "relief_granted": "Appeal dismissed; income not taxable in assessee's hands.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "\"The income has to be applied for satisfaction of debts which the settlor was under a obligation to discharge. but that is number to say that there is a provision for retransfer of the income or assets to the settlor, or that the settlor is invested with power to reassume the income or assets.\"",
      "speaker": "court",
      "significance": "Core reasoning why s.16(1)(c) proviso not attracted."
    },
    {
      "text": "\"Clause (c) was intended... to circumvent attempts made by him to reduce his liability to pay income-tax by the expedient of so arranging a settlement or disposition of property that the income does number accrue to him, but he reserves a power over or interest in the property settled.\"",
      "speaker": "court",
      "significance": "Explains purpose of s.16(1)(c)."
    }
  ],
  "_case_id": "1965_367",
  "_label": 0,
  "_text_length": 16548,
  "_extracted_at": "2026-02-10T19:28:57.427168"
}