{
  "metadata": {
    "case_name": "Commissioner of Income-tax, Central Calcutta v. Standard Vacuum Oil Company",
    "case_year": 1964,
    "court": "Supreme Court of India",
    "judges": [
      "Shah, J."
    ],
    "case_number": "Civil Appeal No. 268 of 1964",
    "date_of_judgment": null
  },
  "facts": [
    {
      "id": "f1",
      "text": "The assessee Company is a non-resident. It was incorporated in the State of Delaware in the United States of America with the object of taking over the assets of two companies- Socony Vacuum Oil Company and Standard Oil Company New Jersey.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f2",
      "text": "The capital of the assessee company was 10,000,000 divided into 100,000 shares of the value of 100 each.",
      "type": "background",
      "date": null,
      "source": "court"
    },
    {
      "id": "f3",
      "text": "On the date of acquisition the book values of the assets of the two companies as recorded in their books of account were Socony Vacuum Oil Company 97,715,701 Standard Oil Company New Jersey 46,767,397.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f4",
      "text": "In consideration of transfer of these assets, the assessee company allotted to each company 49,995 shares and to Socony Vacuum Oil Company serial bonds of the value of 13,093,000. The remaining ten shares were divided equally between the two transferor companies for cash at par value.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f5",
      "text": "The assessee company entered in its books of account the book value of the assets taken over from the transferor companies. The excess of the net value of the assets so transferred over the par value of the stock issued and the serial bonds was entered in the books in an account styled Capital paid in Surplus.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f6",
      "text": "The serial bonds issued to the Socony Vacuum Oil Company were later redeemed. By adjustment entries the Capital paid in Surplus account was reduced to 117,561,317 and throughout the period of three years to which these appeals relate, in the balance sheets of the assessee company, the Capital paid in Surplus stood unchanged at that figure.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f7",
      "text": "The net profits earned by the Company year after year, subject to certain appropriations were shown in the balance sheet under the caption Earned Surplus or Earnings reinvested. At the end of 1945, the balance of Earned Surplus was 29,557,597 and by the end of 1948 the account stood at 73,766,592.",
      "type": "material",
      "date": null,
      "source": "court"
    },
    {
      "id": "f8",
      "text": "The Income-tax Officer disallowed the claim of the assessee Company for inclusion of the accounts Capital paid in Surplus and Earned Surplus in the computation of taxable capital under Sch. II r. 2(1) of the Business Profits Tax Act and the Appellate Assistant Commissioner agreed with him.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f9",
      "text": "The Income-tax Appellate Tribunal held that the difference between the value of the assets taken over and the value of stock and serial bonds issued by the assessee Company was premium realized from the issue of its shares and retained in the business within the meaning of r. 3 of Sch. II and was in any event reserve not allowed in computing profits within the meaning of r. 2(1). The Tribunal also held that the amount entered in the account Earned Surplus was reserve liable to be taken into account in assessing business profits tax.",
      "type": "procedural",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f10",
      "text": "At the instance of the Commissioner of Income-tax Central Calcutta, the Income-tax Appellate Tribunal referred the following three questions for the opinion of the High Court of Calcutta under s. 19 of the Business Profits Tax Act 21 of 1947.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f11",
      "text": "The High Court recorded answers in the affirmative on all the questions dated January 29, 1962.",
      "type": "procedural",
      "date": "1962-01-29",
      "source": "lower_court"
    },
    {
      "id": "f12",
      "text": "The Commissioner of Income-tax has appealed to this Court with special leave.",
      "type": "procedural",
      "date": null,
      "source": "court"
    },
    {
      "id": "f13",
      "text": "Singer, who was Treasurer of Standard Vacuum Oil Company and officiated as Treasurer and later as Vice-President of the assessee Company has stated in paragraph-5 of his affidavit that the reason for limiting the stated or par value of the capital stock of Standard Vacuum Oil Company to 10,000,000 rather than including the entire capital of 131,391,098.71 in the par value of issued stock was simply to reduce issuance taxes and fees payable on the basis of the par value of stock issued.",
      "type": "admitted",
      "date": null,
      "source": "respondent"
    },
    {
      "id": "f14",
      "text": "It was found by the Tribunal that the amount entered in the balance sheet as Capital paid in Surplus was retained in the business of the assessee company.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    },
    {
      "id": "f15",
      "text": "The Tribunal found that the profits earned year after year by the assessee company were retained and reinvested in its business.",
      "type": "admitted",
      "date": null,
      "source": "lower_court"
    }
  ],
  "legal_issues": [
    {
      "id": "i1",
      "text": "Whether on the facts found the Tribunal was right in holding that the sum of 117,000,000 appearing in the Balance Sheet of the assessee Company under the head Capital paid in Surplus and constituting the excess of the book value of the assets over the face value of the shares represented premium realised from the issue of the shares as contemplated by Rule 3 of Schedule II of the Business Profits Tax, Act, 1947.",
      "framed_by": "tribunal"
    },
    {
      "id": "i2",
      "text": "Whether on facts and in the circumstances of the case the Tribunal was right in holding that the fact that the amount in question had been built up out of capital and not out of taxed profits would not prevent it from being reserve as contemplated by Sub-Rule 1 of Rule 2 of the Schedule II of the Business Profits Tax Act.",
      "framed_by": "tribunal"
    },
    {
      "id": "i3",
      "text": "Whether on the facts and in the circumstances of the case, the Tribunal was right in holding that the sum of 29,000,000 odd, 43,000,000 odd, 56,000,000 odd and 73,000,000 odd for the respective years appearing in the Balance Sheets of the assessee as Earned Surplus would be treated as a reserve within the meaning of Sub-Rule 1 of Rule 2 of the Schedule II of the Business Profits Tax Act.",
      "framed_by": "tribunal"
    }
  ],
  "petitioner_arguments": [
    {
      "id": "pa1",
      "text": "Shares could be said to be issued at a premium only when they were issued for cash in excess of the par value and not otherwise.",
      "supporting_facts": [],
      "legal_basis": "Rule 3 of Sch. II Business Profits Tax Act"
    },
    {
      "id": "pa2",
      "text": "The use of the expression premium realised from the issue of any shares in r. 3 of Sch. II implies that there must, prior to the allotment of shares under which premium is charged, be some arrangement for payment of consideration in excess of the par value of shares, and in the absence of evidence to prove such an arrangement, the capital surplus is not premium realised from the issue of shares.",
      "supporting_facts": [],
      "legal_basis": "Rule 3 of Sch. II Business Profits Tax Act"
    },
    {
      "id": "pa3",
      "text": "Reserves contemplated by r. 2(1) are only those which are built out of profits assessed for the purpose of taxation under the Indian Income-tax Act.",
      "supporting_facts": [],
      "legal_basis": "Rule 2(1) of Sch. II Business Profits Tax Act; Commissioner of Income-tax v. Century Spg. Mfg. Company Ltd."
    },
    {
      "id": "pa4",
      "text": "Where a reserve is brought into existence by creating or increasing, by revaluation or otherwise any book asset, it cannot be included in the computation of capital by virtue of Explanation to r. 2.",
      "supporting_facts": [],
      "legal_basis": "Explanation to Rule 2 of Sch. II Business Profits Tax Act"
    },
    {
      "id": "pa5",
      "text": "Accumulated profits could only be deemed reserves for the purpose of the Business Profits Tax Act, if they are specifically allocated to reserves and not otherwise.",
      "supporting_facts": [],
      "legal_basis": "Century Spinning Manufacturing Company Ltd. case"
    }
  ],
  "respondent_arguments": [
    {
      "id": "ra1",
      "text": "The difference between the value of the assets taken over and the value of stock and serial bonds issued by the assessee Company was premium realized from the issue of its shares and retained in the business within the meaning of r. 3 of Sch. II.",
      "supporting_facts": [
        "f3",
        "f4",
        "f5",
        "f6"
      ],
      "legal_basis": "Rule 3 of Sch. II Business Profits Tax Act"
    },
    {
      "id": "ra2",
      "text": "Even if the amount of capital paid in Surplus be not regarded as premium within the meaning of r. 3, it is still reserves within the meaning of r. 2(1).",
      "supporting_facts": [
        "f5",
        "f6"
      ],
      "legal_basis": "Rule 2(1) of Sch. II Business Profits Tax Act"
    },
    {
      "id": "ra3",
      "text": "The difference in the value of the assets transferred by the two companies was nominal, because the Standard Oil Company had transferred valuable intangible assets which had not entered into the book valuation of its assets, and which bridged the difference between the value of the assets transferred by that company and the assets transferred by the Socony Vacuum Oil Company.",
      "supporting_facts": [
        "f3"
      ],
      "legal_basis": null
    },
    {
      "id": "ra4",
      "text": "The amount entered in the account Earned Surplus was reserve liable to be taken into account in assessing business profits tax.",
      "supporting_facts": [
        "f7",
        "f15"
      ],
      "legal_basis": "Rule 2(1) of Sch. II Business Profits Tax Act"
    }
  ],
  "court_reasoning": [
    {
      "id": "cr1",
      "text": "Where the value of assets transferred exceeds the par value, the difference may appropriately be regarded as premium according to the nomenclature used in India.",
      "addresses_issue": "i1",
      "key_observation": "In the absence of any restriction in the law of Delaware against the issue of shares otherwise than for cash, when shares are issued for consideration other than cash the value of the assets transferred in excess of the par value of shares issued would be regarded as premium for purposes of our system of law."
    },
    {
      "id": "cr2",
      "text": "The right of a company to charge varying premiums in respect of blocks of shares having the same rights issued under different resolutions is not denied, and on principle there is no objection to the charging of varying rates of premium for shares issued under a single resolution, if all the parties concerned agree.",
      "addresses_issue": "i1",
      "key_observation": "The amount or value which a person intending to be a shareholder may pay in excess of the par value for acquiring the shares of a company depends upon the contract between the company and such a person."
    },
    {
      "id": "cr3",
      "text": "A finding that there was before the shares were issued an arrangement between the two transferor companies and the assessee company that the shares were to be issued in consideration of the transfer of assets of unequal book value held by the two transferor companies is clearly implicit in the view expressed by the Tribunal.",
      "addresses_issue": "i1",
      "key_observation": "The High Court was therefore right in holding that the difference between the book value of the assets transferred and the par value of capital stock issued was premium."
    },
    {
      "id": "cr4",
      "text": "Rule 2 does not expressly say that the reserve admissible in the computation of capital should be one built out of profits, and this Court did not suggest that the rule contained such an implication.",
      "addresses_issue": "i2",
      "key_observation": "Observations made by Chagla, J. in Century Spinning Manufacturing Company's case were only made in reference to the facts of the case and were not intended to lay down that reserves built up from sources other than profits will not be admissible for inclusion in capital under r. 2(1) of the Business Profits Tax Act."
    },
    {
      "id": "cr5",
      "text": "The difference between the assets received by the company and the par value of the shares issued cannot be called a book asset brought into existence by creating or increasing by revaluation or otherwise. The assets received by the assessee company are real and tangible assets.",
      "addresses_issue": "i2",
      "key_observation": "The Explanation to r. 2 has no relevance in the present case."
    },
    {
      "id": "cr6",
      "text": "Earned Surplus has, it is true, not been called reserve, but if it is truly a reserve, it must be taken into account in the computation of capital.",
      "addresses_issue": "i3",
      "key_observation": "In the American system of accounting, whatever remains on hand at the end of the year is entered on the liabilities, capital stock and surplus side as Earned Surplus."
    },
    {
      "id": "cr7",
      "text": "The balance of net profits after allocation to specific reserves and payment of dividend are entered in the account under the caption Earned Surplus, it is intended thereby to designate a fund which is to be utilised for the purpose of the business of the assessee. Such a fund may be regarded according to the Indian practice as general reserves.",
      "addresses_issue": "i3",
      "key_observation": "The amounts entered in the account Earned Surplus cannot therefore be regarded as mere unallocated profits at the end of the accounting year."
    }
  ],
  "holdings": [
    {
      "id": "h1",
      "text": "The account Capital Surplus brought in the balance sheet represents premium realised from the issue of its shares within the meaning of r. 3, or in the alternative represents reserves not allowed in computing the profits of the company for the purpose of the Indian Income-tax Act, 1922.",
      "resolves_issue": "i1",
      "in_favor_of": "respondent"
    },
    {
      "id": "h2",
      "text": "The fact that the amount in question had been built up out of capital and not out of taxed profits would not prevent it from being reserve as contemplated by Sub-Rule 1 of Rule 2 of the Schedule II of the Business Profits Tax Act.",
      "resolves_issue": "i2",
      "in_favor_of": "respondent"
    },
    {
      "id": "h3",
      "text": "The sum of 29,000,000 odd, 43,000,000 odd, 56,000,000 odd and 73,000,000 odd for the respective years appearing in the Balance Sheets of the assessee as Earned Surplus would be treated as a reserve within the meaning of Sub-Rule 1 of Rule 2 of the Schedule II of the Business Profits Tax Act.",
      "resolves_issue": "i3",
      "in_favor_of": "respondent"
    }
  ],
  "precedents_cited": [
    {
      "case_name": "Commissioner of Income-tax v. Century Spg. Mfg. Company Ltd.",
      "citation": "20 I.T.R. 260",
      "treatment": "reversed",
      "relevance": "High Court observations on reserves built only out of taxed profits distinguished; Supreme Court reversal clarified that rule does not require reserves to be from profits."
    },
    {
      "case_name": "Commissioner of Income-tax, Bombay City v. Century Spg. Mfg. Co. Ltd.",
      "citation": "1954 S.C.R. 203",
      "treatment": "followed",
      "relevance": "Two essential characteristics for reserves under rule 2: not allowed in computing profits and is a reserve as contemplated; undistributed profits not automatically reserves without clear indication."
    },
    {
      "case_name": "First National City Bank v. Commissioner of Income-tax, Bombay",
      "citation": "1961 3 S.C.R. 371",
      "treatment": "followed",
      "relevance": "Undivided Profits or Earned Surplus under American accounting treated as part of capital fund or reserves; difference in Indian and US accounting systems explained."
    }
  ],
  "statutes_cited": [
    {
      "name": "Business Profits Tax Act, 1947",
      "sections": [
        "s. 4",
        "s. 2(17)",
        "s. 2(1)",
        "s. 19",
        "Sch. II r. 2(1)",
        "Sch. II r. 3",
        "Sch. II Explanation to r. 2"
      ],
      "relevance": "Computation of taxable profits, abatement based on capital (paid-up share capital + reserves not allowed in income-tax profits); premium on shares as part of capital; reserves definition and exclusions."
    },
    {
      "name": "Indian Income-tax Act, 1922",
      "sections": [],
      "relevance": "Reserves not allowed in computing profits for purposes of inclusion in capital under Business Profits Tax Act."
    },
    {
      "name": "Companies Act, 1913",
      "sections": [
        "s. 105A",
        "s. 78(3) of 1956 Act referenced"
      ],
      "relevance": "Shares issued at premium or discount; no restriction on issuing shares at premium for property; reserves set apart before dividend."
    },
    {
      "name": "Companies Act, 1956",
      "sections": [
        "s. 78"
      ],
      "relevance": "Restrictions on application of premiums received on issue of shares; recognizes shares issued at premium under 1913 Act."
    }
  ],
  "outcome": {
    "disposition": "dismissed",
    "summary": "The Supreme Court upheld the Calcutta High Court's affirmative answers to all three questions referred by the Tribunal, holding that Capital paid in Surplus represents premium under Rule 3 Sch. II or alternatively reserves under Rule 2(1), and that it was not built solely from taxed profits preventing its inclusion; Earned Surplus constitutes reserves under Rule 2(1) Sch. II of the Business Profits Tax Act.",
    "relief_granted": "Assessee's claim for inclusion of Capital paid in Surplus and Earned Surplus in computation of capital allowed.",
    "costs": null
  },
  "key_quotes": [
    {
      "text": "So much of the premium realised by a company from the issue of any of its shares as it retained in the business shall be regarded as forming part of its paidup capital for the purposes of rule 2.",
      "speaker": "court",
      "significance": "Direct quote from Rule 3 Sch. II defining premium's treatment in capital computation."
    },
    {
      "text": "A reserve in the sense in which it is used in Rule 2 can only mean profit earned by a company and not distributed as dividends to the shareholders but kept back by the Directors for any purpose to which it may be put in future.",
      "speaker": "petitioner_counsel",
      "significance": "Observation from Century case distinguished by court as not limiting reserves to profits."
    },
    {
      "text": "The amounts entered in the account Earned Surplus cannot therefore be regarded as mere unallocated profits at the end of the accounting year.",
      "speaker": "court",
      "significance": "Key holding on Earned Surplus as specific reserve under US accounting for Rule 2(1)."
    }
  ],
  "_case_id": "1965_351",
  "_label": 0,
  "_text_length": 36064,
  "_extracted_at": "2026-02-10T19:29:02.073162"
}